; ModuleID = 'coreutils-8.32/src/[.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [85 x i8] c"Usage: test EXPRESSION\0A  or:  test\0A  or:  [ EXPRESSION ]\0A  or:  [ ]\0A  or:  [ OPTION\0A\00", align 1
@stdout = external local_unnamed_addr global %struct._IO_FILE*, align 8

!45 = distinct !DICompileUnit(language: DW_LANG_C99, file: !46, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !47, globals: !48, splitDebugInlining: false, nameTableKind: None)
!46 = !DIFile(filename: "src/version.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!47 = !{}
!48 = !{!43}
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "file_name", scope: !53, file: !54, line: 46, type: !49, isLocal: true, isDefinition: true)
!53 = distinct !DICompileUnit(language: DW_LANG_C99, file: !54, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !47, globals: !55, splitDebugInlining: false, nameTableKind: None)
!54 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!55 = !{!51, !56}
!56 = !DIGlobalVariableExpression(var: !57, expr: !DIExpression())
!57 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !53, file: !54, line: 56, type: !58, isLocal: true, isDefinition: true)
!58 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(name: "exit_failure", scope: !61, file: !62, line: 24, type: !64, isLocal: false, isDefinition: true)
!61 = distinct !DICompileUnit(language: DW_LANG_C99, file: !62, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !47, globals: !63, splitDebugInlining: false, nameTableKind: None)
!62 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!63 = !{!59}
!64 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !35)
!65 = !DIGlobalVariableExpression(var: !66, expr: !DIExpression())
!66 = distinct !DIGlobalVariable(name: "program_name", scope: !67, file: !68, line: 33, type: !49, isLocal: false, isDefinition: true)
!67 = distinct !DICompileUnit(language: DW_LANG_C99, file: !68, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !47, retainedTypes: !69, globals: !70, splitDebugInlining: false, nameTableKind: None)
!68 = !DIFile(filename: "lib/progname.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!69 = !{!34, !32}
!70 = !{!65}
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !73, file: !74, line: 85, type: !136, isLocal: false, isDefinition: true)
!73 = distinct !DICompileUnit(language: DW_LANG_C99, file: !74, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !75, retainedTypes: !95, globals: !99, splitDebugInlining: false, nameTableKind: None)
!74 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!75 = !{!76, !90, !16}
!76 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !77, line: 32, baseType: !7, size: 32, elements: !78)
!77 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!78 = !{!79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89}
!79 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!80 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!81 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!82 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!83 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!84 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!85 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!86 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!87 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!88 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!89 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!90 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !77, line: 242, baseType: !7, size: 32, elements: !91)
!91 = !{!92, !93, !94}
!92 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!93 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!94 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!95 = !{!35, !36, !96, !32}
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !97, line: 46, baseType: !98)
!97 = !DIFile(filename: "/usr/lib/clang/12.0.1/include/stddef.h", directory: "")
!98 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!99 = !{!71, !100, !106, !118, !120, !125, !132, !134}
!100 = !DIGlobalVariableExpression(var: !101, expr: !DIExpression())
!101 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !73, file: !74, line: 101, type: !102, isLocal: false, isDefinition: true)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 320, elements: !104)
!103 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!104 = !{!105}
!105 = !DISubrange(count: 10)
!106 = !DIGlobalVariableExpression(var: !107, expr: !DIExpression())
!107 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !73, file: !74, line: 1052, type: !108, isLocal: false, isDefinition: true)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !74, line: 65, size: 448, elements: !109)
!109 = !{!110, !111, !112, !116, !117}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !108, file: !74, line: 68, baseType: !76, size: 32)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !108, file: !74, line: 71, baseType: !35, size: 32, offset: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !108, file: !74, line: 75, baseType: !113, size: 256, offset: 64)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 8)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !108, file: !74, line: 78, baseType: !49, size: 64, offset: 320)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !108, file: !74, line: 81, baseType: !49, size: 64, offset: 384)
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !73, file: !74, line: 116, type: !108, isLocal: true, isDefinition: true)
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(name: "slot0", scope: !73, file: !74, line: 842, type: !122, isLocal: true, isDefinition: true)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 2048, elements: !123)
!123 = !{!124}
!124 = !DISubrange(count: 256)
!125 = !DIGlobalVariableExpression(var: !126, expr: !DIExpression())
!126 = distinct !DIGlobalVariable(name: "slotvec", scope: !73, file: !74, line: 845, type: !127, isLocal: true, isDefinition: true)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !74, line: 834, size: 128, elements: !129)
!129 = !{!130, !131}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !128, file: !74, line: 836, baseType: !96, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !128, file: !74, line: 837, baseType: !32, size: 64, offset: 64)
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(name: "nslots", scope: !73, file: !74, line: 843, type: !35, isLocal: true, isDefinition: true)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(name: "slotvec0", scope: !73, file: !74, line: 844, type: !128, isLocal: true, isDefinition: true)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 704, elements: !138)
!137 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!138 = !{!139}
!139 = !DISubrange(count: 11)
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !142, file: !143, line: 26, type: !145, isLocal: false, isDefinition: true)
!142 = distinct !DICompileUnit(language: DW_LANG_C99, file: !143, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !47, globals: !144, splitDebugInlining: false, nameTableKind: None)
!143 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!144 = !{!140}
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 376, elements: !146)
!146 = !{!147}
!147 = !DISubrange(count: 47)
!148 = distinct !DICompileUnit(language: DW_LANG_C99, file: !149, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !47, retainedTypes: !150, splitDebugInlining: false, nameTableKind: None)
!149 = !DIFile(filename: "lib/umaxtostr.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!150 = !{!151}
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !152, line: 102, baseType: !153)
!152 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !154, line: 73, baseType: !98)
!154 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!155 = distinct !DICompileUnit(language: DW_LANG_C99, file: !156, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !47, retainedTypes: !157, splitDebugInlining: false, nameTableKind: None)
!156 = !DIFile(filename: "lib/strintcmp.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!157 = !{!7}
!158 = distinct !DICompileUnit(language: DW_LANG_C99, file: !159, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !47, splitDebugInlining: false, nameTableKind: None)
!159 = !DIFile(filename: "lib/verror.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!160 = distinct !DICompileUnit(language: DW_LANG_C99, file: !161, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !162, retainedTypes: !166, splitDebugInlining: false, nameTableKind: None)
!161 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!162 = !{!163}
!163 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !161, line: 40, baseType: !7, size: 32, elements: !164)
!164 = !{!165}
!165 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!166 = !{!34}
!167 = distinct !DICompileUnit(language: DW_LANG_C99, file: !168, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !169, retainedTypes: !183, splitDebugInlining: false, nameTableKind: None)
!168 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!169 = !{!170}
!170 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !172, file: !171, line: 186, baseType: !7, size: 32, elements: !181)
!171 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!172 = distinct !DISubprogram(name: "x2nrealloc", scope: !171, file: !171, line: 174, type: !173, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !167, retainedNodes: !176)
!173 = !DISubroutineType(types: !174)
!174 = !{!34, !34, !175, !96}
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!176 = !{!177, !178, !179, !180}
!177 = !DILocalVariable(name: "p", arg: 1, scope: !172, file: !171, line: 174, type: !34)
!178 = !DILocalVariable(name: "pn", arg: 2, scope: !172, file: !171, line: 174, type: !175)
!179 = !DILocalVariable(name: "s", arg: 3, scope: !172, file: !171, line: 174, type: !96)
!180 = !DILocalVariable(name: "n", scope: !172, file: !171, line: 176, type: !96)
!181 = !{!182}
!182 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!183 = !{!96, !32, !34}
!184 = distinct !DICompileUnit(language: DW_LANG_C99, file: !185, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !47, splitDebugInlining: false, nameTableKind: None)
!185 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!186 = distinct !DICompileUnit(language: DW_LANG_C99, file: !187, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !47, retainedTypes: !188, splitDebugInlining: false, nameTableKind: None)
!187 = !DIFile(filename: "lib/xvasprintf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!188 = !{!32}
!189 = distinct !DICompileUnit(language: DW_LANG_C99, file: !190, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !47, retainedTypes: !166, splitDebugInlining: false, nameTableKind: None)
!190 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!191 = distinct !DICompileUnit(language: DW_LANG_C99, file: !192, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !47, retainedTypes: !193, splitDebugInlining: false, nameTableKind: None)
!192 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!193 = !{!96}
!194 = distinct !DICompileUnit(language: DW_LANG_C99, file: !195, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !47, splitDebugInlining: false, nameTableKind: None)
!195 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!196 = distinct !DICompileUnit(language: DW_LANG_C99, file: !197, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !47, splitDebugInlining: false, nameTableKind: None)
!197 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!198 = distinct !DICompileUnit(language: DW_LANG_C99, file: !199, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !200, retainedTypes: !166, splitDebugInlining: false, nameTableKind: None)
!199 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!200 = !{!201}
!201 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !202, line: 41, baseType: !7, size: 32, elements: !203)
!202 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!203 = !{!204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586}
!204 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!205 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!206 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!207 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!208 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!209 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!210 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!211 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!212 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!213 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!214 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!215 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!216 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!217 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!218 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!219 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!220 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!221 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!222 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!223 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!224 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!225 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!226 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!227 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!228 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!229 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!230 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!231 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!232 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!233 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!234 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!235 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!236 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!237 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!238 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!239 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!240 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!241 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!242 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!243 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!244 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!245 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!246 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!247 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!248 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!249 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!250 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!251 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!252 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!253 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!254 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!255 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!256 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!257 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!258 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!259 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!260 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!261 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!262 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!263 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!264 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!265 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!266 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!267 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!268 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!269 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!270 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!271 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!272 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!273 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!274 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!275 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!276 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!277 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!278 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!279 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!280 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!281 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!282 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!283 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!284 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!285 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!286 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!287 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!288 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!289 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!290 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!291 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!292 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!293 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!294 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!295 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!296 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!297 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!298 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!299 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!300 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!301 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!302 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!303 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!304 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!305 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!306 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!307 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!308 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!309 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!310 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!311 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!312 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!313 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!314 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!315 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!316 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!317 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!318 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!319 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!320 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!321 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!322 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!323 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!324 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!325 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!326 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!327 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!328 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!329 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!330 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!331 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!332 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!333 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!334 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!335 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!336 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!337 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!338 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!339 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!340 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!341 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!342 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!343 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!344 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!345 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!346 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!347 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!348 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!349 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!350 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!351 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!352 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!353 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!354 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!355 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!356 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!357 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!358 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!359 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!360 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!361 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!362 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!363 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!364 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!365 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!366 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!367 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!368 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!369 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!370 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!371 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!372 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!373 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!374 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!375 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!376 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!377 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!378 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!379 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!380 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!381 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!382 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!383 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!384 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!385 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!386 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!387 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!388 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!389 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!390 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!391 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!392 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!393 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!394 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!395 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!396 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!397 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!398 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!399 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!400 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!401 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!402 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!403 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!404 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!405 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!406 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!407 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!408 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!409 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!410 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!411 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!412 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!413 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!414 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!415 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!416 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!417 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!418 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!419 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!420 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!421 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!422 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!423 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!424 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!425 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!426 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!427 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!428 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!429 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!430 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!431 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!432 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!433 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!434 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!435 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!436 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!437 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!438 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!439 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!440 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!441 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!442 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!443 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!444 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!445 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!446 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!447 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!448 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!449 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!450 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!451 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!452 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!453 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!454 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!455 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!456 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!457 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!458 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!459 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!460 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!461 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!462 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!463 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!464 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!465 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!466 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!467 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!468 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!469 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!470 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!471 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!472 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!473 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!474 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!475 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!476 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!477 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!478 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!479 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!480 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!481 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!482 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!483 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!484 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!485 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!486 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!487 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!488 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!489 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!490 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!491 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!492 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!493 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!494 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!495 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!496 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!497 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!498 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!499 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!500 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!501 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!502 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!503 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!504 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!505 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!506 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!507 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!508 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!509 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!510 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!511 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!512 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!513 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!514 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!515 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!516 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!517 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!518 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!519 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!520 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!521 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!522 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!523 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!524 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!525 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!526 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!527 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!528 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!529 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!530 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!531 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!532 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!533 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!534 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!535 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!536 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!537 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!538 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!539 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!540 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!541 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!542 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!543 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!544 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!545 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!546 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!547 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!548 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!549 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!550 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!551 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!552 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!553 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!554 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!555 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!556 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!557 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!558 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!559 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!560 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!561 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!562 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!563 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!564 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!565 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!566 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!567 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!568 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!569 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!570 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!571 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!572 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!573 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!574 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!575 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!576 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!577 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!578 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!579 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!580 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!581 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!582 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!583 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!584 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!585 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!586 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!587 = distinct !DICompileUnit(language: DW_LANG_C99, file: !588, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !47, retainedTypes: !166, splitDebugInlining: false, nameTableKind: None)
!588 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!589 = distinct !DICompileUnit(language: DW_LANG_C99, file: !590, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !47, splitDebugInlining: false, nameTableKind: None)
!590 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!591 = distinct !DICompileUnit(language: DW_LANG_C99, file: !592, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !47, retainedTypes: !166, splitDebugInlining: false, nameTableKind: None)
!592 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!593 = distinct !DICompileUnit(language: DW_LANG_C99, file: !594, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !47, retainedTypes: !166, splitDebugInlining: false, nameTableKind: None)
!594 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!595 = !{!"clang version 12.0.1"}
!596 = !{i32 7, !"Dwarf Version", i32 4}
!597 = !{i32 2, !"Debug Info Version", i32 3}
!598 = !{i32 1, !"wchar_size", i32 4}
!599 = !{i32 7, !"PIC Level", i32 2}
!600 = !{i32 7, !"PIE Level", i32 2}
!601 = distinct !DISubprogram(name: "usage", scope: !6, file: !6, line: 684, type: !602, scopeLine: 685, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !604)
!602 = !DISubroutineType(types: !603)
!603 = !{null, !35}
!604 = !{!605}
!605 = !DILocalVariable(name: "status", arg: 1, scope: !601, file: !6, line: 684, type: !35)
!606 = !DILocation(line: 0, scope: !601)
!607 = !DILocation(line: 686, column: 14, scope: !608)
!608 = distinct !DILexicalBlock(scope: !601, file: !6, line: 686, column: 7)
!609 = !DILocation(line: 686, column: 7, scope: !601)
!610 = !DILocation(line: 687, column: 5, scope: !611)
!611 = distinct !DILexicalBlock(scope: !608, file: !6, line: 687, column: 5)
!612 = !{!613, !613, i64 0}
!613 = !{!"any pointer", !614, i64 0}
!614 = !{!"omnipotent char", !615, i64 0}
!615 = !{!"Simple C/C++ TBAA"}
!616 = !DILocation(line: 690, column: 7, scope: !617)
!617 = distinct !DILexicalBlock(scope: !608, file: !6, line: 689, column: 5)
!618 = !DILocation(line: 697, column: 7, scope: !617)
!619 = !DILocation(line: 701, column: 7, scope: !617)
!620 = !DILocation(line: 702, column: 7, scope: !617)
!621 = !DILocation(line: 703, column: 7, scope: !617)
!622 = !DILocation(line: 708, column: 7, scope: !617)
!623 = !DILocation(line: 715, column: 7, scope: !617)
!624 = !DILocation(line: 723, column: 7, scope: !617)
!625 = !DILocation(line: 732, column: 7, scope: !617)
!626 = !DILocation(line: 738, column: 7, scope: !617)
!627 = !DILocation(line: 745, column: 7, scope: !617)
!628 = !DILocation(line: 752, column: 7, scope: !617)
!629 = !DILocation(line: 760, column: 7, scope: !617)
!630 = !DILocation(line: 767, column: 7, scope: !617)
!631 = !DILocation(line: 773, column: 7, scope: !617)
!632 = !DILocation(line: 778, column: 7, scope: !617)
!633 = !DILocation(line: 783, column: 7, scope: !617)
!634 = !DILocalVariable(name: "program", arg: 1, scope: !635, file: !636, line: 634, type: !49)
!635 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !636, file: !636, line: 634, type: !637, scopeLine: 635, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !639)
!636 = !DIFile(filename: "src/system.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!637 = !DISubroutineType(types: !638)
!638 = !{null, !49}
!639 = !{!634, !640, !649, !650, !652}
!640 = !DILocalVariable(name: "infomap", scope: !635, file: !636, line: 636, type: !641)
!641 = !DICompositeType(tag: DW_TAG_array_type, baseType: !642, size: 896, elements: !647)
!642 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !643)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !635, file: !636, line: 636, size: 128, elements: !644)
!644 = !{!645, !646}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !643, file: !636, line: 636, baseType: !49, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !643, file: !636, line: 636, baseType: !49, size: 64, offset: 64)
!647 = !{!648}
!648 = !DISubrange(count: 7)
!649 = !DILocalVariable(name: "node", scope: !635, file: !636, line: 646, type: !49)
!650 = !DILocalVariable(name: "map_prog", scope: !635, file: !636, line: 647, type: !651)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!652 = !DILocalVariable(name: "lc_messages", scope: !635, file: !636, line: 659, type: !49)
!653 = !DILocation(line: 0, scope: !635, inlinedAt: !654)
!654 = distinct !DILocation(line: 784, column: 7, scope: !617)
!655 = !DILocation(line: 636, column: 3, scope: !635, inlinedAt: !654)
!656 = !DILocation(line: 636, column: 67, scope: !635, inlinedAt: !654)
!657 = !DILocation(line: 647, column: 36, scope: !635, inlinedAt: !654)
!658 = !DILocation(line: 649, column: 3, scope: !635, inlinedAt: !654)
!659 = !DILocation(line: 649, column: 33, scope: !635, inlinedAt: !654)
!660 = !DILocation(line: 650, column: 13, scope: !635, inlinedAt: !654)
!661 = !DILocation(line: 649, column: 20, scope: !635, inlinedAt: !654)
!662 = !{!663, !613, i64 0}
!663 = !{!"infomap", !613, i64 0, !613, i64 8}
!664 = !DILocation(line: 649, column: 10, scope: !635, inlinedAt: !654)
!665 = !DILocation(line: 649, column: 28, scope: !635, inlinedAt: !654)
!666 = distinct !{!666, !658, !660, !667}
!667 = !{!"llvm.loop.mustprogress"}
!668 = !DILocation(line: 652, column: 17, scope: !669, inlinedAt: !654)
!669 = distinct !DILexicalBlock(scope: !635, file: !636, line: 652, column: 7)
!670 = !{!663, !613, i64 8}
!671 = !DILocation(line: 652, column: 7, scope: !669, inlinedAt: !654)
!672 = !DILocation(line: 652, column: 7, scope: !635, inlinedAt: !654)
!673 = !DILocation(line: 655, column: 3, scope: !635, inlinedAt: !654)
!674 = !DILocation(line: 659, column: 29, scope: !635, inlinedAt: !654)
!675 = !DILocation(line: 660, column: 7, scope: !676, inlinedAt: !654)
!676 = distinct !DILexicalBlock(scope: !635, file: !636, line: 660, column: 7)
!677 = !DILocation(line: 660, column: 19, scope: !676, inlinedAt: !654)
!678 = !DILocation(line: 660, column: 22, scope: !676, inlinedAt: !654)
!679 = !DILocation(line: 660, column: 7, scope: !635, inlinedAt: !654)
!680 = !DILocation(line: 666, column: 7, scope: !681, inlinedAt: !654)
!681 = distinct !DILexicalBlock(scope: !676, file: !636, line: 661, column: 5)
!682 = !DILocation(line: 668, column: 5, scope: !681, inlinedAt: !654)
!683 = !DILocation(line: 669, column: 3, scope: !635, inlinedAt: !654)
!684 = !DILocation(line: 671, column: 3, scope: !635, inlinedAt: !654)
!685 = !DILocation(line: 673, column: 1, scope: !635, inlinedAt: !654)
!686 = !DILocation(line: 786, column: 3, scope: !601)
!687 = !DISubprogram(name: "dcgettext", scope: !688, file: !688, line: 51, type: !689, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !47)
!688 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!689 = !DISubroutineType(types: !690)
!690 = !{!32, !49, !49, !35}
!691 = !DISubprogram(name: "fputs_unlocked", scope: !692, file: !692, line: 667, type: !693, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !47)
!692 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!693 = !DISubroutineType(types: !694)
!694 = !{!35, !49, !695}
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !697, line: 49, size: 1728, elements: !698)
!697 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!698 = !{!699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !714, !715, !716, !717, !720, !721, !723, !727, !730, !732, !735, !738, !739, !740, !741, !742}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !696, file: !697, line: 51, baseType: !35, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !696, file: !697, line: 54, baseType: !32, size: 64, offset: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !696, file: !697, line: 55, baseType: !32, size: 64, offset: 128)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !696, file: !697, line: 56, baseType: !32, size: 64, offset: 192)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !696, file: !697, line: 57, baseType: !32, size: 64, offset: 256)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !696, file: !697, line: 58, baseType: !32, size: 64, offset: 320)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !696, file: !697, line: 59, baseType: !32, size: 64, offset: 384)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !696, file: !697, line: 60, baseType: !32, size: 64, offset: 448)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !696, file: !697, line: 61, baseType: !32, size: 64, offset: 512)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !696, file: !697, line: 64, baseType: !32, size: 64, offset: 576)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !696, file: !697, line: 65, baseType: !32, size: 64, offset: 640)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !696, file: !697, line: 66, baseType: !32, size: 64, offset: 704)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !696, file: !697, line: 68, baseType: !712, size: 64, offset: 768)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !697, line: 36, flags: DIFlagFwdDecl)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !696, file: !697, line: 70, baseType: !695, size: 64, offset: 832)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !696, file: !697, line: 72, baseType: !35, size: 32, offset: 896)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !696, file: !697, line: 73, baseType: !35, size: 32, offset: 928)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !696, file: !697, line: 74, baseType: !718, size: 64, offset: 960)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !154, line: 152, baseType: !719)
!719 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !696, file: !697, line: 77, baseType: !36, size: 16, offset: 1024)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !696, file: !697, line: 78, baseType: !722, size: 8, offset: 1040)
!722 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !696, file: !697, line: 79, baseType: !724, size: 8, offset: 1048)
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 8, elements: !725)
!725 = !{!726}
!726 = !DISubrange(count: 1)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !696, file: !697, line: 81, baseType: !728, size: 64, offset: 1088)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !697, line: 43, baseType: null)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !696, file: !697, line: 89, baseType: !731, size: 64, offset: 1152)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !154, line: 153, baseType: !719)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !696, file: !697, line: 91, baseType: !733, size: 64, offset: 1216)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !697, line: 37, flags: DIFlagFwdDecl)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !696, file: !697, line: 92, baseType: !736, size: 64, offset: 1280)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !697, line: 38, flags: DIFlagFwdDecl)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !696, file: !697, line: 93, baseType: !695, size: 64, offset: 1344)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !696, file: !697, line: 94, baseType: !34, size: 64, offset: 1408)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !696, file: !697, line: 95, baseType: !96, size: 64, offset: 1472)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !696, file: !697, line: 96, baseType: !35, size: 32, offset: 1536)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !696, file: !697, line: 98, baseType: !743, size: 160, offset: 1568)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 160, elements: !744)
!744 = !{!745}
!745 = !DISubrange(count: 20)
!746 = !DISubprogram(name: "setlocale", scope: !747, file: !747, line: 122, type: !748, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !47)
!747 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!748 = !DISubroutineType(types: !749)
!749 = !{!32, !35, !49}
!750 = distinct !DISubprogram(name: "main", scope: !6, file: !6, line: 805, type: !751, scopeLine: 806, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !753)
!751 = !DISubroutineType(types: !752)
!752 = !{!35, !35, !42}
!753 = !{!754, !755, !756}
!754 = !DILocalVariable(name: "margc", arg: 1, scope: !750, file: !6, line: 805, type: !35)
!755 = !DILocalVariable(name: "margv", arg: 2, scope: !750, file: !6, line: 805, type: !42)
!756 = !DILocalVariable(name: "value", scope: !750, file: !6, line: 807, type: !58)
!757 = !DILocation(line: 0, scope: !750)
!758 = !DILocation(line: 818, column: 21, scope: !750)
!759 = !DILocation(line: 818, column: 3, scope: !750)
!760 = !DILocation(line: 819, column: 3, scope: !750)
!761 = !DILocation(line: 820, column: 3, scope: !750)
!762 = !DILocation(line: 821, column: 3, scope: !750)
!763 = !DILocalVariable(name: "status", arg: 1, scope: !764, file: !636, line: 99, type: !35)
!764 = distinct !DISubprogram(name: "initialize_exit_failure", scope: !636, file: !636, line: 99, type: !602, scopeLine: 100, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !765)
!765 = !{!763}
!766 = !DILocation(line: 0, scope: !764, inlinedAt: !767)
!767 = distinct !DILocation(line: 823, column: 3, scope: !750)
!768 = !DILocation(line: 102, column: 18, scope: !769, inlinedAt: !767)
!769 = distinct !DILexicalBlock(scope: !764, file: !636, line: 101, column: 7)
!770 = !{!771, !771, i64 0}
!771 = !{!"int", !614, i64 0}
!772 = !DILocation(line: 824, column: 3, scope: !750)
!773 = !DILocation(line: 827, column: 8, scope: !750)
!774 = !DILocation(line: 837, column: 17, scope: !775)
!775 = distinct !DILexicalBlock(scope: !776, file: !6, line: 837, column: 11)
!776 = distinct !DILexicalBlock(scope: !777, file: !6, line: 830, column: 5)
!777 = distinct !DILexicalBlock(scope: !750, file: !6, line: 829, column: 7)
!778 = !DILocation(line: 837, column: 11, scope: !776)
!779 = !DILocation(line: 839, column: 15, scope: !780)
!780 = distinct !DILexicalBlock(scope: !781, file: !6, line: 839, column: 15)
!781 = distinct !DILexicalBlock(scope: !775, file: !6, line: 838, column: 9)
!782 = !DILocation(line: 839, column: 15, scope: !781)
!783 = !DILocation(line: 840, column: 13, scope: !780)
!784 = !DILocation(line: 842, column: 15, scope: !785)
!785 = distinct !DILexicalBlock(scope: !781, file: !6, line: 842, column: 15)
!786 = !DILocation(line: 842, column: 15, scope: !781)
!787 = !DILocation(line: 844, column: 28, scope: !788)
!788 = distinct !DILexicalBlock(scope: !785, file: !6, line: 843, column: 13)
!789 = !DILocation(line: 844, column: 64, scope: !788)
!790 = !DILocation(line: 844, column: 15, scope: !788)
!791 = !DILocation(line: 846, column: 15, scope: !788)
!792 = !DILocation(line: 849, column: 17, scope: !793)
!793 = distinct !DILexicalBlock(scope: !776, file: !6, line: 849, column: 11)
!794 = !DILocation(line: 849, column: 21, scope: !793)
!795 = !DILocation(line: 849, column: 25, scope: !793)
!796 = !DILocation(line: 849, column: 11, scope: !776)
!797 = !DILocation(line: 850, column: 28, scope: !793)
!798 = !DILocation(line: 850, column: 45, scope: !793)
!799 = !DILocation(line: 850, column: 9, scope: !793)
!800 = !DILocation(line: 855, column: 8, scope: !750)
!801 = !DILocation(line: 856, column: 7, scope: !750)
!802 = !DILocation(line: 858, column: 11, scope: !803)
!803 = distinct !DILexicalBlock(scope: !750, file: !6, line: 858, column: 7)
!804 = !DILocation(line: 858, column: 7, scope: !750)
!805 = !DILocation(line: 861, column: 27, scope: !750)
!806 = !DILocation(line: 861, column: 11, scope: !750)
!807 = !DILocation(line: 863, column: 7, scope: !808)
!808 = distinct !DILexicalBlock(scope: !750, file: !6, line: 863, column: 7)
!809 = !DILocation(line: 863, column: 14, scope: !808)
!810 = !DILocation(line: 863, column: 11, scope: !808)
!811 = !DILocation(line: 863, column: 7, scope: !750)
!812 = !DILocation(line: 864, column: 24, scope: !808)
!813 = !DILocation(line: 864, column: 55, scope: !808)
!814 = !DILocation(line: 864, column: 60, scope: !808)
!815 = !DILocation(line: 864, column: 48, scope: !808)
!816 = !DILocation(line: 864, column: 5, scope: !808)
!817 = !DILocation(line: 866, column: 3, scope: !750)
!818 = !DILocation(line: 867, column: 1, scope: !750)
!819 = !DISubprogram(name: "bindtextdomain", scope: !688, file: !688, line: 86, type: !820, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !47)
!820 = !DISubroutineType(types: !821)
!821 = !{!32, !49, !49}
!822 = !DISubprogram(name: "textdomain", scope: !688, file: !688, line: 82, type: !823, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !47)
!823 = !DISubroutineType(types: !824)
!824 = !{!32, !49}
!825 = !DISubprogram(name: "atexit", scope: !826, file: !826, line: 595, type: !827, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !47)
!826 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!827 = !DISubroutineType(types: !828)
!828 = !{!35, !829}
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DISubroutineType(types: !831)
!831 = !{null}
!832 = distinct !DISubprogram(name: "test_syntax_error", scope: !6, file: !6, line: 91, type: !833, scopeLine: 92, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !835)
!833 = !DISubroutineType(types: !834)
!834 = !{null, !49, null}
!835 = !{!836, !837}
!836 = !DILocalVariable(name: "format", arg: 1, scope: !832, file: !6, line: 91, type: !49)
!837 = !DILocalVariable(name: "ap", scope: !832, file: !6, line: 93, type: !838)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !692, line: 52, baseType: !839)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !840, line: 32, baseType: !841)
!840 = !DIFile(filename: "/usr/lib/clang/12.0.1/include/stdarg.h", directory: "")
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, baseType: !842)
!842 = !DICompositeType(tag: DW_TAG_array_type, baseType: !843, size: 192, elements: !725)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !844)
!844 = !{!845, !846, !847, !848}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !843, file: !3, line: 93, baseType: !7, size: 32)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !843, file: !3, line: 93, baseType: !7, size: 32, offset: 32)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !843, file: !3, line: 93, baseType: !34, size: 64, offset: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !843, file: !3, line: 93, baseType: !34, size: 64, offset: 128)
!849 = !DILocation(line: 0, scope: !832)
!850 = !DILocation(line: 93, column: 3, scope: !832)
!851 = !DILocation(line: 93, column: 11, scope: !832)
!852 = !DILocation(line: 94, column: 3, scope: !832)
!853 = !DILocation(line: 95, column: 3, scope: !832)
!854 = !DILocation(line: 96, column: 3, scope: !832)
!855 = distinct !DISubprogram(name: "posixtest", scope: !6, file: !6, line: 638, type: !856, scopeLine: 639, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !858)
!856 = !DISubroutineType(types: !857)
!857 = !{!58, !35}
!858 = !{!859, !860}
!859 = !DILocalVariable(name: "nargs", arg: 1, scope: !855, file: !6, line: 638, type: !35)
!860 = !DILocalVariable(name: "value", scope: !855, file: !6, line: 640, type: !58)
!861 = !DILocation(line: 0, scope: !855)
!862 = !DILocation(line: 642, column: 3, scope: !855)
!863 = !DILocation(line: 587, column: 10, scope: !864, inlinedAt: !867)
!864 = distinct !DISubprogram(name: "one_argument", scope: !6, file: !6, line: 585, type: !865, scopeLine: 586, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !47)
!865 = !DISubroutineType(types: !866)
!866 = !{!58}
!867 = distinct !DILocation(line: 645, column: 17, scope: !868)
!868 = distinct !DILexicalBlock(scope: !855, file: !6, line: 643, column: 5)
!869 = !DILocation(line: 587, column: 18, scope: !864, inlinedAt: !867)
!870 = !{!614, !614, i64 0}
!871 = !DILocation(line: 587, column: 25, scope: !864, inlinedAt: !867)
!872 = !DILocation(line: 646, column: 9, scope: !868)
!873 = !DILocation(line: 595, column: 7, scope: !874, inlinedAt: !878)
!874 = distinct !DILexicalBlock(scope: !875, file: !6, line: 595, column: 7)
!875 = distinct !DISubprogram(name: "two_arguments", scope: !6, file: !6, line: 591, type: !865, scopeLine: 592, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !876)
!876 = !{!877}
!877 = !DILocalVariable(name: "value", scope: !875, file: !6, line: 593, type: !58)
!878 = distinct !DILocation(line: 649, column: 17, scope: !868)
!879 = !DILocation(line: 595, column: 7, scope: !875, inlinedAt: !878)
!880 = !DILocalVariable(name: "f", arg: 1, scope: !881, file: !6, line: 104, type: !58)
!881 = distinct !DISubprogram(name: "advance", scope: !6, file: !6, line: 104, type: !882, scopeLine: 105, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !884)
!882 = !DISubroutineType(types: !883)
!883 = !{null, !58}
!884 = !{!880}
!885 = !DILocation(line: 0, scope: !881, inlinedAt: !886)
!886 = distinct !DILocation(line: 597, column: 7, scope: !887, inlinedAt: !878)
!887 = distinct !DILexicalBlock(scope: !874, file: !6, line: 596, column: 5)
!888 = !DILocation(line: 106, column: 3, scope: !881, inlinedAt: !886)
!889 = !DILocation(line: 587, column: 18, scope: !864, inlinedAt: !890)
!890 = distinct !DILocation(line: 598, column: 17, scope: !887, inlinedAt: !878)
!891 = !DILocation(line: 587, column: 10, scope: !864, inlinedAt: !890)
!892 = !DILocation(line: 587, column: 25, scope: !864, inlinedAt: !890)
!893 = !DILocation(line: 0, scope: !875, inlinedAt: !878)
!894 = !DILocation(line: 599, column: 5, scope: !887, inlinedAt: !878)
!895 = !DILocation(line: 600, column: 12, scope: !896, inlinedAt: !878)
!896 = distinct !DILexicalBlock(scope: !874, file: !6, line: 600, column: 12)
!897 = !DILocation(line: 600, column: 25, scope: !896, inlinedAt: !878)
!898 = !DILocation(line: 601, column: 12, scope: !896, inlinedAt: !878)
!899 = !DILocation(line: 601, column: 15, scope: !896, inlinedAt: !878)
!900 = !DILocation(line: 601, column: 28, scope: !896, inlinedAt: !878)
!901 = !DILocation(line: 602, column: 12, scope: !896, inlinedAt: !878)
!902 = !DILocation(line: 602, column: 15, scope: !896, inlinedAt: !878)
!903 = !DILocation(line: 602, column: 28, scope: !896, inlinedAt: !878)
!904 = !DILocation(line: 600, column: 12, scope: !874, inlinedAt: !878)
!905 = !DILocation(line: 604, column: 15, scope: !906, inlinedAt: !878)
!906 = distinct !DILexicalBlock(scope: !896, file: !6, line: 603, column: 5)
!907 = !DILocation(line: 607, column: 5, scope: !896, inlinedAt: !878)
!908 = !DILocation(line: 653, column: 17, scope: !868)
!909 = !DILocation(line: 654, column: 9, scope: !868)
!910 = !DILocation(line: 657, column: 13, scope: !911)
!911 = distinct !DILexicalBlock(scope: !868, file: !6, line: 657, column: 13)
!912 = !DILocation(line: 657, column: 13, scope: !868)
!913 = !DILocation(line: 0, scope: !881, inlinedAt: !914)
!914 = distinct !DILocation(line: 659, column: 13, scope: !915)
!915 = distinct !DILexicalBlock(scope: !911, file: !6, line: 658, column: 11)
!916 = !DILocation(line: 106, column: 3, scope: !881, inlinedAt: !914)
!917 = !DILocation(line: 108, column: 9, scope: !918, inlinedAt: !914)
!918 = distinct !DILexicalBlock(scope: !881, file: !6, line: 108, column: 7)
!919 = !DILocation(line: 109, column: 5, scope: !918, inlinedAt: !914)
!920 = !DILocation(line: 660, column: 22, scope: !915)
!921 = !DILocation(line: 660, column: 21, scope: !915)
!922 = !DILocation(line: 661, column: 13, scope: !915)
!923 = !DILocation(line: 663, column: 13, scope: !924)
!924 = distinct !DILexicalBlock(scope: !868, file: !6, line: 663, column: 13)
!925 = !DILocation(line: 663, column: 36, scope: !924)
!926 = !DILocation(line: 663, column: 39, scope: !924)
!927 = !DILocation(line: 663, column: 13, scope: !868)
!928 = !DILocation(line: 0, scope: !881, inlinedAt: !929)
!929 = distinct !DILocation(line: 665, column: 13, scope: !930)
!930 = distinct !DILexicalBlock(scope: !924, file: !6, line: 664, column: 11)
!931 = !DILocation(line: 106, column: 3, scope: !881, inlinedAt: !929)
!932 = !DILocation(line: 595, column: 7, scope: !874, inlinedAt: !933)
!933 = distinct !DILocation(line: 666, column: 21, scope: !930)
!934 = !DILocation(line: 595, column: 7, scope: !875, inlinedAt: !933)
!935 = !DILocation(line: 0, scope: !881, inlinedAt: !936)
!936 = distinct !DILocation(line: 597, column: 7, scope: !887, inlinedAt: !933)
!937 = !DILocation(line: 106, column: 3, scope: !881, inlinedAt: !936)
!938 = !DILocation(line: 587, column: 10, scope: !864, inlinedAt: !939)
!939 = distinct !DILocation(line: 598, column: 17, scope: !887, inlinedAt: !933)
!940 = !DILocation(line: 587, column: 25, scope: !864, inlinedAt: !939)
!941 = !DILocation(line: 0, scope: !875, inlinedAt: !933)
!942 = !DILocation(line: 599, column: 5, scope: !887, inlinedAt: !933)
!943 = !DILocation(line: 600, column: 12, scope: !896, inlinedAt: !933)
!944 = !DILocation(line: 600, column: 25, scope: !896, inlinedAt: !933)
!945 = !DILocation(line: 601, column: 12, scope: !896, inlinedAt: !933)
!946 = !DILocation(line: 601, column: 15, scope: !896, inlinedAt: !933)
!947 = !DILocation(line: 601, column: 28, scope: !896, inlinedAt: !933)
!948 = !DILocation(line: 602, column: 12, scope: !896, inlinedAt: !933)
!949 = !DILocation(line: 602, column: 15, scope: !896, inlinedAt: !933)
!950 = !DILocation(line: 602, column: 28, scope: !896, inlinedAt: !933)
!951 = !DILocation(line: 600, column: 12, scope: !874, inlinedAt: !933)
!952 = !DILocation(line: 604, column: 15, scope: !906, inlinedAt: !933)
!953 = !DILocation(line: 106, column: 3, scope: !881, inlinedAt: !954)
!954 = distinct !DILocation(line: 667, column: 13, scope: !930)
!955 = !DILocation(line: 607, column: 5, scope: !896, inlinedAt: !933)
!956 = !DILocation(line: 0, scope: !881, inlinedAt: !954)
!957 = !DILocation(line: 668, column: 13, scope: !930)
!958 = !DILocation(line: 673, column: 19, scope: !959)
!959 = distinct !DILexicalBlock(scope: !868, file: !6, line: 673, column: 13)
!960 = !DILocation(line: 673, column: 13, scope: !868)
!961 = !DILocation(line: 578, column: 7, scope: !962, inlinedAt: !964)
!962 = distinct !DILexicalBlock(scope: !963, file: !6, line: 578, column: 7)
!963 = distinct !DISubprogram(name: "expr", scope: !6, file: !6, line: 576, type: !865, scopeLine: 577, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !47)
!964 = distinct !DILocation(line: 675, column: 17, scope: !868)
!965 = !DILocation(line: 674, column: 11, scope: !959)
!966 = !DILocation(line: 578, column: 14, scope: !962, inlinedAt: !964)
!967 = !DILocation(line: 578, column: 11, scope: !962, inlinedAt: !964)
!968 = !DILocation(line: 578, column: 7, scope: !963, inlinedAt: !964)
!969 = !DILocalVariable(name: "value", scope: !970, file: !6, line: 560, type: !58)
!970 = distinct !DISubprogram(name: "or", scope: !6, file: !6, line: 558, type: !865, scopeLine: 559, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !971)
!971 = !{!969}
!972 = !DILocation(line: 0, scope: !970, inlinedAt: !973)
!973 = distinct !DILocation(line: 581, column: 10, scope: !963, inlinedAt: !964)
!974 = !DILocalVariable(name: "value", scope: !975, file: !6, line: 541, type: !58)
!975 = distinct !DISubprogram(name: "and", scope: !6, file: !6, line: 539, type: !865, scopeLine: 540, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !976)
!976 = !{!974}
!977 = !DILocation(line: 0, scope: !975, inlinedAt: !978)
!978 = distinct !DILocation(line: 564, column: 16, scope: !979, inlinedAt: !973)
!979 = distinct !DILexicalBlock(scope: !970, file: !6, line: 563, column: 5)
!980 = !DILocation(line: 545, column: 16, scope: !981, inlinedAt: !978)
!981 = distinct !DILexicalBlock(scope: !975, file: !6, line: 544, column: 5)
!982 = !DILocation(line: 546, column: 14, scope: !983, inlinedAt: !978)
!983 = distinct !DILexicalBlock(scope: !981, file: !6, line: 546, column: 11)
!984 = !DILocation(line: 546, column: 20, scope: !983, inlinedAt: !978)
!985 = !DILocation(line: 546, column: 18, scope: !983, inlinedAt: !978)
!986 = !DILocation(line: 546, column: 25, scope: !983, inlinedAt: !978)
!987 = !DILocation(line: 579, column: 5, scope: !962, inlinedAt: !964)
!988 = !DILocation(line: 546, column: 28, scope: !983, inlinedAt: !978)
!989 = !DILocation(line: 546, column: 11, scope: !981, inlinedAt: !978)
!990 = !DILocation(line: 0, scope: !881, inlinedAt: !991)
!991 = distinct !DILocation(line: 548, column: 7, scope: !981, inlinedAt: !978)
!992 = !DILocation(line: 106, column: 3, scope: !881, inlinedAt: !991)
!993 = !DILocation(line: 545, column: 13, scope: !981, inlinedAt: !978)
!994 = distinct !{!994, !995, !996}
!995 = !DILocation(line: 543, column: 3, scope: !975, inlinedAt: !978)
!996 = !DILocation(line: 549, column: 5, scope: !975, inlinedAt: !978)
!997 = !DILocation(line: 564, column: 13, scope: !979, inlinedAt: !973)
!998 = !DILocation(line: 565, column: 28, scope: !999, inlinedAt: !973)
!999 = distinct !DILexicalBlock(scope: !979, file: !6, line: 565, column: 11)
!1000 = !DILocation(line: 565, column: 11, scope: !979, inlinedAt: !973)
!1001 = !DILocation(line: 0, scope: !881, inlinedAt: !1002)
!1002 = distinct !DILocation(line: 567, column: 7, scope: !979, inlinedAt: !973)
!1003 = !DILocation(line: 106, column: 3, scope: !881, inlinedAt: !1002)
!1004 = distinct !{!1004, !1005, !1006}
!1005 = !DILocation(line: 562, column: 3, scope: !970, inlinedAt: !973)
!1006 = !DILocation(line: 568, column: 5, scope: !970, inlinedAt: !973)
!1007 = !DILocation(line: 678, column: 3, scope: !855)
!1008 = distinct !DISubprogram(name: "unary_operator", scope: !6, file: !6, line: 389, type: !865, scopeLine: 390, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1009)
!1009 = !{!1010, !1047, !1050, !1051, !1055, !1056, !1059, !1060, !1062}
!1010 = !DILocalVariable(name: "stat_buf", scope: !1008, file: !6, line: 391, type: !1011)
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !1012, line: 26, size: 1152, elements: !1013)
!1012 = !DIFile(filename: "/usr/include/bits/struct_stat.h", directory: "")
!1013 = !{!1014, !1016, !1018, !1020, !1022, !1024, !1026, !1027, !1028, !1029, !1031, !1033, !1041, !1042, !1043}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1011, file: !1012, line: 28, baseType: !1015, size: 64)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !154, line: 145, baseType: !98)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1011, file: !1012, line: 33, baseType: !1017, size: 64, offset: 64)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !154, line: 148, baseType: !98)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1011, file: !1012, line: 41, baseType: !1019, size: 64, offset: 128)
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !154, line: 151, baseType: !98)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1011, file: !1012, line: 42, baseType: !1021, size: 32, offset: 192)
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !154, line: 150, baseType: !7)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1011, file: !1012, line: 44, baseType: !1023, size: 32, offset: 224)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !154, line: 146, baseType: !7)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1011, file: !1012, line: 45, baseType: !1025, size: 32, offset: 256)
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !154, line: 147, baseType: !7)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !1011, file: !1012, line: 47, baseType: !35, size: 32, offset: 288)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1011, file: !1012, line: 49, baseType: !1015, size: 64, offset: 320)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1011, file: !1012, line: 54, baseType: !718, size: 64, offset: 384)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1011, file: !1012, line: 58, baseType: !1030, size: 64, offset: 448)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !154, line: 175, baseType: !719)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1011, file: !1012, line: 60, baseType: !1032, size: 64, offset: 512)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !154, line: 180, baseType: !719)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1011, file: !1012, line: 71, baseType: !1034, size: 128, offset: 576)
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !1035, line: 10, size: 128, elements: !1036)
!1035 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!1036 = !{!1037, !1039}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1034, file: !1035, line: 12, baseType: !1038, size: 64)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !154, line: 160, baseType: !719)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1034, file: !1035, line: 16, baseType: !1040, size: 64, offset: 64)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !154, line: 197, baseType: !719)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !1011, file: !1012, line: 72, baseType: !1034, size: 128, offset: 704)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !1011, file: !1012, line: 73, baseType: !1034, size: 128, offset: 832)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !1011, file: !1012, line: 86, baseType: !1044, size: 192, offset: 960)
!1044 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1040, size: 192, elements: !1045)
!1045 = !{!1046}
!1046 = !DISubrange(count: 3)
!1047 = !DILocalVariable(name: "atime", scope: !1048, file: !6, line: 425, type: !1034)
!1048 = distinct !DILexicalBlock(scope: !1049, file: !6, line: 421, column: 7)
!1049 = distinct !DILexicalBlock(scope: !1008, file: !6, line: 394, column: 5)
!1050 = !DILocalVariable(name: "mtime", scope: !1048, file: !6, line: 426, type: !1034)
!1051 = !DILocalVariable(name: "euid", scope: !1052, file: !6, line: 436, type: !1053)
!1052 = distinct !DILexicalBlock(scope: !1049, file: !6, line: 431, column: 7)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !1054, line: 79, baseType: !1023)
!1054 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!1055 = !DILocalVariable(name: "NO_UID", scope: !1052, file: !6, line: 437, type: !1053)
!1056 = !DILocalVariable(name: "egid", scope: !1057, file: !6, line: 447, type: !1058)
!1057 = distinct !DILexicalBlock(scope: !1049, file: !6, line: 442, column: 7)
!1058 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !1054, line: 64, baseType: !1025)
!1059 = !DILocalVariable(name: "NO_GID", scope: !1057, file: !6, line: 448, type: !1058)
!1060 = !DILocalVariable(name: "fd", scope: !1061, file: !6, line: 514, type: !719)
!1061 = distinct !DILexicalBlock(scope: !1049, file: !6, line: 513, column: 7)
!1062 = !DILocalVariable(name: "arg", scope: !1061, file: !6, line: 515, type: !49)
!1063 = !DILocation(line: 391, column: 3, scope: !1008)
!1064 = !DILocation(line: 391, column: 15, scope: !1008)
!1065 = !DILocation(line: 393, column: 11, scope: !1008)
!1066 = !DILocation(line: 393, column: 16, scope: !1008)
!1067 = !DILocation(line: 393, column: 3, scope: !1008)
!1068 = !DILocation(line: 396, column: 26, scope: !1049)
!1069 = !DILocation(line: 396, column: 67, scope: !1049)
!1070 = !DILocation(line: 396, column: 72, scope: !1049)
!1071 = !DILocation(line: 396, column: 60, scope: !1049)
!1072 = !DILocation(line: 396, column: 7, scope: !1049)
!1073 = !DILocation(line: 0, scope: !881, inlinedAt: !1074)
!1074 = distinct !DILocation(line: 115, column: 3, scope: !1075, inlinedAt: !1076)
!1075 = distinct !DISubprogram(name: "unary_advance", scope: !6, file: !6, line: 113, type: !830, scopeLine: 114, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !47)
!1076 = distinct !DILocation(line: 405, column: 7, scope: !1049)
!1077 = !DILocation(line: 106, column: 3, scope: !881, inlinedAt: !1074)
!1078 = !DILocation(line: 108, column: 9, scope: !918, inlinedAt: !1074)
!1079 = !DILocation(line: 109, column: 5, scope: !918, inlinedAt: !1074)
!1080 = !DILocation(line: 116, column: 3, scope: !1075, inlinedAt: !1076)
!1081 = !DILocation(line: 406, column: 20, scope: !1049)
!1082 = !DILocation(line: 406, column: 14, scope: !1049)
!1083 = !DILocation(line: 406, column: 46, scope: !1049)
!1084 = !DILocation(line: 406, column: 7, scope: !1049)
!1085 = !DILocation(line: 0, scope: !881, inlinedAt: !1086)
!1086 = distinct !DILocation(line: 115, column: 3, scope: !1075, inlinedAt: !1087)
!1087 = distinct !DILocation(line: 409, column: 7, scope: !1049)
!1088 = !DILocation(line: 106, column: 3, scope: !881, inlinedAt: !1086)
!1089 = !DILocation(line: 108, column: 9, scope: !918, inlinedAt: !1086)
!1090 = !DILocation(line: 109, column: 5, scope: !918, inlinedAt: !1086)
!1091 = !DILocation(line: 116, column: 3, scope: !1075, inlinedAt: !1087)
!1092 = !DILocation(line: 410, column: 26, scope: !1049)
!1093 = !DILocation(line: 410, column: 14, scope: !1049)
!1094 = !DILocation(line: 410, column: 47, scope: !1049)
!1095 = !DILocation(line: 410, column: 7, scope: !1049)
!1096 = !DILocation(line: 0, scope: !881, inlinedAt: !1097)
!1097 = distinct !DILocation(line: 115, column: 3, scope: !1075, inlinedAt: !1098)
!1098 = distinct !DILocation(line: 413, column: 7, scope: !1049)
!1099 = !DILocation(line: 106, column: 3, scope: !881, inlinedAt: !1097)
!1100 = !DILocation(line: 108, column: 9, scope: !918, inlinedAt: !1097)
!1101 = !DILocation(line: 109, column: 5, scope: !918, inlinedAt: !1097)
!1102 = !DILocation(line: 116, column: 3, scope: !1075, inlinedAt: !1098)
!1103 = !DILocation(line: 414, column: 26, scope: !1049)
!1104 = !DILocation(line: 414, column: 14, scope: !1049)
!1105 = !DILocation(line: 414, column: 47, scope: !1049)
!1106 = !DILocation(line: 414, column: 7, scope: !1049)
!1107 = !DILocation(line: 0, scope: !881, inlinedAt: !1108)
!1108 = distinct !DILocation(line: 115, column: 3, scope: !1075, inlinedAt: !1109)
!1109 = distinct !DILocation(line: 417, column: 7, scope: !1049)
!1110 = !DILocation(line: 106, column: 3, scope: !881, inlinedAt: !1108)
!1111 = !DILocation(line: 108, column: 9, scope: !918, inlinedAt: !1108)
!1112 = !DILocation(line: 109, column: 5, scope: !918, inlinedAt: !1108)
!1113 = !DILocation(line: 116, column: 3, scope: !1075, inlinedAt: !1109)
!1114 = !DILocation(line: 418, column: 26, scope: !1049)
!1115 = !DILocation(line: 418, column: 14, scope: !1049)
!1116 = !DILocation(line: 418, column: 47, scope: !1049)
!1117 = !DILocation(line: 418, column: 7, scope: !1049)
!1118 = !DILocation(line: 0, scope: !881, inlinedAt: !1119)
!1119 = distinct !DILocation(line: 115, column: 3, scope: !1075, inlinedAt: !1120)
!1120 = distinct !DILocation(line: 422, column: 9, scope: !1048)
!1121 = !DILocation(line: 106, column: 3, scope: !881, inlinedAt: !1119)
!1122 = !DILocation(line: 108, column: 9, scope: !918, inlinedAt: !1119)
!1123 = !DILocation(line: 109, column: 5, scope: !918, inlinedAt: !1119)
!1124 = !DILocation(line: 116, column: 3, scope: !1075, inlinedAt: !1120)
!1125 = !DILocation(line: 423, column: 19, scope: !1126)
!1126 = distinct !DILexicalBlock(scope: !1048, file: !6, line: 423, column: 13)
!1127 = !DILocation(line: 423, column: 13, scope: !1126)
!1128 = !DILocation(line: 423, column: 45, scope: !1126)
!1129 = !DILocation(line: 423, column: 13, scope: !1048)
!1130 = !DILocalVariable(name: "st", arg: 1, scope: !1131, file: !1132, line: 118, type: !1135)
!1131 = distinct !DISubprogram(name: "get_stat_atime", scope: !1132, file: !1132, line: 118, type: !1133, scopeLine: 119, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1137)
!1132 = !DIFile(filename: "./lib/stat-time.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1133 = !DISubroutineType(types: !1134)
!1134 = !{!1034, !1135}
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64)
!1136 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1011)
!1137 = !{!1130}
!1138 = !DILocation(line: 0, scope: !1131, inlinedAt: !1139)
!1139 = distinct !DILocation(line: 425, column: 33, scope: !1048)
!1140 = !DILocation(line: 121, column: 10, scope: !1131, inlinedAt: !1139)
!1141 = !{i64 0, i64 8, !1142, i64 8, i64 8, !1142}
!1142 = !{!1143, !1143, i64 0}
!1143 = !{!"long", !614, i64 0}
!1144 = !{i64 0, i64 8, !1142}
!1145 = !DILocation(line: 0, scope: !1048)
!1146 = !DILocalVariable(name: "st", arg: 1, scope: !1147, file: !1132, line: 146, type: !1135)
!1147 = distinct !DISubprogram(name: "get_stat_mtime", scope: !1132, file: !1132, line: 146, type: !1133, scopeLine: 147, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1148)
!1148 = !{!1146}
!1149 = !DILocation(line: 0, scope: !1147, inlinedAt: !1150)
!1150 = distinct !DILocation(line: 426, column: 33, scope: !1048)
!1151 = !DILocation(line: 149, column: 10, scope: !1147, inlinedAt: !1150)
!1152 = !DILocalVariable(name: "a", arg: 1, scope: !1153, file: !13, line: 89, type: !1034)
!1153 = distinct !DISubprogram(name: "timespec_cmp", scope: !13, file: !13, line: 89, type: !1154, scopeLine: 90, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1156)
!1154 = !DISubroutineType(types: !1155)
!1155 = !{!35, !1034, !1034}
!1156 = !{!1152, !1157}
!1157 = !DILocalVariable(name: "b", arg: 2, scope: !1153, file: !13, line: 89, type: !1034)
!1158 = !DILocation(line: 0, scope: !1153, inlinedAt: !1159)
!1159 = distinct !DILocation(line: 427, column: 17, scope: !1048)
!1160 = !DILocation(line: 91, column: 16, scope: !1161, inlinedAt: !1159)
!1161 = distinct !DILexicalBlock(scope: !1153, file: !13, line: 91, column: 7)
!1162 = !DILocation(line: 91, column: 7, scope: !1153, inlinedAt: !1159)
!1163 = !DILocation(line: 93, column: 16, scope: !1164, inlinedAt: !1159)
!1164 = distinct !DILexicalBlock(scope: !1153, file: !13, line: 93, column: 7)
!1165 = !DILocation(line: 93, column: 7, scope: !1153, inlinedAt: !1159)
!1166 = !DILocation(line: 98, column: 3, scope: !1153, inlinedAt: !1159)
!1167 = !DILocation(line: 99, column: 3, scope: !1153, inlinedAt: !1159)
!1168 = !DILocation(line: 101, column: 20, scope: !1153, inlinedAt: !1159)
!1169 = !DILocation(line: 101, column: 10, scope: !1153, inlinedAt: !1159)
!1170 = !DILocation(line: 101, column: 3, scope: !1153, inlinedAt: !1159)
!1171 = !DILocation(line: 0, scope: !881, inlinedAt: !1172)
!1172 = distinct !DILocation(line: 115, column: 3, scope: !1075, inlinedAt: !1173)
!1173 = distinct !DILocation(line: 432, column: 9, scope: !1052)
!1174 = !DILocation(line: 106, column: 3, scope: !881, inlinedAt: !1172)
!1175 = !DILocation(line: 108, column: 9, scope: !918, inlinedAt: !1172)
!1176 = !DILocation(line: 109, column: 5, scope: !918, inlinedAt: !1172)
!1177 = !DILocation(line: 116, column: 3, scope: !1075, inlinedAt: !1173)
!1178 = !DILocation(line: 433, column: 19, scope: !1179)
!1179 = distinct !DILexicalBlock(scope: !1052, file: !6, line: 433, column: 13)
!1180 = !DILocation(line: 433, column: 13, scope: !1179)
!1181 = !DILocation(line: 433, column: 45, scope: !1179)
!1182 = !DILocation(line: 433, column: 13, scope: !1052)
!1183 = !DILocation(line: 435, column: 9, scope: !1052)
!1184 = !DILocation(line: 435, column: 15, scope: !1052)
!1185 = !DILocation(line: 436, column: 22, scope: !1052)
!1186 = !DILocation(line: 0, scope: !1052)
!1187 = !DILocation(line: 438, column: 24, scope: !1052)
!1188 = !DILocation(line: 438, column: 34, scope: !1052)
!1189 = !DILocation(line: 438, column: 37, scope: !1052)
!1190 = !DILocation(line: 438, column: 44, scope: !1052)
!1191 = !DILocation(line: 438, column: 64, scope: !1052)
!1192 = !{!1193, !771, i64 28}
!1193 = !{!"stat", !1143, i64 0, !1143, i64 8, !1143, i64 16, !771, i64 24, !771, i64 28, !771, i64 32, !771, i64 36, !1143, i64 40, !1143, i64 48, !1143, i64 56, !1143, i64 64, !1194, i64 72, !1194, i64 88, !1194, i64 104, !614, i64 120}
!1194 = !{!"timespec", !1143, i64 0, !1143, i64 8}
!1195 = !DILocation(line: 438, column: 52, scope: !1052)
!1196 = !DILocation(line: 0, scope: !881, inlinedAt: !1197)
!1197 = distinct !DILocation(line: 115, column: 3, scope: !1075, inlinedAt: !1198)
!1198 = distinct !DILocation(line: 443, column: 9, scope: !1057)
!1199 = !DILocation(line: 106, column: 3, scope: !881, inlinedAt: !1197)
!1200 = !DILocation(line: 108, column: 9, scope: !918, inlinedAt: !1197)
!1201 = !DILocation(line: 109, column: 5, scope: !918, inlinedAt: !1197)
!1202 = !DILocation(line: 116, column: 3, scope: !1075, inlinedAt: !1198)
!1203 = !DILocation(line: 444, column: 19, scope: !1204)
!1204 = distinct !DILexicalBlock(scope: !1057, file: !6, line: 444, column: 13)
!1205 = !DILocation(line: 444, column: 13, scope: !1204)
!1206 = !DILocation(line: 444, column: 45, scope: !1204)
!1207 = !DILocation(line: 444, column: 13, scope: !1057)
!1208 = !DILocation(line: 446, column: 9, scope: !1057)
!1209 = !DILocation(line: 446, column: 15, scope: !1057)
!1210 = !DILocation(line: 447, column: 22, scope: !1057)
!1211 = !DILocation(line: 0, scope: !1057)
!1212 = !DILocation(line: 449, column: 24, scope: !1057)
!1213 = !DILocation(line: 449, column: 34, scope: !1057)
!1214 = !DILocation(line: 449, column: 37, scope: !1057)
!1215 = !DILocation(line: 449, column: 44, scope: !1057)
!1216 = !DILocation(line: 449, column: 64, scope: !1057)
!1217 = !{!1193, !771, i64 32}
!1218 = !DILocation(line: 449, column: 52, scope: !1057)
!1219 = !DILocation(line: 0, scope: !881, inlinedAt: !1220)
!1220 = distinct !DILocation(line: 115, column: 3, scope: !1075, inlinedAt: !1221)
!1221 = distinct !DILocation(line: 453, column: 7, scope: !1049)
!1222 = !DILocation(line: 106, column: 3, scope: !881, inlinedAt: !1220)
!1223 = !DILocation(line: 108, column: 9, scope: !918, inlinedAt: !1220)
!1224 = !DILocation(line: 109, column: 5, scope: !918, inlinedAt: !1220)
