source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.infomap = type { i8*, i8* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [85 x i8] c"Usage: test EXPRESSION\0A  or:  test\0A  or:  [ EXPRESSION ]\0A  or:  [ ]\0A  or:  [ OPTION\0A\00", align 1
@stdout = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str.2 = private unnamed_addr constant [49 x i8] c"Exit with the status determined by EXPRESSION.\0A\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "argv", scope: !2, file: !6, line: 73, type: !170, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !31, globals: !165, nameTableKind: None)
!3 = !DIFile(filename: "src/lbracket.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !12, !16}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 59, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "src/test.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "TEST_TRUE", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "TEST_FALSE", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "TEST_FAILURE", value: 2, isUnsigned: true)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !13, line: 42, baseType: !7, size: 32, elements: !14)
!13 = !DIFile(filename: "./lib/timespec.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!14 = !{!15}
!15 = !DIEnumerator(name: "TIMESPEC_HZ", value: 1000000000, isUnsigned: true)
!16 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !17, line: 46, baseType: !7, size: 32, elements: !18)
!17 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!18 = !{!19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30}
!19 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!21 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!22 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!23 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!24 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!25 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!26 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!27 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!28 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!29 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!30 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!31 = !{!32, !42, !103, !107, !111, !114, !117, !36, !93, !124, !128, !132, !143, !147, !150, !151, !40, !73, !7, !154, !158, !162}
!32 = !DISubprogram(name: "dcgettext", scope: !33, file: !33, line: 51, type: !34, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!33 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!34 = !DISubroutineType(types: !35)
!35 = !{!36, !38, !38, !40}
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!40 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!41 = !{}
!42 = !DISubprogram(name: "fputs_unlocked", scope: !43, file: !43, line: 662, type: !44, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!43 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!44 = !DISubroutineType(types: !45)
!45 = !{!40, !38, !46}
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !48, line: 49, size: 1728, elements: !49)
!48 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!49 = !{!50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !65, !66, !67, !68, !72, !74, !76, !80, !83, !85, !88, !91, !92, !94, !98, !99}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !47, file: !48, line: 51, baseType: !40, size: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !47, file: !48, line: 54, baseType: !36, size: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !47, file: !48, line: 55, baseType: !36, size: 64, offset: 128)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !47, file: !48, line: 56, baseType: !36, size: 64, offset: 192)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !47, file: !48, line: 57, baseType: !36, size: 64, offset: 256)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !47, file: !48, line: 58, baseType: !36, size: 64, offset: 320)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !47, file: !48, line: 59, baseType: !36, size: 64, offset: 384)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !47, file: !48, line: 60, baseType: !36, size: 64, offset: 448)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !47, file: !48, line: 61, baseType: !36, size: 64, offset: 512)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !47, file: !48, line: 64, baseType: !36, size: 64, offset: 576)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !47, file: !48, line: 65, baseType: !36, size: 64, offset: 640)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !47, file: !48, line: 66, baseType: !36, size: 64, offset: 704)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !47, file: !48, line: 68, baseType: !63, size: 64, offset: 768)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !48, line: 36, flags: DIFlagFwdDecl)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !47, file: !48, line: 70, baseType: !46, size: 64, offset: 832)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !47, file: !48, line: 72, baseType: !40, size: 32, offset: 896)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !47, file: !48, line: 73, baseType: !40, size: 32, offset: 928)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !47, file: !48, line: 74, baseType: !69, size: 64, offset: 960)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !70, line: 152, baseType: !71)
!70 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!71 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !47, file: !48, line: 77, baseType: !73, size: 16, offset: 1024)
!73 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !47, file: !48, line: 78, baseType: !75, size: 8, offset: 1040)
!75 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !47, file: !48, line: 79, baseType: !77, size: 8, offset: 1048)
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 8, elements: !78)
!78 = !{!79}
!79 = !DISubrange(count: 1)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !47, file: !48, line: 81, baseType: !81, size: 64, offset: 1088)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !48, line: 43, baseType: null)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !47, file: !48, line: 89, baseType: !84, size: 64, offset: 1152)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !70, line: 153, baseType: !71)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !47, file: !48, line: 91, baseType: !86, size: 64, offset: 1216)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !48, line: 37, flags: DIFlagFwdDecl)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !47, file: !48, line: 92, baseType: !89, size: 64, offset: 1280)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !48, line: 38, flags: DIFlagFwdDecl)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !47, file: !48, line: 93, baseType: !46, size: 64, offset: 1344)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !47, file: !48, line: 94, baseType: !93, size: 64, offset: 1408)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !47, file: !48, line: 95, baseType: !95, size: 64, offset: 1472)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !96, line: 46, baseType: !97)
!96 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!97 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !47, file: !48, line: 96, baseType: !40, size: 32, offset: 1536)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !47, file: !48, line: 98, baseType: !100, size: 160, offset: 1568)
!100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 160, elements: !101)
!101 = !{!102}
!102 = !DISubrange(count: 20)
!103 = !DISubprogram(name: "set_program_name", scope: !104, file: !104, line: 37, type: !105, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!104 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!105 = !DISubroutineType(types: !106)
!106 = !{null, !38}
!107 = !DISubprogram(name: "setlocale", scope: !108, file: !108, line: 122, type: !109, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!108 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!109 = !DISubroutineType(types: !110)
!110 = !{!36, !40, !38}
!111 = !DISubprogram(name: "bindtextdomain", scope: !33, file: !33, line: 86, type: !112, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!112 = !DISubroutineType(types: !113)
!113 = !{!36, !38, !38}
!114 = !DISubprogram(name: "textdomain", scope: !33, file: !33, line: 82, type: !115, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!115 = !DISubroutineType(types: !116)
!116 = !{!36, !38}
!117 = !DISubprogram(name: "atexit", scope: !118, file: !118, line: 595, type: !119, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!118 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!119 = !DISubroutineType(types: !120)
!120 = !{!40, !121}
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{null}
!124 = !DISubprogram(name: "version_etc", scope: !125, file: !125, line: 69, type: !126, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!125 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!126 = !DISubroutineType(types: !127)
!127 = !{null, !46, !38, !38, !38, null}
!128 = !DISubprogram(name: "quote", scope: !129, file: !129, line: 44, type: !130, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!129 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!130 = !DISubroutineType(types: !131)
!131 = !{!38, !38}
!132 = !DISubprogram(name: "verror", scope: !133, file: !133, line: 34, type: !134, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!133 = !DIFile(filename: "./lib/verror.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!134 = !DISubroutineType(types: !135)
!135 = !{null, !40, !40, !38, !136}
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 93, size: 192, elements: !138)
!138 = !{!139, !140, !141, !142}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !137, file: !3, line: 93, baseType: !7, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !137, file: !3, line: 93, baseType: !7, size: 32, offset: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !137, file: !3, line: 93, baseType: !93, size: 64, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !137, file: !3, line: 93, baseType: !93, size: 64, offset: 128)
!143 = !DISubprogram(name: "euidaccess", scope: !144, file: !144, line: 292, type: !145, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!144 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!145 = !DISubroutineType(types: !146)
!146 = !{!40, !38, !40}
!147 = !DISubprogram(name: "geteuid", scope: !144, file: !144, line: 678, type: !148, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!148 = !DISubroutineType(types: !149)
!149 = !{!7}
!150 = !DISubprogram(name: "getegid", scope: !144, file: !144, line: 684, type: !148, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!151 = !DISubprogram(name: "isatty", scope: !144, file: !144, line: 779, type: !152, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!152 = !DISubroutineType(types: !153)
!153 = !{!40, !40}
!154 = !DISubprogram(name: "umaxtostr", scope: !155, file: !155, line: 46, type: !156, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!155 = !DIFile(filename: "./lib/inttostr.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!156 = !DISubroutineType(types: !157)
!157 = !{!36, !97, !36}
!158 = !DISubprogram(name: "strintcmp", scope: !159, file: !159, line: 1, type: !160, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!159 = !DIFile(filename: "./lib/strnumcmp.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!160 = !DISubroutineType(types: !161)
!161 = !{!40, !38, !38}
!162 = !DISubprogram(name: "quote_n", scope: !129, file: !129, line: 40, type: !163, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!163 = !DISubroutineType(types: !164)
!164 = !{!38, !40, !38}
!165 = !{!166, !168, !0}
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "pos", scope: !2, file: !6, line: 71, type: !40, isLocal: true, isDefinition: true)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "argc", scope: !2, file: !6, line: 72, type: !40, isLocal: true, isDefinition: true)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(name: "Version", scope: !173, file: !174, line: 2, type: !38, isDefinition: true)
!173 = distinct !DICompileUnit(language: DW_LANG_C99, file: !174, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !41, globals: !175, nameTableKind: None)
!174 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!175 = !{!171}
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(name: "file_name", scope: !178, file: !179, line: 46, type: !38, isLocal: true, isDefinition: true)
!178 = distinct !DICompileUnit(language: DW_LANG_C99, file: !179, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !41, retainedTypes: !180, globals: !223, nameTableKind: None)
!179 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!180 = !{!181, !32, !217, !219}
!181 = !DISubprogram(name: "close_stream", scope: !182, file: !182, line: 2, type: !183, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!182 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!183 = !DISubroutineType(types: !184)
!184 = !{!40, !185}
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !48, line: 49, size: 1728, elements: !187)
!187 = !{!188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !186, file: !48, line: 51, baseType: !40, size: 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !186, file: !48, line: 54, baseType: !36, size: 64, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !186, file: !48, line: 55, baseType: !36, size: 64, offset: 128)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !186, file: !48, line: 56, baseType: !36, size: 64, offset: 192)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !186, file: !48, line: 57, baseType: !36, size: 64, offset: 256)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !186, file: !48, line: 58, baseType: !36, size: 64, offset: 320)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !186, file: !48, line: 59, baseType: !36, size: 64, offset: 384)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !186, file: !48, line: 60, baseType: !36, size: 64, offset: 448)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !186, file: !48, line: 61, baseType: !36, size: 64, offset: 512)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !186, file: !48, line: 64, baseType: !36, size: 64, offset: 576)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !186, file: !48, line: 65, baseType: !36, size: 64, offset: 640)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !186, file: !48, line: 66, baseType: !36, size: 64, offset: 704)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !186, file: !48, line: 68, baseType: !63, size: 64, offset: 768)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !186, file: !48, line: 70, baseType: !185, size: 64, offset: 832)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !186, file: !48, line: 72, baseType: !40, size: 32, offset: 896)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !186, file: !48, line: 73, baseType: !40, size: 32, offset: 928)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !186, file: !48, line: 74, baseType: !69, size: 64, offset: 960)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !186, file: !48, line: 77, baseType: !73, size: 16, offset: 1024)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !186, file: !48, line: 78, baseType: !75, size: 8, offset: 1040)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !186, file: !48, line: 79, baseType: !77, size: 8, offset: 1048)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !186, file: !48, line: 81, baseType: !81, size: 64, offset: 1088)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !186, file: !48, line: 89, baseType: !84, size: 64, offset: 1152)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !186, file: !48, line: 91, baseType: !86, size: 64, offset: 1216)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !186, file: !48, line: 92, baseType: !89, size: 64, offset: 1280)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !186, file: !48, line: 93, baseType: !185, size: 64, offset: 1344)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !186, file: !48, line: 94, baseType: !93, size: 64, offset: 1408)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !186, file: !48, line: 95, baseType: !95, size: 64, offset: 1472)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !186, file: !48, line: 96, baseType: !40, size: 32, offset: 1536)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !186, file: !48, line: 98, baseType: !100, size: 160, offset: 1568)
!217 = !DISubprogram(name: "quotearg_colon", scope: !218, file: !218, line: 391, type: !115, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!218 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!219 = !DISubprogram(name: "error", scope: !220, file: !220, line: 52, type: !221, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!220 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!221 = !DISubroutineType(types: !222)
!222 = !{null, !40, !40, !38, null}
!223 = !{!176, !224}
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !178, file: !179, line: 56, type: !226, isLocal: true, isDefinition: true)
!226 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(name: "exit_failure", scope: !229, file: !230, line: 24, type: !232, isDefinition: true)
!229 = distinct !DICompileUnit(language: DW_LANG_C99, file: !230, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !41, globals: !231, nameTableKind: None)
!230 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!231 = !{!227}
!232 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !40)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(name: "program_name", scope: !235, file: !236, line: 33, type: !38, isDefinition: true)
!235 = distinct !DICompileUnit(language: DW_LANG_C99, file: !236, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !41, retainedTypes: !237, globals: !273, nameTableKind: None)
!236 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!237 = !{!93, !238, !36}
!238 = !DISubprogram(name: "fputs", scope: !43, file: !43, line: 626, type: !239, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!239 = !DISubroutineType(types: !240)
!240 = !{!40, !38, !241}
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !48, line: 49, size: 1728, elements: !243)
!243 = !{!244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !242, file: !48, line: 51, baseType: !40, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !242, file: !48, line: 54, baseType: !36, size: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !242, file: !48, line: 55, baseType: !36, size: 64, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !242, file: !48, line: 56, baseType: !36, size: 64, offset: 192)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !242, file: !48, line: 57, baseType: !36, size: 64, offset: 256)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !242, file: !48, line: 58, baseType: !36, size: 64, offset: 320)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !242, file: !48, line: 59, baseType: !36, size: 64, offset: 384)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !242, file: !48, line: 60, baseType: !36, size: 64, offset: 448)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !242, file: !48, line: 61, baseType: !36, size: 64, offset: 512)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !242, file: !48, line: 64, baseType: !36, size: 64, offset: 576)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !242, file: !48, line: 65, baseType: !36, size: 64, offset: 640)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !242, file: !48, line: 66, baseType: !36, size: 64, offset: 704)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !242, file: !48, line: 68, baseType: !63, size: 64, offset: 768)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !242, file: !48, line: 70, baseType: !241, size: 64, offset: 832)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !242, file: !48, line: 72, baseType: !40, size: 32, offset: 896)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !242, file: !48, line: 73, baseType: !40, size: 32, offset: 928)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !242, file: !48, line: 74, baseType: !69, size: 64, offset: 960)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !242, file: !48, line: 77, baseType: !73, size: 16, offset: 1024)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !242, file: !48, line: 78, baseType: !75, size: 8, offset: 1040)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !242, file: !48, line: 79, baseType: !77, size: 8, offset: 1048)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !242, file: !48, line: 81, baseType: !81, size: 64, offset: 1088)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !242, file: !48, line: 89, baseType: !84, size: 64, offset: 1152)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !242, file: !48, line: 91, baseType: !86, size: 64, offset: 1216)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !242, file: !48, line: 92, baseType: !89, size: 64, offset: 1280)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !242, file: !48, line: 93, baseType: !241, size: 64, offset: 1344)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !242, file: !48, line: 94, baseType: !93, size: 64, offset: 1408)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !242, file: !48, line: 95, baseType: !95, size: 64, offset: 1472)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !242, file: !48, line: 96, baseType: !40, size: 32, offset: 1536)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !242, file: !48, line: 98, baseType: !100, size: 160, offset: 1568)
!273 = !{!233}
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !276, file: !277, line: 85, type: !394, isDefinition: true)
!276 = distinct !DICompileUnit(language: DW_LANG_C99, file: !277, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !278, retainedTypes: !297, globals: !367, nameTableKind: None)
!277 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!278 = !{!279, !292, !16}
!279 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !218, line: 32, baseType: !7, size: 32, elements: !280)
!280 = !{!281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291}
!281 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!282 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!283 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!284 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!285 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!286 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!287 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!288 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!289 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!290 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!291 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!292 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !218, line: 242, baseType: !7, size: 32, elements: !293)
!293 = !{!294, !295, !296}
!294 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!295 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!296 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!297 = !{!298, !304, !320, !323, !40, !73, !326, !95, !344, !348, !32, !354, !358, !36, !360, !363, !364}
!298 = !DISubprogram(name: "xmemdup", scope: !299, file: !299, line: 62, type: !300, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!299 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!300 = !DISubroutineType(types: !301)
!301 = !{!93, !302, !97}
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!304 = !DISubprogram(name: "quotearg_alloc_mem", scope: !218, file: !218, line: 342, type: !305, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!305 = !DISubroutineType(types: !306)
!306 = !{!36, !38, !97, !307, !308}
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !310)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !277, line: 65, size: 448, elements: !311)
!311 = !{!312, !313, !314, !318, !319}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !310, file: !277, line: 68, baseType: !279, size: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !310, file: !277, line: 71, baseType: !40, size: 32, offset: 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !310, file: !277, line: 75, baseType: !315, size: 256, offset: 64)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !316)
!316 = !{!317}
!317 = !DISubrange(count: 8)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !310, file: !277, line: 78, baseType: !38, size: 64, offset: 320)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !310, file: !277, line: 81, baseType: !38, size: 64, offset: 384)
!320 = !DISubprogram(name: "free", scope: !118, file: !118, line: 565, type: !321, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!321 = !DISubroutineType(types: !322)
!322 = !{null, !93}
!323 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !218, file: !218, line: 408, type: !324, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!324 = !DISubroutineType(types: !325)
!325 = !{!36, !40, !38, !38, !38, !97}
!326 = !DISubprogram(name: "rpl_mbrtowc", scope: !327, file: !327, line: 717, type: !328, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!327 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!328 = !DISubroutineType(types: !329)
!329 = !{!97, !330, !38, !97, !331}
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !333, line: 13, size: 64, elements: !334)
!333 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!334 = !{!335, !336}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !332, file: !333, line: 15, baseType: !40, size: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !332, file: !333, line: 20, baseType: !337, size: 32, offset: 32)
!337 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !332, file: !333, line: 16, size: 32, elements: !338)
!338 = !{!339, !340}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !337, file: !333, line: 18, baseType: !7, size: 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !337, file: !333, line: 19, baseType: !341, size: 32)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 32, elements: !342)
!342 = !{!343}
!343 = !DISubrange(count: 4)
!344 = !DISubprogram(name: "iswprint", scope: !345, file: !345, line: 120, type: !346, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!345 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!346 = !DISubroutineType(types: !347)
!347 = !{!40, !7}
!348 = !DISubprogram(name: "mbsinit", scope: !349, file: !349, line: 292, type: !350, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!349 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!350 = !DISubroutineType(types: !351)
!351 = !{!40, !352}
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !332)
!354 = !DISubprogram(name: "locale_charset", scope: !355, file: !355, line: 35, type: !356, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!355 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!356 = !DISubroutineType(types: !357)
!357 = !{!38}
!358 = !DISubprogram(name: "c_strcasecmp", scope: !359, file: !359, line: 42, type: !160, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!359 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!360 = !DISubprogram(name: "xmalloc", scope: !299, file: !299, line: 53, type: !361, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!361 = !DISubroutineType(types: !362)
!362 = !{!93, !97}
!363 = !DISubprogram(name: "xalloc_die", scope: !299, file: !299, line: 51, type: !122, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !41)
!364 = !DISubprogram(name: "xrealloc", scope: !299, file: !299, line: 59, type: !365, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!365 = !DISubroutineType(types: !366)
!366 = !{!93, !93, !97}
!367 = !{!274, !368, !374, !376, !378, !383, !390, !392}
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !276, file: !277, line: 101, type: !370, isDefinition: true)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !371, size: 320, elements: !372)
!371 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !279)
!372 = !{!373}
!373 = !DISubrange(count: 10)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !276, file: !277, line: 1052, type: !310, isDefinition: true)
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !276, file: !277, line: 116, type: !310, isLocal: true, isDefinition: true)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(name: "slot0", scope: !276, file: !277, line: 842, type: !380, isLocal: true, isDefinition: true)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 2048, elements: !381)
!381 = !{!382}
!382 = !DISubrange(count: 256)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(name: "slotvec", scope: !276, file: !277, line: 845, type: !385, isLocal: true, isDefinition: true)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !277, line: 834, size: 128, elements: !387)
!387 = !{!388, !389}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !386, file: !277, line: 836, baseType: !95, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !386, file: !277, line: 837, baseType: !36, size: 64, offset: 64)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(name: "nslots", scope: !276, file: !277, line: 843, type: !40, isLocal: true, isDefinition: true)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "slotvec0", scope: !276, file: !277, line: 844, type: !386, isLocal: true, isDefinition: true)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !395, size: 704, elements: !396)
!395 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!396 = !{!397}
!397 = !DISubrange(count: 11)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !400, file: !401, line: 26, type: !403, isDefinition: true)
!400 = distinct !DICompileUnit(language: DW_LANG_C99, file: !401, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !41, globals: !402, nameTableKind: None)
!401 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!402 = !{!398}
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 376, elements: !404)
!404 = !{!405}
!405 = !DISubrange(count: 47)
!406 = distinct !DICompileUnit(language: DW_LANG_C99, file: !407, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !41, retainedTypes: !408, nameTableKind: None)
!407 = !DIFile(filename: "lib/umaxtostr.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!408 = !{!409}
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !410, line: 102, baseType: !411)
!410 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !70, line: 73, baseType: !97)
!412 = distinct !DICompileUnit(language: DW_LANG_C99, file: !413, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !41, retainedTypes: !149, nameTableKind: None)
!413 = !DIFile(filename: "lib/strintcmp.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!414 = distinct !DICompileUnit(language: DW_LANG_C99, file: !415, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !41, retainedTypes: !416, nameTableKind: None)
!415 = !DIFile(filename: "lib/verror.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!416 = !{!417, !427, !431, !219, !32, !320}
!417 = !DISubprogram(name: "verror_at_line", scope: !133, file: !133, line: 45, type: !418, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!418 = !DISubroutineType(types: !419)
!419 = !{null, !40, !40, !38, !7, !38, !420}
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !415, size: 192, elements: !422)
!422 = !{!423, !424, !425, !426}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !421, file: !415, baseType: !7, size: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !421, file: !415, baseType: !7, size: 32, offset: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !421, file: !415, baseType: !93, size: 64, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !421, file: !415, baseType: !93, size: 64, offset: 128)
!427 = !DISubprogram(name: "xvasprintf", scope: !428, file: !428, line: 48, type: !429, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!428 = !DIFile(filename: "./lib/xvasprintf.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!429 = !DISubroutineType(types: !430)
!430 = !{!36, !38, !420}
!431 = !DISubprogram(name: "error_at_line", scope: !220, file: !220, line: 55, type: !432, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!432 = !DISubroutineType(types: !433)
!433 = !{null, !40, !40, !38, !7, !38, null}
!434 = distinct !DICompileUnit(language: DW_LANG_C99, file: !435, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !436, retainedTypes: !440, nameTableKind: None)
!435 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!436 = !{!437}
!437 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !435, line: 40, baseType: !7, size: 32, elements: !438)
!438 = !{!439}
!439 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!440 = !{!32, !441, !93}
!441 = !DISubprogram(name: "fputs_unlocked", scope: !43, file: !43, line: 662, type: !442, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!442 = !DISubroutineType(types: !443)
!443 = !{!40, !38, !444}
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !48, line: 49, size: 1728, elements: !446)
!446 = !{!447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !445, file: !48, line: 51, baseType: !40, size: 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !445, file: !48, line: 54, baseType: !36, size: 64, offset: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !445, file: !48, line: 55, baseType: !36, size: 64, offset: 128)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !445, file: !48, line: 56, baseType: !36, size: 64, offset: 192)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !445, file: !48, line: 57, baseType: !36, size: 64, offset: 256)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !445, file: !48, line: 58, baseType: !36, size: 64, offset: 320)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !445, file: !48, line: 59, baseType: !36, size: 64, offset: 384)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !445, file: !48, line: 60, baseType: !36, size: 64, offset: 448)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !445, file: !48, line: 61, baseType: !36, size: 64, offset: 512)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !445, file: !48, line: 64, baseType: !36, size: 64, offset: 576)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !445, file: !48, line: 65, baseType: !36, size: 64, offset: 640)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !445, file: !48, line: 66, baseType: !36, size: 64, offset: 704)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !445, file: !48, line: 68, baseType: !63, size: 64, offset: 768)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !445, file: !48, line: 70, baseType: !444, size: 64, offset: 832)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !445, file: !48, line: 72, baseType: !40, size: 32, offset: 896)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !445, file: !48, line: 73, baseType: !40, size: 32, offset: 928)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !445, file: !48, line: 74, baseType: !69, size: 64, offset: 960)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !445, file: !48, line: 77, baseType: !73, size: 16, offset: 1024)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !445, file: !48, line: 78, baseType: !75, size: 8, offset: 1040)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !445, file: !48, line: 79, baseType: !77, size: 8, offset: 1048)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !445, file: !48, line: 81, baseType: !81, size: 64, offset: 1088)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !445, file: !48, line: 89, baseType: !84, size: 64, offset: 1152)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !445, file: !48, line: 91, baseType: !86, size: 64, offset: 1216)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !445, file: !48, line: 92, baseType: !89, size: 64, offset: 1280)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !445, file: !48, line: 93, baseType: !444, size: 64, offset: 1344)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !445, file: !48, line: 94, baseType: !93, size: 64, offset: 1408)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !445, file: !48, line: 95, baseType: !95, size: 64, offset: 1472)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !445, file: !48, line: 96, baseType: !40, size: 32, offset: 1536)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !445, file: !48, line: 98, baseType: !100, size: 160, offset: 1568)
!476 = distinct !DICompileUnit(language: DW_LANG_C99, file: !477, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !478, retainedTypes: !491, nameTableKind: None)
!477 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!478 = !{!479}
!479 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !480, file: !299, line: 186, baseType: !7, size: 32, elements: !489)
!480 = distinct !DISubprogram(name: "x2nrealloc", scope: !299, file: !299, line: 174, type: !481, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !476, retainedNodes: !484)
!481 = !DISubroutineType(types: !482)
!482 = !{!93, !93, !483, !95}
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!484 = !{!485, !486, !487, !488}
!485 = !DILocalVariable(name: "p", arg: 1, scope: !480, file: !299, line: 174, type: !93)
!486 = !DILocalVariable(name: "pn", arg: 2, scope: !480, file: !299, line: 174, type: !483)
!487 = !DILocalVariable(name: "s", arg: 3, scope: !480, file: !299, line: 174, type: !95)
!488 = !DILocalVariable(name: "n", scope: !480, file: !299, line: 176, type: !95)
!489 = !{!490}
!490 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!491 = !{!95, !363, !360, !364, !36, !320, !93, !492, !495}
!492 = !DISubprogram(name: "xcalloc", scope: !299, file: !299, line: 57, type: !493, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!493 = !DISubroutineType(types: !494)
!494 = !{!93, !97, !97}
!495 = !DISubprogram(name: "rpl_calloc", scope: !496, file: !496, line: 688, type: !493, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!496 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!497 = distinct !DICompileUnit(language: DW_LANG_C99, file: !498, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !41, retainedTypes: !499, nameTableKind: None)
!498 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!499 = !{!32, !219}
!500 = distinct !DICompileUnit(language: DW_LANG_C99, file: !501, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !41, retainedTypes: !502, nameTableKind: None)
!501 = !DIFile(filename: "lib/xvasprintf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!502 = !{!363, !36, !360}
!503 = distinct !DICompileUnit(language: DW_LANG_C99, file: !504, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !41, retainedTypes: !505, nameTableKind: None)
!504 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!505 = !{!93}
!506 = distinct !DICompileUnit(language: DW_LANG_C99, file: !507, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !41, retainedTypes: !508, nameTableKind: None)
!507 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!508 = !{!509, !95, !521}
!509 = !DISubprogram(name: "mbrtowc", scope: !349, file: !349, line: 296, type: !510, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!510 = !DISubroutineType(types: !511)
!511 = !{!97, !330, !38, !97, !512}
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !333, line: 13, size: 64, elements: !514)
!514 = !{!515, !516}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !513, file: !333, line: 15, baseType: !40, size: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !513, file: !333, line: 20, baseType: !517, size: 32, offset: 32)
!517 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !513, file: !333, line: 16, size: 32, elements: !518)
!518 = !{!519, !520}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !517, file: !333, line: 18, baseType: !7, size: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !517, file: !333, line: 19, baseType: !341, size: 32)
!521 = !DISubprogram(name: "hard_locale", scope: !522, file: !522, line: 26, type: !523, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!522 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!523 = !DISubroutineType(types: !524)
!524 = !{!226, !40}
!525 = distinct !DICompileUnit(language: DW_LANG_C99, file: !526, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !41, retainedTypes: !527, nameTableKind: None)
!526 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!527 = !{!528}
!528 = !DISubprogram(name: "rpl_fclose", scope: !529, file: !529, line: 672, type: !530, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!529 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!530 = !DISubroutineType(types: !531)
!531 = !{!40, !532}
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !48, line: 49, size: 1728, elements: !534)
!534 = !{!535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !533, file: !48, line: 51, baseType: !40, size: 32)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !533, file: !48, line: 54, baseType: !36, size: 64, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !533, file: !48, line: 55, baseType: !36, size: 64, offset: 128)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !533, file: !48, line: 56, baseType: !36, size: 64, offset: 192)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !533, file: !48, line: 57, baseType: !36, size: 64, offset: 256)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !533, file: !48, line: 58, baseType: !36, size: 64, offset: 320)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !533, file: !48, line: 59, baseType: !36, size: 64, offset: 384)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !533, file: !48, line: 60, baseType: !36, size: 64, offset: 448)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !533, file: !48, line: 61, baseType: !36, size: 64, offset: 512)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !533, file: !48, line: 64, baseType: !36, size: 64, offset: 576)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !533, file: !48, line: 65, baseType: !36, size: 64, offset: 640)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !533, file: !48, line: 66, baseType: !36, size: 64, offset: 704)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !533, file: !48, line: 68, baseType: !63, size: 64, offset: 768)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !533, file: !48, line: 70, baseType: !532, size: 64, offset: 832)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !533, file: !48, line: 72, baseType: !40, size: 32, offset: 896)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !533, file: !48, line: 73, baseType: !40, size: 32, offset: 928)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !533, file: !48, line: 74, baseType: !69, size: 64, offset: 960)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !533, file: !48, line: 77, baseType: !73, size: 16, offset: 1024)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !533, file: !48, line: 78, baseType: !75, size: 8, offset: 1040)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !533, file: !48, line: 79, baseType: !77, size: 8, offset: 1048)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !533, file: !48, line: 81, baseType: !81, size: 64, offset: 1088)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !533, file: !48, line: 89, baseType: !84, size: 64, offset: 1152)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !533, file: !48, line: 91, baseType: !86, size: 64, offset: 1216)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !533, file: !48, line: 92, baseType: !89, size: 64, offset: 1280)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !533, file: !48, line: 93, baseType: !532, size: 64, offset: 1344)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !533, file: !48, line: 94, baseType: !93, size: 64, offset: 1408)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !533, file: !48, line: 95, baseType: !95, size: 64, offset: 1472)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !533, file: !48, line: 96, baseType: !40, size: 32, offset: 1536)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !533, file: !48, line: 98, baseType: !100, size: 160, offset: 1568)
!564 = distinct !DICompileUnit(language: DW_LANG_C99, file: !565, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !41, retainedTypes: !566, nameTableKind: None)
!565 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!566 = !{!567}
!567 = !DISubprogram(name: "setlocale_null_r", scope: !568, file: !568, line: 64, type: !569, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!568 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!569 = !DISubroutineType(types: !570)
!570 = !{!40, !40, !36, !97}
!571 = distinct !DICompileUnit(language: DW_LANG_C99, file: !572, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !573, retainedTypes: !960, nameTableKind: None)
!572 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!573 = !{!574}
!574 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !575, line: 41, baseType: !7, size: 32, elements: !576)
!575 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!576 = !{!577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959}
!577 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!578 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!579 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!580 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!581 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!582 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!583 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!584 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!585 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!586 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!587 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!588 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!589 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!590 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!591 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!592 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!593 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!594 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!595 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!596 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!597 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!598 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!599 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!600 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!601 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!602 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!603 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!604 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!605 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!606 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!607 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!608 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!609 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!610 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!611 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!612 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!613 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!614 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!615 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!616 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!617 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!618 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!619 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!620 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!621 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!622 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!623 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!624 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!625 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!626 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!627 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!628 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!629 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!630 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!631 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!632 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!633 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!634 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!635 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!636 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!637 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!661 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!662 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!663 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!664 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!665 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!666 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!667 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!668 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!669 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!670 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!671 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!672 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!673 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!674 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!675 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!676 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!677 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!678 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!679 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!680 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!681 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!682 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!683 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!684 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!685 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!686 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!687 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!688 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!689 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!690 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!691 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!692 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!693 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!694 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!695 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!696 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!697 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!698 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!699 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!700 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!701 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!702 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!703 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!704 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!705 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!706 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!707 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!708 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!709 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!710 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!711 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!712 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!713 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!714 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!715 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!716 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!717 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!719 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!720 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!721 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!722 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!723 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!724 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!725 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!726 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!727 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!728 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!729 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!730 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!731 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!732 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!733 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!734 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!735 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!736 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!737 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!738 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!739 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!740 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!741 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!742 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!743 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!744 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!745 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!746 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!747 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!748 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!749 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!750 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!751 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!752 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!753 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!754 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!755 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!756 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!757 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!758 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!759 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!760 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!761 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!762 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!763 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!764 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!765 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!766 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!767 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!768 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!769 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!770 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!771 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!772 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!773 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!774 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!779 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!780 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!781 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!782 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!783 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!784 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!785 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!786 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!787 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!788 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!789 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!790 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!791 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!793 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!794 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!795 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!796 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!797 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!798 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!799 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!800 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!801 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!802 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!803 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!804 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!805 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!806 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!807 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!808 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!809 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!810 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!812 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!813 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!814 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!815 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!816 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!817 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!818 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!819 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!820 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!821 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!822 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!823 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!824 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!825 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!826 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!827 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!828 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!829 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!830 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!831 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!832 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!833 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!834 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!835 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!836 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!837 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!838 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!839 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!840 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!841 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!842 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!843 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!844 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!845 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!846 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!847 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!848 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!849 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!850 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!851 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!852 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!853 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!854 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!855 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!856 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!857 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!858 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!859 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!861 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!862 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!863 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!864 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!865 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!866 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!884 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!885 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!886 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!887 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!892 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!893 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!894 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!895 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!896 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!898 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!899 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!900 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!901 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!902 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!903 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!904 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!905 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!906 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!907 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!908 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!909 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!910 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!911 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!912 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!913 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!914 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!915 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!916 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!917 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!918 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!919 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!920 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!921 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!922 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!923 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!924 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!925 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!926 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!927 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!928 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!929 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!930 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!931 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!932 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!933 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!934 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!935 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!936 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!937 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!938 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!939 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!940 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!941 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!942 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!943 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!944 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!945 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!946 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!947 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!948 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!949 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!950 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!951 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!952 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!953 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!954 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!955 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!956 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!957 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!958 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!959 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!960 = !{!961, !93}
!961 = !DISubprogram(name: "nl_langinfo", scope: !575, file: !575, line: 661, type: !962, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!962 = !DISubroutineType(types: !963)
!963 = !{!36, !40}
!964 = distinct !DICompileUnit(language: DW_LANG_C99, file: !965, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !41, retainedTypes: !966, nameTableKind: None)
!965 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!966 = !{!93, !107}
!967 = distinct !DICompileUnit(language: DW_LANG_C99, file: !968, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !41, retainedTypes: !969, nameTableKind: None)
!968 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!969 = !{!970, !1005, !1006, !1009}
!970 = !DISubprogram(name: "fileno", scope: !43, file: !43, line: 786, type: !971, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!971 = !DISubroutineType(types: !972)
!972 = !{!40, !973}
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !48, line: 49, size: 1728, elements: !975)
!975 = !{!976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !974, file: !48, line: 51, baseType: !40, size: 32)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !974, file: !48, line: 54, baseType: !36, size: 64, offset: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !974, file: !48, line: 55, baseType: !36, size: 64, offset: 128)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !974, file: !48, line: 56, baseType: !36, size: 64, offset: 192)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !974, file: !48, line: 57, baseType: !36, size: 64, offset: 256)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !974, file: !48, line: 58, baseType: !36, size: 64, offset: 320)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !974, file: !48, line: 59, baseType: !36, size: 64, offset: 384)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !974, file: !48, line: 60, baseType: !36, size: 64, offset: 448)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !974, file: !48, line: 61, baseType: !36, size: 64, offset: 512)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !974, file: !48, line: 64, baseType: !36, size: 64, offset: 576)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !974, file: !48, line: 65, baseType: !36, size: 64, offset: 640)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !974, file: !48, line: 66, baseType: !36, size: 64, offset: 704)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !974, file: !48, line: 68, baseType: !63, size: 64, offset: 768)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !974, file: !48, line: 70, baseType: !973, size: 64, offset: 832)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !974, file: !48, line: 72, baseType: !40, size: 32, offset: 896)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !974, file: !48, line: 73, baseType: !40, size: 32, offset: 928)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !974, file: !48, line: 74, baseType: !69, size: 64, offset: 960)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !974, file: !48, line: 77, baseType: !73, size: 16, offset: 1024)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !974, file: !48, line: 78, baseType: !75, size: 8, offset: 1040)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !974, file: !48, line: 79, baseType: !77, size: 8, offset: 1048)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !974, file: !48, line: 81, baseType: !81, size: 64, offset: 1088)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !974, file: !48, line: 89, baseType: !84, size: 64, offset: 1152)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !974, file: !48, line: 91, baseType: !86, size: 64, offset: 1216)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !974, file: !48, line: 92, baseType: !89, size: 64, offset: 1280)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !974, file: !48, line: 93, baseType: !973, size: 64, offset: 1344)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !974, file: !48, line: 94, baseType: !93, size: 64, offset: 1408)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !974, file: !48, line: 95, baseType: !95, size: 64, offset: 1472)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !974, file: !48, line: 96, baseType: !40, size: 32, offset: 1536)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !974, file: !48, line: 98, baseType: !100, size: 160, offset: 1568)
!1005 = !DISubprogram(name: "fclose", scope: !43, file: !43, line: 213, type: !971, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!1006 = !DISubprogram(name: "lseek", scope: !144, file: !144, line: 334, type: !1007, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!1007 = !DISubroutineType(types: !1008)
!1008 = !{!71, !40, !71, !40}
!1009 = !DISubprogram(name: "rpl_fflush", scope: !529, file: !529, line: 718, type: !971, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!1010 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1011, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !41, retainedTypes: !1012, nameTableKind: None)
!1011 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1012 = !{!93, !1013, !1048}
!1013 = !DISubprogram(name: "fflush", scope: !43, file: !43, line: 218, type: !1014, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!40, !1016}
