source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.blake2b_param__ = type { i8, i8, i8, i8, i32, i32, i32, i8, i8, [14 x i8], [16 x i8], [16 x i8] }
%struct.blake2b_state__ = type { [8 x i64], [2 x i64], [2 x i64], [128 x i8], i64, i64, i8 }
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [71 x i8] c"Usage: %s [OPTION]... [FILE]...\0APrint or check %s (%d-bit) checksums.\0A\00", align 1
@.str.2 = private unnamed_addr constant [7 x i8] c"BLAKE2\00", align 1

!15 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!18 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!19 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!20 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!21 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!22 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!23 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !24, line: 25, baseType: !6, size: 32, elements: !25)
!24 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!25 = !{!26, !27, !28, !29, !30}
!26 = !DIEnumerator(name: "LONGINT_OK", value: 0, isUnsigned: true)
!27 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1, isUnsigned: true)
!28 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2, isUnsigned: true)
!29 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3, isUnsigned: true)
!30 = !DIEnumerator(name: "LONGINT_INVALID", value: 4, isUnsigned: true)
!31 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !32, line: 46, baseType: !6, size: 32, elements: !33)
!32 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45}
!34 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!35 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!36 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!37 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!38 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!39 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!40 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!41 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!42 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!43 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!44 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!45 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !48, file: !47, line: 187, baseType: !6, size: 32, elements: !58)
!47 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!48 = distinct !DISubprogram(name: "select_plural", scope: !47, file: !47, line: 183, type: !49, scopeLine: 184, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !56)
!49 = !DISubroutineType(types: !50)
!50 = !{!51, !52}
!51 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !53, line: 102, baseType: !54)
!53 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !55, line: 73, baseType: !51)
!55 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!56 = !{!57}
!57 = !DILocalVariable(name: "n", arg: 1, scope: !48, file: !47, line: 183, type: !52)
!58 = !{!59}
!59 = !DIEnumerator(name: "PLURAL_REDUCER", value: 1000000, isUnsigned: true)
!60 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !61, line: 45, baseType: !6, size: 32, elements: !62)
!61 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!62 = !{!63, !64, !65, !66, !67, !68}
!63 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0, isUnsigned: true)
!64 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2, isUnsigned: true)
!65 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5, isUnsigned: true)
!66 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4, isUnsigned: true)
!67 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3, isUnsigned: true)
!68 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1, isUnsigned: true)
!69 = !{!70, !80, !139, !143, !147, !150, !153, !160, !163, !178, !182, !186, !74, !130, !190, !194, !132, !198, !202, !78, !205, !208, !211, !219, !224, !110, !226, !225}
!70 = !DISubprogram(name: "dcgettext", scope: !71, file: !71, line: 51, type: !72, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !79)
!71 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!72 = !DISubroutineType(types: !73)
!73 = !{!74, !76, !76, !78}
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !75)
!78 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!79 = !{}
!80 = !DISubprogram(name: "fputs_unlocked", scope: !81, file: !81, line: 662, type: !82, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !79)
!81 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!82 = !DISubroutineType(types: !83)
!83 = !{!78, !76, !84}
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !86, line: 49, size: 1728, elements: !87)
!86 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!87 = !{!88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !103, !104, !105, !106, !109, !111, !113, !117, !120, !122, !125, !128, !129, !131, !134, !135}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !85, file: !86, line: 51, baseType: !78, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !85, file: !86, line: 54, baseType: !74, size: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !85, file: !86, line: 55, baseType: !74, size: 64, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !85, file: !86, line: 56, baseType: !74, size: 64, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !85, file: !86, line: 57, baseType: !74, size: 64, offset: 256)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !85, file: !86, line: 58, baseType: !74, size: 64, offset: 320)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !85, file: !86, line: 59, baseType: !74, size: 64, offset: 384)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !85, file: !86, line: 60, baseType: !74, size: 64, offset: 448)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !85, file: !86, line: 61, baseType: !74, size: 64, offset: 512)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !85, file: !86, line: 64, baseType: !74, size: 64, offset: 576)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !85, file: !86, line: 65, baseType: !74, size: 64, offset: 640)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !85, file: !86, line: 66, baseType: !74, size: 64, offset: 704)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !85, file: !86, line: 68, baseType: !101, size: 64, offset: 768)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !86, line: 36, flags: DIFlagFwdDecl)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !85, file: !86, line: 70, baseType: !84, size: 64, offset: 832)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !85, file: !86, line: 72, baseType: !78, size: 32, offset: 896)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !85, file: !86, line: 73, baseType: !78, size: 32, offset: 928)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !85, file: !86, line: 74, baseType: !107, size: 64, offset: 960)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !55, line: 152, baseType: !108)
!108 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !85, file: !86, line: 77, baseType: !110, size: 16, offset: 1024)
!110 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !85, file: !86, line: 78, baseType: !112, size: 8, offset: 1040)
!112 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !85, file: !86, line: 79, baseType: !114, size: 8, offset: 1048)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 8, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 1)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !85, file: !86, line: 81, baseType: !118, size: 64, offset: 1088)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !86, line: 43, baseType: null)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !85, file: !86, line: 89, baseType: !121, size: 64, offset: 1152)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !55, line: 153, baseType: !108)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !85, file: !86, line: 91, baseType: !123, size: 64, offset: 1216)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !86, line: 37, flags: DIFlagFwdDecl)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !85, file: !86, line: 92, baseType: !126, size: 64, offset: 1280)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !86, line: 38, flags: DIFlagFwdDecl)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !85, file: !86, line: 93, baseType: !84, size: 64, offset: 1344)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !85, file: !86, line: 94, baseType: !130, size: 64, offset: 1408)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !85, file: !86, line: 95, baseType: !132, size: 64, offset: 1472)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !133, line: 46, baseType: !51)
!133 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !85, file: !86, line: 96, baseType: !78, size: 32, offset: 1536)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !85, file: !86, line: 98, baseType: !136, size: 160, offset: 1568)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 160, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 20)
!139 = !DISubprogram(name: "set_program_name", scope: !140, file: !140, line: 37, type: !141, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !79)
!140 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!141 = !DISubroutineType(types: !142)
!142 = !{null, !76}
!143 = !DISubprogram(name: "setlocale", scope: !144, file: !144, line: 122, type: !145, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !79)
!144 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!145 = !DISubroutineType(types: !146)
!146 = !{!74, !78, !76}
!147 = !DISubprogram(name: "bindtextdomain", scope: !71, file: !71, line: 86, type: !148, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !79)
!148 = !DISubroutineType(types: !149)
!149 = !{!74, !76, !76}
!150 = !DISubprogram(name: "textdomain", scope: !71, file: !71, line: 82, type: !151, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !79)
!151 = !DISubroutineType(types: !152)
!152 = !{!74, !76}
!153 = !DISubprogram(name: "atexit", scope: !154, file: !154, line: 595, type: !155, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !79)
!154 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!155 = !DISubroutineType(types: !156)
!156 = !{!78, !157}
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{null}
!160 = !DISubprogram(name: "setvbuf", scope: !81, file: !81, line: 308, type: !161, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !79)
!161 = !DISubroutineType(types: !162)
!162 = !{!78, !84, !74, !78, !51}
!163 = !DISubprogram(name: "getopt_long", scope: !164, file: !164, line: 66, type: !165, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !79)
!164 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!165 = !DISubroutineType(types: !166)
!166 = !{!78, !78, !167, !76, !169, !176}
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !74)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !171)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !164, line: 50, size: 256, elements: !172)
!172 = !{!173, !174, !175, !177}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !171, file: !164, line: 52, baseType: !76, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !171, file: !164, line: 55, baseType: !78, size: 32, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !171, file: !164, line: 56, baseType: !176, size: 64, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !171, file: !164, line: 57, baseType: !78, size: 32, offset: 192)
!178 = !DISubprogram(name: "xdectoumax", scope: !179, file: !179, line: 31, type: !180, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !79)
!179 = !DIFile(filename: "./lib/xdectoint.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!180 = !DISubroutineType(types: !181)
!181 = !{!51, !76, !51, !51, !76, !76, !78}
!182 = !DISubprogram(name: "quote", scope: !183, file: !183, line: 44, type: !184, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !79)
!183 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!184 = !DISubroutineType(types: !185)
!185 = !{!76, !76}
!186 = !DISubprogram(name: "error", scope: !187, file: !187, line: 52, type: !188, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !79)
!187 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!188 = !DISubroutineType(types: !189)
!189 = !{null, !78, !78, !76, null}
!190 = !DISubprogram(name: "version_etc", scope: !191, file: !191, line: 69, type: !192, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !79)
!191 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!192 = !DISubroutineType(types: !193)
!193 = !{null, !84, !76, !76, !76, null}
!194 = !DISubprogram(name: "rpl_fclose", scope: !195, file: !195, line: 672, type: !196, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !79)
!195 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!196 = !DISubroutineType(types: !197)
!197 = !{!78, !84}
!198 = !DISubprogram(name: "fopen_safer", scope: !199, file: !199, line: 23, type: !200, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !79)
!199 = !DIFile(filename: "./lib/stdio-safer.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!200 = !DISubroutineType(types: !201)
!201 = !{!84, !76, !76}
!202 = !DISubprogram(name: "quotearg_n_style_colon", scope: !10, file: !10, line: 397, type: !203, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !79)
!203 = !DISubroutineType(types: !204)
!204 = !{!74, !78, !9, !76}
!205 = !DISubprogram(name: "free", scope: !154, file: !154, line: 565, type: !206, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !79)
!206 = !DISubroutineType(types: !207)
!207 = !{null, !130}
!208 = !DISubprogram(name: "dcngettext", scope: !71, file: !71, line: 73, type: !209, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !79)
!209 = !DISubroutineType(types: !210)
!210 = !{!74, !76, !76, !76, !51, !78}
!211 = !DISubprogram(name: "argmatch", scope: !212, file: !212, line: 52, type: !213, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !79)
!212 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!213 = !DISubroutineType(types: !214)
!214 = !{!108, !76, !215, !217, !51}
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!219 = !DISubprogram(name: "xstrtoumax", scope: !24, file: !24, line: 48, type: !220, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !79)
!220 = !DISubroutineType(types: !221)
!221 = !{!23, !76, !222, !78, !223, !76}
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!226 = !DISubprogram(name: "fadvise", scope: !61, file: !61, line: 72, type: !227, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !79)
!227 = !DISubroutineType(types: !228)
!228 = !{null, !84, !60}
!229 = !{!230, !233, !235, !237, !239, !0, !241, !243, !245, !247, !249, !251, !253, !256, !261, !316, !318, !326}
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 131, type: !232, isLocal: true, isDefinition: true)
!232 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(name: "min_digest_line_length", scope: !2, file: !3, line: 134, type: !132, isLocal: true, isDefinition: true)
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(name: "digest_hex_bytes", scope: !2, file: !3, line: 137, type: !132, isLocal: true, isDefinition: true)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(name: "b2_algorithm", scope: !2, file: !3, line: 179, type: !5, isLocal: true, isDefinition: true)
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(name: "b2_length", scope: !2, file: !3, line: 180, type: !52, isLocal: true, isDefinition: true)
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(name: "status_only", scope: !2, file: !3, line: 141, type: !232, isLocal: true, isDefinition: true)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(name: "warn", scope: !2, file: !3, line: 145, type: !232, isLocal: true, isDefinition: true)
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(name: "quiet", scope: !2, file: !3, line: 151, type: !232, isLocal: true, isDefinition: true)
!247 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression())
!248 = distinct !DIGlobalVariable(name: "ignore_missing", scope: !2, file: !3, line: 148, type: !232, isLocal: true, isDefinition: true)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(name: "strict", scope: !2, file: !3, line: 155, type: !232, isLocal: true, isDefinition: true)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(name: "delim", scope: !2, file: !3, line: 161, type: !225, isLocal: true, isDefinition: true)
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(name: "blake2_max_len", scope: !2, file: !3, line: 185, type: !255, isLocal: true, isDefinition: true)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 64, elements: !115)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(name: "algorithm_in_string", scope: !2, file: !3, line: 164, type: !258, isLocal: true, isDefinition: true)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !216, size: 128, elements: !259)
!259 = !{!260}
!260 = !DISubrange(count: 2)
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(name: "bin2hex", scope: !263, file: !3, line: 730, type: !313, isLocal: true, isDefinition: true)
!263 = distinct !DISubprogram(name: "digest_check", scope: !3, file: !3, line: 652, type: !264, scopeLine: 653, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !266)
!264 = !DISubroutineType(types: !265)
!265 = !{!232, !76}
!266 = !{!267, !268, !272, !273, !274, !275, !276, !277, !278, !282, !283, !284, !285, !286, !287, !289, !290, !291, !295, !298, !299, !300, !304, !305, !311}
!267 = !DILocalVariable(name: "checkfile_name", arg: 1, scope: !263, file: !3, line: 652, type: !76)
!268 = !DILocalVariable(name: "checkfile_stream", scope: !263, file: !3, line: 654, type: !269)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !271, line: 7, baseType: !85)
!271 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "")
!272 = !DILocalVariable(name: "n_misformatted_lines", scope: !263, file: !3, line: 655, type: !52)
!273 = !DILocalVariable(name: "n_improperly_formatted_lines", scope: !263, file: !3, line: 656, type: !52)
!274 = !DILocalVariable(name: "n_mismatched_checksums", scope: !263, file: !3, line: 657, type: !52)
!275 = !DILocalVariable(name: "n_open_or_read_failures", scope: !263, file: !3, line: 658, type: !52)
!276 = !DILocalVariable(name: "properly_formatted_lines", scope: !263, file: !3, line: 659, type: !232)
!277 = !DILocalVariable(name: "matched_checksums", scope: !263, file: !3, line: 660, type: !232)
!278 = !DILocalVariable(name: "bin_buffer_unaligned", scope: !263, file: !3, line: 661, type: !279)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !225, size: 576, elements: !280)
!280 = !{!281}
!281 = !DISubrange(count: 72)
!282 = !DILocalVariable(name: "bin_buffer", scope: !263, file: !3, line: 663, type: !224)
!283 = !DILocalVariable(name: "line_number", scope: !263, file: !3, line: 664, type: !52)
!284 = !DILocalVariable(name: "line", scope: !263, file: !3, line: 665, type: !74)
!285 = !DILocalVariable(name: "line_chars_allocated", scope: !263, file: !3, line: 666, type: !132)
!286 = !DILocalVariable(name: "is_stdin", scope: !263, file: !3, line: 667, type: !232)
!287 = !DILocalVariable(name: "filename", scope: !288, file: !3, line: 690, type: !74)
!288 = distinct !DILexicalBlock(scope: !263, file: !3, line: 689, column: 5)
!289 = !DILocalVariable(name: "binary", scope: !288, file: !3, line: 691, type: !78)
!290 = !DILocalVariable(name: "hex_digest", scope: !288, file: !3, line: 692, type: !224)
!291 = !DILocalVariable(name: "line_length", scope: !288, file: !3, line: 693, type: !292)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !293, line: 108, baseType: !294)
!293 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !55, line: 193, baseType: !108)
!295 = !DILocalVariable(name: "ok", scope: !296, file: !3, line: 734, type: !232)
!296 = distinct !DILexicalBlock(scope: !297, file: !3, line: 729, column: 9)
!297 = distinct !DILexicalBlock(scope: !288, file: !3, line: 712, column: 11)
!298 = !DILocalVariable(name: "missing", scope: !296, file: !3, line: 735, type: !232)
!299 = !DILocalVariable(name: "needs_escape", scope: !296, file: !3, line: 738, type: !232)
!300 = !DILocalVariable(name: "digest_bin_bytes", scope: !301, file: !3, line: 762, type: !132)
!301 = distinct !DILexicalBlock(scope: !302, file: !3, line: 761, column: 13)
!302 = distinct !DILexicalBlock(scope: !303, file: !3, line: 755, column: 20)
!303 = distinct !DILexicalBlock(scope: !296, file: !3, line: 744, column: 15)
!304 = !DILocalVariable(name: "cnt", scope: !301, file: !3, line: 763, type: !132)
!305 = !DILocalVariable(name: "__res", scope: !306, file: !3, line: 769, type: !78)
!306 = distinct !DILexicalBlock(scope: !307, file: !3, line: 769, column: 23)
!307 = distinct !DILexicalBlock(scope: !308, file: !3, line: 769, column: 23)
!308 = distinct !DILexicalBlock(scope: !309, file: !3, line: 768, column: 17)
!309 = distinct !DILexicalBlock(scope: !310, file: !3, line: 767, column: 15)
!310 = distinct !DILexicalBlock(scope: !301, file: !3, line: 767, column: 15)
!311 = !DILocalVariable(name: "__res", scope: !312, file: !3, line: 771, type: !78)
!312 = distinct !DILexicalBlock(scope: !307, file: !3, line: 771, column: 27)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 128, elements: !314)
!314 = !{!315}
!315 = !DISubrange(count: 16)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "bsd_reversed", scope: !2, file: !3, line: 158, type: !78, isLocal: true, isDefinition: true)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "blake2fns", scope: !2, file: !3, line: 181, type: !320, isLocal: true, isDefinition: true)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !321, size: 64, elements: !115)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "blake2fn", file: !322, line: 17, baseType: !323)
!322 = !DIFile(filename: "src/blake2/b2sum.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DISubroutineType(types: !325)
!325 = !{!78, !269, !130, !132}
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "algorithm_out_string", scope: !2, file: !3, line: 168, type: !258, isLocal: true, isDefinition: true)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 3584, elements: !329)
!329 = !{!330}
!330 = !DISubrange(count: 14)
!331 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!332 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!333 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!334 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!335 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!336 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551606, DW_OP_mul, DW_OP_constu, 10, DW_OP_plus, DW_OP_stack_value))
!337 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 3, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!338 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "blake2b_IV", scope: !341, file: !342, line: 27, type: !402, isLocal: true, isDefinition: true)
!341 = distinct !DICompileUnit(language: DW_LANG_C99, file: !342, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !343, retainedTypes: !352, globals: !382, nameTableKind: None)
!342 = !DIFile(filename: "src/blake2/blake2b-ref.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!343 = !{!344}
!344 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "blake2b_constant", file: !345, line: 48, baseType: !6, size: 32, elements: !346)
!345 = !DIFile(filename: "src/blake2/blake2.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!346 = !{!347, !348, !349, !350, !351}
!347 = !DIEnumerator(name: "BLAKE2B_BLOCKBYTES", value: 128, isUnsigned: true)
!348 = !DIEnumerator(name: "BLAKE2B_OUTBYTES", value: 64, isUnsigned: true)
!349 = !DIEnumerator(name: "BLAKE2B_KEYBYTES", value: 64, isUnsigned: true)
!350 = !DIEnumerator(name: "BLAKE2B_SALTBYTES", value: 16, isUnsigned: true)
!351 = !DIEnumerator(name: "BLAKE2B_PERSONALBYTES", value: 16, isUnsigned: true)
!352 = !{!353, !355, !358, !380, !130, !366}
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !355)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !356, line: 24, baseType: !357)
!356 = !DIFile(filename: "/usr/include/bits/stdint-uintn.h", directory: "")
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !55, line: 38, baseType: !225)
!358 = !DISubprogram(name: "blake2b_update", scope: !345, file: !345, line: 162, type: !359, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !79)
!359 = !DISubroutineType(types: !360)
!360 = !{!78, !361, !217, !51}
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "blake2b_state__", file: !345, line: 68, size: 1984, elements: !363)
!363 = !{!364, !370, !372, !373, !377, !378, !379}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !362, file: !345, line: 70, baseType: !365, size: 512)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 512, elements: !368)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !356, line: 27, baseType: !367)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !55, line: 45, baseType: !51)
!368 = !{!369}
!369 = !DISubrange(count: 8)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !362, file: !345, line: 71, baseType: !371, size: 128, offset: 512)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 128, elements: !259)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !362, file: !345, line: 72, baseType: !371, size: 128, offset: 640)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !362, file: !345, line: 73, baseType: !374, size: 1024, offset: 768)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !355, size: 1024, elements: !375)
!375 = !{!376}
!376 = !DISubrange(count: 128)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !362, file: !345, line: 74, baseType: !132, size: 64, offset: 1792)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "outlen", scope: !362, file: !345, line: 75, baseType: !132, size: 64, offset: 1856)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "last_node", scope: !362, file: !345, line: 76, baseType: !355, size: 8, offset: 1920)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !225)
!382 = !{!339, !383, !397}
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(name: "memset_v", scope: !385, file: !386, line: 163, type: !392, isLocal: true, isDefinition: true)
!385 = distinct !DISubprogram(name: "secure_zero_memory", scope: !386, file: !386, line: 161, type: !387, scopeLine: 162, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !341, retainedNodes: !389)
!386 = !DIFile(filename: "src/blake2/blake2-impl.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!387 = !DISubroutineType(types: !388)
!388 = !{null, !130, !132}
!389 = !{!390, !391}
!390 = !DILocalVariable(name: "v", arg: 1, scope: !385, file: !386, line: 161, type: !130)
!391 = !DILocalVariable(name: "n", arg: 2, scope: !385, file: !386, line: 161, type: !132)
!392 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !393)
!393 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !394)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DISubroutineType(types: !396)
!396 = !{!130, !130, !78, !132}
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(name: "blake2b_sigma", scope: !341, file: !342, line: 35, type: !399, isLocal: true, isDefinition: true)
!399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !354, size: 1536, elements: !400)
!400 = !{!401, !315}
!401 = !DISubrange(count: 12)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !403, size: 512, elements: !368)
!403 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !366)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(name: "Version", scope: !406, file: !407, line: 2, type: !76, isDefinition: true)
!406 = distinct !DICompileUnit(language: DW_LANG_C99, file: !407, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !79, globals: !408, nameTableKind: None)
!407 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!408 = !{!404}
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !411, file: !412, line: 67, type: !458, isDefinition: true)
!411 = distinct !DICompileUnit(language: DW_LANG_C99, file: !412, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !413, retainedTypes: !414, globals: !457, nameTableKind: None)
!412 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!413 = !{!9}
!414 = !{!130, !76, !70, !415, !416, !186, !419, !182, !454, !225}
!415 = !DISubprogram(name: "quotearg_n_style", scope: !10, file: !10, line: 368, type: !203, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !79)
!416 = !DISubprogram(name: "quote_n", scope: !183, file: !183, line: 40, type: !417, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !79)
!417 = !DISubroutineType(types: !418)
!418 = !{!76, !78, !76}
!419 = !DISubprogram(name: "fputs_unlocked", scope: !81, file: !81, line: 662, type: !420, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !79)
!420 = !DISubroutineType(types: !421)
!421 = !{!78, !76, !422}
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !86, line: 49, size: 1728, elements: !424)
!424 = !{!425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !423, file: !86, line: 51, baseType: !78, size: 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !423, file: !86, line: 54, baseType: !74, size: 64, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !423, file: !86, line: 55, baseType: !74, size: 64, offset: 128)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !423, file: !86, line: 56, baseType: !74, size: 64, offset: 192)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !423, file: !86, line: 57, baseType: !74, size: 64, offset: 256)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !423, file: !86, line: 58, baseType: !74, size: 64, offset: 320)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !423, file: !86, line: 59, baseType: !74, size: 64, offset: 384)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !423, file: !86, line: 60, baseType: !74, size: 64, offset: 448)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !423, file: !86, line: 61, baseType: !74, size: 64, offset: 512)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !423, file: !86, line: 64, baseType: !74, size: 64, offset: 576)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !423, file: !86, line: 65, baseType: !74, size: 64, offset: 640)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !423, file: !86, line: 66, baseType: !74, size: 64, offset: 704)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !423, file: !86, line: 68, baseType: !101, size: 64, offset: 768)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !423, file: !86, line: 70, baseType: !422, size: 64, offset: 832)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !423, file: !86, line: 72, baseType: !78, size: 32, offset: 896)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !423, file: !86, line: 73, baseType: !78, size: 32, offset: 928)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !423, file: !86, line: 74, baseType: !107, size: 64, offset: 960)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !423, file: !86, line: 77, baseType: !110, size: 16, offset: 1024)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !423, file: !86, line: 78, baseType: !112, size: 8, offset: 1040)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !423, file: !86, line: 79, baseType: !114, size: 8, offset: 1048)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !423, file: !86, line: 81, baseType: !118, size: 64, offset: 1088)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !423, file: !86, line: 89, baseType: !121, size: 64, offset: 1152)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !423, file: !86, line: 91, baseType: !123, size: 64, offset: 1216)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !423, file: !86, line: 92, baseType: !126, size: 64, offset: 1280)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !423, file: !86, line: 93, baseType: !422, size: 64, offset: 1344)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !423, file: !86, line: 94, baseType: !130, size: 64, offset: 1408)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !423, file: !86, line: 95, baseType: !132, size: 64, offset: 1472)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !423, file: !86, line: 96, baseType: !78, size: 32, offset: 1536)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !423, file: !86, line: 98, baseType: !136, size: 160, offset: 1568)
!454 = !DISubprogram(name: "usage", scope: !412, file: !412, line: 56, type: !455, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !79)
!455 = !DISubroutineType(types: !456)
!456 = !{null, !78}
!457 = !{!409}
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !212, line: 61, baseType: !157)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(name: "file_name", scope: !461, file: !462, line: 46, type: !76, isLocal: true, isDefinition: true)
!461 = distinct !DICompileUnit(language: DW_LANG_C99, file: !462, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !79, retainedTypes: !463, globals: !501, nameTableKind: None)
!462 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!463 = !{!464, !70, !500, !186}
!464 = !DISubprogram(name: "close_stream", scope: !465, file: !465, line: 2, type: !466, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !79)
!465 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!466 = !DISubroutineType(types: !467)
!467 = !{!78, !468}
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !86, line: 49, size: 1728, elements: !470)
!470 = !{!471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !469, file: !86, line: 51, baseType: !78, size: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !469, file: !86, line: 54, baseType: !74, size: 64, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !469, file: !86, line: 55, baseType: !74, size: 64, offset: 128)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !469, file: !86, line: 56, baseType: !74, size: 64, offset: 192)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !469, file: !86, line: 57, baseType: !74, size: 64, offset: 256)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !469, file: !86, line: 58, baseType: !74, size: 64, offset: 320)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !469, file: !86, line: 59, baseType: !74, size: 64, offset: 384)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !469, file: !86, line: 60, baseType: !74, size: 64, offset: 448)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !469, file: !86, line: 61, baseType: !74, size: 64, offset: 512)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !469, file: !86, line: 64, baseType: !74, size: 64, offset: 576)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !469, file: !86, line: 65, baseType: !74, size: 64, offset: 640)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !469, file: !86, line: 66, baseType: !74, size: 64, offset: 704)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !469, file: !86, line: 68, baseType: !101, size: 64, offset: 768)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !469, file: !86, line: 70, baseType: !468, size: 64, offset: 832)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !469, file: !86, line: 72, baseType: !78, size: 32, offset: 896)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !469, file: !86, line: 73, baseType: !78, size: 32, offset: 928)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !469, file: !86, line: 74, baseType: !107, size: 64, offset: 960)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !469, file: !86, line: 77, baseType: !110, size: 16, offset: 1024)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !469, file: !86, line: 78, baseType: !112, size: 8, offset: 1040)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !469, file: !86, line: 79, baseType: !114, size: 8, offset: 1048)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !469, file: !86, line: 81, baseType: !118, size: 64, offset: 1088)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !469, file: !86, line: 89, baseType: !121, size: 64, offset: 1152)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !469, file: !86, line: 91, baseType: !123, size: 64, offset: 1216)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !469, file: !86, line: 92, baseType: !126, size: 64, offset: 1280)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !469, file: !86, line: 93, baseType: !468, size: 64, offset: 1344)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !469, file: !86, line: 94, baseType: !130, size: 64, offset: 1408)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !469, file: !86, line: 95, baseType: !132, size: 64, offset: 1472)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !469, file: !86, line: 96, baseType: !78, size: 32, offset: 1536)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !469, file: !86, line: 98, baseType: !136, size: 160, offset: 1568)
!500 = !DISubprogram(name: "quotearg_colon", scope: !10, file: !10, line: 391, type: !151, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !79)
!501 = !{!459, !502}
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !461, file: !462, line: 56, type: !232, isLocal: true, isDefinition: true)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(name: "exit_failure", scope: !506, file: !507, line: 24, type: !509, isDefinition: true)
!506 = distinct !DICompileUnit(language: DW_LANG_C99, file: !507, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !79, globals: !508, nameTableKind: None)
!507 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!508 = !{!504}
!509 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !78)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(name: "program_name", scope: !512, file: !513, line: 33, type: !76, isDefinition: true)
!512 = distinct !DICompileUnit(language: DW_LANG_C99, file: !513, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !79, retainedTypes: !514, globals: !550, nameTableKind: None)
!513 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!514 = !{!130, !515, !74}
!515 = !DISubprogram(name: "fputs", scope: !81, file: !81, line: 626, type: !516, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !79)
!516 = !DISubroutineType(types: !517)
!517 = !{!78, !76, !518}
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !86, line: 49, size: 1728, elements: !520)
!520 = !{!521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !519, file: !86, line: 51, baseType: !78, size: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !519, file: !86, line: 54, baseType: !74, size: 64, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !519, file: !86, line: 55, baseType: !74, size: 64, offset: 128)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !519, file: !86, line: 56, baseType: !74, size: 64, offset: 192)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !519, file: !86, line: 57, baseType: !74, size: 64, offset: 256)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !519, file: !86, line: 58, baseType: !74, size: 64, offset: 320)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !519, file: !86, line: 59, baseType: !74, size: 64, offset: 384)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !519, file: !86, line: 60, baseType: !74, size: 64, offset: 448)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !519, file: !86, line: 61, baseType: !74, size: 64, offset: 512)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !519, file: !86, line: 64, baseType: !74, size: 64, offset: 576)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !519, file: !86, line: 65, baseType: !74, size: 64, offset: 640)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !519, file: !86, line: 66, baseType: !74, size: 64, offset: 704)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !519, file: !86, line: 68, baseType: !101, size: 64, offset: 768)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !519, file: !86, line: 70, baseType: !518, size: 64, offset: 832)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !519, file: !86, line: 72, baseType: !78, size: 32, offset: 896)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !519, file: !86, line: 73, baseType: !78, size: 32, offset: 928)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !519, file: !86, line: 74, baseType: !107, size: 64, offset: 960)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !519, file: !86, line: 77, baseType: !110, size: 16, offset: 1024)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !519, file: !86, line: 78, baseType: !112, size: 8, offset: 1040)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !519, file: !86, line: 79, baseType: !114, size: 8, offset: 1048)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !519, file: !86, line: 81, baseType: !118, size: 64, offset: 1088)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !519, file: !86, line: 89, baseType: !121, size: 64, offset: 1152)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !519, file: !86, line: 91, baseType: !123, size: 64, offset: 1216)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !519, file: !86, line: 92, baseType: !126, size: 64, offset: 1280)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !519, file: !86, line: 93, baseType: !518, size: 64, offset: 1344)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !519, file: !86, line: 94, baseType: !130, size: 64, offset: 1408)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !519, file: !86, line: 95, baseType: !132, size: 64, offset: 1472)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !519, file: !86, line: 96, baseType: !78, size: 32, offset: 1536)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !519, file: !86, line: 98, baseType: !136, size: 160, offset: 1568)
!550 = !{!510}
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !553, file: !554, line: 85, type: !651, isDefinition: true)
!553 = distinct !DICompileUnit(language: DW_LANG_C99, file: !554, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !555, retainedTypes: !561, globals: !624, nameTableKind: None)
!554 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!555 = !{!9, !556, !31}
!556 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !10, line: 242, baseType: !6, size: 32, elements: !557)
!557 = !{!558, !559, !560}
!558 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!559 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!560 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!561 = !{!562, !566, !205, !579, !78, !110, !582, !132, !599, !603, !70, !609, !613, !74, !617, !620, !621}
!562 = !DISubprogram(name: "xmemdup", scope: !563, file: !563, line: 62, type: !564, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !79)
!563 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!564 = !DISubroutineType(types: !565)
!565 = !{!130, !217, !51}
!566 = !DISubprogram(name: "quotearg_alloc_mem", scope: !10, file: !10, line: 342, type: !567, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !79)
!567 = !DISubroutineType(types: !568)
!568 = !{!74, !76, !51, !223, !569}
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !571)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !554, line: 65, size: 448, elements: !572)
!572 = !{!573, !574, !575, !577, !578}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !571, file: !554, line: 68, baseType: !9, size: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !571, file: !554, line: 71, baseType: !78, size: 32, offset: 32)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !571, file: !554, line: 75, baseType: !576, size: 256, offset: 64)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !368)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !571, file: !554, line: 78, baseType: !76, size: 64, offset: 320)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !571, file: !554, line: 81, baseType: !76, size: 64, offset: 384)
!579 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !10, file: !10, line: 408, type: !580, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !79)
!580 = !DISubroutineType(types: !581)
!581 = !{!74, !78, !76, !76, !76, !51}
!582 = !DISubprogram(name: "rpl_mbrtowc", scope: !583, file: !583, line: 717, type: !584, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !79)
!583 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!584 = !DISubroutineType(types: !585)
!585 = !{!51, !176, !76, !51, !586}
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !588, line: 13, size: 64, elements: !589)
!588 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!589 = !{!590, !591}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !587, file: !588, line: 15, baseType: !78, size: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !587, file: !588, line: 20, baseType: !592, size: 32, offset: 32)
!592 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !587, file: !588, line: 16, size: 32, elements: !593)
!593 = !{!594, !595}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !592, file: !588, line: 18, baseType: !6, size: 32)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !592, file: !588, line: 19, baseType: !596, size: 32)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 32, elements: !597)
!597 = !{!598}
!598 = !DISubrange(count: 4)
!599 = !DISubprogram(name: "iswprint", scope: !600, file: !600, line: 120, type: !601, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !79)
!600 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!601 = !DISubroutineType(types: !602)
!602 = !{!78, !6}
!603 = !DISubprogram(name: "mbsinit", scope: !604, file: !604, line: 292, type: !605, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !79)
!604 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!605 = !DISubroutineType(types: !606)
!606 = !{!78, !607}
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !587)
!609 = !DISubprogram(name: "locale_charset", scope: !610, file: !610, line: 35, type: !611, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !79)
!610 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!611 = !DISubroutineType(types: !612)
!612 = !{!76}
!613 = !DISubprogram(name: "c_strcasecmp", scope: !614, file: !614, line: 42, type: !615, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !79)
!614 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!615 = !DISubroutineType(types: !616)
!616 = !{!78, !76, !76}
!617 = !DISubprogram(name: "xmalloc", scope: !563, file: !563, line: 53, type: !618, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !79)
!618 = !DISubroutineType(types: !619)
!619 = !{!130, !51}
!620 = !DISubprogram(name: "xalloc_die", scope: !563, file: !563, line: 51, type: !158, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !79)
!621 = !DISubprogram(name: "xrealloc", scope: !563, file: !563, line: 59, type: !622, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !79)
!622 = !DISubroutineType(types: !623)
!623 = !{!130, !130, !51}
!624 = !{!551, !625, !631, !633, !635, !640, !647, !649}
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !553, file: !554, line: 101, type: !627, isDefinition: true)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !628, size: 320, elements: !629)
!628 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!629 = !{!630}
!630 = !DISubrange(count: 10)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !553, file: !554, line: 1052, type: !571, isDefinition: true)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !553, file: !554, line: 116, type: !571, isLocal: true, isDefinition: true)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(name: "slot0", scope: !553, file: !554, line: 842, type: !637, isLocal: true, isDefinition: true)
!637 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 2048, elements: !638)
!638 = !{!639}
!639 = !DISubrange(count: 256)
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(name: "slotvec", scope: !553, file: !554, line: 845, type: !642, isLocal: true, isDefinition: true)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !554, line: 834, size: 128, elements: !644)
!644 = !{!645, !646}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !643, file: !554, line: 836, baseType: !132, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !643, file: !554, line: 837, baseType: !74, size: 64, offset: 64)
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(name: "nslots", scope: !553, file: !554, line: 843, type: !78, isLocal: true, isDefinition: true)
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(name: "slotvec0", scope: !553, file: !554, line: 844, type: !643, isLocal: true, isDefinition: true)
!651 = !DICompositeType(tag: DW_TAG_array_type, baseType: !216, size: 704, elements: !652)
!652 = !{!653}
!653 = !DISubrange(count: 11)
!654 = !DIGlobalVariableExpression(var: !655, expr: !DIExpression())
!655 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !656, file: !657, line: 26, type: !659, isDefinition: true)
!656 = distinct !DICompileUnit(language: DW_LANG_C99, file: !657, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !79, globals: !658, nameTableKind: None)
!657 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!658 = !{!654}
!659 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 376, elements: !660)
!660 = !{!661}
!661 = !DISubrange(count: 47)
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !664, file: !665, line: 507, type: !78, isLocal: true, isDefinition: true)
!664 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !665, file: !665, line: 488, type: !666, scopeLine: 489, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !668, retainedNodes: !679)
!665 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!666 = !DISubroutineType(types: !667)
!667 = !{!78, !78, !78}
!668 = distinct !DICompileUnit(language: DW_LANG_C99, file: !665, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !79, retainedTypes: !669, globals: !678, nameTableKind: None)
!669 = !{!670, !674}
!670 = !DISubprogram(name: "fcntl", scope: !671, file: !671, line: 176, type: !672, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !79)
!671 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
!672 = !DISubroutineType(types: !673)
!673 = !{!78, !78, !78, null}
!674 = !DISubprogram(name: "close", scope: !675, file: !675, line: 353, type: !676, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !79)
!675 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!676 = !DISubroutineType(types: !677)
!677 = !{!78, !78}
!678 = !{!662}
!679 = !{!680, !681, !682, !683, !686}
!680 = !DILocalVariable(name: "fd", arg: 1, scope: !664, file: !665, line: 488, type: !78)
!681 = !DILocalVariable(name: "target", arg: 2, scope: !664, file: !665, line: 488, type: !78)
!682 = !DILocalVariable(name: "result", scope: !664, file: !665, line: 490, type: !78)
!683 = !DILocalVariable(name: "flags", scope: !684, file: !665, line: 531, type: !78)
!684 = distinct !DILexicalBlock(scope: !685, file: !665, line: 530, column: 5)
!685 = distinct !DILexicalBlock(scope: !664, file: !665, line: 529, column: 7)
!686 = !DILocalVariable(name: "saved_errno", scope: !687, file: !665, line: 534, type: !78)
!687 = distinct !DILexicalBlock(scope: !688, file: !665, line: 533, column: 9)
!688 = distinct !DILexicalBlock(scope: !684, file: !665, line: 532, column: 11)
!689 = distinct !DICompileUnit(language: DW_LANG_C99, file: !690, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !79, retainedTypes: !691, globals: !748, nameTableKind: None)
!690 = !DIFile(filename: "src/blake2/b2sum.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!691 = !{!692, !693, !706, !741, !742, !745, !205}
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!693 = !DISubprogram(name: "blake2b_init", scope: !345, file: !345, line: 159, type: !694, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !79)
!694 = !DISubroutineType(types: !695)
!695 = !{!78, !696, !51}
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "blake2b_state__", file: !345, line: 68, size: 1984, elements: !698)
!698 = !{!699, !700, !701, !702, !703, !704, !705}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !697, file: !345, line: 70, baseType: !365, size: 512)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !697, file: !345, line: 71, baseType: !371, size: 128, offset: 512)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !697, file: !345, line: 72, baseType: !371, size: 128, offset: 640)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !697, file: !345, line: 73, baseType: !374, size: 1024, offset: 768)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !697, file: !345, line: 74, baseType: !132, size: 64, offset: 1792)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "outlen", scope: !697, file: !345, line: 75, baseType: !132, size: 64, offset: 1856)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "last_node", scope: !697, file: !345, line: 76, baseType: !355, size: 8, offset: 1920)
!706 = !DISubprogram(name: "ferror", scope: !81, file: !81, line: 761, type: !707, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !79)
!707 = !DISubroutineType(types: !708)
!708 = !{!78, !709}
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !86, line: 49, size: 1728, elements: !711)
!711 = !{!712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !710, file: !86, line: 51, baseType: !78, size: 32)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !710, file: !86, line: 54, baseType: !74, size: 64, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !710, file: !86, line: 55, baseType: !74, size: 64, offset: 128)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !710, file: !86, line: 56, baseType: !74, size: 64, offset: 192)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !710, file: !86, line: 57, baseType: !74, size: 64, offset: 256)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !710, file: !86, line: 58, baseType: !74, size: 64, offset: 320)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !710, file: !86, line: 59, baseType: !74, size: 64, offset: 384)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !710, file: !86, line: 60, baseType: !74, size: 64, offset: 448)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !710, file: !86, line: 61, baseType: !74, size: 64, offset: 512)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !710, file: !86, line: 64, baseType: !74, size: 64, offset: 576)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !710, file: !86, line: 65, baseType: !74, size: 64, offset: 640)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !710, file: !86, line: 66, baseType: !74, size: 64, offset: 704)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !710, file: !86, line: 68, baseType: !101, size: 64, offset: 768)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !710, file: !86, line: 70, baseType: !709, size: 64, offset: 832)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !710, file: !86, line: 72, baseType: !78, size: 32, offset: 896)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !710, file: !86, line: 73, baseType: !78, size: 32, offset: 928)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !710, file: !86, line: 74, baseType: !107, size: 64, offset: 960)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !710, file: !86, line: 77, baseType: !110, size: 16, offset: 1024)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !710, file: !86, line: 78, baseType: !112, size: 8, offset: 1040)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !710, file: !86, line: 79, baseType: !114, size: 8, offset: 1048)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !710, file: !86, line: 81, baseType: !118, size: 64, offset: 1088)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !710, file: !86, line: 89, baseType: !121, size: 64, offset: 1152)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !710, file: !86, line: 91, baseType: !123, size: 64, offset: 1216)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !710, file: !86, line: 92, baseType: !126, size: 64, offset: 1280)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !710, file: !86, line: 93, baseType: !709, size: 64, offset: 1344)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !710, file: !86, line: 94, baseType: !130, size: 64, offset: 1408)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !710, file: !86, line: 95, baseType: !132, size: 64, offset: 1472)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !710, file: !86, line: 96, baseType: !78, size: 32, offset: 1536)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !710, file: !86, line: 98, baseType: !136, size: 160, offset: 1568)
!741 = !DISubprogram(name: "feof", scope: !81, file: !81, line: 759, type: !707, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !79)
!742 = !DISubprogram(name: "blake2b_update", scope: !345, file: !345, line: 162, type: !743, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !79)
!743 = !DISubroutineType(types: !744)
!744 = !{!78, !696, !217, !51}
!745 = !DISubprogram(name: "blake2b_final", scope: !345, file: !345, line: 163, type: !746, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !79)
!746 = !DISubroutineType(types: !747)
!747 = !{!78, !696, !130, !51}
!748 = !{!749}
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(name: "buffer_length", scope: !751, file: !690, line: 91, type: !769, isLocal: true, isDefinition: true)
!751 = distinct !DISubprogram(name: "blake2b_stream", scope: !690, file: !690, line: 86, type: !752, scopeLine: 87, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !689, retainedNodes: !756)
!752 = !DISubroutineType(types: !753)
!753 = !{!78, !754, !130, !132}
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !271, line: 7, baseType: !710)
!756 = !{!757, !758, !759, !760, !761, !762, !763, !766, !767, !768}
!757 = !DILocalVariable(name: "stream", arg: 1, scope: !751, file: !690, line: 86, type: !754)
!758 = !DILocalVariable(name: "resstream", arg: 2, scope: !751, file: !690, line: 86, type: !130)
!759 = !DILocalVariable(name: "outbytes", arg: 3, scope: !751, file: !690, line: 86, type: !132)
!760 = !DILocalVariable(name: "ret", scope: !751, file: !690, line: 88, type: !78)
!761 = !DILocalVariable(name: "sum", scope: !751, file: !690, line: 89, type: !132)
!762 = !DILocalVariable(name: "n", scope: !751, file: !690, line: 89, type: !132)
!763 = !DILocalVariable(name: "S", scope: !751, file: !690, line: 90, type: !764)
!764 = !DICompositeType(tag: DW_TAG_array_type, baseType: !765, size: 1984, elements: !115)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "blake2b_state", file: !345, line: 77, baseType: !697)
!766 = !DILocalVariable(name: "buffer", scope: !751, file: !690, line: 92, type: !692)
!767 = !DILabel(scope: !751, name: "final_process", file: !690, line: 125)
!768 = !DILabel(scope: !751, name: "cleanup_buffer", file: !690, line: 131)
!769 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !132)
!770 = distinct !DICompileUnit(language: DW_LANG_C99, file: !771, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !772, retainedTypes: !773, nameTableKind: None)
!771 = !DIFile(filename: "lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!772 = !{!60}
!773 = !{!774, !777}
!774 = !DISubprogram(name: "posix_fadvise", scope: !671, file: !671, line: 288, type: !775, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !79)
!775 = !DISubroutineType(types: !776)
!776 = !{!78, !78, !108, !108, !78}
!777 = !DISubprogram(name: "fileno", scope: !81, file: !81, line: 786, type: !778, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !79)
!778 = !DISubroutineType(types: !779)
!779 = !{!78, !780}
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !86, line: 49, size: 1728, elements: !782)
!782 = !{!783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !781, file: !86, line: 51, baseType: !78, size: 32)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !781, file: !86, line: 54, baseType: !74, size: 64, offset: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !781, file: !86, line: 55, baseType: !74, size: 64, offset: 128)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !781, file: !86, line: 56, baseType: !74, size: 64, offset: 192)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !781, file: !86, line: 57, baseType: !74, size: 64, offset: 256)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !781, file: !86, line: 58, baseType: !74, size: 64, offset: 320)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !781, file: !86, line: 59, baseType: !74, size: 64, offset: 384)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !781, file: !86, line: 60, baseType: !74, size: 64, offset: 448)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !781, file: !86, line: 61, baseType: !74, size: 64, offset: 512)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !781, file: !86, line: 64, baseType: !74, size: 64, offset: 576)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !781, file: !86, line: 65, baseType: !74, size: 64, offset: 640)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !781, file: !86, line: 66, baseType: !74, size: 64, offset: 704)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !781, file: !86, line: 68, baseType: !101, size: 64, offset: 768)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !781, file: !86, line: 70, baseType: !780, size: 64, offset: 832)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !781, file: !86, line: 72, baseType: !78, size: 32, offset: 896)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !781, file: !86, line: 73, baseType: !78, size: 32, offset: 928)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !781, file: !86, line: 74, baseType: !107, size: 64, offset: 960)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !781, file: !86, line: 77, baseType: !110, size: 16, offset: 1024)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !781, file: !86, line: 78, baseType: !112, size: 8, offset: 1040)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !781, file: !86, line: 79, baseType: !114, size: 8, offset: 1048)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !781, file: !86, line: 81, baseType: !118, size: 64, offset: 1088)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !781, file: !86, line: 89, baseType: !121, size: 64, offset: 1152)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !781, file: !86, line: 91, baseType: !123, size: 64, offset: 1216)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !781, file: !86, line: 92, baseType: !126, size: 64, offset: 1280)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !781, file: !86, line: 93, baseType: !780, size: 64, offset: 1344)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !781, file: !86, line: 94, baseType: !130, size: 64, offset: 1408)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !781, file: !86, line: 95, baseType: !132, size: 64, offset: 1472)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !781, file: !86, line: 96, baseType: !78, size: 32, offset: 1536)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !781, file: !86, line: 98, baseType: !136, size: 160, offset: 1568)
!812 = distinct !DICompileUnit(language: DW_LANG_C99, file: !813, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !79, retainedTypes: !814, nameTableKind: None)
!813 = !DIFile(filename: "lib/fopen-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!814 = !{!815, !850, !852, !853, !674}
!815 = !DISubprogram(name: "fileno", scope: !81, file: !81, line: 786, type: !816, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !79)
!816 = !DISubroutineType(types: !817)
!817 = !{!78, !818}
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !86, line: 49, size: 1728, elements: !820)
!820 = !{!821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !819, file: !86, line: 51, baseType: !78, size: 32)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !819, file: !86, line: 54, baseType: !74, size: 64, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !819, file: !86, line: 55, baseType: !74, size: 64, offset: 128)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !819, file: !86, line: 56, baseType: !74, size: 64, offset: 192)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !819, file: !86, line: 57, baseType: !74, size: 64, offset: 256)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !819, file: !86, line: 58, baseType: !74, size: 64, offset: 320)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !819, file: !86, line: 59, baseType: !74, size: 64, offset: 384)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !819, file: !86, line: 60, baseType: !74, size: 64, offset: 448)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !819, file: !86, line: 61, baseType: !74, size: 64, offset: 512)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !819, file: !86, line: 64, baseType: !74, size: 64, offset: 576)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !819, file: !86, line: 65, baseType: !74, size: 64, offset: 640)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !819, file: !86, line: 66, baseType: !74, size: 64, offset: 704)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !819, file: !86, line: 68, baseType: !101, size: 64, offset: 768)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !819, file: !86, line: 70, baseType: !818, size: 64, offset: 832)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !819, file: !86, line: 72, baseType: !78, size: 32, offset: 896)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !819, file: !86, line: 73, baseType: !78, size: 32, offset: 928)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !819, file: !86, line: 74, baseType: !107, size: 64, offset: 960)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !819, file: !86, line: 77, baseType: !110, size: 16, offset: 1024)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !819, file: !86, line: 78, baseType: !112, size: 8, offset: 1040)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !819, file: !86, line: 79, baseType: !114, size: 8, offset: 1048)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !819, file: !86, line: 81, baseType: !118, size: 64, offset: 1088)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !819, file: !86, line: 89, baseType: !121, size: 64, offset: 1152)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !819, file: !86, line: 91, baseType: !123, size: 64, offset: 1216)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !819, file: !86, line: 92, baseType: !126, size: 64, offset: 1280)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !819, file: !86, line: 93, baseType: !818, size: 64, offset: 1344)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !819, file: !86, line: 94, baseType: !130, size: 64, offset: 1408)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !819, file: !86, line: 95, baseType: !132, size: 64, offset: 1472)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !819, file: !86, line: 96, baseType: !78, size: 32, offset: 1536)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !819, file: !86, line: 98, baseType: !136, size: 160, offset: 1568)
!850 = !DISubprogram(name: "dup_safer", scope: !851, file: !851, line: 20, type: !676, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !79)
!851 = !DIFile(filename: "./lib/unistd-safer.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!852 = !DISubprogram(name: "rpl_fclose", scope: !195, file: !195, line: 672, type: !816, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !79)
!853 = !DISubprogram(name: "fdopen", scope: !81, file: !81, line: 279, type: !854, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !79)
!854 = !DISubroutineType(types: !855)
!855 = !{!818, !78, !76}
!856 = distinct !DICompileUnit(language: DW_LANG_C99, file: !857, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !79, retainedTypes: !858, nameTableKind: None)
!857 = !DIFile(filename: "lib/dup-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!858 = !{!859}
!859 = !DISubprogram(name: "rpl_fcntl", scope: !860, file: !860, line: 588, type: !672, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !79)
!860 = !DIFile(filename: "./lib/fcntl.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!861 = distinct !DICompileUnit(language: DW_LANG_C99, file: !862, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !863, retainedTypes: !867, nameTableKind: None)
!862 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!863 = !{!864}
!864 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !862, line: 40, baseType: !6, size: 32, elements: !865)
!865 = !{!866}
!866 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!867 = !{!70, !868, !130}
!868 = !DISubprogram(name: "fputs_unlocked", scope: !81, file: !81, line: 662, type: !869, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !79)
!869 = !DISubroutineType(types: !870)
!870 = !{!78, !76, !871}
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !86, line: 49, size: 1728, elements: !873)
!873 = !{!874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !872, file: !86, line: 51, baseType: !78, size: 32)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !872, file: !86, line: 54, baseType: !74, size: 64, offset: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !872, file: !86, line: 55, baseType: !74, size: 64, offset: 128)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !872, file: !86, line: 56, baseType: !74, size: 64, offset: 192)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !872, file: !86, line: 57, baseType: !74, size: 64, offset: 256)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !872, file: !86, line: 58, baseType: !74, size: 64, offset: 320)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !872, file: !86, line: 59, baseType: !74, size: 64, offset: 384)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !872, file: !86, line: 60, baseType: !74, size: 64, offset: 448)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !872, file: !86, line: 61, baseType: !74, size: 64, offset: 512)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !872, file: !86, line: 64, baseType: !74, size: 64, offset: 576)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !872, file: !86, line: 65, baseType: !74, size: 64, offset: 640)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !872, file: !86, line: 66, baseType: !74, size: 64, offset: 704)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !872, file: !86, line: 68, baseType: !101, size: 64, offset: 768)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !872, file: !86, line: 70, baseType: !871, size: 64, offset: 832)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !872, file: !86, line: 72, baseType: !78, size: 32, offset: 896)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !872, file: !86, line: 73, baseType: !78, size: 32, offset: 928)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !872, file: !86, line: 74, baseType: !107, size: 64, offset: 960)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !872, file: !86, line: 77, baseType: !110, size: 16, offset: 1024)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !872, file: !86, line: 78, baseType: !112, size: 8, offset: 1040)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !872, file: !86, line: 79, baseType: !114, size: 8, offset: 1048)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !872, file: !86, line: 81, baseType: !118, size: 64, offset: 1088)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !872, file: !86, line: 89, baseType: !121, size: 64, offset: 1152)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !872, file: !86, line: 91, baseType: !123, size: 64, offset: 1216)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !872, file: !86, line: 92, baseType: !126, size: 64, offset: 1280)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !872, file: !86, line: 93, baseType: !871, size: 64, offset: 1344)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !872, file: !86, line: 94, baseType: !130, size: 64, offset: 1408)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !872, file: !86, line: 95, baseType: !132, size: 64, offset: 1472)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !872, file: !86, line: 96, baseType: !78, size: 32, offset: 1536)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !872, file: !86, line: 98, baseType: !136, size: 160, offset: 1568)
!903 = distinct !DICompileUnit(language: DW_LANG_C99, file: !904, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !905, retainedTypes: !918, nameTableKind: None)
!904 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!905 = !{!906}
!906 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !907, file: !563, line: 186, baseType: !6, size: 32, elements: !916)
!907 = distinct !DISubprogram(name: "x2nrealloc", scope: !563, file: !563, line: 174, type: !908, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !903, retainedNodes: !911)
!908 = !DISubroutineType(types: !909)
!909 = !{!130, !130, !910, !132}
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!911 = !{!912, !913, !914, !915}
!912 = !DILocalVariable(name: "p", arg: 1, scope: !907, file: !563, line: 174, type: !130)
!913 = !DILocalVariable(name: "pn", arg: 2, scope: !907, file: !563, line: 174, type: !910)
!914 = !DILocalVariable(name: "s", arg: 3, scope: !907, file: !563, line: 174, type: !132)
!915 = !DILocalVariable(name: "n", scope: !907, file: !563, line: 176, type: !132)
!916 = !{!917}
!917 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!918 = !{!132, !620, !617, !621, !74, !205, !130, !919, !922}
!919 = !DISubprogram(name: "xcalloc", scope: !563, file: !563, line: 57, type: !920, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !79)
!920 = !DISubroutineType(types: !921)
!921 = !{!130, !51, !51}
!922 = !DISubprogram(name: "rpl_calloc", scope: !923, file: !923, line: 688, type: !920, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !79)
!923 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!924 = distinct !DICompileUnit(language: DW_LANG_C99, file: !925, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !79, retainedTypes: !926, nameTableKind: None)
!925 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!926 = !{!70, !186}
!927 = distinct !DICompileUnit(language: DW_LANG_C99, file: !928, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !929, retainedTypes: !930, nameTableKind: None)
!928 = !DIFile(filename: "lib/xdectoumax.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!929 = !{!23}
!930 = !{!219, !182, !186}
!931 = distinct !DICompileUnit(language: DW_LANG_C99, file: !932, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !933, retainedTypes: !934, nameTableKind: None)
!932 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!933 = !{!23, !31}
!934 = !{!78, !110}
!935 = distinct !DICompileUnit(language: DW_LANG_C99, file: !936, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !79, retainedTypes: !937, nameTableKind: None)
!936 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!937 = !{!130}
!938 = distinct !DICompileUnit(language: DW_LANG_C99, file: !939, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !79, retainedTypes: !940, nameTableKind: None)
!939 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!940 = !{!941, !976, !977, !980}
!941 = !DISubprogram(name: "fileno", scope: !81, file: !81, line: 786, type: !942, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !79)
!942 = !DISubroutineType(types: !943)
!943 = !{!78, !944}
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !86, line: 49, size: 1728, elements: !946)
!946 = !{!947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !945, file: !86, line: 51, baseType: !78, size: 32)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !945, file: !86, line: 54, baseType: !74, size: 64, offset: 64)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !945, file: !86, line: 55, baseType: !74, size: 64, offset: 128)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !945, file: !86, line: 56, baseType: !74, size: 64, offset: 192)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !945, file: !86, line: 57, baseType: !74, size: 64, offset: 256)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !945, file: !86, line: 58, baseType: !74, size: 64, offset: 320)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !945, file: !86, line: 59, baseType: !74, size: 64, offset: 384)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !945, file: !86, line: 60, baseType: !74, size: 64, offset: 448)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !945, file: !86, line: 61, baseType: !74, size: 64, offset: 512)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !945, file: !86, line: 64, baseType: !74, size: 64, offset: 576)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !945, file: !86, line: 65, baseType: !74, size: 64, offset: 640)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !945, file: !86, line: 66, baseType: !74, size: 64, offset: 704)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !945, file: !86, line: 68, baseType: !101, size: 64, offset: 768)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !945, file: !86, line: 70, baseType: !944, size: 64, offset: 832)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !945, file: !86, line: 72, baseType: !78, size: 32, offset: 896)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !945, file: !86, line: 73, baseType: !78, size: 32, offset: 928)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !945, file: !86, line: 74, baseType: !107, size: 64, offset: 960)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !945, file: !86, line: 77, baseType: !110, size: 16, offset: 1024)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !945, file: !86, line: 78, baseType: !112, size: 8, offset: 1040)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !945, file: !86, line: 79, baseType: !114, size: 8, offset: 1048)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !945, file: !86, line: 81, baseType: !118, size: 64, offset: 1088)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !945, file: !86, line: 89, baseType: !121, size: 64, offset: 1152)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !945, file: !86, line: 91, baseType: !123, size: 64, offset: 1216)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !945, file: !86, line: 92, baseType: !126, size: 64, offset: 1280)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !945, file: !86, line: 93, baseType: !944, size: 64, offset: 1344)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !945, file: !86, line: 94, baseType: !130, size: 64, offset: 1408)
