; ModuleID = 'coreutils-8.32/src/b2sum.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.blake2b_state__ = type { [8 x i64], [2 x i64], [2 x i64], [128 x i8], i64, i64, i8 }
%struct.blake2b_param__ = type { i8, i8, i8, i8, i32, i32, i32, i8, i8, [14 x i8], [16 x i8], [16 x i8] }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [71 x i8] c"Usage: %s [OPTION]... [FILE]...\0APrint or check %s (%d-bit) checksums.\0A\00", align 1
@.str.2 = private unnamed_addr constant [7 x i8] c"BLAKE2\00", align 1

!64 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2, isUnsigned: true)
!65 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5, isUnsigned: true)
!66 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4, isUnsigned: true)
!67 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3, isUnsigned: true)
!68 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1, isUnsigned: true)
!69 = !{!70, !72, !73, !75, !76, !78, !77}
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !74, line: 46, baseType: !51)
!74 = !DIFile(filename: "/usr/lib/clang/12.0.1/include/stddef.h", directory: "")
!75 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!78 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!79 = !{!80, !83, !85, !87, !89, !0, !91, !93, !95, !97, !99, !101, !103, !108, !116, !220, !222, !230}
!80 = !DIGlobalVariableExpression(var: !81, expr: !DIExpression())
!81 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 131, type: !82, isLocal: true, isDefinition: true)
!82 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!83 = !DIGlobalVariableExpression(var: !84, expr: !DIExpression())
!84 = distinct !DIGlobalVariable(name: "min_digest_line_length", scope: !2, file: !3, line: 134, type: !73, isLocal: true, isDefinition: true)
!85 = !DIGlobalVariableExpression(var: !86, expr: !DIExpression())
!86 = distinct !DIGlobalVariable(name: "digest_hex_bytes", scope: !2, file: !3, line: 137, type: !73, isLocal: true, isDefinition: true)
!87 = !DIGlobalVariableExpression(var: !88, expr: !DIExpression())
!88 = distinct !DIGlobalVariable(name: "b2_algorithm", scope: !2, file: !3, line: 179, type: !5, isLocal: true, isDefinition: true)
!89 = !DIGlobalVariableExpression(var: !90, expr: !DIExpression())
!90 = distinct !DIGlobalVariable(name: "b2_length", scope: !2, file: !3, line: 180, type: !52, isLocal: true, isDefinition: true)
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "status_only", scope: !2, file: !3, line: 141, type: !82, isLocal: true, isDefinition: true)
!93 = !DIGlobalVariableExpression(var: !94, expr: !DIExpression())
!94 = distinct !DIGlobalVariable(name: "warn", scope: !2, file: !3, line: 145, type: !82, isLocal: true, isDefinition: true)
!95 = !DIGlobalVariableExpression(var: !96, expr: !DIExpression())
!96 = distinct !DIGlobalVariable(name: "quiet", scope: !2, file: !3, line: 151, type: !82, isLocal: true, isDefinition: true)
!97 = !DIGlobalVariableExpression(var: !98, expr: !DIExpression())
!98 = distinct !DIGlobalVariable(name: "ignore_missing", scope: !2, file: !3, line: 148, type: !82, isLocal: true, isDefinition: true)
!99 = !DIGlobalVariableExpression(var: !100, expr: !DIExpression())
!100 = distinct !DIGlobalVariable(name: "strict", scope: !2, file: !3, line: 155, type: !82, isLocal: true, isDefinition: true)
!101 = !DIGlobalVariableExpression(var: !102, expr: !DIExpression())
!102 = distinct !DIGlobalVariable(name: "delim", scope: !2, file: !3, line: 161, type: !77, isLocal: true, isDefinition: true)
!103 = !DIGlobalVariableExpression(var: !104, expr: !DIExpression())
!104 = distinct !DIGlobalVariable(name: "blake2_max_len", scope: !2, file: !3, line: 185, type: !105, isLocal: true, isDefinition: true)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 64, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 1)
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(name: "algorithm_in_string", scope: !2, file: !3, line: 164, type: !110, isLocal: true, isDefinition: true)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 128, elements: !114)
!111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !112)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !71)
!114 = !{!115}
!115 = !DISubrange(count: 2)
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(name: "bin2hex", scope: !118, file: !3, line: 730, type: !217, isLocal: true, isDefinition: true)
!118 = distinct !DISubprogram(name: "digest_check", scope: !3, file: !3, line: 652, type: !119, scopeLine: 653, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !121)
!119 = !DISubroutineType(types: !120)
!120 = !{!82, !112}
!121 = !{!122, !123, !176, !177, !178, !179, !180, !181, !182, !186, !187, !188, !189, !190, !191, !193, !194, !195, !199, !202, !203, !204, !208, !209, !215}
!122 = !DILocalVariable(name: "checkfile_name", arg: 1, scope: !118, file: !3, line: 652, type: !112)
!123 = !DILocalVariable(name: "checkfile_stream", scope: !118, file: !3, line: 654, type: !124)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !126, line: 7, baseType: !127)
!126 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "")
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !128, line: 49, size: 1728, elements: !129)
!128 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!129 = !{!130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !145, !147, !148, !149, !152, !153, !155, !157, !160, !162, !165, !168, !169, !170, !171, !172}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !127, file: !128, line: 51, baseType: !75, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !127, file: !128, line: 54, baseType: !70, size: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !127, file: !128, line: 55, baseType: !70, size: 64, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !127, file: !128, line: 56, baseType: !70, size: 64, offset: 192)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !127, file: !128, line: 57, baseType: !70, size: 64, offset: 256)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !127, file: !128, line: 58, baseType: !70, size: 64, offset: 320)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !127, file: !128, line: 59, baseType: !70, size: 64, offset: 384)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !127, file: !128, line: 60, baseType: !70, size: 64, offset: 448)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !127, file: !128, line: 61, baseType: !70, size: 64, offset: 512)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !127, file: !128, line: 64, baseType: !70, size: 64, offset: 576)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !127, file: !128, line: 65, baseType: !70, size: 64, offset: 640)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !127, file: !128, line: 66, baseType: !70, size: 64, offset: 704)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !127, file: !128, line: 68, baseType: !143, size: 64, offset: 768)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !128, line: 36, flags: DIFlagFwdDecl)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !127, file: !128, line: 70, baseType: !146, size: 64, offset: 832)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !127, file: !128, line: 72, baseType: !75, size: 32, offset: 896)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !127, file: !128, line: 73, baseType: !75, size: 32, offset: 928)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !127, file: !128, line: 74, baseType: !150, size: 64, offset: 960)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !55, line: 152, baseType: !151)
!151 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !127, file: !128, line: 77, baseType: !78, size: 16, offset: 1024)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !127, file: !128, line: 78, baseType: !154, size: 8, offset: 1040)
!154 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !127, file: !128, line: 79, baseType: !156, size: 8, offset: 1048)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 8, elements: !106)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !127, file: !128, line: 81, baseType: !158, size: 64, offset: 1088)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !128, line: 43, baseType: null)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !127, file: !128, line: 89, baseType: !161, size: 64, offset: 1152)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !55, line: 153, baseType: !151)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !127, file: !128, line: 91, baseType: !163, size: 64, offset: 1216)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !128, line: 37, flags: DIFlagFwdDecl)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !127, file: !128, line: 92, baseType: !166, size: 64, offset: 1280)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !128, line: 38, flags: DIFlagFwdDecl)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !127, file: !128, line: 93, baseType: !146, size: 64, offset: 1344)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !127, file: !128, line: 94, baseType: !72, size: 64, offset: 1408)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !127, file: !128, line: 95, baseType: !73, size: 64, offset: 1472)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !127, file: !128, line: 96, baseType: !75, size: 32, offset: 1536)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !127, file: !128, line: 98, baseType: !173, size: 160, offset: 1568)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 160, elements: !174)
!174 = !{!175}
!175 = !DISubrange(count: 20)
!176 = !DILocalVariable(name: "n_misformatted_lines", scope: !118, file: !3, line: 655, type: !52)
!177 = !DILocalVariable(name: "n_improperly_formatted_lines", scope: !118, file: !3, line: 656, type: !52)
!178 = !DILocalVariable(name: "n_mismatched_checksums", scope: !118, file: !3, line: 657, type: !52)
!179 = !DILocalVariable(name: "n_open_or_read_failures", scope: !118, file: !3, line: 658, type: !52)
!180 = !DILocalVariable(name: "properly_formatted_lines", scope: !118, file: !3, line: 659, type: !82)
!181 = !DILocalVariable(name: "matched_checksums", scope: !118, file: !3, line: 660, type: !82)
!182 = !DILocalVariable(name: "bin_buffer_unaligned", scope: !118, file: !3, line: 661, type: !183)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 576, elements: !184)
!184 = !{!185}
!185 = !DISubrange(count: 72)
!186 = !DILocalVariable(name: "bin_buffer", scope: !118, file: !3, line: 663, type: !76)
!187 = !DILocalVariable(name: "line_number", scope: !118, file: !3, line: 664, type: !52)
!188 = !DILocalVariable(name: "line", scope: !118, file: !3, line: 665, type: !70)
!189 = !DILocalVariable(name: "line_chars_allocated", scope: !118, file: !3, line: 666, type: !73)
!190 = !DILocalVariable(name: "is_stdin", scope: !118, file: !3, line: 667, type: !82)
!191 = !DILocalVariable(name: "filename", scope: !192, file: !3, line: 690, type: !70)
!192 = distinct !DILexicalBlock(scope: !118, file: !3, line: 689, column: 5)
!193 = !DILocalVariable(name: "binary", scope: !192, file: !3, line: 691, type: !75)
!194 = !DILocalVariable(name: "hex_digest", scope: !192, file: !3, line: 692, type: !76)
!195 = !DILocalVariable(name: "line_length", scope: !192, file: !3, line: 693, type: !196)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !197, line: 108, baseType: !198)
!197 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !55, line: 194, baseType: !151)
!199 = !DILocalVariable(name: "ok", scope: !200, file: !3, line: 734, type: !82)
!200 = distinct !DILexicalBlock(scope: !201, file: !3, line: 729, column: 9)
!201 = distinct !DILexicalBlock(scope: !192, file: !3, line: 712, column: 11)
!202 = !DILocalVariable(name: "missing", scope: !200, file: !3, line: 735, type: !82)
!203 = !DILocalVariable(name: "needs_escape", scope: !200, file: !3, line: 738, type: !82)
!204 = !DILocalVariable(name: "digest_bin_bytes", scope: !205, file: !3, line: 762, type: !73)
!205 = distinct !DILexicalBlock(scope: !206, file: !3, line: 761, column: 13)
!206 = distinct !DILexicalBlock(scope: !207, file: !3, line: 755, column: 20)
!207 = distinct !DILexicalBlock(scope: !200, file: !3, line: 744, column: 15)
!208 = !DILocalVariable(name: "cnt", scope: !205, file: !3, line: 763, type: !73)
!209 = !DILocalVariable(name: "__res", scope: !210, file: !3, line: 769, type: !75)
!210 = distinct !DILexicalBlock(scope: !211, file: !3, line: 769, column: 23)
!211 = distinct !DILexicalBlock(scope: !212, file: !3, line: 769, column: 23)
!212 = distinct !DILexicalBlock(scope: !213, file: !3, line: 768, column: 17)
!213 = distinct !DILexicalBlock(scope: !214, file: !3, line: 767, column: 15)
!214 = distinct !DILexicalBlock(scope: !205, file: !3, line: 767, column: 15)
!215 = !DILocalVariable(name: "__res", scope: !216, file: !3, line: 771, type: !75)
!216 = distinct !DILexicalBlock(scope: !211, file: !3, line: 771, column: 27)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 128, elements: !218)
!218 = !{!219}
!219 = !DISubrange(count: 16)
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(name: "bsd_reversed", scope: !2, file: !3, line: 158, type: !75, isLocal: true, isDefinition: true)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(name: "blake2fns", scope: !2, file: !3, line: 181, type: !224, isLocal: true, isDefinition: true)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !225, size: 64, elements: !106)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "blake2fn", file: !226, line: 17, baseType: !227)
!226 = !DIFile(filename: "src/blake2/b2sum.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{!75, !124, !72, !73}
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(name: "algorithm_out_string", scope: !2, file: !3, line: 168, type: !110, isLocal: true, isDefinition: true)
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, size: 3584, elements: !242)
!233 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !234)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !235, line: 50, size: 256, elements: !236)
!235 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!236 = !{!237, !238, !239, !241}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !234, file: !235, line: 52, baseType: !112, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !234, file: !235, line: 55, baseType: !75, size: 32, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !234, file: !235, line: 56, baseType: !240, size: 64, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !234, file: !235, line: 57, baseType: !75, size: 32, offset: 192)
!242 = !{!243}
!243 = !DISubrange(count: 14)
!244 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!245 = !DIGlobalVariableExpression(var: !94, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!246 = !DIGlobalVariableExpression(var: !96, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!247 = !DIGlobalVariableExpression(var: !98, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!248 = !DIGlobalVariableExpression(var: !100, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!249 = !DIGlobalVariableExpression(var: !102, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551606, DW_OP_mul, DW_OP_constu, 10, DW_OP_plus, DW_OP_stack_value))
!250 = !DIGlobalVariableExpression(var: !84, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 3, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!251 = !DIGlobalVariableExpression(var: !81, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(name: "blake2b_IV", scope: !254, file: !255, line: 27, type: !295, isLocal: true, isDefinition: true)
!254 = distinct !DICompileUnit(language: DW_LANG_C99, file: !255, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !256, retainedTypes: !265, globals: !275, splitDebugInlining: false, nameTableKind: None)
!255 = !DIFile(filename: "src/blake2/blake2b-ref.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!256 = !{!257}
!257 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "blake2b_constant", file: !258, line: 48, baseType: !6, size: 32, elements: !259)
!258 = !DIFile(filename: "src/blake2/blake2.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!259 = !{!260, !261, !262, !263, !264}
!260 = !DIEnumerator(name: "BLAKE2B_BLOCKBYTES", value: 128, isUnsigned: true)
!261 = !DIEnumerator(name: "BLAKE2B_OUTBYTES", value: 64, isUnsigned: true)
!262 = !DIEnumerator(name: "BLAKE2B_KEYBYTES", value: 64, isUnsigned: true)
!263 = !DIEnumerator(name: "BLAKE2B_SALTBYTES", value: 16, isUnsigned: true)
!264 = !DIEnumerator(name: "BLAKE2B_PERSONALBYTES", value: 16, isUnsigned: true)
!265 = !{!266, !268, !271, !72, !273}
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !268)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !269, line: 24, baseType: !270)
!269 = !DIFile(filename: "/usr/include/bits/stdint-uintn.h", directory: "")
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !55, line: 38, baseType: !77)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !77)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !269, line: 27, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !55, line: 45, baseType: !51)
!275 = !{!252, !276, !290}
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(name: "memset_v", scope: !278, file: !279, line: 163, type: !285, isLocal: true, isDefinition: true)
!278 = distinct !DISubprogram(name: "secure_zero_memory", scope: !279, file: !279, line: 161, type: !280, scopeLine: 162, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !254, retainedNodes: !282)
!279 = !DIFile(filename: "src/blake2/blake2-impl.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!280 = !DISubroutineType(types: !281)
!281 = !{null, !72, !73}
!282 = !{!283, !284}
!283 = !DILocalVariable(name: "v", arg: 1, scope: !278, file: !279, line: 161, type: !72)
!284 = !DILocalVariable(name: "n", arg: 2, scope: !278, file: !279, line: 161, type: !73)
!285 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !286)
!286 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !287)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DISubroutineType(types: !289)
!289 = !{!72, !72, !75, !73}
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "blake2b_sigma", scope: !254, file: !255, line: 35, type: !292, isLocal: true, isDefinition: true)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 1536, elements: !293)
!293 = !{!294, !219}
!294 = !DISubrange(count: 12)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !296, size: 512, elements: !297)
!296 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !273)
!297 = !{!298}
!298 = !DISubrange(count: 8)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(name: "Version", scope: !301, file: !302, line: 2, type: !112, isLocal: false, isDefinition: true)
!301 = distinct !DICompileUnit(language: DW_LANG_C99, file: !302, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !303, globals: !304, splitDebugInlining: false, nameTableKind: None)
!302 = !DIFile(filename: "src/version.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!303 = !{}
!304 = !{!299}
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !307, file: !308, line: 67, type: !312, isLocal: false, isDefinition: true)
!307 = distinct !DICompileUnit(language: DW_LANG_C99, file: !308, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !309, retainedTypes: !310, globals: !311, splitDebugInlining: false, nameTableKind: None)
!308 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!309 = !{!9}
!310 = !{!72, !112, !77}
!311 = !{!305}
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !313, line: 61, baseType: !314)
!313 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DISubroutineType(types: !316)
!316 = !{null}
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(name: "file_name", scope: !319, file: !320, line: 46, type: !112, isLocal: true, isDefinition: true)
!319 = distinct !DICompileUnit(language: DW_LANG_C99, file: !320, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !303, globals: !321, splitDebugInlining: false, nameTableKind: None)
!320 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!321 = !{!317, !322}
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !319, file: !320, line: 56, type: !82, isLocal: true, isDefinition: true)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(name: "exit_failure", scope: !326, file: !327, line: 24, type: !329, isLocal: false, isDefinition: true)
!326 = distinct !DICompileUnit(language: DW_LANG_C99, file: !327, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !303, globals: !328, splitDebugInlining: false, nameTableKind: None)
!327 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!328 = !{!324}
!329 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !75)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(name: "program_name", scope: !332, file: !333, line: 33, type: !112, isLocal: false, isDefinition: true)
!332 = distinct !DICompileUnit(language: DW_LANG_C99, file: !333, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !303, retainedTypes: !334, globals: !335, splitDebugInlining: false, nameTableKind: None)
!333 = !DIFile(filename: "lib/progname.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!334 = !{!72, !70}
!335 = !{!330}
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !338, file: !339, line: 85, type: !382, isLocal: false, isDefinition: true)
!338 = distinct !DICompileUnit(language: DW_LANG_C99, file: !339, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !340, retainedTypes: !346, globals: !347, splitDebugInlining: false, nameTableKind: None)
!339 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!340 = !{!9, !341, !31}
!341 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !10, line: 242, baseType: !6, size: 32, elements: !342)
!342 = !{!343, !344, !345}
!343 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!344 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!345 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!346 = !{!75, !78, !73, !70}
!347 = !{!336, !348, !354, !364, !366, !371, !378, !380}
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !338, file: !339, line: 101, type: !350, isLocal: false, isDefinition: true)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !351, size: 320, elements: !352)
!351 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!352 = !{!353}
!353 = !DISubrange(count: 10)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !338, file: !339, line: 1052, type: !356, isLocal: false, isDefinition: true)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !339, line: 65, size: 448, elements: !357)
!357 = !{!358, !359, !360, !362, !363}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !356, file: !339, line: 68, baseType: !9, size: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !356, file: !339, line: 71, baseType: !75, size: 32, offset: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !356, file: !339, line: 75, baseType: !361, size: 256, offset: 64)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !297)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !356, file: !339, line: 78, baseType: !112, size: 64, offset: 320)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !356, file: !339, line: 81, baseType: !112, size: 64, offset: 384)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !338, file: !339, line: 116, type: !356, isLocal: true, isDefinition: true)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "slot0", scope: !338, file: !339, line: 842, type: !368, isLocal: true, isDefinition: true)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 2048, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 256)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(name: "slotvec", scope: !338, file: !339, line: 845, type: !373, isLocal: true, isDefinition: true)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !339, line: 834, size: 128, elements: !375)
!375 = !{!376, !377}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !374, file: !339, line: 836, baseType: !73, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !374, file: !339, line: 837, baseType: !70, size: 64, offset: 64)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(name: "nslots", scope: !338, file: !339, line: 843, type: !75, isLocal: true, isDefinition: true)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(name: "slotvec0", scope: !338, file: !339, line: 844, type: !374, isLocal: true, isDefinition: true)
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 704, elements: !383)
!383 = !{!384}
!384 = !DISubrange(count: 11)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !387, file: !388, line: 26, type: !390, isLocal: false, isDefinition: true)
!387 = distinct !DICompileUnit(language: DW_LANG_C99, file: !388, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !303, globals: !389, splitDebugInlining: false, nameTableKind: None)
!388 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!389 = !{!385}
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 376, elements: !391)
!391 = !{!392}
!392 = !DISubrange(count: 47)
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !395, file: !396, line: 507, type: !75, isLocal: true, isDefinition: true)
!395 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !396, file: !396, line: 488, type: !397, scopeLine: 489, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !399, retainedNodes: !401)
!396 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!397 = !DISubroutineType(types: !398)
!398 = !{!75, !75, !75}
!399 = distinct !DICompileUnit(language: DW_LANG_C99, file: !396, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !303, globals: !400, splitDebugInlining: false, nameTableKind: None)
!400 = !{!393}
!401 = !{!402, !403, !404, !405, !408}
!402 = !DILocalVariable(name: "fd", arg: 1, scope: !395, file: !396, line: 488, type: !75)
!403 = !DILocalVariable(name: "target", arg: 2, scope: !395, file: !396, line: 488, type: !75)
!404 = !DILocalVariable(name: "result", scope: !395, file: !396, line: 490, type: !75)
!405 = !DILocalVariable(name: "flags", scope: !406, file: !396, line: 531, type: !75)
!406 = distinct !DILexicalBlock(scope: !407, file: !396, line: 530, column: 5)
!407 = distinct !DILexicalBlock(scope: !395, file: !396, line: 529, column: 7)
!408 = !DILocalVariable(name: "saved_errno", scope: !409, file: !396, line: 534, type: !75)
!409 = distinct !DILexicalBlock(scope: !410, file: !396, line: 533, column: 9)
!410 = distinct !DILexicalBlock(scope: !406, file: !396, line: 532, column: 11)
!411 = distinct !DICompileUnit(language: DW_LANG_C99, file: !412, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !303, retainedTypes: !413, globals: !415, splitDebugInlining: false, nameTableKind: None)
!412 = !DIFile(filename: "src/blake2/b2sum.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!413 = !{!414}
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!415 = !{!416}
!416 = !DIGlobalVariableExpression(var: !417, expr: !DIExpression())
!417 = distinct !DIGlobalVariable(name: "buffer_length", scope: !418, file: !412, line: 91, type: !482, isLocal: true, isDefinition: true)
!418 = distinct !DISubprogram(name: "blake2b_stream", scope: !412, file: !412, line: 86, type: !419, scopeLine: 87, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !411, retainedNodes: !455)
!419 = !DISubroutineType(types: !420)
!420 = !{!75, !421, !72, !73}
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !126, line: 7, baseType: !423)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !128, line: 49, size: 1728, elements: !424)
!424 = !{!425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !423, file: !128, line: 51, baseType: !75, size: 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !423, file: !128, line: 54, baseType: !70, size: 64, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !423, file: !128, line: 55, baseType: !70, size: 64, offset: 128)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !423, file: !128, line: 56, baseType: !70, size: 64, offset: 192)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !423, file: !128, line: 57, baseType: !70, size: 64, offset: 256)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !423, file: !128, line: 58, baseType: !70, size: 64, offset: 320)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !423, file: !128, line: 59, baseType: !70, size: 64, offset: 384)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !423, file: !128, line: 60, baseType: !70, size: 64, offset: 448)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !423, file: !128, line: 61, baseType: !70, size: 64, offset: 512)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !423, file: !128, line: 64, baseType: !70, size: 64, offset: 576)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !423, file: !128, line: 65, baseType: !70, size: 64, offset: 640)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !423, file: !128, line: 66, baseType: !70, size: 64, offset: 704)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !423, file: !128, line: 68, baseType: !143, size: 64, offset: 768)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !423, file: !128, line: 70, baseType: !439, size: 64, offset: 832)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !423, file: !128, line: 72, baseType: !75, size: 32, offset: 896)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !423, file: !128, line: 73, baseType: !75, size: 32, offset: 928)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !423, file: !128, line: 74, baseType: !150, size: 64, offset: 960)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !423, file: !128, line: 77, baseType: !78, size: 16, offset: 1024)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !423, file: !128, line: 78, baseType: !154, size: 8, offset: 1040)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !423, file: !128, line: 79, baseType: !156, size: 8, offset: 1048)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !423, file: !128, line: 81, baseType: !158, size: 64, offset: 1088)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !423, file: !128, line: 89, baseType: !161, size: 64, offset: 1152)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !423, file: !128, line: 91, baseType: !163, size: 64, offset: 1216)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !423, file: !128, line: 92, baseType: !166, size: 64, offset: 1280)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !423, file: !128, line: 93, baseType: !439, size: 64, offset: 1344)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !423, file: !128, line: 94, baseType: !72, size: 64, offset: 1408)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !423, file: !128, line: 95, baseType: !73, size: 64, offset: 1472)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !423, file: !128, line: 96, baseType: !75, size: 32, offset: 1536)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !423, file: !128, line: 98, baseType: !173, size: 160, offset: 1568)
!455 = !{!456, !457, !458, !459, !460, !461, !462, !479, !480, !481}
!456 = !DILocalVariable(name: "stream", arg: 1, scope: !418, file: !412, line: 86, type: !421)
!457 = !DILocalVariable(name: "resstream", arg: 2, scope: !418, file: !412, line: 86, type: !72)
!458 = !DILocalVariable(name: "outbytes", arg: 3, scope: !418, file: !412, line: 86, type: !73)
!459 = !DILocalVariable(name: "ret", scope: !418, file: !412, line: 88, type: !75)
!460 = !DILocalVariable(name: "sum", scope: !418, file: !412, line: 89, type: !73)
!461 = !DILocalVariable(name: "n", scope: !418, file: !412, line: 89, type: !73)
!462 = !DILocalVariable(name: "S", scope: !418, file: !412, line: 90, type: !463)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !464, size: 1984, elements: !106)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "blake2b_state", file: !258, line: 77, baseType: !465)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "blake2b_state__", file: !258, line: 68, size: 1984, elements: !466)
!466 = !{!467, !469, !471, !472, !476, !477, !478}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !465, file: !258, line: 70, baseType: !468, size: 512)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !273, size: 512, elements: !297)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !465, file: !258, line: 71, baseType: !470, size: 128, offset: 512)
!470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !273, size: 128, elements: !114)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !465, file: !258, line: 72, baseType: !470, size: 128, offset: 640)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !465, file: !258, line: 73, baseType: !473, size: 1024, offset: 768)
!473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !268, size: 1024, elements: !474)
!474 = !{!475}
!475 = !DISubrange(count: 128)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !465, file: !258, line: 74, baseType: !73, size: 64, offset: 1792)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "outlen", scope: !465, file: !258, line: 75, baseType: !73, size: 64, offset: 1856)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "last_node", scope: !465, file: !258, line: 76, baseType: !268, size: 8, offset: 1920)
!479 = !DILocalVariable(name: "buffer", scope: !418, file: !412, line: 92, type: !414)
!480 = !DILabel(scope: !418, name: "final_process", file: !412, line: 125)
!481 = !DILabel(scope: !418, name: "cleanup_buffer", file: !412, line: 131)
!482 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !73)
!483 = distinct !DICompileUnit(language: DW_LANG_C99, file: !484, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !485, splitDebugInlining: false, nameTableKind: None)
!484 = !DIFile(filename: "lib/fadvise.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!485 = !{!60}
!486 = distinct !DICompileUnit(language: DW_LANG_C99, file: !487, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !303, splitDebugInlining: false, nameTableKind: None)
!487 = !DIFile(filename: "lib/fopen-safer.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!488 = distinct !DICompileUnit(language: DW_LANG_C99, file: !489, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !303, splitDebugInlining: false, nameTableKind: None)
!489 = !DIFile(filename: "lib/dup-safer.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!490 = distinct !DICompileUnit(language: DW_LANG_C99, file: !491, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !492, retainedTypes: !496, splitDebugInlining: false, nameTableKind: None)
!491 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!492 = !{!493}
!493 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !491, line: 40, baseType: !6, size: 32, elements: !494)
!494 = !{!495}
!495 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!496 = !{!72}
!497 = distinct !DICompileUnit(language: DW_LANG_C99, file: !498, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !499, retainedTypes: !513, splitDebugInlining: false, nameTableKind: None)
!498 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!499 = !{!500}
!500 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !502, file: !501, line: 186, baseType: !6, size: 32, elements: !511)
!501 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!502 = distinct !DISubprogram(name: "x2nrealloc", scope: !501, file: !501, line: 174, type: !503, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !497, retainedNodes: !506)
!503 = !DISubroutineType(types: !504)
!504 = !{!72, !72, !505, !73}
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!506 = !{!507, !508, !509, !510}
!507 = !DILocalVariable(name: "p", arg: 1, scope: !502, file: !501, line: 174, type: !72)
!508 = !DILocalVariable(name: "pn", arg: 2, scope: !502, file: !501, line: 174, type: !505)
!509 = !DILocalVariable(name: "s", arg: 3, scope: !502, file: !501, line: 174, type: !73)
!510 = !DILocalVariable(name: "n", scope: !502, file: !501, line: 176, type: !73)
!511 = !{!512}
!512 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!513 = !{!73, !70, !72}
!514 = distinct !DICompileUnit(language: DW_LANG_C99, file: !515, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !303, splitDebugInlining: false, nameTableKind: None)
!515 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!516 = distinct !DICompileUnit(language: DW_LANG_C99, file: !517, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !518, splitDebugInlining: false, nameTableKind: None)
!517 = !DIFile(filename: "lib/xdectoumax.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!518 = !{!23}
!519 = distinct !DICompileUnit(language: DW_LANG_C99, file: !520, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !521, retainedTypes: !522, splitDebugInlining: false, nameTableKind: None)
!520 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!521 = !{!23, !31}
!522 = !{!75, !78}
!523 = distinct !DICompileUnit(language: DW_LANG_C99, file: !524, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !303, retainedTypes: !496, splitDebugInlining: false, nameTableKind: None)
!524 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!525 = distinct !DICompileUnit(language: DW_LANG_C99, file: !526, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !303, splitDebugInlining: false, nameTableKind: None)
!526 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!527 = distinct !DICompileUnit(language: DW_LANG_C99, file: !528, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !303, retainedTypes: !496, splitDebugInlining: false, nameTableKind: None)
!528 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!529 = distinct !DICompileUnit(language: DW_LANG_C99, file: !530, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !303, retainedTypes: !496, splitDebugInlining: false, nameTableKind: None)
!530 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!531 = distinct !DICompileUnit(language: DW_LANG_C99, file: !532, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !303, retainedTypes: !533, splitDebugInlining: false, nameTableKind: None)
!532 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!533 = !{!73}
!534 = distinct !DICompileUnit(language: DW_LANG_C99, file: !535, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !303, splitDebugInlining: false, nameTableKind: None)
!535 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!536 = distinct !DICompileUnit(language: DW_LANG_C99, file: !537, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !303, splitDebugInlining: false, nameTableKind: None)
!537 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!538 = distinct !DICompileUnit(language: DW_LANG_C99, file: !539, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !540, retainedTypes: !496, splitDebugInlining: false, nameTableKind: None)
!539 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!540 = !{!541}
!541 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !542, line: 41, baseType: !6, size: 32, elements: !543)
!542 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!543 = !{!544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926}
!544 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!545 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!546 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!547 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!548 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!549 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!550 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!551 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!552 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!553 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!554 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!555 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!556 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!557 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!558 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!559 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!560 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!561 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!562 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!563 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!564 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!565 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!566 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!567 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!568 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!569 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!570 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!571 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!572 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!573 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!574 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!575 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!576 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!577 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!578 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!579 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!580 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!581 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!582 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!583 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!584 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!585 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!586 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!587 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!588 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!589 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!590 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!591 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!592 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!593 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!594 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!595 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!596 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!597 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!598 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!599 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!600 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!601 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!602 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!603 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!604 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!605 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!606 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!607 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!608 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!609 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!610 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!611 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!612 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!613 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!614 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!615 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!616 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!617 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!618 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!619 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!620 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!621 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!622 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!623 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!624 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!625 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!626 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!627 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!628 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!629 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!630 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!631 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!632 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!633 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!634 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!635 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!636 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!637 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!652 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!655 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!656 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!657 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!658 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!659 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!660 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!661 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!662 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!663 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!664 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!665 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!666 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!667 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!668 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!669 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!670 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!671 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!672 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!673 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!674 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!675 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!676 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!677 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!678 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!679 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!680 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!681 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!682 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!683 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!684 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!685 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!686 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!687 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!688 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!689 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!690 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!691 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!692 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!693 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!694 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!695 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!696 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!697 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!698 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!699 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!700 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!701 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!702 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!703 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!704 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!705 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!706 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!707 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!708 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!709 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!710 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!711 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!712 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!713 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!714 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!715 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!716 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!717 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!719 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!720 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!721 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!722 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!723 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!724 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!725 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!726 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!727 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!728 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!729 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!730 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!731 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!732 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!733 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!734 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!735 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!736 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!737 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!738 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!739 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!740 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!741 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!742 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!743 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!744 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!745 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!746 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!747 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!748 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!749 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!750 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!751 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!752 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!753 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!754 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!755 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!756 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!757 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!758 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!759 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!760 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!761 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!762 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!763 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!764 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!765 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!766 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!767 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!768 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!769 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!770 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!771 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!772 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!773 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!774 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!779 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!780 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!781 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!782 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!783 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!784 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!785 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!786 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!787 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!788 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!789 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!790 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!791 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!793 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!794 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!795 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!796 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!797 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!798 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!799 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!800 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!801 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!802 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!803 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!804 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!805 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!806 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!807 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!808 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!809 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!810 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!812 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!813 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!814 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!815 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!816 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!817 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!818 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!819 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!820 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!821 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!822 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!823 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!824 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!825 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!826 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!827 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!828 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!829 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!830 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!831 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!832 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!833 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!834 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!835 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!836 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!837 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!838 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!839 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!840 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!841 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!842 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!843 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!844 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!845 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!846 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!847 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!859 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!860 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!861 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!862 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!863 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!868 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!869 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!870 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!871 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!884 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!885 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!886 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!887 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!894 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!895 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!896 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!898 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!899 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!900 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!901 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!902 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!903 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!904 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!905 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!906 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!907 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!908 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!909 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!910 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!911 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!912 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!913 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!914 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!915 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!916 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!917 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!918 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!919 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!920 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!921 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!922 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!923 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!924 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!925 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!926 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!927 = distinct !DICompileUnit(language: DW_LANG_C99, file: !928, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !303, retainedTypes: !496, splitDebugInlining: false, nameTableKind: None)
!928 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!929 = !{!"clang version 12.0.1"}
!930 = !{i32 7, !"Dwarf Version", i32 4}
!931 = !{i32 2, !"Debug Info Version", i32 3}
!932 = !{i32 1, !"wchar_size", i32 4}
!933 = !{i32 7, !"PIC Level", i32 2}
!934 = !{i32 7, !"PIE Level", i32 2}
!935 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 223, type: !936, scopeLine: 224, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !938)
!936 = !DISubroutineType(types: !937)
!937 = !{null, !75}
!938 = !{!939}
!939 = !DILocalVariable(name: "status", arg: 1, scope: !935, file: !3, line: 223, type: !75)
!940 = !DILocation(line: 0, scope: !935)
!941 = !DILocation(line: 225, column: 14, scope: !942)
!942 = distinct !DILexicalBlock(scope: !935, file: !3, line: 225, column: 7)
!943 = !DILocation(line: 225, column: 7, scope: !935)
!944 = !DILocation(line: 226, column: 5, scope: !945)
!945 = distinct !DILexicalBlock(scope: !942, file: !3, line: 226, column: 5)
!946 = !{!947, !947, i64 0}
!947 = !{!"any pointer", !948, i64 0}
!948 = !{!"omnipotent char", !949, i64 0}
!949 = !{!"Simple C/C++ TBAA"}
!950 = !DILocation(line: 229, column: 7, scope: !951)
!951 = distinct !DILexicalBlock(scope: !942, file: !3, line: 228, column: 5)
!952 = !DILocation(line: 583, column: 3, scope: !953, inlinedAt: !954)
!953 = distinct !DISubprogram(name: "emit_stdin_note", scope: !47, file: !47, line: 581, type: !315, scopeLine: 582, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !303)
!954 = distinct !DILocation(line: 237, column: 7, scope: !951)
!955 = !DILocation(line: 244, column: 9, scope: !956)
!956 = distinct !DILexicalBlock(scope: !951, file: !3, line: 238, column: 11)
!957 = !DILocation(line: 249, column: 7, scope: !951)
!958 = !DILocation(line: 253, column: 9, scope: !951)
!959 = !DILocation(line: 258, column: 7, scope: !951)
!960 = !DILocation(line: 266, column: 9, scope: !961)
!961 = distinct !DILexicalBlock(scope: !951, file: !3, line: 261, column: 11)
!962 = !DILocation(line: 269, column: 7, scope: !951)
!963 = !DILocation(line: 273, column: 7, scope: !951)
!964 = !DILocation(line: 283, column: 7, scope: !951)
!965 = !DILocation(line: 284, column: 7, scope: !951)
!966 = !DILocation(line: 285, column: 7, scope: !951)
!967 = !DILocalVariable(name: "program", arg: 1, scope: !968, file: !47, line: 634, type: !112)
!968 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !47, file: !47, line: 634, type: !969, scopeLine: 635, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !971)
!969 = !DISubroutineType(types: !970)
!970 = !{null, !112}
!971 = !{!967, !972, !981, !982, !984}
!972 = !DILocalVariable(name: "infomap", scope: !968, file: !47, line: 636, type: !973)
!973 = !DICompositeType(tag: DW_TAG_array_type, baseType: !974, size: 896, elements: !979)
!974 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !975)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !968, file: !47, line: 636, size: 128, elements: !976)
!976 = !{!977, !978}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !975, file: !47, line: 636, baseType: !112, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !975, file: !47, line: 636, baseType: !112, size: 64, offset: 64)
!979 = !{!980}
!980 = !DISubrange(count: 7)
!981 = !DILocalVariable(name: "node", scope: !968, file: !47, line: 646, type: !112)
!982 = !DILocalVariable(name: "map_prog", scope: !968, file: !47, line: 647, type: !983)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!984 = !DILocalVariable(name: "lc_messages", scope: !968, file: !47, line: 659, type: !112)
!985 = !DILocation(line: 0, scope: !968, inlinedAt: !986)
!986 = distinct !DILocation(line: 295, column: 7, scope: !951)
!987 = !DILocation(line: 636, column: 3, scope: !968, inlinedAt: !986)
!988 = !DILocation(line: 636, column: 67, scope: !968, inlinedAt: !986)
!989 = !DILocation(line: 647, column: 36, scope: !968, inlinedAt: !986)
!990 = !DILocation(line: 649, column: 3, scope: !968, inlinedAt: !986)
!991 = !DILocation(line: 649, column: 33, scope: !968, inlinedAt: !986)
!992 = !DILocation(line: 650, column: 13, scope: !968, inlinedAt: !986)
!993 = !DILocation(line: 649, column: 20, scope: !968, inlinedAt: !986)
!994 = !{!995, !947, i64 0}
!995 = !{!"infomap", !947, i64 0, !947, i64 8}
!996 = !DILocation(line: 649, column: 10, scope: !968, inlinedAt: !986)
!997 = !DILocation(line: 649, column: 28, scope: !968, inlinedAt: !986)
!998 = distinct !{!998, !990, !992, !999}
!999 = !{!"llvm.loop.mustprogress"}
!1000 = !DILocation(line: 652, column: 17, scope: !1001, inlinedAt: !986)
!1001 = distinct !DILexicalBlock(scope: !968, file: !47, line: 652, column: 7)
!1002 = !{!995, !947, i64 8}
!1003 = !DILocation(line: 652, column: 7, scope: !1001, inlinedAt: !986)
!1004 = !DILocation(line: 652, column: 7, scope: !968, inlinedAt: !986)
!1005 = !DILocation(line: 655, column: 3, scope: !968, inlinedAt: !986)
!1006 = !DILocation(line: 659, column: 29, scope: !968, inlinedAt: !986)
!1007 = !DILocation(line: 660, column: 7, scope: !1008, inlinedAt: !986)
!1008 = distinct !DILexicalBlock(scope: !968, file: !47, line: 660, column: 7)
!1009 = !DILocation(line: 660, column: 19, scope: !1008, inlinedAt: !986)
!1010 = !DILocation(line: 660, column: 22, scope: !1008, inlinedAt: !986)
!1011 = !DILocation(line: 660, column: 7, scope: !968, inlinedAt: !986)
!1012 = !DILocation(line: 666, column: 7, scope: !1013, inlinedAt: !986)
!1013 = distinct !DILexicalBlock(scope: !1008, file: !47, line: 661, column: 5)
!1014 = !DILocation(line: 668, column: 5, scope: !1013, inlinedAt: !986)
!1015 = !DILocation(line: 669, column: 3, scope: !968, inlinedAt: !986)
!1016 = !DILocation(line: 671, column: 3, scope: !968, inlinedAt: !986)
!1017 = !DILocation(line: 673, column: 1, scope: !968, inlinedAt: !986)
!1018 = !DILocation(line: 298, column: 3, scope: !935)
!1019 = !DISubprogram(name: "dcgettext", scope: !1020, file: !1020, line: 51, type: !1021, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !303)
!1020 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!70, !112, !112, !75}
!1023 = !DISubprogram(name: "fputs_unlocked", scope: !1024, file: !1024, line: 667, type: !1025, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !303)
!1024 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!75, !112, !146}
!1027 = !DISubprogram(name: "setlocale", scope: !1028, file: !1028, line: 122, type: !1029, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !303)
!1028 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!70, !75, !112}
!1031 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 861, type: !1032, scopeLine: 862, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1035)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!75, !75, !1034}
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!1035 = !{!1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1050, !1053, !1056, !1057, !1060}
!1036 = !DILocalVariable(name: "argc", arg: 1, scope: !1031, file: !3, line: 861, type: !75)
!1037 = !DILocalVariable(name: "argv", arg: 2, scope: !1031, file: !3, line: 861, type: !1034)
!1038 = !DILocalVariable(name: "bin_buffer_unaligned", scope: !1031, file: !3, line: 863, type: !183)
!1039 = !DILocalVariable(name: "bin_buffer", scope: !1031, file: !3, line: 865, type: !76)
!1040 = !DILocalVariable(name: "do_check", scope: !1031, file: !3, line: 866, type: !82)
!1041 = !DILocalVariable(name: "opt", scope: !1031, file: !3, line: 867, type: !75)
!1042 = !DILocalVariable(name: "ok", scope: !1031, file: !3, line: 868, type: !82)
!1043 = !DILocalVariable(name: "binary", scope: !1031, file: !3, line: 869, type: !75)
!1044 = !DILocalVariable(name: "prefix_tag", scope: !1031, file: !3, line: 870, type: !82)
!1045 = !DILocalVariable(name: "short_opts", scope: !1031, file: !3, line: 886, type: !112)
!1046 = !DILocalVariable(name: "b2_length_str", scope: !1031, file: !3, line: 887, type: !112)
!1047 = !DILocalVariable(name: "operand_lim", scope: !1031, file: !3, line: 1038, type: !1034)
!1048 = !DILocalVariable(name: "operandp", scope: !1049, file: !3, line: 1042, type: !1034)
!1049 = distinct !DILexicalBlock(scope: !1031, file: !3, line: 1042, column: 3)
!1050 = !DILocalVariable(name: "file", scope: !1051, file: !3, line: 1044, type: !70)
!1051 = distinct !DILexicalBlock(scope: !1052, file: !3, line: 1043, column: 5)
!1052 = distinct !DILexicalBlock(scope: !1049, file: !3, line: 1042, column: 3)
!1053 = !DILocalVariable(name: "file_is_binary", scope: !1054, file: !3, line: 1050, type: !75)
!1054 = distinct !DILexicalBlock(scope: !1055, file: !3, line: 1049, column: 9)
!1055 = distinct !DILexicalBlock(scope: !1051, file: !3, line: 1046, column: 11)
!1056 = !DILocalVariable(name: "missing", scope: !1054, file: !3, line: 1051, type: !82)
!1057 = !DILocalVariable(name: "needs_escape", scope: !1058, file: !3, line: 1064, type: !82)
!1058 = distinct !DILexicalBlock(scope: !1059, file: !3, line: 1056, column: 13)
!1059 = distinct !DILexicalBlock(scope: !1054, file: !3, line: 1053, column: 15)
!1060 = !DILocalVariable(name: "i", scope: !1061, file: !3, line: 1089, type: !73)
!1061 = distinct !DILexicalBlock(scope: !1058, file: !3, line: 1089, column: 15)
!1062 = !DILocation(line: 0, scope: !1031)
!1063 = !DILocation(line: 863, column: 3, scope: !1031)
!1064 = !DILocation(line: 863, column: 17, scope: !1031)
!1065 = !DILocation(line: 874, column: 21, scope: !1031)
!1066 = !DILocation(line: 874, column: 3, scope: !1031)
!1067 = !DILocation(line: 875, column: 3, scope: !1031)
!1068 = !DILocation(line: 876, column: 3, scope: !1031)
!1069 = !DILocation(line: 877, column: 3, scope: !1031)
!1070 = !DILocation(line: 879, column: 3, scope: !1031)
!1071 = !DILocation(line: 883, column: 12, scope: !1031)
!1072 = !DILocation(line: 883, column: 3, scope: !1031)
!1073 = !DILocation(line: 892, column: 3, scope: !1031)
!1074 = !DILocation(line: 869, column: 7, scope: !1031)
!1075 = !DILocation(line: 870, column: 8, scope: !1031)
!1076 = !DILocation(line: 887, column: 15, scope: !1031)
!1077 = !DILocation(line: 866, column: 8, scope: !1031)
!1078 = !DILocation(line: 892, column: 17, scope: !1031)
!1079 = distinct !{!1079, !1073, !1080, !999}
!1080 = !DILocation(line: 948, column: 7, scope: !1031)
!1081 = !DILocation(line: 897, column: 33, scope: !1082)
!1082 = distinct !DILexicalBlock(scope: !1031, file: !3, line: 894, column: 7)
!1083 = !DILocation(line: 898, column: 33, scope: !1082)
!1084 = !DILocation(line: 897, column: 21, scope: !1082)
!1085 = !DILocation(line: 897, column: 19, scope: !1082)
!1086 = !{!1087, !1087, i64 0}
!1087 = !{!"long", !948, i64 0}
!1088 = !DILocation(line: 899, column: 25, scope: !1082)
!1089 = !DILocation(line: 900, column: 23, scope: !1090)
!1090 = distinct !DILexicalBlock(scope: !1082, file: !3, line: 900, column: 13)
!1091 = !DILocation(line: 900, column: 27, scope: !1090)
!1092 = !DILocation(line: 900, column: 13, scope: !1082)
!1093 = !DILocation(line: 902, column: 26, scope: !1094)
!1094 = distinct !DILexicalBlock(scope: !1090, file: !3, line: 901, column: 11)
!1095 = !DILocation(line: 902, column: 51, scope: !1094)
!1096 = !DILocation(line: 902, column: 13, scope: !1094)
!1097 = !DILocation(line: 903, column: 13, scope: !1094)
!1098 = !DILocation(line: 912, column: 9, scope: !1082)
!1099 = !DILocation(line: 914, column: 21, scope: !1082)
!1100 = !DILocation(line: 915, column: 14, scope: !1082)
!1101 = !DILocation(line: 916, column: 15, scope: !1082)
!1102 = !DILocation(line: 917, column: 9, scope: !1082)
!1103 = !DILocation(line: 920, column: 9, scope: !1082)
!1104 = !DILocation(line: 922, column: 21, scope: !1082)
!1105 = !DILocation(line: 923, column: 14, scope: !1082)
!1106 = !DILocation(line: 924, column: 15, scope: !1082)
!1107 = !DILocation(line: 925, column: 9, scope: !1082)
!1108 = !DILocation(line: 927, column: 24, scope: !1082)
!1109 = !DILocation(line: 928, column: 9, scope: !1082)
!1110 = !DILocation(line: 930, column: 21, scope: !1082)
!1111 = !DILocation(line: 931, column: 14, scope: !1082)
!1112 = !DILocation(line: 932, column: 15, scope: !1082)
!1113 = !DILocation(line: 933, column: 9, scope: !1082)
!1114 = !DILocation(line: 935, column: 16, scope: !1082)
!1115 = !DILocation(line: 936, column: 9, scope: !1082)
!1116 = !DILocation(line: 940, column: 9, scope: !1082)
!1117 = !DILocation(line: 942, column: 15, scope: !1082)
!1118 = !DILocation(line: 943, column: 9, scope: !1082)
!1119 = !DILocation(line: 944, column: 7, scope: !1082)
!1120 = !DILocation(line: 945, column: 7, scope: !1082)
!1121 = !DILocation(line: 947, column: 9, scope: !1082)
!1122 = !DILocation(line: 950, column: 26, scope: !1031)
!1123 = !DILocation(line: 952, column: 7, scope: !1124)
!1124 = distinct !DILexicalBlock(scope: !1031, file: !3, line: 952, column: 7)
!1125 = !DILocation(line: 952, column: 17, scope: !1124)
!1126 = !DILocation(line: 952, column: 7, scope: !1031)
!1127 = !DILocation(line: 954, column: 20, scope: !1128)
!1128 = distinct !DILexicalBlock(scope: !1124, file: !3, line: 953, column: 5)
!1129 = !DILocation(line: 954, column: 45, scope: !1128)
!1130 = !DILocation(line: 954, column: 7, scope: !1128)
!1131 = !DILocation(line: 955, column: 7, scope: !1128)
!1132 = !{!948, !948, i64 0}
!1133 = !DILocation(line: 960, column: 17, scope: !1134)
!1134 = distinct !DILexicalBlock(scope: !1031, file: !3, line: 960, column: 7)
!1135 = !DILocation(line: 960, column: 22, scope: !1134)
!1136 = !DILocation(line: 961, column: 15, scope: !1134)
!1137 = !DILocation(line: 961, column: 5, scope: !1134)
!1138 = !DILocation(line: 962, column: 22, scope: !1031)
!1139 = !DILocation(line: 962, column: 32, scope: !1031)
!1140 = !DILocation(line: 962, column: 20, scope: !1031)
!1141 = !DILocation(line: 967, column: 7, scope: !1142)
!1142 = distinct !DILexicalBlock(scope: !1031, file: !3, line: 967, column: 7)
!1143 = !DILocation(line: 967, column: 18, scope: !1142)
!1144 = !DILocation(line: 974, column: 19, scope: !1145)
!1145 = distinct !DILexicalBlock(scope: !1142, file: !3, line: 968, column: 4)
!1146 = !DILocation(line: 974, column: 6, scope: !1145)
!1147 = !DILocation(line: 975, column: 6, scope: !1145)
!1148 = !DILocation(line: 978, column: 7, scope: !1149)
!1149 = distinct !DILexicalBlock(scope: !1031, file: !3, line: 978, column: 7)
!1150 = !DILocation(line: 978, column: 21, scope: !1149)
!1151 = !DILocation(line: 980, column: 20, scope: !1152)
!1152 = distinct !DILexicalBlock(scope: !1149, file: !3, line: 979, column: 5)
!1153 = !DILocation(line: 980, column: 7, scope: !1152)
!1154 = !DILocation(line: 982, column: 7, scope: !1152)
!1155 = !DILocation(line: 985, column: 18, scope: !1156)
!1156 = distinct !DILexicalBlock(scope: !1031, file: !3, line: 985, column: 7)
!1157 = !DILocation(line: 987, column: 20, scope: !1158)
!1158 = distinct !DILexicalBlock(scope: !1156, file: !3, line: 986, column: 5)
!1159 = !DILocation(line: 987, column: 7, scope: !1158)
!1160 = !DILocation(line: 989, column: 7, scope: !1158)
!1161 = !DILocation(line: 992, column: 9, scope: !1162)
!1162 = distinct !DILexicalBlock(scope: !1031, file: !3, line: 992, column: 7)
!1163 = !DILocation(line: 992, column: 19, scope: !1162)
!1164 = !DILocation(line: 994, column: 20, scope: !1165)
!1165 = distinct !DILexicalBlock(scope: !1162, file: !3, line: 993, column: 5)
!1166 = !DILocation(line: 994, column: 7, scope: !1165)
!1167 = !DILocation(line: 996, column: 7, scope: !1165)
!1168 = !DILocation(line: 999, column: 7, scope: !1169)
!1169 = distinct !DILexicalBlock(scope: !1031, file: !3, line: 999, column: 7)
!1170 = !DILocation(line: 999, column: 22, scope: !1169)
!1171 = !DILocation(line: 1002, column: 14, scope: !1172)
!1172 = distinct !DILexicalBlock(scope: !1169, file: !3, line: 1000, column: 5)
!1173 = !DILocation(line: 1001, column: 7, scope: !1172)
!1174 = !DILocation(line: 1004, column: 7, scope: !1172)
!1175 = !DILocation(line: 1007, column: 7, scope: !1176)
!1176 = distinct !DILexicalBlock(scope: !1031, file: !3, line: 1007, column: 7)
!1177 = !DILocation(line: 1007, column: 19, scope: !1176)
!1178 = !DILocation(line: 1010, column: 8, scope: !1179)
