source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.blake2b_param__ = type { i8, i8, i8, i8, i32, i32, i32, i8, i8, [14 x i8], [16 x i8], [16 x i8] }
%struct.blake2b_state__ = type { [8 x i64], [2 x i64], [2 x i64], [128 x i8], i64, i64, i8 }
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [71 x i8] c"Usage: %s [OPTION]... [FILE]...\0APrint or check %s (%d-bit) checksums.\0A\00", align 1
@.str.2 = private unnamed_addr constant [7 x i8] c"BLAKE2\00", align 1

!66 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4, isUnsigned: true)
!67 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3, isUnsigned: true)
!68 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1, isUnsigned: true)
!69 = !{!70, !72, !73, !75, !6, !76, !78, !77}
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !74, line: 62, baseType: !51)
!74 = !DIFile(filename: "/usr/lib/clang/7.0.0/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!75 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!78 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!79 = !{!80, !83, !85, !87, !89, !0, !91, !93, !95, !97, !99, !101, !103, !108, !116, !220, !222, !230}
!80 = !DIGlobalVariableExpression(var: !81, expr: !DIExpression())
!81 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 131, type: !82, isLocal: true, isDefinition: true)
!82 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!83 = !DIGlobalVariableExpression(var: !84, expr: !DIExpression())
!84 = distinct !DIGlobalVariable(name: "min_digest_line_length", scope: !2, file: !3, line: 134, type: !73, isLocal: true, isDefinition: true)
!85 = !DIGlobalVariableExpression(var: !86, expr: !DIExpression())
!86 = distinct !DIGlobalVariable(name: "digest_hex_bytes", scope: !2, file: !3, line: 137, type: !73, isLocal: true, isDefinition: true)
!87 = !DIGlobalVariableExpression(var: !88, expr: !DIExpression())
!88 = distinct !DIGlobalVariable(name: "b2_algorithm", scope: !2, file: !3, line: 179, type: !5, isLocal: true, isDefinition: true)
!89 = !DIGlobalVariableExpression(var: !90, expr: !DIExpression())
!90 = distinct !DIGlobalVariable(name: "b2_length", scope: !2, file: !3, line: 180, type: !52, isLocal: true, isDefinition: true)
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "status_only", scope: !2, file: !3, line: 141, type: !82, isLocal: true, isDefinition: true)
!93 = !DIGlobalVariableExpression(var: !94, expr: !DIExpression())
!94 = distinct !DIGlobalVariable(name: "warn", scope: !2, file: !3, line: 145, type: !82, isLocal: true, isDefinition: true)
!95 = !DIGlobalVariableExpression(var: !96, expr: !DIExpression())
!96 = distinct !DIGlobalVariable(name: "quiet", scope: !2, file: !3, line: 151, type: !82, isLocal: true, isDefinition: true)
!97 = !DIGlobalVariableExpression(var: !98, expr: !DIExpression())
!98 = distinct !DIGlobalVariable(name: "ignore_missing", scope: !2, file: !3, line: 148, type: !82, isLocal: true, isDefinition: true)
!99 = !DIGlobalVariableExpression(var: !100, expr: !DIExpression())
!100 = distinct !DIGlobalVariable(name: "strict", scope: !2, file: !3, line: 155, type: !82, isLocal: true, isDefinition: true)
!101 = !DIGlobalVariableExpression(var: !102, expr: !DIExpression())
!102 = distinct !DIGlobalVariable(name: "delim", scope: !2, file: !3, line: 161, type: !77, isLocal: true, isDefinition: true)
!103 = !DIGlobalVariableExpression(var: !104, expr: !DIExpression())
!104 = distinct !DIGlobalVariable(name: "blake2_max_len", scope: !2, file: !3, line: 185, type: !105, isLocal: true, isDefinition: true)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 64, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 1)
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(name: "algorithm_in_string", scope: !2, file: !3, line: 164, type: !110, isLocal: true, isDefinition: true)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 128, elements: !114)
!111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !112)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !71)
!114 = !{!115}
!115 = !DISubrange(count: 2)
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(name: "bin2hex", scope: !118, file: !3, line: 730, type: !217, isLocal: true, isDefinition: true)
!118 = distinct !DISubprogram(name: "digest_check", scope: !3, file: !3, line: 652, type: !119, isLocal: true, isDefinition: true, scopeLine: 653, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !121)
!119 = !DISubroutineType(types: !120)
!120 = !{!82, !112}
!121 = !{!122, !123, !176, !177, !178, !179, !180, !181, !182, !186, !187, !188, !189, !190, !191, !193, !194, !195, !199, !202, !203, !204, !208, !209, !215}
!122 = !DILocalVariable(name: "checkfile_name", arg: 1, scope: !118, file: !3, line: 652, type: !112)
!123 = !DILocalVariable(name: "checkfile_stream", scope: !118, file: !3, line: 654, type: !124)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !126, line: 7, baseType: !127)
!126 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !128, line: 49, size: 1728, elements: !129)
!128 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!129 = !{!130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !145, !147, !148, !149, !152, !153, !155, !157, !160, !162, !165, !168, !169, !170, !171, !172}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !127, file: !128, line: 51, baseType: !75, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !127, file: !128, line: 54, baseType: !70, size: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !127, file: !128, line: 55, baseType: !70, size: 64, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !127, file: !128, line: 56, baseType: !70, size: 64, offset: 192)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !127, file: !128, line: 57, baseType: !70, size: 64, offset: 256)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !127, file: !128, line: 58, baseType: !70, size: 64, offset: 320)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !127, file: !128, line: 59, baseType: !70, size: 64, offset: 384)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !127, file: !128, line: 60, baseType: !70, size: 64, offset: 448)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !127, file: !128, line: 61, baseType: !70, size: 64, offset: 512)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !127, file: !128, line: 64, baseType: !70, size: 64, offset: 576)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !127, file: !128, line: 65, baseType: !70, size: 64, offset: 640)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !127, file: !128, line: 66, baseType: !70, size: 64, offset: 704)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !127, file: !128, line: 68, baseType: !143, size: 64, offset: 768)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !128, line: 36, flags: DIFlagFwdDecl)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !127, file: !128, line: 70, baseType: !146, size: 64, offset: 832)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !127, file: !128, line: 72, baseType: !75, size: 32, offset: 896)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !127, file: !128, line: 73, baseType: !75, size: 32, offset: 928)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !127, file: !128, line: 74, baseType: !150, size: 64, offset: 960)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !55, line: 150, baseType: !151)
!151 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !127, file: !128, line: 77, baseType: !78, size: 16, offset: 1024)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !127, file: !128, line: 78, baseType: !154, size: 8, offset: 1040)
!154 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !127, file: !128, line: 79, baseType: !156, size: 8, offset: 1048)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 8, elements: !106)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !127, file: !128, line: 81, baseType: !158, size: 64, offset: 1088)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !128, line: 43, baseType: null)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !127, file: !128, line: 89, baseType: !161, size: 64, offset: 1152)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !55, line: 151, baseType: !151)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !127, file: !128, line: 91, baseType: !163, size: 64, offset: 1216)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !128, line: 37, flags: DIFlagFwdDecl)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !127, file: !128, line: 92, baseType: !166, size: 64, offset: 1280)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !128, line: 38, flags: DIFlagFwdDecl)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !127, file: !128, line: 93, baseType: !146, size: 64, offset: 1344)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !127, file: !128, line: 94, baseType: !72, size: 64, offset: 1408)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !127, file: !128, line: 95, baseType: !73, size: 64, offset: 1472)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !127, file: !128, line: 96, baseType: !75, size: 32, offset: 1536)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !127, file: !128, line: 98, baseType: !173, size: 160, offset: 1568)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 160, elements: !174)
!174 = !{!175}
!175 = !DISubrange(count: 20)
!176 = !DILocalVariable(name: "n_misformatted_lines", scope: !118, file: !3, line: 655, type: !52)
!177 = !DILocalVariable(name: "n_improperly_formatted_lines", scope: !118, file: !3, line: 656, type: !52)
!178 = !DILocalVariable(name: "n_mismatched_checksums", scope: !118, file: !3, line: 657, type: !52)
!179 = !DILocalVariable(name: "n_open_or_read_failures", scope: !118, file: !3, line: 658, type: !52)
!180 = !DILocalVariable(name: "properly_formatted_lines", scope: !118, file: !3, line: 659, type: !82)
!181 = !DILocalVariable(name: "matched_checksums", scope: !118, file: !3, line: 660, type: !82)
!182 = !DILocalVariable(name: "bin_buffer_unaligned", scope: !118, file: !3, line: 661, type: !183)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 576, elements: !184)
!184 = !{!185}
!185 = !DISubrange(count: 72)
!186 = !DILocalVariable(name: "bin_buffer", scope: !118, file: !3, line: 663, type: !76)
!187 = !DILocalVariable(name: "line_number", scope: !118, file: !3, line: 664, type: !52)
!188 = !DILocalVariable(name: "line", scope: !118, file: !3, line: 665, type: !70)
!189 = !DILocalVariable(name: "line_chars_allocated", scope: !118, file: !3, line: 666, type: !73)
!190 = !DILocalVariable(name: "is_stdin", scope: !118, file: !3, line: 667, type: !82)
!191 = !DILocalVariable(name: "filename", scope: !192, file: !3, line: 690, type: !70)
!192 = distinct !DILexicalBlock(scope: !118, file: !3, line: 689, column: 5)
!193 = !DILocalVariable(name: "binary", scope: !192, file: !3, line: 691, type: !75)
!194 = !DILocalVariable(name: "hex_digest", scope: !192, file: !3, line: 692, type: !76)
!195 = !DILocalVariable(name: "line_length", scope: !192, file: !3, line: 693, type: !196)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !197, line: 108, baseType: !198)
!197 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !55, line: 191, baseType: !151)
!199 = !DILocalVariable(name: "ok", scope: !200, file: !3, line: 734, type: !82)
!200 = distinct !DILexicalBlock(scope: !201, file: !3, line: 729, column: 9)
!201 = distinct !DILexicalBlock(scope: !192, file: !3, line: 712, column: 11)
!202 = !DILocalVariable(name: "missing", scope: !200, file: !3, line: 735, type: !82)
!203 = !DILocalVariable(name: "needs_escape", scope: !200, file: !3, line: 738, type: !82)
!204 = !DILocalVariable(name: "digest_bin_bytes", scope: !205, file: !3, line: 762, type: !73)
!205 = distinct !DILexicalBlock(scope: !206, file: !3, line: 761, column: 13)
!206 = distinct !DILexicalBlock(scope: !207, file: !3, line: 755, column: 20)
!207 = distinct !DILexicalBlock(scope: !200, file: !3, line: 744, column: 15)
!208 = !DILocalVariable(name: "cnt", scope: !205, file: !3, line: 763, type: !73)
!209 = !DILocalVariable(name: "__res", scope: !210, file: !3, line: 769, type: !75)
!210 = distinct !DILexicalBlock(scope: !211, file: !3, line: 769, column: 23)
!211 = distinct !DILexicalBlock(scope: !212, file: !3, line: 769, column: 23)
!212 = distinct !DILexicalBlock(scope: !213, file: !3, line: 768, column: 17)
!213 = distinct !DILexicalBlock(scope: !214, file: !3, line: 767, column: 15)
!214 = distinct !DILexicalBlock(scope: !205, file: !3, line: 767, column: 15)
!215 = !DILocalVariable(name: "__res", scope: !216, file: !3, line: 771, type: !75)
!216 = distinct !DILexicalBlock(scope: !211, file: !3, line: 771, column: 27)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 128, elements: !218)
!218 = !{!219}
!219 = !DISubrange(count: 16)
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(name: "bsd_reversed", scope: !2, file: !3, line: 158, type: !75, isLocal: true, isDefinition: true)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(name: "blake2fns", scope: !2, file: !3, line: 181, type: !224, isLocal: true, isDefinition: true)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !225, size: 64, elements: !106)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "blake2fn", file: !226, line: 17, baseType: !227)
!226 = !DIFile(filename: "src/blake2/b2sum.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{!75, !124, !72, !73}
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(name: "algorithm_out_string", scope: !2, file: !3, line: 168, type: !110, isLocal: true, isDefinition: true)
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, size: 3584, elements: !242)
!233 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !234)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !235, line: 50, size: 256, elements: !236)
!235 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!236 = !{!237, !238, !239, !241}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !234, file: !235, line: 52, baseType: !112, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !234, file: !235, line: 55, baseType: !75, size: 32, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !234, file: !235, line: 56, baseType: !240, size: 64, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !234, file: !235, line: 57, baseType: !75, size: 32, offset: 192)
!242 = !{!243}
!243 = !DISubrange(count: 14)
!244 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!245 = !DIGlobalVariableExpression(var: !94, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!246 = !DIGlobalVariableExpression(var: !96, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!247 = !DIGlobalVariableExpression(var: !98, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!248 = !DIGlobalVariableExpression(var: !100, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!249 = !DIGlobalVariableExpression(var: !102, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 18446744073709551606, DW_OP_mul, DW_OP_constu, 10, DW_OP_plus, DW_OP_stack_value))
!250 = !DIGlobalVariableExpression(var: !84, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 3, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!251 = !DIGlobalVariableExpression(var: !81, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(name: "blake2b_IV", scope: !254, file: !255, line: 23, type: !296, isLocal: true, isDefinition: true)
!254 = distinct !DICompileUnit(language: DW_LANG_C99, file: !255, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !256, retainedTypes: !265, globals: !276)
!255 = !DIFile(filename: "src/blake2/blake2b-ref.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!256 = !{!257}
!257 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "blake2b_constant", file: !258, line: 40, baseType: !6, size: 32, elements: !259)
!258 = !DIFile(filename: "src/blake2/blake2.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!259 = !{!260, !261, !262, !263, !264}
!260 = !DIEnumerator(name: "BLAKE2B_BLOCKBYTES", value: 128, isUnsigned: true)
!261 = !DIEnumerator(name: "BLAKE2B_OUTBYTES", value: 64, isUnsigned: true)
!262 = !DIEnumerator(name: "BLAKE2B_KEYBYTES", value: 64, isUnsigned: true)
!263 = !DIEnumerator(name: "BLAKE2B_SALTBYTES", value: 16, isUnsigned: true)
!264 = !DIEnumerator(name: "BLAKE2B_PERSONALBYTES", value: 16, isUnsigned: true)
!265 = !{!266, !268, !271, !72, !273, !275}
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !268)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !269, line: 24, baseType: !270)
!269 = !DIFile(filename: "/usr/include/bits/stdint-uintn.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !55, line: 37, baseType: !77)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !77)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !269, line: 27, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !55, line: 44, baseType: !51)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!276 = !{!252, !277, !291}
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(name: "memset_v", scope: !279, file: !280, line: 156, type: !286, isLocal: true, isDefinition: true)
!279 = distinct !DISubprogram(name: "secure_zero_memory", scope: !280, file: !280, line: 154, type: !281, isLocal: true, isDefinition: true, scopeLine: 155, flags: DIFlagPrototyped, isOptimized: true, unit: !254, retainedNodes: !283)
!280 = !DIFile(filename: "src/blake2/blake2-impl.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!281 = !DISubroutineType(types: !282)
!282 = !{null, !72, !73}
!283 = !{!284, !285}
!284 = !DILocalVariable(name: "v", arg: 1, scope: !279, file: !280, line: 154, type: !72)
!285 = !DILocalVariable(name: "n", arg: 2, scope: !279, file: !280, line: 154, type: !73)
!286 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !287)
!287 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !288)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DISubroutineType(types: !290)
!290 = !{!72, !72, !75, !73}
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "blake2b_sigma", scope: !254, file: !255, line: 31, type: !293, isLocal: true, isDefinition: true)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 1536, elements: !294)
!294 = !{!295, !219}
!295 = !DISubrange(count: 12)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !297, size: 512, elements: !298)
!297 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !273)
!298 = !{!299}
!299 = !DISubrange(count: 8)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(name: "Version", scope: !302, file: !303, line: 2, type: !112, isDefinition: true)
!302 = distinct !DICompileUnit(language: DW_LANG_C99, file: !303, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !304, globals: !305)
!303 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!304 = !{}
!305 = !{!300}
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !308, file: !313, line: 69, type: !314, isDefinition: true)
!308 = distinct !DICompileUnit(language: DW_LANG_C99, file: !309, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !310, retainedTypes: !311, globals: !312)
!309 = !DIFile(filename: "./lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!310 = !{!9}
!311 = !{!72, !77}
!312 = !{!306}
!313 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !315, line: 55, baseType: !316)
!315 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DISubroutineType(types: !318)
!318 = !{null}
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(name: "file_name", scope: !321, file: !326, line: 46, type: !112, isLocal: true, isDefinition: true)
!321 = distinct !DICompileUnit(language: DW_LANG_C99, file: !322, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !304, globals: !323)
!322 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!323 = !{!319, !324}
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !321, file: !326, line: 56, type: !82, isLocal: true, isDefinition: true)
!326 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "exit_failure", scope: !329, file: !332, line: 24, type: !333, isDefinition: true)
!329 = distinct !DICompileUnit(language: DW_LANG_C99, file: !330, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !304, globals: !331)
!330 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!331 = !{!327}
!332 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!333 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !75)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "program_name", scope: !336, file: !340, line: 33, type: !112, isDefinition: true)
!336 = distinct !DICompileUnit(language: DW_LANG_C99, file: !337, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !304, retainedTypes: !338, globals: !339)
!337 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!338 = !{!72, !70}
!339 = !{!334}
!340 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !343, file: !355, line: 85, type: !388, isDefinition: true)
!343 = distinct !DICompileUnit(language: DW_LANG_C99, file: !344, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !345, retainedTypes: !351, globals: !352)
!344 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!345 = !{!9, !346, !31}
!346 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !10, line: 242, baseType: !6, size: 32, elements: !347)
!347 = !{!348, !349, !350}
!348 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!349 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!350 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!351 = !{!75, !78, !73, !70}
!352 = !{!341, !353, !360, !370, !372, !377, !384, !386}
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !343, file: !355, line: 101, type: !356, isDefinition: true)
!355 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !357, size: 320, elements: !358)
!357 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!358 = !{!359}
!359 = !DISubrange(count: 10)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !343, file: !355, line: 1052, type: !362, isDefinition: true)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !355, line: 65, size: 448, elements: !363)
!363 = !{!364, !365, !366, !368, !369}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !362, file: !355, line: 68, baseType: !9, size: 32)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !362, file: !355, line: 71, baseType: !75, size: 32, offset: 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !362, file: !355, line: 75, baseType: !367, size: 256, offset: 64)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !298)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !362, file: !355, line: 78, baseType: !112, size: 64, offset: 320)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !362, file: !355, line: 81, baseType: !112, size: 64, offset: 384)
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !343, file: !355, line: 116, type: !362, isLocal: true, isDefinition: true)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "slot0", scope: !343, file: !355, line: 842, type: !374, isLocal: true, isDefinition: true)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 2048, elements: !375)
!375 = !{!376}
!376 = !DISubrange(count: 256)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "slotvec", scope: !343, file: !355, line: 845, type: !379, isLocal: true, isDefinition: true)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !355, line: 834, size: 128, elements: !381)
!381 = !{!382, !383}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !380, file: !355, line: 836, baseType: !73, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !380, file: !355, line: 837, baseType: !70, size: 64, offset: 64)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(name: "nslots", scope: !343, file: !355, line: 843, type: !75, isLocal: true, isDefinition: true)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "slotvec0", scope: !343, file: !355, line: 844, type: !380, isLocal: true, isDefinition: true)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 704, elements: !389)
!389 = !{!390}
!390 = !DISubrange(count: 11)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !393, file: !396, line: 26, type: !397, isDefinition: true)
!393 = distinct !DICompileUnit(language: DW_LANG_C99, file: !394, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !304, globals: !395)
!394 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!395 = !{!391}
!396 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 376, elements: !398)
!398 = !{!399}
!399 = !DISubrange(count: 47)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !402, file: !403, line: 339, type: !75, isLocal: true, isDefinition: true)
!402 = distinct !DISubprogram(name: "rpl_fcntl", scope: !403, file: !403, line: 276, type: !404, isDefinition: true, scopeLine: 277, flags: DIFlagPrototyped, isOptimized: true, unit: !406, retainedNodes: !409)
!403 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!404 = !DISubroutineType(types: !405)
!405 = !{!75, !75, !75, null}
!406 = distinct !DICompileUnit(language: DW_LANG_C99, file: !407, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !304, globals: !408)
!407 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!408 = !{!400}
!409 = !{!410, !411, !412, !423, !424, !427, !430, !433}
!410 = !DILocalVariable(name: "fd", arg: 1, scope: !402, file: !403, line: 276, type: !75)
!411 = !DILocalVariable(name: "action", arg: 2, scope: !402, file: !403, line: 276, type: !75)
!412 = !DILocalVariable(name: "arg", scope: !402, file: !403, line: 278, type: !413)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !414, line: 30, baseType: !415)
!414 = !DIFile(filename: "/usr/lib/clang/7.0.0/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !407, line: 278, baseType: !416)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !417, size: 192, elements: !106)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !407, line: 278, size: 192, elements: !418)
!418 = !{!419, !420, !421, !422}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !417, file: !407, line: 278, baseType: !6, size: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !417, file: !407, line: 278, baseType: !6, size: 32, offset: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !417, file: !407, line: 278, baseType: !72, size: 64, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !417, file: !407, line: 278, baseType: !72, size: 64, offset: 128)
!423 = !DILocalVariable(name: "result", scope: !402, file: !403, line: 279, type: !75)
!424 = !DILocalVariable(name: "target", scope: !425, file: !403, line: 326, type: !75)
!425 = distinct !DILexicalBlock(scope: !426, file: !403, line: 325, column: 7)
!426 = distinct !DILexicalBlock(scope: !402, file: !403, line: 282, column: 5)
!427 = !DILocalVariable(name: "flags", scope: !428, file: !403, line: 363, type: !75)
!428 = distinct !DILexicalBlock(scope: !429, file: !403, line: 362, column: 11)
!429 = distinct !DILexicalBlock(scope: !425, file: !403, line: 361, column: 13)
!430 = !DILocalVariable(name: "saved_errno", scope: !431, file: !403, line: 366, type: !75)
!431 = distinct !DILexicalBlock(scope: !432, file: !403, line: 365, column: 15)
!432 = distinct !DILexicalBlock(scope: !428, file: !403, line: 364, column: 17)
!433 = !DILocalVariable(name: "p", scope: !434, file: !403, line: 408, type: !72)
!434 = distinct !DILexicalBlock(scope: !426, file: !403, line: 406, column: 7)
!435 = distinct !DICompileUnit(language: DW_LANG_C99, file: !436, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !304, retainedTypes: !437, globals: !438)
!436 = !DIFile(filename: "src/blake2/b2sum.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!437 = !{!275}
!438 = !{!439}
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(name: "buffer_length", scope: !441, file: !436, line: 35, type: !503, isLocal: true, isDefinition: true)
!441 = distinct !DISubprogram(name: "blake2b_stream", scope: !436, file: !436, line: 30, type: !442, isDefinition: true, scopeLine: 31, flags: DIFlagPrototyped, isOptimized: true, unit: !435, retainedNodes: !478)
!442 = !DISubroutineType(types: !443)
!443 = !{!75, !444, !72, !73}
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !126, line: 7, baseType: !446)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !128, line: 49, size: 1728, elements: !447)
!447 = !{!448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !446, file: !128, line: 51, baseType: !75, size: 32)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !446, file: !128, line: 54, baseType: !70, size: 64, offset: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !446, file: !128, line: 55, baseType: !70, size: 64, offset: 128)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !446, file: !128, line: 56, baseType: !70, size: 64, offset: 192)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !446, file: !128, line: 57, baseType: !70, size: 64, offset: 256)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !446, file: !128, line: 58, baseType: !70, size: 64, offset: 320)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !446, file: !128, line: 59, baseType: !70, size: 64, offset: 384)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !446, file: !128, line: 60, baseType: !70, size: 64, offset: 448)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !446, file: !128, line: 61, baseType: !70, size: 64, offset: 512)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !446, file: !128, line: 64, baseType: !70, size: 64, offset: 576)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !446, file: !128, line: 65, baseType: !70, size: 64, offset: 640)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !446, file: !128, line: 66, baseType: !70, size: 64, offset: 704)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !446, file: !128, line: 68, baseType: !143, size: 64, offset: 768)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !446, file: !128, line: 70, baseType: !462, size: 64, offset: 832)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !446, file: !128, line: 72, baseType: !75, size: 32, offset: 896)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !446, file: !128, line: 73, baseType: !75, size: 32, offset: 928)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !446, file: !128, line: 74, baseType: !150, size: 64, offset: 960)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !446, file: !128, line: 77, baseType: !78, size: 16, offset: 1024)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !446, file: !128, line: 78, baseType: !154, size: 8, offset: 1040)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !446, file: !128, line: 79, baseType: !156, size: 8, offset: 1048)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !446, file: !128, line: 81, baseType: !158, size: 64, offset: 1088)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !446, file: !128, line: 89, baseType: !161, size: 64, offset: 1152)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !446, file: !128, line: 91, baseType: !163, size: 64, offset: 1216)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !446, file: !128, line: 92, baseType: !166, size: 64, offset: 1280)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !446, file: !128, line: 93, baseType: !462, size: 64, offset: 1344)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !446, file: !128, line: 94, baseType: !72, size: 64, offset: 1408)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !446, file: !128, line: 95, baseType: !73, size: 64, offset: 1472)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !446, file: !128, line: 96, baseType: !75, size: 32, offset: 1536)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !446, file: !128, line: 98, baseType: !173, size: 160, offset: 1568)
!478 = !{!479, !480, !481, !482, !483, !484, !485, !502}
!479 = !DILocalVariable(name: "stream", arg: 1, scope: !441, file: !436, line: 30, type: !444)
!480 = !DILocalVariable(name: "resstream", arg: 2, scope: !441, file: !436, line: 30, type: !72)
!481 = !DILocalVariable(name: "outbytes", arg: 3, scope: !441, file: !436, line: 30, type: !73)
!482 = !DILocalVariable(name: "ret", scope: !441, file: !436, line: 32, type: !75)
!483 = !DILocalVariable(name: "sum", scope: !441, file: !436, line: 33, type: !73)
!484 = !DILocalVariable(name: "n", scope: !441, file: !436, line: 33, type: !73)
!485 = !DILocalVariable(name: "S", scope: !441, file: !436, line: 34, type: !486)
!486 = !DICompositeType(tag: DW_TAG_array_type, baseType: !487, size: 1984, elements: !106)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "blake2b_state", file: !258, line: 69, baseType: !488)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "blake2b_state__", file: !258, line: 60, size: 1984, elements: !489)
!489 = !{!490, !492, !494, !495, !499, !500, !501}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !488, file: !258, line: 62, baseType: !491, size: 512)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !273, size: 512, elements: !298)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !488, file: !258, line: 63, baseType: !493, size: 128, offset: 512)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !273, size: 128, elements: !114)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !488, file: !258, line: 64, baseType: !493, size: 128, offset: 640)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !488, file: !258, line: 65, baseType: !496, size: 1024, offset: 768)
!496 = !DICompositeType(tag: DW_TAG_array_type, baseType: !268, size: 1024, elements: !497)
!497 = !{!498}
!498 = !DISubrange(count: 128)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !488, file: !258, line: 66, baseType: !73, size: 64, offset: 1792)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "outlen", scope: !488, file: !258, line: 67, baseType: !73, size: 64, offset: 1856)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "last_node", scope: !488, file: !258, line: 68, baseType: !268, size: 8, offset: 1920)
!502 = !DILocalVariable(name: "buffer", scope: !441, file: !436, line: 36, type: !275)
!503 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !73)
!504 = distinct !DICompileUnit(language: DW_LANG_C99, file: !505, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !506)
!505 = !DIFile(filename: "./lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!506 = !{!60}
!507 = distinct !DICompileUnit(language: DW_LANG_C99, file: !508, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !304)
!508 = !DIFile(filename: "./lib/fopen-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!509 = distinct !DICompileUnit(language: DW_LANG_C99, file: !510, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !304)
!510 = !DIFile(filename: "./lib/dup-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!511 = distinct !DICompileUnit(language: DW_LANG_C99, file: !512, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !513, retainedTypes: !518)
!512 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!513 = !{!514}
!514 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !515, line: 41, baseType: !6, size: 32, elements: !516)
!515 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!516 = !{!517}
!517 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2018, isUnsigned: true)
!518 = !{!72}
!519 = distinct !DICompileUnit(language: DW_LANG_C99, file: !520, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !521, retainedTypes: !535)
!520 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!521 = !{!522}
!522 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !524, file: !523, line: 186, baseType: !6, size: 32, elements: !533)
!523 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!524 = distinct !DISubprogram(name: "x2nrealloc", scope: !523, file: !523, line: 174, type: !525, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: true, unit: !519, retainedNodes: !528)
!525 = !DISubroutineType(types: !526)
!526 = !{!72, !72, !527, !73}
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!528 = !{!529, !530, !531, !532}
!529 = !DILocalVariable(name: "p", arg: 1, scope: !524, file: !523, line: 174, type: !72)
!530 = !DILocalVariable(name: "pn", arg: 2, scope: !524, file: !523, line: 174, type: !527)
!531 = !DILocalVariable(name: "s", arg: 3, scope: !524, file: !523, line: 174, type: !73)
!532 = !DILocalVariable(name: "n", scope: !524, file: !523, line: 176, type: !73)
!533 = !{!534}
!534 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!535 = !{!73, !70, !72}
!536 = distinct !DICompileUnit(language: DW_LANG_C99, file: !537, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !304)
!537 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!538 = distinct !DICompileUnit(language: DW_LANG_C99, file: !539, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !540)
!539 = !DIFile(filename: "./lib/xdectoumax.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!540 = !{!23}
!541 = distinct !DICompileUnit(language: DW_LANG_C99, file: !542, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !543, retainedTypes: !544)
!542 = !DIFile(filename: "./lib/xstrtoul.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!543 = !{!23, !31}
!544 = !{!75, !78}
!545 = distinct !DICompileUnit(language: DW_LANG_C99, file: !546, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !543, retainedTypes: !544)
!546 = !DIFile(filename: "./lib/xstrtoumax.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!547 = distinct !DICompileUnit(language: DW_LANG_C99, file: !548, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !304, retainedTypes: !518)
!548 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!549 = distinct !DICompileUnit(language: DW_LANG_C99, file: !550, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !304)
!550 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!551 = distinct !DICompileUnit(language: DW_LANG_C99, file: !552, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !304, retainedTypes: !518)
!552 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!553 = distinct !DICompileUnit(language: DW_LANG_C99, file: !554, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !304, retainedTypes: !518)
!554 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!555 = distinct !DICompileUnit(language: DW_LANG_C99, file: !556, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !304, retainedTypes: !557)
!556 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!557 = !{!73}
!558 = distinct !DICompileUnit(language: DW_LANG_C99, file: !559, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !304)
!559 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!560 = distinct !DICompileUnit(language: DW_LANG_C99, file: !561, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !304)
!561 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!562 = distinct !DICompileUnit(language: DW_LANG_C99, file: !563, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !564, retainedTypes: !518)
!563 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!564 = !{!565}
!565 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !566, line: 41, baseType: !6, size: 32, elements: !567)
!566 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!567 = !{!568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950}
!568 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!569 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!570 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!571 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!572 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!573 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!574 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!575 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!576 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!577 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!578 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!579 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!580 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!581 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!582 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!583 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!584 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!585 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!586 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!587 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!588 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!589 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!590 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!591 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!592 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!593 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!594 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!595 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!596 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!597 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!598 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!599 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!600 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!601 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!602 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!603 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!604 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!605 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!606 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!607 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!608 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!609 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!610 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!611 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!612 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!613 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!614 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!615 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!616 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!617 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!618 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!619 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!620 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!621 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!622 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!623 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!624 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!625 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!626 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!627 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!628 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!629 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!630 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!631 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!632 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!633 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!634 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!635 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!636 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!637 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!661 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!662 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!663 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!664 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!665 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!666 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!667 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!668 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!669 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!670 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!671 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!672 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!673 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!674 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!675 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!676 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!677 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!678 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!679 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!680 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!681 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!682 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!683 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!684 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!685 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!686 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!687 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!688 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!689 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!690 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!691 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!692 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!693 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!694 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!695 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!696 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!697 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!698 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!699 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!700 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!701 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!702 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!703 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!704 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!705 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!706 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!707 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!708 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!709 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!710 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!711 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!712 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!713 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!714 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!715 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!716 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!717 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!719 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!720 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!721 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!722 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!723 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!724 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!725 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!726 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!727 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!728 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!729 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!730 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!731 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!732 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!733 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!734 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!735 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!736 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!737 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!738 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!739 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!740 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!741 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!742 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!743 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!744 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!745 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!746 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!747 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!748 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!749 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!750 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!751 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!752 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!753 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!754 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!755 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!756 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!757 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!758 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!759 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!760 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!761 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!762 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!763 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!764 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!765 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!766 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!767 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!768 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!769 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!770 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!771 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!772 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!773 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!774 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!779 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!780 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!781 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!782 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!783 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!784 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!785 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!786 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!787 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!788 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!789 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!790 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!791 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!793 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!794 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!795 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!796 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!797 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!798 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!799 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!800 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!801 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!802 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!803 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!804 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!805 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!806 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!807 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!808 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!809 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!810 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!812 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!813 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!814 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!815 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!816 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!817 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!818 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!819 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!820 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!821 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!822 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!823 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!824 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!825 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!826 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!827 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!828 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!829 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!830 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!831 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!832 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!833 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!834 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!835 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!836 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!837 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!838 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!839 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!840 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!841 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!842 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!843 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!844 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!845 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!846 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!847 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!848 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!849 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!850 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!852 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!853 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!854 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!855 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!856 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!857 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!883 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!884 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!885 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!886 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!887 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!892 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!893 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!894 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!895 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!896 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!898 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!899 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!900 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!901 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!902 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!903 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!904 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!905 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!906 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!907 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!908 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!909 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!910 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!911 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!912 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!913 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!914 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!915 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!916 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!917 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!918 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!919 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!920 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!921 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!922 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!923 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!924 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!925 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!926 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!927 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!928 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!929 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!930 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!931 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!932 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!933 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!934 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!935 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!936 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!937 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!938 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!939 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!940 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!941 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!942 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!943 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!944 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!945 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!946 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!947 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!948 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!949 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!950 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!951 = !{!"clang version 7.0.0 (tags/RELEASE_700/final)"}
!952 = !{i32 2, !"Dwarf Version", i32 4}
!953 = !{i32 2, !"Debug Info Version", i32 3}
!954 = !{i32 1, !"wchar_size", i32 4}
!955 = !{i32 7, !"PIC Level", i32 2}
!956 = !{i32 7, !"PIE Level", i32 2}
!957 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 223, type: !958, isDefinition: true, scopeLine: 224, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, retainedNodes: !960)
!958 = !DISubroutineType(types: !959)
!959 = !{null, !75}
!960 = !{!961}
!961 = !DILocalVariable(name: "status", arg: 1, scope: !957, file: !3, line: 223, type: !75)
!962 = !DILocalVariable(name: "infomap", scope: !963, file: !47, line: 632, type: !977)
!963 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !47, file: !47, line: 630, type: !964, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !966)
!964 = !DISubroutineType(types: !965)
!965 = !{null, !112}
!966 = !{!967, !962, !968, !969, !976}
!967 = !DILocalVariable(name: "program", arg: 1, scope: !963, file: !47, line: 630, type: !112)
!968 = !DILocalVariable(name: "node", scope: !963, file: !47, line: 642, type: !112)
!969 = !DILocalVariable(name: "map_prog", scope: !963, file: !47, line: 643, type: !970)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !972)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !963, file: !47, line: 632, size: 128, elements: !973)
!973 = !{!974, !975}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !972, file: !47, line: 632, baseType: !112, size: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !972, file: !47, line: 632, baseType: !112, size: 64, offset: 64)
!976 = !DILocalVariable(name: "lc_messages", scope: !963, file: !47, line: 655, type: !112)
!977 = !DICompositeType(tag: DW_TAG_array_type, baseType: !971, size: 896, elements: !978)
!978 = !{!979}
!979 = !DISubrange(count: 7)
!980 = !DILocation(line: 632, column: 67, scope: !963, inlinedAt: !981)
!981 = distinct !DILocation(line: 292, column: 7, scope: !982)
!982 = distinct !DILexicalBlock(scope: !983, file: !3, line: 228, column: 5)
!983 = distinct !DILexicalBlock(scope: !957, file: !3, line: 225, column: 7)
!984 = !DILocation(line: 223, column: 12, scope: !957)
!985 = !DILocation(line: 225, column: 14, scope: !983)
!986 = !DILocation(line: 225, column: 7, scope: !957)
!987 = !DILocation(line: 226, column: 5, scope: !988)
!988 = distinct !DILexicalBlock(scope: !983, file: !3, line: 226, column: 5)
!989 = !{!990, !990, i64 0}
!990 = !{!"any pointer", !991, i64 0}
!991 = !{!"omnipotent char", !992, i64 0}
!992 = !{!"Simple C/C++ TBAA"}
!993 = !DILocation(line: 229, column: 7, scope: !982)
!994 = !DILocation(line: 580, column: 3, scope: !995, inlinedAt: !996)
!995 = distinct !DISubprogram(name: "emit_stdin_note", scope: !47, file: !47, line: 578, type: !317, isLocal: true, isDefinition: true, scopeLine: 579, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !304)
!996 = distinct !DILocation(line: 237, column: 7, scope: !982)
!997 = !DILocation(line: 244, column: 9, scope: !998)
!998 = distinct !DILexicalBlock(scope: !982, file: !3, line: 238, column: 11)
!999 = !DILocation(line: 249, column: 7, scope: !982)
!1000 = !DILocation(line: 253, column: 9, scope: !982)
!1001 = !DILocation(line: 258, column: 7, scope: !982)
!1002 = !DILocation(line: 266, column: 9, scope: !1003)
!1003 = distinct !DILexicalBlock(scope: !982, file: !3, line: 261, column: 11)
!1004 = !DILocation(line: 269, column: 7, scope: !982)
!1005 = !DILocation(line: 273, column: 7, scope: !982)
!1006 = !DILocation(line: 283, column: 7, scope: !982)
!1007 = !DILocation(line: 284, column: 7, scope: !982)
!1008 = !DILocation(line: 285, column: 7, scope: !982)
!1009 = !DILocation(line: 632, column: 3, scope: !963, inlinedAt: !981)
!1010 = !DILocation(line: 643, column: 36, scope: !963, inlinedAt: !981)
!1011 = !DILocation(line: 643, column: 25, scope: !963, inlinedAt: !981)
!1012 = !DILocation(line: 645, column: 33, scope: !963, inlinedAt: !981)
!1013 = !DILocation(line: 645, column: 3, scope: !963, inlinedAt: !981)
!1014 = !DILocation(line: 646, column: 13, scope: !963, inlinedAt: !981)
!1015 = !DILocation(line: 645, column: 20, scope: !963, inlinedAt: !981)
!1016 = !{!1017, !990, i64 0}
!1017 = !{!"infomap", !990, i64 0, !990, i64 8}
!1018 = !DILocation(line: 645, column: 10, scope: !963, inlinedAt: !981)
!1019 = !DILocation(line: 645, column: 28, scope: !963, inlinedAt: !981)
!1020 = distinct !{!1020, !1021, !1022}
!1021 = !DILocation(line: 645, column: 3, scope: !963)
!1022 = !DILocation(line: 646, column: 13, scope: !963)
!1023 = !DILocation(line: 648, column: 17, scope: !1024, inlinedAt: !981)
!1024 = distinct !DILexicalBlock(scope: !963, file: !47, line: 648, column: 7)
!1025 = !{!1017, !990, i64 8}
!1026 = !DILocation(line: 648, column: 7, scope: !1024, inlinedAt: !981)
!1027 = !DILocation(line: 648, column: 7, scope: !963, inlinedAt: !981)
!1028 = !DILocation(line: 642, column: 15, scope: !963, inlinedAt: !981)
!1029 = !DILocation(line: 651, column: 3, scope: !963, inlinedAt: !981)
!1030 = !DILocation(line: 655, column: 29, scope: !963, inlinedAt: !981)
!1031 = !DILocation(line: 655, column: 15, scope: !963, inlinedAt: !981)
!1032 = !DILocation(line: 656, column: 7, scope: !1033, inlinedAt: !981)
!1033 = distinct !DILexicalBlock(scope: !963, file: !47, line: 656, column: 7)
!1034 = !DILocation(line: 656, column: 19, scope: !1033, inlinedAt: !981)
!1035 = !DILocation(line: 656, column: 22, scope: !1033, inlinedAt: !981)
!1036 = !DILocation(line: 656, column: 7, scope: !963, inlinedAt: !981)
!1037 = !DILocation(line: 662, column: 7, scope: !1038, inlinedAt: !981)
!1038 = distinct !DILexicalBlock(scope: !1033, file: !47, line: 657, column: 5)
!1039 = !DILocation(line: 664, column: 5, scope: !1038, inlinedAt: !981)
!1040 = !DILocation(line: 665, column: 3, scope: !963, inlinedAt: !981)
!1041 = !DILocation(line: 667, column: 3, scope: !963, inlinedAt: !981)
!1042 = !DILocation(line: 669, column: 1, scope: !963, inlinedAt: !981)
!1043 = !DILocation(line: 295, column: 3, scope: !957)
!1044 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 861, type: !1045, isDefinition: true, scopeLine: 862, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1048)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{!75, !75, !1047}
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!1048 = !{!1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1063, !1066, !1069, !1070, !1073}
!1049 = !DILocalVariable(name: "argc", arg: 1, scope: !1044, file: !3, line: 861, type: !75)
!1050 = !DILocalVariable(name: "argv", arg: 2, scope: !1044, file: !3, line: 861, type: !1047)
!1051 = !DILocalVariable(name: "bin_buffer_unaligned", scope: !1044, file: !3, line: 863, type: !183)
!1052 = !DILocalVariable(name: "bin_buffer", scope: !1044, file: !3, line: 865, type: !76)
!1053 = !DILocalVariable(name: "do_check", scope: !1044, file: !3, line: 866, type: !82)
!1054 = !DILocalVariable(name: "opt", scope: !1044, file: !3, line: 867, type: !75)
!1055 = !DILocalVariable(name: "ok", scope: !1044, file: !3, line: 868, type: !82)
!1056 = !DILocalVariable(name: "binary", scope: !1044, file: !3, line: 869, type: !75)
!1057 = !DILocalVariable(name: "prefix_tag", scope: !1044, file: !3, line: 870, type: !82)
!1058 = !DILocalVariable(name: "short_opts", scope: !1044, file: !3, line: 886, type: !112)
!1059 = !DILocalVariable(name: "b2_length_str", scope: !1044, file: !3, line: 887, type: !112)
!1060 = !DILocalVariable(name: "operand_lim", scope: !1044, file: !3, line: 1038, type: !1047)
!1061 = !DILocalVariable(name: "operandp", scope: !1062, file: !3, line: 1042, type: !1047)
!1062 = distinct !DILexicalBlock(scope: !1044, file: !3, line: 1042, column: 3)
!1063 = !DILocalVariable(name: "file", scope: !1064, file: !3, line: 1044, type: !70)
!1064 = distinct !DILexicalBlock(scope: !1065, file: !3, line: 1043, column: 5)
!1065 = distinct !DILexicalBlock(scope: !1062, file: !3, line: 1042, column: 3)
!1066 = !DILocalVariable(name: "file_is_binary", scope: !1067, file: !3, line: 1050, type: !75)
!1067 = distinct !DILexicalBlock(scope: !1068, file: !3, line: 1049, column: 9)
!1068 = distinct !DILexicalBlock(scope: !1064, file: !3, line: 1046, column: 11)
!1069 = !DILocalVariable(name: "missing", scope: !1067, file: !3, line: 1051, type: !82)
!1070 = !DILocalVariable(name: "needs_escape", scope: !1071, file: !3, line: 1064, type: !82)
!1071 = distinct !DILexicalBlock(scope: !1072, file: !3, line: 1056, column: 13)
!1072 = distinct !DILexicalBlock(scope: !1067, file: !3, line: 1053, column: 15)
!1073 = !DILocalVariable(name: "i", scope: !1074, file: !3, line: 1089, type: !73)
!1074 = distinct !DILexicalBlock(scope: !1071, file: !3, line: 1089, column: 15)
!1075 = !DILocation(line: 661, column: 17, scope: !118, inlinedAt: !1076)
!1076 = distinct !DILocation(line: 1047, column: 15, scope: !1068)
!1077 = !DILocation(line: 861, column: 11, scope: !1044)
!1078 = !DILocation(line: 861, column: 24, scope: !1044)
!1079 = !DILocation(line: 863, column: 3, scope: !1044)
!1080 = !DILocation(line: 863, column: 17, scope: !1044)
!1081 = !DILocalVariable(name: "ptr", arg: 1, scope: !1082, file: !47, line: 498, type: !1085)
!1082 = distinct !DISubprogram(name: "ptr_align", scope: !47, file: !47, line: 498, type: !1083, isLocal: true, isDefinition: true, scopeLine: 499, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1087)
!1083 = !DISubroutineType(types: !1084)
!1084 = !{!72, !1085, !73}
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64)
!1086 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1087 = !{!1081, !1088, !1089, !1090}
!1088 = !DILocalVariable(name: "alignment", arg: 2, scope: !1082, file: !47, line: 498, type: !73)
!1089 = !DILocalVariable(name: "p0", scope: !1082, file: !47, line: 500, type: !112)
!1090 = !DILocalVariable(name: "p1", scope: !1082, file: !47, line: 501, type: !112)
!1091 = !DILocation(line: 498, column: 24, scope: !1082, inlinedAt: !1092)
!1092 = distinct !DILocation(line: 865, column: 31, scope: !1044)
!1093 = !DILocation(line: 498, column: 36, scope: !1082, inlinedAt: !1092)
!1094 = !DILocation(line: 500, column: 15, scope: !1082, inlinedAt: !1092)
!1095 = !DILocation(line: 501, column: 35, scope: !1082, inlinedAt: !1092)
!1096 = !DILocation(line: 501, column: 15, scope: !1082, inlinedAt: !1092)
!1097 = !DILocation(line: 502, column: 25, scope: !1082, inlinedAt: !1092)
!1098 = !DILocation(line: 502, column: 37, scope: !1082, inlinedAt: !1092)
!1099 = !DILocation(line: 502, column: 23, scope: !1082, inlinedAt: !1092)
!1100 = !DILocation(line: 865, column: 18, scope: !1044)
!1101 = !DILocation(line: 866, column: 8, scope: !1044)
!1102 = !DILocation(line: 868, column: 8, scope: !1044)
!1103 = !DILocation(line: 869, column: 7, scope: !1044)
!1104 = !DILocation(line: 870, column: 8, scope: !1044)
!1105 = !DILocation(line: 874, column: 21, scope: !1044)
!1106 = !DILocation(line: 874, column: 3, scope: !1044)
!1107 = !DILocation(line: 875, column: 3, scope: !1044)
!1108 = !DILocation(line: 876, column: 3, scope: !1044)
!1109 = !DILocation(line: 877, column: 3, scope: !1044)
!1110 = !DILocation(line: 879, column: 3, scope: !1044)
!1111 = !DILocation(line: 883, column: 12, scope: !1044)
!1112 = !DILocation(line: 883, column: 3, scope: !1044)
!1113 = !DILocation(line: 892, column: 3, scope: !1044)
!1114 = !DILocation(line: 887, column: 15, scope: !1044)
!1115 = !DILocation(line: 892, column: 17, scope: !1044)
!1116 = !DILocation(line: 867, column: 7, scope: !1044)
!1117 = distinct !{!1117, !1113, !1118}
!1118 = !DILocation(line: 948, column: 7, scope: !1044)
!1119 = !DILocation(line: 897, column: 33, scope: !1120)
!1120 = distinct !DILexicalBlock(scope: !1044, file: !3, line: 894, column: 7)
!1121 = !DILocation(line: 898, column: 33, scope: !1120)
!1122 = !DILocation(line: 897, column: 21, scope: !1120)
!1123 = !DILocation(line: 897, column: 19, scope: !1120)
!1124 = !{!1125, !1125, i64 0}
!1125 = !{!"long", !991, i64 0}
!1126 = !DILocation(line: 899, column: 25, scope: !1120)
!1127 = !DILocation(line: 900, column: 23, scope: !1128)
!1128 = distinct !DILexicalBlock(scope: !1120, file: !3, line: 900, column: 13)
!1129 = !DILocation(line: 900, column: 27, scope: !1128)
!1130 = !DILocation(line: 900, column: 13, scope: !1120)
!1131 = !DILocation(line: 902, column: 26, scope: !1132)
!1132 = distinct !DILexicalBlock(scope: !1128, file: !3, line: 901, column: 11)
!1133 = !DILocation(line: 902, column: 51, scope: !1132)
!1134 = !DILocation(line: 902, column: 13, scope: !1132)
!1135 = !DILocation(line: 903, column: 13, scope: !1132)
!1136 = !DILocation(line: 912, column: 9, scope: !1120)
!1137 = !DILocation(line: 917, column: 9, scope: !1120)
!1138 = !DILocation(line: 920, column: 9, scope: !1120)
!1139 = !DILocation(line: 925, column: 9, scope: !1120)
!1140 = !DILocation(line: 928, column: 9, scope: !1120)
!1141 = !DILocation(line: 933, column: 9, scope: !1120)
!1142 = !DILocation(line: 936, column: 9, scope: !1120)
!1143 = !DILocation(line: 940, column: 9, scope: !1120)
!1144 = !DILocation(line: 943, column: 9, scope: !1120)
!1145 = !DILocation(line: 944, column: 7, scope: !1120)
!1146 = !DILocation(line: 945, column: 7, scope: !1120)
!1147 = !DILocation(line: 947, column: 9, scope: !1120)
!1148 = !DILocation(line: 952, column: 7, scope: !1149)
!1149 = distinct !DILexicalBlock(scope: !1044, file: !3, line: 952, column: 7)
!1150 = !DILocation(line: 952, column: 17, scope: !1149)
!1151 = !DILocation(line: 952, column: 7, scope: !1044)
!1152 = !DILocation(line: 954, column: 20, scope: !1153)
!1153 = distinct !DILexicalBlock(scope: !1149, file: !3, line: 953, column: 5)
!1154 = !DILocation(line: 954, column: 45, scope: !1153)
!1155 = !DILocation(line: 954, column: 7, scope: !1153)
!1156 = !DILocation(line: 955, column: 7, scope: !1153)
!1157 = !{!991, !991, i64 0}
!1158 = !DILocation(line: 960, column: 17, scope: !1159)
!1159 = distinct !DILexicalBlock(scope: !1044, file: !3, line: 960, column: 7)
!1160 = !DILocation(line: 960, column: 27, scope: !1159)
!1161 = !DILocation(line: 960, column: 22, scope: !1159)
!1162 = !DILocation(line: 961, column: 15, scope: !1159)
!1163 = !DILocation(line: 961, column: 5, scope: !1159)
!1164 = !DILocation(line: 962, column: 22, scope: !1044)
!1165 = !DILocation(line: 962, column: 32, scope: !1044)
!1166 = !DILocation(line: 962, column: 20, scope: !1044)
!1167 = !DILocation(line: 967, column: 7, scope: !1168)
!1168 = distinct !DILexicalBlock(scope: !1044, file: !3, line: 967, column: 7)
!1169 = !DILocation(line: 967, column: 18, scope: !1168)
!1170 = !DILocation(line: 967, column: 22, scope: !1168)
!1171 = !DILocation(line: 974, column: 19, scope: !1172)
!1172 = distinct !DILexicalBlock(scope: !1168, file: !3, line: 968, column: 4)
!1173 = !DILocation(line: 974, column: 6, scope: !1172)
!1174 = !DILocation(line: 975, column: 6, scope: !1172)
!1175 = !DILocation(line: 978, column: 21, scope: !1176)
!1176 = distinct !DILexicalBlock(scope: !1044, file: !3, line: 978, column: 7)
!1177 = !DILocation(line: 980, column: 20, scope: !1178)
!1178 = distinct !DILexicalBlock(scope: !1176, file: !3, line: 979, column: 5)
!1179 = !DILocation(line: 980, column: 7, scope: !1178)
