source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.base32_decode_context = type { i32, [8 x i8] }
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [30 x i8] c"Usage: %s [OPTION]... [FILE]\0A\00", align 1
@.str.2 = private unnamed_addr constant [70 x i8] c"Base%d encode or decode FILE, or standard input, to standard output.\0A\00", align 1
@.str.20 = private unnamed_addr constant [56 x i8] c"\0AWith no FILE, or when FILE is -, read standard input.\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 74, type: !197, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !29, globals: !196, nameTableKind: None)
!3 = !DIFile(filename: "src/basenc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !20}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!9 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 45, baseType: !7, size: 32, elements: !22)
!21 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!22 = !{!23, !24, !25, !26, !27, !28}
!23 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0, isUnsigned: true)
!24 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2, isUnsigned: true)
!25 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5, isUnsigned: true)
!26 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4, isUnsigned: true)
!27 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3, isUnsigned: true)
!28 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1, isUnsigned: true)
!29 = !{!30, !40, !101, !105, !109, !112, !115, !122, !137, !34, !91, !141, !145, !149, !153, !156, !159, !163, !167, !179, !183, !93, !36, !187, !192, !193}
!30 = !DISubprogram(name: "dcgettext", scope: !31, file: !31, line: 51, type: !32, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!31 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!32 = !DISubroutineType(types: !33)
!33 = !{!34, !36, !36, !38}
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!38 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!39 = !{}
!40 = !DISubprogram(name: "fputs_unlocked", scope: !41, file: !41, line: 662, type: !42, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!41 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!42 = !DISubroutineType(types: !43)
!43 = !{!38, !36, !44}
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !46, line: 49, size: 1728, elements: !47)
!46 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!47 = !{!48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !63, !64, !65, !66, !70, !72, !74, !78, !81, !83, !86, !89, !90, !92, !96, !97}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !45, file: !46, line: 51, baseType: !38, size: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !45, file: !46, line: 54, baseType: !34, size: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !45, file: !46, line: 55, baseType: !34, size: 64, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !45, file: !46, line: 56, baseType: !34, size: 64, offset: 192)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !45, file: !46, line: 57, baseType: !34, size: 64, offset: 256)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !45, file: !46, line: 58, baseType: !34, size: 64, offset: 320)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !45, file: !46, line: 59, baseType: !34, size: 64, offset: 384)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !45, file: !46, line: 60, baseType: !34, size: 64, offset: 448)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !45, file: !46, line: 61, baseType: !34, size: 64, offset: 512)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !45, file: !46, line: 64, baseType: !34, size: 64, offset: 576)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !45, file: !46, line: 65, baseType: !34, size: 64, offset: 640)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !45, file: !46, line: 66, baseType: !34, size: 64, offset: 704)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !45, file: !46, line: 68, baseType: !61, size: 64, offset: 768)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !46, line: 36, flags: DIFlagFwdDecl)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !45, file: !46, line: 70, baseType: !44, size: 64, offset: 832)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !45, file: !46, line: 72, baseType: !38, size: 32, offset: 896)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !45, file: !46, line: 73, baseType: !38, size: 32, offset: 928)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !45, file: !46, line: 74, baseType: !67, size: 64, offset: 960)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !68, line: 152, baseType: !69)
!68 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!69 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !45, file: !46, line: 77, baseType: !71, size: 16, offset: 1024)
!71 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !45, file: !46, line: 78, baseType: !73, size: 8, offset: 1040)
!73 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !45, file: !46, line: 79, baseType: !75, size: 8, offset: 1048)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 8, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 1)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !45, file: !46, line: 81, baseType: !79, size: 64, offset: 1088)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !46, line: 43, baseType: null)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !45, file: !46, line: 89, baseType: !82, size: 64, offset: 1152)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !68, line: 153, baseType: !69)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !45, file: !46, line: 91, baseType: !84, size: 64, offset: 1216)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !46, line: 37, flags: DIFlagFwdDecl)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !45, file: !46, line: 92, baseType: !87, size: 64, offset: 1280)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !46, line: 38, flags: DIFlagFwdDecl)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !45, file: !46, line: 93, baseType: !44, size: 64, offset: 1344)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !45, file: !46, line: 94, baseType: !91, size: 64, offset: 1408)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !45, file: !46, line: 95, baseType: !93, size: 64, offset: 1472)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !94, line: 46, baseType: !95)
!94 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!95 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !45, file: !46, line: 96, baseType: !38, size: 32, offset: 1536)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !45, file: !46, line: 98, baseType: !98, size: 160, offset: 1568)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 160, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 20)
!101 = !DISubprogram(name: "set_program_name", scope: !102, file: !102, line: 37, type: !103, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!102 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!103 = !DISubroutineType(types: !104)
!104 = !{null, !36}
!105 = !DISubprogram(name: "setlocale", scope: !106, file: !106, line: 122, type: !107, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!106 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!107 = !DISubroutineType(types: !108)
!108 = !{!34, !38, !36}
!109 = !DISubprogram(name: "bindtextdomain", scope: !31, file: !31, line: 86, type: !110, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!110 = !DISubroutineType(types: !111)
!111 = !{!34, !36, !36}
!112 = !DISubprogram(name: "textdomain", scope: !31, file: !31, line: 82, type: !113, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!113 = !DISubroutineType(types: !114)
!114 = !{!34, !36}
!115 = !DISubprogram(name: "atexit", scope: !116, file: !116, line: 595, type: !117, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!116 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!117 = !DISubroutineType(types: !118)
!118 = !{!38, !119}
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{null}
!122 = !DISubprogram(name: "getopt_long", scope: !123, file: !123, line: 66, type: !124, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!123 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!124 = !DISubroutineType(types: !125)
!125 = !{!38, !38, !126, !36, !128, !135}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !130)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !123, line: 50, size: 256, elements: !131)
!131 = !{!132, !133, !134, !136}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !130, file: !123, line: 52, baseType: !36, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !130, file: !123, line: 55, baseType: !38, size: 32, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !130, file: !123, line: 56, baseType: !135, size: 64, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !130, file: !123, line: 57, baseType: !38, size: 32, offset: 192)
!137 = !DISubprogram(name: "xdectoumax", scope: !138, file: !138, line: 31, type: !139, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!138 = !DIFile(filename: "./lib/xdectoint.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!139 = !DISubroutineType(types: !140)
!140 = !{!95, !36, !95, !95, !36, !36, !38}
!141 = !DISubprogram(name: "version_etc", scope: !142, file: !142, line: 69, type: !143, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!142 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!143 = !DISubroutineType(types: !144)
!144 = !{null, !44, !36, !36, !36, null}
!145 = !DISubprogram(name: "quote", scope: !146, file: !146, line: 44, type: !147, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!146 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!147 = !DISubroutineType(types: !148)
!148 = !{!36, !36}
!149 = !DISubprogram(name: "error", scope: !150, file: !150, line: 52, type: !151, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!150 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!151 = !DISubroutineType(types: !152)
!152 = !{null, !38, !38, !36, null}
!153 = !DISubprogram(name: "quotearg_n_style_colon", scope: !6, file: !6, line: 397, type: !154, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!154 = !DISubroutineType(types: !155)
!155 = !{!34, !38, !5, !36}
!156 = !DISubprogram(name: "fadvise", scope: !21, file: !21, line: 72, type: !157, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!157 = !DISubroutineType(types: !158)
!158 = !{null, !44, !20}
!159 = !DISubprogram(name: "rpl_fclose", scope: !160, file: !160, line: 672, type: !161, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!160 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!161 = !DISubroutineType(types: !162)
!162 = !{!38, !44}
!163 = !DISubprogram(name: "xmalloc", scope: !164, file: !164, line: 53, type: !165, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!164 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!165 = !DISubroutineType(types: !166)
!166 = !{!91, !95}
!167 = !DISubprogram(name: "base32_decode_ctx_init", scope: !168, file: !168, line: 44, type: !169, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!168 = !DIFile(filename: "./lib/base32.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!169 = !DISubroutineType(types: !170)
!170 = !{null, !171}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "base32_decode_context", file: !168, line: 31, size: 96, elements: !173)
!173 = !{!174, !175}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !172, file: !168, line: 33, baseType: !7, size: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !172, file: !168, line: 34, baseType: !176, size: 64, offset: 32)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 64, elements: !177)
!177 = !{!178}
!178 = !DISubrange(count: 8)
!179 = !DISubprogram(name: "isbase32", scope: !168, file: !168, line: 37, type: !180, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!180 = !DISubroutineType(types: !181)
!181 = !{!182, !35}
!182 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!183 = !DISubprogram(name: "base32_decode_ctx", scope: !168, file: !168, line: 46, type: !184, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!184 = !DISubroutineType(types: !185)
!185 = !{!182, !171, !36, !95, !34, !186}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!187 = !DISubprogram(name: "fwrite_unlocked", scope: !41, file: !41, line: 675, type: !188, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!188 = !DISubroutineType(types: !189)
!189 = !{!95, !190, !95, !95, !44}
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!192 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!193 = !DISubprogram(name: "base32_encode", scope: !168, file: !168, line: 39, type: !194, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!194 = !DISubroutineType(types: !195)
!195 = !{null, !36, !95, !34, !95}
!196 = !{!0}
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 1536, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 6)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(name: "Version", scope: !202, file: !203, line: 2, type: !36, isDefinition: true)
!202 = distinct !DICompileUnit(language: DW_LANG_C99, file: !203, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !39, globals: !204, nameTableKind: None)
!203 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!204 = !{!200}
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(name: "b32str", scope: !207, file: !208, line: 68, type: !230, isLocal: true, isDefinition: true)
!207 = distinct !DISubprogram(name: "base32_encode", scope: !208, file: !208, line: 65, type: !209, scopeLine: 67, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !213, retainedNodes: !225)
!208 = !DIFile(filename: "lib/base32.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!209 = !DISubroutineType(types: !210)
!210 = !{null, !211, !93, !212, !93}
!211 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !36)
!212 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !34)
!213 = distinct !DICompileUnit(language: DW_LANG_C99, file: !208, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !39, retainedTypes: !214, globals: !218, nameTableKind: None)
!214 = !{!91, !215, !34}
!215 = !DISubprogram(name: "free", scope: !116, file: !116, line: 565, type: !216, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!216 = !DISubroutineType(types: !217)
!217 = !{null, !91}
!218 = !{!205, !219}
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(name: "b32", scope: !213, file: !208, line: 209, type: !221, isLocal: true, isDefinition: true)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 2048, elements: !223)
!222 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !73)
!223 = !{!224}
!224 = !DISubrange(count: 256)
!225 = !{!226, !227, !228, !229}
!226 = !DILocalVariable(name: "in", arg: 1, scope: !207, file: !208, line: 65, type: !211)
!227 = !DILocalVariable(name: "inlen", arg: 2, scope: !207, file: !208, line: 65, type: !93)
!228 = !DILocalVariable(name: "out", arg: 3, scope: !207, file: !208, line: 66, type: !212)
!229 = !DILocalVariable(name: "outlen", arg: 4, scope: !207, file: !208, line: 66, type: !93)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 256, elements: !231)
!231 = !{!232}
!232 = !DISubrange(count: 32)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(name: "file_name", scope: !235, file: !236, line: 46, type: !36, isLocal: true, isDefinition: true)
!235 = distinct !DICompileUnit(language: DW_LANG_C99, file: !236, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !39, retainedTypes: !237, globals: !275, nameTableKind: None)
!236 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!237 = !{!238, !30, !274, !149}
!238 = !DISubprogram(name: "close_stream", scope: !239, file: !239, line: 2, type: !240, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!239 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!240 = !DISubroutineType(types: !241)
!241 = !{!38, !242}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !46, line: 49, size: 1728, elements: !244)
!244 = !{!245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !243, file: !46, line: 51, baseType: !38, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !243, file: !46, line: 54, baseType: !34, size: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !243, file: !46, line: 55, baseType: !34, size: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !243, file: !46, line: 56, baseType: !34, size: 64, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !243, file: !46, line: 57, baseType: !34, size: 64, offset: 256)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !243, file: !46, line: 58, baseType: !34, size: 64, offset: 320)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !243, file: !46, line: 59, baseType: !34, size: 64, offset: 384)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !243, file: !46, line: 60, baseType: !34, size: 64, offset: 448)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !243, file: !46, line: 61, baseType: !34, size: 64, offset: 512)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !243, file: !46, line: 64, baseType: !34, size: 64, offset: 576)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !243, file: !46, line: 65, baseType: !34, size: 64, offset: 640)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !243, file: !46, line: 66, baseType: !34, size: 64, offset: 704)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !243, file: !46, line: 68, baseType: !61, size: 64, offset: 768)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !243, file: !46, line: 70, baseType: !242, size: 64, offset: 832)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !243, file: !46, line: 72, baseType: !38, size: 32, offset: 896)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !243, file: !46, line: 73, baseType: !38, size: 32, offset: 928)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !243, file: !46, line: 74, baseType: !67, size: 64, offset: 960)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !243, file: !46, line: 77, baseType: !71, size: 16, offset: 1024)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !243, file: !46, line: 78, baseType: !73, size: 8, offset: 1040)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !243, file: !46, line: 79, baseType: !75, size: 8, offset: 1048)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !243, file: !46, line: 81, baseType: !79, size: 64, offset: 1088)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !243, file: !46, line: 89, baseType: !82, size: 64, offset: 1152)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !243, file: !46, line: 91, baseType: !84, size: 64, offset: 1216)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !243, file: !46, line: 92, baseType: !87, size: 64, offset: 1280)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !243, file: !46, line: 93, baseType: !242, size: 64, offset: 1344)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !243, file: !46, line: 94, baseType: !91, size: 64, offset: 1408)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !243, file: !46, line: 95, baseType: !93, size: 64, offset: 1472)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !243, file: !46, line: 96, baseType: !38, size: 32, offset: 1536)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !243, file: !46, line: 98, baseType: !98, size: 160, offset: 1568)
!274 = !DISubprogram(name: "quotearg_colon", scope: !6, file: !6, line: 391, type: !113, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!275 = !{!233, !276}
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !235, file: !236, line: 56, type: !182, isLocal: true, isDefinition: true)
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(name: "exit_failure", scope: !280, file: !281, line: 24, type: !283, isDefinition: true)
!280 = distinct !DICompileUnit(language: DW_LANG_C99, file: !281, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !39, globals: !282, nameTableKind: None)
!281 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!282 = !{!278}
!283 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !38)
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(name: "program_name", scope: !286, file: !287, line: 33, type: !36, isDefinition: true)
!286 = distinct !DICompileUnit(language: DW_LANG_C99, file: !287, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !39, retainedTypes: !288, globals: !324, nameTableKind: None)
!287 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!288 = !{!91, !289, !34}
!289 = !DISubprogram(name: "fputs", scope: !41, file: !41, line: 626, type: !290, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!290 = !DISubroutineType(types: !291)
!291 = !{!38, !36, !292}
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !46, line: 49, size: 1728, elements: !294)
!294 = !{!295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !293, file: !46, line: 51, baseType: !38, size: 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !293, file: !46, line: 54, baseType: !34, size: 64, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !293, file: !46, line: 55, baseType: !34, size: 64, offset: 128)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !293, file: !46, line: 56, baseType: !34, size: 64, offset: 192)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !293, file: !46, line: 57, baseType: !34, size: 64, offset: 256)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !293, file: !46, line: 58, baseType: !34, size: 64, offset: 320)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !293, file: !46, line: 59, baseType: !34, size: 64, offset: 384)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !293, file: !46, line: 60, baseType: !34, size: 64, offset: 448)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !293, file: !46, line: 61, baseType: !34, size: 64, offset: 512)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !293, file: !46, line: 64, baseType: !34, size: 64, offset: 576)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !293, file: !46, line: 65, baseType: !34, size: 64, offset: 640)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !293, file: !46, line: 66, baseType: !34, size: 64, offset: 704)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !293, file: !46, line: 68, baseType: !61, size: 64, offset: 768)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !293, file: !46, line: 70, baseType: !292, size: 64, offset: 832)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !293, file: !46, line: 72, baseType: !38, size: 32, offset: 896)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !293, file: !46, line: 73, baseType: !38, size: 32, offset: 928)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !293, file: !46, line: 74, baseType: !67, size: 64, offset: 960)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !293, file: !46, line: 77, baseType: !71, size: 16, offset: 1024)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !293, file: !46, line: 78, baseType: !73, size: 8, offset: 1040)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !293, file: !46, line: 79, baseType: !75, size: 8, offset: 1048)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !293, file: !46, line: 81, baseType: !79, size: 64, offset: 1088)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !293, file: !46, line: 89, baseType: !82, size: 64, offset: 1152)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !293, file: !46, line: 91, baseType: !84, size: 64, offset: 1216)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !293, file: !46, line: 92, baseType: !87, size: 64, offset: 1280)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !293, file: !46, line: 93, baseType: !292, size: 64, offset: 1344)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !293, file: !46, line: 94, baseType: !91, size: 64, offset: 1408)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !293, file: !46, line: 95, baseType: !93, size: 64, offset: 1472)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !293, file: !46, line: 96, baseType: !38, size: 32, offset: 1536)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !293, file: !46, line: 98, baseType: !98, size: 160, offset: 1568)
!324 = !{!284}
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !327, file: !328, line: 85, type: !434, isDefinition: true)
!327 = distinct !DICompileUnit(language: DW_LANG_C99, file: !328, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !329, retainedTypes: !350, globals: !409, nameTableKind: None)
!328 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!329 = !{!5, !330, !335}
!330 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, baseType: !7, size: 32, elements: !331)
!331 = !{!332, !333, !334}
!332 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!333 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!334 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!335 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !336, line: 46, baseType: !7, size: 32, elements: !337)
!336 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!337 = !{!338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349}
!338 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!339 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!340 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!341 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!342 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!343 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!344 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!345 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!346 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!347 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!348 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!349 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!350 = !{!351, !354, !215, !367, !38, !71, !370, !93, !387, !391, !30, !397, !401, !34, !163, !405, !406}
!351 = !DISubprogram(name: "xmemdup", scope: !164, file: !164, line: 62, type: !352, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!352 = !DISubroutineType(types: !353)
!353 = !{!91, !190, !95}
!354 = !DISubprogram(name: "quotearg_alloc_mem", scope: !6, file: !6, line: 342, type: !355, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!355 = !DISubroutineType(types: !356)
!356 = !{!34, !36, !95, !186, !357}
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !359)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !328, line: 65, size: 448, elements: !360)
!360 = !{!361, !362, !363, !365, !366}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !359, file: !328, line: 68, baseType: !5, size: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !359, file: !328, line: 71, baseType: !38, size: 32, offset: 32)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !359, file: !328, line: 75, baseType: !364, size: 256, offset: 64)
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !177)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !359, file: !328, line: 78, baseType: !36, size: 64, offset: 320)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !359, file: !328, line: 81, baseType: !36, size: 64, offset: 384)
!367 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !6, file: !6, line: 408, type: !368, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!368 = !DISubroutineType(types: !369)
!369 = !{!34, !38, !36, !36, !36, !95}
!370 = !DISubprogram(name: "rpl_mbrtowc", scope: !371, file: !371, line: 717, type: !372, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!371 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!372 = !DISubroutineType(types: !373)
!373 = !{!95, !135, !36, !95, !374}
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !376, line: 13, size: 64, elements: !377)
!376 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!377 = !{!378, !379}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !375, file: !376, line: 15, baseType: !38, size: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !375, file: !376, line: 20, baseType: !380, size: 32, offset: 32)
!380 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !375, file: !376, line: 16, size: 32, elements: !381)
!381 = !{!382, !383}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !380, file: !376, line: 18, baseType: !7, size: 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !380, file: !376, line: 19, baseType: !384, size: 32)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 32, elements: !385)
!385 = !{!386}
!386 = !DISubrange(count: 4)
!387 = !DISubprogram(name: "iswprint", scope: !388, file: !388, line: 120, type: !389, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!388 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!389 = !DISubroutineType(types: !390)
!390 = !{!38, !7}
!391 = !DISubprogram(name: "mbsinit", scope: !392, file: !392, line: 292, type: !393, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!392 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!393 = !DISubroutineType(types: !394)
!394 = !{!38, !395}
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !375)
!397 = !DISubprogram(name: "locale_charset", scope: !398, file: !398, line: 35, type: !399, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!398 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!399 = !DISubroutineType(types: !400)
!400 = !{!36}
!401 = !DISubprogram(name: "c_strcasecmp", scope: !402, file: !402, line: 42, type: !403, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!402 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!403 = !DISubroutineType(types: !404)
!404 = !{!38, !36, !36}
!405 = !DISubprogram(name: "xalloc_die", scope: !164, file: !164, line: 51, type: !120, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !39)
!406 = !DISubprogram(name: "xrealloc", scope: !164, file: !164, line: 59, type: !407, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!407 = !DISubroutineType(types: !408)
!408 = !{!91, !91, !95}
!409 = !{!325, !410, !416, !418, !420, !423, !430, !432}
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !327, file: !328, line: 101, type: !412, isDefinition: true)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !413, size: 320, elements: !414)
!413 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!414 = !{!415}
!415 = !DISubrange(count: 10)
!416 = !DIGlobalVariableExpression(var: !417, expr: !DIExpression())
!417 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !327, file: !328, line: 1052, type: !359, isDefinition: true)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !327, file: !328, line: 116, type: !359, isLocal: true, isDefinition: true)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(name: "slot0", scope: !327, file: !328, line: 842, type: !422, isLocal: true, isDefinition: true)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 2048, elements: !223)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(name: "slotvec", scope: !327, file: !328, line: 845, type: !425, isLocal: true, isDefinition: true)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !328, line: 834, size: 128, elements: !427)
!427 = !{!428, !429}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !426, file: !328, line: 836, baseType: !93, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !426, file: !328, line: 837, baseType: !34, size: 64, offset: 64)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(name: "nslots", scope: !327, file: !328, line: 843, type: !38, isLocal: true, isDefinition: true)
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(name: "slotvec0", scope: !327, file: !328, line: 844, type: !426, isLocal: true, isDefinition: true)
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !435, size: 704, elements: !436)
!435 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!436 = !{!437}
!437 = !DISubrange(count: 11)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !440, file: !441, line: 26, type: !443, isDefinition: true)
!440 = distinct !DICompileUnit(language: DW_LANG_C99, file: !441, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !39, globals: !442, nameTableKind: None)
!441 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!442 = !{!438}
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 376, elements: !444)
!444 = !{!445}
!445 = !DISubrange(count: 47)
!446 = distinct !DICompileUnit(language: DW_LANG_C99, file: !447, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !448, retainedTypes: !449, nameTableKind: None)
!447 = !DIFile(filename: "lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!448 = !{!20}
!449 = !{!450, !454}
!450 = !DISubprogram(name: "posix_fadvise", scope: !451, file: !451, line: 288, type: !452, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!451 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
!452 = !DISubroutineType(types: !453)
!453 = !{!38, !38, !69, !69, !38}
!454 = !DISubprogram(name: "fileno", scope: !41, file: !41, line: 786, type: !455, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!455 = !DISubroutineType(types: !456)
!456 = !{!38, !457}
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !46, line: 49, size: 1728, elements: !459)
!459 = !{!460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !458, file: !46, line: 51, baseType: !38, size: 32)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !458, file: !46, line: 54, baseType: !34, size: 64, offset: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !458, file: !46, line: 55, baseType: !34, size: 64, offset: 128)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !458, file: !46, line: 56, baseType: !34, size: 64, offset: 192)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !458, file: !46, line: 57, baseType: !34, size: 64, offset: 256)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !458, file: !46, line: 58, baseType: !34, size: 64, offset: 320)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !458, file: !46, line: 59, baseType: !34, size: 64, offset: 384)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !458, file: !46, line: 60, baseType: !34, size: 64, offset: 448)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !458, file: !46, line: 61, baseType: !34, size: 64, offset: 512)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !458, file: !46, line: 64, baseType: !34, size: 64, offset: 576)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !458, file: !46, line: 65, baseType: !34, size: 64, offset: 640)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !458, file: !46, line: 66, baseType: !34, size: 64, offset: 704)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !458, file: !46, line: 68, baseType: !61, size: 64, offset: 768)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !458, file: !46, line: 70, baseType: !457, size: 64, offset: 832)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !458, file: !46, line: 72, baseType: !38, size: 32, offset: 896)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !458, file: !46, line: 73, baseType: !38, size: 32, offset: 928)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !458, file: !46, line: 74, baseType: !67, size: 64, offset: 960)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !458, file: !46, line: 77, baseType: !71, size: 16, offset: 1024)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !458, file: !46, line: 78, baseType: !73, size: 8, offset: 1040)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !458, file: !46, line: 79, baseType: !75, size: 8, offset: 1048)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !458, file: !46, line: 81, baseType: !79, size: 64, offset: 1088)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !458, file: !46, line: 89, baseType: !82, size: 64, offset: 1152)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !458, file: !46, line: 91, baseType: !84, size: 64, offset: 1216)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !458, file: !46, line: 92, baseType: !87, size: 64, offset: 1280)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !458, file: !46, line: 93, baseType: !457, size: 64, offset: 1344)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !458, file: !46, line: 94, baseType: !91, size: 64, offset: 1408)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !458, file: !46, line: 95, baseType: !93, size: 64, offset: 1472)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !458, file: !46, line: 96, baseType: !38, size: 32, offset: 1536)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !458, file: !46, line: 98, baseType: !98, size: 160, offset: 1568)
!489 = distinct !DICompileUnit(language: DW_LANG_C99, file: !490, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !491, retainedTypes: !495, nameTableKind: None)
!490 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!491 = !{!492}
!492 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !490, line: 40, baseType: !7, size: 32, elements: !493)
!493 = !{!494}
!494 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!495 = !{!30, !496, !91}
!496 = !DISubprogram(name: "fputs_unlocked", scope: !41, file: !41, line: 662, type: !497, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!497 = !DISubroutineType(types: !498)
!498 = !{!38, !36, !499}
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !46, line: 49, size: 1728, elements: !501)
!501 = !{!502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !500, file: !46, line: 51, baseType: !38, size: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !500, file: !46, line: 54, baseType: !34, size: 64, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !500, file: !46, line: 55, baseType: !34, size: 64, offset: 128)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !500, file: !46, line: 56, baseType: !34, size: 64, offset: 192)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !500, file: !46, line: 57, baseType: !34, size: 64, offset: 256)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !500, file: !46, line: 58, baseType: !34, size: 64, offset: 320)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !500, file: !46, line: 59, baseType: !34, size: 64, offset: 384)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !500, file: !46, line: 60, baseType: !34, size: 64, offset: 448)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !500, file: !46, line: 61, baseType: !34, size: 64, offset: 512)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !500, file: !46, line: 64, baseType: !34, size: 64, offset: 576)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !500, file: !46, line: 65, baseType: !34, size: 64, offset: 640)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !500, file: !46, line: 66, baseType: !34, size: 64, offset: 704)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !500, file: !46, line: 68, baseType: !61, size: 64, offset: 768)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !500, file: !46, line: 70, baseType: !499, size: 64, offset: 832)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !500, file: !46, line: 72, baseType: !38, size: 32, offset: 896)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !500, file: !46, line: 73, baseType: !38, size: 32, offset: 928)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !500, file: !46, line: 74, baseType: !67, size: 64, offset: 960)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !500, file: !46, line: 77, baseType: !71, size: 16, offset: 1024)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !500, file: !46, line: 78, baseType: !73, size: 8, offset: 1040)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !500, file: !46, line: 79, baseType: !75, size: 8, offset: 1048)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !500, file: !46, line: 81, baseType: !79, size: 64, offset: 1088)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !500, file: !46, line: 89, baseType: !82, size: 64, offset: 1152)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !500, file: !46, line: 91, baseType: !84, size: 64, offset: 1216)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !500, file: !46, line: 92, baseType: !87, size: 64, offset: 1280)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !500, file: !46, line: 93, baseType: !499, size: 64, offset: 1344)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !500, file: !46, line: 94, baseType: !91, size: 64, offset: 1408)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !500, file: !46, line: 95, baseType: !93, size: 64, offset: 1472)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !500, file: !46, line: 96, baseType: !38, size: 32, offset: 1536)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !500, file: !46, line: 98, baseType: !98, size: 160, offset: 1568)
!531 = distinct !DICompileUnit(language: DW_LANG_C99, file: !532, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !533, retainedTypes: !546, nameTableKind: None)
!532 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!533 = !{!534}
!534 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !535, file: !164, line: 186, baseType: !7, size: 32, elements: !544)
!535 = distinct !DISubprogram(name: "x2nrealloc", scope: !164, file: !164, line: 174, type: !536, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !531, retainedNodes: !539)
!536 = !DISubroutineType(types: !537)
!537 = !{!91, !91, !538, !93}
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!539 = !{!540, !541, !542, !543}
!540 = !DILocalVariable(name: "p", arg: 1, scope: !535, file: !164, line: 174, type: !91)
!541 = !DILocalVariable(name: "pn", arg: 2, scope: !535, file: !164, line: 174, type: !538)
!542 = !DILocalVariable(name: "s", arg: 3, scope: !535, file: !164, line: 174, type: !93)
!543 = !DILocalVariable(name: "n", scope: !535, file: !164, line: 176, type: !93)
!544 = !{!545}
!545 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!546 = !{!93, !405, !163, !406, !34, !215, !91, !547, !550}
!547 = !DISubprogram(name: "xcalloc", scope: !164, file: !164, line: 57, type: !548, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!548 = !DISubroutineType(types: !549)
!549 = !{!91, !95, !95}
!550 = !DISubprogram(name: "rpl_calloc", scope: !551, file: !551, line: 688, type: !548, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!551 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!552 = distinct !DICompileUnit(language: DW_LANG_C99, file: !553, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !39, retainedTypes: !554, nameTableKind: None)
!553 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!554 = !{!30, !149}
!555 = distinct !DICompileUnit(language: DW_LANG_C99, file: !556, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !557, retainedTypes: !566, nameTableKind: None)
!556 = !DIFile(filename: "lib/xdectoumax.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!557 = !{!558}
!558 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !559, line: 25, baseType: !7, size: 32, elements: !560)
!559 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!560 = !{!561, !562, !563, !564, !565}
!561 = !DIEnumerator(name: "LONGINT_OK", value: 0, isUnsigned: true)
!562 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1, isUnsigned: true)
!563 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2, isUnsigned: true)
!564 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3, isUnsigned: true)
!565 = !DIEnumerator(name: "LONGINT_INVALID", value: 4, isUnsigned: true)
!566 = !{!567, !145, !149}
!567 = !DISubprogram(name: "xstrtoumax", scope: !559, file: !559, line: 48, type: !568, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!568 = !DISubroutineType(types: !569)
!569 = !{!558, !36, !570, !38, !186, !36}
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!571 = distinct !DICompileUnit(language: DW_LANG_C99, file: !572, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !573, retainedTypes: !574, nameTableKind: None)
!572 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!573 = !{!558, !335}
!574 = !{!38, !71}
!575 = distinct !DICompileUnit(language: DW_LANG_C99, file: !576, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !39, retainedTypes: !577, nameTableKind: None)
!576 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!577 = !{!91}
!578 = distinct !DICompileUnit(language: DW_LANG_C99, file: !579, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !39, retainedTypes: !580, nameTableKind: None)
!579 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!580 = !{!581, !616, !617, !621}
!581 = !DISubprogram(name: "fileno", scope: !41, file: !41, line: 786, type: !582, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!582 = !DISubroutineType(types: !583)
!583 = !{!38, !584}
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !46, line: 49, size: 1728, elements: !586)
!586 = !{!587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !585, file: !46, line: 51, baseType: !38, size: 32)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !585, file: !46, line: 54, baseType: !34, size: 64, offset: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !585, file: !46, line: 55, baseType: !34, size: 64, offset: 128)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !585, file: !46, line: 56, baseType: !34, size: 64, offset: 192)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !585, file: !46, line: 57, baseType: !34, size: 64, offset: 256)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !585, file: !46, line: 58, baseType: !34, size: 64, offset: 320)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !585, file: !46, line: 59, baseType: !34, size: 64, offset: 384)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !585, file: !46, line: 60, baseType: !34, size: 64, offset: 448)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !585, file: !46, line: 61, baseType: !34, size: 64, offset: 512)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !585, file: !46, line: 64, baseType: !34, size: 64, offset: 576)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !585, file: !46, line: 65, baseType: !34, size: 64, offset: 640)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !585, file: !46, line: 66, baseType: !34, size: 64, offset: 704)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !585, file: !46, line: 68, baseType: !61, size: 64, offset: 768)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !585, file: !46, line: 70, baseType: !584, size: 64, offset: 832)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !585, file: !46, line: 72, baseType: !38, size: 32, offset: 896)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !585, file: !46, line: 73, baseType: !38, size: 32, offset: 928)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !585, file: !46, line: 74, baseType: !67, size: 64, offset: 960)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !585, file: !46, line: 77, baseType: !71, size: 16, offset: 1024)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !585, file: !46, line: 78, baseType: !73, size: 8, offset: 1040)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !585, file: !46, line: 79, baseType: !75, size: 8, offset: 1048)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !585, file: !46, line: 81, baseType: !79, size: 64, offset: 1088)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !585, file: !46, line: 89, baseType: !82, size: 64, offset: 1152)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !585, file: !46, line: 91, baseType: !84, size: 64, offset: 1216)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !585, file: !46, line: 92, baseType: !87, size: 64, offset: 1280)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !585, file: !46, line: 93, baseType: !584, size: 64, offset: 1344)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !585, file: !46, line: 94, baseType: !91, size: 64, offset: 1408)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !585, file: !46, line: 95, baseType: !93, size: 64, offset: 1472)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !585, file: !46, line: 96, baseType: !38, size: 32, offset: 1536)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !585, file: !46, line: 98, baseType: !98, size: 160, offset: 1568)
!616 = !DISubprogram(name: "fclose", scope: !41, file: !41, line: 213, type: !582, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!617 = !DISubprogram(name: "lseek", scope: !618, file: !618, line: 334, type: !619, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!618 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!619 = !DISubroutineType(types: !620)
!620 = !{!69, !38, !69, !38}
!621 = !DISubprogram(name: "rpl_fflush", scope: !160, file: !160, line: 718, type: !582, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!622 = distinct !DICompileUnit(language: DW_LANG_C99, file: !623, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !39, retainedTypes: !624, nameTableKind: None)
!623 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!624 = !{!91, !625, !660}
!625 = !DISubprogram(name: "fflush", scope: !41, file: !41, line: 218, type: !626, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!626 = !DISubroutineType(types: !627)
!627 = !{!38, !628}
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !46, line: 49, size: 1728, elements: !630)
!630 = !{!631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !629, file: !46, line: 51, baseType: !38, size: 32)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !629, file: !46, line: 54, baseType: !34, size: 64, offset: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !629, file: !46, line: 55, baseType: !34, size: 64, offset: 128)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !629, file: !46, line: 56, baseType: !34, size: 64, offset: 192)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !629, file: !46, line: 57, baseType: !34, size: 64, offset: 256)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !629, file: !46, line: 58, baseType: !34, size: 64, offset: 320)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !629, file: !46, line: 59, baseType: !34, size: 64, offset: 384)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !629, file: !46, line: 60, baseType: !34, size: 64, offset: 448)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !629, file: !46, line: 61, baseType: !34, size: 64, offset: 512)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !629, file: !46, line: 64, baseType: !34, size: 64, offset: 576)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !629, file: !46, line: 65, baseType: !34, size: 64, offset: 640)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !629, file: !46, line: 66, baseType: !34, size: 64, offset: 704)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !629, file: !46, line: 68, baseType: !61, size: 64, offset: 768)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !629, file: !46, line: 70, baseType: !628, size: 64, offset: 832)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !629, file: !46, line: 72, baseType: !38, size: 32, offset: 896)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !629, file: !46, line: 73, baseType: !38, size: 32, offset: 928)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !629, file: !46, line: 74, baseType: !67, size: 64, offset: 960)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !629, file: !46, line: 77, baseType: !71, size: 16, offset: 1024)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !629, file: !46, line: 78, baseType: !73, size: 8, offset: 1040)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !629, file: !46, line: 79, baseType: !75, size: 8, offset: 1048)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !629, file: !46, line: 81, baseType: !79, size: 64, offset: 1088)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !629, file: !46, line: 89, baseType: !82, size: 64, offset: 1152)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !629, file: !46, line: 91, baseType: !84, size: 64, offset: 1216)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !629, file: !46, line: 92, baseType: !87, size: 64, offset: 1280)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !629, file: !46, line: 93, baseType: !628, size: 64, offset: 1344)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !629, file: !46, line: 94, baseType: !91, size: 64, offset: 1408)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !629, file: !46, line: 95, baseType: !93, size: 64, offset: 1472)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !629, file: !46, line: 96, baseType: !38, size: 32, offset: 1536)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !629, file: !46, line: 98, baseType: !98, size: 160, offset: 1568)
!660 = !DISubprogram(name: "rpl_fseeko", scope: !160, file: !160, line: 1034, type: !661, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!661 = !DISubroutineType(types: !662)
!662 = !{!38, !628, !69, !38}
!663 = distinct !DICompileUnit(language: DW_LANG_C99, file: !664, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !39, retainedTypes: !665, nameTableKind: None)
!664 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!665 = !{!91, !666, !617, !701}
!666 = !DISubprogram(name: "fileno", scope: !41, file: !41, line: 786, type: !667, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!667 = !DISubroutineType(types: !668)
!668 = !{!38, !669}
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !46, line: 49, size: 1728, elements: !671)
!671 = !{!672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !670, file: !46, line: 51, baseType: !38, size: 32)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !670, file: !46, line: 54, baseType: !34, size: 64, offset: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !670, file: !46, line: 55, baseType: !34, size: 64, offset: 128)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !670, file: !46, line: 56, baseType: !34, size: 64, offset: 192)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !670, file: !46, line: 57, baseType: !34, size: 64, offset: 256)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !670, file: !46, line: 58, baseType: !34, size: 64, offset: 320)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !670, file: !46, line: 59, baseType: !34, size: 64, offset: 384)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !670, file: !46, line: 60, baseType: !34, size: 64, offset: 448)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !670, file: !46, line: 61, baseType: !34, size: 64, offset: 512)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !670, file: !46, line: 64, baseType: !34, size: 64, offset: 576)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !670, file: !46, line: 65, baseType: !34, size: 64, offset: 640)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !670, file: !46, line: 66, baseType: !34, size: 64, offset: 704)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !670, file: !46, line: 68, baseType: !61, size: 64, offset: 768)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !670, file: !46, line: 70, baseType: !669, size: 64, offset: 832)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !670, file: !46, line: 72, baseType: !38, size: 32, offset: 896)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !670, file: !46, line: 73, baseType: !38, size: 32, offset: 928)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !670, file: !46, line: 74, baseType: !67, size: 64, offset: 960)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !670, file: !46, line: 77, baseType: !71, size: 16, offset: 1024)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !670, file: !46, line: 78, baseType: !73, size: 8, offset: 1040)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !670, file: !46, line: 79, baseType: !75, size: 8, offset: 1048)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !670, file: !46, line: 81, baseType: !79, size: 64, offset: 1088)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !670, file: !46, line: 89, baseType: !82, size: 64, offset: 1152)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !670, file: !46, line: 91, baseType: !84, size: 64, offset: 1216)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !670, file: !46, line: 92, baseType: !87, size: 64, offset: 1280)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !670, file: !46, line: 93, baseType: !669, size: 64, offset: 1344)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !670, file: !46, line: 94, baseType: !91, size: 64, offset: 1408)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !670, file: !46, line: 95, baseType: !93, size: 64, offset: 1472)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !670, file: !46, line: 96, baseType: !38, size: 32, offset: 1536)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !670, file: !46, line: 98, baseType: !98, size: 160, offset: 1568)
!701 = !DISubprogram(name: "fseeko", scope: !41, file: !41, line: 707, type: !702, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!702 = !DISubroutineType(types: !703)
!703 = !{!38, !669, !69, !38}
!704 = distinct !DICompileUnit(language: DW_LANG_C99, file: !705, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !39, retainedTypes: !706, nameTableKind: None)
!705 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!706 = !{!707, !93, !719}
!707 = !DISubprogram(name: "mbrtowc", scope: !392, file: !392, line: 296, type: !708, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!708 = !DISubroutineType(types: !709)
!709 = !{!95, !135, !36, !95, !710}
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !376, line: 13, size: 64, elements: !712)
!712 = !{!713, !714}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !711, file: !376, line: 15, baseType: !38, size: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !711, file: !376, line: 20, baseType: !715, size: 32, offset: 32)
!715 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !711, file: !376, line: 16, size: 32, elements: !716)
!716 = !{!717, !718}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !715, file: !376, line: 18, baseType: !7, size: 32)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !715, file: !376, line: 19, baseType: !384, size: 32)
!719 = !DISubprogram(name: "hard_locale", scope: !720, file: !720, line: 26, type: !721, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!720 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!721 = !DISubroutineType(types: !722)
!722 = !{!182, !38}
!723 = distinct !DICompileUnit(language: DW_LANG_C99, file: !724, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !39, retainedTypes: !725, nameTableKind: None)
!724 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!725 = !{!726}
!726 = !DISubprogram(name: "rpl_fclose", scope: !160, file: !160, line: 672, type: !727, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!727 = !DISubroutineType(types: !728)
!728 = !{!38, !729}
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !46, line: 49, size: 1728, elements: !731)
!731 = !{!732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !730, file: !46, line: 51, baseType: !38, size: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !730, file: !46, line: 54, baseType: !34, size: 64, offset: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !730, file: !46, line: 55, baseType: !34, size: 64, offset: 128)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !730, file: !46, line: 56, baseType: !34, size: 64, offset: 192)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !730, file: !46, line: 57, baseType: !34, size: 64, offset: 256)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !730, file: !46, line: 58, baseType: !34, size: 64, offset: 320)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !730, file: !46, line: 59, baseType: !34, size: 64, offset: 384)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !730, file: !46, line: 60, baseType: !34, size: 64, offset: 448)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !730, file: !46, line: 61, baseType: !34, size: 64, offset: 512)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !730, file: !46, line: 64, baseType: !34, size: 64, offset: 576)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !730, file: !46, line: 65, baseType: !34, size: 64, offset: 640)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !730, file: !46, line: 66, baseType: !34, size: 64, offset: 704)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !730, file: !46, line: 68, baseType: !61, size: 64, offset: 768)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !730, file: !46, line: 70, baseType: !729, size: 64, offset: 832)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !730, file: !46, line: 72, baseType: !38, size: 32, offset: 896)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !730, file: !46, line: 73, baseType: !38, size: 32, offset: 928)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !730, file: !46, line: 74, baseType: !67, size: 64, offset: 960)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !730, file: !46, line: 77, baseType: !71, size: 16, offset: 1024)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !730, file: !46, line: 78, baseType: !73, size: 8, offset: 1040)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !730, file: !46, line: 79, baseType: !75, size: 8, offset: 1048)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !730, file: !46, line: 81, baseType: !79, size: 64, offset: 1088)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !730, file: !46, line: 89, baseType: !82, size: 64, offset: 1152)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !730, file: !46, line: 91, baseType: !84, size: 64, offset: 1216)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !730, file: !46, line: 92, baseType: !87, size: 64, offset: 1280)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !730, file: !46, line: 93, baseType: !729, size: 64, offset: 1344)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !730, file: !46, line: 94, baseType: !91, size: 64, offset: 1408)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !730, file: !46, line: 95, baseType: !93, size: 64, offset: 1472)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !730, file: !46, line: 96, baseType: !38, size: 32, offset: 1536)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !730, file: !46, line: 98, baseType: !98, size: 160, offset: 1568)
!761 = distinct !DICompileUnit(language: DW_LANG_C99, file: !762, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !39, retainedTypes: !763, nameTableKind: None)
!762 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!763 = !{!764}
!764 = !DISubprogram(name: "setlocale_null_r", scope: !765, file: !765, line: 64, type: !766, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!765 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!766 = !DISubroutineType(types: !767)
!767 = !{!38, !38, !34, !95}
!768 = distinct !DICompileUnit(language: DW_LANG_C99, file: !769, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !770, retainedTypes: !1157, nameTableKind: None)
!769 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!770 = !{!771}
!771 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !772, line: 41, baseType: !7, size: 32, elements: !773)
!772 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!773 = !{!774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156}
!774 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!775 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!776 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!777 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!778 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!779 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!780 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!781 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!782 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!783 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!784 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!785 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!786 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!787 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!788 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!789 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!790 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!791 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!792 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!793 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!794 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!795 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!796 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!797 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!798 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!799 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!800 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!801 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!802 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!803 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!804 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!805 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!806 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!807 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!808 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!809 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!810 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!811 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!812 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!813 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!814 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!815 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!816 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!817 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!818 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!819 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!820 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!821 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!822 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!823 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!824 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!825 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!826 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!827 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!828 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!829 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!830 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!831 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!832 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!833 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!834 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!835 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!836 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!837 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!838 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!839 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!840 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!841 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!842 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!843 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!844 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!845 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!846 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!847 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!882 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!884 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!885 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!886 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!887 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!888 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!889 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!890 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!891 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!892 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!893 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!894 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!895 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!896 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!898 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!899 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!900 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!901 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!902 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!903 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!904 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!905 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!906 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!907 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!908 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!909 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!910 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!911 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!912 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!913 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!914 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!915 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!916 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!917 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!918 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!919 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!920 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!921 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!922 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!923 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!924 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!925 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!926 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!927 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!928 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!929 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!930 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!931 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!932 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!933 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!934 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!935 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!936 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!937 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!938 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!939 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!940 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!941 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!942 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!943 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!944 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!945 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!946 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!947 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!948 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!949 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!950 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!951 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!952 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!953 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!954 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!955 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!956 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!957 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!958 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!959 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!960 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!961 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!962 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!963 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!964 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!965 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!966 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!967 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!968 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!969 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
