; ModuleID = 'coreutils-8.32/src/base64.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.base64_decode_context = type { i32, [4 x i8] }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [30 x i8] c"Usage: %s [OPTION]... [FILE]\0A\00", align 1
@.str.2 = private unnamed_addr constant [70 x i8] c"Base%d encode or decode FILE, or standard input, to standard output.\0A\00", align 1
@.str.20 = private unnamed_addr constant [56 x i8] c"\0AWith no FILE, or when FILE is -, read standard input.\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 74, type: !197, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !29, globals: !196, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/basenc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !20}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!9 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 45, baseType: !7, size: 32, elements: !22)
!21 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!22 = !{!23, !24, !25, !26, !27, !28}
!23 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0, isUnsigned: true)
!24 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2, isUnsigned: true)
!25 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5, isUnsigned: true)
!26 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4, isUnsigned: true)
!27 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3, isUnsigned: true)
!28 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1, isUnsigned: true)
!29 = !{!30, !40, !101, !105, !109, !112, !115, !122, !137, !34, !91, !141, !145, !149, !153, !156, !159, !163, !167, !179, !183, !93, !36, !187, !192, !193}
!30 = !DISubprogram(name: "dcgettext", scope: !31, file: !31, line: 51, type: !32, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!31 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!32 = !DISubroutineType(types: !33)
!33 = !{!34, !36, !36, !38}
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!38 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!39 = !{}
!40 = !DISubprogram(name: "fputs_unlocked", scope: !41, file: !41, line: 662, type: !42, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!41 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!42 = !DISubroutineType(types: !43)
!43 = !{!38, !36, !44}
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !46, line: 49, size: 1728, elements: !47)
!46 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!47 = !{!48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !63, !64, !65, !66, !70, !72, !74, !78, !81, !83, !86, !89, !90, !92, !96, !97}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !45, file: !46, line: 51, baseType: !38, size: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !45, file: !46, line: 54, baseType: !34, size: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !45, file: !46, line: 55, baseType: !34, size: 64, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !45, file: !46, line: 56, baseType: !34, size: 64, offset: 192)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !45, file: !46, line: 57, baseType: !34, size: 64, offset: 256)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !45, file: !46, line: 58, baseType: !34, size: 64, offset: 320)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !45, file: !46, line: 59, baseType: !34, size: 64, offset: 384)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !45, file: !46, line: 60, baseType: !34, size: 64, offset: 448)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !45, file: !46, line: 61, baseType: !34, size: 64, offset: 512)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !45, file: !46, line: 64, baseType: !34, size: 64, offset: 576)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !45, file: !46, line: 65, baseType: !34, size: 64, offset: 640)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !45, file: !46, line: 66, baseType: !34, size: 64, offset: 704)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !45, file: !46, line: 68, baseType: !61, size: 64, offset: 768)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !46, line: 36, flags: DIFlagFwdDecl)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !45, file: !46, line: 70, baseType: !44, size: 64, offset: 832)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !45, file: !46, line: 72, baseType: !38, size: 32, offset: 896)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !45, file: !46, line: 73, baseType: !38, size: 32, offset: 928)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !45, file: !46, line: 74, baseType: !67, size: 64, offset: 960)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !68, line: 152, baseType: !69)
!68 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!69 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !45, file: !46, line: 77, baseType: !71, size: 16, offset: 1024)
!71 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !45, file: !46, line: 78, baseType: !73, size: 8, offset: 1040)
!73 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !45, file: !46, line: 79, baseType: !75, size: 8, offset: 1048)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 8, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 1)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !45, file: !46, line: 81, baseType: !79, size: 64, offset: 1088)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !46, line: 43, baseType: null)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !45, file: !46, line: 89, baseType: !82, size: 64, offset: 1152)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !68, line: 153, baseType: !69)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !45, file: !46, line: 91, baseType: !84, size: 64, offset: 1216)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !46, line: 37, flags: DIFlagFwdDecl)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !45, file: !46, line: 92, baseType: !87, size: 64, offset: 1280)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !46, line: 38, flags: DIFlagFwdDecl)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !45, file: !46, line: 93, baseType: !44, size: 64, offset: 1344)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !45, file: !46, line: 94, baseType: !91, size: 64, offset: 1408)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !45, file: !46, line: 95, baseType: !93, size: 64, offset: 1472)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !94, line: 46, baseType: !95)
!94 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!95 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !45, file: !46, line: 96, baseType: !38, size: 32, offset: 1536)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !45, file: !46, line: 98, baseType: !98, size: 160, offset: 1568)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 160, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 20)
!101 = !DISubprogram(name: "set_program_name", scope: !102, file: !102, line: 37, type: !103, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!102 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!103 = !DISubroutineType(types: !104)
!104 = !{null, !36}
!105 = !DISubprogram(name: "setlocale", scope: !106, file: !106, line: 122, type: !107, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!106 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!107 = !DISubroutineType(types: !108)
!108 = !{!34, !38, !36}
!109 = !DISubprogram(name: "bindtextdomain", scope: !31, file: !31, line: 86, type: !110, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!110 = !DISubroutineType(types: !111)
!111 = !{!34, !36, !36}
!112 = !DISubprogram(name: "textdomain", scope: !31, file: !31, line: 82, type: !113, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!113 = !DISubroutineType(types: !114)
!114 = !{!34, !36}
!115 = !DISubprogram(name: "atexit", scope: !116, file: !116, line: 595, type: !117, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!116 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!117 = !DISubroutineType(types: !118)
!118 = !{!38, !119}
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{null}
!122 = !DISubprogram(name: "getopt_long", scope: !123, file: !123, line: 66, type: !124, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!123 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!124 = !DISubroutineType(types: !125)
!125 = !{!38, !38, !126, !36, !128, !135}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !130)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !123, line: 50, size: 256, elements: !131)
!131 = !{!132, !133, !134, !136}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !130, file: !123, line: 52, baseType: !36, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !130, file: !123, line: 55, baseType: !38, size: 32, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !130, file: !123, line: 56, baseType: !135, size: 64, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !130, file: !123, line: 57, baseType: !38, size: 32, offset: 192)
!137 = !DISubprogram(name: "xdectoumax", scope: !138, file: !138, line: 31, type: !139, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!138 = !DIFile(filename: "./lib/xdectoint.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!139 = !DISubroutineType(types: !140)
!140 = !{!95, !36, !95, !95, !36, !36, !38}
!141 = !DISubprogram(name: "version_etc", scope: !142, file: !142, line: 69, type: !143, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!142 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!143 = !DISubroutineType(types: !144)
!144 = !{null, !44, !36, !36, !36, null}
!145 = !DISubprogram(name: "quote", scope: !146, file: !146, line: 44, type: !147, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!146 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!147 = !DISubroutineType(types: !148)
!148 = !{!36, !36}
!149 = !DISubprogram(name: "error", scope: !150, file: !150, line: 52, type: !151, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!150 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!151 = !DISubroutineType(types: !152)
!152 = !{null, !38, !38, !36, null}
!153 = !DISubprogram(name: "quotearg_n_style_colon", scope: !6, file: !6, line: 397, type: !154, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!154 = !DISubroutineType(types: !155)
!155 = !{!34, !38, !5, !36}
!156 = !DISubprogram(name: "fadvise", scope: !21, file: !21, line: 72, type: !157, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!157 = !DISubroutineType(types: !158)
!158 = !{null, !44, !20}
!159 = !DISubprogram(name: "rpl_fclose", scope: !160, file: !160, line: 672, type: !161, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!160 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!161 = !DISubroutineType(types: !162)
!162 = !{!38, !44}
!163 = !DISubprogram(name: "xmalloc", scope: !164, file: !164, line: 53, type: !165, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!164 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!165 = !DISubroutineType(types: !166)
!166 = !{!91, !95}
!167 = !DISubprogram(name: "base64_decode_ctx_init", scope: !168, file: !168, line: 48, type: !169, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!168 = !DIFile(filename: "./lib/base64.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!169 = !DISubroutineType(types: !170)
!170 = !{null, !171}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "base64_decode_context", file: !168, line: 35, size: 64, elements: !173)
!173 = !{!174, !175}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !172, file: !168, line: 37, baseType: !7, size: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !172, file: !168, line: 38, baseType: !176, size: 32, offset: 32)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 32, elements: !177)
!177 = !{!178}
!178 = !DISubrange(count: 4)
!179 = !DISubprogram(name: "isbase64", scope: !168, file: !168, line: 41, type: !180, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!180 = !DISubroutineType(types: !181)
!181 = !{!182, !35}
!182 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!183 = !DISubprogram(name: "base64_decode_ctx", scope: !168, file: !168, line: 50, type: !184, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!184 = !DISubroutineType(types: !185)
!185 = !{!182, !171, !36, !95, !34, !186}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!187 = !DISubprogram(name: "fwrite_unlocked", scope: !41, file: !41, line: 675, type: !188, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!188 = !DISubroutineType(types: !189)
!189 = !{!95, !190, !95, !95, !44}
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!192 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!193 = !DISubprogram(name: "base64_encode", scope: !168, file: !168, line: 43, type: !194, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!194 = !DISubroutineType(types: !195)
!195 = !{null, !36, !95, !34, !95}
!196 = !{!0}
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 1536, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 6)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(name: "Version", scope: !202, file: !203, line: 2, type: !36, isLocal: false, isDefinition: true)
!202 = distinct !DICompileUnit(language: DW_LANG_C99, file: !203, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !39, globals: !204, splitDebugInlining: false, nameTableKind: None)
!203 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!204 = !{!200}
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(name: "b64c", scope: !207, file: !208, line: 62, type: !220, isLocal: true, isDefinition: true)
!207 = distinct !DICompileUnit(language: DW_LANG_C99, file: !208, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !39, retainedTypes: !209, globals: !213, splitDebugInlining: false, nameTableKind: None)
!208 = !DIFile(filename: "lib/base64.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!209 = !{!91, !210, !34}
!210 = !DISubprogram(name: "free", scope: !116, file: !116, line: 565, type: !211, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!211 = !DISubroutineType(types: !212)
!212 = !{null, !91}
!213 = !{!205, !214}
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(name: "b64", scope: !207, file: !208, line: 252, type: !216, isLocal: true, isDefinition: true)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 2048, elements: !218)
!217 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !73)
!218 = !{!219}
!219 = !DISubrange(count: 256)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 512, elements: !221)
!221 = !{!222}
!222 = !DISubrange(count: 64)
!223 = !DIGlobalVariableExpression(var: !224, expr: !DIExpression())
!224 = distinct !DIGlobalVariable(name: "file_name", scope: !225, file: !226, line: 46, type: !36, isLocal: true, isDefinition: true)
!225 = distinct !DICompileUnit(language: DW_LANG_C99, file: !226, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !39, retainedTypes: !227, globals: !265, splitDebugInlining: false, nameTableKind: None)
!226 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!227 = !{!228, !30, !264, !149}
!228 = !DISubprogram(name: "close_stream", scope: !229, file: !229, line: 2, type: !230, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!229 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!230 = !DISubroutineType(types: !231)
!231 = !{!38, !232}
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !46, line: 49, size: 1728, elements: !234)
!234 = !{!235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !233, file: !46, line: 51, baseType: !38, size: 32)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !233, file: !46, line: 54, baseType: !34, size: 64, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !233, file: !46, line: 55, baseType: !34, size: 64, offset: 128)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !233, file: !46, line: 56, baseType: !34, size: 64, offset: 192)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !233, file: !46, line: 57, baseType: !34, size: 64, offset: 256)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !233, file: !46, line: 58, baseType: !34, size: 64, offset: 320)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !233, file: !46, line: 59, baseType: !34, size: 64, offset: 384)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !233, file: !46, line: 60, baseType: !34, size: 64, offset: 448)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !233, file: !46, line: 61, baseType: !34, size: 64, offset: 512)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !233, file: !46, line: 64, baseType: !34, size: 64, offset: 576)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !233, file: !46, line: 65, baseType: !34, size: 64, offset: 640)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !233, file: !46, line: 66, baseType: !34, size: 64, offset: 704)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !233, file: !46, line: 68, baseType: !61, size: 64, offset: 768)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !233, file: !46, line: 70, baseType: !232, size: 64, offset: 832)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !233, file: !46, line: 72, baseType: !38, size: 32, offset: 896)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !233, file: !46, line: 73, baseType: !38, size: 32, offset: 928)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !233, file: !46, line: 74, baseType: !67, size: 64, offset: 960)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !233, file: !46, line: 77, baseType: !71, size: 16, offset: 1024)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !233, file: !46, line: 78, baseType: !73, size: 8, offset: 1040)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !233, file: !46, line: 79, baseType: !75, size: 8, offset: 1048)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !233, file: !46, line: 81, baseType: !79, size: 64, offset: 1088)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !233, file: !46, line: 89, baseType: !82, size: 64, offset: 1152)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !233, file: !46, line: 91, baseType: !84, size: 64, offset: 1216)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !233, file: !46, line: 92, baseType: !87, size: 64, offset: 1280)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !233, file: !46, line: 93, baseType: !232, size: 64, offset: 1344)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !233, file: !46, line: 94, baseType: !91, size: 64, offset: 1408)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !233, file: !46, line: 95, baseType: !93, size: 64, offset: 1472)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !233, file: !46, line: 96, baseType: !38, size: 32, offset: 1536)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !233, file: !46, line: 98, baseType: !98, size: 160, offset: 1568)
!264 = !DISubprogram(name: "quotearg_colon", scope: !6, file: !6, line: 391, type: !113, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!265 = !{!223, !266}
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !225, file: !226, line: 56, type: !182, isLocal: true, isDefinition: true)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(name: "exit_failure", scope: !270, file: !271, line: 24, type: !273, isLocal: false, isDefinition: true)
!270 = distinct !DICompileUnit(language: DW_LANG_C99, file: !271, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !39, globals: !272, splitDebugInlining: false, nameTableKind: None)
!271 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!272 = !{!268}
!273 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !38)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(name: "program_name", scope: !276, file: !277, line: 33, type: !36, isLocal: false, isDefinition: true)
!276 = distinct !DICompileUnit(language: DW_LANG_C99, file: !277, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !39, retainedTypes: !278, globals: !314, splitDebugInlining: false, nameTableKind: None)
!277 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!278 = !{!91, !279, !34}
!279 = !DISubprogram(name: "fputs", scope: !41, file: !41, line: 626, type: !280, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!280 = !DISubroutineType(types: !281)
!281 = !{!38, !36, !282}
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !46, line: 49, size: 1728, elements: !284)
!284 = !{!285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !283, file: !46, line: 51, baseType: !38, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !283, file: !46, line: 54, baseType: !34, size: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !283, file: !46, line: 55, baseType: !34, size: 64, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !283, file: !46, line: 56, baseType: !34, size: 64, offset: 192)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !283, file: !46, line: 57, baseType: !34, size: 64, offset: 256)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !283, file: !46, line: 58, baseType: !34, size: 64, offset: 320)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !283, file: !46, line: 59, baseType: !34, size: 64, offset: 384)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !283, file: !46, line: 60, baseType: !34, size: 64, offset: 448)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !283, file: !46, line: 61, baseType: !34, size: 64, offset: 512)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !283, file: !46, line: 64, baseType: !34, size: 64, offset: 576)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !283, file: !46, line: 65, baseType: !34, size: 64, offset: 640)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !283, file: !46, line: 66, baseType: !34, size: 64, offset: 704)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !283, file: !46, line: 68, baseType: !61, size: 64, offset: 768)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !283, file: !46, line: 70, baseType: !282, size: 64, offset: 832)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !283, file: !46, line: 72, baseType: !38, size: 32, offset: 896)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !283, file: !46, line: 73, baseType: !38, size: 32, offset: 928)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !283, file: !46, line: 74, baseType: !67, size: 64, offset: 960)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !283, file: !46, line: 77, baseType: !71, size: 16, offset: 1024)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !283, file: !46, line: 78, baseType: !73, size: 8, offset: 1040)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !283, file: !46, line: 79, baseType: !75, size: 8, offset: 1048)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !283, file: !46, line: 81, baseType: !79, size: 64, offset: 1088)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !283, file: !46, line: 89, baseType: !82, size: 64, offset: 1152)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !283, file: !46, line: 91, baseType: !84, size: 64, offset: 1216)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !283, file: !46, line: 92, baseType: !87, size: 64, offset: 1280)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !283, file: !46, line: 93, baseType: !282, size: 64, offset: 1344)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !283, file: !46, line: 94, baseType: !91, size: 64, offset: 1408)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !283, file: !46, line: 95, baseType: !93, size: 64, offset: 1472)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !283, file: !46, line: 96, baseType: !38, size: 32, offset: 1536)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !283, file: !46, line: 98, baseType: !98, size: 160, offset: 1568)
!314 = !{!274}
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !317, file: !318, line: 85, type: !423, isLocal: false, isDefinition: true)
!317 = distinct !DICompileUnit(language: DW_LANG_C99, file: !318, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !319, retainedTypes: !340, globals: !398, splitDebugInlining: false, nameTableKind: None)
!318 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!319 = !{!5, !320, !325}
!320 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, baseType: !7, size: 32, elements: !321)
!321 = !{!322, !323, !324}
!322 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!323 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!324 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!325 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !326, line: 46, baseType: !7, size: 32, elements: !327)
!326 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!327 = !{!328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339}
!328 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!329 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!330 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!331 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!332 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!333 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!334 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!335 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!336 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!337 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!338 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!339 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!340 = !{!341, !344, !210, !359, !38, !71, !362, !93, !376, !380, !30, !386, !390, !34, !163, !394, !395}
!341 = !DISubprogram(name: "xmemdup", scope: !164, file: !164, line: 62, type: !342, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!342 = !DISubroutineType(types: !343)
!343 = !{!91, !190, !95}
!344 = !DISubprogram(name: "quotearg_alloc_mem", scope: !6, file: !6, line: 342, type: !345, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!345 = !DISubroutineType(types: !346)
!346 = !{!34, !36, !95, !186, !347}
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !349)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !318, line: 65, size: 448, elements: !350)
!350 = !{!351, !352, !353, !357, !358}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !349, file: !318, line: 68, baseType: !5, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !349, file: !318, line: 71, baseType: !38, size: 32, offset: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !349, file: !318, line: 75, baseType: !354, size: 256, offset: 64)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !355)
!355 = !{!356}
!356 = !DISubrange(count: 8)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !349, file: !318, line: 78, baseType: !36, size: 64, offset: 320)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !349, file: !318, line: 81, baseType: !36, size: 64, offset: 384)
!359 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !6, file: !6, line: 408, type: !360, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!360 = !DISubroutineType(types: !361)
!361 = !{!34, !38, !36, !36, !36, !95}
!362 = !DISubprogram(name: "rpl_mbrtowc", scope: !363, file: !363, line: 717, type: !364, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!363 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!364 = !DISubroutineType(types: !365)
!365 = !{!95, !135, !36, !95, !366}
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !368, line: 13, size: 64, elements: !369)
!368 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!369 = !{!370, !371}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !367, file: !368, line: 15, baseType: !38, size: 32)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !367, file: !368, line: 20, baseType: !372, size: 32, offset: 32)
!372 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !367, file: !368, line: 16, size: 32, elements: !373)
!373 = !{!374, !375}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !372, file: !368, line: 18, baseType: !7, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !372, file: !368, line: 19, baseType: !176, size: 32)
!376 = !DISubprogram(name: "iswprint", scope: !377, file: !377, line: 120, type: !378, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!377 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!378 = !DISubroutineType(types: !379)
!379 = !{!38, !7}
!380 = !DISubprogram(name: "mbsinit", scope: !381, file: !381, line: 292, type: !382, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!381 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!382 = !DISubroutineType(types: !383)
!383 = !{!38, !384}
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !367)
!386 = !DISubprogram(name: "locale_charset", scope: !387, file: !387, line: 35, type: !388, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!387 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!388 = !DISubroutineType(types: !389)
!389 = !{!36}
!390 = !DISubprogram(name: "c_strcasecmp", scope: !391, file: !391, line: 42, type: !392, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!391 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!392 = !DISubroutineType(types: !393)
!393 = !{!38, !36, !36}
!394 = !DISubprogram(name: "xalloc_die", scope: !164, file: !164, line: 51, type: !120, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !39)
!395 = !DISubprogram(name: "xrealloc", scope: !164, file: !164, line: 59, type: !396, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!396 = !DISubroutineType(types: !397)
!397 = !{!91, !91, !95}
!398 = !{!315, !399, !405, !407, !409, !412, !419, !421}
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !317, file: !318, line: 101, type: !401, isLocal: false, isDefinition: true)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !402, size: 320, elements: !403)
!402 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!403 = !{!404}
!404 = !DISubrange(count: 10)
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !317, file: !318, line: 1052, type: !349, isLocal: false, isDefinition: true)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !317, file: !318, line: 116, type: !349, isLocal: true, isDefinition: true)
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(name: "slot0", scope: !317, file: !318, line: 842, type: !411, isLocal: true, isDefinition: true)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 2048, elements: !218)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(name: "slotvec", scope: !317, file: !318, line: 845, type: !414, isLocal: true, isDefinition: true)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !318, line: 834, size: 128, elements: !416)
!416 = !{!417, !418}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !415, file: !318, line: 836, baseType: !93, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !415, file: !318, line: 837, baseType: !34, size: 64, offset: 64)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(name: "nslots", scope: !317, file: !318, line: 843, type: !38, isLocal: true, isDefinition: true)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(name: "slotvec0", scope: !317, file: !318, line: 844, type: !415, isLocal: true, isDefinition: true)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !424, size: 704, elements: !425)
!424 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!425 = !{!426}
!426 = !DISubrange(count: 11)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !429, file: !430, line: 26, type: !432, isLocal: false, isDefinition: true)
!429 = distinct !DICompileUnit(language: DW_LANG_C99, file: !430, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !39, globals: !431, splitDebugInlining: false, nameTableKind: None)
!430 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!431 = !{!427}
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 376, elements: !433)
!433 = !{!434}
!434 = !DISubrange(count: 47)
!435 = distinct !DICompileUnit(language: DW_LANG_C99, file: !436, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !437, retainedTypes: !438, splitDebugInlining: false, nameTableKind: None)
!436 = !DIFile(filename: "lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!437 = !{!20}
!438 = !{!439, !443}
!439 = !DISubprogram(name: "posix_fadvise", scope: !440, file: !440, line: 288, type: !441, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!440 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
!441 = !DISubroutineType(types: !442)
!442 = !{!38, !38, !69, !69, !38}
!443 = !DISubprogram(name: "fileno", scope: !41, file: !41, line: 786, type: !444, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!444 = !DISubroutineType(types: !445)
!445 = !{!38, !446}
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !46, line: 49, size: 1728, elements: !448)
!448 = !{!449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !447, file: !46, line: 51, baseType: !38, size: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !447, file: !46, line: 54, baseType: !34, size: 64, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !447, file: !46, line: 55, baseType: !34, size: 64, offset: 128)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !447, file: !46, line: 56, baseType: !34, size: 64, offset: 192)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !447, file: !46, line: 57, baseType: !34, size: 64, offset: 256)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !447, file: !46, line: 58, baseType: !34, size: 64, offset: 320)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !447, file: !46, line: 59, baseType: !34, size: 64, offset: 384)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !447, file: !46, line: 60, baseType: !34, size: 64, offset: 448)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !447, file: !46, line: 61, baseType: !34, size: 64, offset: 512)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !447, file: !46, line: 64, baseType: !34, size: 64, offset: 576)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !447, file: !46, line: 65, baseType: !34, size: 64, offset: 640)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !447, file: !46, line: 66, baseType: !34, size: 64, offset: 704)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !447, file: !46, line: 68, baseType: !61, size: 64, offset: 768)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !447, file: !46, line: 70, baseType: !446, size: 64, offset: 832)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !447, file: !46, line: 72, baseType: !38, size: 32, offset: 896)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !447, file: !46, line: 73, baseType: !38, size: 32, offset: 928)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !447, file: !46, line: 74, baseType: !67, size: 64, offset: 960)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !447, file: !46, line: 77, baseType: !71, size: 16, offset: 1024)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !447, file: !46, line: 78, baseType: !73, size: 8, offset: 1040)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !447, file: !46, line: 79, baseType: !75, size: 8, offset: 1048)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !447, file: !46, line: 81, baseType: !79, size: 64, offset: 1088)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !447, file: !46, line: 89, baseType: !82, size: 64, offset: 1152)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !447, file: !46, line: 91, baseType: !84, size: 64, offset: 1216)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !447, file: !46, line: 92, baseType: !87, size: 64, offset: 1280)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !447, file: !46, line: 93, baseType: !446, size: 64, offset: 1344)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !447, file: !46, line: 94, baseType: !91, size: 64, offset: 1408)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !447, file: !46, line: 95, baseType: !93, size: 64, offset: 1472)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !447, file: !46, line: 96, baseType: !38, size: 32, offset: 1536)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !447, file: !46, line: 98, baseType: !98, size: 160, offset: 1568)
!478 = distinct !DICompileUnit(language: DW_LANG_C99, file: !479, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !480, retainedTypes: !484, splitDebugInlining: false, nameTableKind: None)
!479 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!480 = !{!481}
!481 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !479, line: 40, baseType: !7, size: 32, elements: !482)
!482 = !{!483}
!483 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!484 = !{!30, !485, !91}
!485 = !DISubprogram(name: "fputs_unlocked", scope: !41, file: !41, line: 662, type: !486, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!486 = !DISubroutineType(types: !487)
!487 = !{!38, !36, !488}
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !46, line: 49, size: 1728, elements: !490)
!490 = !{!491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !489, file: !46, line: 51, baseType: !38, size: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !489, file: !46, line: 54, baseType: !34, size: 64, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !489, file: !46, line: 55, baseType: !34, size: 64, offset: 128)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !489, file: !46, line: 56, baseType: !34, size: 64, offset: 192)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !489, file: !46, line: 57, baseType: !34, size: 64, offset: 256)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !489, file: !46, line: 58, baseType: !34, size: 64, offset: 320)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !489, file: !46, line: 59, baseType: !34, size: 64, offset: 384)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !489, file: !46, line: 60, baseType: !34, size: 64, offset: 448)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !489, file: !46, line: 61, baseType: !34, size: 64, offset: 512)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !489, file: !46, line: 64, baseType: !34, size: 64, offset: 576)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !489, file: !46, line: 65, baseType: !34, size: 64, offset: 640)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !489, file: !46, line: 66, baseType: !34, size: 64, offset: 704)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !489, file: !46, line: 68, baseType: !61, size: 64, offset: 768)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !489, file: !46, line: 70, baseType: !488, size: 64, offset: 832)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !489, file: !46, line: 72, baseType: !38, size: 32, offset: 896)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !489, file: !46, line: 73, baseType: !38, size: 32, offset: 928)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !489, file: !46, line: 74, baseType: !67, size: 64, offset: 960)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !489, file: !46, line: 77, baseType: !71, size: 16, offset: 1024)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !489, file: !46, line: 78, baseType: !73, size: 8, offset: 1040)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !489, file: !46, line: 79, baseType: !75, size: 8, offset: 1048)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !489, file: !46, line: 81, baseType: !79, size: 64, offset: 1088)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !489, file: !46, line: 89, baseType: !82, size: 64, offset: 1152)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !489, file: !46, line: 91, baseType: !84, size: 64, offset: 1216)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !489, file: !46, line: 92, baseType: !87, size: 64, offset: 1280)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !489, file: !46, line: 93, baseType: !488, size: 64, offset: 1344)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !489, file: !46, line: 94, baseType: !91, size: 64, offset: 1408)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !489, file: !46, line: 95, baseType: !93, size: 64, offset: 1472)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !489, file: !46, line: 96, baseType: !38, size: 32, offset: 1536)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !489, file: !46, line: 98, baseType: !98, size: 160, offset: 1568)
!520 = distinct !DICompileUnit(language: DW_LANG_C99, file: !521, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !522, retainedTypes: !535, splitDebugInlining: false, nameTableKind: None)
!521 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!522 = !{!523}
!523 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !524, file: !164, line: 186, baseType: !7, size: 32, elements: !533)
!524 = distinct !DISubprogram(name: "x2nrealloc", scope: !164, file: !164, line: 174, type: !525, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !520, retainedNodes: !528)
!525 = !DISubroutineType(types: !526)
!526 = !{!91, !91, !527, !93}
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!528 = !{!529, !530, !531, !532}
!529 = !DILocalVariable(name: "p", arg: 1, scope: !524, file: !164, line: 174, type: !91)
!530 = !DILocalVariable(name: "pn", arg: 2, scope: !524, file: !164, line: 174, type: !527)
!531 = !DILocalVariable(name: "s", arg: 3, scope: !524, file: !164, line: 174, type: !93)
!532 = !DILocalVariable(name: "n", scope: !524, file: !164, line: 176, type: !93)
!533 = !{!534}
!534 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!535 = !{!93, !394, !163, !395, !34, !210, !91, !536, !539}
!536 = !DISubprogram(name: "xcalloc", scope: !164, file: !164, line: 57, type: !537, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!537 = !DISubroutineType(types: !538)
!538 = !{!91, !95, !95}
!539 = !DISubprogram(name: "rpl_calloc", scope: !540, file: !540, line: 688, type: !537, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!540 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!541 = distinct !DICompileUnit(language: DW_LANG_C99, file: !542, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !39, retainedTypes: !543, splitDebugInlining: false, nameTableKind: None)
!542 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!543 = !{!30, !149}
!544 = distinct !DICompileUnit(language: DW_LANG_C99, file: !545, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !546, retainedTypes: !555, splitDebugInlining: false, nameTableKind: None)
!545 = !DIFile(filename: "lib/xdectoumax.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!546 = !{!547}
!547 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !548, line: 25, baseType: !7, size: 32, elements: !549)
!548 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!549 = !{!550, !551, !552, !553, !554}
!550 = !DIEnumerator(name: "LONGINT_OK", value: 0, isUnsigned: true)
!551 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1, isUnsigned: true)
!552 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2, isUnsigned: true)
!553 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3, isUnsigned: true)
!554 = !DIEnumerator(name: "LONGINT_INVALID", value: 4, isUnsigned: true)
!555 = !{!556, !145, !149}
!556 = !DISubprogram(name: "xstrtoumax", scope: !548, file: !548, line: 48, type: !557, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!557 = !DISubroutineType(types: !558)
!558 = !{!547, !36, !559, !38, !186, !36}
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!560 = distinct !DICompileUnit(language: DW_LANG_C99, file: !561, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !562, retainedTypes: !563, splitDebugInlining: false, nameTableKind: None)
!561 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!562 = !{!547, !325}
!563 = !{!38, !71}
!564 = distinct !DICompileUnit(language: DW_LANG_C99, file: !565, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !39, retainedTypes: !566, splitDebugInlining: false, nameTableKind: None)
!565 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!566 = !{!91}
!567 = distinct !DICompileUnit(language: DW_LANG_C99, file: !568, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !39, retainedTypes: !569, splitDebugInlining: false, nameTableKind: None)
!568 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!569 = !{!570, !605, !606, !610}
!570 = !DISubprogram(name: "fileno", scope: !41, file: !41, line: 786, type: !571, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!571 = !DISubroutineType(types: !572)
!572 = !{!38, !573}
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !46, line: 49, size: 1728, elements: !575)
!575 = !{!576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !574, file: !46, line: 51, baseType: !38, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !574, file: !46, line: 54, baseType: !34, size: 64, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !574, file: !46, line: 55, baseType: !34, size: 64, offset: 128)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !574, file: !46, line: 56, baseType: !34, size: 64, offset: 192)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !574, file: !46, line: 57, baseType: !34, size: 64, offset: 256)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !574, file: !46, line: 58, baseType: !34, size: 64, offset: 320)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !574, file: !46, line: 59, baseType: !34, size: 64, offset: 384)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !574, file: !46, line: 60, baseType: !34, size: 64, offset: 448)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !574, file: !46, line: 61, baseType: !34, size: 64, offset: 512)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !574, file: !46, line: 64, baseType: !34, size: 64, offset: 576)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !574, file: !46, line: 65, baseType: !34, size: 64, offset: 640)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !574, file: !46, line: 66, baseType: !34, size: 64, offset: 704)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !574, file: !46, line: 68, baseType: !61, size: 64, offset: 768)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !574, file: !46, line: 70, baseType: !573, size: 64, offset: 832)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !574, file: !46, line: 72, baseType: !38, size: 32, offset: 896)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !574, file: !46, line: 73, baseType: !38, size: 32, offset: 928)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !574, file: !46, line: 74, baseType: !67, size: 64, offset: 960)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !574, file: !46, line: 77, baseType: !71, size: 16, offset: 1024)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !574, file: !46, line: 78, baseType: !73, size: 8, offset: 1040)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !574, file: !46, line: 79, baseType: !75, size: 8, offset: 1048)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !574, file: !46, line: 81, baseType: !79, size: 64, offset: 1088)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !574, file: !46, line: 89, baseType: !82, size: 64, offset: 1152)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !574, file: !46, line: 91, baseType: !84, size: 64, offset: 1216)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !574, file: !46, line: 92, baseType: !87, size: 64, offset: 1280)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !574, file: !46, line: 93, baseType: !573, size: 64, offset: 1344)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !574, file: !46, line: 94, baseType: !91, size: 64, offset: 1408)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !574, file: !46, line: 95, baseType: !93, size: 64, offset: 1472)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !574, file: !46, line: 96, baseType: !38, size: 32, offset: 1536)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !574, file: !46, line: 98, baseType: !98, size: 160, offset: 1568)
!605 = !DISubprogram(name: "fclose", scope: !41, file: !41, line: 213, type: !571, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!606 = !DISubprogram(name: "lseek", scope: !607, file: !607, line: 334, type: !608, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!607 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!608 = !DISubroutineType(types: !609)
!609 = !{!69, !38, !69, !38}
!610 = !DISubprogram(name: "rpl_fflush", scope: !160, file: !160, line: 718, type: !571, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!611 = distinct !DICompileUnit(language: DW_LANG_C99, file: !612, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !39, retainedTypes: !613, splitDebugInlining: false, nameTableKind: None)
!612 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!613 = !{!91, !614, !649}
!614 = !DISubprogram(name: "fflush", scope: !41, file: !41, line: 218, type: !615, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!615 = !DISubroutineType(types: !616)
!616 = !{!38, !617}
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !46, line: 49, size: 1728, elements: !619)
!619 = !{!620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !618, file: !46, line: 51, baseType: !38, size: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !618, file: !46, line: 54, baseType: !34, size: 64, offset: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !618, file: !46, line: 55, baseType: !34, size: 64, offset: 128)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !618, file: !46, line: 56, baseType: !34, size: 64, offset: 192)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !618, file: !46, line: 57, baseType: !34, size: 64, offset: 256)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !618, file: !46, line: 58, baseType: !34, size: 64, offset: 320)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !618, file: !46, line: 59, baseType: !34, size: 64, offset: 384)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !618, file: !46, line: 60, baseType: !34, size: 64, offset: 448)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !618, file: !46, line: 61, baseType: !34, size: 64, offset: 512)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !618, file: !46, line: 64, baseType: !34, size: 64, offset: 576)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !618, file: !46, line: 65, baseType: !34, size: 64, offset: 640)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !618, file: !46, line: 66, baseType: !34, size: 64, offset: 704)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !618, file: !46, line: 68, baseType: !61, size: 64, offset: 768)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !618, file: !46, line: 70, baseType: !617, size: 64, offset: 832)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !618, file: !46, line: 72, baseType: !38, size: 32, offset: 896)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !618, file: !46, line: 73, baseType: !38, size: 32, offset: 928)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !618, file: !46, line: 74, baseType: !67, size: 64, offset: 960)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !618, file: !46, line: 77, baseType: !71, size: 16, offset: 1024)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !618, file: !46, line: 78, baseType: !73, size: 8, offset: 1040)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !618, file: !46, line: 79, baseType: !75, size: 8, offset: 1048)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !618, file: !46, line: 81, baseType: !79, size: 64, offset: 1088)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !618, file: !46, line: 89, baseType: !82, size: 64, offset: 1152)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !618, file: !46, line: 91, baseType: !84, size: 64, offset: 1216)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !618, file: !46, line: 92, baseType: !87, size: 64, offset: 1280)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !618, file: !46, line: 93, baseType: !617, size: 64, offset: 1344)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !618, file: !46, line: 94, baseType: !91, size: 64, offset: 1408)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !618, file: !46, line: 95, baseType: !93, size: 64, offset: 1472)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !618, file: !46, line: 96, baseType: !38, size: 32, offset: 1536)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !618, file: !46, line: 98, baseType: !98, size: 160, offset: 1568)
!649 = !DISubprogram(name: "rpl_fseeko", scope: !160, file: !160, line: 1034, type: !650, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!650 = !DISubroutineType(types: !651)
!651 = !{!38, !617, !69, !38}
!652 = distinct !DICompileUnit(language: DW_LANG_C99, file: !653, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !39, retainedTypes: !654, splitDebugInlining: false, nameTableKind: None)
!653 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!654 = !{!91, !655, !606, !690}
!655 = !DISubprogram(name: "fileno", scope: !41, file: !41, line: 786, type: !656, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!656 = !DISubroutineType(types: !657)
!657 = !{!38, !658}
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !46, line: 49, size: 1728, elements: !660)
!660 = !{!661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !659, file: !46, line: 51, baseType: !38, size: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !659, file: !46, line: 54, baseType: !34, size: 64, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !659, file: !46, line: 55, baseType: !34, size: 64, offset: 128)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !659, file: !46, line: 56, baseType: !34, size: 64, offset: 192)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !659, file: !46, line: 57, baseType: !34, size: 64, offset: 256)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !659, file: !46, line: 58, baseType: !34, size: 64, offset: 320)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !659, file: !46, line: 59, baseType: !34, size: 64, offset: 384)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !659, file: !46, line: 60, baseType: !34, size: 64, offset: 448)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !659, file: !46, line: 61, baseType: !34, size: 64, offset: 512)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !659, file: !46, line: 64, baseType: !34, size: 64, offset: 576)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !659, file: !46, line: 65, baseType: !34, size: 64, offset: 640)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !659, file: !46, line: 66, baseType: !34, size: 64, offset: 704)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !659, file: !46, line: 68, baseType: !61, size: 64, offset: 768)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !659, file: !46, line: 70, baseType: !658, size: 64, offset: 832)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !659, file: !46, line: 72, baseType: !38, size: 32, offset: 896)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !659, file: !46, line: 73, baseType: !38, size: 32, offset: 928)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !659, file: !46, line: 74, baseType: !67, size: 64, offset: 960)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !659, file: !46, line: 77, baseType: !71, size: 16, offset: 1024)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !659, file: !46, line: 78, baseType: !73, size: 8, offset: 1040)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !659, file: !46, line: 79, baseType: !75, size: 8, offset: 1048)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !659, file: !46, line: 81, baseType: !79, size: 64, offset: 1088)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !659, file: !46, line: 89, baseType: !82, size: 64, offset: 1152)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !659, file: !46, line: 91, baseType: !84, size: 64, offset: 1216)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !659, file: !46, line: 92, baseType: !87, size: 64, offset: 1280)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !659, file: !46, line: 93, baseType: !658, size: 64, offset: 1344)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !659, file: !46, line: 94, baseType: !91, size: 64, offset: 1408)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !659, file: !46, line: 95, baseType: !93, size: 64, offset: 1472)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !659, file: !46, line: 96, baseType: !38, size: 32, offset: 1536)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !659, file: !46, line: 98, baseType: !98, size: 160, offset: 1568)
!690 = !DISubprogram(name: "fseeko", scope: !41, file: !41, line: 707, type: !691, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!691 = !DISubroutineType(types: !692)
!692 = !{!38, !658, !69, !38}
!693 = distinct !DICompileUnit(language: DW_LANG_C99, file: !694, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !39, retainedTypes: !695, splitDebugInlining: false, nameTableKind: None)
!694 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!695 = !{!696, !93, !708}
!696 = !DISubprogram(name: "mbrtowc", scope: !381, file: !381, line: 296, type: !697, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!697 = !DISubroutineType(types: !698)
!698 = !{!95, !135, !36, !95, !699}
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !368, line: 13, size: 64, elements: !701)
!701 = !{!702, !703}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !700, file: !368, line: 15, baseType: !38, size: 32)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !700, file: !368, line: 20, baseType: !704, size: 32, offset: 32)
!704 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !700, file: !368, line: 16, size: 32, elements: !705)
!705 = !{!706, !707}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !704, file: !368, line: 18, baseType: !7, size: 32)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !704, file: !368, line: 19, baseType: !176, size: 32)
!708 = !DISubprogram(name: "hard_locale", scope: !709, file: !709, line: 26, type: !710, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!709 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!710 = !DISubroutineType(types: !711)
!711 = !{!182, !38}
!712 = distinct !DICompileUnit(language: DW_LANG_C99, file: !713, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !39, retainedTypes: !714, splitDebugInlining: false, nameTableKind: None)
!713 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!714 = !{!715}
!715 = !DISubprogram(name: "rpl_fclose", scope: !160, file: !160, line: 672, type: !716, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!716 = !DISubroutineType(types: !717)
!717 = !{!38, !718}
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !46, line: 49, size: 1728, elements: !720)
!720 = !{!721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !719, file: !46, line: 51, baseType: !38, size: 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !719, file: !46, line: 54, baseType: !34, size: 64, offset: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !719, file: !46, line: 55, baseType: !34, size: 64, offset: 128)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !719, file: !46, line: 56, baseType: !34, size: 64, offset: 192)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !719, file: !46, line: 57, baseType: !34, size: 64, offset: 256)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !719, file: !46, line: 58, baseType: !34, size: 64, offset: 320)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !719, file: !46, line: 59, baseType: !34, size: 64, offset: 384)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !719, file: !46, line: 60, baseType: !34, size: 64, offset: 448)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !719, file: !46, line: 61, baseType: !34, size: 64, offset: 512)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !719, file: !46, line: 64, baseType: !34, size: 64, offset: 576)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !719, file: !46, line: 65, baseType: !34, size: 64, offset: 640)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !719, file: !46, line: 66, baseType: !34, size: 64, offset: 704)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !719, file: !46, line: 68, baseType: !61, size: 64, offset: 768)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !719, file: !46, line: 70, baseType: !718, size: 64, offset: 832)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !719, file: !46, line: 72, baseType: !38, size: 32, offset: 896)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !719, file: !46, line: 73, baseType: !38, size: 32, offset: 928)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !719, file: !46, line: 74, baseType: !67, size: 64, offset: 960)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !719, file: !46, line: 77, baseType: !71, size: 16, offset: 1024)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !719, file: !46, line: 78, baseType: !73, size: 8, offset: 1040)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !719, file: !46, line: 79, baseType: !75, size: 8, offset: 1048)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !719, file: !46, line: 81, baseType: !79, size: 64, offset: 1088)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !719, file: !46, line: 89, baseType: !82, size: 64, offset: 1152)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !719, file: !46, line: 91, baseType: !84, size: 64, offset: 1216)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !719, file: !46, line: 92, baseType: !87, size: 64, offset: 1280)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !719, file: !46, line: 93, baseType: !718, size: 64, offset: 1344)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !719, file: !46, line: 94, baseType: !91, size: 64, offset: 1408)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !719, file: !46, line: 95, baseType: !93, size: 64, offset: 1472)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !719, file: !46, line: 96, baseType: !38, size: 32, offset: 1536)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !719, file: !46, line: 98, baseType: !98, size: 160, offset: 1568)
!750 = distinct !DICompileUnit(language: DW_LANG_C99, file: !751, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !39, retainedTypes: !752, splitDebugInlining: false, nameTableKind: None)
!751 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!752 = !{!753}
!753 = !DISubprogram(name: "setlocale_null_r", scope: !754, file: !754, line: 64, type: !755, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!754 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!755 = !DISubroutineType(types: !756)
!756 = !{!38, !38, !34, !95}
!757 = distinct !DICompileUnit(language: DW_LANG_C99, file: !758, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !759, retainedTypes: !1146, splitDebugInlining: false, nameTableKind: None)
!758 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!759 = !{!760}
!760 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !761, line: 41, baseType: !7, size: 32, elements: !762)
!761 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!762 = !{!763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145}
!763 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!764 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!765 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!766 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!767 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!768 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!769 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!770 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!771 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!772 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!773 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!774 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!775 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!776 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!777 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!778 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!779 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!780 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!781 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!782 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!783 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!784 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!785 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!786 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!787 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!788 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!789 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!790 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!791 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!792 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!793 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!794 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!795 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!796 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!797 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!798 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!799 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!800 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!801 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!802 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!803 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!804 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!805 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!806 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!807 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!808 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!809 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!810 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!811 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!812 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!813 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!814 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!815 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!816 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!817 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!818 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!819 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!820 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!821 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!822 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!823 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!824 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!825 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!826 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!827 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!828 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!829 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!830 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!831 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!832 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!833 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!834 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!835 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!836 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!837 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!838 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!839 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!840 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!841 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!842 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!843 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!844 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!845 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!846 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!847 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!871 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!874 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!875 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!876 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!877 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!878 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!879 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!880 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!881 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!882 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!883 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!884 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!885 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!886 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!887 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!894 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!895 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!896 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!898 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!899 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!900 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!901 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!902 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!903 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!904 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!905 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!906 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!907 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!908 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!909 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!910 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!911 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!912 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!913 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!914 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!915 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!916 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!917 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!918 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!919 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!920 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!921 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!922 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!923 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!924 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!925 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!926 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!927 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!928 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!929 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!930 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!931 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!932 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!933 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!934 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!935 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!936 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!937 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!938 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!939 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!940 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!941 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!942 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!943 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!944 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!945 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!946 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!947 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!948 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!949 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!950 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!951 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!952 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!953 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!954 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!955 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!956 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!957 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!958 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!959 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!960 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!961 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!962 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!963 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!964 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!965 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!966 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!967 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!968 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!969 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
