; ModuleID = 'coreutils-8.32/src/cat.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [FILE]...\0A\00", align 1
@.str.2 = private unnamed_addr constant [41 x i8] c"Concatenate FILE(s) to standard output.\0A\00", align 1

!20 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!21 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!22 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!23 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!24 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!25 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!26 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !28, line: 45, baseType: !14, size: 32, elements: !29)
!28 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!29 = !{!30, !31, !32, !33, !34, !35}
!30 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0, isUnsigned: true)
!31 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2, isUnsigned: true)
!32 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5, isUnsigned: true)
!33 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4, isUnsigned: true)
!34 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3, isUnsigned: true)
!35 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1, isUnsigned: true)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !37, line: 73, baseType: !14, size: 32, elements: !38)
!37 = !DIFile(filename: "src/ioblksize.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!38 = !{!39}
!39 = !DIEnumerator(name: "IO_BUFSIZE", value: 131072, isUnsigned: true)
!40 = !{!8, !41, !42}
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !43, line: 46, baseType: !44)
!43 = !DIFile(filename: "/usr/lib/clang/12.0.1/include/stddef.h", directory: "")
!44 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!45 = !{!0, !46, !50, !52, !54, !56, !58, !63}
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "infile", scope: !10, file: !3, line: 52, type: !48, isLocal: true, isDefinition: true)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!50 = !DIGlobalVariableExpression(var: !51, expr: !DIExpression())
!51 = distinct !DIGlobalVariable(name: "input_desc", scope: !10, file: !3, line: 55, type: !6, isLocal: true, isDefinition: true)
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(name: "newlines2", scope: !10, file: !3, line: 79, type: !6, isLocal: true, isDefinition: true)
!54 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression())
!55 = distinct !DIGlobalVariable(name: "line_num_end", scope: !10, file: !3, line: 76, type: !8, isLocal: true, isDefinition: true)
!56 = !DIGlobalVariableExpression(var: !57, expr: !DIExpression())
!57 = distinct !DIGlobalVariable(name: "line_num_start", scope: !10, file: !3, line: 73, type: !8, isLocal: true, isDefinition: true)
!58 = !DIGlobalVariableExpression(var: !59, expr: !DIExpression())
!59 = distinct !DIGlobalVariable(name: "line_buf", scope: !10, file: !3, line: 61, type: !60, isLocal: true, isDefinition: true)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 160, elements: !61)
!61 = !{!62}
!62 = !DISubrange(count: 20)
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "line_num_print", scope: !10, file: !3, line: 70, type: !8, isLocal: true, isDefinition: true)
!65 = !{!66, !67, !68, !69, !70, !71, !72, !73, !75, !76, !77, !82, !85, !86, !87, !124, !125, !126, !127, !128, !129, !130, !131}
!66 = !DILocalVariable(name: "argc", arg: 1, scope: !2, file: !3, line: 503, type: !6)
!67 = !DILocalVariable(name: "argv", arg: 2, scope: !2, file: !3, line: 503, type: !7)
!68 = !DILocalVariable(name: "outsize", scope: !2, file: !3, line: 506, type: !42)
!69 = !DILocalVariable(name: "insize", scope: !2, file: !3, line: 509, type: !42)
!70 = !DILocalVariable(name: "page_size", scope: !2, file: !3, line: 511, type: !42)
!71 = !DILocalVariable(name: "inbuf", scope: !2, file: !3, line: 514, type: !8)
!72 = !DILocalVariable(name: "outbuf", scope: !2, file: !3, line: 517, type: !8)
!73 = !DILocalVariable(name: "ok", scope: !2, file: !3, line: 519, type: !74)
!74 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!75 = !DILocalVariable(name: "c", scope: !2, file: !3, line: 520, type: !6)
!76 = !DILocalVariable(name: "argind", scope: !2, file: !3, line: 523, type: !6)
!77 = !DILocalVariable(name: "out_dev", scope: !2, file: !3, line: 526, type: !78)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !79, line: 59, baseType: !80)
!79 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !81, line: 145, baseType: !44)
!81 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!82 = !DILocalVariable(name: "out_ino", scope: !2, file: !3, line: 529, type: !83)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !79, line: 47, baseType: !84)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !81, line: 148, baseType: !44)
!85 = !DILocalVariable(name: "out_isreg", scope: !2, file: !3, line: 532, type: !74)
!86 = !DILocalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 535, type: !74)
!87 = !DILocalVariable(name: "stat_buf", scope: !2, file: !3, line: 537, type: !88)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !89, line: 26, size: 1152, elements: !90)
!89 = !DIFile(filename: "/usr/include/bits/struct_stat.h", directory: "")
!90 = !{!91, !92, !93, !95, !97, !99, !101, !102, !103, !106, !108, !110, !118, !119, !120}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !88, file: !89, line: 28, baseType: !80, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !88, file: !89, line: 33, baseType: !84, size: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !88, file: !89, line: 41, baseType: !94, size: 64, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !81, line: 151, baseType: !44)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !88, file: !89, line: 42, baseType: !96, size: 32, offset: 192)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !81, line: 150, baseType: !14)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !88, file: !89, line: 44, baseType: !98, size: 32, offset: 224)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !81, line: 146, baseType: !14)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !88, file: !89, line: 45, baseType: !100, size: 32, offset: 256)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !81, line: 147, baseType: !14)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !88, file: !89, line: 47, baseType: !6, size: 32, offset: 288)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !88, file: !89, line: 49, baseType: !80, size: 64, offset: 320)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !88, file: !89, line: 54, baseType: !104, size: 64, offset: 384)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !81, line: 152, baseType: !105)
!105 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !88, file: !89, line: 58, baseType: !107, size: 64, offset: 448)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !81, line: 175, baseType: !105)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !88, file: !89, line: 60, baseType: !109, size: 64, offset: 512)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !81, line: 180, baseType: !105)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !88, file: !89, line: 71, baseType: !111, size: 128, offset: 576)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !112, line: 10, size: 128, elements: !113)
!112 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!113 = !{!114, !116}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !111, file: !112, line: 12, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !81, line: 160, baseType: !105)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !111, file: !112, line: 16, baseType: !117, size: 64, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !81, line: 197, baseType: !105)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !88, file: !89, line: 72, baseType: !111, size: 128, offset: 704)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !88, file: !89, line: 73, baseType: !111, size: 128, offset: 832)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !88, file: !89, line: 86, baseType: !121, size: 192, offset: 960)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 192, elements: !122)
!122 = !{!123}
!123 = !DISubrange(count: 3)
!124 = !DILocalVariable(name: "number", scope: !2, file: !3, line: 540, type: !74)
!125 = !DILocalVariable(name: "number_nonblank", scope: !2, file: !3, line: 541, type: !74)
!126 = !DILocalVariable(name: "squeeze_blank", scope: !2, file: !3, line: 542, type: !74)
!127 = !DILocalVariable(name: "show_ends", scope: !2, file: !3, line: 543, type: !74)
!128 = !DILocalVariable(name: "show_nonprinting", scope: !2, file: !3, line: 544, type: !74)
!129 = !DILocalVariable(name: "show_tabs", scope: !2, file: !3, line: 545, type: !74)
!130 = !DILocalVariable(name: "file_open_mode", scope: !2, file: !3, line: 546, type: !6)
!131 = !DILabel(scope: !132, name: "contin", file: !3, line: 754)
!132 = distinct !DILexicalBlock(scope: !2, file: !3, line: 659, column: 5)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 2560, elements: !143)
!134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !135)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !136, line: 50, size: 256, elements: !137)
!136 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!137 = !{!138, !139, !140, !142}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !135, file: !136, line: 52, baseType: !48, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !135, file: !136, line: 55, baseType: !6, size: 32, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !135, file: !136, line: 56, baseType: !141, size: 64, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !135, file: !136, line: 57, baseType: !6, size: 32, offset: 192)
!143 = !{!144}
!144 = !DISubrange(count: 10)
!145 = !DIGlobalVariableExpression(var: !146, expr: !DIExpression())
!146 = distinct !DIGlobalVariable(name: "Version", scope: !147, file: !148, line: 2, type: !48, isLocal: false, isDefinition: true)
!147 = distinct !DICompileUnit(language: DW_LANG_C99, file: !148, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !149, globals: !150, splitDebugInlining: false, nameTableKind: None)
!148 = !DIFile(filename: "src/version.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!149 = !{}
!150 = !{!145}
!151 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression())
!152 = distinct !DIGlobalVariable(name: "file_name", scope: !153, file: !154, line: 46, type: !48, isLocal: true, isDefinition: true)
!153 = distinct !DICompileUnit(language: DW_LANG_C99, file: !154, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !149, globals: !155, splitDebugInlining: false, nameTableKind: None)
!154 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!155 = !{!151, !156}
!156 = !DIGlobalVariableExpression(var: !157, expr: !DIExpression())
!157 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !153, file: !154, line: 56, type: !74, isLocal: true, isDefinition: true)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "exit_failure", scope: !160, file: !161, line: 24, type: !163, isLocal: false, isDefinition: true)
!160 = distinct !DICompileUnit(language: DW_LANG_C99, file: !161, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !149, globals: !162, splitDebugInlining: false, nameTableKind: None)
!161 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!162 = !{!158}
!163 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !6)
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(name: "program_name", scope: !166, file: !167, line: 33, type: !48, isLocal: false, isDefinition: true)
!166 = distinct !DICompileUnit(language: DW_LANG_C99, file: !167, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !149, retainedTypes: !168, globals: !169, splitDebugInlining: false, nameTableKind: None)
!167 = !DIFile(filename: "lib/progname.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!168 = !{!41, !8}
!169 = !{!164}
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !172, file: !173, line: 85, type: !232, isLocal: false, isDefinition: true)
!172 = distinct !DICompileUnit(language: DW_LANG_C99, file: !173, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !174, retainedTypes: !195, globals: !197, splitDebugInlining: false, nameTableKind: None)
!173 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!174 = !{!12, !175, !180}
!175 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !13, line: 242, baseType: !14, size: 32, elements: !176)
!176 = !{!177, !178, !179}
!177 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!178 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!179 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!180 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !181, line: 46, baseType: !14, size: 32, elements: !182)
!181 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!182 = !{!183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194}
!183 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!184 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!185 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!186 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!187 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!188 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!189 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!190 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!191 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!192 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!193 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!194 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!195 = !{!6, !196, !42, !8}
!196 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!197 = !{!170, !198, !202, !214, !216, !221, !228, !230}
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !172, file: !173, line: 101, type: !200, isLocal: false, isDefinition: true)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 320, elements: !143)
!201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !172, file: !173, line: 1052, type: !204, isLocal: false, isDefinition: true)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !173, line: 65, size: 448, elements: !205)
!205 = !{!206, !207, !208, !212, !213}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !204, file: !173, line: 68, baseType: !12, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !204, file: !173, line: 71, baseType: !6, size: 32, offset: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !204, file: !173, line: 75, baseType: !209, size: 256, offset: 64)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 256, elements: !210)
!210 = !{!211}
!211 = !DISubrange(count: 8)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !204, file: !173, line: 78, baseType: !48, size: 64, offset: 320)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !204, file: !173, line: 81, baseType: !48, size: 64, offset: 384)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !172, file: !173, line: 116, type: !204, isLocal: true, isDefinition: true)
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "slot0", scope: !172, file: !173, line: 842, type: !218, isLocal: true, isDefinition: true)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2048, elements: !219)
!219 = !{!220}
!220 = !DISubrange(count: 256)
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(name: "slotvec", scope: !172, file: !173, line: 845, type: !223, isLocal: true, isDefinition: true)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !173, line: 834, size: 128, elements: !225)
!225 = !{!226, !227}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !224, file: !173, line: 836, baseType: !42, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !224, file: !173, line: 837, baseType: !8, size: 64, offset: 64)
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(name: "nslots", scope: !172, file: !173, line: 843, type: !6, isLocal: true, isDefinition: true)
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(name: "slotvec0", scope: !172, file: !173, line: 844, type: !224, isLocal: true, isDefinition: true)
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, size: 704, elements: !234)
!233 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!234 = !{!235}
!235 = !DISubrange(count: 11)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !238, file: !239, line: 26, type: !241, isLocal: false, isDefinition: true)
!238 = distinct !DICompileUnit(language: DW_LANG_C99, file: !239, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !149, globals: !240, splitDebugInlining: false, nameTableKind: None)
!239 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!240 = !{!236}
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 376, elements: !242)
!242 = !{!243}
!243 = !DISubrange(count: 47)
!244 = distinct !DICompileUnit(language: DW_LANG_C99, file: !245, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !246, splitDebugInlining: false, nameTableKind: None)
!245 = !DIFile(filename: "lib/fadvise.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!246 = !{!27}
!247 = distinct !DICompileUnit(language: DW_LANG_C99, file: !248, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !149, retainedTypes: !249, splitDebugInlining: false, nameTableKind: None)
!248 = !DIFile(filename: "lib/full-write.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!249 = !{!48, !42}
!250 = distinct !DICompileUnit(language: DW_LANG_C99, file: !251, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !252, splitDebugInlining: false, nameTableKind: None)
!251 = !DIFile(filename: "lib/safe-read.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!252 = !{!253}
!253 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !254, line: 40, baseType: !14, size: 32, elements: !255)
!254 = !DIFile(filename: "./lib/sys-limits.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!255 = !{!256}
!256 = !DIEnumerator(name: "SYS_BUFSIZE_MAX", value: 2146435072, isUnsigned: true)
!257 = distinct !DICompileUnit(language: DW_LANG_C99, file: !258, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !252, splitDebugInlining: false, nameTableKind: None)
!258 = !DIFile(filename: "lib/safe-write.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!259 = distinct !DICompileUnit(language: DW_LANG_C99, file: !260, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !261, retainedTypes: !265, splitDebugInlining: false, nameTableKind: None)
!260 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!261 = !{!262}
!262 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !260, line: 40, baseType: !14, size: 32, elements: !263)
!263 = !{!264}
!264 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!265 = !{!41}
!266 = distinct !DICompileUnit(language: DW_LANG_C99, file: !267, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !268, retainedTypes: !282, splitDebugInlining: false, nameTableKind: None)
!267 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!268 = !{!269}
!269 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !271, file: !270, line: 186, baseType: !14, size: 32, elements: !280)
!270 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!271 = distinct !DISubprogram(name: "x2nrealloc", scope: !270, file: !270, line: 174, type: !272, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !266, retainedNodes: !275)
!272 = !DISubroutineType(types: !273)
!273 = !{!41, !41, !274, !42}
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!275 = !{!276, !277, !278, !279}
!276 = !DILocalVariable(name: "p", arg: 1, scope: !271, file: !270, line: 174, type: !41)
!277 = !DILocalVariable(name: "pn", arg: 2, scope: !271, file: !270, line: 174, type: !274)
!278 = !DILocalVariable(name: "s", arg: 3, scope: !271, file: !270, line: 174, type: !42)
!279 = !DILocalVariable(name: "n", scope: !271, file: !270, line: 176, type: !42)
!280 = !{!281}
!281 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!282 = !{!42, !8, !41}
!283 = distinct !DICompileUnit(language: DW_LANG_C99, file: !284, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !149, splitDebugInlining: false, nameTableKind: None)
!284 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!285 = distinct !DICompileUnit(language: DW_LANG_C99, file: !286, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !149, retainedTypes: !265, splitDebugInlining: false, nameTableKind: None)
!286 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!287 = distinct !DICompileUnit(language: DW_LANG_C99, file: !288, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !149, retainedTypes: !289, splitDebugInlining: false, nameTableKind: None)
!288 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!289 = !{!42}
!290 = distinct !DICompileUnit(language: DW_LANG_C99, file: !291, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !149, splitDebugInlining: false, nameTableKind: None)
!291 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!292 = distinct !DICompileUnit(language: DW_LANG_C99, file: !293, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !149, splitDebugInlining: false, nameTableKind: None)
!293 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!294 = distinct !DICompileUnit(language: DW_LANG_C99, file: !295, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !296, retainedTypes: !265, splitDebugInlining: false, nameTableKind: None)
!295 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!296 = !{!297}
!297 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !298, line: 41, baseType: !14, size: 32, elements: !299)
!298 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!299 = !{!300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682}
!300 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!301 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!302 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!303 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!304 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!305 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!306 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!307 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!308 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!309 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!310 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!311 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!312 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!313 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!314 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!315 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!316 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!317 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!318 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!319 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!320 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!321 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!322 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!323 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!324 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!325 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!326 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!327 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!328 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!329 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!330 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!331 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!332 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!333 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!334 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!335 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!336 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!337 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!338 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!339 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!340 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!341 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!342 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!343 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!344 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!345 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!346 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!347 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!348 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!349 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!350 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!351 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!352 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!353 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!354 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!355 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!356 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!357 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!358 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!359 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!360 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!361 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!362 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!363 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!364 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!365 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!366 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!367 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!368 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!369 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!370 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!371 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!372 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!373 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!374 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!375 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!376 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!377 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!378 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!379 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!380 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!381 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!382 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!383 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!384 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!385 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!386 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!387 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!388 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!389 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!390 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!391 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!392 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!393 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!394 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!395 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!396 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!397 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!398 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!399 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!400 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!401 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!402 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!403 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!404 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!405 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!406 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!407 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!408 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!409 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!410 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!411 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!412 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!413 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!414 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!415 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!416 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!417 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!418 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!419 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!420 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!421 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!422 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!423 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!424 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!425 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!426 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!427 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!428 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!429 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!430 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!431 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!432 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!433 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!434 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!435 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!436 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!437 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!438 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!439 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!440 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!441 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!442 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!443 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!444 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!445 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!446 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!447 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!448 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!449 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!450 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!451 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!452 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!453 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!454 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!455 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!456 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!457 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!458 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!459 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!460 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!461 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!462 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!463 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!464 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!465 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!466 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!467 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!468 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!469 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!470 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!471 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!472 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!473 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!474 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!475 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!476 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!477 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!478 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!479 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!480 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!481 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!482 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!483 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!484 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!485 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!486 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!487 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!488 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!489 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!490 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!491 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!492 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!493 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!494 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!495 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!496 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!497 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!498 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!499 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!500 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!501 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!502 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!503 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!504 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!505 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!506 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!507 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!508 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!509 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!510 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!511 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!512 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!513 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!514 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!515 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!516 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!517 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!518 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!519 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!520 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!521 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!522 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!523 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!524 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!525 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!526 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!527 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!528 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!529 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!530 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!531 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!532 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!533 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!534 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!535 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!536 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!537 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!538 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!539 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!540 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!541 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!542 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!543 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!544 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!545 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!546 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!547 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!548 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!549 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!550 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!551 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!552 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!553 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!554 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!555 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!556 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!557 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!558 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!559 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!560 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!561 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!562 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!563 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!564 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!565 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!566 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!567 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!568 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!569 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!570 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!571 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!572 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!573 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!574 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!575 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!576 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!577 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!578 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!579 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!580 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!581 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!582 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!583 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!584 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!585 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!586 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!587 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!588 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!589 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!590 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!591 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!592 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!593 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!594 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!595 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!596 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!597 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!598 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!599 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!600 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!601 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!602 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!603 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!604 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!605 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!606 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!607 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!608 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!609 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!610 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!611 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!612 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!613 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!614 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!615 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!616 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!617 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!618 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!619 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!620 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!621 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!622 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!623 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!624 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!625 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!626 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!627 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!628 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!629 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!630 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!631 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!632 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!633 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!634 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!635 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!636 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!637 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!661 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!662 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!663 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!664 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!665 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!666 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!667 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!668 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!669 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!670 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!671 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!672 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!673 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!674 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!675 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!676 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!677 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!678 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!679 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!680 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!681 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!682 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!683 = distinct !DICompileUnit(language: DW_LANG_C99, file: !684, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !149, retainedTypes: !265, splitDebugInlining: false, nameTableKind: None)
!684 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!685 = distinct !DICompileUnit(language: DW_LANG_C99, file: !686, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !149, splitDebugInlining: false, nameTableKind: None)
!686 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!687 = distinct !DICompileUnit(language: DW_LANG_C99, file: !688, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !149, retainedTypes: !265, splitDebugInlining: false, nameTableKind: None)
!688 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!689 = distinct !DICompileUnit(language: DW_LANG_C99, file: !690, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !149, retainedTypes: !265, splitDebugInlining: false, nameTableKind: None)
!690 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!691 = !{!"clang version 12.0.1"}
!692 = !{i32 7, !"Dwarf Version", i32 4}
!693 = !{i32 2, !"Debug Info Version", i32 3}
!694 = !{i32 1, !"wchar_size", i32 4}
!695 = !{i32 7, !"PIC Level", i32 2}
!696 = !{i32 7, !"PIE Level", i32 2}
!697 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 82, type: !698, scopeLine: 83, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !700)
!698 = !DISubroutineType(types: !699)
!699 = !{null, !6}
!700 = !{!701}
!701 = !DILocalVariable(name: "status", arg: 1, scope: !697, file: !3, line: 82, type: !6)
!702 = !DILocation(line: 0, scope: !697)
!703 = !DILocation(line: 84, column: 14, scope: !704)
!704 = distinct !DILexicalBlock(scope: !697, file: !3, line: 84, column: 7)
!705 = !DILocation(line: 84, column: 7, scope: !697)
!706 = !DILocation(line: 85, column: 5, scope: !707)
!707 = distinct !DILexicalBlock(scope: !704, file: !3, line: 85, column: 5)
!708 = !{!709, !709, i64 0}
!709 = !{!"any pointer", !710, i64 0}
!710 = !{!"omnipotent char", !711, i64 0}
!711 = !{!"Simple C/C++ TBAA"}
!712 = !DILocation(line: 88, column: 7, scope: !713)
!713 = distinct !DILexicalBlock(scope: !704, file: !3, line: 87, column: 5)
!714 = !DILocation(line: 92, column: 7, scope: !713)
!715 = !DILocation(line: 583, column: 3, scope: !716, inlinedAt: !720)
!716 = distinct !DISubprogram(name: "emit_stdin_note", scope: !717, file: !717, line: 581, type: !718, scopeLine: 582, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !149)
!717 = !DIFile(filename: "src/system.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!718 = !DISubroutineType(types: !719)
!719 = !{null}
!720 = distinct !DILocation(line: 96, column: 7, scope: !713)
!721 = !DILocation(line: 98, column: 7, scope: !713)
!722 = !DILocation(line: 107, column: 7, scope: !713)
!723 = !DILocation(line: 113, column: 7, scope: !713)
!724 = !DILocation(line: 114, column: 7, scope: !713)
!725 = !DILocation(line: 115, column: 7, scope: !713)
!726 = !DILocalVariable(name: "program", arg: 1, scope: !727, file: !717, line: 634, type: !48)
!727 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !717, file: !717, line: 634, type: !728, scopeLine: 635, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !730)
!728 = !DISubroutineType(types: !729)
!729 = !{null, !48}
!730 = !{!726, !731, !740, !741, !743}
!731 = !DILocalVariable(name: "infomap", scope: !727, file: !717, line: 636, type: !732)
!732 = !DICompositeType(tag: DW_TAG_array_type, baseType: !733, size: 896, elements: !738)
!733 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !734)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !727, file: !717, line: 636, size: 128, elements: !735)
!735 = !{!736, !737}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !734, file: !717, line: 636, baseType: !48, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !734, file: !717, line: 636, baseType: !48, size: 64, offset: 64)
!738 = !{!739}
!739 = !DISubrange(count: 7)
!740 = !DILocalVariable(name: "node", scope: !727, file: !717, line: 646, type: !48)
!741 = !DILocalVariable(name: "map_prog", scope: !727, file: !717, line: 647, type: !742)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!743 = !DILocalVariable(name: "lc_messages", scope: !727, file: !717, line: 659, type: !48)
!744 = !DILocation(line: 0, scope: !727, inlinedAt: !745)
!745 = distinct !DILocation(line: 122, column: 7, scope: !713)
!746 = !DILocation(line: 636, column: 3, scope: !727, inlinedAt: !745)
!747 = !DILocation(line: 636, column: 67, scope: !727, inlinedAt: !745)
!748 = !DILocation(line: 647, column: 36, scope: !727, inlinedAt: !745)
!749 = !DILocation(line: 649, column: 3, scope: !727, inlinedAt: !745)
!750 = !DILocation(line: 649, column: 33, scope: !727, inlinedAt: !745)
!751 = !DILocation(line: 650, column: 13, scope: !727, inlinedAt: !745)
!752 = !DILocation(line: 649, column: 20, scope: !727, inlinedAt: !745)
!753 = !{!754, !709, i64 0}
!754 = !{!"infomap", !709, i64 0, !709, i64 8}
!755 = !DILocation(line: 649, column: 10, scope: !727, inlinedAt: !745)
!756 = !DILocation(line: 649, column: 28, scope: !727, inlinedAt: !745)
!757 = distinct !{!757, !749, !751, !758}
!758 = !{!"llvm.loop.mustprogress"}
!759 = !DILocation(line: 652, column: 17, scope: !760, inlinedAt: !745)
!760 = distinct !DILexicalBlock(scope: !727, file: !717, line: 652, column: 7)
!761 = !{!754, !709, i64 8}
!762 = !DILocation(line: 652, column: 7, scope: !760, inlinedAt: !745)
!763 = !DILocation(line: 652, column: 7, scope: !727, inlinedAt: !745)
!764 = !DILocation(line: 655, column: 3, scope: !727, inlinedAt: !745)
!765 = !DILocation(line: 659, column: 29, scope: !727, inlinedAt: !745)
!766 = !DILocation(line: 660, column: 7, scope: !767, inlinedAt: !745)
!767 = distinct !DILexicalBlock(scope: !727, file: !717, line: 660, column: 7)
!768 = !DILocation(line: 660, column: 19, scope: !767, inlinedAt: !745)
!769 = !DILocation(line: 660, column: 22, scope: !767, inlinedAt: !745)
!770 = !DILocation(line: 660, column: 7, scope: !727, inlinedAt: !745)
!771 = !DILocation(line: 666, column: 7, scope: !772, inlinedAt: !745)
!772 = distinct !DILexicalBlock(scope: !767, file: !717, line: 661, column: 5)
!773 = !DILocation(line: 668, column: 5, scope: !772, inlinedAt: !745)
!774 = !DILocation(line: 669, column: 3, scope: !727, inlinedAt: !745)
!775 = !DILocation(line: 671, column: 3, scope: !727, inlinedAt: !745)
!776 = !DILocation(line: 673, column: 1, scope: !727, inlinedAt: !745)
!777 = !DILocation(line: 124, column: 3, scope: !697)
!778 = !DISubprogram(name: "dcgettext", scope: !779, file: !779, line: 51, type: !780, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !149)
!779 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!780 = !DISubroutineType(types: !781)
!781 = !{!8, !48, !48, !6}
!782 = !DISubprogram(name: "fputs_unlocked", scope: !783, file: !783, line: 667, type: !784, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !149)
!783 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!784 = !DISubroutineType(types: !785)
!785 = !{!6, !48, !786}
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !788, line: 49, size: 1728, elements: !789)
!788 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!789 = !{!790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !805, !806, !807, !808, !809, !810, !812, !816, !819, !821, !824, !827, !828, !829, !830, !831}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !787, file: !788, line: 51, baseType: !6, size: 32)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !787, file: !788, line: 54, baseType: !8, size: 64, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !787, file: !788, line: 55, baseType: !8, size: 64, offset: 128)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !787, file: !788, line: 56, baseType: !8, size: 64, offset: 192)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !787, file: !788, line: 57, baseType: !8, size: 64, offset: 256)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !787, file: !788, line: 58, baseType: !8, size: 64, offset: 320)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !787, file: !788, line: 59, baseType: !8, size: 64, offset: 384)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !787, file: !788, line: 60, baseType: !8, size: 64, offset: 448)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !787, file: !788, line: 61, baseType: !8, size: 64, offset: 512)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !787, file: !788, line: 64, baseType: !8, size: 64, offset: 576)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !787, file: !788, line: 65, baseType: !8, size: 64, offset: 640)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !787, file: !788, line: 66, baseType: !8, size: 64, offset: 704)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !787, file: !788, line: 68, baseType: !803, size: 64, offset: 768)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !788, line: 36, flags: DIFlagFwdDecl)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !787, file: !788, line: 70, baseType: !786, size: 64, offset: 832)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !787, file: !788, line: 72, baseType: !6, size: 32, offset: 896)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !787, file: !788, line: 73, baseType: !6, size: 32, offset: 928)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !787, file: !788, line: 74, baseType: !104, size: 64, offset: 960)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !787, file: !788, line: 77, baseType: !196, size: 16, offset: 1024)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !787, file: !788, line: 78, baseType: !811, size: 8, offset: 1040)
!811 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !787, file: !788, line: 79, baseType: !813, size: 8, offset: 1048)
!813 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8, elements: !814)
!814 = !{!815}
!815 = !DISubrange(count: 1)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !787, file: !788, line: 81, baseType: !817, size: 64, offset: 1088)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !788, line: 43, baseType: null)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !787, file: !788, line: 89, baseType: !820, size: 64, offset: 1152)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !81, line: 153, baseType: !105)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !787, file: !788, line: 91, baseType: !822, size: 64, offset: 1216)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !788, line: 37, flags: DIFlagFwdDecl)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !787, file: !788, line: 92, baseType: !825, size: 64, offset: 1280)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !788, line: 38, flags: DIFlagFwdDecl)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !787, file: !788, line: 93, baseType: !786, size: 64, offset: 1344)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !787, file: !788, line: 94, baseType: !41, size: 64, offset: 1408)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !787, file: !788, line: 95, baseType: !42, size: 64, offset: 1472)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !787, file: !788, line: 96, baseType: !6, size: 32, offset: 1536)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !787, file: !788, line: 98, baseType: !60, size: 160, offset: 1568)
!832 = !DISubprogram(name: "setlocale", scope: !833, file: !833, line: 122, type: !834, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !149)
!833 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!834 = !DISubroutineType(types: !835)
!835 = !{!8, !6, !48}
!836 = !DILocation(line: 0, scope: !2)
!837 = !DILocation(line: 511, column: 22, scope: !2)
!838 = !DILocation(line: 537, column: 3, scope: !2)
!839 = !DILocation(line: 537, column: 15, scope: !2)
!840 = !DILocation(line: 563, column: 21, scope: !2)
!841 = !DILocation(line: 563, column: 3, scope: !2)
!842 = !DILocation(line: 564, column: 3, scope: !2)
!843 = !DILocation(line: 565, column: 3, scope: !2)
!844 = !DILocation(line: 566, column: 3, scope: !2)
!845 = !DILocation(line: 572, column: 3, scope: !2)
!846 = !DILocation(line: 576, column: 3, scope: !2)
!847 = !DILocation(line: 540, column: 8, scope: !2)
!848 = !DILocation(line: 541, column: 8, scope: !2)
!849 = !DILocation(line: 542, column: 8, scope: !2)
!850 = !DILocation(line: 543, column: 8, scope: !2)
!851 = !DILocation(line: 544, column: 8, scope: !2)
!852 = !DILocation(line: 576, column: 15, scope: !2)
!853 = distinct !{!853, !846, !854, !758}
!854 = !DILocation(line: 633, column: 5, scope: !2)
!855 = !DILocation(line: 584, column: 11, scope: !856)
!856 = distinct !DILexicalBlock(scope: !857, file: !3, line: 580, column: 9)
!857 = distinct !DILexicalBlock(scope: !2, file: !3, line: 578, column: 5)
!858 = !DILocation(line: 589, column: 11, scope: !856)
!859 = !DILocation(line: 593, column: 11, scope: !856)
!860 = !DILocation(line: 597, column: 11, scope: !856)
!861 = !DILocation(line: 602, column: 11, scope: !856)
!862 = !DILocation(line: 610, column: 11, scope: !856)
!863 = !DILocation(line: 616, column: 11, scope: !856)
!864 = !DILocation(line: 620, column: 11, scope: !856)
!865 = !DILocation(line: 624, column: 11, scope: !856)
!866 = !DILocation(line: 626, column: 9, scope: !856)
!867 = !DILocation(line: 628, column: 9, scope: !856)
!868 = !DILocation(line: 631, column: 11, scope: !856)
!869 = !DILocation(line: 637, column: 7, scope: !870)
!870 = distinct !DILexicalBlock(scope: !2, file: !3, line: 637, column: 7)
!871 = !DILocation(line: 637, column: 40, scope: !870)
!872 = !DILocation(line: 637, column: 7, scope: !2)
!873 = !DILocation(line: 638, column: 5, scope: !870)
!874 = !{!875, !875, i64 0}
!875 = !{!"int", !710, i64 0}
!876 = !DILocalVariable(name: "sb", arg: 1, scope: !877, file: !37, line: 75, type: !88)
!877 = distinct !DISubprogram(name: "io_blksize", scope: !37, file: !37, line: 75, type: !878, scopeLine: 76, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !880)
!878 = !DISubroutineType(types: !879)
!879 = !{!42, !88}
!880 = !{!876}
!881 = !DILocation(line: 75, column: 25, scope: !877, inlinedAt: !882)
!882 = distinct !DILocation(line: 640, column: 13, scope: !2)
!883 = !DILocation(line: 77, column: 10, scope: !877, inlinedAt: !882)
!884 = !{!885, !886, i64 56}
!885 = !{!"stat", !886, i64 0, !886, i64 8, !886, i64 16, !875, i64 24, !875, i64 28, !875, i64 32, !875, i64 36, !886, i64 40, !886, i64 48, !886, i64 56, !886, i64 64, !887, i64 72, !887, i64 88, !887, i64 104, !710, i64 120}
!886 = !{!"long", !710, i64 0}
!887 = !{!"timespec", !886, i64 0, !886, i64 8}
!888 = !DILocation(line: 641, column: 22, scope: !2)
!889 = !{!885, !886, i64 0}
!890 = !DILocation(line: 642, column: 22, scope: !2)
!891 = !{!885, !886, i64 8}
!892 = !DILocation(line: 643, column: 15, scope: !2)
!893 = !{!885, !875, i64 24}
!894 = !DILocation(line: 645, column: 10, scope: !895)
!895 = distinct !DILexicalBlock(scope: !2, file: !3, line: 645, column: 7)
!896 = !DILocation(line: 655, column: 10, scope: !2)
!897 = !DILocation(line: 656, column: 12, scope: !2)
!898 = !DILocation(line: 658, column: 3, scope: !2)
!899 = !DILocation(line: 660, column: 18, scope: !900)
!900 = distinct !DILexicalBlock(scope: !132, file: !3, line: 660, column: 11)
!901 = !DILocation(line: 660, column: 11, scope: !132)
!902 = !DILocation(line: 663, column: 11, scope: !903)
!903 = distinct !DILexicalBlock(scope: !132, file: !3, line: 663, column: 11)
!904 = !DILocation(line: 661, column: 18, scope: !900)
!905 = !DILocation(line: 661, column: 16, scope: !900)
!906 = !DILocation(line: 661, column: 9, scope: !900)
!907 = !DILocation(line: 663, column: 11, scope: !132)
!908 = !DILocation(line: 666, column: 22, scope: !909)
!909 = distinct !DILexicalBlock(scope: !903, file: !3, line: 664, column: 9)
!910 = !DILocation(line: 672, column: 24, scope: !911)
!911 = distinct !DILexicalBlock(scope: !903, file: !3, line: 671, column: 9)
!912 = !DILocation(line: 672, column: 22, scope: !911)
!913 = !DILocation(line: 673, column: 26, scope: !914)
!914 = distinct !DILexicalBlock(scope: !911, file: !3, line: 673, column: 15)
!915 = !DILocation(line: 673, column: 15, scope: !911)
!916 = !DILocation(line: 675, column: 25, scope: !917)
!917 = distinct !DILexicalBlock(scope: !914, file: !3, line: 674, column: 13)
!918 = !DILocation(line: 675, column: 38, scope: !917)
!919 = !DILocation(line: 675, column: 15, scope: !917)
!920 = !DILocation(line: 677, column: 15, scope: !917)
!921 = !DILocation(line: 681, column: 18, scope: !922)
!922 = distinct !DILexicalBlock(scope: !132, file: !3, line: 681, column: 11)
!923 = !DILocation(line: 681, column: 11, scope: !922)
!924 = !DILocation(line: 681, column: 41, scope: !922)
!925 = !DILocation(line: 681, column: 11, scope: !132)
!926 = !DILocation(line: 683, column: 21, scope: !927)
!927 = distinct !DILexicalBlock(scope: !922, file: !3, line: 682, column: 9)
!928 = !DILocation(line: 683, column: 34, scope: !927)
!929 = !DILocation(line: 683, column: 11, scope: !927)
!930 = !DILocation(line: 685, column: 11, scope: !927)
!931 = !DILocation(line: 75, column: 25, scope: !877, inlinedAt: !932)
!932 = distinct !DILocation(line: 687, column: 16, scope: !132)
!933 = !DILocation(line: 77, column: 10, scope: !877, inlinedAt: !932)
!934 = !DILocation(line: 689, column: 17, scope: !132)
!935 = !DILocation(line: 689, column: 7, scope: !132)
!936 = !DILocation(line: 696, column: 11, scope: !937)
!937 = distinct !DILexicalBlock(scope: !132, file: !3, line: 695, column: 11)
!938 = !DILocation(line: 697, column: 21, scope: !937)
!939 = !DILocation(line: 697, column: 14, scope: !937)
!940 = !DILocation(line: 697, column: 57, scope: !937)
!941 = !{!885, !886, i64 48}
!942 = !DILocation(line: 697, column: 46, scope: !937)
!943 = !DILocation(line: 695, column: 11, scope: !132)
!944 = !DILocation(line: 699, column: 24, scope: !945)
!945 = distinct !DILexicalBlock(scope: !937, file: !3, line: 698, column: 9)
!946 = !DILocation(line: 699, column: 60, scope: !945)
!947 = !DILocation(line: 699, column: 11, scope: !945)
!948 = !DILocation(line: 701, column: 11, scope: !945)
!949 = !DILocation(line: 707, column: 21, scope: !950)
!950 = distinct !DILexicalBlock(scope: !132, file: !3, line: 707, column: 11)
!951 = !DILocation(line: 710, column: 20, scope: !952)
!952 = distinct !DILexicalBlock(scope: !950, file: !3, line: 709, column: 9)
!953 = !DILocation(line: 711, column: 47, scope: !952)
!954 = !DILocation(line: 711, column: 19, scope: !952)
!955 = !DILocalVariable(name: "ptr", arg: 1, scope: !956, file: !717, line: 501, type: !959)
!956 = distinct !DISubprogram(name: "ptr_align", scope: !717, file: !717, line: 501, type: !957, scopeLine: 502, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !961)
!957 = !DISubroutineType(types: !958)
!958 = !{!41, !959, !42}
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!961 = !{!955, !962, !963, !964}
!962 = !DILocalVariable(name: "alignment", arg: 2, scope: !956, file: !717, line: 501, type: !42)
!963 = !DILocalVariable(name: "p0", scope: !956, file: !717, line: 503, type: !48)
!964 = !DILocalVariable(name: "p1", scope: !956, file: !717, line: 504, type: !48)
!965 = !DILocation(line: 0, scope: !956, inlinedAt: !966)
!966 = distinct !DILocation(line: 713, column: 29, scope: !952)
!967 = !DILocation(line: 504, column: 23, scope: !956, inlinedAt: !966)
!968 = !DILocation(line: 504, column: 35, scope: !956, inlinedAt: !966)
!969 = !DILocation(line: 505, column: 25, scope: !956, inlinedAt: !966)
!970 = !DILocation(line: 505, column: 37, scope: !956, inlinedAt: !966)
!971 = !DILocation(line: 505, column: 23, scope: !956, inlinedAt: !966)
!972 = !DILocalVariable(name: "buf", arg: 1, scope: !973, file: !3, line: 154, type: !8)
!973 = distinct !DISubprogram(name: "simple_cat", scope: !3, file: !3, line: 152, type: !974, scopeLine: 159, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !976)
!974 = !DISubroutineType(types: !975)
!975 = !{!74, !8, !42}
!976 = !{!972, !977, !978, !979}
!977 = !DILocalVariable(name: "bufsize", arg: 2, scope: !973, file: !3, line: 158, type: !42)
!978 = !DILocalVariable(name: "n_read", scope: !973, file: !3, line: 161, type: !42)
!979 = !DILocalVariable(name: "n", scope: !980, file: !3, line: 185, type: !42)
!980 = distinct !DILexicalBlock(scope: !981, file: !3, line: 183, column: 7)
!981 = distinct !DILexicalBlock(scope: !973, file: !3, line: 166, column: 5)
!982 = !DILocation(line: 0, scope: !973, inlinedAt: !983)
!983 = distinct !DILocation(line: 713, column: 17, scope: !952)
!984 = !DILocation(line: 165, column: 3, scope: !973, inlinedAt: !983)
!985 = !DILocation(line: 169, column: 27, scope: !981, inlinedAt: !983)
!986 = !DILocation(line: 169, column: 16, scope: !981, inlinedAt: !983)
!987 = !DILocation(line: 170, column: 11, scope: !981, inlinedAt: !983)
!988 = !DILocation(line: 172, column: 21, scope: !989, inlinedAt: !983)
!989 = distinct !DILexicalBlock(scope: !990, file: !3, line: 171, column: 9)
!990 = distinct !DILexicalBlock(scope: !981, file: !3, line: 170, column: 11)
!991 = !DILocation(line: 172, column: 34, scope: !989, inlinedAt: !983)
!992 = !DILocation(line: 172, column: 11, scope: !989, inlinedAt: !983)
!993 = !DILocation(line: 173, column: 11, scope: !989, inlinedAt: !983)
!994 = !DILocation(line: 0, scope: !980, inlinedAt: !983)
!995 = !DILocation(line: 186, column: 13, scope: !996, inlinedAt: !983)
!996 = distinct !DILexicalBlock(scope: !980, file: !3, line: 186, column: 13)
!997 = !DILocation(line: 186, column: 48, scope: !996, inlinedAt: !983)
!998 = !DILocation(line: 186, column: 13, scope: !980, inlinedAt: !983)
!999 = distinct !{!999, !984, !1000}
!1000 = !DILocation(line: 189, column: 5, scope: !973, inlinedAt: !983)
!1001 = !DILocation(line: 187, column: 11, scope: !996, inlinedAt: !983)
!1002 = !DILocation(line: 717, column: 51, scope: !1003)
!1003 = distinct !DILexicalBlock(scope: !950, file: !3, line: 716, column: 9)
!1004 = !DILocation(line: 717, column: 19, scope: !1003)
!1005 = !DILocation(line: 741, column: 50, scope: !1003)
!1006 = !DILocation(line: 742, column: 41, scope: !1003)
!1007 = !DILocation(line: 741, column: 20, scope: !1003)
!1008 = !DILocation(line: 0, scope: !956, inlinedAt: !1009)
!1009 = distinct !DILocation(line: 744, column: 22, scope: !1003)
!1010 = !DILocation(line: 504, column: 23, scope: !956, inlinedAt: !1009)
!1011 = !DILocation(line: 504, column: 35, scope: !956, inlinedAt: !1009)
!1012 = !DILocation(line: 505, column: 25, scope: !956, inlinedAt: !1009)
!1013 = !DILocation(line: 505, column: 37, scope: !956, inlinedAt: !1009)
!1014 = !DILocation(line: 505, column: 23, scope: !956, inlinedAt: !1009)
!1015 = !DILocation(line: 0, scope: !956, inlinedAt: !1016)
!1016 = distinct !DILocation(line: 745, column: 22, scope: !1003)
!1017 = !DILocation(line: 504, column: 23, scope: !956, inlinedAt: !1016)
!1018 = !DILocation(line: 504, column: 35, scope: !956, inlinedAt: !1016)
!1019 = !DILocation(line: 505, column: 25, scope: !956, inlinedAt: !1016)
!1020 = !DILocation(line: 505, column: 37, scope: !956, inlinedAt: !1016)
!1021 = !DILocation(line: 505, column: 23, scope: !956, inlinedAt: !1016)
!1022 = !DILocalVariable(name: "inbuf", arg: 1, scope: !1023, file: !3, line: 218, type: !8)
!1023 = distinct !DISubprogram(name: "cat", scope: !3, file: !3, line: 216, type: !1024, scopeLine: 236, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !1026)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!74, !8, !42, !8, !42, !74, !74, !74, !74, !74, !74}
!1026 = !{!1022, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1049, !1050, !1053}
!1027 = !DILocalVariable(name: "insize", arg: 2, scope: !1023, file: !3, line: 221, type: !42)
!1028 = !DILocalVariable(name: "outbuf", arg: 3, scope: !1023, file: !3, line: 224, type: !8)
!1029 = !DILocalVariable(name: "outsize", arg: 4, scope: !1023, file: !3, line: 227, type: !42)
!1030 = !DILocalVariable(name: "show_nonprinting", arg: 5, scope: !1023, file: !3, line: 230, type: !74)
!1031 = !DILocalVariable(name: "show_tabs", arg: 6, scope: !1023, file: !3, line: 231, type: !74)
!1032 = !DILocalVariable(name: "number", arg: 7, scope: !1023, file: !3, line: 232, type: !74)
!1033 = !DILocalVariable(name: "number_nonblank", arg: 8, scope: !1023, file: !3, line: 233, type: !74)
!1034 = !DILocalVariable(name: "show_ends", arg: 9, scope: !1023, file: !3, line: 234, type: !74)
!1035 = !DILocalVariable(name: "squeeze_blank", arg: 10, scope: !1023, file: !3, line: 235, type: !74)
!1036 = !DILocalVariable(name: "ch", scope: !1023, file: !3, line: 238, type: !1037)
!1037 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1038 = !DILocalVariable(name: "bpin", scope: !1023, file: !3, line: 241, type: !8)
!1039 = !DILocalVariable(name: "eob", scope: !1023, file: !3, line: 245, type: !8)
!1040 = !DILocalVariable(name: "bpout", scope: !1023, file: !3, line: 248, type: !8)
!1041 = !DILocalVariable(name: "n_read", scope: !1023, file: !3, line: 251, type: !42)
!1042 = !DILocalVariable(name: "newlines", scope: !1023, file: !3, line: 258, type: !6)
!1043 = !DILocalVariable(name: "use_fionread", scope: !1023, file: !3, line: 263, type: !74)
!1044 = !DILocalVariable(name: "wp", scope: !1045, file: !3, line: 282, type: !8)
!1045 = distinct !DILexicalBlock(scope: !1046, file: !3, line: 281, column: 13)
!1046 = distinct !DILexicalBlock(scope: !1047, file: !3, line: 280, column: 15)
!1047 = distinct !DILexicalBlock(scope: !1048, file: !3, line: 277, column: 9)
!1048 = distinct !DILexicalBlock(scope: !1023, file: !3, line: 275, column: 5)
!1049 = !DILocalVariable(name: "remaining_bytes", scope: !1045, file: !3, line: 283, type: !42)
!1050 = !DILocalVariable(name: "input_pending", scope: !1051, file: !3, line: 304, type: !74)
!1051 = distinct !DILexicalBlock(scope: !1052, file: !3, line: 303, column: 13)
!1052 = distinct !DILexicalBlock(scope: !1047, file: !3, line: 302, column: 15)
!1053 = !DILocalVariable(name: "n_to_read", scope: !1051, file: !3, line: 306, type: !6)
!1054 = !DILocation(line: 0, scope: !1023, inlinedAt: !1055)
!1055 = distinct !DILocation(line: 744, column: 17, scope: !1003)
!1056 = !DILocation(line: 258, column: 18, scope: !1023, inlinedAt: !1055)
!1057 = !DILocation(line: 270, column: 14, scope: !1023, inlinedAt: !1055)
!1058 = !DILocation(line: 274, column: 3, scope: !1023, inlinedAt: !1055)
!1059 = !DILocation(line: 272, column: 9, scope: !1023, inlinedAt: !1055)
!1060 = !DILocation(line: 269, column: 7, scope: !1023, inlinedAt: !1055)
!1061 = !DILocation(line: 258, column: 7, scope: !1023, inlinedAt: !1055)
!1062 = !DILocation(line: 280, column: 32, scope: !1046, inlinedAt: !1055)
!1063 = !DILocation(line: 280, column: 15, scope: !1047, inlinedAt: !1055)
!1064 = !DILocation(line: 284, column: 15, scope: !1045, inlinedAt: !1055)
!1065 = !DILocation(line: 0, scope: !1045, inlinedAt: !1055)
!1066 = !DILocation(line: 286, column: 23, scope: !1067, inlinedAt: !1055)
!1067 = distinct !DILexicalBlock(scope: !1068, file: !3, line: 286, column: 23)
!1068 = distinct !DILexicalBlock(scope: !1045, file: !3, line: 285, column: 17)
!1069 = !DILocation(line: 286, column: 63, scope: !1067, inlinedAt: !1055)
!1070 = !DILocation(line: 286, column: 23, scope: !1068, inlinedAt: !1055)
!1071 = !DILocation(line: 287, column: 21, scope: !1067, inlinedAt: !1055)
!1072 = !DILocation(line: 288, column: 22, scope: !1068, inlinedAt: !1055)
!1073 = !DILocation(line: 289, column: 43, scope: !1068, inlinedAt: !1055)
!1074 = !DILocation(line: 291, column: 30, scope: !1045, inlinedAt: !1055)
!1075 = !DILocation(line: 290, column: 17, scope: !1068, inlinedAt: !1055)
!1076 = distinct !{!1076, !1064, !1077, !758}
!1077 = !DILocation(line: 291, column: 48, scope: !1045, inlinedAt: !1055)
!1078 = !DILocalVariable(name: "__dest", arg: 1, scope: !1079, file: !1080, line: 34, type: !41)
!1079 = distinct !DISubprogram(name: "memmove", scope: !1080, file: !1080, line: 34, type: !1081, scopeLine: 35, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !1083)
!1080 = !DIFile(filename: "/usr/include/bits/string_fortified.h", directory: "")
!1081 = !DISubroutineType(types: !1082)
!1082 = !{!41, !41, !959, !42}
!1083 = !{!1078, !1084, !1085}
!1084 = !DILocalVariable(name: "__src", arg: 2, scope: !1079, file: !1080, line: 34, type: !959)
!1085 = !DILocalVariable(name: "__len", arg: 3, scope: !1079, file: !1080, line: 34, type: !42)
!1086 = !DILocation(line: 0, scope: !1079, inlinedAt: !1087)
!1087 = distinct !DILocation(line: 296, column: 15, scope: !1045, inlinedAt: !1055)
!1088 = !DILocation(line: 36, column: 10, scope: !1079, inlinedAt: !1087)
!1089 = !DILocation(line: 297, column: 30, scope: !1045, inlinedAt: !1055)
!1090 = !DILocation(line: 298, column: 13, scope: !1045, inlinedAt: !1055)
!1091 = !DILocation(line: 302, column: 20, scope: !1052, inlinedAt: !1055)
!1092 = !DILocation(line: 302, column: 15, scope: !1047, inlinedAt: !1055)
!1093 = !DILocation(line: 0, scope: !1051, inlinedAt: !1055)
!1094 = !DILocation(line: 306, column: 15, scope: !1051, inlinedAt: !1055)
!1095 = !DILocation(line: 306, column: 19, scope: !1051, inlinedAt: !1055)
!1096 = !DILocation(line: 312, column: 19, scope: !1097, inlinedAt: !1055)
!1097 = distinct !DILexicalBlock(scope: !1051, file: !3, line: 312, column: 19)
!1098 = !DILocation(line: 313, column: 19, scope: !1097, inlinedAt: !1055)
!1099 = !DILocation(line: 313, column: 29, scope: !1097, inlinedAt: !1055)
!1100 = !DILocation(line: 313, column: 22, scope: !1097, inlinedAt: !1055)
!1101 = !DILocation(line: 313, column: 63, scope: !1097, inlinedAt: !1055)
!1102 = !DILocation(line: 312, column: 19, scope: !1051, inlinedAt: !1055)
!1103 = !DILocation(line: 321, column: 23, scope: !1104, inlinedAt: !1055)
!1104 = distinct !DILexicalBlock(scope: !1105, file: !3, line: 321, column: 23)
!1105 = distinct !DILexicalBlock(scope: !1097, file: !3, line: 314, column: 17)
!1106 = !DILocation(line: 321, column: 43, scope: !1104, inlinedAt: !1055)
!1107 = !DILocation(line: 327, column: 40, scope: !1108, inlinedAt: !1055)
!1108 = distinct !DILexicalBlock(scope: !1104, file: !3, line: 326, column: 21)
!1109 = !DILocation(line: 328, column: 30, scope: !1108, inlinedAt: !1055)
!1110 = !DILocation(line: 327, column: 23, scope: !1108, inlinedAt: !1055)
!1111 = !DILocation(line: 330, column: 23, scope: !1108, inlinedAt: !1055)
!1112 = !DILocation(line: 333, column: 19, scope: !1113, inlinedAt: !1055)
!1113 = distinct !DILexicalBlock(scope: !1051, file: !3, line: 333, column: 19)
!1114 = !DILocation(line: 333, column: 29, scope: !1113, inlinedAt: !1055)
!1115 = !DILocation(line: 337, column: 19, scope: !1051, inlinedAt: !1055)
!1116 = !DILocalVariable(name: "outbuf", arg: 1, scope: !1117, file: !3, line: 197, type: !8)
!1117 = distinct !DISubprogram(name: "write_pending", scope: !3, file: !3, line: 197, type: !1118, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !1120)
!1118 = !DISubroutineType(types: !1119)
!1119 = !{null, !8, !7}
!1120 = !{!1116, !1121, !1122}
!1121 = !DILocalVariable(name: "bpout", arg: 2, scope: !1117, file: !3, line: 197, type: !7)
!1122 = !DILocalVariable(name: "n_write", scope: !1117, file: !3, line: 199, type: !42)
!1123 = !DILocation(line: 0, scope: !1117, inlinedAt: !1124)
!1124 = distinct !DILocation(line: 338, column: 17, scope: !1125, inlinedAt: !1055)
!1125 = distinct !DILexicalBlock(scope: !1051, file: !3, line: 337, column: 19)
!1126 = !DILocation(line: 199, column: 27, scope: !1117, inlinedAt: !1124)
!1127 = !DILocation(line: 200, column: 9, scope: !1128, inlinedAt: !1124)
!1128 = distinct !DILexicalBlock(scope: !1117, file: !3, line: 200, column: 7)
!1129 = !DILocation(line: 200, column: 7, scope: !1117, inlinedAt: !1124)
!1130 = !DILocation(line: 202, column: 11, scope: !1131, inlinedAt: !1124)
!1131 = distinct !DILexicalBlock(scope: !1132, file: !3, line: 202, column: 11)
!1132 = distinct !DILexicalBlock(scope: !1128, file: !3, line: 201, column: 5)
!1133 = !DILocation(line: 202, column: 55, scope: !1131, inlinedAt: !1124)
!1134 = !DILocation(line: 202, column: 11, scope: !1132, inlinedAt: !1124)
!1135 = !DILocation(line: 203, column: 9, scope: !1131, inlinedAt: !1124)
!1136 = !DILocation(line: 342, column: 35, scope: !1051, inlinedAt: !1055)
!1137 = !DILocation(line: 342, column: 24, scope: !1051, inlinedAt: !1055)
!1138 = !DILocation(line: 343, column: 19, scope: !1051, inlinedAt: !1055)
!1139 = !DILocation(line: 345, column: 29, scope: !1140, inlinedAt: !1055)
!1140 = distinct !DILexicalBlock(scope: !1141, file: !3, line: 344, column: 17)
!1141 = distinct !DILexicalBlock(scope: !1051, file: !3, line: 343, column: 19)
!1142 = !DILocation(line: 345, column: 42, scope: !1140, inlinedAt: !1055)
!1143 = !DILocation(line: 345, column: 19, scope: !1140, inlinedAt: !1055)
!1144 = !DILocation(line: 0, scope: !1117, inlinedAt: !1145)
!1145 = distinct !DILocation(line: 346, column: 19, scope: !1140, inlinedAt: !1055)
!1146 = !DILocation(line: 199, column: 27, scope: !1117, inlinedAt: !1145)
!1147 = !DILocation(line: 200, column: 9, scope: !1128, inlinedAt: !1145)
!1148 = !DILocation(line: 200, column: 7, scope: !1117, inlinedAt: !1145)
!1149 = !DILocation(line: 202, column: 11, scope: !1131, inlinedAt: !1145)
!1150 = !DILocation(line: 202, column: 55, scope: !1131, inlinedAt: !1145)
!1151 = !DILocation(line: 202, column: 11, scope: !1132, inlinedAt: !1145)
!1152 = !DILocation(line: 203, column: 9, scope: !1131, inlinedAt: !1145)
!1153 = !DILocation(line: 0, scope: !1117, inlinedAt: !1154)
!1154 = distinct !DILocation(line: 352, column: 19, scope: !1155, inlinedAt: !1055)
!1155 = distinct !DILexicalBlock(scope: !1156, file: !3, line: 351, column: 17)
!1156 = distinct !DILexicalBlock(scope: !1051, file: !3, line: 350, column: 19)
!1157 = !DILocation(line: 199, column: 27, scope: !1117, inlinedAt: !1154)
!1158 = !DILocation(line: 200, column: 9, scope: !1128, inlinedAt: !1154)
!1159 = !DILocation(line: 200, column: 7, scope: !1117, inlinedAt: !1154)
!1160 = !DILocation(line: 202, column: 11, scope: !1131, inlinedAt: !1154)
!1161 = !DILocation(line: 202, column: 55, scope: !1131, inlinedAt: !1154)
!1162 = !DILocation(line: 202, column: 11, scope: !1132, inlinedAt: !1154)
!1163 = !DILocation(line: 203, column: 9, scope: !1131, inlinedAt: !1154)
!1164 = !DILocation(line: 361, column: 26, scope: !1051, inlinedAt: !1055)
!1165 = !DILocation(line: 362, column: 20, scope: !1051, inlinedAt: !1055)
!1166 = !{!710, !710, i64 0}
!1167 = !DILocation(line: 363, column: 13, scope: !1052, inlinedAt: !1055)
!1168 = !DILocation(line: 371, column: 19, scope: !1169, inlinedAt: !1055)
!1169 = distinct !DILexicalBlock(scope: !1170, file: !3, line: 371, column: 19)
!1170 = distinct !DILexicalBlock(scope: !1052, file: !3, line: 365, column: 13)
!1171 = !DILocation(line: 371, column: 30, scope: !1169, inlinedAt: !1055)
!1172 = !DILocation(line: 371, column: 19, scope: !1170, inlinedAt: !1055)
!1173 = !DILocation(line: 373, column: 32, scope: !1174, inlinedAt: !1055)
!1174 = distinct !DILexicalBlock(scope: !1175, file: !3, line: 373, column: 23)
!1175 = distinct !DILexicalBlock(scope: !1169, file: !3, line: 372, column: 17)
!1176 = !DILocation(line: 373, column: 23, scope: !1175, inlinedAt: !1055)
!1177 = !DILocation(line: 392, column: 30, scope: !1178, inlinedAt: !1055)
!1178 = distinct !DILexicalBlock(scope: !1175, file: !3, line: 392, column: 23)
!1179 = !DILocation(line: 133, column: 3, scope: !1180, inlinedAt: !1183)
!1180 = distinct !DISubprogram(name: "next_line_num", scope: !3, file: !3, line: 130, type: !718, scopeLine: 131, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !1181)
!1181 = !{!1182}
!1182 = !DILocalVariable(name: "endp", scope: !1180, file: !3, line: 132, type: !8)
!1183 = distinct !DILocation(line: 394, column: 23, scope: !1184, inlinedAt: !1055)
