source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [FILE]...\0A\00", align 1
@.str.2 = private unnamed_addr constant [41 x i8] c"Concatenate FILE(s) to standard output.\0A\00", align 1
@stdout = external local_unnamed_addr global %struct._IO_FILE*, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 548, type: !277, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 503, type: !4, scopeLine: 504, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !212)
!3 = !DIFile(filename: "src/cat.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !6, !7}
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!10 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !11, retainedTypes: !40, globals: !197, nameTableKind: None)
!11 = !{!12, !27, !36}
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !13, line: 32, baseType: !14, size: 32, elements: !15)
!13 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!14 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!15 = !{!16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26}
!16 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!17 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!20 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!21 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!22 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!23 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!24 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!25 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!26 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !28, line: 45, baseType: !14, size: 32, elements: !29)
!28 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!29 = !{!30, !31, !32, !33, !34, !35}
!30 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0, isUnsigned: true)
!31 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2, isUnsigned: true)
!32 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5, isUnsigned: true)
!33 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4, isUnsigned: true)
!34 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3, isUnsigned: true)
!35 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1, isUnsigned: true)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !37, line: 73, baseType: !14, size: 32, elements: !38)
!37 = !DIFile(filename: "src/ioblksize.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!38 = !{!39}
!39 = !DIEnumerator(name: "IO_BUFSIZE", value: 131072, isUnsigned: true)
!40 = !{!41, !48, !109, !113, !117, !121, !124, !127, !134, !8, !99, !149, !153, !157, !161, !164, !167, !170, !174, !177, !101, !180, !184, !190, !194}
!41 = !DISubprogram(name: "dcgettext", scope: !42, file: !42, line: 51, type: !43, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !47)
!42 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!43 = !DISubroutineType(types: !44)
!44 = !{!8, !45, !45, !6}
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!47 = !{}
!48 = !DISubprogram(name: "fputs_unlocked", scope: !49, file: !49, line: 662, type: !50, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !47)
!49 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!50 = !DISubroutineType(types: !51)
!51 = !{!6, !45, !52}
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !54, line: 49, size: 1728, elements: !55)
!54 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!55 = !{!56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !71, !72, !73, !74, !78, !80, !82, !86, !89, !91, !94, !97, !98, !100, !104, !105}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !53, file: !54, line: 51, baseType: !6, size: 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !53, file: !54, line: 54, baseType: !8, size: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !53, file: !54, line: 55, baseType: !8, size: 64, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !53, file: !54, line: 56, baseType: !8, size: 64, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !53, file: !54, line: 57, baseType: !8, size: 64, offset: 256)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !53, file: !54, line: 58, baseType: !8, size: 64, offset: 320)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !53, file: !54, line: 59, baseType: !8, size: 64, offset: 384)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !53, file: !54, line: 60, baseType: !8, size: 64, offset: 448)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !53, file: !54, line: 61, baseType: !8, size: 64, offset: 512)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !53, file: !54, line: 64, baseType: !8, size: 64, offset: 576)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !53, file: !54, line: 65, baseType: !8, size: 64, offset: 640)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !53, file: !54, line: 66, baseType: !8, size: 64, offset: 704)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !53, file: !54, line: 68, baseType: !69, size: 64, offset: 768)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !54, line: 36, flags: DIFlagFwdDecl)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !53, file: !54, line: 70, baseType: !52, size: 64, offset: 832)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !53, file: !54, line: 72, baseType: !6, size: 32, offset: 896)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !53, file: !54, line: 73, baseType: !6, size: 32, offset: 928)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !53, file: !54, line: 74, baseType: !75, size: 64, offset: 960)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !76, line: 152, baseType: !77)
!76 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!77 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !53, file: !54, line: 77, baseType: !79, size: 16, offset: 1024)
!79 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !53, file: !54, line: 78, baseType: !81, size: 8, offset: 1040)
!81 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !53, file: !54, line: 79, baseType: !83, size: 8, offset: 1048)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8, elements: !84)
!84 = !{!85}
!85 = !DISubrange(count: 1)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !53, file: !54, line: 81, baseType: !87, size: 64, offset: 1088)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !54, line: 43, baseType: null)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !53, file: !54, line: 89, baseType: !90, size: 64, offset: 1152)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !76, line: 153, baseType: !77)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !53, file: !54, line: 91, baseType: !92, size: 64, offset: 1216)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !54, line: 37, flags: DIFlagFwdDecl)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !53, file: !54, line: 92, baseType: !95, size: 64, offset: 1280)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !54, line: 38, flags: DIFlagFwdDecl)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !53, file: !54, line: 93, baseType: !52, size: 64, offset: 1344)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !53, file: !54, line: 94, baseType: !99, size: 64, offset: 1408)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !53, file: !54, line: 95, baseType: !101, size: 64, offset: 1472)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !102, line: 46, baseType: !103)
!102 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!103 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !53, file: !54, line: 96, baseType: !6, size: 32, offset: 1536)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !53, file: !54, line: 98, baseType: !106, size: 160, offset: 1568)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 160, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 20)
!109 = !DISubprogram(name: "getpagesize", scope: !110, file: !110, line: 976, type: !111, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !47)
!110 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!111 = !DISubroutineType(types: !112)
!112 = !{!6}
!113 = !DISubprogram(name: "set_program_name", scope: !114, file: !114, line: 37, type: !115, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !47)
!114 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!115 = !DISubroutineType(types: !116)
!116 = !{null, !45}
!117 = !DISubprogram(name: "setlocale", scope: !118, file: !118, line: 122, type: !119, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !47)
!118 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!119 = !DISubroutineType(types: !120)
!120 = !{!8, !6, !45}
!121 = !DISubprogram(name: "bindtextdomain", scope: !42, file: !42, line: 86, type: !122, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !47)
!122 = !DISubroutineType(types: !123)
!123 = !{!8, !45, !45}
!124 = !DISubprogram(name: "textdomain", scope: !42, file: !42, line: 82, type: !125, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !47)
!125 = !DISubroutineType(types: !126)
!126 = !{!8, !45}
!127 = !DISubprogram(name: "atexit", scope: !128, file: !128, line: 595, type: !129, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !47)
!128 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!129 = !DISubroutineType(types: !130)
!130 = !{!6, !131}
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{null}
!134 = !DISubprogram(name: "getopt_long", scope: !135, file: !135, line: 66, type: !136, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !47)
!135 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!136 = !DISubroutineType(types: !137)
!137 = !{!6, !6, !138, !45, !140, !147}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !142)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !135, line: 50, size: 256, elements: !143)
!143 = !{!144, !145, !146, !148}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !142, file: !135, line: 52, baseType: !45, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !142, file: !135, line: 55, baseType: !6, size: 32, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !142, file: !135, line: 56, baseType: !147, size: 64, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !142, file: !135, line: 57, baseType: !6, size: 32, offset: 192)
!149 = !DISubprogram(name: "version_etc", scope: !150, file: !150, line: 69, type: !151, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !47)
!150 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!151 = !DISubroutineType(types: !152)
!152 = !{null, !52, !45, !45, !45, null}
!153 = !DISubprogram(name: "error", scope: !154, file: !154, line: 52, type: !155, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !47)
!154 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!155 = !DISubroutineType(types: !156)
!156 = !{null, !6, !6, !45, null}
!157 = !DISubprogram(name: "open", scope: !158, file: !158, line: 196, type: !159, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !47)
!158 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
!159 = !DISubroutineType(types: !160)
!160 = !{!6, !45, !6, null}
!161 = !DISubprogram(name: "quotearg_n_style_colon", scope: !13, file: !13, line: 397, type: !162, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !47)
!162 = !DISubroutineType(types: !163)
!163 = !{!8, !6, !12, !45}
!164 = !DISubprogram(name: "fdadvise", scope: !28, file: !28, line: 71, type: !165, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !47)
!165 = !DISubroutineType(types: !166)
!166 = !{null, !6, !77, !77, !27}
!167 = !DISubprogram(name: "lseek", scope: !110, file: !110, line: 334, type: !168, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !47)
!168 = !DISubroutineType(types: !169)
!169 = !{!77, !6, !77, !6}
!170 = !DISubprogram(name: "xmalloc", scope: !171, file: !171, line: 53, type: !172, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !47)
!171 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!172 = !DISubroutineType(types: !173)
!173 = !{!99, !103}
!174 = !DISubprogram(name: "free", scope: !128, file: !128, line: 565, type: !175, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !47)
!175 = !DISubroutineType(types: !176)
!176 = !{null, !99}
!177 = !DISubprogram(name: "close", scope: !110, file: !110, line: 353, type: !178, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !47)
!178 = !DISubroutineType(types: !179)
!179 = !{!6, !6}
!180 = !DISubprogram(name: "safe_read", scope: !181, file: !181, line: 42, type: !182, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !47)
!181 = !DIFile(filename: "./lib/safe-read.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!182 = !DISubroutineType(types: !183)
!183 = !{!103, !6, !99, !103}
!184 = !DISubprogram(name: "full_write", scope: !185, file: !185, line: 29, type: !186, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !47)
!185 = !DIFile(filename: "./lib/full-write.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!186 = !DISubroutineType(types: !187)
!187 = !{!103, !6, !188, !103}
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!190 = !DISubprogram(name: "ioctl", scope: !191, file: !191, line: 41, type: !192, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !47)
!191 = !DIFile(filename: "/usr/include/sys/ioctl.h", directory: "")
!192 = !DISubroutineType(types: !193)
!193 = !{!6, !6, !103, null}
!194 = !DISubprogram(name: "quotearg_style", scope: !13, file: !13, line: 377, type: !195, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !47)
!195 = !DISubroutineType(types: !196)
!196 = !{!8, !12, !45}
!197 = !{!0, !198, !200, !202, !204, !206, !208, !210}
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(name: "infile", scope: !10, file: !3, line: 52, type: !45, isLocal: true, isDefinition: true)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(name: "input_desc", scope: !10, file: !3, line: 55, type: !6, isLocal: true, isDefinition: true)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(name: "newlines2", scope: !10, file: !3, line: 79, type: !6, isLocal: true, isDefinition: true)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(name: "line_num_end", scope: !10, file: !3, line: 76, type: !8, isLocal: true, isDefinition: true)
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(name: "line_num_start", scope: !10, file: !3, line: 73, type: !8, isLocal: true, isDefinition: true)
!208 = !DIGlobalVariableExpression(var: !209, expr: !DIExpression())
!209 = distinct !DIGlobalVariable(name: "line_buf", scope: !10, file: !3, line: 61, type: !106, isLocal: true, isDefinition: true)
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(name: "line_num_print", scope: !10, file: !3, line: 70, type: !8, isLocal: true, isDefinition: true)
!212 = !{!213, !214, !215, !216, !217, !218, !219, !220, !222, !223, !224, !228, !231, !232, !233, !268, !269, !270, !271, !272, !273, !274, !275}
!213 = !DILocalVariable(name: "argc", arg: 1, scope: !2, file: !3, line: 503, type: !6)
!214 = !DILocalVariable(name: "argv", arg: 2, scope: !2, file: !3, line: 503, type: !7)
!215 = !DILocalVariable(name: "outsize", scope: !2, file: !3, line: 506, type: !101)
!216 = !DILocalVariable(name: "insize", scope: !2, file: !3, line: 509, type: !101)
!217 = !DILocalVariable(name: "page_size", scope: !2, file: !3, line: 511, type: !101)
!218 = !DILocalVariable(name: "inbuf", scope: !2, file: !3, line: 514, type: !8)
!219 = !DILocalVariable(name: "outbuf", scope: !2, file: !3, line: 517, type: !8)
!220 = !DILocalVariable(name: "ok", scope: !2, file: !3, line: 519, type: !221)
!221 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!222 = !DILocalVariable(name: "c", scope: !2, file: !3, line: 520, type: !6)
!223 = !DILocalVariable(name: "argind", scope: !2, file: !3, line: 523, type: !6)
!224 = !DILocalVariable(name: "out_dev", scope: !2, file: !3, line: 526, type: !225)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !226, line: 59, baseType: !227)
!226 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !76, line: 145, baseType: !103)
!228 = !DILocalVariable(name: "out_ino", scope: !2, file: !3, line: 529, type: !229)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !226, line: 47, baseType: !230)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !76, line: 148, baseType: !103)
!231 = !DILocalVariable(name: "out_isreg", scope: !2, file: !3, line: 532, type: !221)
!232 = !DILocalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 535, type: !221)
!233 = !DILocalVariable(name: "stat_buf", scope: !2, file: !3, line: 537, type: !234)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !235, line: 46, size: 1152, elements: !236)
!235 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "")
!236 = !{!237, !238, !239, !241, !243, !245, !247, !248, !249, !250, !252, !254, !262, !263, !264}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !234, file: !235, line: 48, baseType: !227, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !234, file: !235, line: 53, baseType: !230, size: 64, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !234, file: !235, line: 61, baseType: !240, size: 64, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !76, line: 151, baseType: !103)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !234, file: !235, line: 62, baseType: !242, size: 32, offset: 192)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !76, line: 150, baseType: !14)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !234, file: !235, line: 64, baseType: !244, size: 32, offset: 224)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !76, line: 146, baseType: !14)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !234, file: !235, line: 65, baseType: !246, size: 32, offset: 256)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !76, line: 147, baseType: !14)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !234, file: !235, line: 67, baseType: !6, size: 32, offset: 288)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !234, file: !235, line: 69, baseType: !227, size: 64, offset: 320)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !234, file: !235, line: 74, baseType: !75, size: 64, offset: 384)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !234, file: !235, line: 78, baseType: !251, size: 64, offset: 448)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !76, line: 174, baseType: !77)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !234, file: !235, line: 80, baseType: !253, size: 64, offset: 512)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !76, line: 179, baseType: !77)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !234, file: !235, line: 91, baseType: !255, size: 128, offset: 576)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !256, line: 10, size: 128, elements: !257)
!256 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!257 = !{!258, !260}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !255, file: !256, line: 12, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !76, line: 160, baseType: !77)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !255, file: !256, line: 16, baseType: !261, size: 64, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !76, line: 196, baseType: !77)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !234, file: !235, line: 92, baseType: !255, size: 128, offset: 704)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !234, file: !235, line: 93, baseType: !255, size: 128, offset: 832)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !234, file: !235, line: 106, baseType: !265, size: 192, offset: 960)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 192, elements: !266)
!266 = !{!267}
!267 = !DISubrange(count: 3)
!268 = !DILocalVariable(name: "number", scope: !2, file: !3, line: 540, type: !221)
!269 = !DILocalVariable(name: "number_nonblank", scope: !2, file: !3, line: 541, type: !221)
!270 = !DILocalVariable(name: "squeeze_blank", scope: !2, file: !3, line: 542, type: !221)
!271 = !DILocalVariable(name: "show_ends", scope: !2, file: !3, line: 543, type: !221)
!272 = !DILocalVariable(name: "show_nonprinting", scope: !2, file: !3, line: 544, type: !221)
!273 = !DILocalVariable(name: "show_tabs", scope: !2, file: !3, line: 545, type: !221)
!274 = !DILocalVariable(name: "file_open_mode", scope: !2, file: !3, line: 546, type: !6)
!275 = !DILabel(scope: !276, name: "contin", file: !3, line: 754)
!276 = distinct !DILexicalBlock(scope: !2, file: !3, line: 659, column: 5)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 2560, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 10)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "Version", scope: !282, file: !283, line: 2, type: !45, isDefinition: true)
!282 = distinct !DICompileUnit(language: DW_LANG_C99, file: !283, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !47, globals: !284, nameTableKind: None)
!283 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!284 = !{!280}
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(name: "file_name", scope: !287, file: !288, line: 46, type: !45, isLocal: true, isDefinition: true)
!287 = distinct !DICompileUnit(language: DW_LANG_C99, file: !288, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !47, retainedTypes: !289, globals: !327, nameTableKind: None)
!288 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!289 = !{!290, !41, !326, !153}
!290 = !DISubprogram(name: "close_stream", scope: !291, file: !291, line: 2, type: !292, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !47)
!291 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!292 = !DISubroutineType(types: !293)
!293 = !{!6, !294}
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !54, line: 49, size: 1728, elements: !296)
!296 = !{!297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !295, file: !54, line: 51, baseType: !6, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !295, file: !54, line: 54, baseType: !8, size: 64, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !295, file: !54, line: 55, baseType: !8, size: 64, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !295, file: !54, line: 56, baseType: !8, size: 64, offset: 192)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !295, file: !54, line: 57, baseType: !8, size: 64, offset: 256)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !295, file: !54, line: 58, baseType: !8, size: 64, offset: 320)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !295, file: !54, line: 59, baseType: !8, size: 64, offset: 384)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !295, file: !54, line: 60, baseType: !8, size: 64, offset: 448)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !295, file: !54, line: 61, baseType: !8, size: 64, offset: 512)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !295, file: !54, line: 64, baseType: !8, size: 64, offset: 576)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !295, file: !54, line: 65, baseType: !8, size: 64, offset: 640)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !295, file: !54, line: 66, baseType: !8, size: 64, offset: 704)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !295, file: !54, line: 68, baseType: !69, size: 64, offset: 768)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !295, file: !54, line: 70, baseType: !294, size: 64, offset: 832)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !295, file: !54, line: 72, baseType: !6, size: 32, offset: 896)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !295, file: !54, line: 73, baseType: !6, size: 32, offset: 928)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !295, file: !54, line: 74, baseType: !75, size: 64, offset: 960)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !295, file: !54, line: 77, baseType: !79, size: 16, offset: 1024)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !295, file: !54, line: 78, baseType: !81, size: 8, offset: 1040)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !295, file: !54, line: 79, baseType: !83, size: 8, offset: 1048)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !295, file: !54, line: 81, baseType: !87, size: 64, offset: 1088)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !295, file: !54, line: 89, baseType: !90, size: 64, offset: 1152)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !295, file: !54, line: 91, baseType: !92, size: 64, offset: 1216)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !295, file: !54, line: 92, baseType: !95, size: 64, offset: 1280)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !295, file: !54, line: 93, baseType: !294, size: 64, offset: 1344)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !295, file: !54, line: 94, baseType: !99, size: 64, offset: 1408)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !295, file: !54, line: 95, baseType: !101, size: 64, offset: 1472)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !295, file: !54, line: 96, baseType: !6, size: 32, offset: 1536)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !295, file: !54, line: 98, baseType: !106, size: 160, offset: 1568)
!326 = !DISubprogram(name: "quotearg_colon", scope: !13, file: !13, line: 391, type: !125, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !47)
!327 = !{!285, !328}
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !287, file: !288, line: 56, type: !221, isLocal: true, isDefinition: true)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(name: "exit_failure", scope: !332, file: !333, line: 24, type: !335, isDefinition: true)
!332 = distinct !DICompileUnit(language: DW_LANG_C99, file: !333, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !47, globals: !334, nameTableKind: None)
!333 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!334 = !{!330}
!335 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !6)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(name: "program_name", scope: !338, file: !339, line: 33, type: !45, isDefinition: true)
!338 = distinct !DICompileUnit(language: DW_LANG_C99, file: !339, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !47, retainedTypes: !340, globals: !376, nameTableKind: None)
!339 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!340 = !{!99, !341, !8}
!341 = !DISubprogram(name: "fputs", scope: !49, file: !49, line: 626, type: !342, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !47)
!342 = !DISubroutineType(types: !343)
!343 = !{!6, !45, !344}
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !54, line: 49, size: 1728, elements: !346)
!346 = !{!347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !345, file: !54, line: 51, baseType: !6, size: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !345, file: !54, line: 54, baseType: !8, size: 64, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !345, file: !54, line: 55, baseType: !8, size: 64, offset: 128)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !345, file: !54, line: 56, baseType: !8, size: 64, offset: 192)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !345, file: !54, line: 57, baseType: !8, size: 64, offset: 256)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !345, file: !54, line: 58, baseType: !8, size: 64, offset: 320)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !345, file: !54, line: 59, baseType: !8, size: 64, offset: 384)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !345, file: !54, line: 60, baseType: !8, size: 64, offset: 448)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !345, file: !54, line: 61, baseType: !8, size: 64, offset: 512)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !345, file: !54, line: 64, baseType: !8, size: 64, offset: 576)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !345, file: !54, line: 65, baseType: !8, size: 64, offset: 640)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !345, file: !54, line: 66, baseType: !8, size: 64, offset: 704)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !345, file: !54, line: 68, baseType: !69, size: 64, offset: 768)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !345, file: !54, line: 70, baseType: !344, size: 64, offset: 832)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !345, file: !54, line: 72, baseType: !6, size: 32, offset: 896)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !345, file: !54, line: 73, baseType: !6, size: 32, offset: 928)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !345, file: !54, line: 74, baseType: !75, size: 64, offset: 960)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !345, file: !54, line: 77, baseType: !79, size: 16, offset: 1024)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !345, file: !54, line: 78, baseType: !81, size: 8, offset: 1040)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !345, file: !54, line: 79, baseType: !83, size: 8, offset: 1048)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !345, file: !54, line: 81, baseType: !87, size: 64, offset: 1088)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !345, file: !54, line: 89, baseType: !90, size: 64, offset: 1152)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !345, file: !54, line: 91, baseType: !92, size: 64, offset: 1216)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !345, file: !54, line: 92, baseType: !95, size: 64, offset: 1280)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !345, file: !54, line: 93, baseType: !344, size: 64, offset: 1344)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !345, file: !54, line: 94, baseType: !99, size: 64, offset: 1408)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !345, file: !54, line: 95, baseType: !101, size: 64, offset: 1472)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !345, file: !54, line: 96, baseType: !6, size: 32, offset: 1536)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !345, file: !54, line: 98, baseType: !106, size: 160, offset: 1568)
!376 = !{!336}
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !379, file: !380, line: 85, type: !489, isDefinition: true)
!379 = distinct !DICompileUnit(language: DW_LANG_C99, file: !380, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !381, retainedTypes: !402, globals: !464, nameTableKind: None)
!380 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!381 = !{!12, !382, !387}
!382 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !13, line: 242, baseType: !14, size: 32, elements: !383)
!383 = !{!384, !385, !386}
!384 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!385 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!386 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!387 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !388, line: 46, baseType: !14, size: 32, elements: !389)
!388 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!389 = !{!390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401}
!390 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!391 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!392 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!393 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!394 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!395 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!396 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!397 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!398 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!399 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!400 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!401 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!402 = !{!403, !406, !174, !422, !6, !79, !425, !101, !442, !446, !41, !452, !456, !8, !170, !460, !461}
!403 = !DISubprogram(name: "xmemdup", scope: !171, file: !171, line: 62, type: !404, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !47)
!404 = !DISubroutineType(types: !405)
!405 = !{!99, !188, !103}
!406 = !DISubprogram(name: "quotearg_alloc_mem", scope: !13, file: !13, line: 342, type: !407, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !47)
!407 = !DISubroutineType(types: !408)
!408 = !{!8, !45, !103, !409, !410}
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !412)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !380, line: 65, size: 448, elements: !413)
!413 = !{!414, !415, !416, !420, !421}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !412, file: !380, line: 68, baseType: !12, size: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !412, file: !380, line: 71, baseType: !6, size: 32, offset: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !412, file: !380, line: 75, baseType: !417, size: 256, offset: 64)
!417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 256, elements: !418)
!418 = !{!419}
!419 = !DISubrange(count: 8)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !412, file: !380, line: 78, baseType: !45, size: 64, offset: 320)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !412, file: !380, line: 81, baseType: !45, size: 64, offset: 384)
!422 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !13, file: !13, line: 408, type: !423, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !47)
!423 = !DISubroutineType(types: !424)
!424 = !{!8, !6, !45, !45, !45, !103}
!425 = !DISubprogram(name: "rpl_mbrtowc", scope: !426, file: !426, line: 717, type: !427, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !47)
!426 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!427 = !DISubroutineType(types: !428)
!428 = !{!103, !147, !45, !103, !429}
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !431, line: 13, size: 64, elements: !432)
!431 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!432 = !{!433, !434}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !430, file: !431, line: 15, baseType: !6, size: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !430, file: !431, line: 20, baseType: !435, size: 32, offset: 32)
!435 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !430, file: !431, line: 16, size: 32, elements: !436)
!436 = !{!437, !438}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !435, file: !431, line: 18, baseType: !14, size: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !435, file: !431, line: 19, baseType: !439, size: 32)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 32, elements: !440)
!440 = !{!441}
!441 = !DISubrange(count: 4)
!442 = !DISubprogram(name: "iswprint", scope: !443, file: !443, line: 120, type: !444, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !47)
!443 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!444 = !DISubroutineType(types: !445)
!445 = !{!6, !14}
!446 = !DISubprogram(name: "mbsinit", scope: !447, file: !447, line: 292, type: !448, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !47)
!447 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!448 = !DISubroutineType(types: !449)
!449 = !{!6, !450}
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !430)
!452 = !DISubprogram(name: "locale_charset", scope: !453, file: !453, line: 35, type: !454, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !47)
!453 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!454 = !DISubroutineType(types: !455)
!455 = !{!45}
!456 = !DISubprogram(name: "c_strcasecmp", scope: !457, file: !457, line: 42, type: !458, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !47)
!457 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!458 = !DISubroutineType(types: !459)
!459 = !{!6, !45, !45}
!460 = !DISubprogram(name: "xalloc_die", scope: !171, file: !171, line: 51, type: !132, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !47)
!461 = !DISubprogram(name: "xrealloc", scope: !171, file: !171, line: 59, type: !462, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !47)
!462 = !DISubroutineType(types: !463)
!463 = !{!99, !99, !103}
!464 = !{!377, !465, !469, !471, !473, !478, !485, !487}
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !379, file: !380, line: 101, type: !467, isDefinition: true)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !468, size: 320, elements: !278)
!468 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !379, file: !380, line: 1052, type: !412, isDefinition: true)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !379, file: !380, line: 116, type: !412, isLocal: true, isDefinition: true)
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(name: "slot0", scope: !379, file: !380, line: 842, type: !475, isLocal: true, isDefinition: true)
!475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2048, elements: !476)
!476 = !{!477}
!477 = !DISubrange(count: 256)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(name: "slotvec", scope: !379, file: !380, line: 845, type: !480, isLocal: true, isDefinition: true)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !380, line: 834, size: 128, elements: !482)
!482 = !{!483, !484}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !481, file: !380, line: 836, baseType: !101, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !481, file: !380, line: 837, baseType: !8, size: 64, offset: 64)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(name: "nslots", scope: !379, file: !380, line: 843, type: !6, isLocal: true, isDefinition: true)
!487 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression())
!488 = distinct !DIGlobalVariable(name: "slotvec0", scope: !379, file: !380, line: 844, type: !481, isLocal: true, isDefinition: true)
!489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !490, size: 704, elements: !491)
!490 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!491 = !{!492}
!492 = !DISubrange(count: 11)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !495, file: !496, line: 26, type: !498, isDefinition: true)
!495 = distinct !DICompileUnit(language: DW_LANG_C99, file: !496, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !47, globals: !497, nameTableKind: None)
!496 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!497 = !{!493}
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 376, elements: !499)
!499 = !{!500}
!500 = !DISubrange(count: 47)
!501 = distinct !DICompileUnit(language: DW_LANG_C99, file: !502, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !503, retainedTypes: !504, nameTableKind: None)
!502 = !DIFile(filename: "lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!503 = !{!27}
!504 = !{!505, !508}
!505 = !DISubprogram(name: "posix_fadvise", scope: !158, file: !158, line: 288, type: !506, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !47)
!506 = !DISubroutineType(types: !507)
!507 = !{!6, !6, !77, !77, !6}
!508 = !DISubprogram(name: "fileno", scope: !49, file: !49, line: 786, type: !509, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !47)
!509 = !DISubroutineType(types: !510)
!510 = !{!6, !511}
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !54, line: 49, size: 1728, elements: !513)
!513 = !{!514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !512, file: !54, line: 51, baseType: !6, size: 32)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !512, file: !54, line: 54, baseType: !8, size: 64, offset: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !512, file: !54, line: 55, baseType: !8, size: 64, offset: 128)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !512, file: !54, line: 56, baseType: !8, size: 64, offset: 192)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !512, file: !54, line: 57, baseType: !8, size: 64, offset: 256)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !512, file: !54, line: 58, baseType: !8, size: 64, offset: 320)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !512, file: !54, line: 59, baseType: !8, size: 64, offset: 384)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !512, file: !54, line: 60, baseType: !8, size: 64, offset: 448)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !512, file: !54, line: 61, baseType: !8, size: 64, offset: 512)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !512, file: !54, line: 64, baseType: !8, size: 64, offset: 576)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !512, file: !54, line: 65, baseType: !8, size: 64, offset: 640)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !512, file: !54, line: 66, baseType: !8, size: 64, offset: 704)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !512, file: !54, line: 68, baseType: !69, size: 64, offset: 768)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !512, file: !54, line: 70, baseType: !511, size: 64, offset: 832)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !512, file: !54, line: 72, baseType: !6, size: 32, offset: 896)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !512, file: !54, line: 73, baseType: !6, size: 32, offset: 928)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !512, file: !54, line: 74, baseType: !75, size: 64, offset: 960)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !512, file: !54, line: 77, baseType: !79, size: 16, offset: 1024)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !512, file: !54, line: 78, baseType: !81, size: 8, offset: 1040)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !512, file: !54, line: 79, baseType: !83, size: 8, offset: 1048)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !512, file: !54, line: 81, baseType: !87, size: 64, offset: 1088)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !512, file: !54, line: 89, baseType: !90, size: 64, offset: 1152)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !512, file: !54, line: 91, baseType: !92, size: 64, offset: 1216)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !512, file: !54, line: 92, baseType: !95, size: 64, offset: 1280)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !512, file: !54, line: 93, baseType: !511, size: 64, offset: 1344)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !512, file: !54, line: 94, baseType: !99, size: 64, offset: 1408)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !512, file: !54, line: 95, baseType: !101, size: 64, offset: 1472)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !512, file: !54, line: 96, baseType: !6, size: 32, offset: 1536)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !512, file: !54, line: 98, baseType: !106, size: 160, offset: 1568)
!543 = distinct !DICompileUnit(language: DW_LANG_C99, file: !544, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !47, retainedTypes: !545, nameTableKind: None)
!544 = !DIFile(filename: "lib/full-write.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!545 = !{!45, !546, !101}
!546 = !DISubprogram(name: "safe_write", scope: !547, file: !547, line: 37, type: !186, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !47)
!547 = !DIFile(filename: "./lib/safe-write.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!548 = distinct !DICompileUnit(language: DW_LANG_C99, file: !549, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !550, nameTableKind: None)
!549 = !DIFile(filename: "lib/safe-read.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!550 = !{!551}
!551 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !552, line: 40, baseType: !14, size: 32, elements: !553)
!552 = !DIFile(filename: "./lib/sys-limits.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!553 = !{!554}
!554 = !DIEnumerator(name: "SYS_BUFSIZE_MAX", value: 2146435072, isUnsigned: true)
!555 = distinct !DICompileUnit(language: DW_LANG_C99, file: !556, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !550, retainedTypes: !557, nameTableKind: None)
!556 = !DIFile(filename: "lib/safe-write.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!557 = !{!558}
!558 = !DISubprogram(name: "write", scope: !110, file: !110, line: 366, type: !559, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !47)
!559 = !DISubroutineType(types: !560)
!560 = !{!77, !6, !188, !103}
!561 = distinct !DICompileUnit(language: DW_LANG_C99, file: !562, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !563, retainedTypes: !567, nameTableKind: None)
!562 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!563 = !{!564}
!564 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !562, line: 40, baseType: !14, size: 32, elements: !565)
!565 = !{!566}
!566 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!567 = !{!41, !568, !99}
!568 = !DISubprogram(name: "fputs_unlocked", scope: !49, file: !49, line: 662, type: !569, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !47)
!569 = !DISubroutineType(types: !570)
!570 = !{!6, !45, !571}
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !54, line: 49, size: 1728, elements: !573)
!573 = !{!574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !572, file: !54, line: 51, baseType: !6, size: 32)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !572, file: !54, line: 54, baseType: !8, size: 64, offset: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !572, file: !54, line: 55, baseType: !8, size: 64, offset: 128)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !572, file: !54, line: 56, baseType: !8, size: 64, offset: 192)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !572, file: !54, line: 57, baseType: !8, size: 64, offset: 256)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !572, file: !54, line: 58, baseType: !8, size: 64, offset: 320)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !572, file: !54, line: 59, baseType: !8, size: 64, offset: 384)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !572, file: !54, line: 60, baseType: !8, size: 64, offset: 448)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !572, file: !54, line: 61, baseType: !8, size: 64, offset: 512)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !572, file: !54, line: 64, baseType: !8, size: 64, offset: 576)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !572, file: !54, line: 65, baseType: !8, size: 64, offset: 640)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !572, file: !54, line: 66, baseType: !8, size: 64, offset: 704)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !572, file: !54, line: 68, baseType: !69, size: 64, offset: 768)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !572, file: !54, line: 70, baseType: !571, size: 64, offset: 832)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !572, file: !54, line: 72, baseType: !6, size: 32, offset: 896)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !572, file: !54, line: 73, baseType: !6, size: 32, offset: 928)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !572, file: !54, line: 74, baseType: !75, size: 64, offset: 960)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !572, file: !54, line: 77, baseType: !79, size: 16, offset: 1024)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !572, file: !54, line: 78, baseType: !81, size: 8, offset: 1040)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !572, file: !54, line: 79, baseType: !83, size: 8, offset: 1048)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !572, file: !54, line: 81, baseType: !87, size: 64, offset: 1088)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !572, file: !54, line: 89, baseType: !90, size: 64, offset: 1152)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !572, file: !54, line: 91, baseType: !92, size: 64, offset: 1216)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !572, file: !54, line: 92, baseType: !95, size: 64, offset: 1280)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !572, file: !54, line: 93, baseType: !571, size: 64, offset: 1344)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !572, file: !54, line: 94, baseType: !99, size: 64, offset: 1408)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !572, file: !54, line: 95, baseType: !101, size: 64, offset: 1472)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !572, file: !54, line: 96, baseType: !6, size: 32, offset: 1536)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !572, file: !54, line: 98, baseType: !106, size: 160, offset: 1568)
!603 = distinct !DICompileUnit(language: DW_LANG_C99, file: !604, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !605, retainedTypes: !618, nameTableKind: None)
!604 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!605 = !{!606}
!606 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !607, file: !171, line: 186, baseType: !14, size: 32, elements: !616)
!607 = distinct !DISubprogram(name: "x2nrealloc", scope: !171, file: !171, line: 174, type: !608, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !603, retainedNodes: !611)
!608 = !DISubroutineType(types: !609)
!609 = !{!99, !99, !610, !101}
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!611 = !{!612, !613, !614, !615}
!612 = !DILocalVariable(name: "p", arg: 1, scope: !607, file: !171, line: 174, type: !99)
!613 = !DILocalVariable(name: "pn", arg: 2, scope: !607, file: !171, line: 174, type: !610)
!614 = !DILocalVariable(name: "s", arg: 3, scope: !607, file: !171, line: 174, type: !101)
!615 = !DILocalVariable(name: "n", scope: !607, file: !171, line: 176, type: !101)
!616 = !{!617}
!617 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!618 = !{!101, !460, !170, !461, !8, !174, !99, !619, !622}
!619 = !DISubprogram(name: "xcalloc", scope: !171, file: !171, line: 57, type: !620, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !47)
!620 = !DISubroutineType(types: !621)
!621 = !{!99, !103, !103}
!622 = !DISubprogram(name: "rpl_calloc", scope: !623, file: !623, line: 688, type: !620, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !47)
!623 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!624 = distinct !DICompileUnit(language: DW_LANG_C99, file: !625, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !47, retainedTypes: !626, nameTableKind: None)
!625 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!626 = !{!41, !153}
!627 = distinct !DICompileUnit(language: DW_LANG_C99, file: !628, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !47, retainedTypes: !629, nameTableKind: None)
!628 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!629 = !{!99}
!630 = distinct !DICompileUnit(language: DW_LANG_C99, file: !631, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !47, retainedTypes: !632, nameTableKind: None)
!631 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!632 = !{!633, !101, !645}
!633 = !DISubprogram(name: "mbrtowc", scope: !447, file: !447, line: 296, type: !634, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !47)
!634 = !DISubroutineType(types: !635)
!635 = !{!103, !147, !45, !103, !636}
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !431, line: 13, size: 64, elements: !638)
!638 = !{!639, !640}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !637, file: !431, line: 15, baseType: !6, size: 32)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !637, file: !431, line: 20, baseType: !641, size: 32, offset: 32)
!641 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !637, file: !431, line: 16, size: 32, elements: !642)
!642 = !{!643, !644}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !641, file: !431, line: 18, baseType: !14, size: 32)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !641, file: !431, line: 19, baseType: !439, size: 32)
!645 = !DISubprogram(name: "hard_locale", scope: !646, file: !646, line: 26, type: !647, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !47)
!646 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!647 = !DISubroutineType(types: !648)
!648 = !{!221, !6}
!649 = distinct !DICompileUnit(language: DW_LANG_C99, file: !650, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !47, retainedTypes: !651, nameTableKind: None)
!650 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!651 = !{!652}
!652 = !DISubprogram(name: "rpl_fclose", scope: !653, file: !653, line: 672, type: !654, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !47)
!653 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!654 = !DISubroutineType(types: !655)
!655 = !{!6, !656}
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !54, line: 49, size: 1728, elements: !658)
!658 = !{!659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !657, file: !54, line: 51, baseType: !6, size: 32)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !657, file: !54, line: 54, baseType: !8, size: 64, offset: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !657, file: !54, line: 55, baseType: !8, size: 64, offset: 128)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !657, file: !54, line: 56, baseType: !8, size: 64, offset: 192)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !657, file: !54, line: 57, baseType: !8, size: 64, offset: 256)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !657, file: !54, line: 58, baseType: !8, size: 64, offset: 320)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !657, file: !54, line: 59, baseType: !8, size: 64, offset: 384)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !657, file: !54, line: 60, baseType: !8, size: 64, offset: 448)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !657, file: !54, line: 61, baseType: !8, size: 64, offset: 512)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !657, file: !54, line: 64, baseType: !8, size: 64, offset: 576)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !657, file: !54, line: 65, baseType: !8, size: 64, offset: 640)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !657, file: !54, line: 66, baseType: !8, size: 64, offset: 704)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !657, file: !54, line: 68, baseType: !69, size: 64, offset: 768)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !657, file: !54, line: 70, baseType: !656, size: 64, offset: 832)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !657, file: !54, line: 72, baseType: !6, size: 32, offset: 896)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !657, file: !54, line: 73, baseType: !6, size: 32, offset: 928)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !657, file: !54, line: 74, baseType: !75, size: 64, offset: 960)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !657, file: !54, line: 77, baseType: !79, size: 16, offset: 1024)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !657, file: !54, line: 78, baseType: !81, size: 8, offset: 1040)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !657, file: !54, line: 79, baseType: !83, size: 8, offset: 1048)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !657, file: !54, line: 81, baseType: !87, size: 64, offset: 1088)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !657, file: !54, line: 89, baseType: !90, size: 64, offset: 1152)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !657, file: !54, line: 91, baseType: !92, size: 64, offset: 1216)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !657, file: !54, line: 92, baseType: !95, size: 64, offset: 1280)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !657, file: !54, line: 93, baseType: !656, size: 64, offset: 1344)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !657, file: !54, line: 94, baseType: !99, size: 64, offset: 1408)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !657, file: !54, line: 95, baseType: !101, size: 64, offset: 1472)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !657, file: !54, line: 96, baseType: !6, size: 32, offset: 1536)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !657, file: !54, line: 98, baseType: !106, size: 160, offset: 1568)
!688 = distinct !DICompileUnit(language: DW_LANG_C99, file: !689, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !47, retainedTypes: !690, nameTableKind: None)
!689 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!690 = !{!691}
!691 = !DISubprogram(name: "setlocale_null_r", scope: !692, file: !692, line: 64, type: !693, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !47)
!692 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!693 = !DISubroutineType(types: !694)
!694 = !{!6, !6, !8, !103}
!695 = distinct !DICompileUnit(language: DW_LANG_C99, file: !696, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !697, retainedTypes: !1084, nameTableKind: None)
!696 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!697 = !{!698}
!698 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !699, line: 41, baseType: !14, size: 32, elements: !700)
!699 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!700 = !{!701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083}
!701 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!702 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!703 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!704 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!705 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!706 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!707 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!708 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!709 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!710 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!711 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!712 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!713 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!714 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!715 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!716 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!717 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!718 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!719 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!720 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!721 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!722 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!723 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!724 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!725 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!726 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!727 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!728 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!729 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!730 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!731 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!732 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!733 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!734 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!735 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!736 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!737 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!738 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!739 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!740 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!741 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!742 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!743 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!744 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!745 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!746 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!747 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!748 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!749 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!750 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!751 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!752 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!753 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!754 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!755 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!756 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!757 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!758 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!759 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!760 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!761 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!762 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!763 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!764 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!765 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!766 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!767 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!768 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!769 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!770 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!771 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!772 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!773 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!774 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!779 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!780 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!781 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!782 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!783 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!784 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!785 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!786 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!787 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!788 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!789 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!790 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!791 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!793 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!794 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!795 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!796 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!797 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!798 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!799 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!800 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!801 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!802 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!803 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!804 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!805 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!806 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!807 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!808 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!809 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!810 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!812 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!813 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!814 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!815 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!816 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!817 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!818 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!819 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!820 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!821 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!822 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!823 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!824 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!825 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!826 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!827 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!828 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!829 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!830 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!831 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!832 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!833 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!834 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!835 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!836 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!837 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!838 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!839 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!840 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!841 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!842 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!843 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!844 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!845 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!846 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!847 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!884 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!885 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!886 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!887 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!894 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!895 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!896 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!898 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!899 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!900 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!901 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!902 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!903 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!904 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!905 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!906 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!907 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!908 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!909 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!910 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!911 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!912 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!913 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!914 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!915 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!916 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!917 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!918 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!919 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!920 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!921 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!922 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!923 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!924 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!925 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!926 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!927 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!928 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!929 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!930 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!931 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!932 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!933 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!934 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!935 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!936 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!937 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!938 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!939 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!940 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!941 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!942 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!943 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!944 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!945 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!946 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!947 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!948 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!949 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!950 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!951 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!952 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!953 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!954 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!955 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!956 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!957 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!958 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!959 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!960 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!961 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!962 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!963 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!964 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!965 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!966 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!967 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!968 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!969 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!970 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!971 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!972 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!973 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!974 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!975 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!976 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!977 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!978 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!979 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!980 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!981 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!982 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!983 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!984 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!985 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!986 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!987 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!988 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!989 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!990 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!991 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!992 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!993 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!994 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!995 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!996 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!997 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!998 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!999 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!1000 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!1001 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!1002 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!1003 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!1004 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!1005 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!1006 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!1007 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!1008 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!1009 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!1010 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!1011 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!1012 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!1013 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
