source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.Active_dir = type { i64, i64, %struct._ftsent* }
%struct.FTS = type { %struct._ftsent*, %struct._ftsent*, %struct._ftsent**, i64, i8*, i32, i32, i64, i64, i32 (%struct._ftsent**, %struct._ftsent**)*, i32, %struct.hash_table*, %union.anon, %struct.I_ring }
%struct.I_ring = type { [4 x i32], i32, i32, i32, i8 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__dirstream = type opaque
%struct.__fsid_t = type { [2 x i32] }
%struct.__mbstate_t = type { i32, %union.anon.8 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct._ftsent = type { %struct._ftsent*, %struct._ftsent*, %struct._ftsent*, %struct.__dirstream*, i64, i8*, i8*, i8*, i32, i32, i64, %struct.FTS*, i64, i64, i64, i16, i16, i16, [1 x %struct.stat], [0 x i8] }
%struct.cycle_check_state = type { %struct.dev_ino, i64, i32 }
%struct.dev_ino = type { i64, i64 }
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%struct.hash_entry = type { i8*, %struct.hash_entry* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 73, type: !345, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !20, globals: !308, nameTableKind: None)
!3 = !DIFile(filename: "src/chcon.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!9 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!20 = !{!21, !31, !92, !96, !100, !103, !106, !113, !25, !82, !128, !132, !136, !140, !143, !158, !277, !280, !283, !286, !289, !290, !295, !300, !301, !304, !305}
!21 = !DISubprogram(name: "dcgettext", scope: !22, file: !22, line: 51, type: !23, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!22 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!23 = !DISubroutineType(types: !24)
!24 = !{!25, !27, !27, !29}
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!29 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!30 = !{}
!31 = !DISubprogram(name: "fputs_unlocked", scope: !32, file: !32, line: 662, type: !33, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!32 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!33 = !DISubroutineType(types: !34)
!34 = !{!29, !27, !35}
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !37, line: 49, size: 1728, elements: !38)
!37 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!38 = !{!39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !54, !55, !56, !57, !61, !63, !65, !69, !72, !74, !77, !80, !81, !83, !87, !88}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !36, file: !37, line: 51, baseType: !29, size: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !36, file: !37, line: 54, baseType: !25, size: 64, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !36, file: !37, line: 55, baseType: !25, size: 64, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !36, file: !37, line: 56, baseType: !25, size: 64, offset: 192)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !36, file: !37, line: 57, baseType: !25, size: 64, offset: 256)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !36, file: !37, line: 58, baseType: !25, size: 64, offset: 320)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !36, file: !37, line: 59, baseType: !25, size: 64, offset: 384)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !36, file: !37, line: 60, baseType: !25, size: 64, offset: 448)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !36, file: !37, line: 61, baseType: !25, size: 64, offset: 512)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !36, file: !37, line: 64, baseType: !25, size: 64, offset: 576)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !36, file: !37, line: 65, baseType: !25, size: 64, offset: 640)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !36, file: !37, line: 66, baseType: !25, size: 64, offset: 704)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !36, file: !37, line: 68, baseType: !52, size: 64, offset: 768)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !37, line: 36, flags: DIFlagFwdDecl)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !36, file: !37, line: 70, baseType: !35, size: 64, offset: 832)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !36, file: !37, line: 72, baseType: !29, size: 32, offset: 896)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !36, file: !37, line: 73, baseType: !29, size: 32, offset: 928)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !36, file: !37, line: 74, baseType: !58, size: 64, offset: 960)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !59, line: 152, baseType: !60)
!59 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!60 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !36, file: !37, line: 77, baseType: !62, size: 16, offset: 1024)
!62 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !36, file: !37, line: 78, baseType: !64, size: 8, offset: 1040)
!64 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !36, file: !37, line: 79, baseType: !66, size: 8, offset: 1048)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 8, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 1)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !36, file: !37, line: 81, baseType: !70, size: 64, offset: 1088)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !37, line: 43, baseType: null)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !36, file: !37, line: 89, baseType: !73, size: 64, offset: 1152)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !59, line: 153, baseType: !60)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !36, file: !37, line: 91, baseType: !75, size: 64, offset: 1216)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !37, line: 37, flags: DIFlagFwdDecl)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !36, file: !37, line: 92, baseType: !78, size: 64, offset: 1280)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !37, line: 38, flags: DIFlagFwdDecl)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !36, file: !37, line: 93, baseType: !35, size: 64, offset: 1344)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !36, file: !37, line: 94, baseType: !82, size: 64, offset: 1408)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !36, file: !37, line: 95, baseType: !84, size: 64, offset: 1472)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !85, line: 46, baseType: !86)
!85 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!86 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !36, file: !37, line: 96, baseType: !29, size: 32, offset: 1536)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !36, file: !37, line: 98, baseType: !89, size: 160, offset: 1568)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 160, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: 20)
!92 = !DISubprogram(name: "set_program_name", scope: !93, file: !93, line: 37, type: !94, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!93 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!94 = !DISubroutineType(types: !95)
!95 = !{null, !27}
!96 = !DISubprogram(name: "setlocale", scope: !97, file: !97, line: 122, type: !98, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!97 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!98 = !DISubroutineType(types: !99)
!99 = !{!25, !29, !27}
!100 = !DISubprogram(name: "bindtextdomain", scope: !22, file: !22, line: 86, type: !101, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!101 = !DISubroutineType(types: !102)
!102 = !{!25, !27, !27}
!103 = !DISubprogram(name: "textdomain", scope: !22, file: !22, line: 82, type: !104, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!104 = !DISubroutineType(types: !105)
!105 = !{!25, !27}
!106 = !DISubprogram(name: "atexit", scope: !107, file: !107, line: 595, type: !108, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!107 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!108 = !DISubroutineType(types: !109)
!109 = !{!29, !110}
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{null}
!113 = !DISubprogram(name: "getopt_long", scope: !114, file: !114, line: 66, type: !115, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!114 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!115 = !DISubroutineType(types: !116)
!116 = !{!29, !29, !117, !27, !119, !126}
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !114, line: 50, size: 256, elements: !122)
!122 = !{!123, !124, !125, !127}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !121, file: !114, line: 52, baseType: !27, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !121, file: !114, line: 55, baseType: !29, size: 32, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !121, file: !114, line: 56, baseType: !126, size: 64, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !121, file: !114, line: 57, baseType: !29, size: 32, offset: 192)
!128 = !DISubprogram(name: "version_etc", scope: !129, file: !129, line: 69, type: !130, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!129 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!130 = !DISubroutineType(types: !131)
!131 = !{null, !35, !27, !27, !27, null}
!132 = !DISubprogram(name: "error", scope: !133, file: !133, line: 52, type: !134, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!133 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!134 = !DISubroutineType(types: !135)
!135 = !{null, !29, !29, !27, null}
!136 = !DISubprogram(name: "quote", scope: !137, file: !137, line: 44, type: !138, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!137 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!138 = !DISubroutineType(types: !139)
!139 = !{!27, !27}
!140 = !DISubprogram(name: "quotearg_style", scope: !6, file: !6, line: 377, type: !141, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!141 = !DISubroutineType(types: !142)
!142 = !{!25, !5, !27}
!143 = !DISubprogram(name: "get_root_dev_ino", scope: !144, file: !144, line: 25, type: !145, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!144 = !DIFile(filename: "./lib/root-dev-ino.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!145 = !DISubroutineType(types: !146)
!146 = !{!147, !147}
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !149, line: 7, size: 128, elements: !150)
!149 = !DIFile(filename: "./lib/dev-ino.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!150 = !{!151, !155}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !148, file: !149, line: 9, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !153, line: 47, baseType: !154)
!153 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !59, line: 148, baseType: !86)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !148, file: !149, line: 10, baseType: !156, size: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !153, line: 59, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !59, line: 145, baseType: !86)
!158 = !DISubprogram(name: "xfts_open", scope: !159, file: !159, line: 5, type: !160, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!159 = !DIFile(filename: "./lib/xfts.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!160 = !DISubroutineType(types: !161)
!161 = !{!162, !117, !29, !246}
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !164, line: 80, size: 1024, elements: !165)
!164 = !DIFile(filename: "./lib/fts_.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!165 = !{!166, !236, !237, !239, !240, !241, !242, !243, !244, !245, !252, !253, !256, !263}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !163, file: !164, line: 81, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !164, line: 199, size: 2112, elements: !169)
!169 = !{!170, !171, !172, !173, !178, !179, !180, !181, !182, !183, !184, !185, !188, !190, !191, !194, !195, !196, !197, !232}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !168, file: !164, line: 200, baseType: !167, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !168, file: !164, line: 201, baseType: !167, size: 64, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !168, file: !164, line: 202, baseType: !167, size: 64, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !168, file: !164, line: 203, baseType: !174, size: 64, offset: 192)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !176, line: 127, baseType: !177)
!176 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !176, line: 127, flags: DIFlagFwdDecl)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !168, file: !164, line: 206, baseType: !60, size: 64, offset: 256)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !168, file: !164, line: 207, baseType: !82, size: 64, offset: 320)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !168, file: !164, line: 208, baseType: !25, size: 64, offset: 384)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !168, file: !164, line: 209, baseType: !25, size: 64, offset: 448)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !168, file: !164, line: 210, baseType: !29, size: 32, offset: 512)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !168, file: !164, line: 211, baseType: !29, size: 32, offset: 544)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !168, file: !164, line: 212, baseType: !84, size: 64, offset: 576)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !168, file: !164, line: 214, baseType: !186, size: 64, offset: 640)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !164, line: 197, baseType: !163)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !168, file: !164, line: 218, baseType: !189, size: 64, offset: 704)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !85, line: 35, baseType: !60)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !168, file: !164, line: 220, baseType: !84, size: 64, offset: 768)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "fts_n_dirs_remaining", scope: !168, file: !164, line: 225, baseType: !192, size: 64, offset: 832)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !153, line: 74, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !59, line: 151, baseType: !86)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !168, file: !164, line: 241, baseType: !62, size: 16, offset: 896)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !168, file: !164, line: 245, baseType: !62, size: 16, offset: 912)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !168, file: !164, line: 251, baseType: !62, size: 16, offset: 928)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !168, file: !164, line: 253, baseType: !198, size: 1152, offset: 960)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 1152, elements: !67)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !200, line: 46, size: 1152, elements: !201)
!200 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "")
!201 = !{!202, !203, !204, !205, !207, !209, !211, !212, !213, !214, !216, !218, !226, !227, !228}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !199, file: !200, line: 48, baseType: !157, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !199, file: !200, line: 53, baseType: !154, size: 64, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !199, file: !200, line: 61, baseType: !193, size: 64, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !199, file: !200, line: 62, baseType: !206, size: 32, offset: 192)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !59, line: 150, baseType: !7)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !199, file: !200, line: 64, baseType: !208, size: 32, offset: 224)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !59, line: 146, baseType: !7)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !199, file: !200, line: 65, baseType: !210, size: 32, offset: 256)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !59, line: 147, baseType: !7)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !199, file: !200, line: 67, baseType: !29, size: 32, offset: 288)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !199, file: !200, line: 69, baseType: !157, size: 64, offset: 320)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !199, file: !200, line: 74, baseType: !58, size: 64, offset: 384)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !199, file: !200, line: 78, baseType: !215, size: 64, offset: 448)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !59, line: 174, baseType: !60)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !199, file: !200, line: 80, baseType: !217, size: 64, offset: 512)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !59, line: 179, baseType: !60)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !199, file: !200, line: 91, baseType: !219, size: 128, offset: 576)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !220, line: 10, size: 128, elements: !221)
!220 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!221 = !{!222, !224}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !219, file: !220, line: 12, baseType: !223, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !59, line: 160, baseType: !60)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !219, file: !220, line: 16, baseType: !225, size: 64, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !59, line: 196, baseType: !60)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !199, file: !200, line: 92, baseType: !219, size: 128, offset: 704)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !199, file: !200, line: 93, baseType: !219, size: 128, offset: 832)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !199, file: !200, line: 106, baseType: !229, size: 192, offset: 960)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !225, size: 192, elements: !230)
!230 = !{!231}
!231 = !DISubrange(count: 3)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "fts_name", scope: !168, file: !164, line: 254, baseType: !233, offset: 2112)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, elements: !234)
!234 = !{!235}
!235 = !DISubrange(count: -1)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "fts_child", scope: !163, file: !164, line: 82, baseType: !167, size: 64, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "fts_array", scope: !163, file: !164, line: 83, baseType: !238, size: 64, offset: 128)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !163, file: !164, line: 84, baseType: !156, size: 64, offset: 192)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !163, file: !164, line: 85, baseType: !25, size: 64, offset: 256)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "fts_rfd", scope: !163, file: !164, line: 86, baseType: !29, size: 32, offset: 320)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cwd_fd", scope: !163, file: !164, line: 87, baseType: !29, size: 32, offset: 352)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !163, file: !164, line: 89, baseType: !84, size: 64, offset: 384)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "fts_nitems", scope: !163, file: !164, line: 90, baseType: !84, size: 64, offset: 448)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "fts_compar", scope: !163, file: !164, line: 91, baseType: !246, size: 64, offset: 512)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{!29, !249, !249}
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !168)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "fts_options", scope: !163, file: !164, line: 160, baseType: !29, size: 32, offset: 576)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "fts_leaf_optimization_works_ht", scope: !163, file: !164, line: 169, baseType: !254, size: 64, offset: 640)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !164, line: 169, flags: DIFlagFwdDecl)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !163, file: !164, line: 191, baseType: !257, size: 64, offset: 704)
!257 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !163, file: !164, line: 171, size: 64, elements: !258)
!258 = !{!259, !260}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !257, file: !164, line: 184, baseType: !254, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !257, file: !164, line: 190, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "cycle_check_state", file: !164, line: 190, flags: DIFlagFwdDecl)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fd_ring", scope: !163, file: !164, line: 196, baseType: !264, size: 256, offset: 768)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "I_ring", file: !265, line: 39, baseType: !266)
!265 = !DIFile(filename: "./lib/i-ring.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "I_ring", file: !265, line: 31, size: 256, elements: !267)
!267 = !{!268, !272, !273, !274, !275}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "ir_data", scope: !266, file: !265, line: 33, baseType: !269, size: 128)
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 128, elements: !270)
!270 = !{!271}
!271 = !DISubrange(count: 4)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "ir_default_val", scope: !266, file: !265, line: 34, baseType: !29, size: 32, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "ir_front", scope: !266, file: !265, line: 35, baseType: !7, size: 32, offset: 160)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "ir_back", scope: !266, file: !265, line: 36, baseType: !7, size: 32, offset: 192)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "ir_empty", scope: !266, file: !265, line: 37, baseType: !276, size: 8, offset: 224)
!276 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!277 = !DISubprogram(name: "rpl_fts_read", scope: !164, file: !164, line: 280, type: !278, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!278 = !DISubroutineType(types: !279)
!279 = !{!167, !162}
!280 = !DISubprogram(name: "rpl_fts_close", scope: !164, file: !164, line: 276, type: !281, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!281 = !DISubroutineType(types: !282)
!282 = !{!29, !162}
!283 = !DISubprogram(name: "quotearg_n_style", scope: !6, file: !6, line: 368, type: !284, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!284 = !DISubroutineType(types: !285)
!285 = !{!25, !29, !5, !27}
!286 = !DISubprogram(name: "rpl_fts_set", scope: !164, file: !164, line: 281, type: !287, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!287 = !DISubroutineType(types: !288)
!288 = !{!29, !162, !167, !29}
!289 = !DISubprogram(name: "quotearg_n_style_colon", scope: !6, file: !6, line: 397, type: !284, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!290 = !DISubprogram(name: "cycle_warning_required", scope: !159, file: !159, line: 9, type: !291, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!291 = !DISubroutineType(types: !292)
!292 = !{!276, !293, !250}
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !163)
!295 = !DISubprogram(name: "getfileconat", scope: !296, file: !296, line: 34, type: !297, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!296 = !DIFile(filename: "./lib/selinux-at.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!297 = !DISubroutineType(types: !298)
!298 = !{!29, !29, !27, !299}
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!300 = !DISubprogram(name: "lgetfileconat", scope: !296, file: !296, line: 39, type: !297, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!301 = !DISubprogram(name: "setfileconat", scope: !296, file: !296, line: 45, type: !302, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!302 = !DISubroutineType(types: !303)
!303 = !{!29, !29, !27, !25}
!304 = !DISubprogram(name: "lsetfileconat", scope: !296, file: !296, line: 52, type: !302, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!305 = !DISubprogram(name: "quote_n", scope: !137, file: !137, line: 40, type: !306, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!306 = !DISubroutineType(types: !307)
!307 = !{!27, !29, !27}
!308 = !{!309, !327, !329, !331, !333, !335, !337, !339, !341, !343, !0}
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "dev_ino_buf", scope: !311, file: !3, line: 575, type: !148, isLocal: true, isDefinition: true)
!311 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 412, type: !312, scopeLine: 413, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !314)
!312 = !DISubroutineType(types: !313)
!313 = !{!29, !29, !299}
!314 = !{!315, !316, !317, !318, !319, !320, !321, !322, !323, !324}
!315 = !DILocalVariable(name: "argc", arg: 1, scope: !311, file: !3, line: 412, type: !29)
!316 = !DILocalVariable(name: "argv", arg: 2, scope: !311, file: !3, line: 412, type: !299)
!317 = !DILocalVariable(name: "bit_flags", scope: !311, file: !3, line: 415, type: !29)
!318 = !DILocalVariable(name: "dereference", scope: !311, file: !3, line: 419, type: !29)
!319 = !DILocalVariable(name: "ok", scope: !311, file: !3, line: 421, type: !276)
!320 = !DILocalVariable(name: "preserve_root", scope: !311, file: !3, line: 422, type: !276)
!321 = !DILocalVariable(name: "component_specified", scope: !311, file: !3, line: 423, type: !276)
!322 = !DILocalVariable(name: "reference_file", scope: !311, file: !3, line: 424, type: !25)
!323 = !DILocalVariable(name: "optc", scope: !311, file: !3, line: 425, type: !29)
!324 = !DILocalVariable(name: "ref_context", scope: !325, file: !3, line: 545, type: !25)
!325 = distinct !DILexicalBlock(scope: !326, file: !3, line: 544, column: 5)
!326 = distinct !DILexicalBlock(scope: !311, file: !3, line: 543, column: 7)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "affect_symlink_referent", scope: !2, file: !3, line: 42, type: !276, isLocal: true, isDefinition: true)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(name: "recurse", scope: !2, file: !3, line: 45, type: !276, isLocal: true, isDefinition: true)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(name: "verbose", scope: !2, file: !3, line: 48, type: !276, isLocal: true, isDefinition: true)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(name: "root_dev_ino", scope: !2, file: !3, line: 52, type: !147, isLocal: true, isDefinition: true)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(name: "specified_context", scope: !2, file: !3, line: 55, type: !27, isLocal: true, isDefinition: true)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(name: "specified_user", scope: !2, file: !3, line: 58, type: !27, isLocal: true, isDefinition: true)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "specified_role", scope: !2, file: !3, line: 59, type: !27, isLocal: true, isDefinition: true)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "specified_range", scope: !2, file: !3, line: 60, type: !27, isLocal: true, isDefinition: true)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "specified_type", scope: !2, file: !3, line: 61, type: !27, isLocal: true, isDefinition: true)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 3584, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 14)
!348 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!349 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "Version", scope: !352, file: !353, line: 2, type: !27, isDefinition: true)
!352 = distinct !DICompileUnit(language: DW_LANG_C99, file: !353, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !30, globals: !354, nameTableKind: None)
!353 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!354 = !{!350}
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(name: "file_name", scope: !357, file: !358, line: 46, type: !27, isLocal: true, isDefinition: true)
!357 = distinct !DICompileUnit(language: DW_LANG_C99, file: !358, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !30, retainedTypes: !359, globals: !397, nameTableKind: None)
!358 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!359 = !{!360, !21, !396, !132}
!360 = !DISubprogram(name: "close_stream", scope: !361, file: !361, line: 2, type: !362, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!361 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!362 = !DISubroutineType(types: !363)
!363 = !{!29, !364}
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !37, line: 49, size: 1728, elements: !366)
!366 = !{!367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !365, file: !37, line: 51, baseType: !29, size: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !365, file: !37, line: 54, baseType: !25, size: 64, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !365, file: !37, line: 55, baseType: !25, size: 64, offset: 128)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !365, file: !37, line: 56, baseType: !25, size: 64, offset: 192)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !365, file: !37, line: 57, baseType: !25, size: 64, offset: 256)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !365, file: !37, line: 58, baseType: !25, size: 64, offset: 320)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !365, file: !37, line: 59, baseType: !25, size: 64, offset: 384)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !365, file: !37, line: 60, baseType: !25, size: 64, offset: 448)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !365, file: !37, line: 61, baseType: !25, size: 64, offset: 512)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !365, file: !37, line: 64, baseType: !25, size: 64, offset: 576)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !365, file: !37, line: 65, baseType: !25, size: 64, offset: 640)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !365, file: !37, line: 66, baseType: !25, size: 64, offset: 704)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !365, file: !37, line: 68, baseType: !52, size: 64, offset: 768)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !365, file: !37, line: 70, baseType: !364, size: 64, offset: 832)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !365, file: !37, line: 72, baseType: !29, size: 32, offset: 896)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !365, file: !37, line: 73, baseType: !29, size: 32, offset: 928)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !365, file: !37, line: 74, baseType: !58, size: 64, offset: 960)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !365, file: !37, line: 77, baseType: !62, size: 16, offset: 1024)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !365, file: !37, line: 78, baseType: !64, size: 8, offset: 1040)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !365, file: !37, line: 79, baseType: !66, size: 8, offset: 1048)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !365, file: !37, line: 81, baseType: !70, size: 64, offset: 1088)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !365, file: !37, line: 89, baseType: !73, size: 64, offset: 1152)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !365, file: !37, line: 91, baseType: !75, size: 64, offset: 1216)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !365, file: !37, line: 92, baseType: !78, size: 64, offset: 1280)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !365, file: !37, line: 93, baseType: !364, size: 64, offset: 1344)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !365, file: !37, line: 94, baseType: !82, size: 64, offset: 1408)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !365, file: !37, line: 95, baseType: !84, size: 64, offset: 1472)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !365, file: !37, line: 96, baseType: !29, size: 32, offset: 1536)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !365, file: !37, line: 98, baseType: !89, size: 160, offset: 1568)
!396 = !DISubprogram(name: "quotearg_colon", scope: !6, file: !6, line: 391, type: !104, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!397 = !{!355, !398}
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !357, file: !358, line: 56, type: !276, isLocal: true, isDefinition: true)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(name: "exit_failure", scope: !402, file: !403, line: 24, type: !405, isDefinition: true)
!402 = distinct !DICompileUnit(language: DW_LANG_C99, file: !403, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !30, globals: !404, nameTableKind: None)
!403 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!404 = !{!400}
!405 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !29)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "program_name", scope: !408, file: !409, line: 33, type: !27, isDefinition: true)
!408 = distinct !DICompileUnit(language: DW_LANG_C99, file: !409, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !30, retainedTypes: !410, globals: !446, nameTableKind: None)
!409 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!410 = !{!82, !411, !25}
!411 = !DISubprogram(name: "fputs", scope: !32, file: !32, line: 626, type: !412, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!412 = !DISubroutineType(types: !413)
!413 = !{!29, !27, !414}
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !37, line: 49, size: 1728, elements: !416)
!416 = !{!417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !415, file: !37, line: 51, baseType: !29, size: 32)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !415, file: !37, line: 54, baseType: !25, size: 64, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !415, file: !37, line: 55, baseType: !25, size: 64, offset: 128)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !415, file: !37, line: 56, baseType: !25, size: 64, offset: 192)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !415, file: !37, line: 57, baseType: !25, size: 64, offset: 256)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !415, file: !37, line: 58, baseType: !25, size: 64, offset: 320)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !415, file: !37, line: 59, baseType: !25, size: 64, offset: 384)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !415, file: !37, line: 60, baseType: !25, size: 64, offset: 448)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !415, file: !37, line: 61, baseType: !25, size: 64, offset: 512)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !415, file: !37, line: 64, baseType: !25, size: 64, offset: 576)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !415, file: !37, line: 65, baseType: !25, size: 64, offset: 640)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !415, file: !37, line: 66, baseType: !25, size: 64, offset: 704)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !415, file: !37, line: 68, baseType: !52, size: 64, offset: 768)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !415, file: !37, line: 70, baseType: !414, size: 64, offset: 832)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !415, file: !37, line: 72, baseType: !29, size: 32, offset: 896)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !415, file: !37, line: 73, baseType: !29, size: 32, offset: 928)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !415, file: !37, line: 74, baseType: !58, size: 64, offset: 960)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !415, file: !37, line: 77, baseType: !62, size: 16, offset: 1024)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !415, file: !37, line: 78, baseType: !64, size: 8, offset: 1040)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !415, file: !37, line: 79, baseType: !66, size: 8, offset: 1048)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !415, file: !37, line: 81, baseType: !70, size: 64, offset: 1088)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !415, file: !37, line: 89, baseType: !73, size: 64, offset: 1152)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !415, file: !37, line: 91, baseType: !75, size: 64, offset: 1216)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !415, file: !37, line: 92, baseType: !78, size: 64, offset: 1280)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !415, file: !37, line: 93, baseType: !414, size: 64, offset: 1344)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !415, file: !37, line: 94, baseType: !82, size: 64, offset: 1408)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !415, file: !37, line: 95, baseType: !84, size: 64, offset: 1472)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !415, file: !37, line: 96, baseType: !29, size: 32, offset: 1536)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !415, file: !37, line: 98, baseType: !89, size: 160, offset: 1568)
!446 = !{!406}
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !449, file: !450, line: 85, type: !568, isDefinition: true)
!449 = distinct !DICompileUnit(language: DW_LANG_C99, file: !450, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !451, retainedTypes: !472, globals: !541, nameTableKind: None)
!450 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!451 = !{!5, !452, !457}
!452 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, baseType: !7, size: 32, elements: !453)
!453 = !{!454, !455, !456}
!454 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!455 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!456 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!457 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !458, line: 46, baseType: !7, size: 32, elements: !459)
!458 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!459 = !{!460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471}
!460 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!461 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!462 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!463 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!464 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!465 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!466 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!467 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!468 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!469 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!470 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!471 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!472 = !{!473, !479, !495, !498, !29, !62, !501, !84, !516, !520, !21, !526, !530, !25, !534, !537, !538}
!473 = !DISubprogram(name: "xmemdup", scope: !474, file: !474, line: 62, type: !475, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!474 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!475 = !DISubroutineType(types: !476)
!476 = !{!82, !477, !86}
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!479 = !DISubprogram(name: "quotearg_alloc_mem", scope: !6, file: !6, line: 342, type: !480, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!480 = !DISubroutineType(types: !481)
!481 = !{!25, !27, !86, !482, !483}
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !485)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !450, line: 65, size: 448, elements: !486)
!486 = !{!487, !488, !489, !493, !494}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !485, file: !450, line: 68, baseType: !5, size: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !485, file: !450, line: 71, baseType: !29, size: 32, offset: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !485, file: !450, line: 75, baseType: !490, size: 256, offset: 64)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !491)
!491 = !{!492}
!492 = !DISubrange(count: 8)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !485, file: !450, line: 78, baseType: !27, size: 64, offset: 320)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !485, file: !450, line: 81, baseType: !27, size: 64, offset: 384)
!495 = !DISubprogram(name: "free", scope: !107, file: !107, line: 565, type: !496, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!496 = !DISubroutineType(types: !497)
!497 = !{null, !82}
!498 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !6, file: !6, line: 408, type: !499, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!499 = !DISubroutineType(types: !500)
!500 = !{!25, !29, !27, !27, !27, !86}
!501 = !DISubprogram(name: "rpl_mbrtowc", scope: !502, file: !502, line: 717, type: !503, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!502 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!503 = !DISubroutineType(types: !504)
!504 = !{!86, !126, !27, !86, !505}
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !507, line: 13, size: 64, elements: !508)
!507 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!508 = !{!509, !510}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !506, file: !507, line: 15, baseType: !29, size: 32)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !506, file: !507, line: 20, baseType: !511, size: 32, offset: 32)
!511 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !506, file: !507, line: 16, size: 32, elements: !512)
!512 = !{!513, !514}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !511, file: !507, line: 18, baseType: !7, size: 32)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !511, file: !507, line: 19, baseType: !515, size: 32)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 32, elements: !270)
!516 = !DISubprogram(name: "iswprint", scope: !517, file: !517, line: 120, type: !518, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!517 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!518 = !DISubroutineType(types: !519)
!519 = !{!29, !7}
!520 = !DISubprogram(name: "mbsinit", scope: !521, file: !521, line: 292, type: !522, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!521 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!522 = !DISubroutineType(types: !523)
!523 = !{!29, !524}
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !506)
!526 = !DISubprogram(name: "locale_charset", scope: !527, file: !527, line: 35, type: !528, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!527 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!528 = !DISubroutineType(types: !529)
!529 = !{!27}
!530 = !DISubprogram(name: "c_strcasecmp", scope: !531, file: !531, line: 42, type: !532, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!531 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!532 = !DISubroutineType(types: !533)
!533 = !{!29, !27, !27}
!534 = !DISubprogram(name: "xmalloc", scope: !474, file: !474, line: 53, type: !535, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!535 = !DISubroutineType(types: !536)
!536 = !{!82, !86}
!537 = !DISubprogram(name: "xalloc_die", scope: !474, file: !474, line: 51, type: !111, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !30)
!538 = !DISubprogram(name: "xrealloc", scope: !474, file: !474, line: 59, type: !539, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!539 = !DISubroutineType(types: !540)
!540 = !{!82, !82, !86}
!541 = !{!447, !542, !548, !550, !552, !557, !564, !566}
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !449, file: !450, line: 101, type: !544, isDefinition: true)
!544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !545, size: 320, elements: !546)
!545 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!546 = !{!547}
!547 = !DISubrange(count: 10)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !449, file: !450, line: 1052, type: !485, isDefinition: true)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !449, file: !450, line: 116, type: !485, isLocal: true, isDefinition: true)
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(name: "slot0", scope: !449, file: !450, line: 842, type: !554, isLocal: true, isDefinition: true)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 2048, elements: !555)
!555 = !{!556}
!556 = !DISubrange(count: 256)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(name: "slotvec", scope: !449, file: !450, line: 845, type: !559, isLocal: true, isDefinition: true)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !450, line: 834, size: 128, elements: !561)
!561 = !{!562, !563}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !560, file: !450, line: 836, baseType: !84, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !560, file: !450, line: 837, baseType: !25, size: 64, offset: 64)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(name: "nslots", scope: !449, file: !450, line: 843, type: !29, isLocal: true, isDefinition: true)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(name: "slotvec0", scope: !449, file: !450, line: 844, type: !560, isLocal: true, isDefinition: true)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !569, size: 704, elements: !570)
!569 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!570 = !{!571}
!571 = !DISubrange(count: 11)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !574, file: !575, line: 26, type: !577, isDefinition: true)
!574 = distinct !DICompileUnit(language: DW_LANG_C99, file: !575, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !30, globals: !576, nameTableKind: None)
!575 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!576 = !{!572}
!577 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 376, elements: !578)
!578 = !{!579}
!579 = !DISubrange(count: 47)
!580 = !DIGlobalVariableExpression(var: !581, expr: !DIExpression())
!581 = distinct !DIGlobalVariable(name: "proc_status", scope: !582, file: !583, line: 65, type: !29, isLocal: true, isDefinition: true)
!582 = distinct !DISubprogram(name: "openat_proc_name", scope: !583, file: !583, line: 44, type: !584, scopeLine: 45, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !586, retainedNodes: !604)
!583 = !DIFile(filename: "lib/openat-proc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!584 = !DISubroutineType(types: !585)
!585 = !{!25, !25, !29, !27}
!586 = distinct !DICompileUnit(language: DW_LANG_C99, file: !583, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !587, retainedTypes: !591, globals: !603, nameTableKind: None)
!587 = !{!588}
!588 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !582, file: !583, line: 59, baseType: !7, size: 32, elements: !589)
!589 = !{!590}
!590 = !DIEnumerator(name: "PROC_SELF_FD_DIR_SIZE_BOUND", value: 27, isUnsigned: true)
!591 = !{!592, !596, !600}
!592 = !DISubprogram(name: "open", scope: !593, file: !593, line: 196, type: !594, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!593 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
!594 = !DISubroutineType(types: !595)
!595 = !{!29, !27, !29, null}
!596 = !DISubprogram(name: "access", scope: !597, file: !597, line: 287, type: !598, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!597 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!598 = !DISubroutineType(types: !599)
!599 = !{!29, !27, !29}
!600 = !DISubprogram(name: "close", scope: !597, file: !597, line: 353, type: !601, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!601 = !DISubroutineType(types: !602)
!602 = !{!29, !29}
!603 = !{!580}
!604 = !{!605, !606, !607, !608, !609, !610, !614, !620}
!605 = !DILocalVariable(name: "buf", arg: 1, scope: !582, file: !583, line: 44, type: !25)
!606 = !DILocalVariable(name: "fd", arg: 2, scope: !582, file: !583, line: 44, type: !29)
!607 = !DILocalVariable(name: "file", arg: 3, scope: !582, file: !583, line: 44, type: !27)
!608 = !DILocalVariable(name: "result", scope: !582, file: !583, line: 46, type: !25)
!609 = !DILocalVariable(name: "dirlen", scope: !582, file: !583, line: 47, type: !29)
!610 = !DILocalVariable(name: "proc_self_fd", scope: !611, file: !583, line: 76, type: !29)
!611 = distinct !DILexicalBlock(scope: !612, file: !583, line: 67, column: 7)
!612 = distinct !DILexicalBlock(scope: !613, file: !583, line: 66, column: 9)
!613 = distinct !DILexicalBlock(scope: !582, file: !583, line: 58, column: 3)
!614 = !DILocalVariable(name: "dotdot_buf", scope: !615, file: !583, line: 87, type: !617)
!615 = distinct !DILexicalBlock(scope: !616, file: !583, line: 81, column: 11)
!616 = distinct !DILexicalBlock(scope: !611, file: !583, line: 78, column: 13)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 256, elements: !618)
!618 = !{!619}
!619 = !DISubrange(count: 32)
!620 = !DILocalVariable(name: "bufsize", scope: !621, file: !583, line: 98, type: !84)
!621 = distinct !DILexicalBlock(scope: !622, file: !583, line: 97, column: 7)
!622 = distinct !DILexicalBlock(scope: !613, file: !583, line: 94, column: 9)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(name: "default_tuning", scope: !625, file: !626, line: 130, type: !633, isLocal: true, isDefinition: true)
!625 = distinct !DICompileUnit(language: DW_LANG_C99, file: !626, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !30, retainedTypes: !627, globals: !632, nameTableKind: None)
!626 = !DIFile(filename: "lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!627 = !{!86, !82, !628, !495, !84}
!628 = !DISubprogram(name: "rpl_calloc", scope: !629, file: !629, line: 688, type: !630, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!629 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!630 = !DISubroutineType(types: !631)
!631 = !{!82, !86, !86}
!632 = !{!623}
!633 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !634)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !635, line: 65, baseType: !636)
!635 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !635, line: 53, size: 160, elements: !637)
!637 = !{!638, !640, !641, !642, !643}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !636, file: !635, line: 58, baseType: !639, size: 32)
!639 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !636, file: !635, line: 59, baseType: !639, size: 32, offset: 32)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !636, file: !635, line: 60, baseType: !639, size: 32, offset: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !636, file: !635, line: 61, baseType: !639, size: 32, offset: 96)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !636, file: !635, line: 62, baseType: !276, size: 8, offset: 128)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !646, file: !647, line: 507, type: !29, isLocal: true, isDefinition: true)
!646 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !647, file: !647, line: 488, type: !648, scopeLine: 489, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !650, retainedNodes: !656)
!647 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!648 = !DISubroutineType(types: !649)
!649 = !{!29, !29, !29}
!650 = distinct !DICompileUnit(language: DW_LANG_C99, file: !647, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !30, retainedTypes: !651, globals: !655, nameTableKind: None)
!651 = !{!652, !600}
!652 = !DISubprogram(name: "fcntl", scope: !593, file: !593, line: 176, type: !653, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!653 = !DISubroutineType(types: !654)
!654 = !{!29, !29, !29, null}
!655 = !{!644}
!656 = !{!657, !658, !659, !660, !663}
!657 = !DILocalVariable(name: "fd", arg: 1, scope: !646, file: !647, line: 488, type: !29)
!658 = !DILocalVariable(name: "target", arg: 2, scope: !646, file: !647, line: 488, type: !29)
!659 = !DILocalVariable(name: "result", scope: !646, file: !647, line: 490, type: !29)
!660 = !DILocalVariable(name: "flags", scope: !661, file: !647, line: 531, type: !29)
!661 = distinct !DILexicalBlock(scope: !662, file: !647, line: 530, column: 5)
!662 = distinct !DILexicalBlock(scope: !646, file: !647, line: 529, column: 7)
!663 = !DILocalVariable(name: "saved_errno", scope: !664, file: !647, line: 534, type: !29)
!664 = distinct !DILexicalBlock(scope: !665, file: !647, line: 533, column: 9)
!665 = distinct !DILexicalBlock(scope: !661, file: !647, line: 532, column: 11)
!666 = distinct !DICompileUnit(language: DW_LANG_C99, file: !667, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !30, nameTableKind: None)
!667 = !DIFile(filename: "lib/root-dev-ino.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!668 = distinct !DICompileUnit(language: DW_LANG_C99, file: !669, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !30, retainedTypes: !670, nameTableKind: None)
!669 = !DIFile(filename: "lib/selinux-at.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!670 = !{!671, !495, !673, !682, !686, !689, !690, !695}
!671 = !DISubprogram(name: "openat_proc_name", scope: !672, file: !672, line: 47, type: !584, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!672 = !DIFile(filename: "./lib/openat-priv.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!673 = !DISubprogram(name: "save_cwd", scope: !674, file: !674, line: 30, type: !675, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!674 = !DIFile(filename: "./lib/save-cwd.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!675 = !DISubroutineType(types: !676)
!676 = !{!29, !677}
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "saved_cwd", file: !674, line: 24, size: 128, elements: !679)
!679 = !{!680, !681}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !678, file: !674, line: 26, baseType: !29, size: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !678, file: !674, line: 27, baseType: !25, size: 64, offset: 64)
!682 = !DISubprogram(name: "openat_save_fail", scope: !683, file: !683, line: 49, type: !684, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !30)
!683 = !DIFile(filename: "./lib/openat.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!684 = !DISubroutineType(types: !685)
!685 = !{null, !29}
!686 = !DISubprogram(name: "free_cwd", scope: !674, file: !674, line: 32, type: !687, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!687 = !DISubroutineType(types: !688)
!688 = !{null, !677}
!689 = !DISubprogram(name: "fchdir", scope: !597, file: !597, line: 501, type: !601, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!690 = !DISubprogram(name: "restore_cwd", scope: !674, file: !674, line: 31, type: !691, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!691 = !DISubroutineType(types: !692)
!692 = !{!29, !693}
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !678)
!695 = !DISubprogram(name: "openat_restore_fail", scope: !683, file: !683, line: 48, type: !684, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !30)
!696 = distinct !DICompileUnit(language: DW_LANG_C99, file: !697, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !698, retainedTypes: !702, nameTableKind: None)
!697 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!698 = !{!699}
!699 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !697, line: 40, baseType: !7, size: 32, elements: !700)
!700 = !{!701}
!701 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!702 = !{!21, !703, !82}
!703 = !DISubprogram(name: "fputs_unlocked", scope: !32, file: !32, line: 662, type: !704, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!704 = !DISubroutineType(types: !705)
!705 = !{!29, !27, !706}
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !37, line: 49, size: 1728, elements: !708)
!708 = !{!709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !707, file: !37, line: 51, baseType: !29, size: 32)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !707, file: !37, line: 54, baseType: !25, size: 64, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !707, file: !37, line: 55, baseType: !25, size: 64, offset: 128)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !707, file: !37, line: 56, baseType: !25, size: 64, offset: 192)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !707, file: !37, line: 57, baseType: !25, size: 64, offset: 256)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !707, file: !37, line: 58, baseType: !25, size: 64, offset: 320)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !707, file: !37, line: 59, baseType: !25, size: 64, offset: 384)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !707, file: !37, line: 60, baseType: !25, size: 64, offset: 448)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !707, file: !37, line: 61, baseType: !25, size: 64, offset: 512)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !707, file: !37, line: 64, baseType: !25, size: 64, offset: 576)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !707, file: !37, line: 65, baseType: !25, size: 64, offset: 640)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !707, file: !37, line: 66, baseType: !25, size: 64, offset: 704)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !707, file: !37, line: 68, baseType: !52, size: 64, offset: 768)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !707, file: !37, line: 70, baseType: !706, size: 64, offset: 832)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !707, file: !37, line: 72, baseType: !29, size: 32, offset: 896)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !707, file: !37, line: 73, baseType: !29, size: 32, offset: 928)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !707, file: !37, line: 74, baseType: !58, size: 64, offset: 960)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !707, file: !37, line: 77, baseType: !62, size: 16, offset: 1024)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !707, file: !37, line: 78, baseType: !64, size: 8, offset: 1040)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !707, file: !37, line: 79, baseType: !66, size: 8, offset: 1048)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !707, file: !37, line: 81, baseType: !70, size: 64, offset: 1088)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !707, file: !37, line: 89, baseType: !73, size: 64, offset: 1152)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !707, file: !37, line: 91, baseType: !75, size: 64, offset: 1216)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !707, file: !37, line: 92, baseType: !78, size: 64, offset: 1280)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !707, file: !37, line: 93, baseType: !706, size: 64, offset: 1344)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !707, file: !37, line: 94, baseType: !82, size: 64, offset: 1408)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !707, file: !37, line: 95, baseType: !84, size: 64, offset: 1472)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !707, file: !37, line: 96, baseType: !29, size: 32, offset: 1536)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !707, file: !37, line: 98, baseType: !89, size: 160, offset: 1568)
!738 = distinct !DICompileUnit(language: DW_LANG_C99, file: !739, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !740, retainedTypes: !753, nameTableKind: None)
!739 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!740 = !{!741}
!741 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !742, file: !474, line: 186, baseType: !7, size: 32, elements: !751)
!742 = distinct !DISubprogram(name: "x2nrealloc", scope: !474, file: !474, line: 174, type: !743, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !738, retainedNodes: !746)
!743 = !DISubroutineType(types: !744)
!744 = !{!82, !82, !745, !84}
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!746 = !{!747, !748, !749, !750}
!747 = !DILocalVariable(name: "p", arg: 1, scope: !742, file: !474, line: 174, type: !82)
!748 = !DILocalVariable(name: "pn", arg: 2, scope: !742, file: !474, line: 174, type: !745)
!749 = !DILocalVariable(name: "s", arg: 3, scope: !742, file: !474, line: 174, type: !84)
!750 = !DILocalVariable(name: "n", scope: !742, file: !474, line: 176, type: !84)
!751 = !{!752}
!752 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!753 = !{!84, !537, !534, !538, !25, !495, !82, !754, !628}
!754 = !DISubprogram(name: "xcalloc", scope: !474, file: !474, line: 57, type: !630, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!755 = distinct !DICompileUnit(language: DW_LANG_C99, file: !756, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !30, retainedTypes: !757, nameTableKind: None)
!756 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!757 = !{!21, !132}
!758 = distinct !DICompileUnit(language: DW_LANG_C99, file: !759, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !30, retainedTypes: !760, nameTableKind: None)
!759 = !DIFile(filename: "lib/xfts.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!760 = !{!761, !82, !537}
!761 = !DISubprogram(name: "rpl_fts_open", scope: !164, file: !164, line: 277, type: !762, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!762 = !DISubroutineType(types: !763)
!763 = !{!764, !117, !29, !825}
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !164, line: 80, size: 1024, elements: !766)
!766 = !{!767, !815, !816, !818, !819, !820, !821, !822, !823, !824, !831, !832, !833, !838}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !765, file: !164, line: 81, baseType: !768, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !164, line: 199, size: 2112, elements: !770)
!770 = !{!771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !785, !786, !787, !788, !789, !790, !791, !814}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !769, file: !164, line: 200, baseType: !768, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !769, file: !164, line: 201, baseType: !768, size: 64, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !769, file: !164, line: 202, baseType: !768, size: 64, offset: 128)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !769, file: !164, line: 203, baseType: !174, size: 64, offset: 192)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !769, file: !164, line: 206, baseType: !60, size: 64, offset: 256)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !769, file: !164, line: 207, baseType: !82, size: 64, offset: 320)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !769, file: !164, line: 208, baseType: !25, size: 64, offset: 384)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !769, file: !164, line: 209, baseType: !25, size: 64, offset: 448)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !769, file: !164, line: 210, baseType: !29, size: 32, offset: 512)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !769, file: !164, line: 211, baseType: !29, size: 32, offset: 544)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !769, file: !164, line: 212, baseType: !84, size: 64, offset: 576)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !769, file: !164, line: 214, baseType: !783, size: 64, offset: 640)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !164, line: 197, baseType: !765)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !769, file: !164, line: 218, baseType: !189, size: 64, offset: 704)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !769, file: !164, line: 220, baseType: !84, size: 64, offset: 768)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "fts_n_dirs_remaining", scope: !769, file: !164, line: 225, baseType: !192, size: 64, offset: 832)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !769, file: !164, line: 241, baseType: !62, size: 16, offset: 896)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !769, file: !164, line: 245, baseType: !62, size: 16, offset: 912)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !769, file: !164, line: 251, baseType: !62, size: 16, offset: 928)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !769, file: !164, line: 253, baseType: !792, size: 1152, offset: 960)
!792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !793, size: 1152, elements: !67)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !200, line: 46, size: 1152, elements: !794)
!794 = !{!795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !811, !812, !813}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !793, file: !200, line: 48, baseType: !157, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !793, file: !200, line: 53, baseType: !154, size: 64, offset: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !793, file: !200, line: 61, baseType: !193, size: 64, offset: 128)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !793, file: !200, line: 62, baseType: !206, size: 32, offset: 192)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !793, file: !200, line: 64, baseType: !208, size: 32, offset: 224)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !793, file: !200, line: 65, baseType: !210, size: 32, offset: 256)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !793, file: !200, line: 67, baseType: !29, size: 32, offset: 288)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !793, file: !200, line: 69, baseType: !157, size: 64, offset: 320)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !793, file: !200, line: 74, baseType: !58, size: 64, offset: 384)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !793, file: !200, line: 78, baseType: !215, size: 64, offset: 448)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !793, file: !200, line: 80, baseType: !217, size: 64, offset: 512)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !793, file: !200, line: 91, baseType: !807, size: 128, offset: 576)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !220, line: 10, size: 128, elements: !808)
!808 = !{!809, !810}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !807, file: !220, line: 12, baseType: !223, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !807, file: !220, line: 16, baseType: !225, size: 64, offset: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !793, file: !200, line: 92, baseType: !807, size: 128, offset: 704)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !793, file: !200, line: 93, baseType: !807, size: 128, offset: 832)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !793, file: !200, line: 106, baseType: !229, size: 192, offset: 960)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "fts_name", scope: !769, file: !164, line: 254, baseType: !233, offset: 2112)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "fts_child", scope: !765, file: !164, line: 82, baseType: !768, size: 64, offset: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "fts_array", scope: !765, file: !164, line: 83, baseType: !817, size: 64, offset: 128)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !765, file: !164, line: 84, baseType: !156, size: 64, offset: 192)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !765, file: !164, line: 85, baseType: !25, size: 64, offset: 256)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "fts_rfd", scope: !765, file: !164, line: 86, baseType: !29, size: 32, offset: 320)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cwd_fd", scope: !765, file: !164, line: 87, baseType: !29, size: 32, offset: 352)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !765, file: !164, line: 89, baseType: !84, size: 64, offset: 384)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "fts_nitems", scope: !765, file: !164, line: 90, baseType: !84, size: 64, offset: 448)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "fts_compar", scope: !765, file: !164, line: 91, baseType: !825, size: 64, offset: 512)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DISubroutineType(types: !827)
!827 = !{!29, !828, !828}
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !769)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "fts_options", scope: !765, file: !164, line: 160, baseType: !29, size: 32, offset: 576)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "fts_leaf_optimization_works_ht", scope: !765, file: !164, line: 169, baseType: !254, size: 64, offset: 640)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !765, file: !164, line: 191, baseType: !834, size: 64, offset: 704)
!834 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !765, file: !164, line: 171, size: 64, elements: !835)
!835 = !{!836, !837}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !834, file: !164, line: 184, baseType: !254, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !834, file: !164, line: 190, baseType: !261, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fd_ring", scope: !765, file: !164, line: 196, baseType: !839, size: 256, offset: 768)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "I_ring", file: !265, line: 39, baseType: !840)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "I_ring", file: !265, line: 31, size: 256, elements: !841)
!841 = !{!842, !843, !844, !845, !846}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "ir_data", scope: !840, file: !265, line: 33, baseType: !269, size: 128)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "ir_default_val", scope: !840, file: !265, line: 34, baseType: !29, size: 32, offset: 128)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "ir_front", scope: !840, file: !265, line: 35, baseType: !7, size: 32, offset: 160)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "ir_back", scope: !840, file: !265, line: 36, baseType: !7, size: 32, offset: 192)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "ir_empty", scope: !840, file: !265, line: 37, baseType: !276, size: 8, offset: 224)
!847 = distinct !DICompileUnit(language: DW_LANG_C99, file: !848, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !30, retainedTypes: !849, nameTableKind: None)
!848 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!849 = !{!82}
!850 = distinct !DICompileUnit(language: DW_LANG_C99, file: !851, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !852, retainedTypes: !987, nameTableKind: None)
!851 = !DIFile(filename: "lib/fts.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!852 = !{!853, !857, !862, !967, !970, !973, !984}
!853 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Fts_stat", file: !851, line: 156, baseType: !7, size: 32, elements: !854)
!854 = !{!855, !856}
!855 = !DIEnumerator(name: "FTS_NO_STAT_REQUIRED", value: 1, isUnsigned: true)
!856 = !DIEnumerator(name: "FTS_STAT_REQUIRED", value: 2, isUnsigned: true)
!857 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "leaf_optimization", file: !851, line: 643, baseType: !7, size: 32, elements: !858)
!858 = !{!859, !860, !861}
!859 = !DIEnumerator(name: "NO_LEAF_OPTIMIZATION", value: 0, isUnsigned: true)
!860 = !DIEnumerator(name: "OK_LEAF_OPTIMIZATION", value: 1, isUnsigned: true)
!861 = !DIEnumerator(name: "NOSTAT_LEAF_OPTIMIZATION", value: 2, isUnsigned: true)
!862 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !864, file: !863, line: 54, baseType: !7, size: 32, elements: !965)
!863 = !DIFile(filename: "./lib/fts-cycle.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!864 = distinct !DISubprogram(name: "setup_dir", scope: !863, file: !863, line: 50, type: !865, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !850, retainedNodes: !963)
!865 = !DISubroutineType(types: !866)
!866 = !{!276, !867}
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !164, line: 197, baseType: !869)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !164, line: 80, size: 1024, elements: !870)
!870 = !{!871, !917, !918, !920, !921, !922, !923, !924, !925, !926, !933, !934, !935, !954}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !869, file: !164, line: 81, baseType: !872, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !164, line: 199, size: 2112, elements: !874)
!874 = !{!875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !916}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !873, file: !164, line: 200, baseType: !872, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !873, file: !164, line: 201, baseType: !872, size: 64, offset: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !873, file: !164, line: 202, baseType: !872, size: 64, offset: 128)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !873, file: !164, line: 203, baseType: !174, size: 64, offset: 192)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !873, file: !164, line: 206, baseType: !60, size: 64, offset: 256)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !873, file: !164, line: 207, baseType: !82, size: 64, offset: 320)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !873, file: !164, line: 208, baseType: !25, size: 64, offset: 384)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !873, file: !164, line: 209, baseType: !25, size: 64, offset: 448)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !873, file: !164, line: 210, baseType: !29, size: 32, offset: 512)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !873, file: !164, line: 211, baseType: !29, size: 32, offset: 544)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !873, file: !164, line: 212, baseType: !84, size: 64, offset: 576)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !873, file: !164, line: 214, baseType: !867, size: 64, offset: 640)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !873, file: !164, line: 218, baseType: !189, size: 64, offset: 704)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !873, file: !164, line: 220, baseType: !84, size: 64, offset: 768)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "fts_n_dirs_remaining", scope: !873, file: !164, line: 225, baseType: !192, size: 64, offset: 832)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !873, file: !164, line: 241, baseType: !62, size: 16, offset: 896)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !873, file: !164, line: 245, baseType: !62, size: 16, offset: 912)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !873, file: !164, line: 251, baseType: !62, size: 16, offset: 928)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !873, file: !164, line: 253, baseType: !894, size: 1152, offset: 960)
!894 = !DICompositeType(tag: DW_TAG_array_type, baseType: !895, size: 1152, elements: !67)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !200, line: 46, size: 1152, elements: !896)
!896 = !{!897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !913, !914, !915}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !895, file: !200, line: 48, baseType: !157, size: 64)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !895, file: !200, line: 53, baseType: !154, size: 64, offset: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !895, file: !200, line: 61, baseType: !193, size: 64, offset: 128)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !895, file: !200, line: 62, baseType: !206, size: 32, offset: 192)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !895, file: !200, line: 64, baseType: !208, size: 32, offset: 224)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !895, file: !200, line: 65, baseType: !210, size: 32, offset: 256)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !895, file: !200, line: 67, baseType: !29, size: 32, offset: 288)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !895, file: !200, line: 69, baseType: !157, size: 64, offset: 320)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !895, file: !200, line: 74, baseType: !58, size: 64, offset: 384)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !895, file: !200, line: 78, baseType: !215, size: 64, offset: 448)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !895, file: !200, line: 80, baseType: !217, size: 64, offset: 512)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !895, file: !200, line: 91, baseType: !909, size: 128, offset: 576)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !220, line: 10, size: 128, elements: !910)
!910 = !{!911, !912}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !909, file: !220, line: 12, baseType: !223, size: 64)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !909, file: !220, line: 16, baseType: !225, size: 64, offset: 64)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !895, file: !200, line: 92, baseType: !909, size: 128, offset: 704)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !895, file: !200, line: 93, baseType: !909, size: 128, offset: 832)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !895, file: !200, line: 106, baseType: !229, size: 192, offset: 960)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "fts_name", scope: !873, file: !164, line: 254, baseType: !233, offset: 2112)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "fts_child", scope: !869, file: !164, line: 82, baseType: !872, size: 64, offset: 64)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "fts_array", scope: !869, file: !164, line: 83, baseType: !919, size: 64, offset: 128)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !869, file: !164, line: 84, baseType: !156, size: 64, offset: 192)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !869, file: !164, line: 85, baseType: !25, size: 64, offset: 256)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "fts_rfd", scope: !869, file: !164, line: 86, baseType: !29, size: 32, offset: 320)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cwd_fd", scope: !869, file: !164, line: 87, baseType: !29, size: 32, offset: 352)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !869, file: !164, line: 89, baseType: !84, size: 64, offset: 384)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "fts_nitems", scope: !869, file: !164, line: 90, baseType: !84, size: 64, offset: 448)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "fts_compar", scope: !869, file: !164, line: 91, baseType: !927, size: 64, offset: 512)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DISubroutineType(types: !929)
!929 = !{!29, !930, !930}
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !873)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "fts_options", scope: !869, file: !164, line: 160, baseType: !29, size: 32, offset: 576)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "fts_leaf_optimization_works_ht", scope: !869, file: !164, line: 169, baseType: !254, size: 64, offset: 640)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !869, file: !164, line: 191, baseType: !936, size: 64, offset: 704)
!936 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !869, file: !164, line: 171, size: 64, elements: !937)
!937 = !{!938, !939}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !936, file: !164, line: 184, baseType: !254, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !936, file: !164, line: 190, baseType: !940, size: 64)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cycle_check_state", file: !942, line: 28, size: 256, elements: !943)
!942 = !DIFile(filename: "./lib/cycle-check.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!943 = !{!944, !949, !953}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "dev_ino", scope: !941, file: !942, line: 30, baseType: !945, size: 128)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !149, line: 7, size: 128, elements: !946)
!946 = !{!947, !948}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !945, file: !149, line: 9, baseType: !152, size: 64)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !945, file: !149, line: 10, baseType: !156, size: 64, offset: 64)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "chdir_counter", scope: !941, file: !942, line: 31, baseType: !950, size: 64, offset: 128)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !951, line: 102, baseType: !952)
!951 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !59, line: 73, baseType: !86)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !941, file: !942, line: 32, baseType: !29, size: 32, offset: 192)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fd_ring", scope: !869, file: !164, line: 196, baseType: !955, size: 256, offset: 768)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "I_ring", file: !265, line: 39, baseType: !956)
