; ModuleID = 'coreutils-8.32/src/chcon.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.dev_ino = type { i64, i64 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.FTS = type { %struct._ftsent*, %struct._ftsent*, %struct._ftsent**, i64, i8*, i32, i32, i64, i64, i32 (%struct._ftsent**, %struct._ftsent**)*, i32, %struct.hash_table*, %union.anon, %struct.I_ring }
%struct._ftsent = type { %struct._ftsent*, %struct._ftsent*, %struct._ftsent*, %struct.__dirstream*, i64, i8*, i8*, i8*, i32, i32, i64, %struct.FTS*, i64, i64, i64, i16, i16, i16, [1 x %struct.stat], [0 x i8] }
%struct.__dirstream = type opaque
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.dev_ino, %struct.dev_ino, %struct.dev_ino, [3 x i64] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 73, type: !79, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !20, globals: !24, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/chcon.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!9 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!20 = !{!21, !23}
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!24 = !{!25, !58, !60, !62, !64, !67, !71, !73, !75, !77, !0}
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "dev_ino_buf", scope: !27, file: !3, line: 575, type: !46, isLocal: true, isDefinition: true)
!27 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 412, type: !28, scopeLine: 413, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !32)
!28 = !DISubroutineType(types: !29)
!29 = !{!30, !30, !31}
!30 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!32 = !{!33, !34, !35, !36, !37, !39, !40, !41, !42, !43}
!33 = !DILocalVariable(name: "argc", arg: 1, scope: !27, file: !3, line: 412, type: !30)
!34 = !DILocalVariable(name: "argv", arg: 2, scope: !27, file: !3, line: 412, type: !31)
!35 = !DILocalVariable(name: "bit_flags", scope: !27, file: !3, line: 415, type: !30)
!36 = !DILocalVariable(name: "dereference", scope: !27, file: !3, line: 419, type: !30)
!37 = !DILocalVariable(name: "ok", scope: !27, file: !3, line: 421, type: !38)
!38 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!39 = !DILocalVariable(name: "preserve_root", scope: !27, file: !3, line: 422, type: !38)
!40 = !DILocalVariable(name: "component_specified", scope: !27, file: !3, line: 423, type: !38)
!41 = !DILocalVariable(name: "reference_file", scope: !27, file: !3, line: 424, type: !21)
!42 = !DILocalVariable(name: "optc", scope: !27, file: !3, line: 425, type: !30)
!43 = !DILocalVariable(name: "ref_context", scope: !44, file: !3, line: 545, type: !21)
!44 = distinct !DILexicalBlock(scope: !45, file: !3, line: 544, column: 5)
!45 = distinct !DILexicalBlock(scope: !27, file: !3, line: 543, column: 7)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !47, line: 7, size: 128, elements: !48)
!47 = !DIFile(filename: "./lib/dev-ino.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!48 = !{!49, !55}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !46, file: !47, line: 9, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !51, line: 47, baseType: !52)
!51 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !53, line: 148, baseType: !54)
!53 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!54 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !46, file: !47, line: 10, baseType: !56, size: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !51, line: 59, baseType: !57)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !53, line: 145, baseType: !54)
!58 = !DIGlobalVariableExpression(var: !59, expr: !DIExpression())
!59 = distinct !DIGlobalVariable(name: "affect_symlink_referent", scope: !2, file: !3, line: 42, type: !38, isLocal: true, isDefinition: true)
!60 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression())
!61 = distinct !DIGlobalVariable(name: "recurse", scope: !2, file: !3, line: 45, type: !38, isLocal: true, isDefinition: true)
!62 = !DIGlobalVariableExpression(var: !63, expr: !DIExpression())
!63 = distinct !DIGlobalVariable(name: "verbose", scope: !2, file: !3, line: 48, type: !38, isLocal: true, isDefinition: true)
!64 = !DIGlobalVariableExpression(var: !65, expr: !DIExpression())
!65 = distinct !DIGlobalVariable(name: "root_dev_ino", scope: !2, file: !3, line: 52, type: !66, isLocal: true, isDefinition: true)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!67 = !DIGlobalVariableExpression(var: !68, expr: !DIExpression())
!68 = distinct !DIGlobalVariable(name: "specified_context", scope: !2, file: !3, line: 55, type: !69, isLocal: true, isDefinition: true)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(name: "specified_user", scope: !2, file: !3, line: 58, type: !69, isLocal: true, isDefinition: true)
!73 = !DIGlobalVariableExpression(var: !74, expr: !DIExpression())
!74 = distinct !DIGlobalVariable(name: "specified_role", scope: !2, file: !3, line: 59, type: !69, isLocal: true, isDefinition: true)
!75 = !DIGlobalVariableExpression(var: !76, expr: !DIExpression())
!76 = distinct !DIGlobalVariable(name: "specified_range", scope: !2, file: !3, line: 60, type: !69, isLocal: true, isDefinition: true)
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "specified_type", scope: !2, file: !3, line: 61, type: !69, isLocal: true, isDefinition: true)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 3584, elements: !89)
!80 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !81)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !82, line: 50, size: 256, elements: !83)
!82 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!83 = !{!84, !85, !86, !88}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !81, file: !82, line: 52, baseType: !69, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !81, file: !82, line: 55, baseType: !30, size: 32, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !81, file: !82, line: 56, baseType: !87, size: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !81, file: !82, line: 57, baseType: !30, size: 32, offset: 192)
!89 = !{!90}
!90 = !DISubrange(count: 14)
!91 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!92 = !DIGlobalVariableExpression(var: !63, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!93 = !DIGlobalVariableExpression(var: !94, expr: !DIExpression())
!94 = distinct !DIGlobalVariable(name: "Version", scope: !95, file: !96, line: 2, type: !69, isLocal: false, isDefinition: true)
!95 = distinct !DICompileUnit(language: DW_LANG_C99, file: !96, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !97, globals: !98, splitDebugInlining: false, nameTableKind: None)
!96 = !DIFile(filename: "src/version.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!97 = !{}
!98 = !{!93}
!99 = !DIGlobalVariableExpression(var: !100, expr: !DIExpression())
!100 = distinct !DIGlobalVariable(name: "file_name", scope: !101, file: !102, line: 46, type: !69, isLocal: true, isDefinition: true)
!101 = distinct !DICompileUnit(language: DW_LANG_C99, file: !102, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !97, globals: !103, splitDebugInlining: false, nameTableKind: None)
!102 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!103 = !{!99, !104}
!104 = !DIGlobalVariableExpression(var: !105, expr: !DIExpression())
!105 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !101, file: !102, line: 56, type: !38, isLocal: true, isDefinition: true)
!106 = !DIGlobalVariableExpression(var: !107, expr: !DIExpression())
!107 = distinct !DIGlobalVariable(name: "exit_failure", scope: !108, file: !109, line: 24, type: !111, isLocal: false, isDefinition: true)
!108 = distinct !DICompileUnit(language: DW_LANG_C99, file: !109, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !97, globals: !110, splitDebugInlining: false, nameTableKind: None)
!109 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!110 = !{!106}
!111 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !30)
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(name: "program_name", scope: !114, file: !115, line: 33, type: !69, isLocal: false, isDefinition: true)
!114 = distinct !DICompileUnit(language: DW_LANG_C99, file: !115, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !97, retainedTypes: !116, globals: !117, splitDebugInlining: false, nameTableKind: None)
!115 = !DIFile(filename: "lib/progname.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!116 = !{!23, !21}
!117 = !{!112}
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !120, file: !121, line: 85, type: !184, isLocal: false, isDefinition: true)
!120 = distinct !DICompileUnit(language: DW_LANG_C99, file: !121, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !122, retainedTypes: !143, globals: !147, splitDebugInlining: false, nameTableKind: None)
!121 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!122 = !{!5, !123, !128}
!123 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, baseType: !7, size: 32, elements: !124)
!124 = !{!125, !126, !127}
!125 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!126 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!127 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!128 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !129, line: 46, baseType: !7, size: 32, elements: !130)
!129 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!130 = !{!131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142}
!131 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!132 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!133 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!134 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!135 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!136 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!137 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!138 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!139 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!140 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!141 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!142 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!143 = !{!30, !144, !145, !21}
!144 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !146, line: 46, baseType: !54)
!146 = !DIFile(filename: "/usr/lib/clang/12.0.1/include/stddef.h", directory: "")
!147 = !{!118, !148, !154, !166, !168, !173, !180, !182}
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !120, file: !121, line: 101, type: !150, isLocal: false, isDefinition: true)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 320, elements: !152)
!151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!152 = !{!153}
!153 = !DISubrange(count: 10)
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !120, file: !121, line: 1052, type: !156, isLocal: false, isDefinition: true)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !121, line: 65, size: 448, elements: !157)
!157 = !{!158, !159, !160, !164, !165}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !156, file: !121, line: 68, baseType: !5, size: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !156, file: !121, line: 71, baseType: !30, size: 32, offset: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !156, file: !121, line: 75, baseType: !161, size: 256, offset: 64)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !162)
!162 = !{!163}
!163 = !DISubrange(count: 8)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !156, file: !121, line: 78, baseType: !69, size: 64, offset: 320)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !156, file: !121, line: 81, baseType: !69, size: 64, offset: 384)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !120, file: !121, line: 116, type: !156, isLocal: true, isDefinition: true)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "slot0", scope: !120, file: !121, line: 842, type: !170, isLocal: true, isDefinition: true)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2048, elements: !171)
!171 = !{!172}
!172 = !DISubrange(count: 256)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(name: "slotvec", scope: !120, file: !121, line: 845, type: !175, isLocal: true, isDefinition: true)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !121, line: 834, size: 128, elements: !177)
!177 = !{!178, !179}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !176, file: !121, line: 836, baseType: !145, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !176, file: !121, line: 837, baseType: !21, size: 64, offset: 64)
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(name: "nslots", scope: !120, file: !121, line: 843, type: !30, isLocal: true, isDefinition: true)
!182 = !DIGlobalVariableExpression(var: !183, expr: !DIExpression())
!183 = distinct !DIGlobalVariable(name: "slotvec0", scope: !120, file: !121, line: 844, type: !176, isLocal: true, isDefinition: true)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 704, elements: !186)
!185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!186 = !{!187}
!187 = !DISubrange(count: 11)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !190, file: !191, line: 26, type: !193, isLocal: false, isDefinition: true)
!190 = distinct !DICompileUnit(language: DW_LANG_C99, file: !191, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !97, globals: !192, splitDebugInlining: false, nameTableKind: None)
!191 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!192 = !{!188}
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 376, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 47)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "proc_status", scope: !198, file: !199, line: 65, type: !30, isLocal: true, isDefinition: true)
!198 = distinct !DISubprogram(name: "openat_proc_name", scope: !199, file: !199, line: 44, type: !200, scopeLine: 45, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !202, retainedNodes: !208)
!199 = !DIFile(filename: "lib/openat-proc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!200 = !DISubroutineType(types: !201)
!201 = !{!21, !21, !30, !69}
!202 = distinct !DICompileUnit(language: DW_LANG_C99, file: !199, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !203, globals: !207, splitDebugInlining: false, nameTableKind: None)
!203 = !{!204}
!204 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !198, file: !199, line: 59, baseType: !7, size: 32, elements: !205)
!205 = !{!206}
!206 = !DIEnumerator(name: "PROC_SELF_FD_DIR_SIZE_BOUND", value: 27, isUnsigned: true)
!207 = !{!196}
!208 = !{!209, !210, !211, !212, !213, !214, !218, !224}
!209 = !DILocalVariable(name: "buf", arg: 1, scope: !198, file: !199, line: 44, type: !21)
!210 = !DILocalVariable(name: "fd", arg: 2, scope: !198, file: !199, line: 44, type: !30)
!211 = !DILocalVariable(name: "file", arg: 3, scope: !198, file: !199, line: 44, type: !69)
!212 = !DILocalVariable(name: "result", scope: !198, file: !199, line: 46, type: !21)
!213 = !DILocalVariable(name: "dirlen", scope: !198, file: !199, line: 47, type: !30)
!214 = !DILocalVariable(name: "proc_self_fd", scope: !215, file: !199, line: 76, type: !30)
!215 = distinct !DILexicalBlock(scope: !216, file: !199, line: 67, column: 7)
!216 = distinct !DILexicalBlock(scope: !217, file: !199, line: 66, column: 9)
!217 = distinct !DILexicalBlock(scope: !198, file: !199, line: 58, column: 3)
!218 = !DILocalVariable(name: "dotdot_buf", scope: !219, file: !199, line: 87, type: !221)
!219 = distinct !DILexicalBlock(scope: !220, file: !199, line: 81, column: 11)
!220 = distinct !DILexicalBlock(scope: !215, file: !199, line: 78, column: 13)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 256, elements: !222)
!222 = !{!223}
!223 = !DISubrange(count: 32)
!224 = !DILocalVariable(name: "bufsize", scope: !225, file: !199, line: 98, type: !145)
!225 = distinct !DILexicalBlock(scope: !226, file: !199, line: 97, column: 7)
!226 = distinct !DILexicalBlock(scope: !217, file: !199, line: 94, column: 9)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(name: "default_tuning", scope: !229, file: !230, line: 130, type: !233, isLocal: true, isDefinition: true)
!229 = distinct !DICompileUnit(language: DW_LANG_C99, file: !230, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !97, retainedTypes: !231, globals: !232, splitDebugInlining: false, nameTableKind: None)
!230 = !DIFile(filename: "lib/hash.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!231 = !{!54, !23, !145}
!232 = !{!227}
!233 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !234)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !235, line: 65, baseType: !236)
!235 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !235, line: 53, size: 160, elements: !237)
!237 = !{!238, !240, !241, !242, !243}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !236, file: !235, line: 58, baseType: !239, size: 32)
!239 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !236, file: !235, line: 59, baseType: !239, size: 32, offset: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !236, file: !235, line: 60, baseType: !239, size: 32, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !236, file: !235, line: 61, baseType: !239, size: 32, offset: 96)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !236, file: !235, line: 62, baseType: !38, size: 8, offset: 128)
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !246, file: !247, line: 507, type: !30, isLocal: true, isDefinition: true)
!246 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !247, file: !247, line: 488, type: !248, scopeLine: 489, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !250, retainedNodes: !252)
!247 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!248 = !DISubroutineType(types: !249)
!249 = !{!30, !30, !30}
!250 = distinct !DICompileUnit(language: DW_LANG_C99, file: !247, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !97, globals: !251, splitDebugInlining: false, nameTableKind: None)
!251 = !{!244}
!252 = !{!253, !254, !255, !256, !259}
!253 = !DILocalVariable(name: "fd", arg: 1, scope: !246, file: !247, line: 488, type: !30)
!254 = !DILocalVariable(name: "target", arg: 2, scope: !246, file: !247, line: 488, type: !30)
!255 = !DILocalVariable(name: "result", scope: !246, file: !247, line: 490, type: !30)
!256 = !DILocalVariable(name: "flags", scope: !257, file: !247, line: 531, type: !30)
!257 = distinct !DILexicalBlock(scope: !258, file: !247, line: 530, column: 5)
!258 = distinct !DILexicalBlock(scope: !246, file: !247, line: 529, column: 7)
!259 = !DILocalVariable(name: "saved_errno", scope: !260, file: !247, line: 534, type: !30)
!260 = distinct !DILexicalBlock(scope: !261, file: !247, line: 533, column: 9)
!261 = distinct !DILexicalBlock(scope: !257, file: !247, line: 532, column: 11)
!262 = distinct !DICompileUnit(language: DW_LANG_C99, file: !263, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !97, splitDebugInlining: false, nameTableKind: None)
!263 = !DIFile(filename: "lib/root-dev-ino.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!264 = distinct !DICompileUnit(language: DW_LANG_C99, file: !265, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !97, splitDebugInlining: false, nameTableKind: None)
!265 = !DIFile(filename: "lib/selinux-at.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!266 = distinct !DICompileUnit(language: DW_LANG_C99, file: !267, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !268, retainedTypes: !272, splitDebugInlining: false, nameTableKind: None)
!267 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!268 = !{!269}
!269 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !267, line: 40, baseType: !7, size: 32, elements: !270)
!270 = !{!271}
!271 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!272 = !{!23}
!273 = distinct !DICompileUnit(language: DW_LANG_C99, file: !274, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !275, retainedTypes: !289, splitDebugInlining: false, nameTableKind: None)
!274 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!275 = !{!276}
!276 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !278, file: !277, line: 186, baseType: !7, size: 32, elements: !287)
!277 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!278 = distinct !DISubprogram(name: "x2nrealloc", scope: !277, file: !277, line: 174, type: !279, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !273, retainedNodes: !282)
!279 = !DISubroutineType(types: !280)
!280 = !{!23, !23, !281, !145}
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!282 = !{!283, !284, !285, !286}
!283 = !DILocalVariable(name: "p", arg: 1, scope: !278, file: !277, line: 174, type: !23)
!284 = !DILocalVariable(name: "pn", arg: 2, scope: !278, file: !277, line: 174, type: !281)
!285 = !DILocalVariable(name: "s", arg: 3, scope: !278, file: !277, line: 174, type: !145)
!286 = !DILocalVariable(name: "n", scope: !278, file: !277, line: 176, type: !145)
!287 = !{!288}
!288 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!289 = !{!145, !21, !23}
!290 = distinct !DICompileUnit(language: DW_LANG_C99, file: !291, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !97, splitDebugInlining: false, nameTableKind: None)
!291 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!292 = distinct !DICompileUnit(language: DW_LANG_C99, file: !293, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !97, retainedTypes: !272, splitDebugInlining: false, nameTableKind: None)
!293 = !DIFile(filename: "lib/xfts.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!294 = distinct !DICompileUnit(language: DW_LANG_C99, file: !295, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !97, retainedTypes: !272, splitDebugInlining: false, nameTableKind: None)
!295 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!296 = distinct !DICompileUnit(language: DW_LANG_C99, file: !297, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !298, retainedTypes: !466, splitDebugInlining: false, nameTableKind: None)
!297 = !DIFile(filename: "lib/fts.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!298 = !{!299, !303, !308, !446, !449, !452, !463}
!299 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Fts_stat", file: !297, line: 156, baseType: !7, size: 32, elements: !300)
!300 = !{!301, !302}
!301 = !DIEnumerator(name: "FTS_NO_STAT_REQUIRED", value: 1, isUnsigned: true)
!302 = !DIEnumerator(name: "FTS_STAT_REQUIRED", value: 2, isUnsigned: true)
!303 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "leaf_optimization", file: !297, line: 643, baseType: !7, size: 32, elements: !304)
!304 = !{!305, !306, !307}
!305 = !DIEnumerator(name: "NO_LEAF_OPTIMIZATION", value: 0, isUnsigned: true)
!306 = !DIEnumerator(name: "OK_LEAF_OPTIMIZATION", value: 1, isUnsigned: true)
!307 = !DIEnumerator(name: "NOSTAT_LEAF_OPTIMIZATION", value: 2, isUnsigned: true)
!308 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !310, file: !309, line: 54, baseType: !7, size: 32, elements: !444)
!309 = !DIFile(filename: "./lib/fts-cycle.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!310 = distinct !DISubprogram(name: "setup_dir", scope: !309, file: !309, line: 50, type: !311, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !296, retainedNodes: !442)
!311 = !DISubroutineType(types: !312)
!312 = !{!38, !313}
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !315, line: 197, baseType: !316)
!315 = !DIFile(filename: "./lib/fts_.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !315, line: 80, size: 1024, elements: !317)
!317 = !{!318, !390, !391, !393, !394, !395, !396, !397, !398, !399, !406, !407, !410, !429}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !316, file: !315, line: 81, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !315, line: 199, size: 2112, elements: !321)
!321 = !{!322, !323, !324, !325, !330, !332, !333, !334, !335, !336, !337, !338, !339, !341, !342, !345, !346, !347, !348, !386}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !320, file: !315, line: 200, baseType: !319, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !320, file: !315, line: 201, baseType: !319, size: 64, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !320, file: !315, line: 202, baseType: !319, size: 64, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !320, file: !315, line: 203, baseType: !326, size: 64, offset: 192)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !328, line: 127, baseType: !329)
!328 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !328, line: 127, flags: DIFlagFwdDecl)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !320, file: !315, line: 206, baseType: !331, size: 64, offset: 256)
!331 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !320, file: !315, line: 207, baseType: !23, size: 64, offset: 320)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !320, file: !315, line: 208, baseType: !21, size: 64, offset: 384)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !320, file: !315, line: 209, baseType: !21, size: 64, offset: 448)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !320, file: !315, line: 210, baseType: !30, size: 32, offset: 512)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !320, file: !315, line: 211, baseType: !30, size: 32, offset: 544)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !320, file: !315, line: 212, baseType: !145, size: 64, offset: 576)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !320, file: !315, line: 214, baseType: !313, size: 64, offset: 640)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !320, file: !315, line: 218, baseType: !340, size: 64, offset: 704)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !146, line: 35, baseType: !331)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !320, file: !315, line: 220, baseType: !145, size: 64, offset: 768)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "fts_n_dirs_remaining", scope: !320, file: !315, line: 225, baseType: !343, size: 64, offset: 832)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !51, line: 74, baseType: !344)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !53, line: 151, baseType: !54)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !320, file: !315, line: 241, baseType: !144, size: 16, offset: 896)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !320, file: !315, line: 245, baseType: !144, size: 16, offset: 912)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !320, file: !315, line: 251, baseType: !144, size: 16, offset: 928)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !320, file: !315, line: 253, baseType: !349, size: 1152, offset: 960)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !350, size: 1152, elements: !384)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !351, line: 26, size: 1152, elements: !352)
!351 = !DIFile(filename: "/usr/include/bits/struct_stat.h", directory: "")
!352 = !{!353, !354, !355, !356, !358, !360, !362, !363, !364, !366, !368, !370, !378, !379, !380}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !350, file: !351, line: 28, baseType: !57, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !350, file: !351, line: 33, baseType: !52, size: 64, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !350, file: !351, line: 41, baseType: !344, size: 64, offset: 128)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !350, file: !351, line: 42, baseType: !357, size: 32, offset: 192)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !53, line: 150, baseType: !7)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !350, file: !351, line: 44, baseType: !359, size: 32, offset: 224)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !53, line: 146, baseType: !7)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !350, file: !351, line: 45, baseType: !361, size: 32, offset: 256)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !53, line: 147, baseType: !7)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !350, file: !351, line: 47, baseType: !30, size: 32, offset: 288)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !350, file: !351, line: 49, baseType: !57, size: 64, offset: 320)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !350, file: !351, line: 54, baseType: !365, size: 64, offset: 384)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !53, line: 152, baseType: !331)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !350, file: !351, line: 58, baseType: !367, size: 64, offset: 448)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !53, line: 175, baseType: !331)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !350, file: !351, line: 60, baseType: !369, size: 64, offset: 512)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !53, line: 180, baseType: !331)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !350, file: !351, line: 71, baseType: !371, size: 128, offset: 576)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !372, line: 10, size: 128, elements: !373)
!372 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!373 = !{!374, !376}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !371, file: !372, line: 12, baseType: !375, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !53, line: 160, baseType: !331)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !371, file: !372, line: 16, baseType: !377, size: 64, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !53, line: 197, baseType: !331)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !350, file: !351, line: 72, baseType: !371, size: 128, offset: 704)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !350, file: !351, line: 73, baseType: !371, size: 128, offset: 832)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !350, file: !351, line: 86, baseType: !381, size: 192, offset: 960)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !377, size: 192, elements: !382)
!382 = !{!383}
!383 = !DISubrange(count: 3)
!384 = !{!385}
!385 = !DISubrange(count: 1)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "fts_name", scope: !320, file: !315, line: 254, baseType: !387, offset: 2112)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, elements: !388)
!388 = !{!389}
!389 = !DISubrange(count: -1)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "fts_child", scope: !316, file: !315, line: 82, baseType: !319, size: 64, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "fts_array", scope: !316, file: !315, line: 83, baseType: !392, size: 64, offset: 128)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !316, file: !315, line: 84, baseType: !56, size: 64, offset: 192)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !316, file: !315, line: 85, baseType: !21, size: 64, offset: 256)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "fts_rfd", scope: !316, file: !315, line: 86, baseType: !30, size: 32, offset: 320)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cwd_fd", scope: !316, file: !315, line: 87, baseType: !30, size: 32, offset: 352)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !316, file: !315, line: 89, baseType: !145, size: 64, offset: 384)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "fts_nitems", scope: !316, file: !315, line: 90, baseType: !145, size: 64, offset: 448)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "fts_compar", scope: !316, file: !315, line: 91, baseType: !400, size: 64, offset: 512)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DISubroutineType(types: !402)
!402 = !{!30, !403, !403}
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !320)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "fts_options", scope: !316, file: !315, line: 160, baseType: !30, size: 32, offset: 576)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "fts_leaf_optimization_works_ht", scope: !316, file: !315, line: 169, baseType: !408, size: 64, offset: 640)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !315, line: 169, flags: DIFlagFwdDecl)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !316, file: !315, line: 191, baseType: !411, size: 64, offset: 704)
!411 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !316, file: !315, line: 171, size: 64, elements: !412)
!412 = !{!413, !414}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !411, file: !315, line: 184, baseType: !408, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !411, file: !315, line: 190, baseType: !415, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cycle_check_state", file: !417, line: 28, size: 256, elements: !418)
!417 = !DIFile(filename: "./lib/cycle-check.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!418 = !{!419, !424, !428}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "dev_ino", scope: !416, file: !417, line: 30, baseType: !420, size: 128)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !47, line: 7, size: 128, elements: !421)
!421 = !{!422, !423}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !420, file: !47, line: 9, baseType: !50, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !420, file: !47, line: 10, baseType: !56, size: 64, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "chdir_counter", scope: !416, file: !417, line: 31, baseType: !425, size: 64, offset: 128)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !426, line: 102, baseType: !427)
!426 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !53, line: 73, baseType: !54)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !416, file: !417, line: 32, baseType: !30, size: 32, offset: 192)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fd_ring", scope: !316, file: !315, line: 196, baseType: !430, size: 256, offset: 768)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "I_ring", file: !431, line: 39, baseType: !432)
!431 = !DIFile(filename: "./lib/i-ring.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "I_ring", file: !431, line: 31, size: 256, elements: !433)
!433 = !{!434, !438, !439, !440, !441}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "ir_data", scope: !432, file: !431, line: 33, baseType: !435, size: 128)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 128, elements: !436)
!436 = !{!437}
!437 = !DISubrange(count: 4)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "ir_default_val", scope: !432, file: !431, line: 34, baseType: !30, size: 32, offset: 128)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "ir_front", scope: !432, file: !431, line: 35, baseType: !7, size: 32, offset: 160)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "ir_back", scope: !432, file: !431, line: 36, baseType: !7, size: 32, offset: 192)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "ir_empty", scope: !432, file: !431, line: 37, baseType: !38, size: 8, offset: 224)
!442 = !{!443}
!443 = !DILocalVariable(name: "fts", arg: 1, scope: !310, file: !309, line: 50, type: !313)
!444 = !{!445}
!445 = !DIEnumerator(name: "HT_INITIAL_SIZE", value: 31, isUnsigned: true)
!446 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !297, line: 686, baseType: !7, size: 32, elements: !447)
!447 = !{!448}
!448 = !DIEnumerator(name: "DEV_TYPE_HT_INITIAL_SIZE", value: 13, isUnsigned: true)
!449 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !297, line: 640, baseType: !7, size: 32, elements: !450)
!450 = !{!451}
!451 = !DIEnumerator(name: "MIN_DIR_NLINK", value: 2, isUnsigned: true)
!452 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !328, line: 97, baseType: !7, size: 32, elements: !453)
!453 = !{!454, !455, !456, !457, !458, !459, !460, !461, !462}
!454 = !DIEnumerator(name: "DT_UNKNOWN", value: 0, isUnsigned: true)
!455 = !DIEnumerator(name: "DT_FIFO", value: 1, isUnsigned: true)
!456 = !DIEnumerator(name: "DT_CHR", value: 2, isUnsigned: true)
!457 = !DIEnumerator(name: "DT_DIR", value: 4, isUnsigned: true)
!458 = !DIEnumerator(name: "DT_BLK", value: 6, isUnsigned: true)
!459 = !DIEnumerator(name: "DT_REG", value: 8, isUnsigned: true)
!460 = !DIEnumerator(name: "DT_LNK", value: 10, isUnsigned: true)
!461 = !DIEnumerator(name: "DT_SOCK", value: 12, isUnsigned: true)
!462 = !DIEnumerator(name: "DT_WHT", value: 14, isUnsigned: true)
!463 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !297, line: 151, baseType: !7, size: 32, elements: !464)
!464 = !{!465}
!465 = !DIEnumerator(name: "_FTS_INODE_SORT_DIR_ENTRIES_THRESHOLD", value: 10000, isUnsigned: true)
!466 = !{!23, !343, !425, !21, !331, !467, !472}
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DISubroutineType(types: !469)
!469 = !{!30, !470, !470}
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !475)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTSENT", file: !315, line: 255, baseType: !320)
!476 = distinct !DICompileUnit(language: DW_LANG_C99, file: !477, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !97, retainedTypes: !478, splitDebugInlining: false, nameTableKind: None)
!477 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!478 = !{!145}
!479 = distinct !DICompileUnit(language: DW_LANG_C99, file: !480, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !97, splitDebugInlining: false, nameTableKind: None)
!480 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!481 = distinct !DICompileUnit(language: DW_LANG_C99, file: !482, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !97, splitDebugInlining: false, nameTableKind: None)
!482 = !DIFile(filename: "lib/cycle-check.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!483 = distinct !DICompileUnit(language: DW_LANG_C99, file: !484, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !97, splitDebugInlining: false, nameTableKind: None)
!484 = !DIFile(filename: "lib/open-safer.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!485 = distinct !DICompileUnit(language: DW_LANG_C99, file: !486, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !97, splitDebugInlining: false, nameTableKind: None)
!486 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!487 = distinct !DICompileUnit(language: DW_LANG_C99, file: !488, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !489, splitDebugInlining: false, nameTableKind: None)
!488 = !DIFile(filename: "lib/i-ring.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!489 = !{!490}
!490 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !431, line: 20, baseType: !7, size: 32, elements: !491)
!491 = !{!492}
!492 = !DIEnumerator(name: "I_RING_SIZE", value: 4, isUnsigned: true)
!493 = distinct !DICompileUnit(language: DW_LANG_C99, file: !494, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !495, retainedTypes: !272, splitDebugInlining: false, nameTableKind: None)
!494 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!495 = !{!496}
!496 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !497, line: 41, baseType: !7, size: 32, elements: !498)
!497 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!498 = !{!499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881}
!499 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!500 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!501 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!502 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!503 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!504 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!505 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!506 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!507 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!508 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!509 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!510 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!511 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!512 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!513 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!514 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!515 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!516 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!517 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!518 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!519 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!520 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!521 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!522 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!523 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!524 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!525 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!526 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!527 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!528 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!529 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!530 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!531 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!532 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!533 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!534 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!535 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!536 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!537 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!538 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!539 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!540 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!541 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!542 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!543 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!544 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!545 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!546 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!547 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!548 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!549 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!550 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!551 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!552 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!553 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!554 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!555 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!556 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!557 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!558 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!559 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!560 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!561 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!562 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!563 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!564 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!565 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!566 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!567 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!568 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!569 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!570 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!571 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!572 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!573 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!574 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!575 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!576 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!577 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!578 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!579 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!580 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!581 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!582 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!583 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!584 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!585 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!586 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!587 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!588 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!589 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!590 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!591 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!592 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!593 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!594 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!595 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!596 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!597 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!598 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!599 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!600 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!601 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!602 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!603 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!604 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!605 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!606 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!607 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!608 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!609 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!610 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!611 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!612 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!613 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!614 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!615 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!616 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!617 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!618 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!619 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!620 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!621 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!622 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!623 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!624 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!625 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!626 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!627 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!628 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!629 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!630 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!631 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!632 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!633 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!634 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!635 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!636 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!637 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!661 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!662 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!663 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!664 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!665 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!666 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!667 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!668 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!669 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!670 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!671 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!672 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!673 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!674 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!675 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!676 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!677 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!678 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!679 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!680 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!681 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!682 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!683 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!684 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!685 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!686 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!687 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!688 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!689 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!690 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!691 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!692 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!693 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!694 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!695 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!696 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!697 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!698 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!699 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!700 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!701 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!702 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!703 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!704 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!705 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!706 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!707 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!708 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!709 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!710 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!711 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!712 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!713 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!714 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!715 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!716 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!717 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!719 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!720 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!721 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!722 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!723 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!724 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!725 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!726 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!727 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!728 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!729 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!730 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!731 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!732 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!733 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!734 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!735 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!736 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!737 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!738 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!739 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!740 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!741 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!742 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!743 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!744 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!745 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!746 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!747 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!748 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!749 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!750 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!751 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!752 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!753 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!754 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!755 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!756 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!757 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!758 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!759 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!760 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!761 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!762 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!763 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!764 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!765 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!766 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!767 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!768 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!769 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!770 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!771 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!772 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!773 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!774 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!775 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!776 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!777 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!778 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!779 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!780 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!781 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!782 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!783 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!784 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!785 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!786 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!787 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!788 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!789 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!790 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!791 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!793 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!794 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!795 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!796 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!797 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!798 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!799 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!800 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!801 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!802 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!803 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!804 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!805 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!806 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!807 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!808 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!809 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!810 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!812 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!813 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!814 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!815 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!816 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!817 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!818 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!819 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!820 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!821 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!822 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!823 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!824 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!825 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!826 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!827 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!828 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!829 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!830 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!831 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!832 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!833 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!834 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!835 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!836 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!837 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!838 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!839 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!840 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!841 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!842 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!843 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!844 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!845 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!846 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!847 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!882 = distinct !DICompileUnit(language: DW_LANG_C99, file: !883, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !97, splitDebugInlining: false, nameTableKind: None)
!883 = !DIFile(filename: "lib/openat-die.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!884 = distinct !DICompileUnit(language: DW_LANG_C99, file: !885, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !97, splitDebugInlining: false, nameTableKind: None)
!885 = !DIFile(filename: "lib/openat-safer.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!886 = distinct !DICompileUnit(language: DW_LANG_C99, file: !887, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !97, splitDebugInlining: false, nameTableKind: None)
!887 = !DIFile(filename: "lib/opendirat.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!888 = distinct !DICompileUnit(language: DW_LANG_C99, file: !889, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !97, splitDebugInlining: false, nameTableKind: None)
!889 = !DIFile(filename: "lib/save-cwd.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!890 = distinct !DICompileUnit(language: DW_LANG_C99, file: !891, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !97, retainedTypes: !272, splitDebugInlining: false, nameTableKind: None)
!891 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!892 = distinct !DICompileUnit(language: DW_LANG_C99, file: !893, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !97, splitDebugInlining: false, nameTableKind: None)
!893 = !DIFile(filename: "lib/fd-safer.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!894 = distinct !DICompileUnit(language: DW_LANG_C99, file: !895, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !97, retainedTypes: !116, splitDebugInlining: false, nameTableKind: None)
!895 = !DIFile(filename: "lib/chdir-long.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!896 = distinct !DICompileUnit(language: DW_LANG_C99, file: !897, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !97, splitDebugInlining: false, nameTableKind: None)
!897 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!898 = distinct !DICompileUnit(language: DW_LANG_C99, file: !899, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !97, retainedTypes: !272, splitDebugInlining: false, nameTableKind: None)
!899 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!900 = distinct !DICompileUnit(language: DW_LANG_C99, file: !901, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !97, retainedTypes: !272, splitDebugInlining: false, nameTableKind: None)
!901 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!902 = distinct !DICompileUnit(language: DW_LANG_C99, file: !903, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !97, splitDebugInlining: false, nameTableKind: None)
!903 = !DIFile(filename: "lib/dup-safer.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!904 = !{!"clang version 12.0.1"}
!905 = !{i32 7, !"Dwarf Version", i32 4}
!906 = !{i32 2, !"Debug Info Version", i32 3}
!907 = !{i32 1, !"wchar_size", i32 4}
!908 = !{i32 7, !"PIC Level", i32 2}
!909 = !{i32 7, !"PIE Level", i32 2}
!910 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 347, type: !911, scopeLine: 348, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !913)
!911 = !DISubroutineType(types: !912)
!912 = !{null, !30}
!913 = !{!914}
!914 = !DILocalVariable(name: "status", arg: 1, scope: !910, file: !3, line: 347, type: !30)
!915 = !DILocation(line: 0, scope: !910)
!916 = !DILocation(line: 349, column: 14, scope: !917)
!917 = distinct !DILexicalBlock(scope: !910, file: !3, line: 349, column: 7)
!918 = !DILocation(line: 349, column: 7, scope: !910)
!919 = !DILocation(line: 350, column: 5, scope: !920)
!920 = distinct !DILexicalBlock(scope: !917, file: !3, line: 350, column: 5)
!921 = !{!922, !922, i64 0}
!922 = !{!"any pointer", !923, i64 0}
!923 = !{!"omnipotent char", !924, i64 0}
!924 = !{!"Simple C/C++ TBAA"}
!925 = !DILocation(line: 353, column: 7, scope: !926)
!926 = distinct !DILexicalBlock(scope: !917, file: !3, line: 352, column: 5)
!927 = !DILocation(line: 359, column: 7, scope: !926)
!928 = !DILocation(line: 590, column: 3, scope: !929, inlinedAt: !933)
!929 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !930, file: !930, line: 588, type: !931, scopeLine: 589, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !97)
!930 = !DIFile(filename: "src/system.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!931 = !DISubroutineType(types: !932)
!932 = !{null}
!933 = distinct !DILocation(line: 364, column: 7, scope: !926)
!934 = !DILocation(line: 366, column: 7, scope: !926)
!935 = !DILocation(line: 371, column: 7, scope: !926)
!936 = !DILocation(line: 377, column: 7, scope: !926)
!937 = !DILocation(line: 381, column: 7, scope: !926)
!938 = !DILocation(line: 385, column: 7, scope: !926)
!939 = !DILocation(line: 388, column: 7, scope: !926)
!940 = !DILocation(line: 391, column: 7, scope: !926)
!941 = !DILocation(line: 404, column: 7, scope: !926)
!942 = !DILocation(line: 405, column: 7, scope: !926)
!943 = !DILocalVariable(name: "program", arg: 1, scope: !944, file: !930, line: 634, type: !69)
!944 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !930, file: !930, line: 634, type: !945, scopeLine: 635, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !947)
!945 = !DISubroutineType(types: !946)
!946 = !{null, !69}
!947 = !{!943, !948, !957, !958, !960}
!948 = !DILocalVariable(name: "infomap", scope: !944, file: !930, line: 636, type: !949)
!949 = !DICompositeType(tag: DW_TAG_array_type, baseType: !950, size: 896, elements: !955)
!950 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !951)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !944, file: !930, line: 636, size: 128, elements: !952)
!952 = !{!953, !954}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !951, file: !930, line: 636, baseType: !69, size: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !951, file: !930, line: 636, baseType: !69, size: 64, offset: 64)
!955 = !{!956}
!956 = !DISubrange(count: 7)
!957 = !DILocalVariable(name: "node", scope: !944, file: !930, line: 646, type: !69)
!958 = !DILocalVariable(name: "map_prog", scope: !944, file: !930, line: 647, type: !959)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!960 = !DILocalVariable(name: "lc_messages", scope: !944, file: !930, line: 659, type: !69)
!961 = !DILocation(line: 0, scope: !944, inlinedAt: !962)
!962 = distinct !DILocation(line: 406, column: 7, scope: !926)
!963 = !DILocation(line: 636, column: 3, scope: !944, inlinedAt: !962)
!964 = !DILocation(line: 636, column: 67, scope: !944, inlinedAt: !962)
!965 = !DILocation(line: 647, column: 36, scope: !944, inlinedAt: !962)
!966 = !DILocation(line: 649, column: 3, scope: !944, inlinedAt: !962)
!967 = !DILocation(line: 649, column: 33, scope: !944, inlinedAt: !962)
!968 = !DILocation(line: 650, column: 13, scope: !944, inlinedAt: !962)
!969 = !DILocation(line: 649, column: 20, scope: !944, inlinedAt: !962)
!970 = !{!971, !922, i64 0}
!971 = !{!"infomap", !922, i64 0, !922, i64 8}
!972 = !DILocation(line: 649, column: 10, scope: !944, inlinedAt: !962)
!973 = !DILocation(line: 649, column: 28, scope: !944, inlinedAt: !962)
!974 = distinct !{!974, !966, !968, !975}
!975 = !{!"llvm.loop.mustprogress"}
!976 = !DILocation(line: 652, column: 17, scope: !977, inlinedAt: !962)
!977 = distinct !DILexicalBlock(scope: !944, file: !930, line: 652, column: 7)
!978 = !{!971, !922, i64 8}
!979 = !DILocation(line: 652, column: 7, scope: !977, inlinedAt: !962)
!980 = !DILocation(line: 652, column: 7, scope: !944, inlinedAt: !962)
!981 = !DILocation(line: 655, column: 3, scope: !944, inlinedAt: !962)
!982 = !DILocation(line: 659, column: 29, scope: !944, inlinedAt: !962)
!983 = !DILocation(line: 660, column: 7, scope: !984, inlinedAt: !962)
!984 = distinct !DILexicalBlock(scope: !944, file: !930, line: 660, column: 7)
!985 = !DILocation(line: 660, column: 19, scope: !984, inlinedAt: !962)
!986 = !DILocation(line: 660, column: 22, scope: !984, inlinedAt: !962)
!987 = !DILocation(line: 660, column: 7, scope: !944, inlinedAt: !962)
!988 = !DILocation(line: 666, column: 7, scope: !989, inlinedAt: !962)
!989 = distinct !DILexicalBlock(scope: !984, file: !930, line: 661, column: 5)
!990 = !DILocation(line: 668, column: 5, scope: !989, inlinedAt: !962)
!991 = !DILocation(line: 669, column: 3, scope: !944, inlinedAt: !962)
!992 = !DILocation(line: 671, column: 3, scope: !944, inlinedAt: !962)
!993 = !DILocation(line: 673, column: 1, scope: !944, inlinedAt: !962)
!994 = !DILocation(line: 408, column: 3, scope: !910)
!995 = !DISubprogram(name: "dcgettext", scope: !996, file: !996, line: 51, type: !997, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!996 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!997 = !DISubroutineType(types: !998)
!998 = !{!21, !69, !69, !30}
!999 = !DISubprogram(name: "fputs_unlocked", scope: !1000, file: !1000, line: 667, type: !1001, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!1000 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!30, !69, !1003}
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !1005, line: 49, size: 1728, elements: !1006)
!1005 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!1006 = !{!1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1022, !1023, !1024, !1025, !1026, !1027, !1029, !1031, !1034, !1036, !1039, !1042, !1043, !1044, !1045, !1046}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1004, file: !1005, line: 51, baseType: !30, size: 32)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1004, file: !1005, line: 54, baseType: !21, size: 64, offset: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1004, file: !1005, line: 55, baseType: !21, size: 64, offset: 128)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1004, file: !1005, line: 56, baseType: !21, size: 64, offset: 192)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1004, file: !1005, line: 57, baseType: !21, size: 64, offset: 256)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1004, file: !1005, line: 58, baseType: !21, size: 64, offset: 320)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1004, file: !1005, line: 59, baseType: !21, size: 64, offset: 384)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1004, file: !1005, line: 60, baseType: !21, size: 64, offset: 448)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1004, file: !1005, line: 61, baseType: !21, size: 64, offset: 512)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1004, file: !1005, line: 64, baseType: !21, size: 64, offset: 576)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1004, file: !1005, line: 65, baseType: !21, size: 64, offset: 640)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1004, file: !1005, line: 66, baseType: !21, size: 64, offset: 704)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1004, file: !1005, line: 68, baseType: !1020, size: 64, offset: 768)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1021 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !1005, line: 36, flags: DIFlagFwdDecl)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1004, file: !1005, line: 70, baseType: !1003, size: 64, offset: 832)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1004, file: !1005, line: 72, baseType: !30, size: 32, offset: 896)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1004, file: !1005, line: 73, baseType: !30, size: 32, offset: 928)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1004, file: !1005, line: 74, baseType: !365, size: 64, offset: 960)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1004, file: !1005, line: 77, baseType: !144, size: 16, offset: 1024)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1004, file: !1005, line: 78, baseType: !1028, size: 8, offset: 1040)
!1028 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1004, file: !1005, line: 79, baseType: !1030, size: 8, offset: 1048)
!1030 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 8, elements: !384)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1004, file: !1005, line: 81, baseType: !1032, size: 64, offset: 1088)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !1005, line: 43, baseType: null)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1004, file: !1005, line: 89, baseType: !1035, size: 64, offset: 1152)
!1035 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !53, line: 153, baseType: !331)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1004, file: !1005, line: 91, baseType: !1037, size: 64, offset: 1216)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1038 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !1005, line: 37, flags: DIFlagFwdDecl)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1004, file: !1005, line: 92, baseType: !1040, size: 64, offset: 1280)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !1005, line: 38, flags: DIFlagFwdDecl)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1004, file: !1005, line: 93, baseType: !1003, size: 64, offset: 1344)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1004, file: !1005, line: 94, baseType: !23, size: 64, offset: 1408)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1004, file: !1005, line: 95, baseType: !145, size: 64, offset: 1472)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1004, file: !1005, line: 96, baseType: !30, size: 32, offset: 1536)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1004, file: !1005, line: 98, baseType: !1047, size: 160, offset: 1568)
!1047 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 160, elements: !1048)
!1048 = !{!1049}
!1049 = !DISubrange(count: 20)
!1050 = !DISubprogram(name: "setlocale", scope: !1051, file: !1051, line: 122, type: !1052, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!1051 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!1052 = !DISubroutineType(types: !1053)
!1053 = !{!21, !30, !69}
!1054 = !DILocation(line: 0, scope: !27)
!1055 = !DILocation(line: 428, column: 21, scope: !27)
!1056 = !DILocation(line: 428, column: 3, scope: !27)
