source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.Active_dir = type { i64, i64, %struct._ftsent* }
%struct.FTS = type { %struct._ftsent*, %struct._ftsent*, %struct._ftsent**, i64, i8*, i32, i32, i64, i64, i32 (%struct._ftsent**, %struct._ftsent**)*, i32, %struct.hash_table*, %union.anon, %struct.I_ring }
%struct.I_ring = type { [4 x i32], i32, i32, i32, i8 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__dirstream = type opaque
%struct.__fsid_t = type { [2 x i32] }
%struct.__mbstate_t = type { i32, %union.anon.8 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct._ftsent = type { %struct._ftsent*, %struct._ftsent*, %struct._ftsent*, %struct.__dirstream*, i64, i8*, i8*, i8*, i32, i32, i64, %struct.FTS*, i64, i64, i64, i16, i16, i16, [1 x %struct.stat], [0 x i8] }
%struct.cycle_check_state = type { %struct.dev_ino, i64, i32 }
%struct.dev_ino = type { i64, i64 }
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%struct.hash_entry = type { i8*, %struct.hash_entry* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 72, type: !79, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !20, globals: !24)
!3 = !DIFile(filename: "src/chcon.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!9 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!20 = !{!21, !23}
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!24 = !{!25, !58, !60, !62, !64, !67, !71, !73, !75, !77, !0}
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "dev_ino_buf", scope: !27, file: !3, line: 573, type: !46, isLocal: true, isDefinition: true)
!27 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 411, type: !28, isDefinition: true, scopeLine: 412, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !32)
!28 = !DISubroutineType(types: !29)
!29 = !{!30, !30, !31}
!30 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!32 = !{!33, !34, !35, !36, !37, !39, !40, !41, !42, !43}
!33 = !DILocalVariable(name: "argc", arg: 1, scope: !27, file: !3, line: 411, type: !30)
!34 = !DILocalVariable(name: "argv", arg: 2, scope: !27, file: !3, line: 411, type: !31)
!35 = !DILocalVariable(name: "bit_flags", scope: !27, file: !3, line: 414, type: !30)
!36 = !DILocalVariable(name: "dereference", scope: !27, file: !3, line: 418, type: !30)
!37 = !DILocalVariable(name: "ok", scope: !27, file: !3, line: 420, type: !38)
!38 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!39 = !DILocalVariable(name: "preserve_root", scope: !27, file: !3, line: 421, type: !38)
!40 = !DILocalVariable(name: "component_specified", scope: !27, file: !3, line: 422, type: !38)
!41 = !DILocalVariable(name: "reference_file", scope: !27, file: !3, line: 423, type: !21)
!42 = !DILocalVariable(name: "optc", scope: !27, file: !3, line: 424, type: !30)
!43 = !DILocalVariable(name: "ref_context", scope: !44, file: !3, line: 544, type: !21)
!44 = distinct !DILexicalBlock(scope: !45, file: !3, line: 543, column: 5)
!45 = distinct !DILexicalBlock(scope: !27, file: !3, line: 542, column: 7)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !47, line: 7, size: 128, elements: !48)
!47 = !DIFile(filename: "./lib/dev-ino.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!48 = !{!49, !55}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !46, file: !47, line: 9, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !51, line: 47, baseType: !52)
!51 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !53, line: 146, baseType: !54)
!53 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!54 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !46, file: !47, line: 10, baseType: !56, size: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !51, line: 59, baseType: !57)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !53, line: 143, baseType: !54)
!58 = !DIGlobalVariableExpression(var: !59, expr: !DIExpression())
!59 = distinct !DIGlobalVariable(name: "affect_symlink_referent", scope: !2, file: !3, line: 41, type: !38, isLocal: true, isDefinition: true)
!60 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression())
!61 = distinct !DIGlobalVariable(name: "recurse", scope: !2, file: !3, line: 44, type: !38, isLocal: true, isDefinition: true)
!62 = !DIGlobalVariableExpression(var: !63, expr: !DIExpression())
!63 = distinct !DIGlobalVariable(name: "verbose", scope: !2, file: !3, line: 47, type: !38, isLocal: true, isDefinition: true)
!64 = !DIGlobalVariableExpression(var: !65, expr: !DIExpression())
!65 = distinct !DIGlobalVariable(name: "root_dev_ino", scope: !2, file: !3, line: 51, type: !66, isLocal: true, isDefinition: true)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!67 = !DIGlobalVariableExpression(var: !68, expr: !DIExpression())
!68 = distinct !DIGlobalVariable(name: "specified_context", scope: !2, file: !3, line: 54, type: !69, isLocal: true, isDefinition: true)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(name: "specified_user", scope: !2, file: !3, line: 57, type: !69, isLocal: true, isDefinition: true)
!73 = !DIGlobalVariableExpression(var: !74, expr: !DIExpression())
!74 = distinct !DIGlobalVariable(name: "specified_role", scope: !2, file: !3, line: 58, type: !69, isLocal: true, isDefinition: true)
!75 = !DIGlobalVariableExpression(var: !76, expr: !DIExpression())
!76 = distinct !DIGlobalVariable(name: "specified_range", scope: !2, file: !3, line: 59, type: !69, isLocal: true, isDefinition: true)
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "specified_type", scope: !2, file: !3, line: 60, type: !69, isLocal: true, isDefinition: true)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 3584, elements: !89)
!80 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !81)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !82, line: 50, size: 256, elements: !83)
!82 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!83 = !{!84, !85, !86, !88}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !81, file: !82, line: 52, baseType: !69, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !81, file: !82, line: 55, baseType: !30, size: 32, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !81, file: !82, line: 56, baseType: !87, size: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !81, file: !82, line: 57, baseType: !30, size: 32, offset: 192)
!89 = !{!90}
!90 = !DISubrange(count: 14)
!91 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!92 = !DIGlobalVariableExpression(var: !63, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!93 = !DIGlobalVariableExpression(var: !94, expr: !DIExpression())
!94 = distinct !DIGlobalVariable(name: "Version", scope: !95, file: !96, line: 2, type: !69, isDefinition: true)
!95 = distinct !DICompileUnit(language: DW_LANG_C99, file: !96, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !97, globals: !98)
!96 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!97 = !{}
!98 = !{!93}
!99 = !DIGlobalVariableExpression(var: !100, expr: !DIExpression())
!100 = distinct !DIGlobalVariable(name: "file_name", scope: !101, file: !106, line: 46, type: !69, isLocal: true, isDefinition: true)
!101 = distinct !DICompileUnit(language: DW_LANG_C99, file: !102, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !97, globals: !103)
!102 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!103 = !{!99, !104}
!104 = !DIGlobalVariableExpression(var: !105, expr: !DIExpression())
!105 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !101, file: !106, line: 56, type: !38, isLocal: true, isDefinition: true)
!106 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!107 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression())
!108 = distinct !DIGlobalVariable(name: "exit_failure", scope: !109, file: !112, line: 24, type: !113, isDefinition: true)
!109 = distinct !DICompileUnit(language: DW_LANG_C99, file: !110, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !97, globals: !111)
!110 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!111 = !{!107}
!112 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!113 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !30)
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(name: "program_name", scope: !116, file: !120, line: 33, type: !69, isDefinition: true)
!116 = distinct !DICompileUnit(language: DW_LANG_C99, file: !117, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !97, retainedTypes: !118, globals: !119)
!117 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!118 = !{!23, !21}
!119 = !{!114}
!120 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !123, file: !153, line: 85, type: !188, isDefinition: true)
!123 = distinct !DICompileUnit(language: DW_LANG_C99, file: !124, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !125, retainedTypes: !146, globals: !150)
!124 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!125 = !{!5, !126, !131}
!126 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, baseType: !7, size: 32, elements: !127)
!127 = !{!128, !129, !130}
!128 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!129 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!130 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!131 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !132, line: 46, baseType: !7, size: 32, elements: !133)
!132 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!133 = !{!134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145}
!134 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!135 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!136 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!137 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!138 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!139 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!140 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!141 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!142 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!143 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!144 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!145 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!146 = !{!30, !147, !148, !21}
!147 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !149, line: 62, baseType: !54)
!149 = !DIFile(filename: "/usr/lib/clang/7.0.0/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!150 = !{!121, !151, !158, !170, !172, !177, !184, !186}
!151 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression())
!152 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !123, file: !153, line: 101, type: !154, isDefinition: true)
!153 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 320, elements: !156)
!155 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!156 = !{!157}
!157 = !DISubrange(count: 10)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !123, file: !153, line: 1052, type: !160, isDefinition: true)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !153, line: 65, size: 448, elements: !161)
!161 = !{!162, !163, !164, !168, !169}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !160, file: !153, line: 68, baseType: !5, size: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !160, file: !153, line: 71, baseType: !30, size: 32, offset: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !160, file: !153, line: 75, baseType: !165, size: 256, offset: 64)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 8)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !160, file: !153, line: 78, baseType: !69, size: 64, offset: 320)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !160, file: !153, line: 81, baseType: !69, size: 64, offset: 384)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !123, file: !153, line: 116, type: !160, isLocal: true, isDefinition: true)
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(name: "slot0", scope: !123, file: !153, line: 842, type: !174, isLocal: true, isDefinition: true)
!174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2048, elements: !175)
!175 = !{!176}
!176 = !DISubrange(count: 256)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "slotvec", scope: !123, file: !153, line: 845, type: !179, isLocal: true, isDefinition: true)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !153, line: 834, size: 128, elements: !181)
!181 = !{!182, !183}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !180, file: !153, line: 836, baseType: !148, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !180, file: !153, line: 837, baseType: !21, size: 64, offset: 64)
!184 = !DIGlobalVariableExpression(var: !185, expr: !DIExpression())
!185 = distinct !DIGlobalVariable(name: "nslots", scope: !123, file: !153, line: 843, type: !30, isLocal: true, isDefinition: true)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "slotvec0", scope: !123, file: !153, line: 844, type: !180, isLocal: true, isDefinition: true)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 704, elements: !190)
!189 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!190 = !{!191}
!191 = !DISubrange(count: 11)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !194, file: !197, line: 26, type: !198, isDefinition: true)
!194 = distinct !DICompileUnit(language: DW_LANG_C99, file: !195, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !97, globals: !196)
!195 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!196 = !{!192}
!197 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 376, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 47)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "default_tuning", scope: !203, file: !207, line: 130, type: !208, isLocal: true, isDefinition: true)
!203 = distinct !DICompileUnit(language: DW_LANG_C99, file: !204, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !97, retainedTypes: !205, globals: !206)
!204 = !DIFile(filename: "./lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!205 = !{!54, !23, !148}
!206 = !{!201}
!207 = !DIFile(filename: "lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!208 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !210, line: 65, baseType: !211)
!210 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !210, line: 53, size: 160, elements: !212)
!212 = !{!213, !215, !216, !217, !218}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !211, file: !210, line: 58, baseType: !214, size: 32)
!214 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !211, file: !210, line: 59, baseType: !214, size: 32, offset: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !211, file: !210, line: 60, baseType: !214, size: 32, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !211, file: !210, line: 61, baseType: !214, size: 32, offset: 96)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !211, file: !210, line: 62, baseType: !38, size: 8, offset: 128)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !221, file: !222, line: 339, type: !30, isLocal: true, isDefinition: true)
!221 = distinct !DISubprogram(name: "rpl_fcntl", scope: !222, file: !222, line: 276, type: !223, isDefinition: true, scopeLine: 277, flags: DIFlagPrototyped, isOptimized: true, unit: !225, retainedNodes: !228)
!222 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!223 = !DISubroutineType(types: !224)
!224 = !{!30, !30, !30, null}
!225 = distinct !DICompileUnit(language: DW_LANG_C99, file: !226, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !97, globals: !227)
!226 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!227 = !{!219}
!228 = !{!229, !230, !231, !244, !245, !248, !251, !254}
!229 = !DILocalVariable(name: "fd", arg: 1, scope: !221, file: !222, line: 276, type: !30)
!230 = !DILocalVariable(name: "action", arg: 2, scope: !221, file: !222, line: 276, type: !30)
!231 = !DILocalVariable(name: "arg", scope: !221, file: !222, line: 278, type: !232)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !233, line: 30, baseType: !234)
!233 = !DIFile(filename: "/usr/lib/clang/7.0.0/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !226, line: 278, baseType: !235)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 192, elements: !242)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !226, line: 278, size: 192, elements: !237)
!237 = !{!238, !239, !240, !241}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !236, file: !226, line: 278, baseType: !7, size: 32)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !236, file: !226, line: 278, baseType: !7, size: 32, offset: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !236, file: !226, line: 278, baseType: !23, size: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !236, file: !226, line: 278, baseType: !23, size: 64, offset: 128)
!242 = !{!243}
!243 = !DISubrange(count: 1)
!244 = !DILocalVariable(name: "result", scope: !221, file: !222, line: 279, type: !30)
!245 = !DILocalVariable(name: "target", scope: !246, file: !222, line: 326, type: !30)
!246 = distinct !DILexicalBlock(scope: !247, file: !222, line: 325, column: 7)
!247 = distinct !DILexicalBlock(scope: !221, file: !222, line: 282, column: 5)
!248 = !DILocalVariable(name: "flags", scope: !249, file: !222, line: 363, type: !30)
!249 = distinct !DILexicalBlock(scope: !250, file: !222, line: 362, column: 11)
!250 = distinct !DILexicalBlock(scope: !246, file: !222, line: 361, column: 13)
!251 = !DILocalVariable(name: "saved_errno", scope: !252, file: !222, line: 366, type: !30)
!252 = distinct !DILexicalBlock(scope: !253, file: !222, line: 365, column: 15)
!253 = distinct !DILexicalBlock(scope: !249, file: !222, line: 364, column: 17)
!254 = !DILocalVariable(name: "p", scope: !255, file: !222, line: 408, type: !23)
!255 = distinct !DILexicalBlock(scope: !247, file: !222, line: 406, column: 7)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(name: "proc_status", scope: !258, file: !259, line: 65, type: !30, isLocal: true, isDefinition: true)
!258 = distinct !DISubprogram(name: "openat_proc_name", scope: !259, file: !259, line: 44, type: !260, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: true, unit: !262, retainedNodes: !269)
!259 = !DIFile(filename: "lib/openat-proc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!260 = !DISubroutineType(types: !261)
!261 = !{!21, !21, !30, !69}
!262 = distinct !DICompileUnit(language: DW_LANG_C99, file: !263, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !264, globals: !268)
!263 = !DIFile(filename: "./lib/openat-proc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!264 = !{!265}
!265 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !258, file: !259, line: 59, baseType: !7, size: 32, elements: !266)
!266 = !{!267}
!267 = !DIEnumerator(name: "PROC_SELF_FD_DIR_SIZE_BOUND", value: 27, isUnsigned: true)
!268 = !{!256}
!269 = !{!270, !271, !272, !273, !274, !275, !279, !285}
!270 = !DILocalVariable(name: "buf", arg: 1, scope: !258, file: !259, line: 44, type: !21)
!271 = !DILocalVariable(name: "fd", arg: 2, scope: !258, file: !259, line: 44, type: !30)
!272 = !DILocalVariable(name: "file", arg: 3, scope: !258, file: !259, line: 44, type: !69)
!273 = !DILocalVariable(name: "result", scope: !258, file: !259, line: 46, type: !21)
!274 = !DILocalVariable(name: "dirlen", scope: !258, file: !259, line: 47, type: !30)
!275 = !DILocalVariable(name: "proc_self_fd", scope: !276, file: !259, line: 76, type: !30)
!276 = distinct !DILexicalBlock(scope: !277, file: !259, line: 67, column: 7)
!277 = distinct !DILexicalBlock(scope: !278, file: !259, line: 66, column: 9)
!278 = distinct !DILexicalBlock(scope: !258, file: !259, line: 58, column: 3)
!279 = !DILocalVariable(name: "dotdot_buf", scope: !280, file: !259, line: 87, type: !282)
!280 = distinct !DILexicalBlock(scope: !281, file: !259, line: 81, column: 11)
!281 = distinct !DILexicalBlock(scope: !276, file: !259, line: 78, column: 13)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 256, elements: !283)
!283 = !{!284}
!284 = !DISubrange(count: 32)
!285 = !DILocalVariable(name: "bufsize", scope: !286, file: !259, line: 98, type: !148)
!286 = distinct !DILexicalBlock(scope: !287, file: !259, line: 97, column: 7)
!287 = distinct !DILexicalBlock(scope: !278, file: !259, line: 94, column: 9)
!288 = distinct !DICompileUnit(language: DW_LANG_C99, file: !289, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !97)
!289 = !DIFile(filename: "./lib/root-dev-ino.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!290 = distinct !DICompileUnit(language: DW_LANG_C99, file: !291, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !292, retainedTypes: !297)
!291 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!292 = !{!293}
!293 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !294, line: 41, baseType: !7, size: 32, elements: !295)
!294 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!295 = !{!296}
!296 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2018, isUnsigned: true)
!297 = !{!23}
!298 = distinct !DICompileUnit(language: DW_LANG_C99, file: !299, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !300, retainedTypes: !314)
!299 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!300 = !{!301}
!301 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !303, file: !302, line: 186, baseType: !7, size: 32, elements: !312)
!302 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!303 = distinct !DISubprogram(name: "x2nrealloc", scope: !302, file: !302, line: 174, type: !304, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: true, unit: !298, retainedNodes: !307)
!304 = !DISubroutineType(types: !305)
!305 = !{!23, !23, !306, !148}
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!307 = !{!308, !309, !310, !311}
!308 = !DILocalVariable(name: "p", arg: 1, scope: !303, file: !302, line: 174, type: !23)
!309 = !DILocalVariable(name: "pn", arg: 2, scope: !303, file: !302, line: 174, type: !306)
!310 = !DILocalVariable(name: "s", arg: 3, scope: !303, file: !302, line: 174, type: !148)
!311 = !DILocalVariable(name: "n", scope: !303, file: !302, line: 176, type: !148)
!312 = !{!313}
!313 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!314 = !{!148, !21, !23}
!315 = distinct !DICompileUnit(language: DW_LANG_C99, file: !316, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !97)
!316 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!317 = distinct !DICompileUnit(language: DW_LANG_C99, file: !318, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !97, retainedTypes: !297)
!318 = !DIFile(filename: "./lib/xfts.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!319 = distinct !DICompileUnit(language: DW_LANG_C99, file: !320, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !97, retainedTypes: !297)
!320 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!321 = distinct !DICompileUnit(language: DW_LANG_C99, file: !322, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !323, retainedTypes: !490)
!322 = !DIFile(filename: "./lib/fts.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!323 = !{!324, !329, !334, !470, !473, !476, !487}
!324 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Fts_stat", file: !325, line: 155, baseType: !7, size: 32, elements: !326)
!325 = !DIFile(filename: "lib/fts.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!326 = !{!327, !328}
!327 = !DIEnumerator(name: "FTS_NO_STAT_REQUIRED", value: 1, isUnsigned: true)
!328 = !DIEnumerator(name: "FTS_STAT_REQUIRED", value: 2, isUnsigned: true)
!329 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "leaf_optimization", file: !325, line: 669, baseType: !7, size: 32, elements: !330)
!330 = !{!331, !332, !333}
!331 = !DIEnumerator(name: "NO_LEAF_OPTIMIZATION", value: 0, isUnsigned: true)
!332 = !DIEnumerator(name: "OK_LEAF_OPTIMIZATION", value: 1, isUnsigned: true)
!333 = !DIEnumerator(name: "NOSTAT_LEAF_OPTIMIZATION", value: 2, isUnsigned: true)
!334 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !336, file: !335, line: 54, baseType: !7, size: 32, elements: !468)
!335 = !DIFile(filename: "./lib/fts-cycle.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!336 = distinct !DISubprogram(name: "setup_dir", scope: !335, file: !335, line: 50, type: !337, isLocal: true, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: true, unit: !321, retainedNodes: !466)
!337 = !DISubroutineType(types: !338)
!338 = !{!38, !339}
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !341, line: 199, baseType: !342)
!341 = !DIFile(filename: "./lib/fts_.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !341, line: 80, size: 1024, elements: !343)
!343 = !{!344, !414, !415, !417, !418, !419, !420, !421, !422, !423, !430, !431, !434, !453}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !342, file: !341, line: 81, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !341, line: 201, size: 2112, elements: !347)
!347 = !{!348, !349, !350, !351, !356, !358, !359, !360, !361, !362, !363, !364, !365, !367, !368, !371, !372, !373, !374, !410}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !346, file: !341, line: 202, baseType: !345, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !346, file: !341, line: 203, baseType: !345, size: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !346, file: !341, line: 204, baseType: !345, size: 64, offset: 128)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !346, file: !341, line: 205, baseType: !352, size: 64, offset: 192)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !354, line: 127, baseType: !355)
!354 = !DIFile(filename: "/usr/include/dirent.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !354, line: 127, flags: DIFlagFwdDecl)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !346, file: !341, line: 208, baseType: !357, size: 64, offset: 256)
!357 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !346, file: !341, line: 209, baseType: !23, size: 64, offset: 320)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !346, file: !341, line: 210, baseType: !21, size: 64, offset: 384)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !346, file: !341, line: 211, baseType: !21, size: 64, offset: 448)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !346, file: !341, line: 212, baseType: !30, size: 32, offset: 512)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !346, file: !341, line: 213, baseType: !30, size: 32, offset: 544)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !346, file: !341, line: 214, baseType: !148, size: 64, offset: 576)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !346, file: !341, line: 216, baseType: !339, size: 64, offset: 640)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !346, file: !341, line: 220, baseType: !366, size: 64, offset: 704)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !149, line: 51, baseType: !357)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !346, file: !341, line: 222, baseType: !148, size: 64, offset: 768)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "fts_n_dirs_remaining", scope: !346, file: !341, line: 227, baseType: !369, size: 64, offset: 832)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !51, line: 74, baseType: !370)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !53, line: 149, baseType: !54)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !346, file: !341, line: 243, baseType: !147, size: 16, offset: 896)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !346, file: !341, line: 247, baseType: !147, size: 16, offset: 912)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !346, file: !341, line: 253, baseType: !147, size: 16, offset: 928)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !346, file: !341, line: 255, baseType: !375, size: 1152, offset: 960)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !376, size: 1152, elements: !242)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !377, line: 46, size: 1152, elements: !378)
!377 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!378 = !{!379, !380, !381, !382, !384, !386, !388, !389, !390, !392, !394, !396, !404, !405, !406}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !376, file: !377, line: 48, baseType: !57, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !376, file: !377, line: 53, baseType: !52, size: 64, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !376, file: !377, line: 61, baseType: !370, size: 64, offset: 128)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !376, file: !377, line: 62, baseType: !383, size: 32, offset: 192)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !53, line: 148, baseType: !7)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !376, file: !377, line: 64, baseType: !385, size: 32, offset: 224)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !53, line: 144, baseType: !7)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !376, file: !377, line: 65, baseType: !387, size: 32, offset: 256)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !53, line: 145, baseType: !7)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !376, file: !377, line: 67, baseType: !30, size: 32, offset: 288)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !376, file: !377, line: 69, baseType: !57, size: 64, offset: 320)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !376, file: !377, line: 74, baseType: !391, size: 64, offset: 384)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !53, line: 150, baseType: !357)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !376, file: !377, line: 78, baseType: !393, size: 64, offset: 448)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !53, line: 172, baseType: !357)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !376, file: !377, line: 80, baseType: !395, size: 64, offset: 512)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !53, line: 177, baseType: !357)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !376, file: !377, line: 91, baseType: !397, size: 128, offset: 576)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !398, line: 9, size: 128, elements: !399)
!398 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!399 = !{!400, !402}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !397, file: !398, line: 11, baseType: !401, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !53, line: 158, baseType: !357)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !397, file: !398, line: 12, baseType: !403, size: 64, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !53, line: 194, baseType: !357)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !376, file: !377, line: 92, baseType: !397, size: 128, offset: 704)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !376, file: !377, line: 93, baseType: !397, size: 128, offset: 832)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !376, file: !377, line: 106, baseType: !407, size: 192, offset: 960)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !403, size: 192, elements: !408)
!408 = !{!409}
!409 = !DISubrange(count: 3)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "fts_name", scope: !346, file: !341, line: 256, baseType: !411, offset: 2112)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, elements: !412)
!412 = !{!413}
!413 = !DISubrange(count: -1)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "fts_child", scope: !342, file: !341, line: 82, baseType: !345, size: 64, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "fts_array", scope: !342, file: !341, line: 83, baseType: !416, size: 64, offset: 128)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !342, file: !341, line: 84, baseType: !56, size: 64, offset: 192)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !342, file: !341, line: 85, baseType: !21, size: 64, offset: 256)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "fts_rfd", scope: !342, file: !341, line: 86, baseType: !30, size: 32, offset: 320)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cwd_fd", scope: !342, file: !341, line: 87, baseType: !30, size: 32, offset: 352)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !342, file: !341, line: 89, baseType: !148, size: 64, offset: 384)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "fts_nitems", scope: !342, file: !341, line: 90, baseType: !148, size: 64, offset: 448)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "fts_compar", scope: !342, file: !341, line: 91, baseType: !424, size: 64, offset: 512)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DISubroutineType(types: !426)
!426 = !{!30, !427, !427}
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !346)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "fts_options", scope: !342, file: !341, line: 162, baseType: !30, size: 32, offset: 576)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "fts_leaf_optimization_works_ht", scope: !342, file: !341, line: 171, baseType: !432, size: 64, offset: 640)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !341, line: 171, flags: DIFlagFwdDecl)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !342, file: !341, line: 193, baseType: !435, size: 64, offset: 704)
!435 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !342, file: !341, line: 173, size: 64, elements: !436)
!436 = !{!437, !438}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !435, file: !341, line: 186, baseType: !432, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !435, file: !341, line: 192, baseType: !439, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cycle_check_state", file: !441, line: 28, size: 256, elements: !442)
!441 = !DIFile(filename: "./lib/cycle-check.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!442 = !{!443, !448, !452}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "dev_ino", scope: !440, file: !441, line: 30, baseType: !444, size: 128)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !47, line: 7, size: 128, elements: !445)
!445 = !{!446, !447}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !444, file: !47, line: 9, baseType: !50, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !444, file: !47, line: 10, baseType: !56, size: 64, offset: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "chdir_counter", scope: !440, file: !441, line: 31, baseType: !449, size: 64, offset: 128)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !450, line: 102, baseType: !451)
!450 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !53, line: 72, baseType: !54)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !440, file: !441, line: 32, baseType: !30, size: 32, offset: 192)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fd_ring", scope: !342, file: !341, line: 198, baseType: !454, size: 256, offset: 768)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "I_ring", file: !455, line: 39, baseType: !456)
!455 = !DIFile(filename: "./lib/i-ring.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "I_ring", file: !455, line: 31, size: 256, elements: !457)
!457 = !{!458, !462, !463, !464, !465}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "ir_data", scope: !456, file: !455, line: 33, baseType: !459, size: 128)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 128, elements: !460)
!460 = !{!461}
!461 = !DISubrange(count: 4)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "ir_default_val", scope: !456, file: !455, line: 34, baseType: !30, size: 32, offset: 128)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "ir_front", scope: !456, file: !455, line: 35, baseType: !7, size: 32, offset: 160)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "ir_back", scope: !456, file: !455, line: 36, baseType: !7, size: 32, offset: 192)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "ir_empty", scope: !456, file: !455, line: 37, baseType: !38, size: 8, offset: 224)
!466 = !{!467}
!467 = !DILocalVariable(name: "fts", arg: 1, scope: !336, file: !335, line: 50, type: !339)
!468 = !{!469}
!469 = !DIEnumerator(name: "HT_INITIAL_SIZE", value: 31, isUnsigned: true)
!470 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !325, line: 712, baseType: !7, size: 32, elements: !471)
!471 = !{!472}
!472 = !DIEnumerator(name: "DEV_TYPE_HT_INITIAL_SIZE", value: 13, isUnsigned: true)
!473 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !325, line: 666, baseType: !7, size: 32, elements: !474)
!474 = !{!475}
!475 = !DIEnumerator(name: "MIN_DIR_NLINK", value: 2, isUnsigned: true)
!476 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !354, line: 97, baseType: !7, size: 32, elements: !477)
!477 = !{!478, !479, !480, !481, !482, !483, !484, !485, !486}
!478 = !DIEnumerator(name: "DT_UNKNOWN", value: 0, isUnsigned: true)
!479 = !DIEnumerator(name: "DT_FIFO", value: 1, isUnsigned: true)
!480 = !DIEnumerator(name: "DT_CHR", value: 2, isUnsigned: true)
!481 = !DIEnumerator(name: "DT_DIR", value: 4, isUnsigned: true)
!482 = !DIEnumerator(name: "DT_BLK", value: 6, isUnsigned: true)
!483 = !DIEnumerator(name: "DT_REG", value: 8, isUnsigned: true)
!484 = !DIEnumerator(name: "DT_LNK", value: 10, isUnsigned: true)
!485 = !DIEnumerator(name: "DT_SOCK", value: 12, isUnsigned: true)
!486 = !DIEnumerator(name: "DT_WHT", value: 14, isUnsigned: true)
!487 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !325, line: 150, baseType: !7, size: 32, elements: !488)
!488 = !{!489}
!489 = !DIEnumerator(name: "_FTS_INODE_SORT_DIR_ENTRIES_THRESHOLD", value: 10000, isUnsigned: true)
!490 = !{!23, !369, !449, !21, !357, !491, !496}
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DISubroutineType(types: !493)
!493 = !{!30, !494, !494}
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !499)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTSENT", file: !341, line: 257, baseType: !346)
!500 = distinct !DICompileUnit(language: DW_LANG_C99, file: !501, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !97, retainedTypes: !502)
!501 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!502 = !{!148}
!503 = distinct !DICompileUnit(language: DW_LANG_C99, file: !504, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !97)
!504 = !DIFile(filename: "./lib/selinux-at.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!505 = distinct !DICompileUnit(language: DW_LANG_C99, file: !506, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !97)
!506 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!507 = distinct !DICompileUnit(language: DW_LANG_C99, file: !508, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !97)
!508 = !DIFile(filename: "./lib/cycle-check.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!509 = distinct !DICompileUnit(language: DW_LANG_C99, file: !510, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !97)
!510 = !DIFile(filename: "./lib/open-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!511 = distinct !DICompileUnit(language: DW_LANG_C99, file: !512, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !97)
!512 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!513 = distinct !DICompileUnit(language: DW_LANG_C99, file: !514, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !515)
!514 = !DIFile(filename: "./lib/i-ring.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!515 = !{!516}
!516 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !455, line: 20, baseType: !7, size: 32, elements: !517)
!517 = !{!518}
!518 = !DIEnumerator(name: "I_RING_SIZE", value: 4, isUnsigned: true)
!519 = distinct !DICompileUnit(language: DW_LANG_C99, file: !520, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !521, retainedTypes: !297)
!520 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!521 = !{!522}
!522 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !523, line: 41, baseType: !7, size: 32, elements: !524)
!523 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!524 = !{!525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907}
!525 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!526 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!527 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!528 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!529 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!530 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!531 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!532 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!533 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!534 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!535 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!536 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!537 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!538 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!539 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!540 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!541 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!542 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!543 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!544 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!545 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!546 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!547 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!548 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!549 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!550 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!551 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!552 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!553 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!554 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!555 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!556 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!557 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!558 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!559 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!560 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!561 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!562 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!563 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!564 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!565 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!566 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!567 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!568 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!569 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!570 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!571 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!572 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!573 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!574 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!575 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!576 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!577 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!578 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!579 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!580 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!581 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!582 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!583 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!584 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!585 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!586 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!587 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!588 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!589 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!590 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!591 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!592 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!593 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!594 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!595 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!596 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!597 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!598 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!599 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!600 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!601 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!602 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!603 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!604 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!605 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!606 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!607 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!608 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!609 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!610 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!611 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!612 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!613 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!614 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!615 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!616 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!617 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!618 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!619 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!620 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!621 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!622 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!623 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!624 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!625 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!626 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!627 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!628 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!629 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!630 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!631 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!632 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!633 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!634 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!635 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!636 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!637 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!638 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!639 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!640 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!641 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!642 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!643 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!644 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!645 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!646 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!647 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!661 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!662 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!663 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!664 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!665 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!666 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!667 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!668 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!669 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!670 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!671 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!672 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!673 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!674 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!675 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!676 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!677 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!678 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!679 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!680 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!681 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!682 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!683 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!684 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!685 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!686 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!687 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!688 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!689 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!690 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!691 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!692 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!693 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!694 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!695 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!696 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!697 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!698 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!699 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!700 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!701 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!702 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!703 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!704 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!705 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!706 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!707 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!708 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!709 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!710 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!711 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!712 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!713 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!714 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!715 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!716 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!717 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!719 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!720 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!721 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!722 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!723 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!724 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!725 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!726 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!727 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!728 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!729 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!730 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!731 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!732 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!733 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!734 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!735 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!736 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!737 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!738 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!739 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!740 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!741 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!742 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!743 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!744 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!745 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!746 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!747 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!748 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!749 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!750 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!751 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!752 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!753 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!754 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!755 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!756 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!757 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!758 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!759 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!760 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!761 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!762 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!763 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!764 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!765 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!766 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!767 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!768 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!769 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!770 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!771 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!772 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!773 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!774 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!779 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!780 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!781 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!782 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!783 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!784 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!785 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!786 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!787 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!788 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!789 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!790 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!791 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!793 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!794 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!795 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!796 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!797 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!798 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!799 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!800 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!801 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!802 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!803 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!804 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!805 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!806 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!807 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!808 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!809 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!810 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!811 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!812 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!813 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!814 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!815 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!816 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!817 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!818 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!819 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!820 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!821 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!822 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!823 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!824 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!825 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!826 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!827 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!828 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!829 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!830 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!831 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!832 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!833 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!834 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!835 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!836 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!837 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!838 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!839 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!840 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!841 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!842 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!843 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!844 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!845 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!846 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!847 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!849 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!850 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!851 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!852 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!884 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!885 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!886 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!887 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!894 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!895 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!896 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!898 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!899 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!900 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!901 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!902 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!903 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!904 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!905 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!906 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!907 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!908 = distinct !DICompileUnit(language: DW_LANG_C99, file: !909, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !97)
!909 = !DIFile(filename: "./lib/openat-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!910 = distinct !DICompileUnit(language: DW_LANG_C99, file: !911, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !97)
!911 = !DIFile(filename: "./lib/openat-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!912 = distinct !DICompileUnit(language: DW_LANG_C99, file: !913, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !97)
!913 = !DIFile(filename: "./lib/save-cwd.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!914 = distinct !DICompileUnit(language: DW_LANG_C99, file: !915, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !97)
!915 = !DIFile(filename: "./lib/fd-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!916 = distinct !DICompileUnit(language: DW_LANG_C99, file: !917, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !97, retainedTypes: !118)
!917 = !DIFile(filename: "./lib/chdir-long.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!918 = distinct !DICompileUnit(language: DW_LANG_C99, file: !919, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !97)
!919 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!920 = distinct !DICompileUnit(language: DW_LANG_C99, file: !921, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !97, retainedTypes: !297)
!921 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!922 = distinct !DICompileUnit(language: DW_LANG_C99, file: !923, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !97, retainedTypes: !297)
!923 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!924 = distinct !DICompileUnit(language: DW_LANG_C99, file: !925, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !97)
!925 = !DIFile(filename: "./lib/dup-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!926 = !{!"clang version 7.0.0 (tags/RELEASE_700/final)"}
!927 = !{i32 2, !"Dwarf Version", i32 4}
!928 = !{i32 2, !"Debug Info Version", i32 3}
!929 = !{i32 1, !"wchar_size", i32 4}
!930 = !{i32 7, !"PIC Level", i32 2}
!931 = !{i32 7, !"PIE Level", i32 2}
!932 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 346, type: !933, isDefinition: true, scopeLine: 347, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, retainedNodes: !935)
!933 = !DISubroutineType(types: !934)
!934 = !{null, !30}
!935 = !{!936}
!936 = !DILocalVariable(name: "status", arg: 1, scope: !932, file: !3, line: 346, type: !30)
!937 = !DILocalVariable(name: "infomap", scope: !938, file: !939, line: 632, type: !953)
!938 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !939, file: !939, line: 630, type: !940, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !942)
!939 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!940 = !DISubroutineType(types: !941)
!941 = !{null, !69}
!942 = !{!943, !937, !944, !945, !952}
!943 = !DILocalVariable(name: "program", arg: 1, scope: !938, file: !939, line: 630, type: !69)
!944 = !DILocalVariable(name: "node", scope: !938, file: !939, line: 642, type: !69)
!945 = !DILocalVariable(name: "map_prog", scope: !938, file: !939, line: 643, type: !946)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !948)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !938, file: !939, line: 632, size: 128, elements: !949)
!949 = !{!950, !951}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !948, file: !939, line: 632, baseType: !69, size: 64)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !948, file: !939, line: 632, baseType: !69, size: 64, offset: 64)
!952 = !DILocalVariable(name: "lc_messages", scope: !938, file: !939, line: 655, type: !69)
!953 = !DICompositeType(tag: DW_TAG_array_type, baseType: !947, size: 896, elements: !954)
!954 = !{!955}
!955 = !DISubrange(count: 7)
!956 = !DILocation(line: 632, column: 67, scope: !938, inlinedAt: !957)
!957 = distinct !DILocation(line: 405, column: 7, scope: !958)
!958 = distinct !DILexicalBlock(scope: !959, file: !3, line: 351, column: 5)
!959 = distinct !DILexicalBlock(scope: !932, file: !3, line: 348, column: 7)
!960 = !DILocation(line: 346, column: 12, scope: !932)
!961 = !DILocation(line: 348, column: 14, scope: !959)
!962 = !DILocation(line: 348, column: 7, scope: !932)
!963 = !DILocation(line: 349, column: 5, scope: !964)
!964 = distinct !DILexicalBlock(scope: !959, file: !3, line: 349, column: 5)
!965 = !{!966, !966, i64 0}
!966 = !{!"any pointer", !967, i64 0}
!967 = !{!"omnipotent char", !968, i64 0}
!968 = !{!"Simple C/C++ TBAA"}
!969 = !DILocation(line: 352, column: 7, scope: !958)
!970 = !DILocation(line: 358, column: 7, scope: !958)
!971 = !DILocation(line: 587, column: 3, scope: !972, inlinedAt: !975)
!972 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !939, file: !939, line: 585, type: !973, isLocal: true, isDefinition: true, scopeLine: 586, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !97)
!973 = !DISubroutineType(types: !974)
!974 = !{null}
!975 = distinct !DILocation(line: 363, column: 7, scope: !958)
!976 = !DILocation(line: 365, column: 7, scope: !958)
!977 = !DILocation(line: 370, column: 7, scope: !958)
!978 = !DILocation(line: 376, column: 7, scope: !958)
!979 = !DILocation(line: 380, column: 7, scope: !958)
!980 = !DILocation(line: 384, column: 7, scope: !958)
!981 = !DILocation(line: 387, column: 7, scope: !958)
!982 = !DILocation(line: 390, column: 7, scope: !958)
!983 = !DILocation(line: 403, column: 7, scope: !958)
!984 = !DILocation(line: 404, column: 7, scope: !958)
!985 = !DILocation(line: 632, column: 3, scope: !938, inlinedAt: !957)
!986 = !DILocation(line: 643, column: 36, scope: !938, inlinedAt: !957)
!987 = !DILocation(line: 643, column: 25, scope: !938, inlinedAt: !957)
!988 = !DILocation(line: 645, column: 33, scope: !938, inlinedAt: !957)
!989 = !DILocation(line: 645, column: 3, scope: !938, inlinedAt: !957)
!990 = !DILocation(line: 646, column: 13, scope: !938, inlinedAt: !957)
!991 = !DILocation(line: 645, column: 20, scope: !938, inlinedAt: !957)
!992 = !{!993, !966, i64 0}
!993 = !{!"infomap", !966, i64 0, !966, i64 8}
!994 = !DILocation(line: 645, column: 10, scope: !938, inlinedAt: !957)
!995 = !DILocation(line: 645, column: 28, scope: !938, inlinedAt: !957)
!996 = distinct !{!996, !997, !998}
!997 = !DILocation(line: 645, column: 3, scope: !938)
!998 = !DILocation(line: 646, column: 13, scope: !938)
!999 = !DILocation(line: 648, column: 17, scope: !1000, inlinedAt: !957)
!1000 = distinct !DILexicalBlock(scope: !938, file: !939, line: 648, column: 7)
!1001 = !{!993, !966, i64 8}
!1002 = !DILocation(line: 648, column: 7, scope: !1000, inlinedAt: !957)
!1003 = !DILocation(line: 648, column: 7, scope: !938, inlinedAt: !957)
!1004 = !DILocation(line: 642, column: 15, scope: !938, inlinedAt: !957)
!1005 = !DILocation(line: 651, column: 3, scope: !938, inlinedAt: !957)
!1006 = !DILocation(line: 655, column: 29, scope: !938, inlinedAt: !957)
!1007 = !DILocation(line: 655, column: 15, scope: !938, inlinedAt: !957)
!1008 = !DILocation(line: 656, column: 7, scope: !1009, inlinedAt: !957)
!1009 = distinct !DILexicalBlock(scope: !938, file: !939, line: 656, column: 7)
!1010 = !DILocation(line: 656, column: 19, scope: !1009, inlinedAt: !957)
!1011 = !DILocation(line: 656, column: 22, scope: !1009, inlinedAt: !957)
!1012 = !DILocation(line: 656, column: 7, scope: !938, inlinedAt: !957)
!1013 = !DILocation(line: 662, column: 7, scope: !1014, inlinedAt: !957)
!1014 = distinct !DILexicalBlock(scope: !1009, file: !939, line: 657, column: 5)
!1015 = !DILocation(line: 664, column: 5, scope: !1014, inlinedAt: !957)
!1016 = !DILocation(line: 665, column: 3, scope: !938, inlinedAt: !957)
!1017 = !DILocation(line: 667, column: 3, scope: !938, inlinedAt: !957)
!1018 = !DILocation(line: 669, column: 1, scope: !938, inlinedAt: !957)
!1019 = !DILocation(line: 407, column: 3, scope: !932)
!1020 = !DILocation(line: 411, column: 11, scope: !27)
!1021 = !DILocation(line: 411, column: 24, scope: !27)
!1022 = !DILocation(line: 414, column: 7, scope: !27)
!1023 = !DILocation(line: 418, column: 7, scope: !27)
!1024 = !DILocation(line: 421, column: 8, scope: !27)
!1025 = !DILocation(line: 422, column: 8, scope: !27)
!1026 = !DILocation(line: 423, column: 9, scope: !27)
!1027 = !DILocation(line: 427, column: 21, scope: !27)
!1028 = !DILocation(line: 427, column: 3, scope: !27)
!1029 = !DILocation(line: 428, column: 3, scope: !27)
!1030 = !DILocation(line: 429, column: 3, scope: !27)
!1031 = !DILocation(line: 430, column: 3, scope: !27)
!1032 = !DILocation(line: 432, column: 3, scope: !27)
!1033 = !DILocation(line: 434, column: 3, scope: !27)
!1034 = !DILocation(scope: !1035)
!1035 = distinct !DILexicalBlock(scope: !1036, file: !3, line: 438, column: 9)
!1036 = distinct !DILexicalBlock(scope: !27, file: !3, line: 436, column: 5)
!1037 = !DILocation(line: 434, column: 18, scope: !27)
!1038 = !DILocation(line: 424, column: 7, scope: !27)
!1039 = distinct !{!1039, !1033, !1040}
!1040 = !DILocation(line: 509, column: 5, scope: !27)
!1041 = !DILocation(line: 441, column: 11, scope: !1035)
!1042 = !DILocation(line: 445, column: 11, scope: !1035)
!1043 = !DILocation(line: 449, column: 11, scope: !1035)
!1044 = !DILocation(line: 453, column: 11, scope: !1035)
!1045 = !DILocation(line: 458, column: 11, scope: !1035)
!1046 = !DILocation(line: 462, column: 11, scope: !1035)
!1047 = !DILocation(line: 466, column: 11, scope: !1035)
!1048 = !DILocation(line: 469, column: 28, scope: !1035)
!1049 = !DILocation(line: 470, column: 11, scope: !1035)
!1050 = !DILocation(line: 474, column: 11, scope: !1035)
!1051 = !DILocation(line: 482, column: 11, scope: !1035)
!1052 = !DILocation(line: 485, column: 28, scope: !1035)
!1053 = !DILocation(line: 485, column: 26, scope: !1035)
!1054 = !DILocation(line: 487, column: 11, scope: !1035)
!1055 = !DILocation(line: 490, column: 28, scope: !1035)
!1056 = !DILocation(line: 490, column: 26, scope: !1035)
!1057 = !DILocation(line: 492, column: 11, scope: !1035)
!1058 = !DILocation(line: 495, column: 28, scope: !1035)
!1059 = !DILocation(line: 495, column: 26, scope: !1035)
!1060 = !DILocation(line: 497, column: 11, scope: !1035)
!1061 = !DILocation(line: 500, column: 29, scope: !1035)
!1062 = !DILocation(line: 500, column: 27, scope: !1035)
!1063 = !DILocation(line: 502, column: 11, scope: !1035)
!1064 = !DILocation(line: 504, column: 9, scope: !1035)
!1065 = !DILocation(line: 505, column: 9, scope: !1035)
!1066 = !DILocation(line: 507, column: 11, scope: !1035)
!1067 = !DILocation(line: 511, column: 7, scope: !27)
!1068 = !DILocation(line: 513, column: 21, scope: !1069)
!1069 = distinct !DILexicalBlock(scope: !1070, file: !3, line: 513, column: 11)
!1070 = distinct !DILexicalBlock(scope: !1071, file: !3, line: 512, column: 5)
!1071 = distinct !DILexicalBlock(scope: !27, file: !3, line: 511, column: 7)
!1072 = !DILocation(line: 513, column: 11, scope: !1070)
!1073 = !DILocation(line: 515, column: 27, scope: !1074)
!1074 = distinct !DILexicalBlock(scope: !1075, file: !3, line: 515, column: 15)
!1075 = distinct !DILexicalBlock(scope: !1069, file: !3, line: 514, column: 9)
!1076 = !DILocation(line: 515, column: 15, scope: !1075)
!1077 = !DILocation(line: 516, column: 13, scope: !1074)
!1078 = !DILocation(line: 522, column: 27, scope: !1079)
!1079 = distinct !DILexicalBlock(scope: !1080, file: !3, line: 522, column: 15)
!1080 = distinct !DILexicalBlock(scope: !1069, file: !3, line: 521, column: 9)
!1081 = !DILocation(line: 522, column: 15, scope: !1080)
!1082 = !DILocation(line: 523, column: 13, scope: !1079)
!1083 = !DILocation(line: 530, column: 46, scope: !1084)
!1084 = distinct !DILexicalBlock(scope: !1071, file: !3, line: 528, column: 5)
!1085 = !DILocation(line: 530, column: 31, scope: !1084)
!1086 = !DILocation(scope: !1084)
!1087 = !{!1088, !1088, i64 0}
!1088 = !{!"_Bool", !967, i64 0}
!1089 = !DILocation(line: 533, column: 14, scope: !1090)
!1090 = distinct !DILexicalBlock(scope: !27, file: !3, line: 533, column: 7)
!1091 = !{!1092, !1092, i64 0}
!1092 = !{!"int", !967, i64 0}
!1093 = !DILocation(line: 533, column: 12, scope: !1090)
!1094 = !DILocation(line: 533, column: 24, scope: !1090)
!1095 = !DILocation(line: 533, column: 42, scope: !1090)
!1096 = !DILocation(line: 533, column: 39, scope: !1090)
!1097 = !DILocation(line: 533, column: 21, scope: !1090)
!1098 = !DILocation(line: 533, column: 7, scope: !27)
!1099 = !DILocation(line: 535, column: 16, scope: !1100)
!1100 = distinct !DILexicalBlock(scope: !1101, file: !3, line: 535, column: 11)
!1101 = distinct !DILexicalBlock(scope: !1090, file: !3, line: 534, column: 5)
!1102 = !DILocation(line: 535, column: 11, scope: !1101)
!1103 = !DILocation(line: 536, column: 22, scope: !1100)
!1104 = !DILocation(line: 536, column: 9, scope: !1100)
!1105 = !DILocation(line: 538, column: 22, scope: !1100)
!1106 = !DILocation(line: 538, column: 70, scope: !1100)
!1107 = !DILocation(line: 538, column: 60, scope: !1100)
!1108 = !DILocation(line: 538, column: 53, scope: !1100)
!1109 = !DILocation(line: 538, column: 9, scope: !1100)
!1110 = !DILocation(line: 539, column: 7, scope: !1101)
!1111 = !DILocation(line: 542, column: 7, scope: !27)
!1112 = !DILocation(line: 544, column: 13, scope: !44)
!1113 = !DILocalVariable(name: "file", arg: 1, scope: !1114, file: !1115, line: 104, type: !69)
