source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.Active_dir = type { i64, i64, %struct._ftsent* }
%struct.Chown_option = type { i32, i8, %struct.dev_ino*, i8, i8, i8*, i8* }
%struct.FTS = type { %struct._ftsent*, %struct._ftsent*, %struct._ftsent**, i64, i8*, i32, i32, i64, i64, i32 (%struct._ftsent**, %struct._ftsent**)*, i32, %struct.hash_table*, %union.anon, %struct.I_ring }
%struct.I_ring = type { [4 x i32], i32, i32, i32, i8 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__dirstream = type opaque
%struct.__fsid_t = type { [2 x i32] }
%struct.__mbstate_t = type { i32, %union.anon.12 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct._ftsent = type { %struct._ftsent*, %struct._ftsent*, %struct._ftsent*, %struct.__dirstream*, i64, i8*, i8*, i8*, i32, i32, i64, %struct.FTS*, i64, i64, i64, i16, i16, i16, [1 x %struct.stat], [0 x i8] }
%struct.cycle_check_state = type { %struct.dev_ino, i64, i32 }
%struct.dev_ino = type { i64, i64 }
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%struct.group = type { i8*, i8*, i32, i8** }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 59, type: !124, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !34, globals: !44)
!3 = !DIFile(filename: "src/chgrp.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!4 = !{!5, !12, !26}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Verbosity", file: !6, line: 31, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "src/chown-core.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "V_high", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "V_changes_only", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "V_off", value: 2, isUnsigned: true)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !13, line: 32, baseType: !7, size: 32, elements: !14)
!13 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!14 = !{!15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25}
!15 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!16 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!17 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!18 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!19 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!21 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!22 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!23 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!24 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!25 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !27, line: 26, baseType: !7, size: 32, elements: !28)
!27 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!28 = !{!29, !30, !31, !32, !33}
!29 = !DIEnumerator(name: "LONGINT_OK", value: 0, isUnsigned: true)
!30 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1, isUnsigned: true)
!31 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2, isUnsigned: true)
!32 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3, isUnsigned: true)
!33 = !DIEnumerator(name: "LONGINT_INVALID", value: 4, isUnsigned: true)
!34 = !{!35, !37, !38, !42}
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !39, line: 79, baseType: !40)
!39 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !41, line: 144, baseType: !7)
!41 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !39, line: 64, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !41, line: 145, baseType: !7)
!44 = !{!45, !122, !0}
!45 = !DIGlobalVariableExpression(var: !46, expr: !DIExpression())
!46 = distinct !DIGlobalVariable(name: "dev_ino_buf", scope: !47, file: !3, line: 304, type: !67, isLocal: true, isDefinition: true)
!47 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 173, type: !48, isDefinition: true, scopeLine: 174, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !52)
!48 = !DISubroutineType(types: !49)
!49 = !{!50, !50, !51}
!50 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!52 = !{!53, !54, !55, !57, !58, !59, !60, !81, !82, !83, !120}
!53 = !DILocalVariable(name: "argc", arg: 1, scope: !47, file: !3, line: 173, type: !50)
!54 = !DILocalVariable(name: "argv", arg: 2, scope: !47, file: !3, line: 173, type: !51)
!55 = !DILocalVariable(name: "preserve_root", scope: !47, file: !3, line: 175, type: !56)
!56 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!57 = !DILocalVariable(name: "gid", scope: !47, file: !3, line: 176, type: !42)
!58 = !DILocalVariable(name: "bit_flags", scope: !47, file: !3, line: 179, type: !50)
!59 = !DILocalVariable(name: "dereference", scope: !47, file: !3, line: 183, type: !50)
!60 = !DILocalVariable(name: "chopt", scope: !47, file: !3, line: 185, type: !61)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Chown_option", file: !6, line: 43, size: 320, elements: !62)
!62 = !{!63, !64, !65, !77, !78, !79, !80}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "verbosity", scope: !61, file: !6, line: 46, baseType: !5, size: 32)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "recurse", scope: !61, file: !6, line: 49, baseType: !56, size: 8, offset: 32)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "root_dev_ino", scope: !61, file: !6, line: 53, baseType: !66, size: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !68, line: 7, size: 128, elements: !69)
!68 = !DIFile(filename: "./lib/dev-ino.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!69 = !{!70, !74}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !67, file: !68, line: 9, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !39, line: 47, baseType: !72)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !41, line: 146, baseType: !73)
!73 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !67, file: !68, line: 10, baseType: !75, size: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !39, line: 59, baseType: !76)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !41, line: 143, baseType: !73)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "affect_symlink_referent", scope: !61, file: !6, line: 56, baseType: !56, size: 8, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "force_silent", scope: !61, file: !6, line: 59, baseType: !56, size: 8, offset: 136)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "user_name", scope: !61, file: !6, line: 62, baseType: !35, size: 64, offset: 192)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "group_name", scope: !61, file: !6, line: 65, baseType: !35, size: 64, offset: 256)
!81 = !DILocalVariable(name: "ok", scope: !47, file: !3, line: 186, type: !56)
!82 = !DILocalVariable(name: "optc", scope: !47, file: !3, line: 187, type: !50)
!83 = !DILocalVariable(name: "ref_stats", scope: !84, file: !3, line: 287, type: !86)
!84 = distinct !DILexicalBlock(scope: !85, file: !3, line: 286, column: 5)
!85 = distinct !DILexicalBlock(scope: !47, file: !3, line: 285, column: 7)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !87, line: 46, size: 1152, elements: !88)
!87 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!88 = !{!89, !90, !91, !93, !95, !96, !97, !98, !99, !102, !104, !106, !114, !115, !116}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !86, file: !87, line: 48, baseType: !76, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !86, file: !87, line: 53, baseType: !72, size: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !86, file: !87, line: 61, baseType: !92, size: 64, offset: 128)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !41, line: 149, baseType: !73)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !86, file: !87, line: 62, baseType: !94, size: 32, offset: 192)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !41, line: 148, baseType: !7)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !86, file: !87, line: 64, baseType: !40, size: 32, offset: 224)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !86, file: !87, line: 65, baseType: !43, size: 32, offset: 256)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !86, file: !87, line: 67, baseType: !50, size: 32, offset: 288)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !86, file: !87, line: 69, baseType: !76, size: 64, offset: 320)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !86, file: !87, line: 74, baseType: !100, size: 64, offset: 384)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !41, line: 150, baseType: !101)
!101 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !86, file: !87, line: 78, baseType: !103, size: 64, offset: 448)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !41, line: 172, baseType: !101)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !86, file: !87, line: 80, baseType: !105, size: 64, offset: 512)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !41, line: 177, baseType: !101)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !86, file: !87, line: 91, baseType: !107, size: 128, offset: 576)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !108, line: 9, size: 128, elements: !109)
!108 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!109 = !{!110, !112}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !107, file: !108, line: 11, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !41, line: 158, baseType: !101)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !107, file: !108, line: 12, baseType: !113, size: 64, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !41, line: 194, baseType: !101)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !86, file: !87, line: 92, baseType: !107, size: 128, offset: 704)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !86, file: !87, line: 93, baseType: !107, size: 128, offset: 832)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !86, file: !87, line: 106, baseType: !117, size: 192, offset: 960)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 192, elements: !118)
!118 = !{!119}
!119 = !DISubrange(count: 3)
!120 = !DILocalVariable(name: "group_name", scope: !121, file: !3, line: 297, type: !35)
!121 = distinct !DILexicalBlock(scope: !85, file: !3, line: 296, column: 5)
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(name: "reference_file", scope: !2, file: !3, line: 47, type: !35, isLocal: true, isDefinition: true)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 3328, elements: !136)
!125 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !126)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !127, line: 50, size: 256, elements: !128)
!127 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!128 = !{!129, !132, !133, !135}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !126, file: !127, line: 52, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !126, file: !127, line: 55, baseType: !50, size: 32, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !126, file: !127, line: 56, baseType: !134, size: 64, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !126, file: !127, line: 57, baseType: !50, size: 32, offset: 192)
!136 = !{!137}
!137 = !DISubrange(count: 13)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "Version", scope: !140, file: !141, line: 2, type: !130, isDefinition: true)
!140 = distinct !DICompileUnit(language: DW_LANG_C99, file: !141, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !142, globals: !143)
!141 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!142 = !{}
!143 = !{!138}
!144 = !DIGlobalVariableExpression(var: !145, expr: !DIExpression())
!145 = distinct !DIGlobalVariable(name: "file_name", scope: !146, file: !151, line: 46, type: !130, isLocal: true, isDefinition: true)
!146 = distinct !DICompileUnit(language: DW_LANG_C99, file: !147, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !142, globals: !148)
!147 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!148 = !{!144, !149}
!149 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression())
!150 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !146, file: !151, line: 56, type: !56, isLocal: true, isDefinition: true)
!151 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(name: "exit_failure", scope: !154, file: !157, line: 24, type: !158, isDefinition: true)
!154 = distinct !DICompileUnit(language: DW_LANG_C99, file: !155, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !142, globals: !156)
!155 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!156 = !{!152}
!157 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!158 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !50)
!159 = !DIGlobalVariableExpression(var: !160, expr: !DIExpression())
!160 = distinct !DIGlobalVariable(name: "program_name", scope: !161, file: !165, line: 33, type: !130, isDefinition: true)
!161 = distinct !DICompileUnit(language: DW_LANG_C99, file: !162, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !142, retainedTypes: !163, globals: !164)
!162 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!163 = !{!37, !35}
!164 = !{!159}
!165 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !168, file: !198, line: 85, type: !233, isDefinition: true)
!168 = distinct !DICompileUnit(language: DW_LANG_C99, file: !169, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !170, retainedTypes: !191, globals: !195)
!169 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!170 = !{!12, !171, !176}
!171 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !13, line: 242, baseType: !7, size: 32, elements: !172)
!172 = !{!173, !174, !175}
!173 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!174 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!175 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!176 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !177, line: 46, baseType: !7, size: 32, elements: !178)
!177 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!178 = !{!179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190}
!179 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!180 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!181 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!182 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!183 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!184 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!185 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!186 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!187 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!188 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!189 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!190 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!191 = !{!50, !192, !193, !35}
!192 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !194, line: 62, baseType: !73)
!194 = !DIFile(filename: "/usr/lib/clang/7.0.0/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!195 = !{!166, !196, !203, !215, !217, !222, !229, !231}
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !168, file: !198, line: 101, type: !199, isDefinition: true)
!198 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 320, elements: !201)
!200 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!201 = !{!202}
!202 = !DISubrange(count: 10)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !168, file: !198, line: 1052, type: !205, isDefinition: true)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !198, line: 65, size: 448, elements: !206)
!206 = !{!207, !208, !209, !213, !214}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !205, file: !198, line: 68, baseType: !12, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !205, file: !198, line: 71, baseType: !50, size: 32, offset: 32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !205, file: !198, line: 75, baseType: !210, size: 256, offset: 64)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !211)
!211 = !{!212}
!212 = !DISubrange(count: 8)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !205, file: !198, line: 78, baseType: !130, size: 64, offset: 320)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !205, file: !198, line: 81, baseType: !130, size: 64, offset: 384)
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !168, file: !198, line: 116, type: !205, isLocal: true, isDefinition: true)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(name: "slot0", scope: !168, file: !198, line: 842, type: !219, isLocal: true, isDefinition: true)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 2048, elements: !220)
!220 = !{!221}
!221 = !DISubrange(count: 256)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(name: "slotvec", scope: !168, file: !198, line: 845, type: !224, isLocal: true, isDefinition: true)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !198, line: 834, size: 128, elements: !226)
!226 = !{!227, !228}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !225, file: !198, line: 836, baseType: !193, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !225, file: !198, line: 837, baseType: !35, size: 64, offset: 64)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(name: "nslots", scope: !168, file: !198, line: 843, type: !50, isLocal: true, isDefinition: true)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(name: "slotvec0", scope: !168, file: !198, line: 844, type: !225, isLocal: true, isDefinition: true)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 704, elements: !235)
!234 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !130)
!235 = !{!236}
!236 = !DISubrange(count: 11)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !239, file: !242, line: 26, type: !243, isDefinition: true)
!239 = distinct !DICompileUnit(language: DW_LANG_C99, file: !240, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !142, globals: !241)
!240 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!241 = !{!237}
!242 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 376, elements: !244)
!244 = !{!245}
!245 = !DISubrange(count: 47)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(name: "default_tuning", scope: !248, file: !252, line: 130, type: !253, isLocal: true, isDefinition: true)
!248 = distinct !DICompileUnit(language: DW_LANG_C99, file: !249, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !142, retainedTypes: !250, globals: !251)
!249 = !DIFile(filename: "./lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!250 = !{!73, !37, !193}
!251 = !{!246}
!252 = !DIFile(filename: "lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!253 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !254)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !255, line: 65, baseType: !256)
!255 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !255, line: 53, size: 160, elements: !257)
!257 = !{!258, !260, !261, !262, !263}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !256, file: !255, line: 58, baseType: !259, size: 32)
!259 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !256, file: !255, line: 59, baseType: !259, size: 32, offset: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !256, file: !255, line: 60, baseType: !259, size: 32, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !256, file: !255, line: 61, baseType: !259, size: 32, offset: 96)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !256, file: !255, line: 62, baseType: !56, size: 8, offset: 128)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !266, file: !267, line: 339, type: !50, isLocal: true, isDefinition: true)
!266 = distinct !DISubprogram(name: "rpl_fcntl", scope: !267, file: !267, line: 276, type: !268, isDefinition: true, scopeLine: 277, flags: DIFlagPrototyped, isOptimized: true, unit: !270, retainedNodes: !273)
!267 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!268 = !DISubroutineType(types: !269)
!269 = !{!50, !50, !50, null}
!270 = distinct !DICompileUnit(language: DW_LANG_C99, file: !271, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !142, globals: !272)
!271 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!272 = !{!264}
!273 = !{!274, !275, !276, !289, !290, !293, !296, !299}
!274 = !DILocalVariable(name: "fd", arg: 1, scope: !266, file: !267, line: 276, type: !50)
!275 = !DILocalVariable(name: "action", arg: 2, scope: !266, file: !267, line: 276, type: !50)
!276 = !DILocalVariable(name: "arg", scope: !266, file: !267, line: 278, type: !277)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !278, line: 30, baseType: !279)
!278 = !DIFile(filename: "/usr/lib/clang/7.0.0/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !271, line: 278, baseType: !280)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !281, size: 192, elements: !287)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !271, line: 278, size: 192, elements: !282)
!282 = !{!283, !284, !285, !286}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !281, file: !271, line: 278, baseType: !7, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !281, file: !271, line: 278, baseType: !7, size: 32, offset: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !281, file: !271, line: 278, baseType: !37, size: 64, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !281, file: !271, line: 278, baseType: !37, size: 64, offset: 128)
!287 = !{!288}
!288 = !DISubrange(count: 1)
!289 = !DILocalVariable(name: "result", scope: !266, file: !267, line: 279, type: !50)
!290 = !DILocalVariable(name: "target", scope: !291, file: !267, line: 326, type: !50)
!291 = distinct !DILexicalBlock(scope: !292, file: !267, line: 325, column: 7)
!292 = distinct !DILexicalBlock(scope: !266, file: !267, line: 282, column: 5)
!293 = !DILocalVariable(name: "flags", scope: !294, file: !267, line: 363, type: !50)
!294 = distinct !DILexicalBlock(scope: !295, file: !267, line: 362, column: 11)
!295 = distinct !DILexicalBlock(scope: !291, file: !267, line: 361, column: 13)
!296 = !DILocalVariable(name: "saved_errno", scope: !297, file: !267, line: 366, type: !50)
!297 = distinct !DILexicalBlock(scope: !298, file: !267, line: 365, column: 15)
!298 = distinct !DILexicalBlock(scope: !294, file: !267, line: 364, column: 17)
!299 = !DILocalVariable(name: "p", scope: !300, file: !267, line: 408, type: !37)
!300 = distinct !DILexicalBlock(scope: !292, file: !267, line: 406, column: 7)
!301 = distinct !DICompileUnit(language: DW_LANG_C99, file: !302, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !303, retainedTypes: !317)
!302 = !DIFile(filename: "src/chown-core.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!303 = !{!5, !12, !304, !311}
!304 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RCH_status", file: !302, line: 38, baseType: !7, size: 32, elements: !305)
!305 = !{!306, !307, !308, !309, !310}
!306 = !DIEnumerator(name: "RC_ok", value: 2, isUnsigned: true)
!307 = !DIEnumerator(name: "RC_excluded", value: 3, isUnsigned: true)
!308 = !DIEnumerator(name: "RC_inode_changed", value: 4, isUnsigned: true)
!309 = !DIEnumerator(name: "RC_do_ordinary_chown", value: 5, isUnsigned: true)
!310 = !DIEnumerator(name: "RC_error", value: 6, isUnsigned: true)
!311 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Change_status", file: !6, line: 23, baseType: !7, size: 32, elements: !312)
!312 = !{!313, !314, !315, !316}
!313 = !DIEnumerator(name: "CH_NOT_APPLIED", value: 1, isUnsigned: true)
!314 = !DIEnumerator(name: "CH_SUCCEEDED", value: 2, isUnsigned: true)
!315 = !DIEnumerator(name: "CH_FAILED", value: 3, isUnsigned: true)
!316 = !DIEnumerator(name: "CH_NO_CHANGE_REQUESTED", value: 4, isUnsigned: true)
!317 = !{!38, !42, !37}
!318 = distinct !DICompileUnit(language: DW_LANG_C99, file: !319, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !142, retainedTypes: !320)
!319 = !DIFile(filename: "./lib/umaxtostr.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!320 = !{!321}
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !322, line: 102, baseType: !323)
!322 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !41, line: 72, baseType: !73)
!324 = distinct !DICompileUnit(language: DW_LANG_C99, file: !325, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !142)
!325 = !DIFile(filename: "./lib/root-dev-ino.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!326 = distinct !DICompileUnit(language: DW_LANG_C99, file: !327, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !328, retainedTypes: !333)
!327 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!328 = !{!329}
!329 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !330, line: 41, baseType: !7, size: 32, elements: !331)
!330 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!331 = !{!332}
!332 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2018, isUnsigned: true)
!333 = !{!37}
!334 = distinct !DICompileUnit(language: DW_LANG_C99, file: !335, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !336, retainedTypes: !350)
!335 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!336 = !{!337}
!337 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !339, file: !338, line: 186, baseType: !7, size: 32, elements: !348)
!338 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!339 = distinct !DISubprogram(name: "x2nrealloc", scope: !338, file: !338, line: 174, type: !340, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: true, unit: !334, retainedNodes: !343)
!340 = !DISubroutineType(types: !341)
!341 = !{!37, !37, !342, !193}
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!343 = !{!344, !345, !346, !347}
!344 = !DILocalVariable(name: "p", arg: 1, scope: !339, file: !338, line: 174, type: !37)
!345 = !DILocalVariable(name: "pn", arg: 2, scope: !339, file: !338, line: 174, type: !342)
!346 = !DILocalVariable(name: "s", arg: 3, scope: !339, file: !338, line: 174, type: !193)
!347 = !DILocalVariable(name: "n", scope: !339, file: !338, line: 176, type: !193)
!348 = !{!349}
!349 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!350 = !{!193, !35, !37}
!351 = distinct !DICompileUnit(language: DW_LANG_C99, file: !352, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !142)
!352 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!353 = distinct !DICompileUnit(language: DW_LANG_C99, file: !354, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !142, retainedTypes: !333)
!354 = !DIFile(filename: "./lib/xfts.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!355 = distinct !DICompileUnit(language: DW_LANG_C99, file: !356, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !357, retainedTypes: !358)
!356 = !DIFile(filename: "./lib/xstrtoul.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!357 = !{!26, !176}
!358 = !{!50, !192}
!359 = distinct !DICompileUnit(language: DW_LANG_C99, file: !360, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !142, retainedTypes: !333)
!360 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!361 = distinct !DICompileUnit(language: DW_LANG_C99, file: !362, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !363, retainedTypes: !512)
!362 = !DIFile(filename: "./lib/fts.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!363 = !{!364, !369, !374, !492, !495, !498, !509}
!364 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Fts_stat", file: !365, line: 155, baseType: !7, size: 32, elements: !366)
!365 = !DIFile(filename: "lib/fts.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!366 = !{!367, !368}
!367 = !DIEnumerator(name: "FTS_NO_STAT_REQUIRED", value: 1, isUnsigned: true)
!368 = !DIEnumerator(name: "FTS_STAT_REQUIRED", value: 2, isUnsigned: true)
!369 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "leaf_optimization", file: !365, line: 669, baseType: !7, size: 32, elements: !370)
!370 = !{!371, !372, !373}
!371 = !DIEnumerator(name: "NO_LEAF_OPTIMIZATION", value: 0, isUnsigned: true)
!372 = !DIEnumerator(name: "OK_LEAF_OPTIMIZATION", value: 1, isUnsigned: true)
!373 = !DIEnumerator(name: "NOSTAT_LEAF_OPTIMIZATION", value: 2, isUnsigned: true)
!374 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !376, file: !375, line: 54, baseType: !7, size: 32, elements: !490)
!375 = !DIFile(filename: "./lib/fts-cycle.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!376 = distinct !DISubprogram(name: "setup_dir", scope: !375, file: !375, line: 50, type: !377, isLocal: true, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: true, unit: !361, retainedNodes: !488)
!377 = !DISubroutineType(types: !378)
!378 = !{!56, !379}
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !381, line: 199, baseType: !382)
!381 = !DIFile(filename: "./lib/fts_.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !381, line: 80, size: 1024, elements: !383)
!383 = !{!384, !439, !440, !442, !443, !444, !445, !446, !447, !448, !455, !456, !459, !475}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !382, file: !381, line: 81, baseType: !385, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !381, line: 201, size: 2112, elements: !387)
!387 = !{!388, !389, !390, !391, !396, !397, !398, !399, !400, !401, !402, !403, !404, !406, !407, !409, !410, !411, !412, !435}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !386, file: !381, line: 202, baseType: !385, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !386, file: !381, line: 203, baseType: !385, size: 64, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !386, file: !381, line: 204, baseType: !385, size: 64, offset: 128)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !386, file: !381, line: 205, baseType: !392, size: 64, offset: 192)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !394, line: 127, baseType: !395)
!394 = !DIFile(filename: "/usr/include/dirent.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !394, line: 127, flags: DIFlagFwdDecl)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !386, file: !381, line: 208, baseType: !101, size: 64, offset: 256)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !386, file: !381, line: 209, baseType: !37, size: 64, offset: 320)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !386, file: !381, line: 210, baseType: !35, size: 64, offset: 384)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !386, file: !381, line: 211, baseType: !35, size: 64, offset: 448)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !386, file: !381, line: 212, baseType: !50, size: 32, offset: 512)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !386, file: !381, line: 213, baseType: !50, size: 32, offset: 544)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !386, file: !381, line: 214, baseType: !193, size: 64, offset: 576)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !386, file: !381, line: 216, baseType: !379, size: 64, offset: 640)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !386, file: !381, line: 220, baseType: !405, size: 64, offset: 704)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !194, line: 51, baseType: !101)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !386, file: !381, line: 222, baseType: !193, size: 64, offset: 768)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "fts_n_dirs_remaining", scope: !386, file: !381, line: 227, baseType: !408, size: 64, offset: 832)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !39, line: 74, baseType: !92)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !386, file: !381, line: 243, baseType: !192, size: 16, offset: 896)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !386, file: !381, line: 247, baseType: !192, size: 16, offset: 912)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !386, file: !381, line: 253, baseType: !192, size: 16, offset: 928)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !386, file: !381, line: 255, baseType: !413, size: 1152, offset: 960)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !414, size: 1152, elements: !287)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !87, line: 46, size: 1152, elements: !415)
!415 = !{!416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !432, !433, !434}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !414, file: !87, line: 48, baseType: !76, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !414, file: !87, line: 53, baseType: !72, size: 64, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !414, file: !87, line: 61, baseType: !92, size: 64, offset: 128)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !414, file: !87, line: 62, baseType: !94, size: 32, offset: 192)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !414, file: !87, line: 64, baseType: !40, size: 32, offset: 224)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !414, file: !87, line: 65, baseType: !43, size: 32, offset: 256)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !414, file: !87, line: 67, baseType: !50, size: 32, offset: 288)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !414, file: !87, line: 69, baseType: !76, size: 64, offset: 320)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !414, file: !87, line: 74, baseType: !100, size: 64, offset: 384)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !414, file: !87, line: 78, baseType: !103, size: 64, offset: 448)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !414, file: !87, line: 80, baseType: !105, size: 64, offset: 512)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !414, file: !87, line: 91, baseType: !428, size: 128, offset: 576)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !108, line: 9, size: 128, elements: !429)
!429 = !{!430, !431}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !428, file: !108, line: 11, baseType: !111, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !428, file: !108, line: 12, baseType: !113, size: 64, offset: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !414, file: !87, line: 92, baseType: !428, size: 128, offset: 704)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !414, file: !87, line: 93, baseType: !428, size: 128, offset: 832)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !414, file: !87, line: 106, baseType: !117, size: 192, offset: 960)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "fts_name", scope: !386, file: !381, line: 256, baseType: !436, offset: 2112)
!436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, elements: !437)
!437 = !{!438}
!438 = !DISubrange(count: -1)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "fts_child", scope: !382, file: !381, line: 82, baseType: !385, size: 64, offset: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "fts_array", scope: !382, file: !381, line: 83, baseType: !441, size: 64, offset: 128)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !382, file: !381, line: 84, baseType: !75, size: 64, offset: 192)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !382, file: !381, line: 85, baseType: !35, size: 64, offset: 256)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "fts_rfd", scope: !382, file: !381, line: 86, baseType: !50, size: 32, offset: 320)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cwd_fd", scope: !382, file: !381, line: 87, baseType: !50, size: 32, offset: 352)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !382, file: !381, line: 89, baseType: !193, size: 64, offset: 384)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "fts_nitems", scope: !382, file: !381, line: 90, baseType: !193, size: 64, offset: 448)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "fts_compar", scope: !382, file: !381, line: 91, baseType: !449, size: 64, offset: 512)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DISubroutineType(types: !451)
!451 = !{!50, !452, !452}
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !386)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "fts_options", scope: !382, file: !381, line: 162, baseType: !50, size: 32, offset: 576)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "fts_leaf_optimization_works_ht", scope: !382, file: !381, line: 171, baseType: !457, size: 64, offset: 640)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !381, line: 171, flags: DIFlagFwdDecl)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !382, file: !381, line: 193, baseType: !460, size: 64, offset: 704)
!460 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !382, file: !381, line: 173, size: 64, elements: !461)
!461 = !{!462, !463}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !460, file: !381, line: 186, baseType: !457, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !460, file: !381, line: 192, baseType: !464, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cycle_check_state", file: !466, line: 28, size: 256, elements: !467)
!466 = !DIFile(filename: "./lib/cycle-check.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!467 = !{!468, !473, !474}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "dev_ino", scope: !465, file: !466, line: 30, baseType: !469, size: 128)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !68, line: 7, size: 128, elements: !470)
!470 = !{!471, !472}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !469, file: !68, line: 9, baseType: !71, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !469, file: !68, line: 10, baseType: !75, size: 64, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "chdir_counter", scope: !465, file: !466, line: 31, baseType: !321, size: 64, offset: 128)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !465, file: !466, line: 32, baseType: !50, size: 32, offset: 192)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fd_ring", scope: !382, file: !381, line: 198, baseType: !476, size: 256, offset: 768)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "I_ring", file: !477, line: 39, baseType: !478)
!477 = !DIFile(filename: "./lib/i-ring.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "I_ring", file: !477, line: 31, size: 256, elements: !479)
!479 = !{!480, !484, !485, !486, !487}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "ir_data", scope: !478, file: !477, line: 33, baseType: !481, size: 128)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 128, elements: !482)
!482 = !{!483}
!483 = !DISubrange(count: 4)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "ir_default_val", scope: !478, file: !477, line: 34, baseType: !50, size: 32, offset: 128)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "ir_front", scope: !478, file: !477, line: 35, baseType: !7, size: 32, offset: 160)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "ir_back", scope: !478, file: !477, line: 36, baseType: !7, size: 32, offset: 192)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "ir_empty", scope: !478, file: !477, line: 37, baseType: !56, size: 8, offset: 224)
!488 = !{!489}
!489 = !DILocalVariable(name: "fts", arg: 1, scope: !376, file: !375, line: 50, type: !379)
!490 = !{!491}
!491 = !DIEnumerator(name: "HT_INITIAL_SIZE", value: 31, isUnsigned: true)
!492 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !365, line: 712, baseType: !7, size: 32, elements: !493)
!493 = !{!494}
!494 = !DIEnumerator(name: "DEV_TYPE_HT_INITIAL_SIZE", value: 13, isUnsigned: true)
!495 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !365, line: 666, baseType: !7, size: 32, elements: !496)
!496 = !{!497}
!497 = !DIEnumerator(name: "MIN_DIR_NLINK", value: 2, isUnsigned: true)
!498 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !394, line: 97, baseType: !7, size: 32, elements: !499)
!499 = !{!500, !501, !502, !503, !504, !505, !506, !507, !508}
!500 = !DIEnumerator(name: "DT_UNKNOWN", value: 0, isUnsigned: true)
!501 = !DIEnumerator(name: "DT_FIFO", value: 1, isUnsigned: true)
!502 = !DIEnumerator(name: "DT_CHR", value: 2, isUnsigned: true)
!503 = !DIEnumerator(name: "DT_DIR", value: 4, isUnsigned: true)
!504 = !DIEnumerator(name: "DT_BLK", value: 6, isUnsigned: true)
!505 = !DIEnumerator(name: "DT_REG", value: 8, isUnsigned: true)
!506 = !DIEnumerator(name: "DT_LNK", value: 10, isUnsigned: true)
!507 = !DIEnumerator(name: "DT_SOCK", value: 12, isUnsigned: true)
!508 = !DIEnumerator(name: "DT_WHT", value: 14, isUnsigned: true)
!509 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !365, line: 150, baseType: !7, size: 32, elements: !510)
!510 = !{!511}
!511 = !DIEnumerator(name: "_FTS_INODE_SORT_DIR_ENTRIES_THRESHOLD", value: 10000, isUnsigned: true)
!512 = !{!37, !408, !321, !35, !101, !513, !518}
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DISubroutineType(types: !515)
!515 = !{!50, !516, !516}
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !521)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTSENT", file: !381, line: 257, baseType: !386)
!522 = distinct !DICompileUnit(language: DW_LANG_C99, file: !523, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !142, retainedTypes: !524)
!523 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!524 = !{!193}
!525 = distinct !DICompileUnit(language: DW_LANG_C99, file: !526, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !142)
!526 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!527 = distinct !DICompileUnit(language: DW_LANG_C99, file: !528, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !142)
!528 = !DIFile(filename: "./lib/cycle-check.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!529 = distinct !DICompileUnit(language: DW_LANG_C99, file: !530, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !142)
!530 = !DIFile(filename: "./lib/open-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!531 = distinct !DICompileUnit(language: DW_LANG_C99, file: !532, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !142)
!532 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!533 = distinct !DICompileUnit(language: DW_LANG_C99, file: !534, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !535)
!534 = !DIFile(filename: "./lib/i-ring.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!535 = !{!536}
!536 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !477, line: 20, baseType: !7, size: 32, elements: !537)
!537 = !{!538}
!538 = !DIEnumerator(name: "I_RING_SIZE", value: 4, isUnsigned: true)
!539 = distinct !DICompileUnit(language: DW_LANG_C99, file: !540, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !541, retainedTypes: !333)
!540 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!541 = !{!542}
!542 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !543, line: 41, baseType: !7, size: 32, elements: !544)
!543 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!544 = !{!545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927}
!545 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!546 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!547 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!548 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!549 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!550 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!551 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!552 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!553 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!554 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!555 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!556 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!557 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!558 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!559 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!560 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!561 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!562 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!563 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!564 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!565 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!566 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!567 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!568 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!569 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!570 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!571 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!572 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!573 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!574 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!575 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!576 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!577 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!578 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!579 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!580 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!581 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!582 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!583 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!584 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!585 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!586 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!587 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!588 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!589 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!590 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!591 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!592 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!593 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!594 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!595 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!596 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!597 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!598 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!599 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!600 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!601 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!602 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!603 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!604 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!605 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!606 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!607 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!608 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!609 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!610 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!611 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!612 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!613 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!614 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!615 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!616 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!617 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!618 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!619 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!620 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!621 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!622 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!623 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!624 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!625 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!626 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!627 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!628 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!629 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!630 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!631 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!632 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!633 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!634 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!635 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!636 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!637 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!653 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!656 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!657 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!658 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!659 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!660 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!661 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!662 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!663 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!664 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!665 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!666 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!667 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!668 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!669 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!670 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!671 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!672 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!673 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!674 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!675 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!676 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!677 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!678 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!679 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!680 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!681 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!682 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!683 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!684 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!685 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!686 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!687 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!688 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!689 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!690 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!691 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!692 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!693 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!694 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!695 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!696 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!697 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!698 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!699 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!700 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!701 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!702 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!703 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!704 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!705 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!706 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!707 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!708 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!709 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!710 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!711 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!712 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!713 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!714 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!715 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!716 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!717 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!719 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!720 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!721 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!722 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!723 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!724 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!725 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!726 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!727 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!728 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!729 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!730 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!731 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!732 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!733 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!734 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!735 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!736 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!737 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!738 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!739 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!740 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!741 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!742 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!743 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!744 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!745 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!746 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!747 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!748 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!749 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!750 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!751 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!752 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!753 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!754 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!755 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!756 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!757 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!758 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!759 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!760 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!761 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!762 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!763 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!764 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!765 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!766 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!767 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!768 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!769 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!770 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!771 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!772 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!773 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!774 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!779 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!780 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!781 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!782 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!783 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!784 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!785 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!786 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!787 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!788 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!789 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!790 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!791 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!793 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!794 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!795 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!796 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!797 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!798 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!799 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!800 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!801 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!802 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!803 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!804 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!805 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!806 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!807 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!808 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!809 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!810 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!812 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!813 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!814 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!815 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!816 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!817 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!818 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!819 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!820 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!821 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!822 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!823 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!824 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!825 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!826 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!827 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!828 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!829 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!830 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!831 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!832 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!833 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!834 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!835 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!836 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!837 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!838 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!839 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!840 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!841 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!842 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!843 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!844 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!845 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!846 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!847 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!860 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!861 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!862 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!863 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!864 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!869 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!870 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!871 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!872 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!884 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!885 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!886 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!887 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!894 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!895 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!896 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!898 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!899 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!900 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!901 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!902 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!903 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!904 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!905 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!906 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!907 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!908 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!909 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!910 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!911 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!912 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!913 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!914 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!915 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!916 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!917 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!918 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!919 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!920 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!921 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!922 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!923 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!924 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!925 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!926 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!927 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!928 = distinct !DICompileUnit(language: DW_LANG_C99, file: !929, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !142)
!929 = !DIFile(filename: "./lib/openat-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!930 = distinct !DICompileUnit(language: DW_LANG_C99, file: !931, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !142)
!931 = !DIFile(filename: "./lib/fd-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!932 = distinct !DICompileUnit(language: DW_LANG_C99, file: !933, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !142)
!933 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!934 = distinct !DICompileUnit(language: DW_LANG_C99, file: !935, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !142, retainedTypes: !333)
!935 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!936 = distinct !DICompileUnit(language: DW_LANG_C99, file: !937, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !142, retainedTypes: !333)
!937 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!938 = distinct !DICompileUnit(language: DW_LANG_C99, file: !939, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !142)
!939 = !DIFile(filename: "./lib/dup-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!940 = !{!"clang version 7.0.0 (tags/RELEASE_700/final)"}
!941 = !{i32 2, !"Dwarf Version", i32 4}
!942 = !{i32 2, !"Debug Info Version", i32 3}
!943 = !{i32 1, !"wchar_size", i32 4}
!944 = !{i32 7, !"PIC Level", i32 2}
!945 = !{i32 7, !"PIE Level", i32 2}
!946 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 104, type: !947, isDefinition: true, scopeLine: 105, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, retainedNodes: !949)
!947 = !DISubroutineType(types: !948)
!948 = !{null, !50}
!949 = !{!950}
!950 = !DILocalVariable(name: "status", arg: 1, scope: !946, file: !3, line: 104, type: !50)
!951 = !DILocalVariable(name: "infomap", scope: !952, file: !953, line: 632, type: !967)
!952 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !953, file: !953, line: 630, type: !954, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !956)
!953 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!954 = !DISubroutineType(types: !955)
!955 = !{null, !130}
!956 = !{!957, !951, !958, !959, !966}
!957 = !DILocalVariable(name: "program", arg: 1, scope: !952, file: !953, line: 630, type: !130)
!958 = !DILocalVariable(name: "node", scope: !952, file: !953, line: 642, type: !130)
!959 = !DILocalVariable(name: "map_prog", scope: !952, file: !953, line: 643, type: !960)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !962)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !952, file: !953, line: 632, size: 128, elements: !963)
!963 = !{!964, !965}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !962, file: !953, line: 632, baseType: !130, size: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !962, file: !953, line: 632, baseType: !130, size: 64, offset: 64)
!966 = !DILocalVariable(name: "lc_messages", scope: !952, file: !953, line: 655, type: !130)
!967 = !DICompositeType(tag: DW_TAG_array_type, baseType: !961, size: 896, elements: !968)
!968 = !{!969}
!969 = !DISubrange(count: 7)
!970 = !DILocation(line: 632, column: 67, scope: !952, inlinedAt: !971)
!971 = distinct !DILocation(line: 167, column: 7, scope: !972)
!972 = distinct !DILexicalBlock(scope: !973, file: !3, line: 109, column: 5)
!973 = distinct !DILexicalBlock(scope: !946, file: !3, line: 106, column: 7)
!974 = !DILocation(line: 104, column: 12, scope: !946)
!975 = !DILocation(line: 106, column: 14, scope: !973)
!976 = !DILocation(line: 106, column: 7, scope: !946)
!977 = !DILocation(line: 107, column: 5, scope: !978)
!978 = distinct !DILexicalBlock(scope: !973, file: !3, line: 107, column: 5)
!979 = !{!980, !980, i64 0}
!980 = !{!"any pointer", !981, i64 0}
!981 = !{!"omnipotent char", !982, i64 0}
!982 = !{!"Simple C/C++ TBAA"}
!983 = !DILocation(line: 110, column: 7, scope: !972)
!984 = !DILocation(line: 115, column: 7, scope: !972)
!985 = !DILocation(line: 120, column: 7, scope: !972)
!986 = !DILocation(line: 125, column: 7, scope: !972)
!987 = !DILocation(line: 130, column: 7, scope: !972)
!988 = !DILocation(line: 134, column: 7, scope: !972)
!989 = !DILocation(line: 138, column: 7, scope: !972)
!990 = !DILocation(line: 142, column: 7, scope: !972)
!991 = !DILocation(line: 145, column: 7, scope: !972)
!992 = !DILocation(line: 158, column: 7, scope: !972)
!993 = !DILocation(line: 159, column: 7, scope: !972)
!994 = !DILocation(line: 160, column: 7, scope: !972)
!995 = !DILocation(line: 632, column: 3, scope: !952, inlinedAt: !971)
!996 = !DILocation(line: 643, column: 36, scope: !952, inlinedAt: !971)
!997 = !DILocation(line: 643, column: 25, scope: !952, inlinedAt: !971)
!998 = !DILocation(line: 645, column: 33, scope: !952, inlinedAt: !971)
!999 = !DILocation(line: 645, column: 3, scope: !952, inlinedAt: !971)
!1000 = !DILocation(line: 646, column: 13, scope: !952, inlinedAt: !971)
!1001 = !DILocation(line: 645, column: 20, scope: !952, inlinedAt: !971)
!1002 = !{!1003, !980, i64 0}
!1003 = !{!"infomap", !980, i64 0, !980, i64 8}
!1004 = !DILocation(line: 645, column: 10, scope: !952, inlinedAt: !971)
!1005 = !DILocation(line: 645, column: 28, scope: !952, inlinedAt: !971)
!1006 = distinct !{!1006, !1007, !1008}
!1007 = !DILocation(line: 645, column: 3, scope: !952)
!1008 = !DILocation(line: 646, column: 13, scope: !952)
!1009 = !DILocation(line: 648, column: 17, scope: !1010, inlinedAt: !971)
!1010 = distinct !DILexicalBlock(scope: !952, file: !953, line: 648, column: 7)
!1011 = !{!1003, !980, i64 8}
!1012 = !DILocation(line: 648, column: 7, scope: !1010, inlinedAt: !971)
!1013 = !DILocation(line: 648, column: 7, scope: !952, inlinedAt: !971)
!1014 = !DILocation(line: 642, column: 15, scope: !952, inlinedAt: !971)
!1015 = !DILocation(line: 651, column: 3, scope: !952, inlinedAt: !971)
!1016 = !DILocation(line: 655, column: 29, scope: !952, inlinedAt: !971)
!1017 = !DILocation(line: 655, column: 15, scope: !952, inlinedAt: !971)
!1018 = !DILocation(line: 656, column: 7, scope: !1019, inlinedAt: !971)
!1019 = distinct !DILexicalBlock(scope: !952, file: !953, line: 656, column: 7)
!1020 = !DILocation(line: 656, column: 19, scope: !1019, inlinedAt: !971)
!1021 = !DILocation(line: 656, column: 22, scope: !1019, inlinedAt: !971)
!1022 = !DILocation(line: 656, column: 7, scope: !952, inlinedAt: !971)
!1023 = !DILocation(line: 662, column: 7, scope: !1024, inlinedAt: !971)
!1024 = distinct !DILexicalBlock(scope: !1019, file: !953, line: 657, column: 5)
!1025 = !DILocation(line: 664, column: 5, scope: !1024, inlinedAt: !971)
!1026 = !DILocation(line: 665, column: 3, scope: !952, inlinedAt: !971)
!1027 = !DILocation(line: 667, column: 3, scope: !952, inlinedAt: !971)
!1028 = !DILocation(line: 669, column: 1, scope: !952, inlinedAt: !971)
!1029 = !DILocation(line: 169, column: 3, scope: !946)
!1030 = !DILocation(line: 173, column: 11, scope: !47)
!1031 = !DILocation(line: 173, column: 24, scope: !47)
!1032 = !DILocation(line: 175, column: 8, scope: !47)
!1033 = !DILocation(line: 179, column: 7, scope: !47)
!1034 = !DILocation(line: 183, column: 7, scope: !47)
!1035 = !DILocation(line: 185, column: 3, scope: !47)
!1036 = !DILocation(line: 190, column: 21, scope: !47)
!1037 = !DILocation(line: 190, column: 3, scope: !47)
!1038 = !DILocation(line: 191, column: 3, scope: !47)
!1039 = !DILocation(line: 192, column: 3, scope: !47)
!1040 = !DILocation(line: 193, column: 3, scope: !47)
!1041 = !DILocation(line: 195, column: 3, scope: !47)
!1042 = !DILocation(line: 185, column: 23, scope: !47)
!1043 = !DILocation(line: 197, column: 3, scope: !47)
!1044 = !DILocation(line: 199, column: 3, scope: !47)
!1045 = !DILocation(line: 199, column: 18, scope: !47)
!1046 = !DILocation(line: 187, column: 7, scope: !47)
!1047 = distinct !{!1047, !1044, !1048}
!1048 = !DILocation(line: 258, column: 5, scope: !47)
!1049 = !DILocation(line: 210, column: 11, scope: !1050)
!1050 = distinct !DILexicalBlock(scope: !1051, file: !3, line: 203, column: 9)
!1051 = distinct !DILexicalBlock(scope: !47, file: !3, line: 201, column: 5)
!1052 = !DILocation(line: 214, column: 11, scope: !1050)
!1053 = !DILocation(line: 218, column: 11, scope: !1050)
!1054 = !DILocation(line: 223, column: 11, scope: !1050)
!1055 = !DILocation(line: 227, column: 11, scope: !1050)
!1056 = !DILocation(line: 231, column: 11, scope: !1050)
!1057 = !DILocation(line: 234, column: 28, scope: !1050)
!1058 = !DILocation(line: 234, column: 26, scope: !1050)
!1059 = !DILocation(line: 235, column: 11, scope: !1050)
!1060 = !DILocation(line: 238, column: 25, scope: !1050)
!1061 = !{!1062, !1063, i64 4}
!1062 = !{!"Chown_option", !981, i64 0, !1063, i64 4, !980, i64 8, !1063, i64 16, !1063, i64 17, !980, i64 24, !980, i64 32}
!1063 = !{!"_Bool", !981, i64 0}
!1064 = !DILocation(line: 239, column: 11, scope: !1050)
!1065 = !DILocation(line: 242, column: 27, scope: !1050)
!1066 = !{!1062, !981, i64 0}
!1067 = !DILocation(line: 243, column: 11, scope: !1050)
!1068 = !DILocation(line: 246, column: 30, scope: !1050)
!1069 = !{!1062, !1063, i64 17}
!1070 = !DILocation(line: 247, column: 11, scope: !1050)
!1071 = !DILocation(line: 250, column: 27, scope: !1050)
!1072 = !DILocation(line: 251, column: 11, scope: !1050)
!1073 = !DILocation(line: 253, column: 9, scope: !1050)
!1074 = !DILocation(line: 254, column: 9, scope: !1050)
!1075 = !DILocation(line: 256, column: 11, scope: !1050)
!1076 = !DILocation(line: 260, column: 13, scope: !1077)
!1077 = distinct !DILexicalBlock(scope: !47, file: !3, line: 260, column: 7)
!1078 = !{i8 0, i8 2}
!1079 = !DILocation(line: 260, column: 7, scope: !47)
!1080 = !DILocation(line: 262, column: 21, scope: !1081)
!1081 = distinct !DILexicalBlock(scope: !1082, file: !3, line: 262, column: 11)
!1082 = distinct !DILexicalBlock(scope: !1077, file: !3, line: 261, column: 5)
!1083 = !DILocation(line: 262, column: 11, scope: !1082)
!1084 = !DILocation(line: 264, column: 27, scope: !1085)
!1085 = distinct !DILexicalBlock(scope: !1086, file: !3, line: 264, column: 15)
!1086 = distinct !DILexicalBlock(scope: !1081, file: !3, line: 263, column: 9)
!1087 = !DILocation(line: 264, column: 15, scope: !1086)
!1088 = !DILocation(line: 265, column: 13, scope: !1085)
!1089 = !DILocation(scope: !1090)
!1090 = distinct !DILexicalBlock(scope: !1077, file: !3, line: 271, column: 5)
!1091 = !DILocation(scope: !47)
!1092 = !DILocation(line: 274, column: 48, scope: !47)
!1093 = !DILocation(line: 274, column: 9, scope: !47)
!1094 = !DILocation(line: 274, column: 33, scope: !47)
!1095 = !{!1062, !1063, i64 16}
!1096 = !DILocation(line: 276, column: 14, scope: !1097)
!1097 = distinct !DILexicalBlock(scope: !47, file: !3, line: 276, column: 7)
!1098 = !{!1099, !1099, i64 0}
!1099 = !{!"int", !981, i64 0}
!1100 = !DILocation(line: 276, column: 12, scope: !1097)
!1101 = !DILocation(line: 276, column: 24, scope: !1097)
!1102 = !DILocation(line: 276, column: 21, scope: !1097)
!1103 = !DILocation(line: 276, column: 7, scope: !47)
!1104 = !DILocation(line: 278, column: 16, scope: !1105)
!1105 = distinct !DILexicalBlock(scope: !1106, file: !3, line: 278, column: 11)
!1106 = distinct !DILexicalBlock(scope: !1097, file: !3, line: 277, column: 5)
!1107 = !DILocation(line: 278, column: 11, scope: !1106)
