; ModuleID = 'coreutils-8.32/src/chgrp.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.dev_ino = type { i64, i64 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.Chown_option = type { i32, i8, %struct.dev_ino*, i8, i8, i8*, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.dev_ino, %struct.dev_ino, %struct.dev_ino, [3 x i64] }
%struct.group = type { i8*, i8*, i32, i8** }
%struct.passwd = type { i8*, i8*, i32, i32, i8*, i8*, i8* }
%struct.FTS = type { %struct._ftsent*, %struct._ftsent*, %struct._ftsent**, i64, i8*, i32, i32, i64, i64, i32 (%struct._ftsent**, %struct._ftsent**)*, i32, %struct.hash_table*, %union.anon, %struct.I_ring }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 59, type: !124, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !34, globals: !44, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/chgrp.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !12, !26}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Verbosity", file: !6, line: 31, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "src/chown-core.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "V_high", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "V_changes_only", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "V_off", value: 2, isUnsigned: true)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !13, line: 32, baseType: !7, size: 32, elements: !14)
!13 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!14 = !{!15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25}
!15 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!16 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!17 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!18 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!19 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!21 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!22 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!23 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!24 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!25 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !27, line: 25, baseType: !7, size: 32, elements: !28)
!27 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!28 = !{!29, !30, !31, !32, !33}
!29 = !DIEnumerator(name: "LONGINT_OK", value: 0, isUnsigned: true)
!30 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1, isUnsigned: true)
!31 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2, isUnsigned: true)
!32 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3, isUnsigned: true)
!33 = !DIEnumerator(name: "LONGINT_INVALID", value: 4, isUnsigned: true)
!34 = !{!35, !37, !38, !42}
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !39, line: 79, baseType: !40)
!39 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !41, line: 146, baseType: !7)
!41 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !39, line: 64, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !41, line: 147, baseType: !7)
!44 = !{!45, !122, !0}
!45 = !DIGlobalVariableExpression(var: !46, expr: !DIExpression())
!46 = distinct !DIGlobalVariable(name: "dev_ino_buf", scope: !47, file: !3, line: 304, type: !67, isLocal: true, isDefinition: true)
!47 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 173, type: !48, scopeLine: 174, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !52)
!48 = !DISubroutineType(types: !49)
!49 = !{!50, !50, !51}
!50 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!52 = !{!53, !54, !55, !57, !58, !59, !60, !81, !82, !83, !120}
!53 = !DILocalVariable(name: "argc", arg: 1, scope: !47, file: !3, line: 173, type: !50)
!54 = !DILocalVariable(name: "argv", arg: 2, scope: !47, file: !3, line: 173, type: !51)
!55 = !DILocalVariable(name: "preserve_root", scope: !47, file: !3, line: 175, type: !56)
!56 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!57 = !DILocalVariable(name: "gid", scope: !47, file: !3, line: 176, type: !42)
!58 = !DILocalVariable(name: "bit_flags", scope: !47, file: !3, line: 179, type: !50)
!59 = !DILocalVariable(name: "dereference", scope: !47, file: !3, line: 183, type: !50)
!60 = !DILocalVariable(name: "chopt", scope: !47, file: !3, line: 185, type: !61)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Chown_option", file: !6, line: 43, size: 320, elements: !62)
!62 = !{!63, !64, !65, !77, !78, !79, !80}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "verbosity", scope: !61, file: !6, line: 46, baseType: !5, size: 32)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "recurse", scope: !61, file: !6, line: 49, baseType: !56, size: 8, offset: 32)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "root_dev_ino", scope: !61, file: !6, line: 53, baseType: !66, size: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !68, line: 7, size: 128, elements: !69)
!68 = !DIFile(filename: "./lib/dev-ino.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!69 = !{!70, !74}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !67, file: !68, line: 9, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !39, line: 47, baseType: !72)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !41, line: 148, baseType: !73)
!73 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !67, file: !68, line: 10, baseType: !75, size: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !39, line: 59, baseType: !76)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !41, line: 145, baseType: !73)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "affect_symlink_referent", scope: !61, file: !6, line: 56, baseType: !56, size: 8, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "force_silent", scope: !61, file: !6, line: 59, baseType: !56, size: 8, offset: 136)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "user_name", scope: !61, file: !6, line: 62, baseType: !35, size: 64, offset: 192)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "group_name", scope: !61, file: !6, line: 65, baseType: !35, size: 64, offset: 256)
!81 = !DILocalVariable(name: "ok", scope: !47, file: !3, line: 186, type: !56)
!82 = !DILocalVariable(name: "optc", scope: !47, file: !3, line: 187, type: !50)
!83 = !DILocalVariable(name: "ref_stats", scope: !84, file: !3, line: 287, type: !86)
!84 = distinct !DILexicalBlock(scope: !85, file: !3, line: 286, column: 5)
!85 = distinct !DILexicalBlock(scope: !47, file: !3, line: 285, column: 7)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !87, line: 26, size: 1152, elements: !88)
!87 = !DIFile(filename: "/usr/include/bits/struct_stat.h", directory: "")
!88 = !{!89, !90, !91, !93, !95, !96, !97, !98, !99, !102, !104, !106, !114, !115, !116}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !86, file: !87, line: 28, baseType: !76, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !86, file: !87, line: 33, baseType: !72, size: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !86, file: !87, line: 41, baseType: !92, size: 64, offset: 128)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !41, line: 151, baseType: !73)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !86, file: !87, line: 42, baseType: !94, size: 32, offset: 192)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !41, line: 150, baseType: !7)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !86, file: !87, line: 44, baseType: !40, size: 32, offset: 224)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !86, file: !87, line: 45, baseType: !43, size: 32, offset: 256)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !86, file: !87, line: 47, baseType: !50, size: 32, offset: 288)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !86, file: !87, line: 49, baseType: !76, size: 64, offset: 320)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !86, file: !87, line: 54, baseType: !100, size: 64, offset: 384)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !41, line: 152, baseType: !101)
!101 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !86, file: !87, line: 58, baseType: !103, size: 64, offset: 448)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !41, line: 175, baseType: !101)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !86, file: !87, line: 60, baseType: !105, size: 64, offset: 512)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !41, line: 180, baseType: !101)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !86, file: !87, line: 71, baseType: !107, size: 128, offset: 576)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !108, line: 10, size: 128, elements: !109)
!108 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!109 = !{!110, !112}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !107, file: !108, line: 12, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !41, line: 160, baseType: !101)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !107, file: !108, line: 16, baseType: !113, size: 64, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !41, line: 197, baseType: !101)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !86, file: !87, line: 72, baseType: !107, size: 128, offset: 704)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !86, file: !87, line: 73, baseType: !107, size: 128, offset: 832)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !86, file: !87, line: 86, baseType: !117, size: 192, offset: 960)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 192, elements: !118)
!118 = !{!119}
!119 = !DISubrange(count: 3)
!120 = !DILocalVariable(name: "group_name", scope: !121, file: !3, line: 297, type: !35)
!121 = distinct !DILexicalBlock(scope: !85, file: !3, line: 296, column: 5)
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(name: "reference_file", scope: !2, file: !3, line: 47, type: !35, isLocal: true, isDefinition: true)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 3328, elements: !136)
!125 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !126)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !127, line: 50, size: 256, elements: !128)
!127 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!128 = !{!129, !132, !133, !135}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !126, file: !127, line: 52, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !126, file: !127, line: 55, baseType: !50, size: 32, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !126, file: !127, line: 56, baseType: !134, size: 64, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !126, file: !127, line: 57, baseType: !50, size: 32, offset: 192)
!136 = !{!137}
!137 = !DISubrange(count: 13)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "Version", scope: !140, file: !141, line: 2, type: !130, isLocal: false, isDefinition: true)
!140 = distinct !DICompileUnit(language: DW_LANG_C99, file: !141, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !142, globals: !143, splitDebugInlining: false, nameTableKind: None)
!141 = !DIFile(filename: "src/version.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!142 = !{}
!143 = !{!138}
!144 = !DIGlobalVariableExpression(var: !145, expr: !DIExpression())
!145 = distinct !DIGlobalVariable(name: "file_name", scope: !146, file: !147, line: 46, type: !130, isLocal: true, isDefinition: true)
!146 = distinct !DICompileUnit(language: DW_LANG_C99, file: !147, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !142, globals: !148, splitDebugInlining: false, nameTableKind: None)
!147 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!148 = !{!144, !149}
!149 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression())
!150 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !146, file: !147, line: 56, type: !56, isLocal: true, isDefinition: true)
!151 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression())
!152 = distinct !DIGlobalVariable(name: "exit_failure", scope: !153, file: !154, line: 24, type: !156, isLocal: false, isDefinition: true)
!153 = distinct !DICompileUnit(language: DW_LANG_C99, file: !154, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !142, globals: !155, splitDebugInlining: false, nameTableKind: None)
!154 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!155 = !{!151}
!156 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !50)
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!158 = distinct !DIGlobalVariable(name: "program_name", scope: !159, file: !160, line: 33, type: !130, isLocal: false, isDefinition: true)
!159 = distinct !DICompileUnit(language: DW_LANG_C99, file: !160, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !142, retainedTypes: !161, globals: !162, splitDebugInlining: false, nameTableKind: None)
!160 = !DIFile(filename: "lib/progname.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!161 = !{!37, !35}
!162 = !{!157}
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !165, file: !166, line: 85, type: !229, isLocal: false, isDefinition: true)
!165 = distinct !DICompileUnit(language: DW_LANG_C99, file: !166, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !167, retainedTypes: !188, globals: !192, splitDebugInlining: false, nameTableKind: None)
!166 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!167 = !{!12, !168, !173}
!168 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !13, line: 242, baseType: !7, size: 32, elements: !169)
!169 = !{!170, !171, !172}
!170 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!171 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!172 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!173 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !174, line: 46, baseType: !7, size: 32, elements: !175)
!174 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!175 = !{!176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187}
!176 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!177 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!178 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!179 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!180 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!181 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!182 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!183 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!184 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!185 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!186 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!187 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!188 = !{!50, !189, !190, !35}
!189 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !191, line: 46, baseType: !73)
!191 = !DIFile(filename: "/usr/lib/clang/12.0.1/include/stddef.h", directory: "")
!192 = !{!163, !193, !199, !211, !213, !218, !225, !227}
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !165, file: !166, line: 101, type: !195, isLocal: false, isDefinition: true)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 320, elements: !197)
!196 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!197 = !{!198}
!198 = !DISubrange(count: 10)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !165, file: !166, line: 1052, type: !201, isLocal: false, isDefinition: true)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !166, line: 65, size: 448, elements: !202)
!202 = !{!203, !204, !205, !209, !210}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !201, file: !166, line: 68, baseType: !12, size: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !201, file: !166, line: 71, baseType: !50, size: 32, offset: 32)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !201, file: !166, line: 75, baseType: !206, size: 256, offset: 64)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !207)
!207 = !{!208}
!208 = !DISubrange(count: 8)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !201, file: !166, line: 78, baseType: !130, size: 64, offset: 320)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !201, file: !166, line: 81, baseType: !130, size: 64, offset: 384)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !165, file: !166, line: 116, type: !201, isLocal: true, isDefinition: true)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(name: "slot0", scope: !165, file: !166, line: 842, type: !215, isLocal: true, isDefinition: true)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 2048, elements: !216)
!216 = !{!217}
!217 = !DISubrange(count: 256)
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(name: "slotvec", scope: !165, file: !166, line: 845, type: !220, isLocal: true, isDefinition: true)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !166, line: 834, size: 128, elements: !222)
!222 = !{!223, !224}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !221, file: !166, line: 836, baseType: !190, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !221, file: !166, line: 837, baseType: !35, size: 64, offset: 64)
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression())
!226 = distinct !DIGlobalVariable(name: "nslots", scope: !165, file: !166, line: 843, type: !50, isLocal: true, isDefinition: true)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(name: "slotvec0", scope: !165, file: !166, line: 844, type: !221, isLocal: true, isDefinition: true)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !230, size: 704, elements: !231)
!230 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !130)
!231 = !{!232}
!232 = !DISubrange(count: 11)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !235, file: !236, line: 26, type: !238, isLocal: false, isDefinition: true)
!235 = distinct !DICompileUnit(language: DW_LANG_C99, file: !236, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !142, globals: !237, splitDebugInlining: false, nameTableKind: None)
!236 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!237 = !{!233}
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 376, elements: !239)
!239 = !{!240}
!240 = !DISubrange(count: 47)
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(name: "default_tuning", scope: !243, file: !244, line: 130, type: !247, isLocal: true, isDefinition: true)
!243 = distinct !DICompileUnit(language: DW_LANG_C99, file: !244, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !142, retainedTypes: !245, globals: !246, splitDebugInlining: false, nameTableKind: None)
!244 = !DIFile(filename: "lib/hash.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!245 = !{!73, !37, !190}
!246 = !{!241}
!247 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !248)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !249, line: 65, baseType: !250)
!249 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !249, line: 53, size: 160, elements: !251)
!251 = !{!252, !254, !255, !256, !257}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !250, file: !249, line: 58, baseType: !253, size: 32)
!253 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !250, file: !249, line: 59, baseType: !253, size: 32, offset: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !250, file: !249, line: 60, baseType: !253, size: 32, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !250, file: !249, line: 61, baseType: !253, size: 32, offset: 96)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !250, file: !249, line: 62, baseType: !56, size: 8, offset: 128)
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !260, file: !261, line: 507, type: !50, isLocal: true, isDefinition: true)
!260 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !261, file: !261, line: 488, type: !262, scopeLine: 489, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !264, retainedNodes: !266)
!261 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!262 = !DISubroutineType(types: !263)
!263 = !{!50, !50, !50}
!264 = distinct !DICompileUnit(language: DW_LANG_C99, file: !261, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !142, globals: !265, splitDebugInlining: false, nameTableKind: None)
!265 = !{!258}
!266 = !{!267, !268, !269, !270, !273}
!267 = !DILocalVariable(name: "fd", arg: 1, scope: !260, file: !261, line: 488, type: !50)
!268 = !DILocalVariable(name: "target", arg: 2, scope: !260, file: !261, line: 488, type: !50)
!269 = !DILocalVariable(name: "result", scope: !260, file: !261, line: 490, type: !50)
!270 = !DILocalVariable(name: "flags", scope: !271, file: !261, line: 531, type: !50)
!271 = distinct !DILexicalBlock(scope: !272, file: !261, line: 530, column: 5)
!272 = distinct !DILexicalBlock(scope: !260, file: !261, line: 529, column: 7)
!273 = !DILocalVariable(name: "saved_errno", scope: !274, file: !261, line: 534, type: !50)
!274 = distinct !DILexicalBlock(scope: !275, file: !261, line: 533, column: 9)
!275 = distinct !DILexicalBlock(scope: !271, file: !261, line: 532, column: 11)
!276 = distinct !DICompileUnit(language: DW_LANG_C99, file: !277, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !278, retainedTypes: !292, splitDebugInlining: false, nameTableKind: None)
!277 = !DIFile(filename: "src/chown-core.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!278 = !{!5, !12, !279, !286}
!279 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RCH_status", file: !277, line: 38, baseType: !7, size: 32, elements: !280)
!280 = !{!281, !282, !283, !284, !285}
!281 = !DIEnumerator(name: "RC_ok", value: 2, isUnsigned: true)
!282 = !DIEnumerator(name: "RC_excluded", value: 3, isUnsigned: true)
!283 = !DIEnumerator(name: "RC_inode_changed", value: 4, isUnsigned: true)
!284 = !DIEnumerator(name: "RC_do_ordinary_chown", value: 5, isUnsigned: true)
!285 = !DIEnumerator(name: "RC_error", value: 6, isUnsigned: true)
!286 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Change_status", file: !6, line: 23, baseType: !7, size: 32, elements: !287)
!287 = !{!288, !289, !290, !291}
!288 = !DIEnumerator(name: "CH_NOT_APPLIED", value: 1, isUnsigned: true)
!289 = !DIEnumerator(name: "CH_SUCCEEDED", value: 2, isUnsigned: true)
!290 = !DIEnumerator(name: "CH_FAILED", value: 3, isUnsigned: true)
!291 = !DIEnumerator(name: "CH_NO_CHANGE_REQUESTED", value: 4, isUnsigned: true)
!292 = !{!38, !42, !37}
!293 = distinct !DICompileUnit(language: DW_LANG_C99, file: !294, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !142, retainedTypes: !295, splitDebugInlining: false, nameTableKind: None)
!294 = !DIFile(filename: "lib/umaxtostr.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!295 = !{!296}
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !297, line: 102, baseType: !298)
!297 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !41, line: 73, baseType: !73)
!299 = distinct !DICompileUnit(language: DW_LANG_C99, file: !300, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !142, splitDebugInlining: false, nameTableKind: None)
!300 = !DIFile(filename: "lib/root-dev-ino.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!301 = distinct !DICompileUnit(language: DW_LANG_C99, file: !302, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !303, retainedTypes: !307, splitDebugInlining: false, nameTableKind: None)
!302 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!303 = !{!304}
!304 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !302, line: 40, baseType: !7, size: 32, elements: !305)
!305 = !{!306}
!306 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!307 = !{!37}
!308 = distinct !DICompileUnit(language: DW_LANG_C99, file: !309, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !310, retainedTypes: !324, splitDebugInlining: false, nameTableKind: None)
!309 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!310 = !{!311}
!311 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !313, file: !312, line: 186, baseType: !7, size: 32, elements: !322)
!312 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!313 = distinct !DISubprogram(name: "x2nrealloc", scope: !312, file: !312, line: 174, type: !314, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !308, retainedNodes: !317)
!314 = !DISubroutineType(types: !315)
!315 = !{!37, !37, !316, !190}
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!317 = !{!318, !319, !320, !321}
!318 = !DILocalVariable(name: "p", arg: 1, scope: !313, file: !312, line: 174, type: !37)
!319 = !DILocalVariable(name: "pn", arg: 2, scope: !313, file: !312, line: 174, type: !316)
!320 = !DILocalVariable(name: "s", arg: 3, scope: !313, file: !312, line: 174, type: !190)
!321 = !DILocalVariable(name: "n", scope: !313, file: !312, line: 176, type: !190)
!322 = !{!323}
!323 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!324 = !{!190, !35, !37}
!325 = distinct !DICompileUnit(language: DW_LANG_C99, file: !326, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !142, splitDebugInlining: false, nameTableKind: None)
!326 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!327 = distinct !DICompileUnit(language: DW_LANG_C99, file: !328, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !142, retainedTypes: !307, splitDebugInlining: false, nameTableKind: None)
!328 = !DIFile(filename: "lib/xfts.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!329 = distinct !DICompileUnit(language: DW_LANG_C99, file: !330, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !331, retainedTypes: !332, splitDebugInlining: false, nameTableKind: None)
!330 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!331 = !{!26, !173}
!332 = !{!50, !189}
!333 = distinct !DICompileUnit(language: DW_LANG_C99, file: !334, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !142, retainedTypes: !307, splitDebugInlining: false, nameTableKind: None)
!334 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!335 = distinct !DICompileUnit(language: DW_LANG_C99, file: !336, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !337, retainedTypes: !487, splitDebugInlining: false, nameTableKind: None)
!336 = !DIFile(filename: "lib/fts.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!337 = !{!338, !342, !347, !467, !470, !473, !484}
!338 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Fts_stat", file: !336, line: 156, baseType: !7, size: 32, elements: !339)
!339 = !{!340, !341}
!340 = !DIEnumerator(name: "FTS_NO_STAT_REQUIRED", value: 1, isUnsigned: true)
!341 = !DIEnumerator(name: "FTS_STAT_REQUIRED", value: 2, isUnsigned: true)
!342 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "leaf_optimization", file: !336, line: 643, baseType: !7, size: 32, elements: !343)
!343 = !{!344, !345, !346}
!344 = !DIEnumerator(name: "NO_LEAF_OPTIMIZATION", value: 0, isUnsigned: true)
!345 = !DIEnumerator(name: "OK_LEAF_OPTIMIZATION", value: 1, isUnsigned: true)
!346 = !DIEnumerator(name: "NOSTAT_LEAF_OPTIMIZATION", value: 2, isUnsigned: true)
!347 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !349, file: !348, line: 54, baseType: !7, size: 32, elements: !465)
!348 = !DIFile(filename: "./lib/fts-cycle.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!349 = distinct !DISubprogram(name: "setup_dir", scope: !348, file: !348, line: 50, type: !350, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !335, retainedNodes: !463)
!350 = !DISubroutineType(types: !351)
!351 = !{!56, !352}
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !354, line: 197, baseType: !355)
!354 = !DIFile(filename: "./lib/fts_.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !354, line: 80, size: 1024, elements: !356)
!356 = !{!357, !414, !415, !417, !418, !419, !420, !421, !422, !423, !430, !431, !434, !450}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !355, file: !354, line: 81, baseType: !358, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !354, line: 199, size: 2112, elements: !360)
!360 = !{!361, !362, !363, !364, !369, !370, !371, !372, !373, !374, !375, !376, !377, !379, !380, !382, !383, !384, !385, !410}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !359, file: !354, line: 200, baseType: !358, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !359, file: !354, line: 201, baseType: !358, size: 64, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !359, file: !354, line: 202, baseType: !358, size: 64, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !359, file: !354, line: 203, baseType: !365, size: 64, offset: 192)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !367, line: 127, baseType: !368)
!367 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !367, line: 127, flags: DIFlagFwdDecl)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !359, file: !354, line: 206, baseType: !101, size: 64, offset: 256)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !359, file: !354, line: 207, baseType: !37, size: 64, offset: 320)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !359, file: !354, line: 208, baseType: !35, size: 64, offset: 384)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !359, file: !354, line: 209, baseType: !35, size: 64, offset: 448)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !359, file: !354, line: 210, baseType: !50, size: 32, offset: 512)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !359, file: !354, line: 211, baseType: !50, size: 32, offset: 544)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !359, file: !354, line: 212, baseType: !190, size: 64, offset: 576)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !359, file: !354, line: 214, baseType: !352, size: 64, offset: 640)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !359, file: !354, line: 218, baseType: !378, size: 64, offset: 704)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !191, line: 35, baseType: !101)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !359, file: !354, line: 220, baseType: !190, size: 64, offset: 768)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "fts_n_dirs_remaining", scope: !359, file: !354, line: 225, baseType: !381, size: 64, offset: 832)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !39, line: 74, baseType: !92)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !359, file: !354, line: 241, baseType: !189, size: 16, offset: 896)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !359, file: !354, line: 245, baseType: !189, size: 16, offset: 912)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !359, file: !354, line: 251, baseType: !189, size: 16, offset: 928)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !359, file: !354, line: 253, baseType: !386, size: 1152, offset: 960)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !387, size: 1152, elements: !408)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !87, line: 26, size: 1152, elements: !388)
!388 = !{!389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !405, !406, !407}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !387, file: !87, line: 28, baseType: !76, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !387, file: !87, line: 33, baseType: !72, size: 64, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !387, file: !87, line: 41, baseType: !92, size: 64, offset: 128)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !387, file: !87, line: 42, baseType: !94, size: 32, offset: 192)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !387, file: !87, line: 44, baseType: !40, size: 32, offset: 224)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !387, file: !87, line: 45, baseType: !43, size: 32, offset: 256)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !387, file: !87, line: 47, baseType: !50, size: 32, offset: 288)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !387, file: !87, line: 49, baseType: !76, size: 64, offset: 320)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !387, file: !87, line: 54, baseType: !100, size: 64, offset: 384)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !387, file: !87, line: 58, baseType: !103, size: 64, offset: 448)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !387, file: !87, line: 60, baseType: !105, size: 64, offset: 512)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !387, file: !87, line: 71, baseType: !401, size: 128, offset: 576)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !108, line: 10, size: 128, elements: !402)
!402 = !{!403, !404}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !401, file: !108, line: 12, baseType: !111, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !401, file: !108, line: 16, baseType: !113, size: 64, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !387, file: !87, line: 72, baseType: !401, size: 128, offset: 704)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !387, file: !87, line: 73, baseType: !401, size: 128, offset: 832)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !387, file: !87, line: 86, baseType: !117, size: 192, offset: 960)
!408 = !{!409}
!409 = !DISubrange(count: 1)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "fts_name", scope: !359, file: !354, line: 254, baseType: !411, offset: 2112)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, elements: !412)
!412 = !{!413}
!413 = !DISubrange(count: -1)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "fts_child", scope: !355, file: !354, line: 82, baseType: !358, size: 64, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "fts_array", scope: !355, file: !354, line: 83, baseType: !416, size: 64, offset: 128)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !355, file: !354, line: 84, baseType: !75, size: 64, offset: 192)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !355, file: !354, line: 85, baseType: !35, size: 64, offset: 256)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "fts_rfd", scope: !355, file: !354, line: 86, baseType: !50, size: 32, offset: 320)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cwd_fd", scope: !355, file: !354, line: 87, baseType: !50, size: 32, offset: 352)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !355, file: !354, line: 89, baseType: !190, size: 64, offset: 384)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "fts_nitems", scope: !355, file: !354, line: 90, baseType: !190, size: 64, offset: 448)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "fts_compar", scope: !355, file: !354, line: 91, baseType: !424, size: 64, offset: 512)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DISubroutineType(types: !426)
!426 = !{!50, !427, !427}
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !359)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "fts_options", scope: !355, file: !354, line: 160, baseType: !50, size: 32, offset: 576)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "fts_leaf_optimization_works_ht", scope: !355, file: !354, line: 169, baseType: !432, size: 64, offset: 640)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !354, line: 169, flags: DIFlagFwdDecl)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !355, file: !354, line: 191, baseType: !435, size: 64, offset: 704)
!435 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !355, file: !354, line: 171, size: 64, elements: !436)
!436 = !{!437, !438}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !435, file: !354, line: 184, baseType: !432, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !435, file: !354, line: 190, baseType: !439, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cycle_check_state", file: !441, line: 28, size: 256, elements: !442)
!441 = !DIFile(filename: "./lib/cycle-check.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!442 = !{!443, !448, !449}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "dev_ino", scope: !440, file: !441, line: 30, baseType: !444, size: 128)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !68, line: 7, size: 128, elements: !445)
!445 = !{!446, !447}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !444, file: !68, line: 9, baseType: !71, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !444, file: !68, line: 10, baseType: !75, size: 64, offset: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "chdir_counter", scope: !440, file: !441, line: 31, baseType: !296, size: 64, offset: 128)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !440, file: !441, line: 32, baseType: !50, size: 32, offset: 192)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fd_ring", scope: !355, file: !354, line: 196, baseType: !451, size: 256, offset: 768)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "I_ring", file: !452, line: 39, baseType: !453)
!452 = !DIFile(filename: "./lib/i-ring.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "I_ring", file: !452, line: 31, size: 256, elements: !454)
!454 = !{!455, !459, !460, !461, !462}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "ir_data", scope: !453, file: !452, line: 33, baseType: !456, size: 128)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 128, elements: !457)
!457 = !{!458}
!458 = !DISubrange(count: 4)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "ir_default_val", scope: !453, file: !452, line: 34, baseType: !50, size: 32, offset: 128)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "ir_front", scope: !453, file: !452, line: 35, baseType: !7, size: 32, offset: 160)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "ir_back", scope: !453, file: !452, line: 36, baseType: !7, size: 32, offset: 192)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "ir_empty", scope: !453, file: !452, line: 37, baseType: !56, size: 8, offset: 224)
!463 = !{!464}
!464 = !DILocalVariable(name: "fts", arg: 1, scope: !349, file: !348, line: 50, type: !352)
!465 = !{!466}
!466 = !DIEnumerator(name: "HT_INITIAL_SIZE", value: 31, isUnsigned: true)
!467 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !336, line: 686, baseType: !7, size: 32, elements: !468)
!468 = !{!469}
!469 = !DIEnumerator(name: "DEV_TYPE_HT_INITIAL_SIZE", value: 13, isUnsigned: true)
!470 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !336, line: 640, baseType: !7, size: 32, elements: !471)
!471 = !{!472}
!472 = !DIEnumerator(name: "MIN_DIR_NLINK", value: 2, isUnsigned: true)
!473 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !367, line: 97, baseType: !7, size: 32, elements: !474)
!474 = !{!475, !476, !477, !478, !479, !480, !481, !482, !483}
!475 = !DIEnumerator(name: "DT_UNKNOWN", value: 0, isUnsigned: true)
!476 = !DIEnumerator(name: "DT_FIFO", value: 1, isUnsigned: true)
!477 = !DIEnumerator(name: "DT_CHR", value: 2, isUnsigned: true)
!478 = !DIEnumerator(name: "DT_DIR", value: 4, isUnsigned: true)
!479 = !DIEnumerator(name: "DT_BLK", value: 6, isUnsigned: true)
!480 = !DIEnumerator(name: "DT_REG", value: 8, isUnsigned: true)
!481 = !DIEnumerator(name: "DT_LNK", value: 10, isUnsigned: true)
!482 = !DIEnumerator(name: "DT_SOCK", value: 12, isUnsigned: true)
!483 = !DIEnumerator(name: "DT_WHT", value: 14, isUnsigned: true)
!484 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !336, line: 151, baseType: !7, size: 32, elements: !485)
!485 = !{!486}
!486 = !DIEnumerator(name: "_FTS_INODE_SORT_DIR_ENTRIES_THRESHOLD", value: 10000, isUnsigned: true)
!487 = !{!37, !381, !296, !35, !101, !488, !493}
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DISubroutineType(types: !490)
!490 = !{!50, !491, !491}
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !496)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTSENT", file: !354, line: 255, baseType: !359)
!497 = distinct !DICompileUnit(language: DW_LANG_C99, file: !498, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !142, retainedTypes: !499, splitDebugInlining: false, nameTableKind: None)
!498 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!499 = !{!190}
!500 = distinct !DICompileUnit(language: DW_LANG_C99, file: !501, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !142, splitDebugInlining: false, nameTableKind: None)
!501 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!502 = distinct !DICompileUnit(language: DW_LANG_C99, file: !503, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !142, splitDebugInlining: false, nameTableKind: None)
!503 = !DIFile(filename: "lib/cycle-check.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!504 = distinct !DICompileUnit(language: DW_LANG_C99, file: !505, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !142, splitDebugInlining: false, nameTableKind: None)
!505 = !DIFile(filename: "lib/open-safer.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!506 = distinct !DICompileUnit(language: DW_LANG_C99, file: !507, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !142, splitDebugInlining: false, nameTableKind: None)
!507 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!508 = distinct !DICompileUnit(language: DW_LANG_C99, file: !509, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !510, splitDebugInlining: false, nameTableKind: None)
!509 = !DIFile(filename: "lib/i-ring.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!510 = !{!511}
!511 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !452, line: 20, baseType: !7, size: 32, elements: !512)
!512 = !{!513}
!513 = !DIEnumerator(name: "I_RING_SIZE", value: 4, isUnsigned: true)
!514 = distinct !DICompileUnit(language: DW_LANG_C99, file: !515, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !516, retainedTypes: !307, splitDebugInlining: false, nameTableKind: None)
!515 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!516 = !{!517}
!517 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !518, line: 41, baseType: !7, size: 32, elements: !519)
!518 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!519 = !{!520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902}
!520 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!521 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!522 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!523 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!524 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!525 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!526 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!527 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!528 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!529 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!530 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!531 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!532 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!533 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!534 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!535 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!536 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!537 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!538 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!539 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!540 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!541 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!542 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!543 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!544 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!545 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!546 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!547 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!548 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!549 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!550 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!551 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!552 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!553 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!554 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!555 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!556 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!557 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!558 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!559 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!560 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!561 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!562 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!563 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!564 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!565 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!566 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!567 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!568 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!569 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!570 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!571 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!572 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!573 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!574 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!575 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!576 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!577 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!578 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!579 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!580 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!581 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!582 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!583 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!584 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!585 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!586 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!587 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!588 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!589 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!590 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!591 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!592 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!593 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!594 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!595 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!596 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!597 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!598 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!599 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!600 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!601 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!602 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!603 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!604 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!605 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!606 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!607 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!608 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!609 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!610 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!611 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!612 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!613 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!614 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!615 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!616 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!617 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!618 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!619 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!620 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!621 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!622 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!623 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!624 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!625 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!626 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!627 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!628 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!629 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!630 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!631 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!632 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!633 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!634 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!635 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!636 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!637 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!638 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!639 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!640 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!641 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!642 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!661 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!662 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!663 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!664 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!665 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!666 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!667 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!668 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!669 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!670 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!671 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!672 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!673 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!674 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!675 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!676 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!677 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!678 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!679 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!680 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!681 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!682 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!683 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!684 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!685 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!686 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!687 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!688 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!689 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!690 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!691 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!692 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!693 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!694 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!695 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!696 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!697 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!698 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!699 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!700 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!701 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!702 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!703 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!704 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!705 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!706 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!707 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!708 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!709 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!710 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!711 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!712 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!713 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!714 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!715 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!716 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!717 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!719 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!720 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!721 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!722 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!723 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!724 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!725 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!726 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!727 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!728 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!729 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!730 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!731 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!732 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!733 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!734 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!735 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!736 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!737 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!738 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!739 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!740 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!741 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!742 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!743 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!744 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!745 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!746 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!747 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!748 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!749 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!750 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!751 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!752 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!753 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!754 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!755 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!756 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!757 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!758 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!759 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!760 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!761 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!762 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!763 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!764 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!765 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!766 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!767 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!768 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!769 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!770 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!771 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!772 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!773 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!774 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!779 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!780 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!781 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!782 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!783 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!784 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!785 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!786 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!787 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!788 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!789 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!790 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!791 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!792 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!793 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!794 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!795 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!796 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!797 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!798 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!799 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!800 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!801 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!802 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!803 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!804 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!805 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!806 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!807 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!808 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!809 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!810 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!812 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!813 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!814 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!815 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!816 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!817 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!818 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!819 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!820 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!821 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!822 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!823 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!824 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!825 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!826 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!827 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!828 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!829 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!830 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!831 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!832 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!833 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!834 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!835 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!836 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!837 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!838 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!839 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!840 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!841 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!842 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!843 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!844 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!845 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!846 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!847 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!884 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!885 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!886 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!887 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!894 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!895 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!896 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!898 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!899 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!900 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!901 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!902 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!903 = distinct !DICompileUnit(language: DW_LANG_C99, file: !904, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !142, splitDebugInlining: false, nameTableKind: None)
!904 = !DIFile(filename: "lib/openat-safer.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!905 = distinct !DICompileUnit(language: DW_LANG_C99, file: !906, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !142, splitDebugInlining: false, nameTableKind: None)
!906 = !DIFile(filename: "lib/opendirat.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!907 = distinct !DICompileUnit(language: DW_LANG_C99, file: !908, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !142, retainedTypes: !307, splitDebugInlining: false, nameTableKind: None)
!908 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!909 = distinct !DICompileUnit(language: DW_LANG_C99, file: !910, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !142, splitDebugInlining: false, nameTableKind: None)
!910 = !DIFile(filename: "lib/fd-safer.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!911 = distinct !DICompileUnit(language: DW_LANG_C99, file: !912, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !142, splitDebugInlining: false, nameTableKind: None)
!912 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!913 = distinct !DICompileUnit(language: DW_LANG_C99, file: !914, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !142, retainedTypes: !307, splitDebugInlining: false, nameTableKind: None)
!914 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!915 = distinct !DICompileUnit(language: DW_LANG_C99, file: !916, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !142, retainedTypes: !307, splitDebugInlining: false, nameTableKind: None)
!916 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!917 = distinct !DICompileUnit(language: DW_LANG_C99, file: !918, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !142, splitDebugInlining: false, nameTableKind: None)
!918 = !DIFile(filename: "lib/dup-safer.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!919 = !{!"clang version 12.0.1"}
!920 = !{i32 7, !"Dwarf Version", i32 4}
!921 = !{i32 2, !"Debug Info Version", i32 3}
!922 = !{i32 1, !"wchar_size", i32 4}
!923 = !{i32 7, !"PIC Level", i32 2}
!924 = !{i32 7, !"PIE Level", i32 2}
!925 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 104, type: !926, scopeLine: 105, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !928)
!926 = !DISubroutineType(types: !927)
!927 = !{null, !50}
!928 = !{!929}
!929 = !DILocalVariable(name: "status", arg: 1, scope: !925, file: !3, line: 104, type: !50)
!930 = !DILocation(line: 0, scope: !925)
!931 = !DILocation(line: 106, column: 14, scope: !932)
!932 = distinct !DILexicalBlock(scope: !925, file: !3, line: 106, column: 7)
!933 = !DILocation(line: 106, column: 7, scope: !925)
!934 = !DILocation(line: 107, column: 5, scope: !935)
!935 = distinct !DILexicalBlock(scope: !932, file: !3, line: 107, column: 5)
!936 = !{!937, !937, i64 0}
!937 = !{!"any pointer", !938, i64 0}
!938 = !{!"omnipotent char", !939, i64 0}
!939 = !{!"Simple C/C++ TBAA"}
!940 = !DILocation(line: 110, column: 7, scope: !941)
!941 = distinct !DILexicalBlock(scope: !932, file: !3, line: 109, column: 5)
!942 = !DILocation(line: 115, column: 7, scope: !941)
!943 = !DILocation(line: 120, column: 7, scope: !941)
!944 = !DILocation(line: 125, column: 7, scope: !941)
!945 = !DILocation(line: 130, column: 7, scope: !941)
!946 = !DILocation(line: 134, column: 7, scope: !941)
!947 = !DILocation(line: 138, column: 7, scope: !941)
!948 = !DILocation(line: 142, column: 7, scope: !941)
!949 = !DILocation(line: 145, column: 7, scope: !941)
!950 = !DILocation(line: 158, column: 7, scope: !941)
!951 = !DILocation(line: 159, column: 7, scope: !941)
!952 = !DILocation(line: 160, column: 7, scope: !941)
!953 = !DILocalVariable(name: "program", arg: 1, scope: !954, file: !955, line: 634, type: !130)
!954 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !955, file: !955, line: 634, type: !956, scopeLine: 635, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !958)
!955 = !DIFile(filename: "src/system.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!956 = !DISubroutineType(types: !957)
!957 = !{null, !130}
!958 = !{!953, !959, !968, !969, !971}
!959 = !DILocalVariable(name: "infomap", scope: !954, file: !955, line: 636, type: !960)
!960 = !DICompositeType(tag: DW_TAG_array_type, baseType: !961, size: 896, elements: !966)
!961 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !962)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !954, file: !955, line: 636, size: 128, elements: !963)
!963 = !{!964, !965}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !962, file: !955, line: 636, baseType: !130, size: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !962, file: !955, line: 636, baseType: !130, size: 64, offset: 64)
!966 = !{!967}
!967 = !DISubrange(count: 7)
!968 = !DILocalVariable(name: "node", scope: !954, file: !955, line: 646, type: !130)
!969 = !DILocalVariable(name: "map_prog", scope: !954, file: !955, line: 647, type: !970)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!971 = !DILocalVariable(name: "lc_messages", scope: !954, file: !955, line: 659, type: !130)
!972 = !DILocation(line: 0, scope: !954, inlinedAt: !973)
!973 = distinct !DILocation(line: 167, column: 7, scope: !941)
!974 = !DILocation(line: 636, column: 3, scope: !954, inlinedAt: !973)
!975 = !DILocation(line: 636, column: 67, scope: !954, inlinedAt: !973)
!976 = !DILocation(line: 647, column: 36, scope: !954, inlinedAt: !973)
!977 = !DILocation(line: 649, column: 3, scope: !954, inlinedAt: !973)
!978 = !DILocation(line: 649, column: 33, scope: !954, inlinedAt: !973)
!979 = !DILocation(line: 650, column: 13, scope: !954, inlinedAt: !973)
!980 = !DILocation(line: 649, column: 20, scope: !954, inlinedAt: !973)
!981 = !{!982, !937, i64 0}
!982 = !{!"infomap", !937, i64 0, !937, i64 8}
!983 = !DILocation(line: 649, column: 10, scope: !954, inlinedAt: !973)
!984 = !DILocation(line: 649, column: 28, scope: !954, inlinedAt: !973)
!985 = distinct !{!985, !977, !979, !986}
!986 = !{!"llvm.loop.mustprogress"}
!987 = !DILocation(line: 652, column: 17, scope: !988, inlinedAt: !973)
!988 = distinct !DILexicalBlock(scope: !954, file: !955, line: 652, column: 7)
!989 = !{!982, !937, i64 8}
!990 = !DILocation(line: 652, column: 7, scope: !988, inlinedAt: !973)
!991 = !DILocation(line: 652, column: 7, scope: !954, inlinedAt: !973)
!992 = !DILocation(line: 655, column: 3, scope: !954, inlinedAt: !973)
!993 = !DILocation(line: 659, column: 29, scope: !954, inlinedAt: !973)
!994 = !DILocation(line: 660, column: 7, scope: !995, inlinedAt: !973)
!995 = distinct !DILexicalBlock(scope: !954, file: !955, line: 660, column: 7)
!996 = !DILocation(line: 660, column: 19, scope: !995, inlinedAt: !973)
!997 = !DILocation(line: 660, column: 22, scope: !995, inlinedAt: !973)
!998 = !DILocation(line: 660, column: 7, scope: !954, inlinedAt: !973)
!999 = !DILocation(line: 666, column: 7, scope: !1000, inlinedAt: !973)
!1000 = distinct !DILexicalBlock(scope: !995, file: !955, line: 661, column: 5)
!1001 = !DILocation(line: 668, column: 5, scope: !1000, inlinedAt: !973)
!1002 = !DILocation(line: 669, column: 3, scope: !954, inlinedAt: !973)
!1003 = !DILocation(line: 671, column: 3, scope: !954, inlinedAt: !973)
!1004 = !DILocation(line: 673, column: 1, scope: !954, inlinedAt: !973)
!1005 = !DILocation(line: 169, column: 3, scope: !925)
!1006 = !DISubprogram(name: "dcgettext", scope: !1007, file: !1007, line: 51, type: !1008, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !142)
!1007 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!35, !130, !130, !50}
!1010 = !DISubprogram(name: "fputs_unlocked", scope: !1011, file: !1011, line: 667, type: !1012, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !142)
!1011 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!50, !130, !1014}
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !1016, line: 49, size: 1728, elements: !1017)
!1016 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!1017 = !{!1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1033, !1034, !1035, !1036, !1037, !1038, !1040, !1042, !1045, !1047, !1050, !1053, !1054, !1055, !1056, !1057}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1015, file: !1016, line: 51, baseType: !50, size: 32)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1015, file: !1016, line: 54, baseType: !35, size: 64, offset: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1015, file: !1016, line: 55, baseType: !35, size: 64, offset: 128)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1015, file: !1016, line: 56, baseType: !35, size: 64, offset: 192)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1015, file: !1016, line: 57, baseType: !35, size: 64, offset: 256)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1015, file: !1016, line: 58, baseType: !35, size: 64, offset: 320)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1015, file: !1016, line: 59, baseType: !35, size: 64, offset: 384)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1015, file: !1016, line: 60, baseType: !35, size: 64, offset: 448)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1015, file: !1016, line: 61, baseType: !35, size: 64, offset: 512)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1015, file: !1016, line: 64, baseType: !35, size: 64, offset: 576)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1015, file: !1016, line: 65, baseType: !35, size: 64, offset: 640)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1015, file: !1016, line: 66, baseType: !35, size: 64, offset: 704)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1015, file: !1016, line: 68, baseType: !1031, size: 64, offset: 768)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !1016, line: 36, flags: DIFlagFwdDecl)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1015, file: !1016, line: 70, baseType: !1014, size: 64, offset: 832)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1015, file: !1016, line: 72, baseType: !50, size: 32, offset: 896)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1015, file: !1016, line: 73, baseType: !50, size: 32, offset: 928)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1015, file: !1016, line: 74, baseType: !100, size: 64, offset: 960)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1015, file: !1016, line: 77, baseType: !189, size: 16, offset: 1024)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1015, file: !1016, line: 78, baseType: !1039, size: 8, offset: 1040)
!1039 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1015, file: !1016, line: 79, baseType: !1041, size: 8, offset: 1048)
!1041 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 8, elements: !408)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1015, file: !1016, line: 81, baseType: !1043, size: 64, offset: 1088)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64)
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !1016, line: 43, baseType: null)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1015, file: !1016, line: 89, baseType: !1046, size: 64, offset: 1152)
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !41, line: 153, baseType: !101)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1015, file: !1016, line: 91, baseType: !1048, size: 64, offset: 1216)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !1016, line: 37, flags: DIFlagFwdDecl)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1015, file: !1016, line: 92, baseType: !1051, size: 64, offset: 1280)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !1016, line: 38, flags: DIFlagFwdDecl)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1015, file: !1016, line: 93, baseType: !1014, size: 64, offset: 1344)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1015, file: !1016, line: 94, baseType: !37, size: 64, offset: 1408)
