; ModuleID = 'coreutils-8.32/src/chgrp.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.dev_ino = type { i64, i64 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.Chown_option = type { i32, i8, %struct.dev_ino*, i8, i8, i8*, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.dev_ino, %struct.dev_ino, %struct.dev_ino, [3 x i64] }
%struct.group = type { i8*, i8*, i32, i8** }
%struct.passwd = type { i8*, i8*, i32, i32, i8*, i8*, i8* }
%struct.FTS = type { %struct._ftsent*, %struct._ftsent*, %struct._ftsent**, i64, i8*, i32, i32, i64, i64, i32 (%struct._ftsent**, %struct._ftsent**)*, i32, %struct.hash_table*, %union.anon, %struct.I_ring }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 59, type: !272, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !34, globals: !217, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/chgrp.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !12, !26}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Verbosity", file: !6, line: 31, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "src/chown-core.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "V_high", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "V_changes_only", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "V_off", value: 2, isUnsigned: true)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !13, line: 32, baseType: !7, size: 32, elements: !14)
!13 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!14 = !{!15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25}
!15 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!16 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!17 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!18 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!19 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!21 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!22 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!23 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!24 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!25 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !27, line: 25, baseType: !7, size: 32, elements: !28)
!27 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!28 = !{!29, !30, !31, !32, !33}
!29 = !DIEnumerator(name: "LONGINT_OK", value: 0, isUnsigned: true)
!30 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1, isUnsigned: true)
!31 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2, isUnsigned: true)
!32 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3, isUnsigned: true)
!33 = !DIEnumerator(name: "LONGINT_INVALID", value: 4, isUnsigned: true)
!34 = !{!35, !45, !106, !110, !114, !117, !120, !127, !152, !39, !96, !167, !171, !175, !179, !182, !185, !187, !191, !193, !195, !201, !212, !216}
!35 = !DISubprogram(name: "dcgettext", scope: !36, file: !36, line: 51, type: !37, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!36 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!37 = !DISubroutineType(types: !38)
!38 = !{!39, !41, !41, !43}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!43 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!44 = !{}
!45 = !DISubprogram(name: "fputs_unlocked", scope: !46, file: !46, line: 662, type: !47, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!46 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!47 = !DISubroutineType(types: !48)
!48 = !{!43, !41, !49}
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !51, line: 49, size: 1728, elements: !52)
!51 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!52 = !{!53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !68, !69, !70, !71, !75, !77, !79, !83, !86, !88, !91, !94, !95, !97, !101, !102}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !50, file: !51, line: 51, baseType: !43, size: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !50, file: !51, line: 54, baseType: !39, size: 64, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !50, file: !51, line: 55, baseType: !39, size: 64, offset: 128)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !50, file: !51, line: 56, baseType: !39, size: 64, offset: 192)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !50, file: !51, line: 57, baseType: !39, size: 64, offset: 256)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !50, file: !51, line: 58, baseType: !39, size: 64, offset: 320)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !50, file: !51, line: 59, baseType: !39, size: 64, offset: 384)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !50, file: !51, line: 60, baseType: !39, size: 64, offset: 448)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !50, file: !51, line: 61, baseType: !39, size: 64, offset: 512)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !50, file: !51, line: 64, baseType: !39, size: 64, offset: 576)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !50, file: !51, line: 65, baseType: !39, size: 64, offset: 640)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !50, file: !51, line: 66, baseType: !39, size: 64, offset: 704)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !50, file: !51, line: 68, baseType: !66, size: 64, offset: 768)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !51, line: 36, flags: DIFlagFwdDecl)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !50, file: !51, line: 70, baseType: !49, size: 64, offset: 832)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !50, file: !51, line: 72, baseType: !43, size: 32, offset: 896)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !50, file: !51, line: 73, baseType: !43, size: 32, offset: 928)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !50, file: !51, line: 74, baseType: !72, size: 64, offset: 960)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !73, line: 152, baseType: !74)
!73 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!74 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !50, file: !51, line: 77, baseType: !76, size: 16, offset: 1024)
!76 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !50, file: !51, line: 78, baseType: !78, size: 8, offset: 1040)
!78 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !50, file: !51, line: 79, baseType: !80, size: 8, offset: 1048)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 8, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 1)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !50, file: !51, line: 81, baseType: !84, size: 64, offset: 1088)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !51, line: 43, baseType: null)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !50, file: !51, line: 89, baseType: !87, size: 64, offset: 1152)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !73, line: 153, baseType: !74)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !50, file: !51, line: 91, baseType: !89, size: 64, offset: 1216)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !51, line: 37, flags: DIFlagFwdDecl)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !50, file: !51, line: 92, baseType: !92, size: 64, offset: 1280)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !51, line: 38, flags: DIFlagFwdDecl)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !50, file: !51, line: 93, baseType: !49, size: 64, offset: 1344)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !50, file: !51, line: 94, baseType: !96, size: 64, offset: 1408)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !50, file: !51, line: 95, baseType: !98, size: 64, offset: 1472)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !99, line: 46, baseType: !100)
!99 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!100 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !50, file: !51, line: 96, baseType: !43, size: 32, offset: 1536)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !50, file: !51, line: 98, baseType: !103, size: 160, offset: 1568)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 160, elements: !104)
!104 = !{!105}
!105 = !DISubrange(count: 20)
!106 = !DISubprogram(name: "set_program_name", scope: !107, file: !107, line: 37, type: !108, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!107 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!108 = !DISubroutineType(types: !109)
!109 = !{null, !41}
!110 = !DISubprogram(name: "setlocale", scope: !111, file: !111, line: 122, type: !112, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!111 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!112 = !DISubroutineType(types: !113)
!113 = !{!39, !43, !41}
!114 = !DISubprogram(name: "bindtextdomain", scope: !36, file: !36, line: 86, type: !115, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!115 = !DISubroutineType(types: !116)
!116 = !{!39, !41, !41}
!117 = !DISubprogram(name: "textdomain", scope: !36, file: !36, line: 82, type: !118, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!118 = !DISubroutineType(types: !119)
!119 = !{!39, !41}
!120 = !DISubprogram(name: "atexit", scope: !121, file: !121, line: 595, type: !122, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!121 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!122 = !DISubroutineType(types: !123)
!123 = !{!43, !124}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{null}
!127 = !DISubprogram(name: "chopt_init", scope: !6, file: !6, line: 69, type: !128, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!128 = !DISubroutineType(types: !129)
!129 = !{null, !130}
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Chown_option", file: !6, line: 43, size: 320, elements: !132)
!132 = !{!133, !134, !136, !148, !149, !150, !151}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "verbosity", scope: !131, file: !6, line: 46, baseType: !5, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "recurse", scope: !131, file: !6, line: 49, baseType: !135, size: 8, offset: 32)
!135 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "root_dev_ino", scope: !131, file: !6, line: 53, baseType: !137, size: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !139, line: 7, size: 128, elements: !140)
!139 = !DIFile(filename: "./lib/dev-ino.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!140 = !{!141, !145}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !138, file: !139, line: 9, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !143, line: 47, baseType: !144)
!143 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !73, line: 148, baseType: !100)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !138, file: !139, line: 10, baseType: !146, size: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !143, line: 59, baseType: !147)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !73, line: 145, baseType: !100)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "affect_symlink_referent", scope: !131, file: !6, line: 56, baseType: !135, size: 8, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "force_silent", scope: !131, file: !6, line: 59, baseType: !135, size: 8, offset: 136)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "user_name", scope: !131, file: !6, line: 62, baseType: !39, size: 64, offset: 192)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "group_name", scope: !131, file: !6, line: 65, baseType: !39, size: 64, offset: 256)
!152 = !DISubprogram(name: "getopt_long", scope: !153, file: !153, line: 66, type: !154, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!153 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!154 = !DISubroutineType(types: !155)
!155 = !{!43, !43, !156, !41, !158, !165}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !160)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !153, line: 50, size: 256, elements: !161)
!161 = !{!162, !163, !164, !166}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !160, file: !153, line: 52, baseType: !41, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !160, file: !153, line: 55, baseType: !43, size: 32, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !160, file: !153, line: 56, baseType: !165, size: 64, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !160, file: !153, line: 57, baseType: !43, size: 32, offset: 192)
!167 = !DISubprogram(name: "version_etc", scope: !168, file: !168, line: 69, type: !169, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!168 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!169 = !DISubroutineType(types: !170)
!170 = !{null, !49, !41, !41, !41, null}
!171 = !DISubprogram(name: "error", scope: !172, file: !172, line: 52, type: !173, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!172 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!173 = !DISubroutineType(types: !174)
!174 = !{null, !43, !43, !41, null}
!175 = !DISubprogram(name: "quote", scope: !176, file: !176, line: 44, type: !177, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!176 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!177 = !DISubroutineType(types: !178)
!178 = !{!41, !41}
!179 = !DISubprogram(name: "quotearg_style", scope: !13, file: !13, line: 377, type: !180, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!180 = !DISubroutineType(types: !181)
!181 = !{!39, !12, !41}
!182 = !DISubprogram(name: "gid_to_name", scope: !6, file: !6, line: 75, type: !183, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!183 = !DISubroutineType(types: !184)
!184 = !{!39, !7}
!185 = !DISubprogram(name: "xstrdup", scope: !186, file: !186, line: 64, type: !118, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!186 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!187 = !DISubprogram(name: "get_root_dev_ino", scope: !188, file: !188, line: 25, type: !189, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!188 = !DIFile(filename: "./lib/root-dev-ino.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!189 = !DISubroutineType(types: !190)
!190 = !{!137, !137}
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !143, line: 79, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !73, line: 146, baseType: !7)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !143, line: 64, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !73, line: 147, baseType: !7)
!195 = !DISubprogram(name: "chown_files", scope: !6, file: !6, line: 81, type: !196, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!196 = !DISubroutineType(types: !197)
!197 = !{!135, !198, !43, !7, !7, !7, !7, !199}
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!201 = !DISubprogram(name: "getgrnam", scope: !202, file: !202, line: 107, type: !203, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!202 = !DIFile(filename: "/usr/include/grp.h", directory: "")
!203 = !DISubroutineType(types: !204)
!204 = !{!205, !41}
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "group", file: !202, line: 42, size: 256, elements: !207)
!207 = !{!208, !209, !210, !211}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "gr_name", scope: !206, file: !202, line: 44, baseType: !39, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "gr_passwd", scope: !206, file: !202, line: 45, baseType: !39, size: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "gr_gid", scope: !206, file: !202, line: 46, baseType: !194, size: 32, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "gr_mem", scope: !206, file: !202, line: 47, baseType: !198, size: 64, offset: 192)
!212 = !DISubprogram(name: "xstrtoumax", scope: !27, file: !27, line: 48, type: !213, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!213 = !DISubroutineType(types: !214)
!214 = !{!26, !41, !198, !43, !215, !41}
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!216 = !DISubprogram(name: "endgrent", scope: !202, file: !202, line: 67, type: !125, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!217 = !{!218, !270, !0}
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(name: "dev_ino_buf", scope: !220, file: !3, line: 304, type: !138, isLocal: true, isDefinition: true)
!220 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 173, type: !221, scopeLine: 174, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !223)
!221 = !DISubroutineType(types: !222)
!222 = !{!43, !43, !198}
!223 = !{!224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !268}
!224 = !DILocalVariable(name: "argc", arg: 1, scope: !220, file: !3, line: 173, type: !43)
!225 = !DILocalVariable(name: "argv", arg: 2, scope: !220, file: !3, line: 173, type: !198)
!226 = !DILocalVariable(name: "preserve_root", scope: !220, file: !3, line: 175, type: !135)
!227 = !DILocalVariable(name: "gid", scope: !220, file: !3, line: 176, type: !193)
!228 = !DILocalVariable(name: "bit_flags", scope: !220, file: !3, line: 179, type: !43)
!229 = !DILocalVariable(name: "dereference", scope: !220, file: !3, line: 183, type: !43)
!230 = !DILocalVariable(name: "chopt", scope: !220, file: !3, line: 185, type: !131)
!231 = !DILocalVariable(name: "ok", scope: !220, file: !3, line: 186, type: !135)
!232 = !DILocalVariable(name: "optc", scope: !220, file: !3, line: 187, type: !43)
!233 = !DILocalVariable(name: "ref_stats", scope: !234, file: !3, line: 287, type: !236)
!234 = distinct !DILexicalBlock(scope: !235, file: !3, line: 286, column: 5)
!235 = distinct !DILexicalBlock(scope: !220, file: !3, line: 285, column: 7)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !237, line: 46, size: 1152, elements: !238)
!237 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "")
!238 = !{!239, !240, !241, !243, !245, !246, !247, !248, !249, !250, !252, !254, !262, !263, !264}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !236, file: !237, line: 48, baseType: !147, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !236, file: !237, line: 53, baseType: !144, size: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !236, file: !237, line: 61, baseType: !242, size: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !73, line: 151, baseType: !100)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !236, file: !237, line: 62, baseType: !244, size: 32, offset: 192)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !73, line: 150, baseType: !7)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !236, file: !237, line: 64, baseType: !192, size: 32, offset: 224)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !236, file: !237, line: 65, baseType: !194, size: 32, offset: 256)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !236, file: !237, line: 67, baseType: !43, size: 32, offset: 288)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !236, file: !237, line: 69, baseType: !147, size: 64, offset: 320)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !236, file: !237, line: 74, baseType: !72, size: 64, offset: 384)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !236, file: !237, line: 78, baseType: !251, size: 64, offset: 448)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !73, line: 174, baseType: !74)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !236, file: !237, line: 80, baseType: !253, size: 64, offset: 512)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !73, line: 179, baseType: !74)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !236, file: !237, line: 91, baseType: !255, size: 128, offset: 576)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !256, line: 10, size: 128, elements: !257)
!256 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!257 = !{!258, !260}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !255, file: !256, line: 12, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !73, line: 160, baseType: !74)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !255, file: !256, line: 16, baseType: !261, size: 64, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !73, line: 196, baseType: !74)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !236, file: !237, line: 92, baseType: !255, size: 128, offset: 704)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !236, file: !237, line: 93, baseType: !255, size: 128, offset: 832)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !236, file: !237, line: 106, baseType: !265, size: 192, offset: 960)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 192, elements: !266)
!266 = !{!267}
!267 = !DISubrange(count: 3)
!268 = !DILocalVariable(name: "group_name", scope: !269, file: !3, line: 297, type: !39)
!269 = distinct !DILexicalBlock(scope: !235, file: !3, line: 296, column: 5)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(name: "reference_file", scope: !2, file: !3, line: 47, type: !39, isLocal: true, isDefinition: true)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 3328, elements: !273)
!273 = !{!274}
!274 = !DISubrange(count: 13)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(name: "Version", scope: !277, file: !278, line: 2, type: !41, isLocal: false, isDefinition: true)
!277 = distinct !DICompileUnit(language: DW_LANG_C99, file: !278, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !44, globals: !279, splitDebugInlining: false, nameTableKind: None)
!278 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!279 = !{!275}
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "file_name", scope: !282, file: !283, line: 46, type: !41, isLocal: true, isDefinition: true)
!282 = distinct !DICompileUnit(language: DW_LANG_C99, file: !283, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !44, retainedTypes: !284, globals: !322, splitDebugInlining: false, nameTableKind: None)
!283 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!284 = !{!285, !35, !321, !171}
!285 = !DISubprogram(name: "close_stream", scope: !286, file: !286, line: 2, type: !287, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!286 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!287 = !DISubroutineType(types: !288)
!288 = !{!43, !289}
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !51, line: 49, size: 1728, elements: !291)
!291 = !{!292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !290, file: !51, line: 51, baseType: !43, size: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !290, file: !51, line: 54, baseType: !39, size: 64, offset: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !290, file: !51, line: 55, baseType: !39, size: 64, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !290, file: !51, line: 56, baseType: !39, size: 64, offset: 192)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !290, file: !51, line: 57, baseType: !39, size: 64, offset: 256)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !290, file: !51, line: 58, baseType: !39, size: 64, offset: 320)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !290, file: !51, line: 59, baseType: !39, size: 64, offset: 384)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !290, file: !51, line: 60, baseType: !39, size: 64, offset: 448)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !290, file: !51, line: 61, baseType: !39, size: 64, offset: 512)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !290, file: !51, line: 64, baseType: !39, size: 64, offset: 576)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !290, file: !51, line: 65, baseType: !39, size: 64, offset: 640)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !290, file: !51, line: 66, baseType: !39, size: 64, offset: 704)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !290, file: !51, line: 68, baseType: !66, size: 64, offset: 768)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !290, file: !51, line: 70, baseType: !289, size: 64, offset: 832)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !290, file: !51, line: 72, baseType: !43, size: 32, offset: 896)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !290, file: !51, line: 73, baseType: !43, size: 32, offset: 928)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !290, file: !51, line: 74, baseType: !72, size: 64, offset: 960)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !290, file: !51, line: 77, baseType: !76, size: 16, offset: 1024)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !290, file: !51, line: 78, baseType: !78, size: 8, offset: 1040)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !290, file: !51, line: 79, baseType: !80, size: 8, offset: 1048)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !290, file: !51, line: 81, baseType: !84, size: 64, offset: 1088)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !290, file: !51, line: 89, baseType: !87, size: 64, offset: 1152)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !290, file: !51, line: 91, baseType: !89, size: 64, offset: 1216)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !290, file: !51, line: 92, baseType: !92, size: 64, offset: 1280)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !290, file: !51, line: 93, baseType: !289, size: 64, offset: 1344)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !290, file: !51, line: 94, baseType: !96, size: 64, offset: 1408)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !290, file: !51, line: 95, baseType: !98, size: 64, offset: 1472)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !290, file: !51, line: 96, baseType: !43, size: 32, offset: 1536)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !290, file: !51, line: 98, baseType: !103, size: 160, offset: 1568)
!321 = !DISubprogram(name: "quotearg_colon", scope: !13, file: !13, line: 391, type: !118, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!322 = !{!280, !323}
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !282, file: !283, line: 56, type: !135, isLocal: true, isDefinition: true)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "exit_failure", scope: !327, file: !328, line: 24, type: !330, isLocal: false, isDefinition: true)
!327 = distinct !DICompileUnit(language: DW_LANG_C99, file: !328, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !44, globals: !329, splitDebugInlining: false, nameTableKind: None)
!328 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!329 = !{!325}
!330 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !43)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(name: "program_name", scope: !333, file: !334, line: 33, type: !41, isLocal: false, isDefinition: true)
!333 = distinct !DICompileUnit(language: DW_LANG_C99, file: !334, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !44, retainedTypes: !335, globals: !371, splitDebugInlining: false, nameTableKind: None)
!334 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!335 = !{!96, !336, !39}
!336 = !DISubprogram(name: "fputs", scope: !46, file: !46, line: 626, type: !337, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!337 = !DISubroutineType(types: !338)
!338 = !{!43, !41, !339}
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !51, line: 49, size: 1728, elements: !341)
!341 = !{!342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !340, file: !51, line: 51, baseType: !43, size: 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !340, file: !51, line: 54, baseType: !39, size: 64, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !340, file: !51, line: 55, baseType: !39, size: 64, offset: 128)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !340, file: !51, line: 56, baseType: !39, size: 64, offset: 192)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !340, file: !51, line: 57, baseType: !39, size: 64, offset: 256)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !340, file: !51, line: 58, baseType: !39, size: 64, offset: 320)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !340, file: !51, line: 59, baseType: !39, size: 64, offset: 384)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !340, file: !51, line: 60, baseType: !39, size: 64, offset: 448)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !340, file: !51, line: 61, baseType: !39, size: 64, offset: 512)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !340, file: !51, line: 64, baseType: !39, size: 64, offset: 576)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !340, file: !51, line: 65, baseType: !39, size: 64, offset: 640)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !340, file: !51, line: 66, baseType: !39, size: 64, offset: 704)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !340, file: !51, line: 68, baseType: !66, size: 64, offset: 768)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !340, file: !51, line: 70, baseType: !339, size: 64, offset: 832)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !340, file: !51, line: 72, baseType: !43, size: 32, offset: 896)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !340, file: !51, line: 73, baseType: !43, size: 32, offset: 928)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !340, file: !51, line: 74, baseType: !72, size: 64, offset: 960)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !340, file: !51, line: 77, baseType: !76, size: 16, offset: 1024)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !340, file: !51, line: 78, baseType: !78, size: 8, offset: 1040)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !340, file: !51, line: 79, baseType: !80, size: 8, offset: 1048)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !340, file: !51, line: 81, baseType: !84, size: 64, offset: 1088)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !340, file: !51, line: 89, baseType: !87, size: 64, offset: 1152)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !340, file: !51, line: 91, baseType: !89, size: 64, offset: 1216)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !340, file: !51, line: 92, baseType: !92, size: 64, offset: 1280)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !340, file: !51, line: 93, baseType: !339, size: 64, offset: 1344)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !340, file: !51, line: 94, baseType: !96, size: 64, offset: 1408)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !340, file: !51, line: 95, baseType: !98, size: 64, offset: 1472)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !340, file: !51, line: 96, baseType: !43, size: 32, offset: 1536)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !340, file: !51, line: 98, baseType: !103, size: 160, offset: 1568)
!371 = !{!331}
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !374, file: !375, line: 85, type: !493, isLocal: false, isDefinition: true)
!374 = distinct !DICompileUnit(language: DW_LANG_C99, file: !375, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !376, retainedTypes: !397, globals: !466, splitDebugInlining: false, nameTableKind: None)
!375 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!376 = !{!12, !377, !382}
!377 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !13, line: 242, baseType: !7, size: 32, elements: !378)
!378 = !{!379, !380, !381}
!379 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!380 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!381 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!382 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !383, line: 46, baseType: !7, size: 32, elements: !384)
!383 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!384 = !{!385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396}
!385 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!386 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!387 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!388 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!389 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!390 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!391 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!392 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!393 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!394 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!395 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!396 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!397 = !{!398, !403, !418, !421, !43, !76, !424, !98, !441, !445, !35, !451, !455, !39, !459, !462, !463}
!398 = !DISubprogram(name: "xmemdup", scope: !186, file: !186, line: 62, type: !399, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!399 = !DISubroutineType(types: !400)
!400 = !{!96, !401, !100}
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!403 = !DISubprogram(name: "quotearg_alloc_mem", scope: !13, file: !13, line: 342, type: !404, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!404 = !DISubroutineType(types: !405)
!405 = !{!39, !41, !100, !215, !406}
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !408)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !375, line: 65, size: 448, elements: !409)
!409 = !{!410, !411, !412, !416, !417}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !408, file: !375, line: 68, baseType: !12, size: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !408, file: !375, line: 71, baseType: !43, size: 32, offset: 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !408, file: !375, line: 75, baseType: !413, size: 256, offset: 64)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !414)
!414 = !{!415}
!415 = !DISubrange(count: 8)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !408, file: !375, line: 78, baseType: !41, size: 64, offset: 320)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !408, file: !375, line: 81, baseType: !41, size: 64, offset: 384)
!418 = !DISubprogram(name: "free", scope: !121, file: !121, line: 565, type: !419, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!419 = !DISubroutineType(types: !420)
!420 = !{null, !96}
!421 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !13, file: !13, line: 408, type: !422, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!422 = !DISubroutineType(types: !423)
!423 = !{!39, !43, !41, !41, !41, !100}
!424 = !DISubprogram(name: "rpl_mbrtowc", scope: !425, file: !425, line: 717, type: !426, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!425 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!426 = !DISubroutineType(types: !427)
!427 = !{!100, !165, !41, !100, !428}
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !430, line: 13, size: 64, elements: !431)
!430 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!431 = !{!432, !433}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !429, file: !430, line: 15, baseType: !43, size: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !429, file: !430, line: 20, baseType: !434, size: 32, offset: 32)
!434 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !429, file: !430, line: 16, size: 32, elements: !435)
!435 = !{!436, !437}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !434, file: !430, line: 18, baseType: !7, size: 32)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !434, file: !430, line: 19, baseType: !438, size: 32)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 32, elements: !439)
!439 = !{!440}
!440 = !DISubrange(count: 4)
!441 = !DISubprogram(name: "iswprint", scope: !442, file: !442, line: 120, type: !443, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!442 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!443 = !DISubroutineType(types: !444)
!444 = !{!43, !7}
!445 = !DISubprogram(name: "mbsinit", scope: !446, file: !446, line: 292, type: !447, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!446 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!447 = !DISubroutineType(types: !448)
!448 = !{!43, !449}
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !429)
!451 = !DISubprogram(name: "locale_charset", scope: !452, file: !452, line: 35, type: !453, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!452 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!453 = !DISubroutineType(types: !454)
!454 = !{!41}
!455 = !DISubprogram(name: "c_strcasecmp", scope: !456, file: !456, line: 42, type: !457, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!456 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!457 = !DISubroutineType(types: !458)
!458 = !{!43, !41, !41}
!459 = !DISubprogram(name: "xmalloc", scope: !186, file: !186, line: 53, type: !460, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!460 = !DISubroutineType(types: !461)
!461 = !{!96, !100}
!462 = !DISubprogram(name: "xalloc_die", scope: !186, file: !186, line: 51, type: !125, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !44)
!463 = !DISubprogram(name: "xrealloc", scope: !186, file: !186, line: 59, type: !464, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!464 = !DISubroutineType(types: !465)
!465 = !{!96, !96, !100}
!466 = !{!372, !467, !473, !475, !477, !482, !489, !491}
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !374, file: !375, line: 101, type: !469, isLocal: false, isDefinition: true)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !470, size: 320, elements: !471)
!470 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!471 = !{!472}
!472 = !DISubrange(count: 10)
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !374, file: !375, line: 1052, type: !408, isLocal: false, isDefinition: true)
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !374, file: !375, line: 116, type: !408, isLocal: true, isDefinition: true)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(name: "slot0", scope: !374, file: !375, line: 842, type: !479, isLocal: true, isDefinition: true)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 2048, elements: !480)
!480 = !{!481}
!481 = !DISubrange(count: 256)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(name: "slotvec", scope: !374, file: !375, line: 845, type: !484, isLocal: true, isDefinition: true)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !375, line: 834, size: 128, elements: !486)
!486 = !{!487, !488}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !485, file: !375, line: 836, baseType: !98, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !485, file: !375, line: 837, baseType: !39, size: 64, offset: 64)
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(name: "nslots", scope: !374, file: !375, line: 843, type: !43, isLocal: true, isDefinition: true)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(name: "slotvec0", scope: !374, file: !375, line: 844, type: !485, isLocal: true, isDefinition: true)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !494, size: 704, elements: !495)
!494 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!495 = !{!496}
!496 = !DISubrange(count: 11)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !499, file: !500, line: 26, type: !502, isLocal: false, isDefinition: true)
!499 = distinct !DICompileUnit(language: DW_LANG_C99, file: !500, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !44, globals: !501, splitDebugInlining: false, nameTableKind: None)
!500 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!501 = !{!497}
!502 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 376, elements: !503)
!503 = !{!504}
!504 = !DISubrange(count: 47)
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(name: "default_tuning", scope: !507, file: !508, line: 130, type: !515, isLocal: true, isDefinition: true)
!507 = distinct !DICompileUnit(language: DW_LANG_C99, file: !508, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !44, retainedTypes: !509, globals: !514, splitDebugInlining: false, nameTableKind: None)
!508 = !DIFile(filename: "lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!509 = !{!100, !96, !510, !418, !98}
!510 = !DISubprogram(name: "rpl_calloc", scope: !511, file: !511, line: 688, type: !512, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!511 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!512 = !DISubroutineType(types: !513)
!513 = !{!96, !100, !100}
!514 = !{!505}
!515 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !516)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !517, line: 65, baseType: !518)
!517 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !517, line: 53, size: 160, elements: !519)
!519 = !{!520, !522, !523, !524, !525}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !518, file: !517, line: 58, baseType: !521, size: 32)
!521 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !518, file: !517, line: 59, baseType: !521, size: 32, offset: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !518, file: !517, line: 60, baseType: !521, size: 32, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !518, file: !517, line: 61, baseType: !521, size: 32, offset: 96)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !518, file: !517, line: 62, baseType: !135, size: 8, offset: 128)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !528, file: !529, line: 507, type: !43, isLocal: true, isDefinition: true)
!528 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !529, file: !529, line: 488, type: !530, scopeLine: 489, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !532, retainedNodes: !543)
!529 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!530 = !DISubroutineType(types: !531)
!531 = !{!43, !43, !43}
!532 = distinct !DICompileUnit(language: DW_LANG_C99, file: !529, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !44, retainedTypes: !533, globals: !542, splitDebugInlining: false, nameTableKind: None)
!533 = !{!534, !538}
!534 = !DISubprogram(name: "fcntl", scope: !535, file: !535, line: 176, type: !536, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!535 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
!536 = !DISubroutineType(types: !537)
!537 = !{!43, !43, !43, null}
!538 = !DISubprogram(name: "close", scope: !539, file: !539, line: 353, type: !540, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!539 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!540 = !DISubroutineType(types: !541)
!541 = !{!43, !43}
!542 = !{!526}
!543 = !{!544, !545, !546, !547, !550}
!544 = !DILocalVariable(name: "fd", arg: 1, scope: !528, file: !529, line: 488, type: !43)
!545 = !DILocalVariable(name: "target", arg: 2, scope: !528, file: !529, line: 488, type: !43)
!546 = !DILocalVariable(name: "result", scope: !528, file: !529, line: 490, type: !43)
!547 = !DILocalVariable(name: "flags", scope: !548, file: !529, line: 531, type: !43)
!548 = distinct !DILexicalBlock(scope: !549, file: !529, line: 530, column: 5)
!549 = distinct !DILexicalBlock(scope: !528, file: !529, line: 529, column: 7)
!550 = !DILocalVariable(name: "saved_errno", scope: !551, file: !529, line: 534, type: !43)
!551 = distinct !DILexicalBlock(scope: !552, file: !529, line: 533, column: 9)
!552 = distinct !DILexicalBlock(scope: !548, file: !529, line: 532, column: 11)
!553 = distinct !DICompileUnit(language: DW_LANG_C99, file: !554, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !555, retainedTypes: !569, splitDebugInlining: false, nameTableKind: None)
!554 = !DIFile(filename: "src/chown-core.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!555 = !{!5, !12, !556, !563}
!556 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RCH_status", file: !554, line: 38, baseType: !7, size: 32, elements: !557)
!557 = !{!558, !559, !560, !561, !562}
!558 = !DIEnumerator(name: "RC_ok", value: 2, isUnsigned: true)
!559 = !DIEnumerator(name: "RC_excluded", value: 3, isUnsigned: true)
!560 = !DIEnumerator(name: "RC_inode_changed", value: 4, isUnsigned: true)
!561 = !DIEnumerator(name: "RC_do_ordinary_chown", value: 5, isUnsigned: true)
!562 = !DIEnumerator(name: "RC_error", value: 6, isUnsigned: true)
!563 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Change_status", file: !6, line: 23, baseType: !7, size: 32, elements: !564)
!564 = !{!565, !566, !567, !568}
!565 = !DIEnumerator(name: "CH_NOT_APPLIED", value: 1, isUnsigned: true)
!566 = !DIEnumerator(name: "CH_SUCCEEDED", value: 2, isUnsigned: true)
!567 = !DIEnumerator(name: "CH_FAILED", value: 3, isUnsigned: true)
!568 = !DIEnumerator(name: "CH_NO_CHANGE_REQUESTED", value: 4, isUnsigned: true)
!569 = !{!418, !570, !580, !185, !584, !191, !193, !598, !701, !96, !35, !171, !704, !179, !707, !710, !713, !714, !719, !722, !725, !538, !459}
!570 = !DISubprogram(name: "getgrgid", scope: !202, file: !202, line: 101, type: !571, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!571 = !DISubroutineType(types: !572)
!572 = !{!573, !7}
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "group", file: !202, line: 42, size: 256, elements: !575)
!575 = !{!576, !577, !578, !579}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "gr_name", scope: !574, file: !202, line: 44, baseType: !39, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "gr_passwd", scope: !574, file: !202, line: 45, baseType: !39, size: 64, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "gr_gid", scope: !574, file: !202, line: 46, baseType: !194, size: 32, offset: 128)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "gr_mem", scope: !574, file: !202, line: 47, baseType: !198, size: 64, offset: 192)
!580 = !DISubprogram(name: "umaxtostr", scope: !581, file: !581, line: 46, type: !582, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!581 = !DIFile(filename: "./lib/inttostr.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!582 = !DISubroutineType(types: !583)
!583 = !{!39, !100, !39}
!584 = !DISubprogram(name: "getpwuid", scope: !585, file: !585, line: 110, type: !586, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!585 = !DIFile(filename: "/usr/include/pwd.h", directory: "")
!586 = !DISubroutineType(types: !587)
!587 = !{!588, !7}
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !585, line: 49, size: 384, elements: !590)
!590 = !{!591, !592, !593, !594, !595, !596, !597}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !589, file: !585, line: 51, baseType: !39, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !589, file: !585, line: 52, baseType: !39, size: 64, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !589, file: !585, line: 54, baseType: !192, size: 32, offset: 128)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !589, file: !585, line: 55, baseType: !194, size: 32, offset: 160)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !589, file: !585, line: 56, baseType: !39, size: 64, offset: 192)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !589, file: !585, line: 57, baseType: !39, size: 64, offset: 256)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !589, file: !585, line: 58, baseType: !39, size: 64, offset: 320)
!598 = !DISubprogram(name: "xfts_open", scope: !599, file: !599, line: 5, type: !600, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!599 = !DIFile(filename: "./lib/xfts.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!600 = !DISubroutineType(types: !601)
!601 = !{!602, !156, !43, !673}
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !604, line: 80, size: 1024, elements: !605)
!604 = !DIFile(filename: "./lib/fts_.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!605 = !{!606, !663, !664, !666, !667, !668, !669, !670, !671, !672, !679, !680, !683, !690}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !603, file: !604, line: 81, baseType: !607, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !604, line: 199, size: 2112, elements: !609)
!609 = !{!610, !611, !612, !613, !618, !619, !620, !621, !622, !623, !624, !625, !628, !630, !631, !633, !634, !635, !636, !659}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !608, file: !604, line: 200, baseType: !607, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !608, file: !604, line: 201, baseType: !607, size: 64, offset: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !608, file: !604, line: 202, baseType: !607, size: 64, offset: 128)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !608, file: !604, line: 203, baseType: !614, size: 64, offset: 192)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !616, line: 127, baseType: !617)
!616 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!617 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !616, line: 127, flags: DIFlagFwdDecl)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !608, file: !604, line: 206, baseType: !74, size: 64, offset: 256)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !608, file: !604, line: 207, baseType: !96, size: 64, offset: 320)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !608, file: !604, line: 208, baseType: !39, size: 64, offset: 384)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !608, file: !604, line: 209, baseType: !39, size: 64, offset: 448)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !608, file: !604, line: 210, baseType: !43, size: 32, offset: 512)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !608, file: !604, line: 211, baseType: !43, size: 32, offset: 544)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !608, file: !604, line: 212, baseType: !98, size: 64, offset: 576)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !608, file: !604, line: 214, baseType: !626, size: 64, offset: 640)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !604, line: 197, baseType: !603)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !608, file: !604, line: 218, baseType: !629, size: 64, offset: 704)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !99, line: 35, baseType: !74)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !608, file: !604, line: 220, baseType: !98, size: 64, offset: 768)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "fts_n_dirs_remaining", scope: !608, file: !604, line: 225, baseType: !632, size: 64, offset: 832)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !143, line: 74, baseType: !242)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !608, file: !604, line: 241, baseType: !76, size: 16, offset: 896)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !608, file: !604, line: 245, baseType: !76, size: 16, offset: 912)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !608, file: !604, line: 251, baseType: !76, size: 16, offset: 928)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !608, file: !604, line: 253, baseType: !637, size: 1152, offset: 960)
!637 = !DICompositeType(tag: DW_TAG_array_type, baseType: !638, size: 1152, elements: !81)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !237, line: 46, size: 1152, elements: !639)
!639 = !{!640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !656, !657, !658}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !638, file: !237, line: 48, baseType: !147, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !638, file: !237, line: 53, baseType: !144, size: 64, offset: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !638, file: !237, line: 61, baseType: !242, size: 64, offset: 128)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !638, file: !237, line: 62, baseType: !244, size: 32, offset: 192)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !638, file: !237, line: 64, baseType: !192, size: 32, offset: 224)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !638, file: !237, line: 65, baseType: !194, size: 32, offset: 256)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !638, file: !237, line: 67, baseType: !43, size: 32, offset: 288)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !638, file: !237, line: 69, baseType: !147, size: 64, offset: 320)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !638, file: !237, line: 74, baseType: !72, size: 64, offset: 384)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !638, file: !237, line: 78, baseType: !251, size: 64, offset: 448)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !638, file: !237, line: 80, baseType: !253, size: 64, offset: 512)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !638, file: !237, line: 91, baseType: !652, size: 128, offset: 576)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !256, line: 10, size: 128, elements: !653)
!653 = !{!654, !655}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !652, file: !256, line: 12, baseType: !259, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !652, file: !256, line: 16, baseType: !261, size: 64, offset: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !638, file: !237, line: 92, baseType: !652, size: 128, offset: 704)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !638, file: !237, line: 93, baseType: !652, size: 128, offset: 832)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !638, file: !237, line: 106, baseType: !265, size: 192, offset: 960)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "fts_name", scope: !608, file: !604, line: 254, baseType: !660, offset: 2112)
!660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, elements: !661)
!661 = !{!662}
!662 = !DISubrange(count: -1)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "fts_child", scope: !603, file: !604, line: 82, baseType: !607, size: 64, offset: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "fts_array", scope: !603, file: !604, line: 83, baseType: !665, size: 64, offset: 128)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !603, file: !604, line: 84, baseType: !146, size: 64, offset: 192)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !603, file: !604, line: 85, baseType: !39, size: 64, offset: 256)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "fts_rfd", scope: !603, file: !604, line: 86, baseType: !43, size: 32, offset: 320)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cwd_fd", scope: !603, file: !604, line: 87, baseType: !43, size: 32, offset: 352)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !603, file: !604, line: 89, baseType: !98, size: 64, offset: 384)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "fts_nitems", scope: !603, file: !604, line: 90, baseType: !98, size: 64, offset: 448)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "fts_compar", scope: !603, file: !604, line: 91, baseType: !673, size: 64, offset: 512)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DISubroutineType(types: !675)
!675 = !{!43, !676, !676}
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !608)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "fts_options", scope: !603, file: !604, line: 160, baseType: !43, size: 32, offset: 576)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "fts_leaf_optimization_works_ht", scope: !603, file: !604, line: 169, baseType: !681, size: 64, offset: 640)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !604, line: 169, flags: DIFlagFwdDecl)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !603, file: !604, line: 191, baseType: !684, size: 64, offset: 704)
!684 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !603, file: !604, line: 171, size: 64, elements: !685)
!685 = !{!686, !687}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !684, file: !604, line: 184, baseType: !681, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !684, file: !604, line: 190, baseType: !688, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DICompositeType(tag: DW_TAG_structure_type, name: "cycle_check_state", file: !604, line: 190, flags: DIFlagFwdDecl)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fd_ring", scope: !603, file: !604, line: 196, baseType: !691, size: 256, offset: 768)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "I_ring", file: !692, line: 39, baseType: !693)
!692 = !DIFile(filename: "./lib/i-ring.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "I_ring", file: !692, line: 31, size: 256, elements: !694)
!694 = !{!695, !697, !698, !699, !700}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "ir_data", scope: !693, file: !692, line: 33, baseType: !696, size: 128)
!696 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 128, elements: !439)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "ir_default_val", scope: !693, file: !692, line: 34, baseType: !43, size: 32, offset: 128)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "ir_front", scope: !693, file: !692, line: 35, baseType: !7, size: 32, offset: 160)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "ir_back", scope: !693, file: !692, line: 36, baseType: !7, size: 32, offset: 192)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "ir_empty", scope: !693, file: !692, line: 37, baseType: !135, size: 8, offset: 224)
!701 = !DISubprogram(name: "rpl_fts_read", scope: !604, file: !604, line: 280, type: !702, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!702 = !DISubroutineType(types: !703)
!703 = !{!607, !602}
!704 = !DISubprogram(name: "rpl_fts_close", scope: !604, file: !604, line: 276, type: !705, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!705 = !DISubroutineType(types: !706)
!706 = !{!43, !602}
!707 = !DISubprogram(name: "quotearg_n_style", scope: !13, file: !13, line: 368, type: !708, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!708 = !DISubroutineType(types: !709)
!709 = !{!39, !43, !12, !41}
!710 = !DISubprogram(name: "rpl_fts_set", scope: !604, file: !604, line: 281, type: !711, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!711 = !DISubroutineType(types: !712)
!712 = !{!43, !602, !607, !43}
!713 = !DISubprogram(name: "quotearg_n_style_colon", scope: !13, file: !13, line: 397, type: !708, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!714 = !DISubprogram(name: "cycle_warning_required", scope: !599, file: !599, line: 9, type: !715, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!715 = !DISubroutineType(types: !716)
!716 = !{!135, !717, !677}
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !603)
!719 = !DISubprogram(name: "fchownat", scope: !539, file: !539, line: 491, type: !720, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!720 = !DISubroutineType(types: !721)
!721 = !{!43, !43, !41, !7, !7, !43}
!722 = !DISubprogram(name: "openat", scope: !535, file: !535, line: 220, type: !723, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!723 = !DISubroutineType(types: !724)
!724 = !{!43, !43, !41, !43, null}
!725 = !DISubprogram(name: "fchown", scope: !539, file: !539, line: 478, type: !726, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!726 = !DISubroutineType(types: !727)
!727 = !{!43, !43, !7, !7}
!728 = distinct !DICompileUnit(language: DW_LANG_C99, file: !729, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !44, retainedTypes: !730, splitDebugInlining: false, nameTableKind: None)
!729 = !DIFile(filename: "lib/umaxtostr.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!730 = !{!731}
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !732, line: 102, baseType: !733)
!732 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !73, line: 73, baseType: !100)
!734 = distinct !DICompileUnit(language: DW_LANG_C99, file: !735, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !44, splitDebugInlining: false, nameTableKind: None)
!735 = !DIFile(filename: "lib/root-dev-ino.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!736 = distinct !DICompileUnit(language: DW_LANG_C99, file: !737, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !738, retainedTypes: !742, splitDebugInlining: false, nameTableKind: None)
!737 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!738 = !{!739}
!739 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !737, line: 40, baseType: !7, size: 32, elements: !740)
!740 = !{!741}
!741 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!742 = !{!35, !743, !96}
!743 = !DISubprogram(name: "fputs_unlocked", scope: !46, file: !46, line: 662, type: !744, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!744 = !DISubroutineType(types: !745)
!745 = !{!43, !41, !746}
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !51, line: 49, size: 1728, elements: !748)
!748 = !{!749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !747, file: !51, line: 51, baseType: !43, size: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !747, file: !51, line: 54, baseType: !39, size: 64, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !747, file: !51, line: 55, baseType: !39, size: 64, offset: 128)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !747, file: !51, line: 56, baseType: !39, size: 64, offset: 192)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !747, file: !51, line: 57, baseType: !39, size: 64, offset: 256)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !747, file: !51, line: 58, baseType: !39, size: 64, offset: 320)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !747, file: !51, line: 59, baseType: !39, size: 64, offset: 384)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !747, file: !51, line: 60, baseType: !39, size: 64, offset: 448)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !747, file: !51, line: 61, baseType: !39, size: 64, offset: 512)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !747, file: !51, line: 64, baseType: !39, size: 64, offset: 576)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !747, file: !51, line: 65, baseType: !39, size: 64, offset: 640)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !747, file: !51, line: 66, baseType: !39, size: 64, offset: 704)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !747, file: !51, line: 68, baseType: !66, size: 64, offset: 768)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !747, file: !51, line: 70, baseType: !746, size: 64, offset: 832)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !747, file: !51, line: 72, baseType: !43, size: 32, offset: 896)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !747, file: !51, line: 73, baseType: !43, size: 32, offset: 928)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !747, file: !51, line: 74, baseType: !72, size: 64, offset: 960)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !747, file: !51, line: 77, baseType: !76, size: 16, offset: 1024)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !747, file: !51, line: 78, baseType: !78, size: 8, offset: 1040)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !747, file: !51, line: 79, baseType: !80, size: 8, offset: 1048)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !747, file: !51, line: 81, baseType: !84, size: 64, offset: 1088)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !747, file: !51, line: 89, baseType: !87, size: 64, offset: 1152)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !747, file: !51, line: 91, baseType: !89, size: 64, offset: 1216)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !747, file: !51, line: 92, baseType: !92, size: 64, offset: 1280)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !747, file: !51, line: 93, baseType: !746, size: 64, offset: 1344)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !747, file: !51, line: 94, baseType: !96, size: 64, offset: 1408)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !747, file: !51, line: 95, baseType: !98, size: 64, offset: 1472)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !747, file: !51, line: 96, baseType: !43, size: 32, offset: 1536)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !747, file: !51, line: 98, baseType: !103, size: 160, offset: 1568)
!778 = distinct !DICompileUnit(language: DW_LANG_C99, file: !779, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !780, retainedTypes: !793, splitDebugInlining: false, nameTableKind: None)
!779 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!780 = !{!781}
!781 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !782, file: !186, line: 186, baseType: !7, size: 32, elements: !791)
!782 = distinct !DISubprogram(name: "x2nrealloc", scope: !186, file: !186, line: 174, type: !783, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !778, retainedNodes: !786)
!783 = !DISubroutineType(types: !784)
!784 = !{!96, !96, !785, !98}
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!786 = !{!787, !788, !789, !790}
!787 = !DILocalVariable(name: "p", arg: 1, scope: !782, file: !186, line: 174, type: !96)
!788 = !DILocalVariable(name: "pn", arg: 2, scope: !782, file: !186, line: 174, type: !785)
!789 = !DILocalVariable(name: "s", arg: 3, scope: !782, file: !186, line: 174, type: !98)
!790 = !DILocalVariable(name: "n", scope: !782, file: !186, line: 176, type: !98)
!791 = !{!792}
!792 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!793 = !{!98, !462, !459, !463, !39, !418, !96, !794, !510}
!794 = !DISubprogram(name: "xcalloc", scope: !186, file: !186, line: 57, type: !512, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!795 = distinct !DICompileUnit(language: DW_LANG_C99, file: !796, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !44, retainedTypes: !797, splitDebugInlining: false, nameTableKind: None)
!796 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!797 = !{!35, !171}
!798 = distinct !DICompileUnit(language: DW_LANG_C99, file: !799, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !44, retainedTypes: !800, splitDebugInlining: false, nameTableKind: None)
!799 = !DIFile(filename: "lib/xfts.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!800 = !{!801, !96, !462}
!801 = !DISubprogram(name: "rpl_fts_open", scope: !604, file: !604, line: 277, type: !802, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!802 = !DISubroutineType(types: !803)
!803 = !{!804, !156, !43, !865}
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !604, line: 80, size: 1024, elements: !806)
!806 = !{!807, !855, !856, !858, !859, !860, !861, !862, !863, !864, !871, !872, !873, !878}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !805, file: !604, line: 81, baseType: !808, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !604, line: 199, size: 2112, elements: !810)
!810 = !{!811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !825, !826, !827, !828, !829, !830, !831, !854}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !809, file: !604, line: 200, baseType: !808, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !809, file: !604, line: 201, baseType: !808, size: 64, offset: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !809, file: !604, line: 202, baseType: !808, size: 64, offset: 128)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !809, file: !604, line: 203, baseType: !614, size: 64, offset: 192)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !809, file: !604, line: 206, baseType: !74, size: 64, offset: 256)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !809, file: !604, line: 207, baseType: !96, size: 64, offset: 320)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !809, file: !604, line: 208, baseType: !39, size: 64, offset: 384)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !809, file: !604, line: 209, baseType: !39, size: 64, offset: 448)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !809, file: !604, line: 210, baseType: !43, size: 32, offset: 512)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !809, file: !604, line: 211, baseType: !43, size: 32, offset: 544)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !809, file: !604, line: 212, baseType: !98, size: 64, offset: 576)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !809, file: !604, line: 214, baseType: !823, size: 64, offset: 640)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !604, line: 197, baseType: !805)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !809, file: !604, line: 218, baseType: !629, size: 64, offset: 704)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !809, file: !604, line: 220, baseType: !98, size: 64, offset: 768)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "fts_n_dirs_remaining", scope: !809, file: !604, line: 225, baseType: !632, size: 64, offset: 832)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !809, file: !604, line: 241, baseType: !76, size: 16, offset: 896)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !809, file: !604, line: 245, baseType: !76, size: 16, offset: 912)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !809, file: !604, line: 251, baseType: !76, size: 16, offset: 928)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !809, file: !604, line: 253, baseType: !832, size: 1152, offset: 960)
!832 = !DICompositeType(tag: DW_TAG_array_type, baseType: !833, size: 1152, elements: !81)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !237, line: 46, size: 1152, elements: !834)
!834 = !{!835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !851, !852, !853}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !833, file: !237, line: 48, baseType: !147, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !833, file: !237, line: 53, baseType: !144, size: 64, offset: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !833, file: !237, line: 61, baseType: !242, size: 64, offset: 128)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !833, file: !237, line: 62, baseType: !244, size: 32, offset: 192)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !833, file: !237, line: 64, baseType: !192, size: 32, offset: 224)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !833, file: !237, line: 65, baseType: !194, size: 32, offset: 256)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !833, file: !237, line: 67, baseType: !43, size: 32, offset: 288)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !833, file: !237, line: 69, baseType: !147, size: 64, offset: 320)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !833, file: !237, line: 74, baseType: !72, size: 64, offset: 384)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !833, file: !237, line: 78, baseType: !251, size: 64, offset: 448)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !833, file: !237, line: 80, baseType: !253, size: 64, offset: 512)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !833, file: !237, line: 91, baseType: !847, size: 128, offset: 576)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !256, line: 10, size: 128, elements: !848)
!848 = !{!849, !850}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !847, file: !256, line: 12, baseType: !259, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !847, file: !256, line: 16, baseType: !261, size: 64, offset: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !833, file: !237, line: 92, baseType: !847, size: 128, offset: 704)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !833, file: !237, line: 93, baseType: !847, size: 128, offset: 832)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !833, file: !237, line: 106, baseType: !265, size: 192, offset: 960)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "fts_name", scope: !809, file: !604, line: 254, baseType: !660, offset: 2112)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "fts_child", scope: !805, file: !604, line: 82, baseType: !808, size: 64, offset: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "fts_array", scope: !805, file: !604, line: 83, baseType: !857, size: 64, offset: 128)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !805, file: !604, line: 84, baseType: !146, size: 64, offset: 192)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !805, file: !604, line: 85, baseType: !39, size: 64, offset: 256)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "fts_rfd", scope: !805, file: !604, line: 86, baseType: !43, size: 32, offset: 320)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cwd_fd", scope: !805, file: !604, line: 87, baseType: !43, size: 32, offset: 352)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !805, file: !604, line: 89, baseType: !98, size: 64, offset: 384)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "fts_nitems", scope: !805, file: !604, line: 90, baseType: !98, size: 64, offset: 448)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "fts_compar", scope: !805, file: !604, line: 91, baseType: !865, size: 64, offset: 512)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DISubroutineType(types: !867)
!867 = !{!43, !868, !868}
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !809)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "fts_options", scope: !805, file: !604, line: 160, baseType: !43, size: 32, offset: 576)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "fts_leaf_optimization_works_ht", scope: !805, file: !604, line: 169, baseType: !681, size: 64, offset: 640)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !805, file: !604, line: 191, baseType: !874, size: 64, offset: 704)
!874 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !805, file: !604, line: 171, size: 64, elements: !875)
!875 = !{!876, !877}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !874, file: !604, line: 184, baseType: !681, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !874, file: !604, line: 190, baseType: !688, size: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fd_ring", scope: !805, file: !604, line: 196, baseType: !879, size: 256, offset: 768)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "I_ring", file: !692, line: 39, baseType: !880)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "I_ring", file: !692, line: 31, size: 256, elements: !881)
!881 = !{!882, !883, !884, !885, !886}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "ir_data", scope: !880, file: !692, line: 33, baseType: !696, size: 128)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "ir_default_val", scope: !880, file: !692, line: 34, baseType: !43, size: 32, offset: 128)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "ir_front", scope: !880, file: !692, line: 35, baseType: !7, size: 32, offset: 160)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "ir_back", scope: !880, file: !692, line: 36, baseType: !7, size: 32, offset: 192)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "ir_empty", scope: !880, file: !692, line: 37, baseType: !135, size: 8, offset: 224)
!887 = distinct !DICompileUnit(language: DW_LANG_C99, file: !888, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !889, retainedTypes: !890, splitDebugInlining: false, nameTableKind: None)
!888 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!889 = !{!26, !382}
!890 = !{!43, !76}
!891 = distinct !DICompileUnit(language: DW_LANG_C99, file: !892, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !44, retainedTypes: !893, splitDebugInlining: false, nameTableKind: None)
!892 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!893 = !{!96}
!894 = distinct !DICompileUnit(language: DW_LANG_C99, file: !895, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !896, retainedTypes: !1028, splitDebugInlining: false, nameTableKind: None)
!895 = !DIFile(filename: "lib/fts.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!896 = !{!897, !901, !906, !1008, !1011, !1014, !1025}
!897 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Fts_stat", file: !895, line: 156, baseType: !7, size: 32, elements: !898)
!898 = !{!899, !900}
!899 = !DIEnumerator(name: "FTS_NO_STAT_REQUIRED", value: 1, isUnsigned: true)
!900 = !DIEnumerator(name: "FTS_STAT_REQUIRED", value: 2, isUnsigned: true)
!901 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "leaf_optimization", file: !895, line: 643, baseType: !7, size: 32, elements: !902)
!902 = !{!903, !904, !905}
!903 = !DIEnumerator(name: "NO_LEAF_OPTIMIZATION", value: 0, isUnsigned: true)
!904 = !DIEnumerator(name: "OK_LEAF_OPTIMIZATION", value: 1, isUnsigned: true)
!905 = !DIEnumerator(name: "NOSTAT_LEAF_OPTIMIZATION", value: 2, isUnsigned: true)
!906 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !908, file: !907, line: 54, baseType: !7, size: 32, elements: !1006)
!907 = !DIFile(filename: "./lib/fts-cycle.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!908 = distinct !DISubprogram(name: "setup_dir", scope: !907, file: !907, line: 50, type: !909, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !894, retainedNodes: !1004)
!909 = !DISubroutineType(types: !910)
!910 = !{!135, !911}
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !604, line: 197, baseType: !913)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !604, line: 80, size: 1024, elements: !914)
!914 = !{!915, !961, !962, !964, !965, !966, !967, !968, !969, !970, !977, !978, !979, !995}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !913, file: !604, line: 81, baseType: !916, size: 64)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !604, line: 199, size: 2112, elements: !918)
!918 = !{!919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !960}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !917, file: !604, line: 200, baseType: !916, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !917, file: !604, line: 201, baseType: !916, size: 64, offset: 64)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !917, file: !604, line: 202, baseType: !916, size: 64, offset: 128)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !917, file: !604, line: 203, baseType: !614, size: 64, offset: 192)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !917, file: !604, line: 206, baseType: !74, size: 64, offset: 256)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !917, file: !604, line: 207, baseType: !96, size: 64, offset: 320)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !917, file: !604, line: 208, baseType: !39, size: 64, offset: 384)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !917, file: !604, line: 209, baseType: !39, size: 64, offset: 448)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !917, file: !604, line: 210, baseType: !43, size: 32, offset: 512)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !917, file: !604, line: 211, baseType: !43, size: 32, offset: 544)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !917, file: !604, line: 212, baseType: !98, size: 64, offset: 576)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !917, file: !604, line: 214, baseType: !911, size: 64, offset: 640)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !917, file: !604, line: 218, baseType: !629, size: 64, offset: 704)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !917, file: !604, line: 220, baseType: !98, size: 64, offset: 768)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "fts_n_dirs_remaining", scope: !917, file: !604, line: 225, baseType: !632, size: 64, offset: 832)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !917, file: !604, line: 241, baseType: !76, size: 16, offset: 896)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !917, file: !604, line: 245, baseType: !76, size: 16, offset: 912)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !917, file: !604, line: 251, baseType: !76, size: 16, offset: 928)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !917, file: !604, line: 253, baseType: !938, size: 1152, offset: 960)
!938 = !DICompositeType(tag: DW_TAG_array_type, baseType: !939, size: 1152, elements: !81)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !237, line: 46, size: 1152, elements: !940)
!940 = !{!941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !957, !958, !959}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !939, file: !237, line: 48, baseType: !147, size: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !939, file: !237, line: 53, baseType: !144, size: 64, offset: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !939, file: !237, line: 61, baseType: !242, size: 64, offset: 128)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !939, file: !237, line: 62, baseType: !244, size: 32, offset: 192)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !939, file: !237, line: 64, baseType: !192, size: 32, offset: 224)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !939, file: !237, line: 65, baseType: !194, size: 32, offset: 256)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !939, file: !237, line: 67, baseType: !43, size: 32, offset: 288)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !939, file: !237, line: 69, baseType: !147, size: 64, offset: 320)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !939, file: !237, line: 74, baseType: !72, size: 64, offset: 384)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !939, file: !237, line: 78, baseType: !251, size: 64, offset: 448)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !939, file: !237, line: 80, baseType: !253, size: 64, offset: 512)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !939, file: !237, line: 91, baseType: !953, size: 128, offset: 576)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !256, line: 10, size: 128, elements: !954)
!954 = !{!955, !956}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !953, file: !256, line: 12, baseType: !259, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !953, file: !256, line: 16, baseType: !261, size: 64, offset: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !939, file: !237, line: 92, baseType: !953, size: 128, offset: 704)
