source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.Active_dir = type { i64, i64, %struct._ftsent* }
%struct.FTS = type { %struct._ftsent*, %struct._ftsent*, %struct._ftsent**, i64, i8*, i32, i32, i64, i64, i32 (%struct._ftsent**, %struct._ftsent**)*, i32, %struct.hash_table*, %union.anon, %struct.I_ring }
%struct.I_ring = type { [4 x i32], i32, i32, i32, i8 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__dirstream = type opaque
%struct.__fsid_t = type { [2 x i32] }
%struct.__mbstate_t = type { i32, %union.anon.13 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct._ftsent = type { %struct._ftsent*, %struct._ftsent*, %struct._ftsent*, %struct.__dirstream*, i64, i8*, i8*, i8*, i32, i32, i64, %struct.FTS*, i64, i64, i64, i16, i16, i16, [1 x %struct.stat], [0 x i8] }
%struct.cycle_check_state = type { %struct.timespec, i64, i32 }
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%struct.hash_entry = type { i8*, %struct.hash_entry* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1 = distinct !DIGlobalVariable(name: "diagnose_surprises", scope: !2, file: !3, line: 77, type: !303, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !31, globals: !336, nameTableKind: None)
!3 = !DIFile(filename: "src/chmod.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !11, !25}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Verbosity", file: !3, line: 50, baseType: !6, size: 32, elements: !7)
!6 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!7 = !{!8, !9, !10}
!8 = !DIEnumerator(name: "V_high", value: 0, isUnsigned: true)
!9 = !DIEnumerator(name: "V_changes_only", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "V_off", value: 2, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !12, line: 32, baseType: !6, size: 32, elements: !13)
!12 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!13 = !{!14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24}
!14 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!17 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!18 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!19 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!20 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!21 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!22 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!23 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!24 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Change_status", file: !3, line: 42, baseType: !6, size: 32, elements: !26)
!26 = !{!27, !28, !29, !30}
!27 = !DIEnumerator(name: "CH_NOT_APPLIED", value: 0, isUnsigned: true)
!28 = !DIEnumerator(name: "CH_SUCCEEDED", value: 1, isUnsigned: true)
!29 = !DIEnumerator(name: "CH_FAILED", value: 2, isUnsigned: true)
!30 = !DIEnumerator(name: "CH_NO_CHANGE_REQUESTED", value: 3, isUnsigned: true)
!31 = !{!32, !42, !103, !107, !111, !114, !117, !124, !139, !36, !93, !144, !148, !152, !156, !162, !165, !166, !170, !185, !304, !307, !310, !313, !316, !321, !322, !328, !332, !97}
!32 = !DISubprogram(name: "dcgettext", scope: !33, file: !33, line: 51, type: !34, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!33 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!34 = !DISubroutineType(types: !35)
!35 = !{!36, !38, !38, !40}
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!40 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!41 = !{}
!42 = !DISubprogram(name: "fputs_unlocked", scope: !43, file: !43, line: 662, type: !44, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!43 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!44 = !DISubroutineType(types: !45)
!45 = !{!40, !38, !46}
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !48, line: 49, size: 1728, elements: !49)
!48 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!49 = !{!50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !65, !66, !67, !68, !72, !74, !76, !80, !83, !85, !88, !91, !92, !94, !98, !99}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !47, file: !48, line: 51, baseType: !40, size: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !47, file: !48, line: 54, baseType: !36, size: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !47, file: !48, line: 55, baseType: !36, size: 64, offset: 128)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !47, file: !48, line: 56, baseType: !36, size: 64, offset: 192)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !47, file: !48, line: 57, baseType: !36, size: 64, offset: 256)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !47, file: !48, line: 58, baseType: !36, size: 64, offset: 320)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !47, file: !48, line: 59, baseType: !36, size: 64, offset: 384)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !47, file: !48, line: 60, baseType: !36, size: 64, offset: 448)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !47, file: !48, line: 61, baseType: !36, size: 64, offset: 512)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !47, file: !48, line: 64, baseType: !36, size: 64, offset: 576)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !47, file: !48, line: 65, baseType: !36, size: 64, offset: 640)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !47, file: !48, line: 66, baseType: !36, size: 64, offset: 704)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !47, file: !48, line: 68, baseType: !63, size: 64, offset: 768)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !48, line: 36, flags: DIFlagFwdDecl)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !47, file: !48, line: 70, baseType: !46, size: 64, offset: 832)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !47, file: !48, line: 72, baseType: !40, size: 32, offset: 896)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !47, file: !48, line: 73, baseType: !40, size: 32, offset: 928)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !47, file: !48, line: 74, baseType: !69, size: 64, offset: 960)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !70, line: 152, baseType: !71)
!70 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!71 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !47, file: !48, line: 77, baseType: !73, size: 16, offset: 1024)
!73 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !47, file: !48, line: 78, baseType: !75, size: 8, offset: 1040)
!75 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !47, file: !48, line: 79, baseType: !77, size: 8, offset: 1048)
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 8, elements: !78)
!78 = !{!79}
!79 = !DISubrange(count: 1)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !47, file: !48, line: 81, baseType: !81, size: 64, offset: 1088)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !48, line: 43, baseType: null)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !47, file: !48, line: 89, baseType: !84, size: 64, offset: 1152)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !70, line: 153, baseType: !71)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !47, file: !48, line: 91, baseType: !86, size: 64, offset: 1216)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !48, line: 37, flags: DIFlagFwdDecl)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !47, file: !48, line: 92, baseType: !89, size: 64, offset: 1280)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !48, line: 38, flags: DIFlagFwdDecl)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !47, file: !48, line: 93, baseType: !46, size: 64, offset: 1344)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !47, file: !48, line: 94, baseType: !93, size: 64, offset: 1408)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !47, file: !48, line: 95, baseType: !95, size: 64, offset: 1472)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !96, line: 46, baseType: !97)
!96 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!97 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !47, file: !48, line: 96, baseType: !40, size: 32, offset: 1536)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !47, file: !48, line: 98, baseType: !100, size: 160, offset: 1568)
!100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 160, elements: !101)
!101 = !{!102}
!102 = !DISubrange(count: 20)
!103 = !DISubprogram(name: "set_program_name", scope: !104, file: !104, line: 37, type: !105, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!104 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!105 = !DISubroutineType(types: !106)
!106 = !{null, !38}
!107 = !DISubprogram(name: "setlocale", scope: !108, file: !108, line: 122, type: !109, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!108 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!109 = !DISubroutineType(types: !110)
!110 = !{!36, !40, !38}
!111 = !DISubprogram(name: "bindtextdomain", scope: !33, file: !33, line: 86, type: !112, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!112 = !DISubroutineType(types: !113)
!113 = !{!36, !38, !38}
!114 = !DISubprogram(name: "textdomain", scope: !33, file: !33, line: 82, type: !115, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!115 = !DISubroutineType(types: !116)
!116 = !{!36, !38}
!117 = !DISubprogram(name: "atexit", scope: !118, file: !118, line: 595, type: !119, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!118 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!119 = !DISubroutineType(types: !120)
!120 = !{!40, !121}
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{null}
!124 = !DISubprogram(name: "getopt_long", scope: !125, file: !125, line: 66, type: !126, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!125 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!126 = !DISubroutineType(types: !127)
!127 = !{!40, !40, !128, !38, !130, !137}
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !132)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !125, line: 50, size: 256, elements: !133)
!133 = !{!134, !135, !136, !138}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !132, file: !125, line: 52, baseType: !38, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !132, file: !125, line: 55, baseType: !40, size: 32, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !132, file: !125, line: 56, baseType: !137, size: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !132, file: !125, line: 57, baseType: !40, size: 32, offset: 192)
!139 = !DISubprogram(name: "x2realloc", scope: !140, file: !140, line: 61, type: !141, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!140 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!141 = !DISubroutineType(types: !142)
!142 = !{!93, !93, !143}
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!144 = !DISubprogram(name: "version_etc", scope: !145, file: !145, line: 69, type: !146, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!145 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!146 = !DISubroutineType(types: !147)
!147 = !{null, !46, !38, !38, !38, null}
!148 = !DISubprogram(name: "error", scope: !149, file: !149, line: 52, type: !150, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!149 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!150 = !DISubroutineType(types: !151)
!151 = !{null, !40, !40, !38, null}
!152 = !DISubprogram(name: "quote", scope: !153, file: !153, line: 44, type: !154, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!153 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!154 = !DISubroutineType(types: !155)
!155 = !{!38, !38}
!156 = !DISubprogram(name: "mode_create_from_ref", scope: !157, file: !157, line: 26, type: !158, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!157 = !DIFile(filename: "./lib/modechange.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!158 = !DISubroutineType(types: !159)
!159 = !{!160, !38}
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "mode_change", file: !157, line: 25, flags: DIFlagFwdDecl)
!162 = !DISubprogram(name: "quotearg_style", scope: !12, file: !12, line: 377, type: !163, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!163 = !DISubroutineType(types: !164)
!164 = !{!36, !11, !38}
!165 = !DISubprogram(name: "mode_compile", scope: !157, file: !157, line: 25, type: !158, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!166 = !DISubprogram(name: "umask", scope: !167, file: !167, line: 308, type: !168, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!167 = !DIFile(filename: "/usr/include/sys/stat.h", directory: "")
!168 = !DISubroutineType(types: !169)
!169 = !{!6, !6}
!170 = !DISubprogram(name: "get_root_dev_ino", scope: !171, file: !171, line: 25, type: !172, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!171 = !DIFile(filename: "./lib/root-dev-ino.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!172 = !DISubroutineType(types: !173)
!173 = !{!174, !174}
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !176, line: 7, size: 128, elements: !177)
!176 = !DIFile(filename: "./lib/dev-ino.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!177 = !{!178, !182}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !175, file: !176, line: 9, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !180, line: 47, baseType: !181)
!180 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !70, line: 148, baseType: !97)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !175, file: !176, line: 10, baseType: !183, size: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !180, line: 59, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !70, line: 145, baseType: !97)
!185 = !DISubprogram(name: "xfts_open", scope: !186, file: !186, line: 5, type: !187, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!186 = !DIFile(filename: "./lib/xfts.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!187 = !DISubroutineType(types: !188)
!188 = !{!189, !128, !40, !273}
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !191, line: 80, size: 1024, elements: !192)
!191 = !DIFile(filename: "./lib/fts_.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!192 = !{!193, !263, !264, !266, !267, !268, !269, !270, !271, !272, !279, !280, !283, !290}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !190, file: !191, line: 81, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !191, line: 199, size: 2112, elements: !196)
!196 = !{!197, !198, !199, !200, !205, !206, !207, !208, !209, !210, !211, !212, !215, !217, !218, !221, !222, !223, !224, !259}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !195, file: !191, line: 200, baseType: !194, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !195, file: !191, line: 201, baseType: !194, size: 64, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !195, file: !191, line: 202, baseType: !194, size: 64, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !195, file: !191, line: 203, baseType: !201, size: 64, offset: 192)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !203, line: 127, baseType: !204)
!203 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!204 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !203, line: 127, flags: DIFlagFwdDecl)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !195, file: !191, line: 206, baseType: !71, size: 64, offset: 256)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !195, file: !191, line: 207, baseType: !93, size: 64, offset: 320)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !195, file: !191, line: 208, baseType: !36, size: 64, offset: 384)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !195, file: !191, line: 209, baseType: !36, size: 64, offset: 448)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !195, file: !191, line: 210, baseType: !40, size: 32, offset: 512)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !195, file: !191, line: 211, baseType: !40, size: 32, offset: 544)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !195, file: !191, line: 212, baseType: !95, size: 64, offset: 576)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !195, file: !191, line: 214, baseType: !213, size: 64, offset: 640)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !191, line: 197, baseType: !190)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !195, file: !191, line: 218, baseType: !216, size: 64, offset: 704)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !96, line: 35, baseType: !71)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !195, file: !191, line: 220, baseType: !95, size: 64, offset: 768)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "fts_n_dirs_remaining", scope: !195, file: !191, line: 225, baseType: !219, size: 64, offset: 832)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !180, line: 74, baseType: !220)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !70, line: 151, baseType: !97)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !195, file: !191, line: 241, baseType: !73, size: 16, offset: 896)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !195, file: !191, line: 245, baseType: !73, size: 16, offset: 912)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !195, file: !191, line: 251, baseType: !73, size: 16, offset: 928)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !195, file: !191, line: 253, baseType: !225, size: 1152, offset: 960)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 1152, elements: !78)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !227, line: 46, size: 1152, elements: !228)
!227 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "")
!228 = !{!229, !230, !231, !232, !234, !236, !238, !239, !240, !241, !243, !245, !253, !254, !255}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !226, file: !227, line: 48, baseType: !184, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !226, file: !227, line: 53, baseType: !181, size: 64, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !226, file: !227, line: 61, baseType: !220, size: 64, offset: 128)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !226, file: !227, line: 62, baseType: !233, size: 32, offset: 192)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !70, line: 150, baseType: !6)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !226, file: !227, line: 64, baseType: !235, size: 32, offset: 224)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !70, line: 146, baseType: !6)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !226, file: !227, line: 65, baseType: !237, size: 32, offset: 256)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !70, line: 147, baseType: !6)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !226, file: !227, line: 67, baseType: !40, size: 32, offset: 288)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !226, file: !227, line: 69, baseType: !184, size: 64, offset: 320)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !226, file: !227, line: 74, baseType: !69, size: 64, offset: 384)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !226, file: !227, line: 78, baseType: !242, size: 64, offset: 448)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !70, line: 174, baseType: !71)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !226, file: !227, line: 80, baseType: !244, size: 64, offset: 512)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !70, line: 179, baseType: !71)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !226, file: !227, line: 91, baseType: !246, size: 128, offset: 576)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !247, line: 10, size: 128, elements: !248)
!247 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!248 = !{!249, !251}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !246, file: !247, line: 12, baseType: !250, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !70, line: 160, baseType: !71)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !246, file: !247, line: 16, baseType: !252, size: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !70, line: 196, baseType: !71)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !226, file: !227, line: 92, baseType: !246, size: 128, offset: 704)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !226, file: !227, line: 93, baseType: !246, size: 128, offset: 832)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !226, file: !227, line: 106, baseType: !256, size: 192, offset: 960)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !252, size: 192, elements: !257)
!257 = !{!258}
!258 = !DISubrange(count: 3)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "fts_name", scope: !195, file: !191, line: 254, baseType: !260, offset: 2112)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, elements: !261)
!261 = !{!262}
!262 = !DISubrange(count: -1)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "fts_child", scope: !190, file: !191, line: 82, baseType: !194, size: 64, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "fts_array", scope: !190, file: !191, line: 83, baseType: !265, size: 64, offset: 128)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !190, file: !191, line: 84, baseType: !183, size: 64, offset: 192)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !190, file: !191, line: 85, baseType: !36, size: 64, offset: 256)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "fts_rfd", scope: !190, file: !191, line: 86, baseType: !40, size: 32, offset: 320)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cwd_fd", scope: !190, file: !191, line: 87, baseType: !40, size: 32, offset: 352)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !190, file: !191, line: 89, baseType: !95, size: 64, offset: 384)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "fts_nitems", scope: !190, file: !191, line: 90, baseType: !95, size: 64, offset: 448)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "fts_compar", scope: !190, file: !191, line: 91, baseType: !273, size: 64, offset: 512)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DISubroutineType(types: !275)
!275 = !{!40, !276, !276}
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !195)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "fts_options", scope: !190, file: !191, line: 160, baseType: !40, size: 32, offset: 576)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "fts_leaf_optimization_works_ht", scope: !190, file: !191, line: 169, baseType: !281, size: 64, offset: 640)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !191, line: 169, flags: DIFlagFwdDecl)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !190, file: !191, line: 191, baseType: !284, size: 64, offset: 704)
!284 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !190, file: !191, line: 171, size: 64, elements: !285)
!285 = !{!286, !287}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !284, file: !191, line: 184, baseType: !281, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !284, file: !191, line: 190, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "cycle_check_state", file: !191, line: 190, flags: DIFlagFwdDecl)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fd_ring", scope: !190, file: !191, line: 196, baseType: !291, size: 256, offset: 768)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "I_ring", file: !292, line: 39, baseType: !293)
!292 = !DIFile(filename: "./lib/i-ring.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "I_ring", file: !292, line: 31, size: 256, elements: !294)
!294 = !{!295, !299, !300, !301, !302}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ir_data", scope: !293, file: !292, line: 33, baseType: !296, size: 128)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 128, elements: !297)
!297 = !{!298}
!298 = !DISubrange(count: 4)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "ir_default_val", scope: !293, file: !292, line: 34, baseType: !40, size: 32, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ir_front", scope: !293, file: !292, line: 35, baseType: !6, size: 32, offset: 160)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "ir_back", scope: !293, file: !292, line: 36, baseType: !6, size: 32, offset: 192)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "ir_empty", scope: !293, file: !292, line: 37, baseType: !303, size: 8, offset: 224)
!303 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!304 = !DISubprogram(name: "rpl_fts_read", scope: !191, file: !191, line: 280, type: !305, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!305 = !DISubroutineType(types: !306)
!306 = !{!194, !189}
!307 = !DISubprogram(name: "rpl_fts_close", scope: !191, file: !191, line: 276, type: !308, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!308 = !DISubroutineType(types: !309)
!309 = !{!40, !189}
!310 = !DISubprogram(name: "rpl_fts_set", scope: !191, file: !191, line: 281, type: !311, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!311 = !DISubroutineType(types: !312)
!312 = !{!40, !189, !194, !40}
!313 = !DISubprogram(name: "quotearg_n_style_colon", scope: !12, file: !12, line: 397, type: !314, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!314 = !DISubroutineType(types: !315)
!315 = !{!36, !40, !11, !38}
!316 = !DISubprogram(name: "cycle_warning_required", scope: !186, file: !186, line: 9, type: !317, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!317 = !DISubroutineType(types: !318)
!318 = !{!303, !319, !277}
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !190)
!321 = !DISubprogram(name: "quotearg_n_style", scope: !12, file: !12, line: 368, type: !314, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!322 = !DISubprogram(name: "mode_adjust", scope: !157, file: !157, line: 27, type: !323, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!323 = !DISubroutineType(types: !324)
!324 = !{!6, !6, !303, !6, !325, !327}
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !161)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!328 = !DISubprogram(name: "strmode", scope: !329, file: !329, line: 35, type: !330, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!329 = !DIFile(filename: "./lib/filemode.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!330 = !DISubroutineType(types: !331)
!331 = !{null, !6, !36}
!332 = !DISubprogram(name: "rpl_fchmodat", scope: !333, file: !333, line: 871, type: !334, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!333 = !DIFile(filename: "./lib/sys/stat.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!334 = !DISubroutineType(types: !335)
!335 = !{!40, !40, !38, !6, !40}
!336 = !{!337, !360, !362, !365, !367, !369, !370, !372, !377}
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(name: "dev_ino_buf", scope: !339, file: !3, line: 555, type: !175, isLocal: true, isDefinition: true)
!339 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 415, type: !340, scopeLine: 416, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !343)
!340 = !DISubroutineType(types: !341)
!341 = !{!40, !40, !342}
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!343 = !{!344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !357, !358, !359}
!344 = !DILocalVariable(name: "argc", arg: 1, scope: !339, file: !3, line: 415, type: !40)
!345 = !DILocalVariable(name: "argv", arg: 2, scope: !339, file: !3, line: 415, type: !342)
!346 = !DILocalVariable(name: "mode", scope: !339, file: !3, line: 417, type: !36)
!347 = !DILocalVariable(name: "mode_len", scope: !339, file: !3, line: 418, type: !95)
!348 = !DILocalVariable(name: "mode_alloc", scope: !339, file: !3, line: 419, type: !95)
!349 = !DILocalVariable(name: "ok", scope: !339, file: !3, line: 420, type: !303)
!350 = !DILocalVariable(name: "preserve_root", scope: !339, file: !3, line: 421, type: !303)
!351 = !DILocalVariable(name: "reference_file", scope: !339, file: !3, line: 422, type: !38)
!352 = !DILocalVariable(name: "c", scope: !339, file: !3, line: 423, type: !40)
!353 = !DILocalVariable(name: "arg", scope: !354, file: !3, line: 468, type: !38)
!354 = distinct !DILexicalBlock(scope: !355, file: !3, line: 462, column: 11)
!355 = distinct !DILexicalBlock(scope: !356, file: !3, line: 442, column: 9)
!356 = distinct !DILexicalBlock(scope: !339, file: !3, line: 440, column: 5)
!357 = !DILocalVariable(name: "arg_len", scope: !354, file: !3, line: 469, type: !95)
!358 = !DILocalVariable(name: "mode_comma_len", scope: !354, file: !3, line: 470, type: !95)
!359 = !DILocalVariable(name: "new_mode_len", scope: !354, file: !3, line: 471, type: !95)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(name: "change", scope: !2, file: !3, line: 63, type: !160, isLocal: true, isDefinition: true)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "umask_value", scope: !2, file: !3, line: 66, type: !364, isLocal: true, isDefinition: true)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !180, line: 69, baseType: !233)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "recurse", scope: !2, file: !3, line: 69, type: !303, isLocal: true, isDefinition: true)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "force_silent", scope: !2, file: !3, line: 72, type: !303, isLocal: true, isDefinition: true)
!369 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(name: "root_dev_ino", scope: !2, file: !3, line: 84, type: !174, isLocal: true, isDefinition: true)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 95, type: !374, isLocal: true, isDefinition: true)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 2816, elements: !375)
!375 = !{!376}
!376 = !DISubrange(count: 11)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "verbosity", scope: !2, file: !3, line: 80, type: !5, isLocal: true, isDefinition: true)
!379 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!380 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(name: "Version", scope: !383, file: !384, line: 2, type: !38, isDefinition: true)
!383 = distinct !DICompileUnit(language: DW_LANG_C99, file: !384, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !41, globals: !385, nameTableKind: None)
!384 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!385 = !{!381}
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "file_name", scope: !388, file: !389, line: 46, type: !38, isLocal: true, isDefinition: true)
!388 = distinct !DICompileUnit(language: DW_LANG_C99, file: !389, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !41, retainedTypes: !390, globals: !428, nameTableKind: None)
!389 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!390 = !{!391, !32, !427, !148}
!391 = !DISubprogram(name: "close_stream", scope: !392, file: !392, line: 2, type: !393, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!392 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!393 = !DISubroutineType(types: !394)
!394 = !{!40, !395}
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !48, line: 49, size: 1728, elements: !397)
!397 = !{!398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !396, file: !48, line: 51, baseType: !40, size: 32)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !396, file: !48, line: 54, baseType: !36, size: 64, offset: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !396, file: !48, line: 55, baseType: !36, size: 64, offset: 128)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !396, file: !48, line: 56, baseType: !36, size: 64, offset: 192)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !396, file: !48, line: 57, baseType: !36, size: 64, offset: 256)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !396, file: !48, line: 58, baseType: !36, size: 64, offset: 320)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !396, file: !48, line: 59, baseType: !36, size: 64, offset: 384)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !396, file: !48, line: 60, baseType: !36, size: 64, offset: 448)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !396, file: !48, line: 61, baseType: !36, size: 64, offset: 512)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !396, file: !48, line: 64, baseType: !36, size: 64, offset: 576)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !396, file: !48, line: 65, baseType: !36, size: 64, offset: 640)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !396, file: !48, line: 66, baseType: !36, size: 64, offset: 704)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !396, file: !48, line: 68, baseType: !63, size: 64, offset: 768)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !396, file: !48, line: 70, baseType: !395, size: 64, offset: 832)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !396, file: !48, line: 72, baseType: !40, size: 32, offset: 896)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !396, file: !48, line: 73, baseType: !40, size: 32, offset: 928)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !396, file: !48, line: 74, baseType: !69, size: 64, offset: 960)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !396, file: !48, line: 77, baseType: !73, size: 16, offset: 1024)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !396, file: !48, line: 78, baseType: !75, size: 8, offset: 1040)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !396, file: !48, line: 79, baseType: !77, size: 8, offset: 1048)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !396, file: !48, line: 81, baseType: !81, size: 64, offset: 1088)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !396, file: !48, line: 89, baseType: !84, size: 64, offset: 1152)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !396, file: !48, line: 91, baseType: !86, size: 64, offset: 1216)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !396, file: !48, line: 92, baseType: !89, size: 64, offset: 1280)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !396, file: !48, line: 93, baseType: !395, size: 64, offset: 1344)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !396, file: !48, line: 94, baseType: !93, size: 64, offset: 1408)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !396, file: !48, line: 95, baseType: !95, size: 64, offset: 1472)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !396, file: !48, line: 96, baseType: !40, size: 32, offset: 1536)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !396, file: !48, line: 98, baseType: !100, size: 160, offset: 1568)
!427 = !DISubprogram(name: "quotearg_colon", scope: !12, file: !12, line: 391, type: !115, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!428 = !{!386, !429}
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !388, file: !389, line: 56, type: !303, isLocal: true, isDefinition: true)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(name: "exit_failure", scope: !433, file: !434, line: 24, type: !436, isDefinition: true)
!433 = distinct !DICompileUnit(language: DW_LANG_C99, file: !434, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !41, globals: !435, nameTableKind: None)
!434 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!435 = !{!431}
!436 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !40)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(name: "program_name", scope: !439, file: !440, line: 33, type: !38, isDefinition: true)
!439 = distinct !DICompileUnit(language: DW_LANG_C99, file: !440, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !41, retainedTypes: !441, globals: !477, nameTableKind: None)
!440 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!441 = !{!93, !442, !36}
!442 = !DISubprogram(name: "fputs", scope: !43, file: !43, line: 626, type: !443, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!443 = !DISubroutineType(types: !444)
!444 = !{!40, !38, !445}
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !48, line: 49, size: 1728, elements: !447)
!447 = !{!448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !446, file: !48, line: 51, baseType: !40, size: 32)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !446, file: !48, line: 54, baseType: !36, size: 64, offset: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !446, file: !48, line: 55, baseType: !36, size: 64, offset: 128)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !446, file: !48, line: 56, baseType: !36, size: 64, offset: 192)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !446, file: !48, line: 57, baseType: !36, size: 64, offset: 256)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !446, file: !48, line: 58, baseType: !36, size: 64, offset: 320)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !446, file: !48, line: 59, baseType: !36, size: 64, offset: 384)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !446, file: !48, line: 60, baseType: !36, size: 64, offset: 448)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !446, file: !48, line: 61, baseType: !36, size: 64, offset: 512)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !446, file: !48, line: 64, baseType: !36, size: 64, offset: 576)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !446, file: !48, line: 65, baseType: !36, size: 64, offset: 640)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !446, file: !48, line: 66, baseType: !36, size: 64, offset: 704)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !446, file: !48, line: 68, baseType: !63, size: 64, offset: 768)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !446, file: !48, line: 70, baseType: !445, size: 64, offset: 832)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !446, file: !48, line: 72, baseType: !40, size: 32, offset: 896)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !446, file: !48, line: 73, baseType: !40, size: 32, offset: 928)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !446, file: !48, line: 74, baseType: !69, size: 64, offset: 960)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !446, file: !48, line: 77, baseType: !73, size: 16, offset: 1024)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !446, file: !48, line: 78, baseType: !75, size: 8, offset: 1040)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !446, file: !48, line: 79, baseType: !77, size: 8, offset: 1048)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !446, file: !48, line: 81, baseType: !81, size: 64, offset: 1088)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !446, file: !48, line: 89, baseType: !84, size: 64, offset: 1152)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !446, file: !48, line: 91, baseType: !86, size: 64, offset: 1216)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !446, file: !48, line: 92, baseType: !89, size: 64, offset: 1280)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !446, file: !48, line: 93, baseType: !445, size: 64, offset: 1344)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !446, file: !48, line: 94, baseType: !93, size: 64, offset: 1408)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !446, file: !48, line: 95, baseType: !95, size: 64, offset: 1472)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !446, file: !48, line: 96, baseType: !40, size: 32, offset: 1536)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !446, file: !48, line: 98, baseType: !100, size: 160, offset: 1568)
!477 = !{!437}
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !480, file: !481, line: 85, type: !597, isDefinition: true)
!480 = distinct !DICompileUnit(language: DW_LANG_C99, file: !481, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !482, retainedTypes: !503, globals: !570, nameTableKind: None)
!481 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!482 = !{!11, !483, !488}
!483 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !12, line: 242, baseType: !6, size: 32, elements: !484)
!484 = !{!485, !486, !487}
!485 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!486 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!487 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!488 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !489, line: 46, baseType: !6, size: 32, elements: !490)
!489 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!490 = !{!491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502}
!491 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!492 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!493 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!494 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!495 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!496 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!497 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!498 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!499 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!500 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!501 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!502 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!503 = !{!504, !509, !524, !527, !40, !73, !530, !95, !545, !549, !32, !555, !559, !36, !563, !566, !567}
!504 = !DISubprogram(name: "xmemdup", scope: !140, file: !140, line: 62, type: !505, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!505 = !DISubroutineType(types: !506)
!506 = !{!93, !507, !97}
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!509 = !DISubprogram(name: "quotearg_alloc_mem", scope: !12, file: !12, line: 342, type: !510, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!510 = !DISubroutineType(types: !511)
!511 = !{!36, !38, !97, !143, !512}
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !514)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !481, line: 65, size: 448, elements: !515)
!515 = !{!516, !517, !518, !522, !523}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !514, file: !481, line: 68, baseType: !11, size: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !514, file: !481, line: 71, baseType: !40, size: 32, offset: 32)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !514, file: !481, line: 75, baseType: !519, size: 256, offset: 64)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !520)
!520 = !{!521}
!521 = !DISubrange(count: 8)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !514, file: !481, line: 78, baseType: !38, size: 64, offset: 320)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !514, file: !481, line: 81, baseType: !38, size: 64, offset: 384)
!524 = !DISubprogram(name: "free", scope: !118, file: !118, line: 565, type: !525, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!525 = !DISubroutineType(types: !526)
!526 = !{null, !93}
!527 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !12, file: !12, line: 408, type: !528, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!528 = !DISubroutineType(types: !529)
!529 = !{!36, !40, !38, !38, !38, !97}
!530 = !DISubprogram(name: "rpl_mbrtowc", scope: !531, file: !531, line: 717, type: !532, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!531 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!532 = !DISubroutineType(types: !533)
!533 = !{!97, !137, !38, !97, !534}
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !536, line: 13, size: 64, elements: !537)
!536 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!537 = !{!538, !539}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !535, file: !536, line: 15, baseType: !40, size: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !535, file: !536, line: 20, baseType: !540, size: 32, offset: 32)
!540 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !535, file: !536, line: 16, size: 32, elements: !541)
!541 = !{!542, !543}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !540, file: !536, line: 18, baseType: !6, size: 32)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !540, file: !536, line: 19, baseType: !544, size: 32)
!544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 32, elements: !297)
!545 = !DISubprogram(name: "iswprint", scope: !546, file: !546, line: 120, type: !547, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!546 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!547 = !DISubroutineType(types: !548)
!548 = !{!40, !6}
!549 = !DISubprogram(name: "mbsinit", scope: !550, file: !550, line: 292, type: !551, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!550 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!551 = !DISubroutineType(types: !552)
!552 = !{!40, !553}
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !535)
!555 = !DISubprogram(name: "locale_charset", scope: !556, file: !556, line: 35, type: !557, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!556 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!557 = !DISubroutineType(types: !558)
!558 = !{!38}
!559 = !DISubprogram(name: "c_strcasecmp", scope: !560, file: !560, line: 42, type: !561, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!560 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!561 = !DISubroutineType(types: !562)
!562 = !{!40, !38, !38}
!563 = !DISubprogram(name: "xmalloc", scope: !140, file: !140, line: 53, type: !564, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!564 = !DISubroutineType(types: !565)
!565 = !{!93, !97}
!566 = !DISubprogram(name: "xalloc_die", scope: !140, file: !140, line: 51, type: !122, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !41)
!567 = !DISubprogram(name: "xrealloc", scope: !140, file: !140, line: 59, type: !568, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!568 = !DISubroutineType(types: !569)
!569 = !{!93, !93, !97}
!570 = !{!478, !571, !577, !579, !581, !586, !593, !595}
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !480, file: !481, line: 101, type: !573, isDefinition: true)
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !574, size: 320, elements: !575)
!574 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!575 = !{!576}
!576 = !DISubrange(count: 10)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !480, file: !481, line: 1052, type: !514, isDefinition: true)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !480, file: !481, line: 116, type: !514, isLocal: true, isDefinition: true)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(name: "slot0", scope: !480, file: !481, line: 842, type: !583, isLocal: true, isDefinition: true)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 2048, elements: !584)
!584 = !{!585}
!585 = !DISubrange(count: 256)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(name: "slotvec", scope: !480, file: !481, line: 845, type: !588, isLocal: true, isDefinition: true)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !481, line: 834, size: 128, elements: !590)
!590 = !{!591, !592}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !589, file: !481, line: 836, baseType: !95, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !589, file: !481, line: 837, baseType: !36, size: 64, offset: 64)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(name: "nslots", scope: !480, file: !481, line: 843, type: !40, isLocal: true, isDefinition: true)
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(name: "slotvec0", scope: !480, file: !481, line: 844, type: !589, isLocal: true, isDefinition: true)
!597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !598, size: 704, elements: !375)
!598 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !601, file: !602, line: 26, type: !604, isDefinition: true)
!601 = distinct !DICompileUnit(language: DW_LANG_C99, file: !602, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !41, globals: !603, nameTableKind: None)
!602 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!603 = !{!599}
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 376, elements: !605)
!605 = !{!606}
!606 = !DISubrange(count: 47)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(name: "fmt", scope: !609, file: !610, line: 102, type: !668, isLocal: true, isDefinition: true)
!609 = distinct !DISubprogram(name: "rpl_fchmodat", scope: !610, file: !610, line: 64, type: !611, scopeLine: 65, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !614, retainedNodes: !629)
!610 = !DIFile(filename: "lib/fchmodat.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!611 = !DISubroutineType(types: !612)
!612 = !{!40, !40, !38, !613, !40}
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !167, line: 59, baseType: !233)
!614 = distinct !DICompileUnit(language: DW_LANG_C99, file: !610, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !41, retainedTypes: !615, globals: !628, nameTableKind: None)
!615 = !{!616, !620, !624, !627}
!616 = !DISubprogram(name: "openat", scope: !617, file: !617, line: 220, type: !618, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!617 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
!618 = !DISubroutineType(types: !619)
!619 = !{!40, !40, !38, !40, null}
!620 = !DISubprogram(name: "close", scope: !621, file: !621, line: 353, type: !622, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!621 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!622 = !DISubroutineType(types: !623)
!623 = !{!40, !40}
!624 = !DISubprogram(name: "chmod", scope: !167, file: !167, line: 280, type: !625, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!625 = !DISubroutineType(types: !626)
!626 = !{!40, !38, !6}
!627 = !DISubprogram(name: "fchmodat", scope: !167, file: !167, line: 299, type: !334, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!628 = !{!607}
!629 = !{!630, !631, !632, !633, !634, !658, !659, !662, !666, !667}
!630 = !DILocalVariable(name: "dir", arg: 1, scope: !609, file: !610, line: 64, type: !40)
!631 = !DILocalVariable(name: "file", arg: 2, scope: !609, file: !610, line: 64, type: !38)
!632 = !DILocalVariable(name: "mode", arg: 3, scope: !609, file: !610, line: 64, type: !613)
!633 = !DILocalVariable(name: "flags", arg: 4, scope: !609, file: !610, line: 64, type: !40)
!634 = !DILocalVariable(name: "st", scope: !635, file: !610, line: 69, type: !637)
!635 = distinct !DILexicalBlock(scope: !636, file: !610, line: 68, column: 5)
!636 = distinct !DILexicalBlock(scope: !609, file: !610, line: 67, column: 7)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !227, line: 46, size: 1152, elements: !638)
!638 = !{!639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !655, !656, !657}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !637, file: !227, line: 48, baseType: !184, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !637, file: !227, line: 53, baseType: !181, size: 64, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !637, file: !227, line: 61, baseType: !220, size: 64, offset: 128)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !637, file: !227, line: 62, baseType: !233, size: 32, offset: 192)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !637, file: !227, line: 64, baseType: !235, size: 32, offset: 224)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !637, file: !227, line: 65, baseType: !237, size: 32, offset: 256)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !637, file: !227, line: 67, baseType: !40, size: 32, offset: 288)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !637, file: !227, line: 69, baseType: !184, size: 64, offset: 320)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !637, file: !227, line: 74, baseType: !69, size: 64, offset: 384)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !637, file: !227, line: 78, baseType: !242, size: 64, offset: 448)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !637, file: !227, line: 80, baseType: !244, size: 64, offset: 512)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !637, file: !227, line: 91, baseType: !651, size: 128, offset: 576)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !247, line: 10, size: 128, elements: !652)
!652 = !{!653, !654}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !651, file: !247, line: 12, baseType: !250, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !651, file: !247, line: 16, baseType: !252, size: 64, offset: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !637, file: !227, line: 92, baseType: !651, size: 128, offset: 704)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !637, file: !227, line: 93, baseType: !651, size: 128, offset: 832)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !637, file: !227, line: 106, baseType: !256, size: 192, offset: 960)
!658 = !DILocalVariable(name: "fd", scope: !635, file: !610, line: 76, type: !40)
!659 = !DILocalVariable(name: "stat_errno", scope: !660, file: !610, line: 89, type: !40)
!660 = distinct !DILexicalBlock(scope: !661, file: !610, line: 88, column: 9)
!661 = distinct !DILexicalBlock(scope: !635, file: !610, line: 87, column: 11)
!662 = !DILocalVariable(name: "buf", scope: !635, file: !610, line: 103, type: !663)
!663 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 208, elements: !664)
!664 = !{!665}
!665 = !DISubrange(count: 26)
!666 = !DILocalVariable(name: "chmod_result", scope: !635, file: !610, line: 105, type: !40)
!667 = !DILocalVariable(name: "chmod_errno", scope: !635, file: !610, line: 106, type: !40)
!668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 136, elements: !669)
!669 = !{!670}
!670 = !DISubrange(count: 17)
!671 = !DIGlobalVariableExpression(var: !672, expr: !DIExpression())
!672 = distinct !DIGlobalVariable(name: "default_tuning", scope: !673, file: !674, line: 130, type: !681, isLocal: true, isDefinition: true)
!673 = distinct !DICompileUnit(language: DW_LANG_C99, file: !674, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !41, retainedTypes: !675, globals: !680, nameTableKind: None)
!674 = !DIFile(filename: "lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!675 = !{!97, !93, !676, !524, !95}
!676 = !DISubprogram(name: "rpl_calloc", scope: !677, file: !677, line: 688, type: !678, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!677 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!678 = !DISubroutineType(types: !679)
!679 = !{!93, !97, !97}
!680 = !{!671}
!681 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !682)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !683, line: 65, baseType: !684)
!683 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !683, line: 53, size: 160, elements: !685)
!685 = !{!686, !688, !689, !690, !691}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !684, file: !683, line: 58, baseType: !687, size: 32)
!687 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !684, file: !683, line: 59, baseType: !687, size: 32, offset: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !684, file: !683, line: 60, baseType: !687, size: 32, offset: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !684, file: !683, line: 61, baseType: !687, size: 32, offset: 96)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !684, file: !683, line: 62, baseType: !303, size: 8, offset: 128)
!692 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression())
!693 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !694, file: !695, line: 507, type: !40, isLocal: true, isDefinition: true)
!694 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !695, file: !695, line: 488, type: !696, scopeLine: 489, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !698, retainedNodes: !704)
!695 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!696 = !DISubroutineType(types: !697)
!697 = !{!40, !40, !40}
!698 = distinct !DICompileUnit(language: DW_LANG_C99, file: !695, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !41, retainedTypes: !699, globals: !703, nameTableKind: None)
!699 = !{!700, !620}
!700 = !DISubprogram(name: "fcntl", scope: !617, file: !617, line: 176, type: !701, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!701 = !DISubroutineType(types: !702)
!702 = !{!40, !40, !40, null}
!703 = !{!692}
!704 = !{!705, !706, !707, !708, !711}
!705 = !DILocalVariable(name: "fd", arg: 1, scope: !694, file: !695, line: 488, type: !40)
!706 = !DILocalVariable(name: "target", arg: 2, scope: !694, file: !695, line: 488, type: !40)
!707 = !DILocalVariable(name: "result", scope: !694, file: !695, line: 490, type: !40)
!708 = !DILocalVariable(name: "flags", scope: !709, file: !695, line: 531, type: !40)
!709 = distinct !DILexicalBlock(scope: !710, file: !695, line: 530, column: 5)
!710 = distinct !DILexicalBlock(scope: !694, file: !695, line: 529, column: 7)
!711 = !DILocalVariable(name: "saved_errno", scope: !712, file: !695, line: 534, type: !40)
!712 = distinct !DILexicalBlock(scope: !713, file: !695, line: 533, column: 9)
!713 = distinct !DILexicalBlock(scope: !709, file: !695, line: 532, column: 11)
!714 = distinct !DICompileUnit(language: DW_LANG_C99, file: !715, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !41, nameTableKind: None)
!715 = !DIFile(filename: "lib/filemode.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!716 = distinct !DICompileUnit(language: DW_LANG_C99, file: !717, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !718, retainedTypes: !725, nameTableKind: None)
!717 = !DIFile(filename: "lib/modechange.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!718 = !{!719}
!719 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !717, line: 78, baseType: !6, size: 32, elements: !720)
!720 = !{!721, !722, !723, !724}
!721 = !DIEnumerator(name: "MODE_DONE", value: 0, isUnsigned: true)
!722 = !DIEnumerator(name: "MODE_ORDINARY_CHANGE", value: 1, isUnsigned: true)
!723 = !DIEnumerator(name: "MODE_X_IF_ANY_X", value: 2, isUnsigned: true)
!724 = !DIEnumerator(name: "MODE_COPY_EXISTING", value: 3, isUnsigned: true)
!725 = !{!524, !563, !95, !566}
!726 = distinct !DICompileUnit(language: DW_LANG_C99, file: !727, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !41, nameTableKind: None)
!727 = !DIFile(filename: "lib/root-dev-ino.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!728 = distinct !DICompileUnit(language: DW_LANG_C99, file: !729, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !730, retainedTypes: !734, nameTableKind: None)
!729 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!730 = !{!731}
!731 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !729, line: 40, baseType: !6, size: 32, elements: !732)
!732 = !{!733}
!733 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!734 = !{!32, !735, !93}
!735 = !DISubprogram(name: "fputs_unlocked", scope: !43, file: !43, line: 662, type: !736, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!736 = !DISubroutineType(types: !737)
!737 = !{!40, !38, !738}
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !48, line: 49, size: 1728, elements: !740)
!740 = !{!741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !739, file: !48, line: 51, baseType: !40, size: 32)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !739, file: !48, line: 54, baseType: !36, size: 64, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !739, file: !48, line: 55, baseType: !36, size: 64, offset: 128)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !739, file: !48, line: 56, baseType: !36, size: 64, offset: 192)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !739, file: !48, line: 57, baseType: !36, size: 64, offset: 256)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !739, file: !48, line: 58, baseType: !36, size: 64, offset: 320)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !739, file: !48, line: 59, baseType: !36, size: 64, offset: 384)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !739, file: !48, line: 60, baseType: !36, size: 64, offset: 448)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !739, file: !48, line: 61, baseType: !36, size: 64, offset: 512)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !739, file: !48, line: 64, baseType: !36, size: 64, offset: 576)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !739, file: !48, line: 65, baseType: !36, size: 64, offset: 640)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !739, file: !48, line: 66, baseType: !36, size: 64, offset: 704)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !739, file: !48, line: 68, baseType: !63, size: 64, offset: 768)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !739, file: !48, line: 70, baseType: !738, size: 64, offset: 832)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !739, file: !48, line: 72, baseType: !40, size: 32, offset: 896)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !739, file: !48, line: 73, baseType: !40, size: 32, offset: 928)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !739, file: !48, line: 74, baseType: !69, size: 64, offset: 960)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !739, file: !48, line: 77, baseType: !73, size: 16, offset: 1024)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !739, file: !48, line: 78, baseType: !75, size: 8, offset: 1040)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !739, file: !48, line: 79, baseType: !77, size: 8, offset: 1048)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !739, file: !48, line: 81, baseType: !81, size: 64, offset: 1088)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !739, file: !48, line: 89, baseType: !84, size: 64, offset: 1152)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !739, file: !48, line: 91, baseType: !86, size: 64, offset: 1216)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !739, file: !48, line: 92, baseType: !89, size: 64, offset: 1280)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !739, file: !48, line: 93, baseType: !738, size: 64, offset: 1344)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !739, file: !48, line: 94, baseType: !93, size: 64, offset: 1408)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !739, file: !48, line: 95, baseType: !95, size: 64, offset: 1472)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !739, file: !48, line: 96, baseType: !40, size: 32, offset: 1536)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !739, file: !48, line: 98, baseType: !100, size: 160, offset: 1568)
!770 = distinct !DICompileUnit(language: DW_LANG_C99, file: !771, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !772, retainedTypes: !785, nameTableKind: None)
!771 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!772 = !{!773}
!773 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !774, file: !140, line: 186, baseType: !6, size: 32, elements: !783)
!774 = distinct !DISubprogram(name: "x2nrealloc", scope: !140, file: !140, line: 174, type: !775, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !770, retainedNodes: !778)
!775 = !DISubroutineType(types: !776)
!776 = !{!93, !93, !777, !95}
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!778 = !{!779, !780, !781, !782}
!779 = !DILocalVariable(name: "p", arg: 1, scope: !774, file: !140, line: 174, type: !93)
!780 = !DILocalVariable(name: "pn", arg: 2, scope: !774, file: !140, line: 174, type: !777)
!781 = !DILocalVariable(name: "s", arg: 3, scope: !774, file: !140, line: 174, type: !95)
!782 = !DILocalVariable(name: "n", scope: !774, file: !140, line: 176, type: !95)
!783 = !{!784}
!784 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!785 = !{!95, !566, !563, !567, !36, !524, !93, !786, !676}
!786 = !DISubprogram(name: "xcalloc", scope: !140, file: !140, line: 57, type: !678, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!787 = distinct !DICompileUnit(language: DW_LANG_C99, file: !788, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !41, retainedTypes: !789, nameTableKind: None)
!788 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!789 = !{!32, !148}
!790 = distinct !DICompileUnit(language: DW_LANG_C99, file: !791, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !41, retainedTypes: !792, nameTableKind: None)
!791 = !DIFile(filename: "lib/xfts.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!792 = !{!793, !93, !566}
!793 = !DISubprogram(name: "rpl_fts_open", scope: !191, file: !191, line: 277, type: !794, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !41)
!794 = !DISubroutineType(types: !795)
!795 = !{!796, !128, !40, !857}
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !191, line: 80, size: 1024, elements: !798)
!798 = !{!799, !847, !848, !850, !851, !852, !853, !854, !855, !856, !863, !864, !865, !870}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !797, file: !191, line: 81, baseType: !800, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !191, line: 199, size: 2112, elements: !802)
!802 = !{!803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !817, !818, !819, !820, !821, !822, !823, !846}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !801, file: !191, line: 200, baseType: !800, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !801, file: !191, line: 201, baseType: !800, size: 64, offset: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !801, file: !191, line: 202, baseType: !800, size: 64, offset: 128)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !801, file: !191, line: 203, baseType: !201, size: 64, offset: 192)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !801, file: !191, line: 206, baseType: !71, size: 64, offset: 256)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !801, file: !191, line: 207, baseType: !93, size: 64, offset: 320)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !801, file: !191, line: 208, baseType: !36, size: 64, offset: 384)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !801, file: !191, line: 209, baseType: !36, size: 64, offset: 448)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !801, file: !191, line: 210, baseType: !40, size: 32, offset: 512)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !801, file: !191, line: 211, baseType: !40, size: 32, offset: 544)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !801, file: !191, line: 212, baseType: !95, size: 64, offset: 576)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !801, file: !191, line: 214, baseType: !815, size: 64, offset: 640)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !191, line: 197, baseType: !797)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !801, file: !191, line: 218, baseType: !216, size: 64, offset: 704)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !801, file: !191, line: 220, baseType: !95, size: 64, offset: 768)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "fts_n_dirs_remaining", scope: !801, file: !191, line: 225, baseType: !219, size: 64, offset: 832)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !801, file: !191, line: 241, baseType: !73, size: 16, offset: 896)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !801, file: !191, line: 245, baseType: !73, size: 16, offset: 912)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !801, file: !191, line: 251, baseType: !73, size: 16, offset: 928)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !801, file: !191, line: 253, baseType: !824, size: 1152, offset: 960)
!824 = !DICompositeType(tag: DW_TAG_array_type, baseType: !825, size: 1152, elements: !78)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !227, line: 46, size: 1152, elements: !826)
!826 = !{!827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !843, !844, !845}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !825, file: !227, line: 48, baseType: !184, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !825, file: !227, line: 53, baseType: !181, size: 64, offset: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !825, file: !227, line: 61, baseType: !220, size: 64, offset: 128)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !825, file: !227, line: 62, baseType: !233, size: 32, offset: 192)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !825, file: !227, line: 64, baseType: !235, size: 32, offset: 224)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !825, file: !227, line: 65, baseType: !237, size: 32, offset: 256)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !825, file: !227, line: 67, baseType: !40, size: 32, offset: 288)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !825, file: !227, line: 69, baseType: !184, size: 64, offset: 320)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !825, file: !227, line: 74, baseType: !69, size: 64, offset: 384)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !825, file: !227, line: 78, baseType: !242, size: 64, offset: 448)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !825, file: !227, line: 80, baseType: !244, size: 64, offset: 512)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !825, file: !227, line: 91, baseType: !839, size: 128, offset: 576)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !247, line: 10, size: 128, elements: !840)
!840 = !{!841, !842}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !839, file: !247, line: 12, baseType: !250, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !839, file: !247, line: 16, baseType: !252, size: 64, offset: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !825, file: !227, line: 92, baseType: !839, size: 128, offset: 704)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !825, file: !227, line: 93, baseType: !839, size: 128, offset: 832)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !825, file: !227, line: 106, baseType: !256, size: 192, offset: 960)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "fts_name", scope: !801, file: !191, line: 254, baseType: !260, offset: 2112)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "fts_child", scope: !797, file: !191, line: 82, baseType: !800, size: 64, offset: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "fts_array", scope: !797, file: !191, line: 83, baseType: !849, size: 64, offset: 128)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !797, file: !191, line: 84, baseType: !183, size: 64, offset: 192)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !797, file: !191, line: 85, baseType: !36, size: 64, offset: 256)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "fts_rfd", scope: !797, file: !191, line: 86, baseType: !40, size: 32, offset: 320)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cwd_fd", scope: !797, file: !191, line: 87, baseType: !40, size: 32, offset: 352)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !797, file: !191, line: 89, baseType: !95, size: 64, offset: 384)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "fts_nitems", scope: !797, file: !191, line: 90, baseType: !95, size: 64, offset: 448)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "fts_compar", scope: !797, file: !191, line: 91, baseType: !857, size: 64, offset: 512)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DISubroutineType(types: !859)
!859 = !{!40, !860, !860}
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !801)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "fts_options", scope: !797, file: !191, line: 160, baseType: !40, size: 32, offset: 576)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "fts_leaf_optimization_works_ht", scope: !797, file: !191, line: 169, baseType: !281, size: 64, offset: 640)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !797, file: !191, line: 191, baseType: !866, size: 64, offset: 704)
!866 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !797, file: !191, line: 171, size: 64, elements: !867)
!867 = !{!868, !869}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !866, file: !191, line: 184, baseType: !281, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !866, file: !191, line: 190, baseType: !288, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fd_ring", scope: !797, file: !191, line: 196, baseType: !871, size: 256, offset: 768)
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "I_ring", file: !292, line: 39, baseType: !872)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "I_ring", file: !292, line: 31, size: 256, elements: !873)
!873 = !{!874, !875, !876, !877, !878}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "ir_data", scope: !872, file: !292, line: 33, baseType: !296, size: 128)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "ir_default_val", scope: !872, file: !292, line: 34, baseType: !40, size: 32, offset: 128)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "ir_front", scope: !872, file: !292, line: 35, baseType: !6, size: 32, offset: 160)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "ir_back", scope: !872, file: !292, line: 36, baseType: !6, size: 32, offset: 192)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "ir_empty", scope: !872, file: !292, line: 37, baseType: !303, size: 8, offset: 224)
!879 = distinct !DICompileUnit(language: DW_LANG_C99, file: !880, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !41, retainedTypes: !881, nameTableKind: None)
!880 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!881 = !{!93}
!882 = distinct !DICompileUnit(language: DW_LANG_C99, file: !883, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !884, retainedTypes: !1019, nameTableKind: None)
!883 = !DIFile(filename: "lib/fts.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!884 = !{!885, !889, !894, !999, !1002, !1005, !1016}
!885 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Fts_stat", file: !883, line: 156, baseType: !6, size: 32, elements: !886)
!886 = !{!887, !888}
!887 = !DIEnumerator(name: "FTS_NO_STAT_REQUIRED", value: 1, isUnsigned: true)
!888 = !DIEnumerator(name: "FTS_STAT_REQUIRED", value: 2, isUnsigned: true)
!889 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "leaf_optimization", file: !883, line: 643, baseType: !6, size: 32, elements: !890)
!890 = !{!891, !892, !893}
!891 = !DIEnumerator(name: "NO_LEAF_OPTIMIZATION", value: 0, isUnsigned: true)
!892 = !DIEnumerator(name: "OK_LEAF_OPTIMIZATION", value: 1, isUnsigned: true)
!893 = !DIEnumerator(name: "NOSTAT_LEAF_OPTIMIZATION", value: 2, isUnsigned: true)
!894 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !896, file: !895, line: 54, baseType: !6, size: 32, elements: !997)
!895 = !DIFile(filename: "./lib/fts-cycle.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!896 = distinct !DISubprogram(name: "setup_dir", scope: !895, file: !895, line: 50, type: !897, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !882, retainedNodes: !995)
!897 = !DISubroutineType(types: !898)
!898 = !{!303, !899}
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !191, line: 197, baseType: !901)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !191, line: 80, size: 1024, elements: !902)
!902 = !{!903, !949, !950, !952, !953, !954, !955, !956, !957, !958, !965, !966, !967, !986}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !901, file: !191, line: 81, baseType: !904, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !191, line: 199, size: 2112, elements: !906)
!906 = !{!907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !948}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !905, file: !191, line: 200, baseType: !904, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !905, file: !191, line: 201, baseType: !904, size: 64, offset: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !905, file: !191, line: 202, baseType: !904, size: 64, offset: 128)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !905, file: !191, line: 203, baseType: !201, size: 64, offset: 192)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !905, file: !191, line: 206, baseType: !71, size: 64, offset: 256)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !905, file: !191, line: 207, baseType: !93, size: 64, offset: 320)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !905, file: !191, line: 208, baseType: !36, size: 64, offset: 384)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !905, file: !191, line: 209, baseType: !36, size: 64, offset: 448)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !905, file: !191, line: 210, baseType: !40, size: 32, offset: 512)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !905, file: !191, line: 211, baseType: !40, size: 32, offset: 544)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !905, file: !191, line: 212, baseType: !95, size: 64, offset: 576)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !905, file: !191, line: 214, baseType: !899, size: 64, offset: 640)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !905, file: !191, line: 218, baseType: !216, size: 64, offset: 704)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !905, file: !191, line: 220, baseType: !95, size: 64, offset: 768)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "fts_n_dirs_remaining", scope: !905, file: !191, line: 225, baseType: !219, size: 64, offset: 832)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !905, file: !191, line: 241, baseType: !73, size: 16, offset: 896)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !905, file: !191, line: 245, baseType: !73, size: 16, offset: 912)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !905, file: !191, line: 251, baseType: !73, size: 16, offset: 928)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !905, file: !191, line: 253, baseType: !926, size: 1152, offset: 960)
!926 = !DICompositeType(tag: DW_TAG_array_type, baseType: !927, size: 1152, elements: !78)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !227, line: 46, size: 1152, elements: !928)
!928 = !{!929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !945, !946, !947}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !927, file: !227, line: 48, baseType: !184, size: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !927, file: !227, line: 53, baseType: !181, size: 64, offset: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !927, file: !227, line: 61, baseType: !220, size: 64, offset: 128)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !927, file: !227, line: 62, baseType: !233, size: 32, offset: 192)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !927, file: !227, line: 64, baseType: !235, size: 32, offset: 224)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !927, file: !227, line: 65, baseType: !237, size: 32, offset: 256)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !927, file: !227, line: 67, baseType: !40, size: 32, offset: 288)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !927, file: !227, line: 69, baseType: !184, size: 64, offset: 320)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !927, file: !227, line: 74, baseType: !69, size: 64, offset: 384)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !927, file: !227, line: 78, baseType: !242, size: 64, offset: 448)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !927, file: !227, line: 80, baseType: !244, size: 64, offset: 512)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !927, file: !227, line: 91, baseType: !941, size: 128, offset: 576)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !247, line: 10, size: 128, elements: !942)
!942 = !{!943, !944}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !941, file: !247, line: 12, baseType: !250, size: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !941, file: !247, line: 16, baseType: !252, size: 64, offset: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !927, file: !227, line: 92, baseType: !941, size: 128, offset: 704)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !927, file: !227, line: 93, baseType: !941, size: 128, offset: 832)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !927, file: !227, line: 106, baseType: !256, size: 192, offset: 960)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "fts_name", scope: !905, file: !191, line: 254, baseType: !260, offset: 2112)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "fts_child", scope: !901, file: !191, line: 82, baseType: !904, size: 64, offset: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "fts_array", scope: !901, file: !191, line: 83, baseType: !951, size: 64, offset: 128)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !901, file: !191, line: 84, baseType: !183, size: 64, offset: 192)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !901, file: !191, line: 85, baseType: !36, size: 64, offset: 256)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "fts_rfd", scope: !901, file: !191, line: 86, baseType: !40, size: 32, offset: 320)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cwd_fd", scope: !901, file: !191, line: 87, baseType: !40, size: 32, offset: 352)
