source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.Active_dir = type { i64, i64, %struct._ftsent* }
%struct.FTS = type { %struct._ftsent*, %struct._ftsent*, %struct._ftsent**, i64, i8*, i32, i32, i64, i64, i32 (%struct._ftsent**, %struct._ftsent**)*, i32, %struct.hash_table*, %union.anon, %struct.I_ring }
%struct.I_ring = type { [4 x i32], i32, i32, i32, i8 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__dirstream = type opaque
%struct.__fsid_t = type { [2 x i32] }
%struct.__mbstate_t = type { i32, %union.anon.13 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct._ftsent = type { %struct._ftsent*, %struct._ftsent*, %struct._ftsent*, %struct.__dirstream*, i64, i8*, i8*, i8*, i32, i32, i64, %struct.FTS*, i64, i64, i64, i16, i16, i16, [1 x %struct.stat], [0 x i8] }
%struct.cycle_check_state = type { %struct.timespec, i64, i32 }
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%struct.hash_entry = type { i8*, %struct.hash_entry* }

!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !31, globals: !36)
!3 = !DIFile(filename: "src/chmod.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!4 = !{!5, !11, !25}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Verbosity", file: !3, line: 50, baseType: !6, size: 32, elements: !7)
!6 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!7 = !{!8, !9, !10}
!8 = !DIEnumerator(name: "V_high", value: 0, isUnsigned: true)
!9 = !DIEnumerator(name: "V_changes_only", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "V_off", value: 2, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !12, line: 32, baseType: !6, size: 32, elements: !13)
!12 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!13 = !{!14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24}
!14 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!17 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!18 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!19 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!20 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!21 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!22 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!23 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!24 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Change_status", file: !3, line: 42, baseType: !6, size: 32, elements: !26)
!26 = !{!27, !28, !29, !30}
!27 = !DIEnumerator(name: "CH_NOT_APPLIED", value: 0, isUnsigned: true)
!28 = !DIEnumerator(name: "CH_SUCCEEDED", value: 1, isUnsigned: true)
!29 = !DIEnumerator(name: "CH_FAILED", value: 2, isUnsigned: true)
!30 = !DIEnumerator(name: "CH_NO_CHANGE_REQUESTED", value: 3, isUnsigned: true)
!31 = !{!32, !34, !35}
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!35 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!36 = !{!37, !77, !82, !86, !88, !90, !91, !94, !108}
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "dev_ino_buf", scope: !39, file: !3, line: 555, type: !66, isLocal: true, isDefinition: true)
!39 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 415, type: !40, isDefinition: true, scopeLine: 416, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !44)
!40 = !DISubroutineType(types: !41)
!41 = !{!42, !42, !43}
!42 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!44 = !{!45, !46, !47, !48, !51, !52, !54, !55, !58, !59, !63, !64, !65}
!45 = !DILocalVariable(name: "argc", arg: 1, scope: !39, file: !3, line: 415, type: !42)
!46 = !DILocalVariable(name: "argv", arg: 2, scope: !39, file: !3, line: 415, type: !43)
!47 = !DILocalVariable(name: "mode", scope: !39, file: !3, line: 417, type: !32)
!48 = !DILocalVariable(name: "mode_len", scope: !39, file: !3, line: 418, type: !49)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !50, line: 62, baseType: !35)
!50 = !DIFile(filename: "/usr/lib/clang/7.0.0/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!51 = !DILocalVariable(name: "mode_alloc", scope: !39, file: !3, line: 419, type: !49)
!52 = !DILocalVariable(name: "ok", scope: !39, file: !3, line: 420, type: !53)
!53 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!54 = !DILocalVariable(name: "preserve_root", scope: !39, file: !3, line: 421, type: !53)
!55 = !DILocalVariable(name: "reference_file", scope: !39, file: !3, line: 422, type: !56)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!58 = !DILocalVariable(name: "c", scope: !39, file: !3, line: 423, type: !42)
!59 = !DILocalVariable(name: "arg", scope: !60, file: !3, line: 468, type: !56)
!60 = distinct !DILexicalBlock(scope: !61, file: !3, line: 462, column: 11)
!61 = distinct !DILexicalBlock(scope: !62, file: !3, line: 442, column: 9)
!62 = distinct !DILexicalBlock(scope: !39, file: !3, line: 440, column: 5)
!63 = !DILocalVariable(name: "arg_len", scope: !60, file: !3, line: 469, type: !49)
!64 = !DILocalVariable(name: "mode_comma_len", scope: !60, file: !3, line: 470, type: !49)
!65 = !DILocalVariable(name: "new_mode_len", scope: !60, file: !3, line: 471, type: !49)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !67, line: 7, size: 128, elements: !68)
!67 = !DIFile(filename: "./lib/dev-ino.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!68 = !{!69, !74}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !66, file: !67, line: 9, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !71, line: 47, baseType: !72)
!71 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !73, line: 146, baseType: !35)
!73 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!74 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !66, file: !67, line: 10, baseType: !75, size: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !71, line: 59, baseType: !76)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !73, line: 143, baseType: !35)
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "change", scope: !2, file: !3, line: 63, type: !79, isLocal: true, isDefinition: true)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "mode_change", file: !81, line: 25, flags: DIFlagFwdDecl)
!81 = !DIFile(filename: "./lib/modechange.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!82 = !DIGlobalVariableExpression(var: !83, expr: !DIExpression())
!83 = distinct !DIGlobalVariable(name: "umask_value", scope: !2, file: !3, line: 66, type: !84, isLocal: true, isDefinition: true)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !71, line: 69, baseType: !85)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !73, line: 148, baseType: !6)
!86 = !DIGlobalVariableExpression(var: !87, expr: !DIExpression())
!87 = distinct !DIGlobalVariable(name: "recurse", scope: !2, file: !3, line: 69, type: !53, isLocal: true, isDefinition: true)
!88 = !DIGlobalVariableExpression(var: !89, expr: !DIExpression())
!89 = distinct !DIGlobalVariable(name: "force_silent", scope: !2, file: !3, line: 72, type: !53, isLocal: true, isDefinition: true)
!90 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "root_dev_ino", scope: !2, file: !3, line: 84, type: !93, isLocal: true, isDefinition: true)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!94 = !DIGlobalVariableExpression(var: !95, expr: !DIExpression())
!95 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 95, type: !96, isLocal: true, isDefinition: true)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 2816, elements: !106)
!97 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !99, line: 50, size: 256, elements: !100)
!99 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!100 = !{!101, !102, !103, !105}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !98, file: !99, line: 52, baseType: !56, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !98, file: !99, line: 55, baseType: !42, size: 32, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !98, file: !99, line: 56, baseType: !104, size: 64, offset: 128)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !98, file: !99, line: 57, baseType: !42, size: 32, offset: 192)
!106 = !{!107}
!107 = !DISubrange(count: 11)
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(name: "verbosity", scope: !2, file: !3, line: 80, type: !5, isLocal: true, isDefinition: true)
!110 = !DIGlobalVariableExpression(var: !89, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!111 = !DIGlobalVariableExpression(var: !87, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(name: "Version", scope: !114, file: !115, line: 2, type: !56, isDefinition: true)
!114 = distinct !DICompileUnit(language: DW_LANG_C99, file: !115, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !116, globals: !117)
!115 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!116 = !{}
!117 = !{!112}
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(name: "file_name", scope: !120, file: !125, line: 46, type: !56, isLocal: true, isDefinition: true)
!120 = distinct !DICompileUnit(language: DW_LANG_C99, file: !121, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !116, globals: !122)
!121 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!122 = !{!118, !123}
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !120, file: !125, line: 56, type: !53, isLocal: true, isDefinition: true)
!125 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(name: "exit_failure", scope: !128, file: !131, line: 24, type: !132, isDefinition: true)
!128 = distinct !DICompileUnit(language: DW_LANG_C99, file: !129, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !116, globals: !130)
!129 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!130 = !{!126}
!131 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!132 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !42)
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(name: "program_name", scope: !135, file: !139, line: 33, type: !56, isDefinition: true)
!135 = distinct !DICompileUnit(language: DW_LANG_C99, file: !136, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !116, retainedTypes: !137, globals: !138)
!136 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!137 = !{!34, !32}
!138 = !{!133}
!139 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !142, file: !170, line: 85, type: !205, isDefinition: true)
!142 = distinct !DICompileUnit(language: DW_LANG_C99, file: !143, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !144, retainedTypes: !165, globals: !167)
!143 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!144 = !{!11, !145, !150}
!145 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !12, line: 242, baseType: !6, size: 32, elements: !146)
!146 = !{!147, !148, !149}
!147 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!148 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!149 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!150 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !151, line: 46, baseType: !6, size: 32, elements: !152)
!151 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!152 = !{!153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164}
!153 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!154 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!155 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!156 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!157 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!158 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!159 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!160 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!161 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!162 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!163 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!164 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!165 = !{!42, !166, !49, !32}
!166 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!167 = !{!140, !168, !175, !187, !189, !194, !201, !203}
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !142, file: !170, line: 101, type: !171, isDefinition: true)
!170 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 320, elements: !173)
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!173 = !{!174}
!174 = !DISubrange(count: 10)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !142, file: !170, line: 1052, type: !177, isDefinition: true)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !170, line: 65, size: 448, elements: !178)
!178 = !{!179, !180, !181, !185, !186}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !177, file: !170, line: 68, baseType: !11, size: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !177, file: !170, line: 71, baseType: !42, size: 32, offset: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !177, file: !170, line: 75, baseType: !182, size: 256, offset: 64)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 8)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !177, file: !170, line: 78, baseType: !56, size: 64, offset: 320)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !177, file: !170, line: 81, baseType: !56, size: 64, offset: 384)
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !142, file: !170, line: 116, type: !177, isLocal: true, isDefinition: true)
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(name: "slot0", scope: !142, file: !170, line: 842, type: !191, isLocal: true, isDefinition: true)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 2048, elements: !192)
!192 = !{!193}
!193 = !DISubrange(count: 256)
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(name: "slotvec", scope: !142, file: !170, line: 845, type: !196, isLocal: true, isDefinition: true)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !170, line: 834, size: 128, elements: !198)
!198 = !{!199, !200}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !197, file: !170, line: 836, baseType: !49, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !197, file: !170, line: 837, baseType: !32, size: 64, offset: 64)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "nslots", scope: !142, file: !170, line: 843, type: !42, isLocal: true, isDefinition: true)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(name: "slotvec0", scope: !142, file: !170, line: 844, type: !197, isLocal: true, isDefinition: true)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 704, elements: !106)
!206 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !209, file: !212, line: 26, type: !213, isDefinition: true)
!209 = distinct !DICompileUnit(language: DW_LANG_C99, file: !210, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !116, globals: !211)
!210 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!211 = !{!207}
!212 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 376, elements: !214)
!214 = !{!215}
!215 = !DISubrange(count: 47)
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "default_tuning", scope: !218, file: !222, line: 130, type: !223, isLocal: true, isDefinition: true)
!218 = distinct !DICompileUnit(language: DW_LANG_C99, file: !219, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !116, retainedTypes: !220, globals: !221)
!219 = !DIFile(filename: "./lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!220 = !{!35, !34, !49}
!221 = !{!216}
!222 = !DIFile(filename: "lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!223 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !225, line: 65, baseType: !226)
!225 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !225, line: 53, size: 160, elements: !227)
!227 = !{!228, !230, !231, !232, !233}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !226, file: !225, line: 58, baseType: !229, size: 32)
!229 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !226, file: !225, line: 59, baseType: !229, size: 32, offset: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !226, file: !225, line: 60, baseType: !229, size: 32, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !226, file: !225, line: 61, baseType: !229, size: 32, offset: 96)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !226, file: !225, line: 62, baseType: !53, size: 8, offset: 128)
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !236, file: !237, line: 339, type: !42, isLocal: true, isDefinition: true)
!236 = distinct !DISubprogram(name: "rpl_fcntl", scope: !237, file: !237, line: 276, type: !238, isDefinition: true, scopeLine: 277, flags: DIFlagPrototyped, isOptimized: true, unit: !240, retainedNodes: !243)
!237 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!238 = !DISubroutineType(types: !239)
!239 = !{!42, !42, !42, null}
!240 = distinct !DICompileUnit(language: DW_LANG_C99, file: !241, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !116, globals: !242)
!241 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!242 = !{!234}
!243 = !{!244, !245, !246, !259, !260, !263, !266, !269}
!244 = !DILocalVariable(name: "fd", arg: 1, scope: !236, file: !237, line: 276, type: !42)
!245 = !DILocalVariable(name: "action", arg: 2, scope: !236, file: !237, line: 276, type: !42)
!246 = !DILocalVariable(name: "arg", scope: !236, file: !237, line: 278, type: !247)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !248, line: 30, baseType: !249)
!248 = !DIFile(filename: "/usr/lib/clang/7.0.0/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !241, line: 278, baseType: !250)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, size: 192, elements: !257)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !241, line: 278, size: 192, elements: !252)
!252 = !{!253, !254, !255, !256}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !251, file: !241, line: 278, baseType: !6, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !251, file: !241, line: 278, baseType: !6, size: 32, offset: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !251, file: !241, line: 278, baseType: !34, size: 64, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !251, file: !241, line: 278, baseType: !34, size: 64, offset: 128)
!257 = !{!258}
!258 = !DISubrange(count: 1)
!259 = !DILocalVariable(name: "result", scope: !236, file: !237, line: 279, type: !42)
!260 = !DILocalVariable(name: "target", scope: !261, file: !237, line: 326, type: !42)
!261 = distinct !DILexicalBlock(scope: !262, file: !237, line: 325, column: 7)
!262 = distinct !DILexicalBlock(scope: !236, file: !237, line: 282, column: 5)
!263 = !DILocalVariable(name: "flags", scope: !264, file: !237, line: 363, type: !42)
!264 = distinct !DILexicalBlock(scope: !265, file: !237, line: 362, column: 11)
!265 = distinct !DILexicalBlock(scope: !261, file: !237, line: 361, column: 13)
!266 = !DILocalVariable(name: "saved_errno", scope: !267, file: !237, line: 366, type: !42)
!267 = distinct !DILexicalBlock(scope: !268, file: !237, line: 365, column: 15)
!268 = distinct !DILexicalBlock(scope: !264, file: !237, line: 364, column: 17)
!269 = !DILocalVariable(name: "p", scope: !270, file: !237, line: 408, type: !34)
!270 = distinct !DILexicalBlock(scope: !262, file: !237, line: 406, column: 7)
!271 = distinct !DICompileUnit(language: DW_LANG_C99, file: !272, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !116)
!272 = !DIFile(filename: "./lib/filemode.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!273 = distinct !DICompileUnit(language: DW_LANG_C99, file: !274, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !275, retainedTypes: !283)
!274 = !DIFile(filename: "./lib/modechange.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!275 = !{!276}
!276 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !277, line: 78, baseType: !6, size: 32, elements: !278)
!277 = !DIFile(filename: "lib/modechange.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!278 = !{!279, !280, !281, !282}
!279 = !DIEnumerator(name: "MODE_DONE", value: 0, isUnsigned: true)
!280 = !DIEnumerator(name: "MODE_ORDINARY_CHANGE", value: 1, isUnsigned: true)
!281 = !DIEnumerator(name: "MODE_X_IF_ANY_X", value: 2, isUnsigned: true)
!282 = !DIEnumerator(name: "MODE_COPY_EXISTING", value: 3, isUnsigned: true)
!283 = !{!49}
!284 = distinct !DICompileUnit(language: DW_LANG_C99, file: !285, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !116)
!285 = !DIFile(filename: "./lib/root-dev-ino.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!286 = distinct !DICompileUnit(language: DW_LANG_C99, file: !287, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !288, retainedTypes: !293)
!287 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!288 = !{!289}
!289 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !290, line: 41, baseType: !6, size: 32, elements: !291)
!290 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!291 = !{!292}
!292 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2018, isUnsigned: true)
!293 = !{!34}
!294 = distinct !DICompileUnit(language: DW_LANG_C99, file: !295, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !296, retainedTypes: !310)
!295 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!296 = !{!297}
!297 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !299, file: !298, line: 186, baseType: !6, size: 32, elements: !308)
!298 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!299 = distinct !DISubprogram(name: "x2nrealloc", scope: !298, file: !298, line: 174, type: !300, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: true, unit: !294, retainedNodes: !303)
!300 = !DISubroutineType(types: !301)
!301 = !{!34, !34, !302, !49}
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!303 = !{!304, !305, !306, !307}
!304 = !DILocalVariable(name: "p", arg: 1, scope: !299, file: !298, line: 174, type: !34)
!305 = !DILocalVariable(name: "pn", arg: 2, scope: !299, file: !298, line: 174, type: !302)
!306 = !DILocalVariable(name: "s", arg: 3, scope: !299, file: !298, line: 174, type: !49)
!307 = !DILocalVariable(name: "n", scope: !299, file: !298, line: 176, type: !49)
!308 = !{!309}
!309 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!310 = !{!49, !32, !34}
!311 = distinct !DICompileUnit(language: DW_LANG_C99, file: !312, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !116)
!312 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!313 = distinct !DICompileUnit(language: DW_LANG_C99, file: !314, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !116, retainedTypes: !293)
!314 = !DIFile(filename: "./lib/xfts.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!315 = distinct !DICompileUnit(language: DW_LANG_C99, file: !316, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !116, retainedTypes: !293)
!316 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!317 = distinct !DICompileUnit(language: DW_LANG_C99, file: !318, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !319, retainedTypes: !485)
!318 = !DIFile(filename: "./lib/fts.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!319 = !{!320, !325, !330, !465, !468, !471, !482}
!320 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Fts_stat", file: !321, line: 155, baseType: !6, size: 32, elements: !322)
!321 = !DIFile(filename: "lib/fts.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!322 = !{!323, !324}
!323 = !DIEnumerator(name: "FTS_NO_STAT_REQUIRED", value: 1, isUnsigned: true)
!324 = !DIEnumerator(name: "FTS_STAT_REQUIRED", value: 2, isUnsigned: true)
!325 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "leaf_optimization", file: !321, line: 669, baseType: !6, size: 32, elements: !326)
!326 = !{!327, !328, !329}
!327 = !DIEnumerator(name: "NO_LEAF_OPTIMIZATION", value: 0, isUnsigned: true)
!328 = !DIEnumerator(name: "OK_LEAF_OPTIMIZATION", value: 1, isUnsigned: true)
!329 = !DIEnumerator(name: "NOSTAT_LEAF_OPTIMIZATION", value: 2, isUnsigned: true)
!330 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !332, file: !331, line: 54, baseType: !6, size: 32, elements: !463)
!331 = !DIFile(filename: "./lib/fts-cycle.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!332 = distinct !DISubprogram(name: "setup_dir", scope: !331, file: !331, line: 50, type: !333, isLocal: true, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: true, unit: !317, retainedNodes: !461)
!333 = !DISubroutineType(types: !334)
!334 = !{!53, !335}
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !337, line: 199, baseType: !338)
!337 = !DIFile(filename: "./lib/fts_.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !337, line: 80, size: 1024, elements: !339)
!339 = !{!340, !409, !410, !412, !413, !414, !415, !416, !417, !418, !425, !426, !429, !448}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !338, file: !337, line: 81, baseType: !341, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !337, line: 201, size: 2112, elements: !343)
!343 = !{!344, !345, !346, !347, !352, !354, !355, !356, !357, !358, !359, !360, !361, !363, !364, !367, !368, !369, !370, !405}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !342, file: !337, line: 202, baseType: !341, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !342, file: !337, line: 203, baseType: !341, size: 64, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !342, file: !337, line: 204, baseType: !341, size: 64, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !342, file: !337, line: 205, baseType: !348, size: 64, offset: 192)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !350, line: 127, baseType: !351)
!350 = !DIFile(filename: "/usr/include/dirent.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!351 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !350, line: 127, flags: DIFlagFwdDecl)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !342, file: !337, line: 208, baseType: !353, size: 64, offset: 256)
!353 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !342, file: !337, line: 209, baseType: !34, size: 64, offset: 320)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !342, file: !337, line: 210, baseType: !32, size: 64, offset: 384)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !342, file: !337, line: 211, baseType: !32, size: 64, offset: 448)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !342, file: !337, line: 212, baseType: !42, size: 32, offset: 512)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !342, file: !337, line: 213, baseType: !42, size: 32, offset: 544)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !342, file: !337, line: 214, baseType: !49, size: 64, offset: 576)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !342, file: !337, line: 216, baseType: !335, size: 64, offset: 640)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !342, file: !337, line: 220, baseType: !362, size: 64, offset: 704)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !50, line: 51, baseType: !353)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !342, file: !337, line: 222, baseType: !49, size: 64, offset: 768)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "fts_n_dirs_remaining", scope: !342, file: !337, line: 227, baseType: !365, size: 64, offset: 832)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !71, line: 74, baseType: !366)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !73, line: 149, baseType: !35)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !342, file: !337, line: 243, baseType: !166, size: 16, offset: 896)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !342, file: !337, line: 247, baseType: !166, size: 16, offset: 912)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !342, file: !337, line: 253, baseType: !166, size: 16, offset: 928)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !342, file: !337, line: 255, baseType: !371, size: 1152, offset: 960)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !372, size: 1152, elements: !257)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !373, line: 46, size: 1152, elements: !374)
!373 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!374 = !{!375, !376, !377, !378, !379, !381, !383, !384, !385, !387, !389, !391, !399, !400, !401}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !372, file: !373, line: 48, baseType: !76, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !372, file: !373, line: 53, baseType: !72, size: 64, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !372, file: !373, line: 61, baseType: !366, size: 64, offset: 128)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !372, file: !373, line: 62, baseType: !85, size: 32, offset: 192)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !372, file: !373, line: 64, baseType: !380, size: 32, offset: 224)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !73, line: 144, baseType: !6)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !372, file: !373, line: 65, baseType: !382, size: 32, offset: 256)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !73, line: 145, baseType: !6)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !372, file: !373, line: 67, baseType: !42, size: 32, offset: 288)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !372, file: !373, line: 69, baseType: !76, size: 64, offset: 320)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !372, file: !373, line: 74, baseType: !386, size: 64, offset: 384)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !73, line: 150, baseType: !353)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !372, file: !373, line: 78, baseType: !388, size: 64, offset: 448)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !73, line: 172, baseType: !353)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !372, file: !373, line: 80, baseType: !390, size: 64, offset: 512)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !73, line: 177, baseType: !353)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !372, file: !373, line: 91, baseType: !392, size: 128, offset: 576)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !393, line: 9, size: 128, elements: !394)
!393 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!394 = !{!395, !397}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !392, file: !393, line: 11, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !73, line: 158, baseType: !353)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !392, file: !393, line: 12, baseType: !398, size: 64, offset: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !73, line: 194, baseType: !353)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !372, file: !373, line: 92, baseType: !392, size: 128, offset: 704)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !372, file: !373, line: 93, baseType: !392, size: 128, offset: 832)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !372, file: !373, line: 106, baseType: !402, size: 192, offset: 960)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !398, size: 192, elements: !403)
!403 = !{!404}
!404 = !DISubrange(count: 3)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "fts_name", scope: !342, file: !337, line: 256, baseType: !406, offset: 2112)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, elements: !407)
!407 = !{!408}
!408 = !DISubrange(count: -1)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "fts_child", scope: !338, file: !337, line: 82, baseType: !341, size: 64, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "fts_array", scope: !338, file: !337, line: 83, baseType: !411, size: 64, offset: 128)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !338, file: !337, line: 84, baseType: !75, size: 64, offset: 192)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !338, file: !337, line: 85, baseType: !32, size: 64, offset: 256)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "fts_rfd", scope: !338, file: !337, line: 86, baseType: !42, size: 32, offset: 320)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cwd_fd", scope: !338, file: !337, line: 87, baseType: !42, size: 32, offset: 352)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !338, file: !337, line: 89, baseType: !49, size: 64, offset: 384)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "fts_nitems", scope: !338, file: !337, line: 90, baseType: !49, size: 64, offset: 448)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "fts_compar", scope: !338, file: !337, line: 91, baseType: !419, size: 64, offset: 512)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{!42, !422, !422}
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !342)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "fts_options", scope: !338, file: !337, line: 162, baseType: !42, size: 32, offset: 576)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "fts_leaf_optimization_works_ht", scope: !338, file: !337, line: 171, baseType: !427, size: 64, offset: 640)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !337, line: 171, flags: DIFlagFwdDecl)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !338, file: !337, line: 193, baseType: !430, size: 64, offset: 704)
!430 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !338, file: !337, line: 173, size: 64, elements: !431)
!431 = !{!432, !433}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !430, file: !337, line: 186, baseType: !427, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !430, file: !337, line: 192, baseType: !434, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cycle_check_state", file: !436, line: 28, size: 256, elements: !437)
!436 = !DIFile(filename: "./lib/cycle-check.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!437 = !{!438, !443, !447}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "dev_ino", scope: !435, file: !436, line: 30, baseType: !439, size: 128)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !67, line: 7, size: 128, elements: !440)
!440 = !{!441, !442}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !439, file: !67, line: 9, baseType: !70, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !439, file: !67, line: 10, baseType: !75, size: 64, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "chdir_counter", scope: !435, file: !436, line: 31, baseType: !444, size: 64, offset: 128)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !445, line: 102, baseType: !446)
!445 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !73, line: 72, baseType: !35)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !435, file: !436, line: 32, baseType: !42, size: 32, offset: 192)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fd_ring", scope: !338, file: !337, line: 198, baseType: !449, size: 256, offset: 768)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "I_ring", file: !450, line: 39, baseType: !451)
!450 = !DIFile(filename: "./lib/i-ring.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "I_ring", file: !450, line: 31, size: 256, elements: !452)
!452 = !{!453, !457, !458, !459, !460}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "ir_data", scope: !451, file: !450, line: 33, baseType: !454, size: 128)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 128, elements: !455)
!455 = !{!456}
!456 = !DISubrange(count: 4)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "ir_default_val", scope: !451, file: !450, line: 34, baseType: !42, size: 32, offset: 128)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "ir_front", scope: !451, file: !450, line: 35, baseType: !6, size: 32, offset: 160)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "ir_back", scope: !451, file: !450, line: 36, baseType: !6, size: 32, offset: 192)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "ir_empty", scope: !451, file: !450, line: 37, baseType: !53, size: 8, offset: 224)
!461 = !{!462}
!462 = !DILocalVariable(name: "fts", arg: 1, scope: !332, file: !331, line: 50, type: !335)
!463 = !{!464}
!464 = !DIEnumerator(name: "HT_INITIAL_SIZE", value: 31, isUnsigned: true)
!465 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !321, line: 712, baseType: !6, size: 32, elements: !466)
!466 = !{!467}
!467 = !DIEnumerator(name: "DEV_TYPE_HT_INITIAL_SIZE", value: 13, isUnsigned: true)
!468 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !321, line: 666, baseType: !6, size: 32, elements: !469)
!469 = !{!470}
!470 = !DIEnumerator(name: "MIN_DIR_NLINK", value: 2, isUnsigned: true)
!471 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !350, line: 97, baseType: !6, size: 32, elements: !472)
!472 = !{!473, !474, !475, !476, !477, !478, !479, !480, !481}
!473 = !DIEnumerator(name: "DT_UNKNOWN", value: 0, isUnsigned: true)
!474 = !DIEnumerator(name: "DT_FIFO", value: 1, isUnsigned: true)
!475 = !DIEnumerator(name: "DT_CHR", value: 2, isUnsigned: true)
!476 = !DIEnumerator(name: "DT_DIR", value: 4, isUnsigned: true)
!477 = !DIEnumerator(name: "DT_BLK", value: 6, isUnsigned: true)
!478 = !DIEnumerator(name: "DT_REG", value: 8, isUnsigned: true)
!479 = !DIEnumerator(name: "DT_LNK", value: 10, isUnsigned: true)
!480 = !DIEnumerator(name: "DT_SOCK", value: 12, isUnsigned: true)
!481 = !DIEnumerator(name: "DT_WHT", value: 14, isUnsigned: true)
!482 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !321, line: 150, baseType: !6, size: 32, elements: !483)
!483 = !{!484}
!484 = !DIEnumerator(name: "_FTS_INODE_SORT_DIR_ENTRIES_THRESHOLD", value: 10000, isUnsigned: true)
!485 = !{!34, !365, !444, !32, !353, !486, !491}
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DISubroutineType(types: !488)
!488 = !{!42, !489, !489}
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTSENT", file: !337, line: 257, baseType: !342)
!495 = distinct !DICompileUnit(language: DW_LANG_C99, file: !496, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !116, retainedTypes: !283)
!496 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!497 = distinct !DICompileUnit(language: DW_LANG_C99, file: !498, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !116)
!498 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!499 = distinct !DICompileUnit(language: DW_LANG_C99, file: !500, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !116)
!500 = !DIFile(filename: "./lib/cycle-check.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!501 = distinct !DICompileUnit(language: DW_LANG_C99, file: !502, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !116)
!502 = !DIFile(filename: "./lib/open-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!503 = distinct !DICompileUnit(language: DW_LANG_C99, file: !504, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !116)
!504 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!505 = distinct !DICompileUnit(language: DW_LANG_C99, file: !506, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !507)
!506 = !DIFile(filename: "./lib/i-ring.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!507 = !{!508}
!508 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !450, line: 20, baseType: !6, size: 32, elements: !509)
!509 = !{!510}
!510 = !DIEnumerator(name: "I_RING_SIZE", value: 4, isUnsigned: true)
!511 = distinct !DICompileUnit(language: DW_LANG_C99, file: !512, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !513, retainedTypes: !293)
!512 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!513 = !{!514}
!514 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !515, line: 41, baseType: !6, size: 32, elements: !516)
!515 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!516 = !{!517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899}
!517 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!518 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!519 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!520 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!521 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!522 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!523 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!524 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!525 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!526 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!527 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!528 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!529 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!530 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!531 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!532 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!533 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!534 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!535 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!536 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!537 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!538 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!539 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!540 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!541 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!542 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!543 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!544 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!545 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!546 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!547 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!548 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!549 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!550 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!551 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!552 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!553 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!554 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!555 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!556 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!557 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!558 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!559 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!560 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!561 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!562 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!563 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!564 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!565 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!566 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!567 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!568 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!569 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!570 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!571 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!572 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!573 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!574 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!575 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!576 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!577 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!578 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!579 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!580 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!581 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!582 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!583 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!584 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!585 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!586 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!587 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!588 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!589 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!590 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!591 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!592 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!593 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!594 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!595 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!596 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!597 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!598 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!599 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!600 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!601 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!602 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!603 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!604 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!605 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!606 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!607 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!608 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!609 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!610 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!611 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!612 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!613 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!614 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!615 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!616 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!617 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!618 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!619 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!620 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!621 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!622 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!623 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!624 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!625 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!626 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!627 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!628 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!629 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!630 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!631 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!632 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!633 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!634 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!635 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!636 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!637 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!638 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!639 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!661 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!662 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!663 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!664 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!665 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!666 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!667 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!668 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!669 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!670 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!671 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!672 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!673 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!674 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!675 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!676 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!677 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!678 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!679 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!680 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!681 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!682 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!683 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!684 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!685 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!686 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!687 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!688 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!689 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!690 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!691 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!692 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!693 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!694 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!695 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!696 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!697 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!698 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!699 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!700 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!701 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!702 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!703 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!704 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!705 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!706 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!707 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!708 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!709 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!710 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!711 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!712 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!713 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!714 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!715 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!716 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!717 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!719 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!720 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!721 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!722 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!723 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!724 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!725 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!726 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!727 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!728 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!729 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!730 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!731 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!732 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!733 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!734 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!735 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!736 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!737 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!738 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!739 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!740 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!741 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!742 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!743 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!744 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!745 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!746 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!747 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!748 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!749 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!750 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!751 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!752 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!753 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!754 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!755 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!756 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!757 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!758 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!759 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!760 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!761 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!762 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!763 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!764 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!765 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!766 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!767 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!768 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!769 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!770 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!771 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!772 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!773 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!774 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!779 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!780 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!781 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!782 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!783 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!784 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!785 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!786 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!787 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!788 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!789 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!790 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!791 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!792 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!793 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!794 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!795 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!796 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!797 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!798 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!799 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!800 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!801 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!802 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!803 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!804 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!805 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!806 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!807 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!808 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!809 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!810 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!812 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!813 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!814 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!815 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!816 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!817 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!818 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!819 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!820 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!821 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!822 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!823 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!824 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!825 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!826 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!827 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!828 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!829 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!830 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!831 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!832 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!833 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!834 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!835 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!836 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!837 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!838 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!839 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!840 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!841 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!842 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!843 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!844 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!845 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!846 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!847 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!884 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!885 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!886 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!887 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!894 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!895 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!896 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!898 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!899 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!900 = distinct !DICompileUnit(language: DW_LANG_C99, file: !901, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !116)
!901 = !DIFile(filename: "./lib/openat-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!902 = distinct !DICompileUnit(language: DW_LANG_C99, file: !903, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !116)
!903 = !DIFile(filename: "./lib/fd-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!904 = distinct !DICompileUnit(language: DW_LANG_C99, file: !905, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !116)
!905 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!906 = distinct !DICompileUnit(language: DW_LANG_C99, file: !907, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !116, retainedTypes: !293)
!907 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!908 = distinct !DICompileUnit(language: DW_LANG_C99, file: !909, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !116, retainedTypes: !293)
!909 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!910 = distinct !DICompileUnit(language: DW_LANG_C99, file: !911, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !116)
!911 = !DIFile(filename: "./lib/dup-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!912 = !{!"clang version 7.0.0 (tags/RELEASE_700/final)"}
!913 = !{i32 2, !"Dwarf Version", i32 4}
!914 = !{i32 2, !"Debug Info Version", i32 3}
!915 = !{i32 1, !"wchar_size", i32 4}
!916 = !{i32 7, !"PIC Level", i32 2}
!917 = !{i32 7, !"PIE Level", i32 2}
!918 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 368, type: !919, isDefinition: true, scopeLine: 369, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, retainedNodes: !921)
!919 = !DISubroutineType(types: !920)
!920 = !{null, !42}
!921 = !{!922}
!922 = !DILocalVariable(name: "status", arg: 1, scope: !918, file: !3, line: 368, type: !42)
!923 = !DILocalVariable(name: "infomap", scope: !924, file: !925, line: 632, type: !939)
!924 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !925, file: !925, line: 630, type: !926, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !928)
!925 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!926 = !DISubroutineType(types: !927)
!927 = !{null, !56}
!928 = !{!929, !923, !930, !931, !938}
!929 = !DILocalVariable(name: "program", arg: 1, scope: !924, file: !925, line: 630, type: !56)
!930 = !DILocalVariable(name: "node", scope: !924, file: !925, line: 642, type: !56)
!931 = !DILocalVariable(name: "map_prog", scope: !924, file: !925, line: 643, type: !932)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !934)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !924, file: !925, line: 632, size: 128, elements: !935)
!935 = !{!936, !937}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !934, file: !925, line: 632, baseType: !56, size: 64)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !934, file: !925, line: 632, baseType: !56, size: 64, offset: 64)
!938 = !DILocalVariable(name: "lc_messages", scope: !924, file: !925, line: 655, type: !56)
!939 = !DICompositeType(tag: DW_TAG_array_type, baseType: !933, size: 896, elements: !940)
!940 = !{!941}
!941 = !DISubrange(count: 7)
!942 = !DILocation(line: 632, column: 67, scope: !924, inlinedAt: !943)
!943 = distinct !DILocation(line: 406, column: 7, scope: !944)
!944 = distinct !DILexicalBlock(scope: !945, file: !3, line: 373, column: 5)
!945 = distinct !DILexicalBlock(scope: !918, file: !3, line: 370, column: 7)
!946 = !DILocation(line: 368, column: 12, scope: !918)
!947 = !DILocation(line: 370, column: 14, scope: !945)
!948 = !DILocation(line: 370, column: 7, scope: !918)
!949 = !DILocation(line: 371, column: 5, scope: !950)
!950 = distinct !DILexicalBlock(scope: !945, file: !3, line: 371, column: 5)
!951 = !{!952, !952, i64 0}
!952 = !{!"any pointer", !953, i64 0}
!953 = !{!"omnipotent char", !954, i64 0}
!954 = !{!"Simple C/C++ TBAA"}
!955 = !DILocation(line: 374, column: 7, scope: !944)
!956 = !DILocation(line: 380, column: 7, scope: !944)
!957 = !DILocation(line: 385, column: 7, scope: !944)
!958 = !DILocation(line: 390, column: 7, scope: !944)
!959 = !DILocation(line: 394, column: 7, scope: !944)
!960 = !DILocation(line: 397, column: 7, scope: !944)
!961 = !DILocation(line: 400, column: 7, scope: !944)
!962 = !DILocation(line: 401, column: 7, scope: !944)
!963 = !DILocation(line: 402, column: 7, scope: !944)
!964 = !DILocation(line: 632, column: 3, scope: !924, inlinedAt: !943)
!965 = !DILocation(line: 643, column: 36, scope: !924, inlinedAt: !943)
!966 = !DILocation(line: 643, column: 25, scope: !924, inlinedAt: !943)
!967 = !DILocation(line: 645, column: 33, scope: !924, inlinedAt: !943)
!968 = !DILocation(line: 645, column: 3, scope: !924, inlinedAt: !943)
!969 = !DILocation(line: 646, column: 13, scope: !924, inlinedAt: !943)
!970 = !DILocation(line: 645, column: 20, scope: !924, inlinedAt: !943)
!971 = !{!972, !952, i64 0}
!972 = !{!"infomap", !952, i64 0, !952, i64 8}
!973 = !DILocation(line: 645, column: 10, scope: !924, inlinedAt: !943)
!974 = !DILocation(line: 645, column: 28, scope: !924, inlinedAt: !943)
!975 = distinct !{!975, !976, !977}
!976 = !DILocation(line: 645, column: 3, scope: !924)
!977 = !DILocation(line: 646, column: 13, scope: !924)
!978 = !DILocation(line: 648, column: 17, scope: !979, inlinedAt: !943)
!979 = distinct !DILexicalBlock(scope: !924, file: !925, line: 648, column: 7)
!980 = !{!972, !952, i64 8}
!981 = !DILocation(line: 648, column: 7, scope: !979, inlinedAt: !943)
!982 = !DILocation(line: 648, column: 7, scope: !924, inlinedAt: !943)
!983 = !DILocation(line: 642, column: 15, scope: !924, inlinedAt: !943)
!984 = !DILocation(line: 651, column: 3, scope: !924, inlinedAt: !943)
!985 = !DILocation(line: 655, column: 29, scope: !924, inlinedAt: !943)
!986 = !DILocation(line: 655, column: 15, scope: !924, inlinedAt: !943)
!987 = !DILocation(line: 656, column: 7, scope: !988, inlinedAt: !943)
!988 = distinct !DILexicalBlock(scope: !924, file: !925, line: 656, column: 7)
!989 = !DILocation(line: 656, column: 19, scope: !988, inlinedAt: !943)
!990 = !DILocation(line: 656, column: 22, scope: !988, inlinedAt: !943)
!991 = !DILocation(line: 656, column: 7, scope: !924, inlinedAt: !943)
!992 = !DILocation(line: 662, column: 7, scope: !993, inlinedAt: !943)
!993 = distinct !DILexicalBlock(scope: !988, file: !925, line: 657, column: 5)
!994 = !DILocation(line: 664, column: 5, scope: !993, inlinedAt: !943)
!995 = !DILocation(line: 665, column: 3, scope: !924, inlinedAt: !943)
!996 = !DILocation(line: 667, column: 3, scope: !924, inlinedAt: !943)
!997 = !DILocation(line: 669, column: 1, scope: !924, inlinedAt: !943)
!998 = !DILocation(line: 408, column: 3, scope: !918)
!999 = !DILocalVariable(name: "perms", scope: !1000, file: !3, line: 145, type: !1009)
!1000 = distinct !DISubprogram(name: "describe_change", scope: !3, file: !3, line: 142, type: !1001, isLocal: true, isDefinition: true, scopeLine: 144, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1003)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{null, !56, !84, !84, !25}
!1003 = !{!1004, !1005, !1006, !1007, !999, !1008, !1012}
!1004 = !DILocalVariable(name: "file", arg: 1, scope: !1000, file: !3, line: 142, type: !56)
!1005 = !DILocalVariable(name: "old_mode", arg: 2, scope: !1000, file: !3, line: 142, type: !84)
!1006 = !DILocalVariable(name: "mode", arg: 3, scope: !1000, file: !3, line: 142, type: !84)
!1007 = !DILocalVariable(name: "changed", arg: 4, scope: !1000, file: !3, line: 143, type: !25)
!1008 = !DILocalVariable(name: "old_perms", scope: !1000, file: !3, line: 146, type: !1009)
!1009 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 96, elements: !1010)
!1010 = !{!1011}
!1011 = !DISubrange(count: 12)
!1012 = !DILocalVariable(name: "fmt", scope: !1000, file: !3, line: 147, type: !56)
!1013 = !DILocation(line: 145, column: 8, scope: !1000, inlinedAt: !1014)
!1014 = distinct !DILocation(line: 298, column: 11, scope: !1015, inlinedAt: !1133)
!1015 = distinct !DILexicalBlock(scope: !1016, file: !3, line: 292, column: 9)
!1016 = distinct !DILexicalBlock(scope: !1017, file: !3, line: 291, column: 11)
!1017 = distinct !DILexicalBlock(scope: !1018, file: !3, line: 286, column: 5)
!1018 = distinct !DILexicalBlock(scope: !1019, file: !3, line: 285, column: 7)
!1019 = distinct !DISubprogram(name: "process_file", scope: !3, file: !3, line: 188, type: !1020, isLocal: true, isDefinition: true, scopeLine: 189, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1108)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!53, !1022, !1106}
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !337, line: 199, baseType: !1024)
!1024 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !337, line: 80, size: 1024, elements: !1025)
!1025 = !{!1026, !1072, !1073, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1088, !1089, !1090, !1097}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !1024, file: !337, line: 81, baseType: !1027, size: 64)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !337, line: 201, size: 2112, elements: !1029)
!1029 = !{!1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1071}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !1028, file: !337, line: 202, baseType: !1027, size: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !1028, file: !337, line: 203, baseType: !1027, size: 64, offset: 64)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !1028, file: !337, line: 204, baseType: !1027, size: 64, offset: 128)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !1028, file: !337, line: 205, baseType: !348, size: 64, offset: 192)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !1028, file: !337, line: 208, baseType: !353, size: 64, offset: 256)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !1028, file: !337, line: 209, baseType: !34, size: 64, offset: 320)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !1028, file: !337, line: 210, baseType: !32, size: 64, offset: 384)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !1028, file: !337, line: 211, baseType: !32, size: 64, offset: 448)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !1028, file: !337, line: 212, baseType: !42, size: 32, offset: 512)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !1028, file: !337, line: 213, baseType: !42, size: 32, offset: 544)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !1028, file: !337, line: 214, baseType: !49, size: 64, offset: 576)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !1028, file: !337, line: 216, baseType: !1022, size: 64, offset: 640)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !1028, file: !337, line: 220, baseType: !362, size: 64, offset: 704)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !1028, file: !337, line: 222, baseType: !49, size: 64, offset: 768)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "fts_n_dirs_remaining", scope: !1028, file: !337, line: 227, baseType: !365, size: 64, offset: 832)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !1028, file: !337, line: 243, baseType: !166, size: 16, offset: 896)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !1028, file: !337, line: 247, baseType: !166, size: 16, offset: 912)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !1028, file: !337, line: 253, baseType: !166, size: 16, offset: 928)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !1028, file: !337, line: 255, baseType: !1049, size: 1152, offset: 960)
!1049 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1050, size: 1152, elements: !257)
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !373, line: 46, size: 1152, elements: !1051)
!1051 = !{!1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1068, !1069, !1070}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1050, file: !373, line: 48, baseType: !76, size: 64)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1050, file: !373, line: 53, baseType: !72, size: 64, offset: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1050, file: !373, line: 61, baseType: !366, size: 64, offset: 128)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1050, file: !373, line: 62, baseType: !85, size: 32, offset: 192)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1050, file: !373, line: 64, baseType: !380, size: 32, offset: 224)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1050, file: !373, line: 65, baseType: !382, size: 32, offset: 256)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !1050, file: !373, line: 67, baseType: !42, size: 32, offset: 288)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1050, file: !373, line: 69, baseType: !76, size: 64, offset: 320)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1050, file: !373, line: 74, baseType: !386, size: 64, offset: 384)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1050, file: !373, line: 78, baseType: !388, size: 64, offset: 448)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1050, file: !373, line: 80, baseType: !390, size: 64, offset: 512)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1050, file: !373, line: 91, baseType: !1064, size: 128, offset: 576)
!1064 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !393, line: 9, size: 128, elements: !1065)
!1065 = !{!1066, !1067}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1064, file: !393, line: 11, baseType: !396, size: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1064, file: !393, line: 12, baseType: !398, size: 64, offset: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !1050, file: !373, line: 92, baseType: !1064, size: 128, offset: 704)
