source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.Active_dir = type { i64, i64, %struct._ftsent* }
%struct.FTS = type { %struct._ftsent*, %struct._ftsent*, %struct._ftsent**, i64, i8*, i32, i32, i64, i64, i32 (%struct._ftsent**, %struct._ftsent**)*, i32, %struct.hash_table*, %union.anon, %struct.I_ring }
%struct.I_ring = type { [4 x i32], i32, i32, i32, i8 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__dirstream = type opaque
%struct.__fsid_t = type { [2 x i32] }
%struct.__mbstate_t = type { i32, %union.anon.13 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct._ftsent = type { %struct._ftsent*, %struct._ftsent*, %struct._ftsent*, %struct.__dirstream*, i64, i8*, i8*, i8*, i32, i32, i64, %struct.FTS*, i64, i64, i64, i16, i16, i16, [1 x %struct.stat], [0 x i8] }
%struct.cycle_check_state = type { %struct.timespec, i64, i32 }
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%struct.hash_entry = type { i8*, %struct.hash_entry* }

!1 = distinct !DIGlobalVariable(name: "diagnose_surprises", scope: !2, file: !3, line: 77, type: !53, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !31, globals: !36, nameTableKind: None)
!3 = !DIFile(filename: "src/chmod.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !11, !25}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Verbosity", file: !3, line: 50, baseType: !6, size: 32, elements: !7)
!6 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!7 = !{!8, !9, !10}
!8 = !DIEnumerator(name: "V_high", value: 0, isUnsigned: true)
!9 = !DIEnumerator(name: "V_changes_only", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "V_off", value: 2, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !12, line: 32, baseType: !6, size: 32, elements: !13)
!12 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!13 = !{!14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24}
!14 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!17 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!18 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!19 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!20 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!21 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!22 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!23 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!24 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Change_status", file: !3, line: 42, baseType: !6, size: 32, elements: !26)
!26 = !{!27, !28, !29, !30}
!27 = !DIEnumerator(name: "CH_NOT_APPLIED", value: 0, isUnsigned: true)
!28 = !DIEnumerator(name: "CH_SUCCEEDED", value: 1, isUnsigned: true)
!29 = !DIEnumerator(name: "CH_FAILED", value: 2, isUnsigned: true)
!30 = !DIEnumerator(name: "CH_NO_CHANGE_REQUESTED", value: 3, isUnsigned: true)
!31 = !{!32, !34, !35}
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!35 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!36 = !{!37, !77, !82, !86, !88, !90, !91, !94, !108}
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "dev_ino_buf", scope: !39, file: !3, line: 555, type: !66, isLocal: true, isDefinition: true)
!39 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 415, type: !40, scopeLine: 416, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !44)
!40 = !DISubroutineType(types: !41)
!41 = !{!42, !42, !43}
!42 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!44 = !{!45, !46, !47, !48, !51, !52, !54, !55, !58, !59, !63, !64, !65}
!45 = !DILocalVariable(name: "argc", arg: 1, scope: !39, file: !3, line: 415, type: !42)
!46 = !DILocalVariable(name: "argv", arg: 2, scope: !39, file: !3, line: 415, type: !43)
!47 = !DILocalVariable(name: "mode", scope: !39, file: !3, line: 417, type: !32)
!48 = !DILocalVariable(name: "mode_len", scope: !39, file: !3, line: 418, type: !49)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !50, line: 46, baseType: !35)
!50 = !DIFile(filename: "/usr/lib/clang/12.0.1/include/stddef.h", directory: "")
!51 = !DILocalVariable(name: "mode_alloc", scope: !39, file: !3, line: 419, type: !49)
!52 = !DILocalVariable(name: "ok", scope: !39, file: !3, line: 420, type: !53)
!53 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!54 = !DILocalVariable(name: "preserve_root", scope: !39, file: !3, line: 421, type: !53)
!55 = !DILocalVariable(name: "reference_file", scope: !39, file: !3, line: 422, type: !56)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!58 = !DILocalVariable(name: "c", scope: !39, file: !3, line: 423, type: !42)
!59 = !DILocalVariable(name: "arg", scope: !60, file: !3, line: 468, type: !56)
!60 = distinct !DILexicalBlock(scope: !61, file: !3, line: 462, column: 11)
!61 = distinct !DILexicalBlock(scope: !62, file: !3, line: 442, column: 9)
!62 = distinct !DILexicalBlock(scope: !39, file: !3, line: 440, column: 5)
!63 = !DILocalVariable(name: "arg_len", scope: !60, file: !3, line: 469, type: !49)
!64 = !DILocalVariable(name: "mode_comma_len", scope: !60, file: !3, line: 470, type: !49)
!65 = !DILocalVariable(name: "new_mode_len", scope: !60, file: !3, line: 471, type: !49)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !67, line: 7, size: 128, elements: !68)
!67 = !DIFile(filename: "./lib/dev-ino.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!68 = !{!69, !74}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !66, file: !67, line: 9, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !71, line: 47, baseType: !72)
!71 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !73, line: 148, baseType: !35)
!73 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!74 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !66, file: !67, line: 10, baseType: !75, size: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !71, line: 59, baseType: !76)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !73, line: 145, baseType: !35)
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "change", scope: !2, file: !3, line: 63, type: !79, isLocal: true, isDefinition: true)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "mode_change", file: !81, line: 25, flags: DIFlagFwdDecl)
!81 = !DIFile(filename: "./lib/modechange.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!82 = !DIGlobalVariableExpression(var: !83, expr: !DIExpression())
!83 = distinct !DIGlobalVariable(name: "umask_value", scope: !2, file: !3, line: 66, type: !84, isLocal: true, isDefinition: true)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !71, line: 69, baseType: !85)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !73, line: 150, baseType: !6)
!86 = !DIGlobalVariableExpression(var: !87, expr: !DIExpression())
!87 = distinct !DIGlobalVariable(name: "recurse", scope: !2, file: !3, line: 69, type: !53, isLocal: true, isDefinition: true)
!88 = !DIGlobalVariableExpression(var: !89, expr: !DIExpression())
!89 = distinct !DIGlobalVariable(name: "force_silent", scope: !2, file: !3, line: 72, type: !53, isLocal: true, isDefinition: true)
!90 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "root_dev_ino", scope: !2, file: !3, line: 84, type: !93, isLocal: true, isDefinition: true)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!94 = !DIGlobalVariableExpression(var: !95, expr: !DIExpression())
!95 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 95, type: !96, isLocal: true, isDefinition: true)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 2816, elements: !106)
!97 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !99, line: 50, size: 256, elements: !100)
!99 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!100 = !{!101, !102, !103, !105}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !98, file: !99, line: 52, baseType: !56, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !98, file: !99, line: 55, baseType: !42, size: 32, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !98, file: !99, line: 56, baseType: !104, size: 64, offset: 128)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !98, file: !99, line: 57, baseType: !42, size: 32, offset: 192)
!106 = !{!107}
!107 = !DISubrange(count: 11)
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(name: "verbosity", scope: !2, file: !3, line: 80, type: !5, isLocal: true, isDefinition: true)
!110 = !DIGlobalVariableExpression(var: !89, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!111 = !DIGlobalVariableExpression(var: !87, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(name: "Version", scope: !114, file: !115, line: 2, type: !56, isDefinition: true)
!114 = distinct !DICompileUnit(language: DW_LANG_C99, file: !115, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !116, globals: !117, nameTableKind: None)
!115 = !DIFile(filename: "src/version.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!116 = !{}
!117 = !{!112}
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(name: "file_name", scope: !120, file: !121, line: 46, type: !56, isLocal: true, isDefinition: true)
!120 = distinct !DICompileUnit(language: DW_LANG_C99, file: !121, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !116, globals: !122, nameTableKind: None)
!121 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!122 = !{!118, !123}
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !120, file: !121, line: 56, type: !53, isLocal: true, isDefinition: true)
!125 = !DIGlobalVariableExpression(var: !126, expr: !DIExpression())
!126 = distinct !DIGlobalVariable(name: "exit_failure", scope: !127, file: !128, line: 24, type: !130, isDefinition: true)
!127 = distinct !DICompileUnit(language: DW_LANG_C99, file: !128, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !116, globals: !129, nameTableKind: None)
!128 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!129 = !{!125}
!130 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !42)
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "program_name", scope: !133, file: !134, line: 33, type: !56, isDefinition: true)
!133 = distinct !DICompileUnit(language: DW_LANG_C99, file: !134, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !116, retainedTypes: !135, globals: !136, nameTableKind: None)
!134 = !DIFile(filename: "lib/progname.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!135 = !{!34, !32}
!136 = !{!131}
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !139, file: !140, line: 85, type: !201, isDefinition: true)
!139 = distinct !DICompileUnit(language: DW_LANG_C99, file: !140, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !141, retainedTypes: !162, globals: !164, nameTableKind: None)
!140 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!141 = !{!11, !142, !147}
!142 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !12, line: 242, baseType: !6, size: 32, elements: !143)
!143 = !{!144, !145, !146}
!144 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!145 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!146 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!147 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !148, line: 46, baseType: !6, size: 32, elements: !149)
!148 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!149 = !{!150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161}
!150 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!151 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!152 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!153 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!154 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!155 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!156 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!157 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!158 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!159 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!160 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!161 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!162 = !{!42, !163, !49, !32}
!163 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!164 = !{!137, !165, !171, !183, !185, !190, !197, !199}
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !139, file: !140, line: 101, type: !167, isDefinition: true)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 320, elements: !169)
!168 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!169 = !{!170}
!170 = !DISubrange(count: 10)
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !139, file: !140, line: 1052, type: !173, isDefinition: true)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !140, line: 65, size: 448, elements: !174)
!174 = !{!175, !176, !177, !181, !182}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !173, file: !140, line: 68, baseType: !11, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !173, file: !140, line: 71, baseType: !42, size: 32, offset: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !173, file: !140, line: 75, baseType: !178, size: 256, offset: 64)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 8)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !173, file: !140, line: 78, baseType: !56, size: 64, offset: 320)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !173, file: !140, line: 81, baseType: !56, size: 64, offset: 384)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !139, file: !140, line: 116, type: !173, isLocal: true, isDefinition: true)
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "slot0", scope: !139, file: !140, line: 842, type: !187, isLocal: true, isDefinition: true)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 2048, elements: !188)
!188 = !{!189}
!189 = !DISubrange(count: 256)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(name: "slotvec", scope: !139, file: !140, line: 845, type: !192, isLocal: true, isDefinition: true)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !140, line: 834, size: 128, elements: !194)
!194 = !{!195, !196}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !193, file: !140, line: 836, baseType: !49, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !193, file: !140, line: 837, baseType: !32, size: 64, offset: 64)
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(name: "nslots", scope: !139, file: !140, line: 843, type: !42, isLocal: true, isDefinition: true)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(name: "slotvec0", scope: !139, file: !140, line: 844, type: !193, isLocal: true, isDefinition: true)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 704, elements: !106)
!202 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !205, file: !206, line: 26, type: !208, isDefinition: true)
!205 = distinct !DICompileUnit(language: DW_LANG_C99, file: !206, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !116, globals: !207, nameTableKind: None)
!206 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!207 = !{!203}
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 376, elements: !209)
!209 = !{!210}
!210 = !DISubrange(count: 47)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "default_tuning", scope: !213, file: !214, line: 130, type: !217, isLocal: true, isDefinition: true)
!213 = distinct !DICompileUnit(language: DW_LANG_C99, file: !214, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !116, retainedTypes: !215, globals: !216, nameTableKind: None)
!214 = !DIFile(filename: "lib/hash.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!215 = !{!35, !34, !49}
!216 = !{!211}
!217 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !218)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !219, line: 65, baseType: !220)
!219 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !219, line: 53, size: 160, elements: !221)
!221 = !{!222, !224, !225, !226, !227}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !220, file: !219, line: 58, baseType: !223, size: 32)
!223 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !220, file: !219, line: 59, baseType: !223, size: 32, offset: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !220, file: !219, line: 60, baseType: !223, size: 32, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !220, file: !219, line: 61, baseType: !223, size: 32, offset: 96)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !220, file: !219, line: 62, baseType: !53, size: 8, offset: 128)
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !230, file: !231, line: 507, type: !42, isLocal: true, isDefinition: true)
!230 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !231, file: !231, line: 488, type: !232, scopeLine: 489, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !234, retainedNodes: !236)
!231 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!232 = !DISubroutineType(types: !233)
!233 = !{!42, !42, !42}
!234 = distinct !DICompileUnit(language: DW_LANG_C99, file: !231, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !116, globals: !235, nameTableKind: None)
!235 = !{!228}
!236 = !{!237, !238, !239, !240, !243}
!237 = !DILocalVariable(name: "fd", arg: 1, scope: !230, file: !231, line: 488, type: !42)
!238 = !DILocalVariable(name: "target", arg: 2, scope: !230, file: !231, line: 488, type: !42)
!239 = !DILocalVariable(name: "result", scope: !230, file: !231, line: 490, type: !42)
!240 = !DILocalVariable(name: "flags", scope: !241, file: !231, line: 531, type: !42)
!241 = distinct !DILexicalBlock(scope: !242, file: !231, line: 530, column: 5)
!242 = distinct !DILexicalBlock(scope: !230, file: !231, line: 529, column: 7)
!243 = !DILocalVariable(name: "saved_errno", scope: !244, file: !231, line: 534, type: !42)
!244 = distinct !DILexicalBlock(scope: !245, file: !231, line: 533, column: 9)
!245 = distinct !DILexicalBlock(scope: !241, file: !231, line: 532, column: 11)
!246 = distinct !DICompileUnit(language: DW_LANG_C99, file: !247, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !116, nameTableKind: None)
!247 = !DIFile(filename: "lib/filemode.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!248 = distinct !DICompileUnit(language: DW_LANG_C99, file: !249, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !250, retainedTypes: !257, nameTableKind: None)
!249 = !DIFile(filename: "lib/modechange.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!250 = !{!251}
!251 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !249, line: 78, baseType: !6, size: 32, elements: !252)
!252 = !{!253, !254, !255, !256}
!253 = !DIEnumerator(name: "MODE_DONE", value: 0, isUnsigned: true)
!254 = !DIEnumerator(name: "MODE_ORDINARY_CHANGE", value: 1, isUnsigned: true)
!255 = !DIEnumerator(name: "MODE_X_IF_ANY_X", value: 2, isUnsigned: true)
!256 = !DIEnumerator(name: "MODE_COPY_EXISTING", value: 3, isUnsigned: true)
!257 = !{!49}
!258 = distinct !DICompileUnit(language: DW_LANG_C99, file: !259, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !116, nameTableKind: None)
!259 = !DIFile(filename: "lib/root-dev-ino.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!260 = distinct !DICompileUnit(language: DW_LANG_C99, file: !261, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !262, retainedTypes: !266, nameTableKind: None)
!261 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!262 = !{!263}
!263 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !261, line: 40, baseType: !6, size: 32, elements: !264)
!264 = !{!265}
!265 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!266 = !{!34}
!267 = distinct !DICompileUnit(language: DW_LANG_C99, file: !268, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !269, retainedTypes: !283, nameTableKind: None)
!268 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!269 = !{!270}
!270 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !272, file: !271, line: 186, baseType: !6, size: 32, elements: !281)
!271 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!272 = distinct !DISubprogram(name: "x2nrealloc", scope: !271, file: !271, line: 174, type: !273, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !267, retainedNodes: !276)
!273 = !DISubroutineType(types: !274)
!274 = !{!34, !34, !275, !49}
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!276 = !{!277, !278, !279, !280}
!277 = !DILocalVariable(name: "p", arg: 1, scope: !272, file: !271, line: 174, type: !34)
!278 = !DILocalVariable(name: "pn", arg: 2, scope: !272, file: !271, line: 174, type: !275)
!279 = !DILocalVariable(name: "s", arg: 3, scope: !272, file: !271, line: 174, type: !49)
!280 = !DILocalVariable(name: "n", scope: !272, file: !271, line: 176, type: !49)
!281 = !{!282}
!282 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!283 = !{!49, !32, !34}
!284 = distinct !DICompileUnit(language: DW_LANG_C99, file: !285, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !116, nameTableKind: None)
!285 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!286 = distinct !DICompileUnit(language: DW_LANG_C99, file: !287, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !116, retainedTypes: !266, nameTableKind: None)
!287 = !DIFile(filename: "lib/xfts.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!288 = distinct !DICompileUnit(language: DW_LANG_C99, file: !289, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !116, retainedTypes: !266, nameTableKind: None)
!289 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!290 = distinct !DICompileUnit(language: DW_LANG_C99, file: !291, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !292, retainedTypes: !459, nameTableKind: None)
!291 = !DIFile(filename: "lib/fts.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!292 = !{!293, !297, !302, !439, !442, !445, !456}
!293 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Fts_stat", file: !291, line: 156, baseType: !6, size: 32, elements: !294)
!294 = !{!295, !296}
!295 = !DIEnumerator(name: "FTS_NO_STAT_REQUIRED", value: 1, isUnsigned: true)
!296 = !DIEnumerator(name: "FTS_STAT_REQUIRED", value: 2, isUnsigned: true)
!297 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "leaf_optimization", file: !291, line: 643, baseType: !6, size: 32, elements: !298)
!298 = !{!299, !300, !301}
!299 = !DIEnumerator(name: "NO_LEAF_OPTIMIZATION", value: 0, isUnsigned: true)
!300 = !DIEnumerator(name: "OK_LEAF_OPTIMIZATION", value: 1, isUnsigned: true)
!301 = !DIEnumerator(name: "NOSTAT_LEAF_OPTIMIZATION", value: 2, isUnsigned: true)
!302 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !304, file: !303, line: 54, baseType: !6, size: 32, elements: !437)
!303 = !DIFile(filename: "./lib/fts-cycle.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!304 = distinct !DISubprogram(name: "setup_dir", scope: !303, file: !303, line: 50, type: !305, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !290, retainedNodes: !435)
!305 = !DISubroutineType(types: !306)
!306 = !{!53, !307}
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !309, line: 197, baseType: !310)
!309 = !DIFile(filename: "./lib/fts_.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !309, line: 80, size: 1024, elements: !311)
!311 = !{!312, !383, !384, !386, !387, !388, !389, !390, !391, !392, !399, !400, !403, !422}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !310, file: !309, line: 81, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !309, line: 199, size: 2112, elements: !315)
!315 = !{!316, !317, !318, !319, !324, !326, !327, !328, !329, !330, !331, !332, !333, !335, !336, !339, !340, !341, !342, !379}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !314, file: !309, line: 200, baseType: !313, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !314, file: !309, line: 201, baseType: !313, size: 64, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !314, file: !309, line: 202, baseType: !313, size: 64, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !314, file: !309, line: 203, baseType: !320, size: 64, offset: 192)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !322, line: 127, baseType: !323)
!322 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!323 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !322, line: 127, flags: DIFlagFwdDecl)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !314, file: !309, line: 206, baseType: !325, size: 64, offset: 256)
!325 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !314, file: !309, line: 207, baseType: !34, size: 64, offset: 320)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !314, file: !309, line: 208, baseType: !32, size: 64, offset: 384)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !314, file: !309, line: 209, baseType: !32, size: 64, offset: 448)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !314, file: !309, line: 210, baseType: !42, size: 32, offset: 512)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !314, file: !309, line: 211, baseType: !42, size: 32, offset: 544)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !314, file: !309, line: 212, baseType: !49, size: 64, offset: 576)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !314, file: !309, line: 214, baseType: !307, size: 64, offset: 640)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !314, file: !309, line: 218, baseType: !334, size: 64, offset: 704)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !50, line: 35, baseType: !325)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !314, file: !309, line: 220, baseType: !49, size: 64, offset: 768)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "fts_n_dirs_remaining", scope: !314, file: !309, line: 225, baseType: !337, size: 64, offset: 832)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !71, line: 74, baseType: !338)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !73, line: 151, baseType: !35)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !314, file: !309, line: 241, baseType: !163, size: 16, offset: 896)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !314, file: !309, line: 245, baseType: !163, size: 16, offset: 912)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !314, file: !309, line: 251, baseType: !163, size: 16, offset: 928)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !314, file: !309, line: 253, baseType: !343, size: 1152, offset: 960)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !344, size: 1152, elements: !377)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !345, line: 26, size: 1152, elements: !346)
!345 = !DIFile(filename: "/usr/include/bits/struct_stat.h", directory: "")
!346 = !{!347, !348, !349, !350, !351, !353, !355, !356, !357, !359, !361, !363, !371, !372, !373}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !344, file: !345, line: 28, baseType: !76, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !344, file: !345, line: 33, baseType: !72, size: 64, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !344, file: !345, line: 41, baseType: !338, size: 64, offset: 128)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !344, file: !345, line: 42, baseType: !85, size: 32, offset: 192)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !344, file: !345, line: 44, baseType: !352, size: 32, offset: 224)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !73, line: 146, baseType: !6)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !344, file: !345, line: 45, baseType: !354, size: 32, offset: 256)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !73, line: 147, baseType: !6)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !344, file: !345, line: 47, baseType: !42, size: 32, offset: 288)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !344, file: !345, line: 49, baseType: !76, size: 64, offset: 320)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !344, file: !345, line: 54, baseType: !358, size: 64, offset: 384)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !73, line: 152, baseType: !325)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !344, file: !345, line: 58, baseType: !360, size: 64, offset: 448)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !73, line: 175, baseType: !325)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !344, file: !345, line: 60, baseType: !362, size: 64, offset: 512)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !73, line: 180, baseType: !325)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !344, file: !345, line: 71, baseType: !364, size: 128, offset: 576)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !365, line: 10, size: 128, elements: !366)
!365 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!366 = !{!367, !369}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !364, file: !365, line: 12, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !73, line: 160, baseType: !325)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !364, file: !365, line: 16, baseType: !370, size: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !73, line: 197, baseType: !325)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !344, file: !345, line: 72, baseType: !364, size: 128, offset: 704)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !344, file: !345, line: 73, baseType: !364, size: 128, offset: 832)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !344, file: !345, line: 86, baseType: !374, size: 192, offset: 960)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !370, size: 192, elements: !375)
!375 = !{!376}
!376 = !DISubrange(count: 3)
!377 = !{!378}
!378 = !DISubrange(count: 1)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "fts_name", scope: !314, file: !309, line: 254, baseType: !380, offset: 2112)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, elements: !381)
!381 = !{!382}
!382 = !DISubrange(count: -1)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "fts_child", scope: !310, file: !309, line: 82, baseType: !313, size: 64, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "fts_array", scope: !310, file: !309, line: 83, baseType: !385, size: 64, offset: 128)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !310, file: !309, line: 84, baseType: !75, size: 64, offset: 192)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !310, file: !309, line: 85, baseType: !32, size: 64, offset: 256)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "fts_rfd", scope: !310, file: !309, line: 86, baseType: !42, size: 32, offset: 320)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cwd_fd", scope: !310, file: !309, line: 87, baseType: !42, size: 32, offset: 352)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !310, file: !309, line: 89, baseType: !49, size: 64, offset: 384)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "fts_nitems", scope: !310, file: !309, line: 90, baseType: !49, size: 64, offset: 448)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "fts_compar", scope: !310, file: !309, line: 91, baseType: !393, size: 64, offset: 512)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{!42, !396, !396}
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !314)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "fts_options", scope: !310, file: !309, line: 160, baseType: !42, size: 32, offset: 576)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "fts_leaf_optimization_works_ht", scope: !310, file: !309, line: 169, baseType: !401, size: 64, offset: 640)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !309, line: 169, flags: DIFlagFwdDecl)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !310, file: !309, line: 191, baseType: !404, size: 64, offset: 704)
!404 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !310, file: !309, line: 171, size: 64, elements: !405)
!405 = !{!406, !407}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !404, file: !309, line: 184, baseType: !401, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !404, file: !309, line: 190, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cycle_check_state", file: !410, line: 28, size: 256, elements: !411)
!410 = !DIFile(filename: "./lib/cycle-check.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!411 = !{!412, !417, !421}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "dev_ino", scope: !409, file: !410, line: 30, baseType: !413, size: 128)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !67, line: 7, size: 128, elements: !414)
!414 = !{!415, !416}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !413, file: !67, line: 9, baseType: !70, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !413, file: !67, line: 10, baseType: !75, size: 64, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "chdir_counter", scope: !409, file: !410, line: 31, baseType: !418, size: 64, offset: 128)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !419, line: 102, baseType: !420)
!419 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !73, line: 73, baseType: !35)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !409, file: !410, line: 32, baseType: !42, size: 32, offset: 192)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fd_ring", scope: !310, file: !309, line: 196, baseType: !423, size: 256, offset: 768)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "I_ring", file: !424, line: 39, baseType: !425)
!424 = !DIFile(filename: "./lib/i-ring.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "I_ring", file: !424, line: 31, size: 256, elements: !426)
!426 = !{!427, !431, !432, !433, !434}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "ir_data", scope: !425, file: !424, line: 33, baseType: !428, size: 128)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 128, elements: !429)
!429 = !{!430}
!430 = !DISubrange(count: 4)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "ir_default_val", scope: !425, file: !424, line: 34, baseType: !42, size: 32, offset: 128)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "ir_front", scope: !425, file: !424, line: 35, baseType: !6, size: 32, offset: 160)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "ir_back", scope: !425, file: !424, line: 36, baseType: !6, size: 32, offset: 192)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "ir_empty", scope: !425, file: !424, line: 37, baseType: !53, size: 8, offset: 224)
!435 = !{!436}
!436 = !DILocalVariable(name: "fts", arg: 1, scope: !304, file: !303, line: 50, type: !307)
!437 = !{!438}
!438 = !DIEnumerator(name: "HT_INITIAL_SIZE", value: 31, isUnsigned: true)
!439 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !291, line: 686, baseType: !6, size: 32, elements: !440)
!440 = !{!441}
!441 = !DIEnumerator(name: "DEV_TYPE_HT_INITIAL_SIZE", value: 13, isUnsigned: true)
!442 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !291, line: 640, baseType: !6, size: 32, elements: !443)
!443 = !{!444}
!444 = !DIEnumerator(name: "MIN_DIR_NLINK", value: 2, isUnsigned: true)
!445 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !322, line: 97, baseType: !6, size: 32, elements: !446)
!446 = !{!447, !448, !449, !450, !451, !452, !453, !454, !455}
!447 = !DIEnumerator(name: "DT_UNKNOWN", value: 0, isUnsigned: true)
!448 = !DIEnumerator(name: "DT_FIFO", value: 1, isUnsigned: true)
!449 = !DIEnumerator(name: "DT_CHR", value: 2, isUnsigned: true)
!450 = !DIEnumerator(name: "DT_DIR", value: 4, isUnsigned: true)
!451 = !DIEnumerator(name: "DT_BLK", value: 6, isUnsigned: true)
!452 = !DIEnumerator(name: "DT_REG", value: 8, isUnsigned: true)
!453 = !DIEnumerator(name: "DT_LNK", value: 10, isUnsigned: true)
!454 = !DIEnumerator(name: "DT_SOCK", value: 12, isUnsigned: true)
!455 = !DIEnumerator(name: "DT_WHT", value: 14, isUnsigned: true)
!456 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !291, line: 151, baseType: !6, size: 32, elements: !457)
!457 = !{!458}
!458 = !DIEnumerator(name: "_FTS_INODE_SORT_DIR_ENTRIES_THRESHOLD", value: 10000, isUnsigned: true)
!459 = !{!34, !337, !418, !32, !325, !460, !465}
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DISubroutineType(types: !462)
!462 = !{!42, !463, !463}
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !468)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTSENT", file: !309, line: 255, baseType: !314)
!469 = distinct !DICompileUnit(language: DW_LANG_C99, file: !470, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !116, retainedTypes: !257, nameTableKind: None)
!470 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!471 = distinct !DICompileUnit(language: DW_LANG_C99, file: !472, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !116, nameTableKind: None)
!472 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!473 = distinct !DICompileUnit(language: DW_LANG_C99, file: !474, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !116, nameTableKind: None)
!474 = !DIFile(filename: "lib/cycle-check.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!475 = distinct !DICompileUnit(language: DW_LANG_C99, file: !476, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !116, nameTableKind: None)
!476 = !DIFile(filename: "lib/open-safer.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!477 = distinct !DICompileUnit(language: DW_LANG_C99, file: !478, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !116, nameTableKind: None)
!478 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!479 = distinct !DICompileUnit(language: DW_LANG_C99, file: !480, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !481, nameTableKind: None)
!480 = !DIFile(filename: "lib/i-ring.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!481 = !{!482}
!482 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !424, line: 20, baseType: !6, size: 32, elements: !483)
!483 = !{!484}
!484 = !DIEnumerator(name: "I_RING_SIZE", value: 4, isUnsigned: true)
!485 = distinct !DICompileUnit(language: DW_LANG_C99, file: !486, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !487, retainedTypes: !266, nameTableKind: None)
!486 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!487 = !{!488}
!488 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !489, line: 41, baseType: !6, size: 32, elements: !490)
!489 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!490 = !{!491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873}
!491 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!492 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!493 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!494 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!495 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!496 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!497 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!498 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!499 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!500 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!501 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!502 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!503 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!504 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!505 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!506 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!507 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!508 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!509 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!510 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!511 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!512 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!513 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!514 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!515 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!516 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!517 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!518 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!519 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!520 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!521 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!522 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!523 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!524 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!525 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!526 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!527 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!528 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!529 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!530 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!531 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!532 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!533 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!534 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!535 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!536 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!537 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!538 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!539 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!540 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!541 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!542 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!543 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!544 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!545 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!546 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!547 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!548 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!549 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!550 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!551 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!552 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!553 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!554 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!555 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!556 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!557 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!558 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!559 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!560 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!561 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!562 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!563 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!564 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!565 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!566 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!567 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!568 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!569 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!570 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!571 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!572 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!573 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!574 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!575 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!576 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!577 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!578 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!579 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!580 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!581 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!582 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!583 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!584 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!585 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!586 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!587 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!588 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!589 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!590 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!591 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!592 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!593 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!594 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!595 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!596 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!597 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!598 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!599 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!600 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!601 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!602 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!603 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!604 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!605 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!606 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!607 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!608 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!609 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!610 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!611 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!612 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!613 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!614 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!615 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!616 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!617 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!618 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!619 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!620 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!621 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!622 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!623 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!624 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!625 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!626 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!627 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!628 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!629 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!630 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!631 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!632 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!633 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!634 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!635 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!636 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!637 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!661 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!662 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!663 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!664 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!665 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!666 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!667 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!668 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!669 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!670 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!671 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!672 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!673 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!674 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!675 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!676 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!677 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!678 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!679 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!680 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!681 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!682 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!683 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!684 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!685 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!686 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!687 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!688 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!689 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!690 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!691 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!692 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!693 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!694 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!695 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!696 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!697 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!698 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!699 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!700 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!701 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!702 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!703 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!704 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!705 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!706 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!707 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!708 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!709 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!710 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!711 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!712 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!713 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!714 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!715 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!716 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!717 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!719 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!720 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!721 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!722 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!723 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!724 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!725 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!726 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!727 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!728 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!729 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!730 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!731 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!732 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!733 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!734 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!735 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!736 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!737 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!738 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!739 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!740 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!741 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!742 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!743 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!744 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!745 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!746 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!747 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!748 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!749 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!750 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!751 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!752 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!753 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!754 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!755 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!756 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!757 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!758 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!759 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!760 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!761 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!762 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!763 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!764 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!765 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!766 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!767 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!768 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!769 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!770 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!771 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!772 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!773 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!774 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!775 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!776 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!777 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!778 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!779 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!780 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!781 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!782 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!783 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!784 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!785 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!786 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!787 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!788 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!789 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!790 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!791 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!793 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!794 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!795 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!796 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!797 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!798 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!799 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!800 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!801 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!802 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!803 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!804 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!805 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!806 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!807 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!808 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!809 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!810 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!812 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!813 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!814 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!815 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!816 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!817 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!818 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!819 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!820 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!821 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!822 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!823 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!824 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!825 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!826 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!827 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!828 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!829 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!830 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!831 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!832 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!833 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!834 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!835 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!836 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!837 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!838 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!839 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!840 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!841 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!842 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!843 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!844 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!845 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!846 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!847 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!874 = distinct !DICompileUnit(language: DW_LANG_C99, file: !875, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !116, nameTableKind: None)
!875 = !DIFile(filename: "lib/openat-safer.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!876 = distinct !DICompileUnit(language: DW_LANG_C99, file: !877, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !116, nameTableKind: None)
!877 = !DIFile(filename: "lib/opendirat.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!878 = distinct !DICompileUnit(language: DW_LANG_C99, file: !879, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !116, retainedTypes: !266, nameTableKind: None)
!879 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!880 = distinct !DICompileUnit(language: DW_LANG_C99, file: !881, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !116, nameTableKind: None)
!881 = !DIFile(filename: "lib/fd-safer.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!882 = distinct !DICompileUnit(language: DW_LANG_C99, file: !883, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !116, nameTableKind: None)
!883 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!884 = distinct !DICompileUnit(language: DW_LANG_C99, file: !885, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !116, retainedTypes: !266, nameTableKind: None)
!885 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!886 = distinct !DICompileUnit(language: DW_LANG_C99, file: !887, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !116, retainedTypes: !266, nameTableKind: None)
!887 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!888 = distinct !DICompileUnit(language: DW_LANG_C99, file: !889, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !116, nameTableKind: None)
!889 = !DIFile(filename: "lib/dup-safer.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!890 = !{!"clang version 12.0.1"}
!891 = !{i32 7, !"Dwarf Version", i32 4}
!892 = !{i32 2, !"Debug Info Version", i32 3}
!893 = !{i32 1, !"wchar_size", i32 4}
!894 = !{i32 7, !"PIC Level", i32 2}
!895 = !{i32 7, !"PIE Level", i32 2}
!896 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 368, type: !897, scopeLine: 369, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !899)
!897 = !DISubroutineType(types: !898)
!898 = !{null, !42}
!899 = !{!900}
!900 = !DILocalVariable(name: "status", arg: 1, scope: !896, file: !3, line: 368, type: !42)
!901 = !DILocation(scope: !896)
!902 = !DILocation(line: 370, column: 14, scope: !903)
!903 = distinct !DILexicalBlock(scope: !896, file: !3, line: 370, column: 7)
!904 = !DILocation(line: 370, column: 7, scope: !896)
!905 = !DILocation(line: 371, column: 5, scope: !906)
!906 = distinct !DILexicalBlock(scope: !903, file: !3, line: 371, column: 5)
!907 = !{!908, !908, i64 0}
!908 = !{!"any pointer", !909, i64 0}
!909 = !{!"omnipotent char", !910, i64 0}
!910 = !{!"Simple C/C++ TBAA"}
!911 = !DILocation(line: 374, column: 7, scope: !912)
!912 = distinct !DILexicalBlock(scope: !903, file: !3, line: 373, column: 5)
!913 = !DILocation(line: 380, column: 7, scope: !912)
!914 = !DILocation(line: 385, column: 7, scope: !912)
!915 = !DILocation(line: 390, column: 7, scope: !912)
!916 = !DILocation(line: 394, column: 7, scope: !912)
!917 = !DILocation(line: 397, column: 7, scope: !912)
!918 = !DILocation(line: 400, column: 7, scope: !912)
!919 = !DILocation(line: 401, column: 7, scope: !912)
!920 = !DILocation(line: 402, column: 7, scope: !912)
!921 = !DILocalVariable(name: "program", arg: 1, scope: !922, file: !923, line: 634, type: !56)
!922 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !923, file: !923, line: 634, type: !924, scopeLine: 635, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !926)
!923 = !DIFile(filename: "src/system.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!924 = !DISubroutineType(types: !925)
!925 = !{null, !56}
!926 = !{!921, !927, !936, !937, !939}
!927 = !DILocalVariable(name: "infomap", scope: !922, file: !923, line: 636, type: !928)
!928 = !DICompositeType(tag: DW_TAG_array_type, baseType: !929, size: 896, elements: !934)
!929 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !930)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !922, file: !923, line: 636, size: 128, elements: !931)
!931 = !{!932, !933}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !930, file: !923, line: 636, baseType: !56, size: 64)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !930, file: !923, line: 636, baseType: !56, size: 64, offset: 64)
!934 = !{!935}
!935 = !DISubrange(count: 7)
!936 = !DILocalVariable(name: "node", scope: !922, file: !923, line: 646, type: !56)
!937 = !DILocalVariable(name: "map_prog", scope: !922, file: !923, line: 647, type: !938)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!939 = !DILocalVariable(name: "lc_messages", scope: !922, file: !923, line: 659, type: !56)
!940 = !DILocation(scope: !922, inlinedAt: !941)
!941 = distinct !DILocation(line: 406, column: 7, scope: !912)
!942 = !DILocation(line: 636, column: 3, scope: !922, inlinedAt: !941)
!943 = !DILocation(line: 636, column: 67, scope: !922, inlinedAt: !941)
!944 = !DILocation(line: 647, column: 36, scope: !922, inlinedAt: !941)
!945 = !DILocation(line: 649, column: 3, scope: !922, inlinedAt: !941)
!946 = !DILocation(line: 649, column: 33, scope: !922, inlinedAt: !941)
!947 = !DILocation(line: 650, column: 13, scope: !922, inlinedAt: !941)
!948 = !DILocation(line: 649, column: 20, scope: !922, inlinedAt: !941)
!949 = !{!950, !908, i64 0}
!950 = !{!"infomap", !908, i64 0, !908, i64 8}
!951 = !DILocation(line: 649, column: 10, scope: !922, inlinedAt: !941)
!952 = !DILocation(line: 649, column: 28, scope: !922, inlinedAt: !941)
!953 = distinct !{!953, !945, !947, !954}
!954 = !{!"llvm.loop.mustprogress"}
!955 = !DILocation(line: 652, column: 17, scope: !956, inlinedAt: !941)
!956 = distinct !DILexicalBlock(scope: !922, file: !923, line: 652, column: 7)
!957 = !{!950, !908, i64 8}
!958 = !DILocation(line: 652, column: 7, scope: !956, inlinedAt: !941)
!959 = !DILocation(line: 652, column: 7, scope: !922, inlinedAt: !941)
!960 = !DILocation(line: 655, column: 3, scope: !922, inlinedAt: !941)
!961 = !DILocation(line: 659, column: 29, scope: !922, inlinedAt: !941)
!962 = !DILocation(line: 660, column: 7, scope: !963, inlinedAt: !941)
!963 = distinct !DILexicalBlock(scope: !922, file: !923, line: 660, column: 7)
!964 = !DILocation(line: 660, column: 19, scope: !963, inlinedAt: !941)
!965 = !DILocation(line: 660, column: 22, scope: !963, inlinedAt: !941)
!966 = !DILocation(line: 660, column: 7, scope: !922, inlinedAt: !941)
!967 = !DILocation(line: 666, column: 7, scope: !968, inlinedAt: !941)
!968 = distinct !DILexicalBlock(scope: !963, file: !923, line: 661, column: 5)
!969 = !DILocation(line: 668, column: 5, scope: !968, inlinedAt: !941)
!970 = !DILocation(line: 669, column: 3, scope: !922, inlinedAt: !941)
!971 = !DILocation(line: 671, column: 3, scope: !922, inlinedAt: !941)
!972 = !DILocation(line: 673, column: 1, scope: !922, inlinedAt: !941)
!973 = !DILocation(line: 408, column: 3, scope: !896)
!974 = !DISubprogram(name: "dcgettext", scope: !975, file: !975, line: 51, type: !976, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !116)
!975 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!976 = !DISubroutineType(types: !977)
!977 = !{!32, !56, !56, !42}
!978 = !DISubprogram(name: "fputs_unlocked", scope: !979, file: !979, line: 667, type: !980, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !116)
!979 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!980 = !DISubroutineType(types: !981)
!981 = !{!42, !56, !982}
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !984, line: 49, size: 1728, elements: !985)
!984 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!985 = !{!986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !1001, !1002, !1003, !1004, !1005, !1006, !1008, !1010, !1013, !1015, !1018, !1021, !1022, !1023, !1024, !1025}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !983, file: !984, line: 51, baseType: !42, size: 32)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !983, file: !984, line: 54, baseType: !32, size: 64, offset: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !983, file: !984, line: 55, baseType: !32, size: 64, offset: 128)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !983, file: !984, line: 56, baseType: !32, size: 64, offset: 192)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !983, file: !984, line: 57, baseType: !32, size: 64, offset: 256)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !983, file: !984, line: 58, baseType: !32, size: 64, offset: 320)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !983, file: !984, line: 59, baseType: !32, size: 64, offset: 384)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !983, file: !984, line: 60, baseType: !32, size: 64, offset: 448)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !983, file: !984, line: 61, baseType: !32, size: 64, offset: 512)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !983, file: !984, line: 64, baseType: !32, size: 64, offset: 576)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !983, file: !984, line: 65, baseType: !32, size: 64, offset: 640)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !983, file: !984, line: 66, baseType: !32, size: 64, offset: 704)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !983, file: !984, line: 68, baseType: !999, size: 64, offset: 768)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !984, line: 36, flags: DIFlagFwdDecl)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !983, file: !984, line: 70, baseType: !982, size: 64, offset: 832)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !983, file: !984, line: 72, baseType: !42, size: 32, offset: 896)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !983, file: !984, line: 73, baseType: !42, size: 32, offset: 928)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !983, file: !984, line: 74, baseType: !358, size: 64, offset: 960)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !983, file: !984, line: 77, baseType: !163, size: 16, offset: 1024)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !983, file: !984, line: 78, baseType: !1007, size: 8, offset: 1040)
!1007 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !983, file: !984, line: 79, baseType: !1009, size: 8, offset: 1048)
!1009 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 8, elements: !377)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !983, file: !984, line: 81, baseType: !1011, size: 64, offset: 1088)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !984, line: 43, baseType: null)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !983, file: !984, line: 89, baseType: !1014, size: 64, offset: 1152)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !73, line: 153, baseType: !325)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !983, file: !984, line: 91, baseType: !1016, size: 64, offset: 1216)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !984, line: 37, flags: DIFlagFwdDecl)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !983, file: !984, line: 92, baseType: !1019, size: 64, offset: 1280)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !984, line: 38, flags: DIFlagFwdDecl)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !983, file: !984, line: 93, baseType: !982, size: 64, offset: 1344)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !983, file: !984, line: 94, baseType: !34, size: 64, offset: 1408)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !983, file: !984, line: 95, baseType: !49, size: 64, offset: 1472)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !983, file: !984, line: 96, baseType: !42, size: 32, offset: 1536)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !983, file: !984, line: 98, baseType: !1026, size: 160, offset: 1568)
!1026 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 160, elements: !1027)
!1027 = !{!1028}
!1028 = !DISubrange(count: 20)
!1029 = !DISubprogram(name: "setlocale", scope: !1030, file: !1030, line: 122, type: !1031, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !116)
!1030 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!32, !42, !56}
!1033 = !DILocation(scope: !39)
!1034 = !DILocation(line: 419, column: 3, scope: !39)
!1035 = !DILocation(line: 419, column: 10, scope: !39)
!1036 = !{!1037, !1037, i64 0}
!1037 = !{!"long", !909, i64 0}
!1038 = !DILocation(line: 426, column: 21, scope: !39)
!1039 = !DILocation(line: 426, column: 3, scope: !39)
!1040 = !DILocation(line: 427, column: 3, scope: !39)
!1041 = !DILocation(line: 428, column: 3, scope: !39)
!1042 = !DILocation(line: 429, column: 3, scope: !39)
!1043 = !DILocation(line: 431, column: 3, scope: !39)
!1044 = !DILocation(line: 433, column: 47, scope: !39)
!1045 = !DILocation(line: 433, column: 26, scope: !39)
!1046 = !DILocation(line: 433, column: 11, scope: !39)
!1047 = !DILocation(line: 435, column: 3, scope: !39)
!1048 = !DILocation(line: 422, column: 15, scope: !39)
!1049 = !DILocation(line: 421, column: 8, scope: !39)
!1050 = !DILocation(line: 418, column: 10, scope: !39)
!1051 = !DILocation(line: 417, column: 9, scope: !39)
!1052 = !DILocation(line: 435, column: 15, scope: !39)
!1053 = distinct !{!1053, !1047, !1054, !954}
!1054 = !DILocation(line: 510, column: 5, scope: !39)
!1055 = !DILocation(line: 468, column: 36, scope: !60)
!1056 = !{!1057, !1057, i64 0}
!1057 = !{!"int", !909, i64 0}
!1058 = !DILocation(line: 468, column: 43, scope: !60)
!1059 = !DILocation(line: 468, column: 31, scope: !60)
!1060 = !DILocation(scope: !60)
!1061 = !DILocation(line: 469, column: 30, scope: !60)
!1062 = !DILocation(line: 470, column: 49, scope: !60)
!1063 = !DILocation(line: 470, column: 48, scope: !60)
!1064 = !DILocation(line: 470, column: 46, scope: !60)
!1065 = !DILocation(line: 471, column: 50, scope: !60)
!1066 = !DILocation(line: 472, column: 17, scope: !1067)
!1067 = distinct !DILexicalBlock(scope: !60, file: !3, line: 472, column: 17)
!1068 = !DILocation(line: 472, column: 28, scope: !1067)
!1069 = !DILocation(line: 472, column: 17, scope: !60)
!1070 = !DILocation(line: 474, column: 43, scope: !1071)
!1071 = distinct !DILexicalBlock(scope: !1067, file: !3, line: 473, column: 15)
!1072 = !DILocation(line: 474, column: 28, scope: !1071)
!1073 = !DILocation(line: 475, column: 24, scope: !1071)
!1074 = !DILocation(line: 476, column: 15, scope: !1071)
!1075 = !DILocation(line: 477, column: 13, scope: !60)
!1076 = !DILocation(line: 477, column: 28, scope: !60)
!1077 = !{!909, !909, i64 0}
!1078 = !DILocation(line: 478, column: 26, scope: !60)
!1079 = !DILocation(line: 478, column: 57, scope: !60)
!1080 = !DILocalVariable(name: "__dest", arg: 1, scope: !1081, file: !1082, line: 26, type: !1085)
!1081 = distinct !DISubprogram(name: "memcpy", scope: !1082, file: !1082, line: 26, type: !1083, scopeLine: 28, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1087)
!1082 = !DIFile(filename: "/usr/include/bits/string_fortified.h", directory: "")
!1083 = !DISubroutineType(types: !1084)
!1084 = !{!34, !1085, !1086, !49}
!1085 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !34)
!1086 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !463)
!1087 = !{!1080, !1088, !1089}
!1088 = !DILocalVariable(name: "__src", arg: 2, scope: !1081, file: !1082, line: 26, type: !1086)
!1089 = !DILocalVariable(name: "__len", arg: 3, scope: !1081, file: !1082, line: 26, type: !49)
!1090 = !DILocation(scope: !1081, inlinedAt: !1091)
!1091 = distinct !DILocation(line: 478, column: 13, scope: !60)
!1092 = !DILocation(line: 29, column: 10, scope: !1081, inlinedAt: !1091)
!1093 = !DILocation(line: 481, column: 32, scope: !60)
!1094 = !DILocation(line: 483, column: 11, scope: !61)
!1095 = !DILocation(line: 489, column: 11, scope: !61)
!1096 = !DILocation(line: 491, column: 28, scope: !61)
!1097 = !DILocation(line: 492, column: 11, scope: !61)
!1098 = !DILocation(line: 494, column: 19, scope: !61)
!1099 = !DILocation(line: 495, column: 11, scope: !61)
!1100 = !DILocation(line: 497, column: 21, scope: !61)
!1101 = !DILocation(line: 498, column: 11, scope: !61)
!1102 = !DILocation(line: 500, column: 24, scope: !61)
!1103 = !DILocation(line: 501, column: 11, scope: !61)
!1104 = !DILocation(line: 503, column: 21, scope: !61)
