source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.Active_dir = type { i64, i64, %struct._ftsent* }
%struct.Chown_option = type { i32, i8, %struct.dev_ino*, i8, i8, i8*, i8* }
%struct.FTS = type { %struct._ftsent*, %struct._ftsent*, %struct._ftsent**, i64, i8*, i32, i32, i64, i64, i32 (%struct._ftsent**, %struct._ftsent**)*, i32, %struct.hash_table*, %union.anon, %struct.I_ring }
%struct.I_ring = type { [4 x i32], i32, i32, i32, i8 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__dirstream = type opaque
%struct.__fsid_t = type { [2 x i32] }
%struct.__mbstate_t = type { i32, %union.anon.11 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct._ftsent = type { %struct._ftsent*, %struct._ftsent*, %struct._ftsent*, %struct.__dirstream*, i64, i8*, i8*, i8*, i32, i32, i64, %struct.FTS*, i64, i64, i64, i16, i16, i16, [1 x %struct.stat], [0 x i8] }
%struct.cycle_check_state = type { %struct.dev_ino, i64, i32 }
%struct.dev_ino = type { i64, i64 }
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%struct.group = type { i8*, i8*, i32, i8** }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 55, type: !125, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !26, globals: !30)
!3 = !DIFile(filename: "src/chown.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!4 = !{!5, !12}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Verbosity", file: !6, line: 31, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "src/chown-core.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "V_high", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "V_changes_only", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "V_off", value: 2, isUnsigned: true)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !13, line: 32, baseType: !7, size: 32, elements: !14)
!13 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!14 = !{!15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25}
!15 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!16 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!17 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!18 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!19 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!21 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!22 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!23 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!24 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!25 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!26 = !{!27, !29}
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!30 = !{!31, !123, !0}
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "dev_ino_buf", scope: !33, file: !3, line: 316, type: !62, isLocal: true, isDefinition: true)
!33 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 157, type: !34, isDefinition: true, scopeLine: 158, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !38)
!34 = !DISubroutineType(types: !35)
!35 = !{!36, !36, !37}
!36 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!38 = !{!39, !40, !41, !43, !48, !51, !52, !53, !54, !55, !76, !77, !78, !84, !121}
!39 = !DILocalVariable(name: "argc", arg: 1, scope: !33, file: !3, line: 157, type: !36)
!40 = !DILocalVariable(name: "argv", arg: 2, scope: !33, file: !3, line: 157, type: !37)
!41 = !DILocalVariable(name: "preserve_root", scope: !33, file: !3, line: 159, type: !42)
!42 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!43 = !DILocalVariable(name: "uid", scope: !33, file: !3, line: 161, type: !44)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !45, line: 79, baseType: !46)
!45 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !47, line: 144, baseType: !7)
!47 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!48 = !DILocalVariable(name: "gid", scope: !33, file: !3, line: 162, type: !49)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !45, line: 64, baseType: !50)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !47, line: 145, baseType: !7)
!51 = !DILocalVariable(name: "required_uid", scope: !33, file: !3, line: 166, type: !44)
!52 = !DILocalVariable(name: "required_gid", scope: !33, file: !3, line: 167, type: !49)
!53 = !DILocalVariable(name: "bit_flags", scope: !33, file: !3, line: 170, type: !36)
!54 = !DILocalVariable(name: "dereference", scope: !33, file: !3, line: 174, type: !36)
!55 = !DILocalVariable(name: "chopt", scope: !33, file: !3, line: 176, type: !56)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Chown_option", file: !6, line: 43, size: 320, elements: !57)
!57 = !{!58, !59, !60, !72, !73, !74, !75}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "verbosity", scope: !56, file: !6, line: 46, baseType: !5, size: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "recurse", scope: !56, file: !6, line: 49, baseType: !42, size: 8, offset: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "root_dev_ino", scope: !56, file: !6, line: 53, baseType: !61, size: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !63, line: 7, size: 128, elements: !64)
!63 = !DIFile(filename: "./lib/dev-ino.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!64 = !{!65, !69}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !62, file: !63, line: 9, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !45, line: 47, baseType: !67)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !47, line: 146, baseType: !68)
!68 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !62, file: !63, line: 10, baseType: !70, size: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !45, line: 59, baseType: !71)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !47, line: 143, baseType: !68)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "affect_symlink_referent", scope: !56, file: !6, line: 56, baseType: !42, size: 8, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "force_silent", scope: !56, file: !6, line: 59, baseType: !42, size: 8, offset: 136)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "user_name", scope: !56, file: !6, line: 62, baseType: !27, size: 64, offset: 192)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "group_name", scope: !56, file: !6, line: 65, baseType: !27, size: 64, offset: 256)
!76 = !DILocalVariable(name: "ok", scope: !33, file: !3, line: 177, type: !42)
!77 = !DILocalVariable(name: "optc", scope: !33, file: !3, line: 178, type: !36)
!78 = !DILocalVariable(name: "e", scope: !79, file: !3, line: 230, type: !82)
!79 = distinct !DILexicalBlock(scope: !80, file: !3, line: 229, column: 11)
!80 = distinct !DILexicalBlock(scope: !81, file: !3, line: 194, column: 9)
!81 = distinct !DILexicalBlock(scope: !33, file: !3, line: 192, column: 5)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!84 = !DILocalVariable(name: "ref_stats", scope: !85, file: !3, line: 288, type: !87)
!85 = distinct !DILexicalBlock(scope: !86, file: !3, line: 287, column: 5)
!86 = distinct !DILexicalBlock(scope: !33, file: !3, line: 286, column: 7)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !88, line: 46, size: 1152, elements: !89)
!88 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!89 = !{!90, !91, !92, !94, !96, !97, !98, !99, !100, !103, !105, !107, !115, !116, !117}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !87, file: !88, line: 48, baseType: !71, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !87, file: !88, line: 53, baseType: !67, size: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !87, file: !88, line: 61, baseType: !93, size: 64, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !47, line: 149, baseType: !68)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !87, file: !88, line: 62, baseType: !95, size: 32, offset: 192)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !47, line: 148, baseType: !7)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !87, file: !88, line: 64, baseType: !46, size: 32, offset: 224)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !87, file: !88, line: 65, baseType: !50, size: 32, offset: 256)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !87, file: !88, line: 67, baseType: !36, size: 32, offset: 288)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !87, file: !88, line: 69, baseType: !71, size: 64, offset: 320)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !87, file: !88, line: 74, baseType: !101, size: 64, offset: 384)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !47, line: 150, baseType: !102)
!102 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !87, file: !88, line: 78, baseType: !104, size: 64, offset: 448)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !47, line: 172, baseType: !102)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !87, file: !88, line: 80, baseType: !106, size: 64, offset: 512)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !47, line: 177, baseType: !102)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !87, file: !88, line: 91, baseType: !108, size: 128, offset: 576)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !109, line: 9, size: 128, elements: !110)
!109 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!110 = !{!111, !113}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !108, file: !109, line: 11, baseType: !112, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !47, line: 158, baseType: !102)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !108, file: !109, line: 12, baseType: !114, size: 64, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !47, line: 194, baseType: !102)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !87, file: !88, line: 92, baseType: !108, size: 128, offset: 704)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !87, file: !88, line: 93, baseType: !108, size: 128, offset: 832)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !87, file: !88, line: 106, baseType: !118, size: 192, offset: 960)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 192, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 3)
!121 = !DILocalVariable(name: "e", scope: !122, file: !3, line: 300, type: !82)
!122 = distinct !DILexicalBlock(scope: !86, file: !3, line: 299, column: 5)
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(name: "reference_file", scope: !2, file: !3, line: 42, type: !27, isLocal: true, isDefinition: true)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 3584, elements: !135)
!126 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !127)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !128, line: 50, size: 256, elements: !129)
!128 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!129 = !{!130, !131, !132, !134}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !127, file: !128, line: 52, baseType: !82, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !127, file: !128, line: 55, baseType: !36, size: 32, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !127, file: !128, line: 56, baseType: !133, size: 64, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !127, file: !128, line: 57, baseType: !36, size: 32, offset: 192)
!135 = !{!136}
!136 = !DISubrange(count: 14)
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(name: "Version", scope: !139, file: !140, line: 2, type: !82, isDefinition: true)
!139 = distinct !DICompileUnit(language: DW_LANG_C99, file: !140, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !141, globals: !142)
!140 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!141 = !{}
!142 = !{!137}
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(name: "file_name", scope: !145, file: !150, line: 46, type: !82, isLocal: true, isDefinition: true)
!145 = distinct !DICompileUnit(language: DW_LANG_C99, file: !146, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !141, globals: !147)
!146 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!147 = !{!143, !148}
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !145, file: !150, line: 56, type: !42, isLocal: true, isDefinition: true)
!150 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!151 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression())
!152 = distinct !DIGlobalVariable(name: "exit_failure", scope: !153, file: !156, line: 24, type: !157, isDefinition: true)
!153 = distinct !DICompileUnit(language: DW_LANG_C99, file: !154, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !141, globals: !155)
!154 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!155 = !{!151}
!156 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!157 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !36)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "program_name", scope: !160, file: !164, line: 33, type: !82, isDefinition: true)
!160 = distinct !DICompileUnit(language: DW_LANG_C99, file: !161, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !141, retainedTypes: !162, globals: !163)
!161 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!162 = !{!29, !27}
!163 = !{!158}
!164 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !167, file: !197, line: 85, type: !232, isDefinition: true)
!167 = distinct !DICompileUnit(language: DW_LANG_C99, file: !168, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !169, retainedTypes: !190, globals: !194)
!168 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!169 = !{!12, !170, !175}
!170 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !13, line: 242, baseType: !7, size: 32, elements: !171)
!171 = !{!172, !173, !174}
!172 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!173 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!174 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!175 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !176, line: 46, baseType: !7, size: 32, elements: !177)
!176 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!177 = !{!178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189}
!178 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!179 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!180 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!181 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!182 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!183 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!184 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!185 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!186 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!187 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!188 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!189 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!190 = !{!36, !191, !192, !27}
!191 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !193, line: 62, baseType: !68)
!193 = !DIFile(filename: "/usr/lib/clang/7.0.0/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!194 = !{!165, !195, !202, !214, !216, !221, !228, !230}
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !167, file: !197, line: 101, type: !198, isDefinition: true)
!197 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 320, elements: !200)
!199 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!200 = !{!201}
!201 = !DISubrange(count: 10)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !167, file: !197, line: 1052, type: !204, isDefinition: true)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !197, line: 65, size: 448, elements: !205)
!205 = !{!206, !207, !208, !212, !213}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !204, file: !197, line: 68, baseType: !12, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !204, file: !197, line: 71, baseType: !36, size: 32, offset: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !204, file: !197, line: 75, baseType: !209, size: 256, offset: 64)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !210)
!210 = !{!211}
!211 = !DISubrange(count: 8)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !204, file: !197, line: 78, baseType: !82, size: 64, offset: 320)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !204, file: !197, line: 81, baseType: !82, size: 64, offset: 384)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !167, file: !197, line: 116, type: !204, isLocal: true, isDefinition: true)
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "slot0", scope: !167, file: !197, line: 842, type: !218, isLocal: true, isDefinition: true)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 2048, elements: !219)
!219 = !{!220}
!220 = !DISubrange(count: 256)
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(name: "slotvec", scope: !167, file: !197, line: 845, type: !223, isLocal: true, isDefinition: true)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !197, line: 834, size: 128, elements: !225)
!225 = !{!226, !227}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !224, file: !197, line: 836, baseType: !192, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !224, file: !197, line: 837, baseType: !27, size: 64, offset: 64)
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(name: "nslots", scope: !167, file: !197, line: 843, type: !36, isLocal: true, isDefinition: true)
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(name: "slotvec0", scope: !167, file: !197, line: 844, type: !224, isLocal: true, isDefinition: true)
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, size: 704, elements: !234)
!233 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !82)
!234 = !{!235}
!235 = !DISubrange(count: 11)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !238, file: !241, line: 26, type: !242, isDefinition: true)
!238 = distinct !DICompileUnit(language: DW_LANG_C99, file: !239, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !141, globals: !240)
!239 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!240 = !{!236}
!241 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 376, elements: !243)
!243 = !{!244}
!244 = !DISubrange(count: 47)
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(name: "default_tuning", scope: !247, file: !251, line: 130, type: !252, isLocal: true, isDefinition: true)
!247 = distinct !DICompileUnit(language: DW_LANG_C99, file: !248, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !141, retainedTypes: !249, globals: !250)
!248 = !DIFile(filename: "./lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!249 = !{!68, !29, !192}
!250 = !{!245}
!251 = !DIFile(filename: "lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!252 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !254, line: 65, baseType: !255)
!254 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !254, line: 53, size: 160, elements: !256)
!256 = !{!257, !259, !260, !261, !262}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !255, file: !254, line: 58, baseType: !258, size: 32)
!258 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !255, file: !254, line: 59, baseType: !258, size: 32, offset: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !255, file: !254, line: 60, baseType: !258, size: 32, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !255, file: !254, line: 61, baseType: !258, size: 32, offset: 96)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !255, file: !254, line: 62, baseType: !42, size: 8, offset: 128)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !265, file: !266, line: 339, type: !36, isLocal: true, isDefinition: true)
!265 = distinct !DISubprogram(name: "rpl_fcntl", scope: !266, file: !266, line: 276, type: !267, isDefinition: true, scopeLine: 277, flags: DIFlagPrototyped, isOptimized: true, unit: !269, retainedNodes: !272)
!266 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!267 = !DISubroutineType(types: !268)
!268 = !{!36, !36, !36, null}
!269 = distinct !DICompileUnit(language: DW_LANG_C99, file: !270, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !141, globals: !271)
!270 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!271 = !{!263}
!272 = !{!273, !274, !275, !288, !289, !292, !295, !298}
!273 = !DILocalVariable(name: "fd", arg: 1, scope: !265, file: !266, line: 276, type: !36)
!274 = !DILocalVariable(name: "action", arg: 2, scope: !265, file: !266, line: 276, type: !36)
!275 = !DILocalVariable(name: "arg", scope: !265, file: !266, line: 278, type: !276)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !277, line: 30, baseType: !278)
!277 = !DIFile(filename: "/usr/lib/clang/7.0.0/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !270, line: 278, baseType: !279)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !280, size: 192, elements: !286)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !270, line: 278, size: 192, elements: !281)
!281 = !{!282, !283, !284, !285}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !280, file: !270, line: 278, baseType: !7, size: 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !280, file: !270, line: 278, baseType: !7, size: 32, offset: 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !280, file: !270, line: 278, baseType: !29, size: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !280, file: !270, line: 278, baseType: !29, size: 64, offset: 128)
!286 = !{!287}
!287 = !DISubrange(count: 1)
!288 = !DILocalVariable(name: "result", scope: !265, file: !266, line: 279, type: !36)
!289 = !DILocalVariable(name: "target", scope: !290, file: !266, line: 326, type: !36)
!290 = distinct !DILexicalBlock(scope: !291, file: !266, line: 325, column: 7)
!291 = distinct !DILexicalBlock(scope: !265, file: !266, line: 282, column: 5)
!292 = !DILocalVariable(name: "flags", scope: !293, file: !266, line: 363, type: !36)
!293 = distinct !DILexicalBlock(scope: !294, file: !266, line: 362, column: 11)
!294 = distinct !DILexicalBlock(scope: !290, file: !266, line: 361, column: 13)
!295 = !DILocalVariable(name: "saved_errno", scope: !296, file: !266, line: 366, type: !36)
!296 = distinct !DILexicalBlock(scope: !297, file: !266, line: 365, column: 15)
!297 = distinct !DILexicalBlock(scope: !293, file: !266, line: 364, column: 17)
!298 = !DILocalVariable(name: "p", scope: !299, file: !266, line: 408, type: !29)
!299 = distinct !DILexicalBlock(scope: !291, file: !266, line: 406, column: 7)
!300 = distinct !DICompileUnit(language: DW_LANG_C99, file: !301, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !302, retainedTypes: !316)
!301 = !DIFile(filename: "src/chown-core.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!302 = !{!5, !12, !303, !310}
!303 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RCH_status", file: !301, line: 38, baseType: !7, size: 32, elements: !304)
!304 = !{!305, !306, !307, !308, !309}
!305 = !DIEnumerator(name: "RC_ok", value: 2, isUnsigned: true)
!306 = !DIEnumerator(name: "RC_excluded", value: 3, isUnsigned: true)
!307 = !DIEnumerator(name: "RC_inode_changed", value: 4, isUnsigned: true)
!308 = !DIEnumerator(name: "RC_do_ordinary_chown", value: 5, isUnsigned: true)
!309 = !DIEnumerator(name: "RC_error", value: 6, isUnsigned: true)
!310 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Change_status", file: !6, line: 23, baseType: !7, size: 32, elements: !311)
!311 = !{!312, !313, !314, !315}
!312 = !DIEnumerator(name: "CH_NOT_APPLIED", value: 1, isUnsigned: true)
!313 = !DIEnumerator(name: "CH_SUCCEEDED", value: 2, isUnsigned: true)
!314 = !DIEnumerator(name: "CH_FAILED", value: 3, isUnsigned: true)
!315 = !DIEnumerator(name: "CH_NO_CHANGE_REQUESTED", value: 4, isUnsigned: true)
!316 = !{!44, !49, !29}
!317 = distinct !DICompileUnit(language: DW_LANG_C99, file: !318, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !141, retainedTypes: !319)
!318 = !DIFile(filename: "./lib/umaxtostr.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!319 = !{!320}
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !321, line: 102, baseType: !322)
!321 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !47, line: 72, baseType: !68)
!323 = distinct !DICompileUnit(language: DW_LANG_C99, file: !324, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !141)
!324 = !DIFile(filename: "./lib/root-dev-ino.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!325 = distinct !DICompileUnit(language: DW_LANG_C99, file: !326, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !327, retainedTypes: !336, globals: !337)
!326 = !DIFile(filename: "./lib/userspec.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!327 = !{!328}
!328 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !329, line: 26, baseType: !7, size: 32, elements: !330)
!329 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!330 = !{!331, !332, !333, !334, !335}
!331 = !DIEnumerator(name: "LONGINT_OK", value: 0, isUnsigned: true)
!332 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1, isUnsigned: true)
!333 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2, isUnsigned: true)
!334 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3, isUnsigned: true)
!335 = !DIEnumerator(name: "LONGINT_INVALID", value: 4, isUnsigned: true)
!336 = !{!29, !44, !49}
!337 = !{!338, !403, !405}
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "E_invalid_user", scope: !340, file: !341, line: 106, type: !82, isLocal: true, isDefinition: true)
!340 = distinct !DISubprogram(name: "parse_with_separator", scope: !341, file: !341, line: 102, type: !342, isLocal: true, isDefinition: true, scopeLine: 105, flags: DIFlagPrototyped, isOptimized: true, unit: !325, retainedNodes: !346)
!341 = !DIFile(filename: "lib/userspec.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!342 = !DISubroutineType(types: !343)
!343 = !{!82, !82, !82, !344, !345, !37, !37}
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!346 = !{!347, !348, !349, !350, !351, !352, !353, !354, !366, !375, !376, !377, !378, !379, !380, !383, !388, !391, !398}
!347 = !DILocalVariable(name: "spec", arg: 1, scope: !340, file: !341, line: 102, type: !82)
!348 = !DILocalVariable(name: "separator", arg: 2, scope: !340, file: !341, line: 102, type: !82)
!349 = !DILocalVariable(name: "uid", arg: 3, scope: !340, file: !341, line: 103, type: !344)
!350 = !DILocalVariable(name: "gid", arg: 4, scope: !340, file: !341, line: 103, type: !345)
!351 = !DILocalVariable(name: "username", arg: 5, scope: !340, file: !341, line: 104, type: !37)
!352 = !DILocalVariable(name: "groupname", arg: 6, scope: !340, file: !341, line: 104, type: !37)
!353 = !DILocalVariable(name: "error_msg", scope: !340, file: !341, line: 110, type: !82)
!354 = !DILocalVariable(name: "pwd", scope: !340, file: !341, line: 111, type: !355)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !357, line: 49, size: 384, elements: !358)
!357 = !DIFile(filename: "/usr/include/pwd.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!358 = !{!359, !360, !361, !362, !363, !364, !365}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !356, file: !357, line: 51, baseType: !27, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !356, file: !357, line: 52, baseType: !27, size: 64, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !356, file: !357, line: 54, baseType: !46, size: 32, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !356, file: !357, line: 55, baseType: !50, size: 32, offset: 160)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !356, file: !357, line: 56, baseType: !27, size: 64, offset: 192)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !356, file: !357, line: 57, baseType: !27, size: 64, offset: 256)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !356, file: !357, line: 58, baseType: !27, size: 64, offset: 320)
!366 = !DILocalVariable(name: "grp", scope: !340, file: !341, line: 112, type: !367)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "group", file: !369, line: 42, size: 256, elements: !370)
!369 = !DIFile(filename: "/usr/include/grp.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!370 = !{!371, !372, !373, !374}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "gr_name", scope: !368, file: !369, line: 44, baseType: !27, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "gr_passwd", scope: !368, file: !369, line: 45, baseType: !27, size: 64, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "gr_gid", scope: !368, file: !369, line: 46, baseType: !50, size: 32, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "gr_mem", scope: !368, file: !369, line: 47, baseType: !37, size: 64, offset: 192)
!375 = !DILocalVariable(name: "u", scope: !340, file: !341, line: 113, type: !27)
!376 = !DILocalVariable(name: "g", scope: !340, file: !341, line: 114, type: !82)
!377 = !DILocalVariable(name: "gname", scope: !340, file: !341, line: 115, type: !27)
!378 = !DILocalVariable(name: "unum", scope: !340, file: !341, line: 116, type: !44)
!379 = !DILocalVariable(name: "gnum", scope: !340, file: !341, line: 117, type: !49)
!380 = !DILocalVariable(name: "ulen", scope: !381, file: !341, line: 137, type: !192)
!381 = distinct !DILexicalBlock(scope: !382, file: !341, line: 136, column: 5)
!382 = distinct !DILexicalBlock(scope: !340, file: !341, line: 130, column: 7)
!383 = !DILocalVariable(name: "use_login_group", scope: !384, file: !341, line: 164, type: !42)
!384 = distinct !DILexicalBlock(scope: !385, file: !341, line: 163, column: 9)
!385 = distinct !DILexicalBlock(scope: !386, file: !341, line: 162, column: 11)
!386 = distinct !DILexicalBlock(scope: !387, file: !341, line: 159, column: 5)
!387 = distinct !DILexicalBlock(scope: !340, file: !341, line: 158, column: 7)
!388 = !DILocalVariable(name: "tmp", scope: !389, file: !341, line: 173, type: !68)
!389 = distinct !DILexicalBlock(scope: !390, file: !341, line: 172, column: 13)
!390 = distinct !DILexicalBlock(scope: !384, file: !341, line: 165, column: 15)
!391 = !DILocalVariable(name: "buf", scope: !392, file: !341, line: 188, type: !395)
!392 = distinct !DILexicalBlock(scope: !393, file: !341, line: 185, column: 13)
!393 = distinct !DILexicalBlock(scope: !394, file: !341, line: 184, column: 15)
!394 = distinct !DILexicalBlock(scope: !385, file: !341, line: 182, column: 9)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 168, elements: !396)
!396 = !{!397}
!397 = !DISubrange(count: 21)
!398 = !DILocalVariable(name: "tmp", scope: !399, file: !341, line: 205, type: !68)
!399 = distinct !DILexicalBlock(scope: !400, file: !341, line: 204, column: 9)
!400 = distinct !DILexicalBlock(scope: !401, file: !341, line: 203, column: 11)
!401 = distinct !DILexicalBlock(scope: !402, file: !341, line: 199, column: 5)
!402 = distinct !DILexicalBlock(scope: !340, file: !341, line: 198, column: 7)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(name: "E_invalid_group", scope: !340, file: !341, line: 107, type: !82, isLocal: true, isDefinition: true)
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(name: "E_bad_spec", scope: !340, file: !341, line: 108, type: !82, isLocal: true, isDefinition: true)
!407 = distinct !DICompileUnit(language: DW_LANG_C99, file: !408, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !409, retainedTypes: !414)
!408 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!409 = !{!410}
!410 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !411, line: 41, baseType: !7, size: 32, elements: !412)
!411 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!412 = !{!413}
!413 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2018, isUnsigned: true)
!414 = !{!29}
!415 = distinct !DICompileUnit(language: DW_LANG_C99, file: !416, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !417, retainedTypes: !431)
!416 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!417 = !{!418}
!418 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !420, file: !419, line: 186, baseType: !7, size: 32, elements: !429)
!419 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!420 = distinct !DISubprogram(name: "x2nrealloc", scope: !419, file: !419, line: 174, type: !421, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: true, unit: !415, retainedNodes: !424)
!421 = !DISubroutineType(types: !422)
!422 = !{!29, !29, !423, !192}
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!424 = !{!425, !426, !427, !428}
!425 = !DILocalVariable(name: "p", arg: 1, scope: !420, file: !419, line: 174, type: !29)
!426 = !DILocalVariable(name: "pn", arg: 2, scope: !420, file: !419, line: 174, type: !423)
!427 = !DILocalVariable(name: "s", arg: 3, scope: !420, file: !419, line: 174, type: !192)
!428 = !DILocalVariable(name: "n", scope: !420, file: !419, line: 176, type: !192)
!429 = !{!430}
!430 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!431 = !{!192, !27, !29}
!432 = distinct !DICompileUnit(language: DW_LANG_C99, file: !433, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !141)
!433 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!434 = distinct !DICompileUnit(language: DW_LANG_C99, file: !435, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !141, retainedTypes: !414)
!435 = !DIFile(filename: "./lib/xfts.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!436 = distinct !DICompileUnit(language: DW_LANG_C99, file: !437, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !438, retainedTypes: !439)
!437 = !DIFile(filename: "./lib/xstrtoul.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!438 = !{!328, !175}
!439 = !{!36, !191}
!440 = distinct !DICompileUnit(language: DW_LANG_C99, file: !441, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !141, retainedTypes: !414)
!441 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!442 = distinct !DICompileUnit(language: DW_LANG_C99, file: !443, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !444, retainedTypes: !593)
!443 = !DIFile(filename: "./lib/fts.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!444 = !{!445, !450, !455, !573, !576, !579, !590}
!445 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Fts_stat", file: !446, line: 155, baseType: !7, size: 32, elements: !447)
!446 = !DIFile(filename: "lib/fts.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!447 = !{!448, !449}
!448 = !DIEnumerator(name: "FTS_NO_STAT_REQUIRED", value: 1, isUnsigned: true)
!449 = !DIEnumerator(name: "FTS_STAT_REQUIRED", value: 2, isUnsigned: true)
!450 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "leaf_optimization", file: !446, line: 669, baseType: !7, size: 32, elements: !451)
!451 = !{!452, !453, !454}
!452 = !DIEnumerator(name: "NO_LEAF_OPTIMIZATION", value: 0, isUnsigned: true)
!453 = !DIEnumerator(name: "OK_LEAF_OPTIMIZATION", value: 1, isUnsigned: true)
!454 = !DIEnumerator(name: "NOSTAT_LEAF_OPTIMIZATION", value: 2, isUnsigned: true)
!455 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !457, file: !456, line: 54, baseType: !7, size: 32, elements: !571)
!456 = !DIFile(filename: "./lib/fts-cycle.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!457 = distinct !DISubprogram(name: "setup_dir", scope: !456, file: !456, line: 50, type: !458, isLocal: true, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: true, unit: !442, retainedNodes: !569)
!458 = !DISubroutineType(types: !459)
!459 = !{!42, !460}
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !462, line: 199, baseType: !463)
!462 = !DIFile(filename: "./lib/fts_.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !462, line: 80, size: 1024, elements: !464)
!464 = !{!465, !520, !521, !523, !524, !525, !526, !527, !528, !529, !536, !537, !540, !556}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !463, file: !462, line: 81, baseType: !466, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !462, line: 201, size: 2112, elements: !468)
!468 = !{!469, !470, !471, !472, !477, !478, !479, !480, !481, !482, !483, !484, !485, !487, !488, !490, !491, !492, !493, !516}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !467, file: !462, line: 202, baseType: !466, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !467, file: !462, line: 203, baseType: !466, size: 64, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !467, file: !462, line: 204, baseType: !466, size: 64, offset: 128)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !467, file: !462, line: 205, baseType: !473, size: 64, offset: 192)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !475, line: 127, baseType: !476)
!475 = !DIFile(filename: "/usr/include/dirent.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!476 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !475, line: 127, flags: DIFlagFwdDecl)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !467, file: !462, line: 208, baseType: !102, size: 64, offset: 256)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !467, file: !462, line: 209, baseType: !29, size: 64, offset: 320)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !467, file: !462, line: 210, baseType: !27, size: 64, offset: 384)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !467, file: !462, line: 211, baseType: !27, size: 64, offset: 448)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !467, file: !462, line: 212, baseType: !36, size: 32, offset: 512)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !467, file: !462, line: 213, baseType: !36, size: 32, offset: 544)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !467, file: !462, line: 214, baseType: !192, size: 64, offset: 576)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !467, file: !462, line: 216, baseType: !460, size: 64, offset: 640)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !467, file: !462, line: 220, baseType: !486, size: 64, offset: 704)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !193, line: 51, baseType: !102)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !467, file: !462, line: 222, baseType: !192, size: 64, offset: 768)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "fts_n_dirs_remaining", scope: !467, file: !462, line: 227, baseType: !489, size: 64, offset: 832)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !45, line: 74, baseType: !93)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !467, file: !462, line: 243, baseType: !191, size: 16, offset: 896)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !467, file: !462, line: 247, baseType: !191, size: 16, offset: 912)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !467, file: !462, line: 253, baseType: !191, size: 16, offset: 928)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !467, file: !462, line: 255, baseType: !494, size: 1152, offset: 960)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !495, size: 1152, elements: !286)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !88, line: 46, size: 1152, elements: !496)
!496 = !{!497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !513, !514, !515}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !495, file: !88, line: 48, baseType: !71, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !495, file: !88, line: 53, baseType: !67, size: 64, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !495, file: !88, line: 61, baseType: !93, size: 64, offset: 128)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !495, file: !88, line: 62, baseType: !95, size: 32, offset: 192)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !495, file: !88, line: 64, baseType: !46, size: 32, offset: 224)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !495, file: !88, line: 65, baseType: !50, size: 32, offset: 256)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !495, file: !88, line: 67, baseType: !36, size: 32, offset: 288)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !495, file: !88, line: 69, baseType: !71, size: 64, offset: 320)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !495, file: !88, line: 74, baseType: !101, size: 64, offset: 384)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !495, file: !88, line: 78, baseType: !104, size: 64, offset: 448)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !495, file: !88, line: 80, baseType: !106, size: 64, offset: 512)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !495, file: !88, line: 91, baseType: !509, size: 128, offset: 576)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !109, line: 9, size: 128, elements: !510)
!510 = !{!511, !512}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !509, file: !109, line: 11, baseType: !112, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !509, file: !109, line: 12, baseType: !114, size: 64, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !495, file: !88, line: 92, baseType: !509, size: 128, offset: 704)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !495, file: !88, line: 93, baseType: !509, size: 128, offset: 832)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !495, file: !88, line: 106, baseType: !118, size: 192, offset: 960)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "fts_name", scope: !467, file: !462, line: 256, baseType: !517, offset: 2112)
!517 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, elements: !518)
!518 = !{!519}
!519 = !DISubrange(count: -1)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "fts_child", scope: !463, file: !462, line: 82, baseType: !466, size: 64, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "fts_array", scope: !463, file: !462, line: 83, baseType: !522, size: 64, offset: 128)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !463, file: !462, line: 84, baseType: !70, size: 64, offset: 192)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !463, file: !462, line: 85, baseType: !27, size: 64, offset: 256)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "fts_rfd", scope: !463, file: !462, line: 86, baseType: !36, size: 32, offset: 320)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cwd_fd", scope: !463, file: !462, line: 87, baseType: !36, size: 32, offset: 352)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !463, file: !462, line: 89, baseType: !192, size: 64, offset: 384)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "fts_nitems", scope: !463, file: !462, line: 90, baseType: !192, size: 64, offset: 448)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "fts_compar", scope: !463, file: !462, line: 91, baseType: !530, size: 64, offset: 512)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DISubroutineType(types: !532)
!532 = !{!36, !533, !533}
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !467)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "fts_options", scope: !463, file: !462, line: 162, baseType: !36, size: 32, offset: 576)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "fts_leaf_optimization_works_ht", scope: !463, file: !462, line: 171, baseType: !538, size: 64, offset: 640)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !462, line: 171, flags: DIFlagFwdDecl)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !463, file: !462, line: 193, baseType: !541, size: 64, offset: 704)
!541 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !463, file: !462, line: 173, size: 64, elements: !542)
!542 = !{!543, !544}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !541, file: !462, line: 186, baseType: !538, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !541, file: !462, line: 192, baseType: !545, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cycle_check_state", file: !547, line: 28, size: 256, elements: !548)
!547 = !DIFile(filename: "./lib/cycle-check.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!548 = !{!549, !554, !555}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "dev_ino", scope: !546, file: !547, line: 30, baseType: !550, size: 128)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !63, line: 7, size: 128, elements: !551)
!551 = !{!552, !553}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !550, file: !63, line: 9, baseType: !66, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !550, file: !63, line: 10, baseType: !70, size: 64, offset: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "chdir_counter", scope: !546, file: !547, line: 31, baseType: !320, size: 64, offset: 128)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !546, file: !547, line: 32, baseType: !36, size: 32, offset: 192)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fd_ring", scope: !463, file: !462, line: 198, baseType: !557, size: 256, offset: 768)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "I_ring", file: !558, line: 39, baseType: !559)
!558 = !DIFile(filename: "./lib/i-ring.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "I_ring", file: !558, line: 31, size: 256, elements: !560)
!560 = !{!561, !565, !566, !567, !568}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "ir_data", scope: !559, file: !558, line: 33, baseType: !562, size: 128)
!562 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 128, elements: !563)
!563 = !{!564}
!564 = !DISubrange(count: 4)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "ir_default_val", scope: !559, file: !558, line: 34, baseType: !36, size: 32, offset: 128)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "ir_front", scope: !559, file: !558, line: 35, baseType: !7, size: 32, offset: 160)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "ir_back", scope: !559, file: !558, line: 36, baseType: !7, size: 32, offset: 192)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "ir_empty", scope: !559, file: !558, line: 37, baseType: !42, size: 8, offset: 224)
!569 = !{!570}
!570 = !DILocalVariable(name: "fts", arg: 1, scope: !457, file: !456, line: 50, type: !460)
!571 = !{!572}
!572 = !DIEnumerator(name: "HT_INITIAL_SIZE", value: 31, isUnsigned: true)
!573 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !446, line: 712, baseType: !7, size: 32, elements: !574)
!574 = !{!575}
!575 = !DIEnumerator(name: "DEV_TYPE_HT_INITIAL_SIZE", value: 13, isUnsigned: true)
!576 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !446, line: 666, baseType: !7, size: 32, elements: !577)
!577 = !{!578}
!578 = !DIEnumerator(name: "MIN_DIR_NLINK", value: 2, isUnsigned: true)
!579 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !475, line: 97, baseType: !7, size: 32, elements: !580)
!580 = !{!581, !582, !583, !584, !585, !586, !587, !588, !589}
!581 = !DIEnumerator(name: "DT_UNKNOWN", value: 0, isUnsigned: true)
!582 = !DIEnumerator(name: "DT_FIFO", value: 1, isUnsigned: true)
!583 = !DIEnumerator(name: "DT_CHR", value: 2, isUnsigned: true)
!584 = !DIEnumerator(name: "DT_DIR", value: 4, isUnsigned: true)
!585 = !DIEnumerator(name: "DT_BLK", value: 6, isUnsigned: true)
!586 = !DIEnumerator(name: "DT_REG", value: 8, isUnsigned: true)
!587 = !DIEnumerator(name: "DT_LNK", value: 10, isUnsigned: true)
!588 = !DIEnumerator(name: "DT_SOCK", value: 12, isUnsigned: true)
!589 = !DIEnumerator(name: "DT_WHT", value: 14, isUnsigned: true)
!590 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !446, line: 150, baseType: !7, size: 32, elements: !591)
!591 = !{!592}
!592 = !DIEnumerator(name: "_FTS_INODE_SORT_DIR_ENTRIES_THRESHOLD", value: 10000, isUnsigned: true)
!593 = !{!29, !489, !320, !27, !102, !594, !599}
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DISubroutineType(types: !596)
!596 = !{!36, !597, !597}
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !602)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTSENT", file: !462, line: 257, baseType: !467)
!603 = distinct !DICompileUnit(language: DW_LANG_C99, file: !604, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !141, retainedTypes: !605)
!604 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!605 = !{!192}
!606 = distinct !DICompileUnit(language: DW_LANG_C99, file: !607, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !141)
!607 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!608 = distinct !DICompileUnit(language: DW_LANG_C99, file: !609, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !141)
!609 = !DIFile(filename: "./lib/cycle-check.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!610 = distinct !DICompileUnit(language: DW_LANG_C99, file: !611, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !141)
!611 = !DIFile(filename: "./lib/open-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!612 = distinct !DICompileUnit(language: DW_LANG_C99, file: !613, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !141)
!613 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!614 = distinct !DICompileUnit(language: DW_LANG_C99, file: !615, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !616)
!615 = !DIFile(filename: "./lib/i-ring.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!616 = !{!617}
!617 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !558, line: 20, baseType: !7, size: 32, elements: !618)
!618 = !{!619}
!619 = !DIEnumerator(name: "I_RING_SIZE", value: 4, isUnsigned: true)
!620 = distinct !DICompileUnit(language: DW_LANG_C99, file: !621, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !622, retainedTypes: !414)
!621 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!622 = !{!623}
!623 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !624, line: 41, baseType: !7, size: 32, elements: !625)
!624 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!625 = !{!626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008}
!626 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!627 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!628 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!629 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!630 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!631 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!632 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!633 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!634 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!635 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!636 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!637 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!638 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!639 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!640 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!641 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!642 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!643 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!644 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!645 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!646 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!647 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!648 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!649 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!650 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!651 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!652 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!653 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!654 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!655 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!656 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!657 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!658 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!659 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!660 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!661 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!662 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!663 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!664 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!665 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!666 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!667 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!668 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!669 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!670 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!671 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!672 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!673 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!674 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!675 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!676 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!677 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!678 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!679 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!680 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!681 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!682 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!683 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!684 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!685 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!686 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!687 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!688 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!689 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!690 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!691 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!692 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!693 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!694 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!695 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!696 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!697 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!698 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!699 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!700 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!701 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!702 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!703 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!704 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!705 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!706 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!707 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!708 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!709 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!710 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!711 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!712 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!713 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!714 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!715 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!716 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!717 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!719 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!720 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!721 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!722 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!723 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!724 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!725 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!726 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!727 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!728 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!729 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!730 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!731 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!732 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!733 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!734 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!735 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!736 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!737 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!738 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!739 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!740 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!741 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!742 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!743 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!744 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!745 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!746 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!747 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!748 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!749 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!750 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!751 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!752 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!753 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!754 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!755 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!756 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!757 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!758 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!759 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!760 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!761 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!762 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!763 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!764 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!765 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!766 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!767 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!768 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!769 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!770 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!771 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!772 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!773 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!774 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!779 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!780 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!781 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!782 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!783 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!784 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!785 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!786 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!787 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!788 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!789 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!790 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!791 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!793 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!794 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!795 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!796 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!797 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!798 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!799 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!800 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!801 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!802 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!803 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!804 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!805 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!806 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!807 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!808 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!809 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!810 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!812 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!813 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!814 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!815 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!816 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!817 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!818 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!819 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!820 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!821 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!822 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!823 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!824 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!825 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!826 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!827 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!828 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!829 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!830 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!831 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!832 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!833 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!834 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!835 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!836 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!837 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!838 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!839 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!840 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!841 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!842 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!843 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!844 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!845 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!846 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!847 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!884 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!885 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!886 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!887 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!894 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!895 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!896 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!897 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!898 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!899 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!900 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!901 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!902 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!903 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!904 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!905 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!906 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!907 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!908 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!909 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!910 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!911 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!912 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!913 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!914 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!915 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!916 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!917 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!918 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!919 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!920 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!921 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!922 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!923 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!924 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!925 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!926 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!927 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!928 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!929 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!930 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!931 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!932 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!933 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!934 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!935 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!936 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!937 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!938 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!939 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!940 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!941 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!942 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!943 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!944 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!945 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!946 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!947 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!948 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!949 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!950 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!951 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!952 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!953 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!954 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!955 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!956 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!957 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!958 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!959 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!960 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!961 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!962 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!963 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!964 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!965 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!966 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!967 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!968 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!969 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!970 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!971 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!972 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!973 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!974 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!975 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!976 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!977 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!978 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!979 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!980 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!981 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!982 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!983 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!984 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!985 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!986 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!987 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!988 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!989 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!990 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!991 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!992 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!993 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!994 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!995 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!996 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!997 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!998 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!999 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!1000 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!1001 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!1002 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!1003 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!1004 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!1005 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!1006 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!1007 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!1008 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!1009 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1010, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !141)
!1010 = !DIFile(filename: "./lib/openat-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!1011 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1012, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !141)
!1012 = !DIFile(filename: "./lib/fd-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!1013 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1014, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !141)
!1014 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!1015 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1016, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !141, retainedTypes: !414)
!1016 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!1017 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1018, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !141, retainedTypes: !414)
!1018 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!1019 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1020, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !141)
!1020 = !DIFile(filename: "./lib/dup-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!1021 = !{!"clang version 7.0.0 (tags/RELEASE_700/final)"}
!1022 = !{i32 2, !"Dwarf Version", i32 4}
!1023 = !{i32 2, !"Debug Info Version", i32 3}
!1024 = !{i32 1, !"wchar_size", i32 4}
!1025 = !{i32 7, !"PIC Level", i32 2}
!1026 = !{i32 7, !"PIE Level", i32 2}
!1027 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 74, type: !1028, isDefinition: true, scopeLine: 75, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, retainedNodes: !1030)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{null, !36}
!1030 = !{!1031}
!1031 = !DILocalVariable(name: "status", arg: 1, scope: !1027, file: !3, line: 74, type: !36)
!1032 = !DILocalVariable(name: "infomap", scope: !1033, file: !1034, line: 632, type: !1048)
!1033 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !1034, file: !1034, line: 630, type: !1035, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1037)
!1034 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!1035 = !DISubroutineType(types: !1036)
!1036 = !{null, !82}
!1037 = !{!1038, !1032, !1039, !1040, !1047}
!1038 = !DILocalVariable(name: "program", arg: 1, scope: !1033, file: !1034, line: 630, type: !82)
!1039 = !DILocalVariable(name: "node", scope: !1033, file: !1034, line: 642, type: !82)
!1040 = !DILocalVariable(name: "map_prog", scope: !1033, file: !1034, line: 643, type: !1041)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64)
!1042 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1043)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !1033, file: !1034, line: 632, size: 128, elements: !1044)
!1044 = !{!1045, !1046}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !1043, file: !1034, line: 632, baseType: !82, size: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !1043, file: !1034, line: 632, baseType: !82, size: 64, offset: 64)
!1047 = !DILocalVariable(name: "lc_messages", scope: !1033, file: !1034, line: 655, type: !82)
!1048 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1042, size: 896, elements: !1049)
!1049 = !{!1050}
!1050 = !DISubrange(count: 7)
!1051 = !DILocation(line: 632, column: 67, scope: !1033, inlinedAt: !1052)
!1052 = distinct !DILocation(line: 151, column: 7, scope: !1053)
!1053 = distinct !DILexicalBlock(scope: !1054, file: !3, line: 79, column: 5)
!1054 = distinct !DILexicalBlock(scope: !1027, file: !3, line: 76, column: 7)
!1055 = !DILocation(line: 74, column: 12, scope: !1027)
!1056 = !DILocation(line: 76, column: 14, scope: !1054)
!1057 = !DILocation(line: 76, column: 7, scope: !1027)
!1058 = !DILocation(line: 77, column: 5, scope: !1059)
