source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.Active_dir = type { i64, i64, %struct._ftsent* }
%struct.Chown_option = type { i32, i8, %struct.dev_ino*, i8, i8, i8*, i8* }
%struct.FTS = type { %struct._ftsent*, %struct._ftsent*, %struct._ftsent**, i64, i8*, i32, i32, i64, i64, i32 (%struct._ftsent**, %struct._ftsent**)*, i32, %struct.hash_table*, %union.anon, %struct.I_ring }
%struct.I_ring = type { [4 x i32], i32, i32, i32, i8 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__dirstream = type opaque
%struct.__fsid_t = type { [2 x i32] }
%struct.__mbstate_t = type { i32, %union.anon.11 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct._ftsent = type { %struct._ftsent*, %struct._ftsent*, %struct._ftsent*, %struct.__dirstream*, i64, i8*, i8*, i8*, i32, i32, i64, %struct.FTS*, i64, i64, i64, i16, i16, i16, [1 x %struct.stat], [0 x i8] }
%struct.cycle_check_state = type { %struct.dev_ino, i64, i32 }
%struct.dev_ino = type { i64, i64 }
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 55, type: !261, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !26, globals: !195, nameTableKind: None)
!3 = !DIFile(filename: "src/chown.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !12}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Verbosity", file: !6, line: 31, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "src/chown-core.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "V_high", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "V_changes_only", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "V_off", value: 2, isUnsigned: true)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !13, line: 32, baseType: !7, size: 32, elements: !14)
!13 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!14 = !{!15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25}
!15 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!16 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!17 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!18 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!19 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!21 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!22 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!23 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!24 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!25 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!26 = !{!27, !37, !98, !102, !106, !109, !112, !119, !144, !159, !165, !169, !31, !88, !173, !177, !180, !183, !184, !186, !190}
!27 = !DISubprogram(name: "dcgettext", scope: !28, file: !28, line: 51, type: !29, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!28 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!29 = !DISubroutineType(types: !30)
!30 = !{!31, !33, !33, !35}
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!35 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!36 = !{}
!37 = !DISubprogram(name: "fputs_unlocked", scope: !38, file: !38, line: 662, type: !39, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!38 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!39 = !DISubroutineType(types: !40)
!40 = !{!35, !33, !41}
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !43, line: 49, size: 1728, elements: !44)
!43 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!44 = !{!45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !60, !61, !62, !63, !67, !69, !71, !75, !78, !80, !83, !86, !87, !89, !93, !94}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !42, file: !43, line: 51, baseType: !35, size: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !42, file: !43, line: 54, baseType: !31, size: 64, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !42, file: !43, line: 55, baseType: !31, size: 64, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !42, file: !43, line: 56, baseType: !31, size: 64, offset: 192)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !42, file: !43, line: 57, baseType: !31, size: 64, offset: 256)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !42, file: !43, line: 58, baseType: !31, size: 64, offset: 320)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !42, file: !43, line: 59, baseType: !31, size: 64, offset: 384)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !42, file: !43, line: 60, baseType: !31, size: 64, offset: 448)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !42, file: !43, line: 61, baseType: !31, size: 64, offset: 512)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !42, file: !43, line: 64, baseType: !31, size: 64, offset: 576)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !42, file: !43, line: 65, baseType: !31, size: 64, offset: 640)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !42, file: !43, line: 66, baseType: !31, size: 64, offset: 704)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !42, file: !43, line: 68, baseType: !58, size: 64, offset: 768)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !43, line: 36, flags: DIFlagFwdDecl)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !42, file: !43, line: 70, baseType: !41, size: 64, offset: 832)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !42, file: !43, line: 72, baseType: !35, size: 32, offset: 896)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !42, file: !43, line: 73, baseType: !35, size: 32, offset: 928)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !42, file: !43, line: 74, baseType: !64, size: 64, offset: 960)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !65, line: 152, baseType: !66)
!65 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!66 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !42, file: !43, line: 77, baseType: !68, size: 16, offset: 1024)
!68 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !42, file: !43, line: 78, baseType: !70, size: 8, offset: 1040)
!70 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !42, file: !43, line: 79, baseType: !72, size: 8, offset: 1048)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 8, elements: !73)
!73 = !{!74}
!74 = !DISubrange(count: 1)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !42, file: !43, line: 81, baseType: !76, size: 64, offset: 1088)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !43, line: 43, baseType: null)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !42, file: !43, line: 89, baseType: !79, size: 64, offset: 1152)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !65, line: 153, baseType: !66)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !42, file: !43, line: 91, baseType: !81, size: 64, offset: 1216)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !43, line: 37, flags: DIFlagFwdDecl)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !42, file: !43, line: 92, baseType: !84, size: 64, offset: 1280)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !43, line: 38, flags: DIFlagFwdDecl)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !42, file: !43, line: 93, baseType: !41, size: 64, offset: 1344)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !42, file: !43, line: 94, baseType: !88, size: 64, offset: 1408)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !42, file: !43, line: 95, baseType: !90, size: 64, offset: 1472)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !91, line: 46, baseType: !92)
!91 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!92 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !42, file: !43, line: 96, baseType: !35, size: 32, offset: 1536)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !42, file: !43, line: 98, baseType: !95, size: 160, offset: 1568)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 160, elements: !96)
!96 = !{!97}
!97 = !DISubrange(count: 20)
!98 = !DISubprogram(name: "set_program_name", scope: !99, file: !99, line: 37, type: !100, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!99 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!100 = !DISubroutineType(types: !101)
!101 = !{null, !33}
!102 = !DISubprogram(name: "setlocale", scope: !103, file: !103, line: 122, type: !104, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!103 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!104 = !DISubroutineType(types: !105)
!105 = !{!31, !35, !33}
!106 = !DISubprogram(name: "bindtextdomain", scope: !28, file: !28, line: 86, type: !107, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!107 = !DISubroutineType(types: !108)
!108 = !{!31, !33, !33}
!109 = !DISubprogram(name: "textdomain", scope: !28, file: !28, line: 82, type: !110, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!110 = !DISubroutineType(types: !111)
!111 = !{!31, !33}
!112 = !DISubprogram(name: "atexit", scope: !113, file: !113, line: 595, type: !114, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!113 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!114 = !DISubroutineType(types: !115)
!115 = !{!35, !116}
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{null}
!119 = !DISubprogram(name: "chopt_init", scope: !6, file: !6, line: 69, type: !120, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!120 = !DISubroutineType(types: !121)
!121 = !{null, !122}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Chown_option", file: !6, line: 43, size: 320, elements: !124)
!124 = !{!125, !126, !128, !140, !141, !142, !143}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "verbosity", scope: !123, file: !6, line: 46, baseType: !5, size: 32)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "recurse", scope: !123, file: !6, line: 49, baseType: !127, size: 8, offset: 32)
!127 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "root_dev_ino", scope: !123, file: !6, line: 53, baseType: !129, size: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !131, line: 7, size: 128, elements: !132)
!131 = !DIFile(filename: "./lib/dev-ino.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!132 = !{!133, !137}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !130, file: !131, line: 9, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !135, line: 47, baseType: !136)
!135 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !65, line: 148, baseType: !92)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !130, file: !131, line: 10, baseType: !138, size: 64, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !135, line: 59, baseType: !139)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !65, line: 145, baseType: !92)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "affect_symlink_referent", scope: !123, file: !6, line: 56, baseType: !127, size: 8, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "force_silent", scope: !123, file: !6, line: 59, baseType: !127, size: 8, offset: 136)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "user_name", scope: !123, file: !6, line: 62, baseType: !31, size: 64, offset: 192)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "group_name", scope: !123, file: !6, line: 65, baseType: !31, size: 64, offset: 256)
!144 = !DISubprogram(name: "getopt_long", scope: !145, file: !145, line: 66, type: !146, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!145 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!146 = !DISubroutineType(types: !147)
!147 = !{!35, !35, !148, !33, !150, !157}
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !152)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !145, line: 50, size: 256, elements: !153)
!153 = !{!154, !155, !156, !158}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !152, file: !145, line: 52, baseType: !33, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !152, file: !145, line: 55, baseType: !35, size: 32, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !152, file: !145, line: 56, baseType: !157, size: 64, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !152, file: !145, line: 57, baseType: !35, size: 32, offset: 192)
!159 = !DISubprogram(name: "parse_user_spec", scope: !160, file: !160, line: 7, type: !161, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!160 = !DIFile(filename: "./lib/userspec.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!161 = !DISubroutineType(types: !162)
!162 = !{!33, !33, !163, !163, !164, !164}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!165 = !DISubprogram(name: "quote", scope: !166, file: !166, line: 44, type: !167, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!166 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!167 = !DISubroutineType(types: !168)
!168 = !{!33, !33}
!169 = !DISubprogram(name: "error", scope: !170, file: !170, line: 52, type: !171, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!170 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!171 = !DISubroutineType(types: !172)
!172 = !{null, !35, !35, !33, null}
!173 = !DISubprogram(name: "version_etc", scope: !174, file: !174, line: 69, type: !175, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!174 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!175 = !DISubroutineType(types: !176)
!176 = !{null, !41, !33, !33, !33, null}
!177 = !DISubprogram(name: "quotearg_style", scope: !13, file: !13, line: 377, type: !178, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!178 = !DISubroutineType(types: !179)
!179 = !{!31, !12, !33}
!180 = !DISubprogram(name: "uid_to_name", scope: !6, file: !6, line: 78, type: !181, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!181 = !DISubroutineType(types: !182)
!182 = !{!31, !7}
!183 = !DISubprogram(name: "gid_to_name", scope: !6, file: !6, line: 75, type: !181, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!184 = !DISubprogram(name: "xstrdup", scope: !185, file: !185, line: 64, type: !110, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!185 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!186 = !DISubprogram(name: "get_root_dev_ino", scope: !187, file: !187, line: 25, type: !188, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!187 = !DIFile(filename: "./lib/root-dev-ino.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!188 = !DISubroutineType(types: !189)
!189 = !{!129, !129}
!190 = !DISubprogram(name: "chown_files", scope: !6, file: !6, line: 81, type: !191, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!191 = !DISubroutineType(types: !192)
!192 = !{!127, !164, !35, !7, !7, !7, !7, !193}
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!195 = !{!196, !259, !0}
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "dev_ino_buf", scope: !198, file: !3, line: 316, type: !130, isLocal: true, isDefinition: true)
!198 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 157, type: !199, scopeLine: 158, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !201)
!199 = !DISubroutineType(types: !200)
!200 = !{!35, !35, !164}
!201 = !{!202, !203, !204, !205, !208, !211, !212, !213, !214, !215, !216, !217, !218, !222, !257}
!202 = !DILocalVariable(name: "argc", arg: 1, scope: !198, file: !3, line: 157, type: !35)
!203 = !DILocalVariable(name: "argv", arg: 2, scope: !198, file: !3, line: 157, type: !164)
!204 = !DILocalVariable(name: "preserve_root", scope: !198, file: !3, line: 159, type: !127)
!205 = !DILocalVariable(name: "uid", scope: !198, file: !3, line: 161, type: !206)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !135, line: 79, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !65, line: 146, baseType: !7)
!208 = !DILocalVariable(name: "gid", scope: !198, file: !3, line: 162, type: !209)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !135, line: 64, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !65, line: 147, baseType: !7)
!211 = !DILocalVariable(name: "required_uid", scope: !198, file: !3, line: 166, type: !206)
!212 = !DILocalVariable(name: "required_gid", scope: !198, file: !3, line: 167, type: !209)
!213 = !DILocalVariable(name: "bit_flags", scope: !198, file: !3, line: 170, type: !35)
!214 = !DILocalVariable(name: "dereference", scope: !198, file: !3, line: 174, type: !35)
!215 = !DILocalVariable(name: "chopt", scope: !198, file: !3, line: 176, type: !123)
!216 = !DILocalVariable(name: "ok", scope: !198, file: !3, line: 177, type: !127)
!217 = !DILocalVariable(name: "optc", scope: !198, file: !3, line: 178, type: !35)
!218 = !DILocalVariable(name: "e", scope: !219, file: !3, line: 230, type: !33)
!219 = distinct !DILexicalBlock(scope: !220, file: !3, line: 229, column: 11)
!220 = distinct !DILexicalBlock(scope: !221, file: !3, line: 194, column: 9)
!221 = distinct !DILexicalBlock(scope: !198, file: !3, line: 192, column: 5)
!222 = !DILocalVariable(name: "ref_stats", scope: !223, file: !3, line: 288, type: !225)
!223 = distinct !DILexicalBlock(scope: !224, file: !3, line: 287, column: 5)
!224 = distinct !DILexicalBlock(scope: !198, file: !3, line: 286, column: 7)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !226, line: 46, size: 1152, elements: !227)
!226 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "")
!227 = !{!228, !229, !230, !232, !234, !235, !236, !237, !238, !239, !241, !243, !251, !252, !253}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !225, file: !226, line: 48, baseType: !139, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !225, file: !226, line: 53, baseType: !136, size: 64, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !225, file: !226, line: 61, baseType: !231, size: 64, offset: 128)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !65, line: 151, baseType: !92)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !225, file: !226, line: 62, baseType: !233, size: 32, offset: 192)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !65, line: 150, baseType: !7)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !225, file: !226, line: 64, baseType: !207, size: 32, offset: 224)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !225, file: !226, line: 65, baseType: !210, size: 32, offset: 256)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !225, file: !226, line: 67, baseType: !35, size: 32, offset: 288)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !225, file: !226, line: 69, baseType: !139, size: 64, offset: 320)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !225, file: !226, line: 74, baseType: !64, size: 64, offset: 384)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !225, file: !226, line: 78, baseType: !240, size: 64, offset: 448)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !65, line: 174, baseType: !66)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !225, file: !226, line: 80, baseType: !242, size: 64, offset: 512)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !65, line: 179, baseType: !66)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !225, file: !226, line: 91, baseType: !244, size: 128, offset: 576)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !245, line: 10, size: 128, elements: !246)
!245 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!246 = !{!247, !249}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !244, file: !245, line: 12, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !65, line: 160, baseType: !66)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !244, file: !245, line: 16, baseType: !250, size: 64, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !65, line: 196, baseType: !66)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !225, file: !226, line: 92, baseType: !244, size: 128, offset: 704)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !225, file: !226, line: 93, baseType: !244, size: 128, offset: 832)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !225, file: !226, line: 106, baseType: !254, size: 192, offset: 960)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !250, size: 192, elements: !255)
!255 = !{!256}
!256 = !DISubrange(count: 3)
!257 = !DILocalVariable(name: "e", scope: !258, file: !3, line: 300, type: !33)
!258 = distinct !DILexicalBlock(scope: !224, file: !3, line: 299, column: 5)
!259 = !DIGlobalVariableExpression(var: !260, expr: !DIExpression())
!260 = distinct !DIGlobalVariable(name: "reference_file", scope: !2, file: !3, line: 42, type: !31, isLocal: true, isDefinition: true)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 3584, elements: !262)
!262 = !{!263}
!263 = !DISubrange(count: 14)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "Version", scope: !266, file: !267, line: 2, type: !33, isDefinition: true)
!266 = distinct !DICompileUnit(language: DW_LANG_C99, file: !267, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !36, globals: !268, nameTableKind: None)
!267 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!268 = !{!264}
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(name: "file_name", scope: !271, file: !272, line: 46, type: !33, isLocal: true, isDefinition: true)
!271 = distinct !DICompileUnit(language: DW_LANG_C99, file: !272, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !36, retainedTypes: !273, globals: !311, nameTableKind: None)
!272 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!273 = !{!274, !27, !310, !169}
!274 = !DISubprogram(name: "close_stream", scope: !275, file: !275, line: 2, type: !276, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!275 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!276 = !DISubroutineType(types: !277)
!277 = !{!35, !278}
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !43, line: 49, size: 1728, elements: !280)
!280 = !{!281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !279, file: !43, line: 51, baseType: !35, size: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !279, file: !43, line: 54, baseType: !31, size: 64, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !279, file: !43, line: 55, baseType: !31, size: 64, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !279, file: !43, line: 56, baseType: !31, size: 64, offset: 192)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !279, file: !43, line: 57, baseType: !31, size: 64, offset: 256)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !279, file: !43, line: 58, baseType: !31, size: 64, offset: 320)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !279, file: !43, line: 59, baseType: !31, size: 64, offset: 384)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !279, file: !43, line: 60, baseType: !31, size: 64, offset: 448)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !279, file: !43, line: 61, baseType: !31, size: 64, offset: 512)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !279, file: !43, line: 64, baseType: !31, size: 64, offset: 576)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !279, file: !43, line: 65, baseType: !31, size: 64, offset: 640)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !279, file: !43, line: 66, baseType: !31, size: 64, offset: 704)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !279, file: !43, line: 68, baseType: !58, size: 64, offset: 768)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !279, file: !43, line: 70, baseType: !278, size: 64, offset: 832)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !279, file: !43, line: 72, baseType: !35, size: 32, offset: 896)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !279, file: !43, line: 73, baseType: !35, size: 32, offset: 928)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !279, file: !43, line: 74, baseType: !64, size: 64, offset: 960)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !279, file: !43, line: 77, baseType: !68, size: 16, offset: 1024)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !279, file: !43, line: 78, baseType: !70, size: 8, offset: 1040)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !279, file: !43, line: 79, baseType: !72, size: 8, offset: 1048)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !279, file: !43, line: 81, baseType: !76, size: 64, offset: 1088)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !279, file: !43, line: 89, baseType: !79, size: 64, offset: 1152)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !279, file: !43, line: 91, baseType: !81, size: 64, offset: 1216)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !279, file: !43, line: 92, baseType: !84, size: 64, offset: 1280)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !279, file: !43, line: 93, baseType: !278, size: 64, offset: 1344)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !279, file: !43, line: 94, baseType: !88, size: 64, offset: 1408)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !279, file: !43, line: 95, baseType: !90, size: 64, offset: 1472)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !279, file: !43, line: 96, baseType: !35, size: 32, offset: 1536)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !279, file: !43, line: 98, baseType: !95, size: 160, offset: 1568)
!310 = !DISubprogram(name: "quotearg_colon", scope: !13, file: !13, line: 391, type: !110, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!311 = !{!269, !312}
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !271, file: !272, line: 56, type: !127, isLocal: true, isDefinition: true)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "exit_failure", scope: !316, file: !317, line: 24, type: !319, isDefinition: true)
!316 = distinct !DICompileUnit(language: DW_LANG_C99, file: !317, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !36, globals: !318, nameTableKind: None)
!317 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!318 = !{!314}
!319 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !35)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "program_name", scope: !322, file: !323, line: 33, type: !33, isDefinition: true)
!322 = distinct !DICompileUnit(language: DW_LANG_C99, file: !323, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !36, retainedTypes: !324, globals: !360, nameTableKind: None)
!323 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!324 = !{!88, !325, !31}
!325 = !DISubprogram(name: "fputs", scope: !38, file: !38, line: 626, type: !326, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!326 = !DISubroutineType(types: !327)
!327 = !{!35, !33, !328}
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !43, line: 49, size: 1728, elements: !330)
!330 = !{!331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !329, file: !43, line: 51, baseType: !35, size: 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !329, file: !43, line: 54, baseType: !31, size: 64, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !329, file: !43, line: 55, baseType: !31, size: 64, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !329, file: !43, line: 56, baseType: !31, size: 64, offset: 192)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !329, file: !43, line: 57, baseType: !31, size: 64, offset: 256)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !329, file: !43, line: 58, baseType: !31, size: 64, offset: 320)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !329, file: !43, line: 59, baseType: !31, size: 64, offset: 384)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !329, file: !43, line: 60, baseType: !31, size: 64, offset: 448)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !329, file: !43, line: 61, baseType: !31, size: 64, offset: 512)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !329, file: !43, line: 64, baseType: !31, size: 64, offset: 576)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !329, file: !43, line: 65, baseType: !31, size: 64, offset: 640)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !329, file: !43, line: 66, baseType: !31, size: 64, offset: 704)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !329, file: !43, line: 68, baseType: !58, size: 64, offset: 768)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !329, file: !43, line: 70, baseType: !328, size: 64, offset: 832)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !329, file: !43, line: 72, baseType: !35, size: 32, offset: 896)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !329, file: !43, line: 73, baseType: !35, size: 32, offset: 928)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !329, file: !43, line: 74, baseType: !64, size: 64, offset: 960)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !329, file: !43, line: 77, baseType: !68, size: 16, offset: 1024)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !329, file: !43, line: 78, baseType: !70, size: 8, offset: 1040)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !329, file: !43, line: 79, baseType: !72, size: 8, offset: 1048)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !329, file: !43, line: 81, baseType: !76, size: 64, offset: 1088)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !329, file: !43, line: 89, baseType: !79, size: 64, offset: 1152)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !329, file: !43, line: 91, baseType: !81, size: 64, offset: 1216)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !329, file: !43, line: 92, baseType: !84, size: 64, offset: 1280)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !329, file: !43, line: 93, baseType: !328, size: 64, offset: 1344)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !329, file: !43, line: 94, baseType: !88, size: 64, offset: 1408)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !329, file: !43, line: 95, baseType: !90, size: 64, offset: 1472)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !329, file: !43, line: 96, baseType: !35, size: 32, offset: 1536)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !329, file: !43, line: 98, baseType: !95, size: 160, offset: 1568)
!360 = !{!320}
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !363, file: !364, line: 85, type: !483, isDefinition: true)
!363 = distinct !DICompileUnit(language: DW_LANG_C99, file: !364, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !365, retainedTypes: !386, globals: !456, nameTableKind: None)
!364 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!365 = !{!12, !366, !371}
!366 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !13, line: 242, baseType: !7, size: 32, elements: !367)
!367 = !{!368, !369, !370}
!368 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!369 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!370 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!371 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !372, line: 46, baseType: !7, size: 32, elements: !373)
!372 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!373 = !{!374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385}
!374 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!375 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!376 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!377 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!378 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!379 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!380 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!381 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!382 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!383 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!384 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!385 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!386 = !{!387, !392, !408, !411, !35, !68, !414, !90, !431, !435, !27, !441, !445, !31, !449, !452, !453}
!387 = !DISubprogram(name: "xmemdup", scope: !185, file: !185, line: 62, type: !388, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!388 = !DISubroutineType(types: !389)
!389 = !{!88, !390, !92}
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!392 = !DISubprogram(name: "quotearg_alloc_mem", scope: !13, file: !13, line: 342, type: !393, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!393 = !DISubroutineType(types: !394)
!394 = !{!31, !33, !92, !395, !396}
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !398)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !364, line: 65, size: 448, elements: !399)
!399 = !{!400, !401, !402, !406, !407}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !398, file: !364, line: 68, baseType: !12, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !398, file: !364, line: 71, baseType: !35, size: 32, offset: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !398, file: !364, line: 75, baseType: !403, size: 256, offset: 64)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !404)
!404 = !{!405}
!405 = !DISubrange(count: 8)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !398, file: !364, line: 78, baseType: !33, size: 64, offset: 320)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !398, file: !364, line: 81, baseType: !33, size: 64, offset: 384)
!408 = !DISubprogram(name: "free", scope: !113, file: !113, line: 565, type: !409, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!409 = !DISubroutineType(types: !410)
!410 = !{null, !88}
!411 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !13, file: !13, line: 408, type: !412, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!412 = !DISubroutineType(types: !413)
!413 = !{!31, !35, !33, !33, !33, !92}
!414 = !DISubprogram(name: "rpl_mbrtowc", scope: !415, file: !415, line: 717, type: !416, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!415 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!416 = !DISubroutineType(types: !417)
!417 = !{!92, !157, !33, !92, !418}
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !420, line: 13, size: 64, elements: !421)
!420 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!421 = !{!422, !423}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !419, file: !420, line: 15, baseType: !35, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !419, file: !420, line: 20, baseType: !424, size: 32, offset: 32)
!424 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !419, file: !420, line: 16, size: 32, elements: !425)
!425 = !{!426, !427}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !424, file: !420, line: 18, baseType: !7, size: 32)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !424, file: !420, line: 19, baseType: !428, size: 32)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 32, elements: !429)
!429 = !{!430}
!430 = !DISubrange(count: 4)
!431 = !DISubprogram(name: "iswprint", scope: !432, file: !432, line: 120, type: !433, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!432 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!433 = !DISubroutineType(types: !434)
!434 = !{!35, !7}
!435 = !DISubprogram(name: "mbsinit", scope: !436, file: !436, line: 292, type: !437, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!436 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!437 = !DISubroutineType(types: !438)
!438 = !{!35, !439}
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !419)
!441 = !DISubprogram(name: "locale_charset", scope: !442, file: !442, line: 35, type: !443, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!442 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!443 = !DISubroutineType(types: !444)
!444 = !{!33}
!445 = !DISubprogram(name: "c_strcasecmp", scope: !446, file: !446, line: 42, type: !447, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!446 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!447 = !DISubroutineType(types: !448)
!448 = !{!35, !33, !33}
!449 = !DISubprogram(name: "xmalloc", scope: !185, file: !185, line: 53, type: !450, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!450 = !DISubroutineType(types: !451)
!451 = !{!88, !92}
!452 = !DISubprogram(name: "xalloc_die", scope: !185, file: !185, line: 51, type: !117, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !36)
!453 = !DISubprogram(name: "xrealloc", scope: !185, file: !185, line: 59, type: !454, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!454 = !DISubroutineType(types: !455)
!455 = !{!88, !88, !92}
!456 = !{!361, !457, !463, !465, !467, !472, !479, !481}
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !363, file: !364, line: 101, type: !459, isDefinition: true)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 320, elements: !461)
!460 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!461 = !{!462}
!462 = !DISubrange(count: 10)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !363, file: !364, line: 1052, type: !398, isDefinition: true)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !363, file: !364, line: 116, type: !398, isLocal: true, isDefinition: true)
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(name: "slot0", scope: !363, file: !364, line: 842, type: !469, isLocal: true, isDefinition: true)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 2048, elements: !470)
!470 = !{!471}
!471 = !DISubrange(count: 256)
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(name: "slotvec", scope: !363, file: !364, line: 845, type: !474, isLocal: true, isDefinition: true)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !364, line: 834, size: 128, elements: !476)
!476 = !{!477, !478}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !475, file: !364, line: 836, baseType: !90, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !475, file: !364, line: 837, baseType: !31, size: 64, offset: 64)
!479 = !DIGlobalVariableExpression(var: !480, expr: !DIExpression())
!480 = distinct !DIGlobalVariable(name: "nslots", scope: !363, file: !364, line: 843, type: !35, isLocal: true, isDefinition: true)
!481 = !DIGlobalVariableExpression(var: !482, expr: !DIExpression())
!482 = distinct !DIGlobalVariable(name: "slotvec0", scope: !363, file: !364, line: 844, type: !475, isLocal: true, isDefinition: true)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !484, size: 704, elements: !485)
!484 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!485 = !{!486}
!486 = !DISubrange(count: 11)
!487 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression())
!488 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !489, file: !490, line: 26, type: !492, isDefinition: true)
!489 = distinct !DICompileUnit(language: DW_LANG_C99, file: !490, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !36, globals: !491, nameTableKind: None)
!490 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!491 = !{!487}
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 376, elements: !493)
!493 = !{!494}
!494 = !DISubrange(count: 47)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(name: "default_tuning", scope: !497, file: !498, line: 130, type: !505, isLocal: true, isDefinition: true)
!497 = distinct !DICompileUnit(language: DW_LANG_C99, file: !498, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !36, retainedTypes: !499, globals: !504, nameTableKind: None)
!498 = !DIFile(filename: "lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!499 = !{!92, !88, !500, !408, !90}
!500 = !DISubprogram(name: "rpl_calloc", scope: !501, file: !501, line: 688, type: !502, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!501 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!502 = !DISubroutineType(types: !503)
!503 = !{!88, !92, !92}
!504 = !{!495}
!505 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !506)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !507, line: 65, baseType: !508)
!507 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !507, line: 53, size: 160, elements: !509)
!509 = !{!510, !512, !513, !514, !515}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !508, file: !507, line: 58, baseType: !511, size: 32)
!511 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !508, file: !507, line: 59, baseType: !511, size: 32, offset: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !508, file: !507, line: 60, baseType: !511, size: 32, offset: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !508, file: !507, line: 61, baseType: !511, size: 32, offset: 96)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !508, file: !507, line: 62, baseType: !127, size: 8, offset: 128)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !518, file: !519, line: 507, type: !35, isLocal: true, isDefinition: true)
!518 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !519, file: !519, line: 488, type: !520, scopeLine: 489, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !522, retainedNodes: !533)
!519 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!520 = !DISubroutineType(types: !521)
!521 = !{!35, !35, !35}
!522 = distinct !DICompileUnit(language: DW_LANG_C99, file: !519, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !36, retainedTypes: !523, globals: !532, nameTableKind: None)
!523 = !{!524, !528}
!524 = !DISubprogram(name: "fcntl", scope: !525, file: !525, line: 176, type: !526, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!525 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
!526 = !DISubroutineType(types: !527)
!527 = !{!35, !35, !35, null}
!528 = !DISubprogram(name: "close", scope: !529, file: !529, line: 353, type: !530, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!529 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!530 = !DISubroutineType(types: !531)
!531 = !{!35, !35}
!532 = !{!516}
!533 = !{!534, !535, !536, !537, !540}
!534 = !DILocalVariable(name: "fd", arg: 1, scope: !518, file: !519, line: 488, type: !35)
!535 = !DILocalVariable(name: "target", arg: 2, scope: !518, file: !519, line: 488, type: !35)
!536 = !DILocalVariable(name: "result", scope: !518, file: !519, line: 490, type: !35)
!537 = !DILocalVariable(name: "flags", scope: !538, file: !519, line: 531, type: !35)
!538 = distinct !DILexicalBlock(scope: !539, file: !519, line: 530, column: 5)
!539 = distinct !DILexicalBlock(scope: !518, file: !519, line: 529, column: 7)
!540 = !DILocalVariable(name: "saved_errno", scope: !541, file: !519, line: 534, type: !35)
!541 = distinct !DILexicalBlock(scope: !542, file: !519, line: 533, column: 9)
!542 = distinct !DILexicalBlock(scope: !538, file: !519, line: 532, column: 11)
!543 = distinct !DICompileUnit(language: DW_LANG_C99, file: !544, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !545, retainedTypes: !559, nameTableKind: None)
!544 = !DIFile(filename: "src/chown-core.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!545 = !{!5, !12, !546, !553}
!546 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RCH_status", file: !544, line: 38, baseType: !7, size: 32, elements: !547)
!547 = !{!548, !549, !550, !551, !552}
!548 = !DIEnumerator(name: "RC_ok", value: 2, isUnsigned: true)
!549 = !DIEnumerator(name: "RC_excluded", value: 3, isUnsigned: true)
!550 = !DIEnumerator(name: "RC_inode_changed", value: 4, isUnsigned: true)
!551 = !DIEnumerator(name: "RC_do_ordinary_chown", value: 5, isUnsigned: true)
!552 = !DIEnumerator(name: "RC_error", value: 6, isUnsigned: true)
!553 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Change_status", file: !6, line: 23, baseType: !7, size: 32, elements: !554)
!554 = !{!555, !556, !557, !558}
!555 = !DIEnumerator(name: "CH_NOT_APPLIED", value: 1, isUnsigned: true)
!556 = !DIEnumerator(name: "CH_SUCCEEDED", value: 2, isUnsigned: true)
!557 = !DIEnumerator(name: "CH_FAILED", value: 3, isUnsigned: true)
!558 = !DIEnumerator(name: "CH_NO_CHANGE_REQUESTED", value: 4, isUnsigned: true)
!559 = !{!408, !560, !571, !184, !575, !206, !209, !589, !692, !88, !27, !169, !695, !177, !698, !701, !704, !705, !710, !713, !716, !528, !449}
!560 = !DISubprogram(name: "getgrgid", scope: !561, file: !561, line: 101, type: !562, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!561 = !DIFile(filename: "/usr/include/grp.h", directory: "")
!562 = !DISubroutineType(types: !563)
!563 = !{!564, !7}
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "group", file: !561, line: 42, size: 256, elements: !566)
!566 = !{!567, !568, !569, !570}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "gr_name", scope: !565, file: !561, line: 44, baseType: !31, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "gr_passwd", scope: !565, file: !561, line: 45, baseType: !31, size: 64, offset: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "gr_gid", scope: !565, file: !561, line: 46, baseType: !210, size: 32, offset: 128)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "gr_mem", scope: !565, file: !561, line: 47, baseType: !164, size: 64, offset: 192)
!571 = !DISubprogram(name: "umaxtostr", scope: !572, file: !572, line: 46, type: !573, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!572 = !DIFile(filename: "./lib/inttostr.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!573 = !DISubroutineType(types: !574)
!574 = !{!31, !92, !31}
!575 = !DISubprogram(name: "getpwuid", scope: !576, file: !576, line: 110, type: !577, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!576 = !DIFile(filename: "/usr/include/pwd.h", directory: "")
!577 = !DISubroutineType(types: !578)
!578 = !{!579, !7}
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !576, line: 49, size: 384, elements: !581)
!581 = !{!582, !583, !584, !585, !586, !587, !588}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !580, file: !576, line: 51, baseType: !31, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !580, file: !576, line: 52, baseType: !31, size: 64, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !580, file: !576, line: 54, baseType: !207, size: 32, offset: 128)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !580, file: !576, line: 55, baseType: !210, size: 32, offset: 160)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !580, file: !576, line: 56, baseType: !31, size: 64, offset: 192)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !580, file: !576, line: 57, baseType: !31, size: 64, offset: 256)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !580, file: !576, line: 58, baseType: !31, size: 64, offset: 320)
!589 = !DISubprogram(name: "xfts_open", scope: !590, file: !590, line: 5, type: !591, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!590 = !DIFile(filename: "./lib/xfts.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!591 = !DISubroutineType(types: !592)
!592 = !{!593, !148, !35, !664}
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !595, line: 80, size: 1024, elements: !596)
!595 = !DIFile(filename: "./lib/fts_.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!596 = !{!597, !654, !655, !657, !658, !659, !660, !661, !662, !663, !670, !671, !674, !681}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !594, file: !595, line: 81, baseType: !598, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !595, line: 199, size: 2112, elements: !600)
!600 = !{!601, !602, !603, !604, !609, !610, !611, !612, !613, !614, !615, !616, !619, !621, !622, !624, !625, !626, !627, !650}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !599, file: !595, line: 200, baseType: !598, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !599, file: !595, line: 201, baseType: !598, size: 64, offset: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !599, file: !595, line: 202, baseType: !598, size: 64, offset: 128)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !599, file: !595, line: 203, baseType: !605, size: 64, offset: 192)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !607, line: 127, baseType: !608)
!607 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!608 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !607, line: 127, flags: DIFlagFwdDecl)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !599, file: !595, line: 206, baseType: !66, size: 64, offset: 256)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !599, file: !595, line: 207, baseType: !88, size: 64, offset: 320)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !599, file: !595, line: 208, baseType: !31, size: 64, offset: 384)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !599, file: !595, line: 209, baseType: !31, size: 64, offset: 448)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !599, file: !595, line: 210, baseType: !35, size: 32, offset: 512)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !599, file: !595, line: 211, baseType: !35, size: 32, offset: 544)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !599, file: !595, line: 212, baseType: !90, size: 64, offset: 576)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !599, file: !595, line: 214, baseType: !617, size: 64, offset: 640)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !595, line: 197, baseType: !594)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !599, file: !595, line: 218, baseType: !620, size: 64, offset: 704)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !91, line: 35, baseType: !66)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !599, file: !595, line: 220, baseType: !90, size: 64, offset: 768)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "fts_n_dirs_remaining", scope: !599, file: !595, line: 225, baseType: !623, size: 64, offset: 832)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !135, line: 74, baseType: !231)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !599, file: !595, line: 241, baseType: !68, size: 16, offset: 896)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !599, file: !595, line: 245, baseType: !68, size: 16, offset: 912)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !599, file: !595, line: 251, baseType: !68, size: 16, offset: 928)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !599, file: !595, line: 253, baseType: !628, size: 1152, offset: 960)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !629, size: 1152, elements: !73)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !226, line: 46, size: 1152, elements: !630)
!630 = !{!631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !647, !648, !649}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !629, file: !226, line: 48, baseType: !139, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !629, file: !226, line: 53, baseType: !136, size: 64, offset: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !629, file: !226, line: 61, baseType: !231, size: 64, offset: 128)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !629, file: !226, line: 62, baseType: !233, size: 32, offset: 192)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !629, file: !226, line: 64, baseType: !207, size: 32, offset: 224)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !629, file: !226, line: 65, baseType: !210, size: 32, offset: 256)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !629, file: !226, line: 67, baseType: !35, size: 32, offset: 288)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !629, file: !226, line: 69, baseType: !139, size: 64, offset: 320)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !629, file: !226, line: 74, baseType: !64, size: 64, offset: 384)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !629, file: !226, line: 78, baseType: !240, size: 64, offset: 448)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !629, file: !226, line: 80, baseType: !242, size: 64, offset: 512)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !629, file: !226, line: 91, baseType: !643, size: 128, offset: 576)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !245, line: 10, size: 128, elements: !644)
!644 = !{!645, !646}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !643, file: !245, line: 12, baseType: !248, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !643, file: !245, line: 16, baseType: !250, size: 64, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !629, file: !226, line: 92, baseType: !643, size: 128, offset: 704)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !629, file: !226, line: 93, baseType: !643, size: 128, offset: 832)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !629, file: !226, line: 106, baseType: !254, size: 192, offset: 960)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "fts_name", scope: !599, file: !595, line: 254, baseType: !651, offset: 2112)
!651 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, elements: !652)
!652 = !{!653}
!653 = !DISubrange(count: -1)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "fts_child", scope: !594, file: !595, line: 82, baseType: !598, size: 64, offset: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "fts_array", scope: !594, file: !595, line: 83, baseType: !656, size: 64, offset: 128)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !594, file: !595, line: 84, baseType: !138, size: 64, offset: 192)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !594, file: !595, line: 85, baseType: !31, size: 64, offset: 256)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "fts_rfd", scope: !594, file: !595, line: 86, baseType: !35, size: 32, offset: 320)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cwd_fd", scope: !594, file: !595, line: 87, baseType: !35, size: 32, offset: 352)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !594, file: !595, line: 89, baseType: !90, size: 64, offset: 384)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "fts_nitems", scope: !594, file: !595, line: 90, baseType: !90, size: 64, offset: 448)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "fts_compar", scope: !594, file: !595, line: 91, baseType: !664, size: 64, offset: 512)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DISubroutineType(types: !666)
!666 = !{!35, !667, !667}
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !599)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "fts_options", scope: !594, file: !595, line: 160, baseType: !35, size: 32, offset: 576)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "fts_leaf_optimization_works_ht", scope: !594, file: !595, line: 169, baseType: !672, size: 64, offset: 640)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !595, line: 169, flags: DIFlagFwdDecl)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !594, file: !595, line: 191, baseType: !675, size: 64, offset: 704)
!675 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !594, file: !595, line: 171, size: 64, elements: !676)
!676 = !{!677, !678}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !675, file: !595, line: 184, baseType: !672, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !675, file: !595, line: 190, baseType: !679, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DICompositeType(tag: DW_TAG_structure_type, name: "cycle_check_state", file: !595, line: 190, flags: DIFlagFwdDecl)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fd_ring", scope: !594, file: !595, line: 196, baseType: !682, size: 256, offset: 768)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "I_ring", file: !683, line: 39, baseType: !684)
!683 = !DIFile(filename: "./lib/i-ring.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "I_ring", file: !683, line: 31, size: 256, elements: !685)
!685 = !{!686, !688, !689, !690, !691}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "ir_data", scope: !684, file: !683, line: 33, baseType: !687, size: 128)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 128, elements: !429)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "ir_default_val", scope: !684, file: !683, line: 34, baseType: !35, size: 32, offset: 128)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "ir_front", scope: !684, file: !683, line: 35, baseType: !7, size: 32, offset: 160)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "ir_back", scope: !684, file: !683, line: 36, baseType: !7, size: 32, offset: 192)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "ir_empty", scope: !684, file: !683, line: 37, baseType: !127, size: 8, offset: 224)
!692 = !DISubprogram(name: "rpl_fts_read", scope: !595, file: !595, line: 280, type: !693, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!693 = !DISubroutineType(types: !694)
!694 = !{!598, !593}
!695 = !DISubprogram(name: "rpl_fts_close", scope: !595, file: !595, line: 276, type: !696, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!696 = !DISubroutineType(types: !697)
!697 = !{!35, !593}
!698 = !DISubprogram(name: "quotearg_n_style", scope: !13, file: !13, line: 368, type: !699, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!699 = !DISubroutineType(types: !700)
!700 = !{!31, !35, !12, !33}
!701 = !DISubprogram(name: "rpl_fts_set", scope: !595, file: !595, line: 281, type: !702, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!702 = !DISubroutineType(types: !703)
!703 = !{!35, !593, !598, !35}
!704 = !DISubprogram(name: "quotearg_n_style_colon", scope: !13, file: !13, line: 397, type: !699, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!705 = !DISubprogram(name: "cycle_warning_required", scope: !590, file: !590, line: 9, type: !706, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!706 = !DISubroutineType(types: !707)
!707 = !{!127, !708, !668}
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !594)
!710 = !DISubprogram(name: "fchownat", scope: !529, file: !529, line: 491, type: !711, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!711 = !DISubroutineType(types: !712)
!712 = !{!35, !35, !33, !7, !7, !35}
!713 = !DISubprogram(name: "openat", scope: !525, file: !525, line: 220, type: !714, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!714 = !DISubroutineType(types: !715)
!715 = !{!35, !35, !33, !35, null}
!716 = !DISubprogram(name: "fchown", scope: !529, file: !529, line: 478, type: !717, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!717 = !DISubroutineType(types: !718)
!718 = !{!35, !35, !7, !7}
!719 = distinct !DICompileUnit(language: DW_LANG_C99, file: !720, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !36, retainedTypes: !721, nameTableKind: None)
!720 = !DIFile(filename: "lib/umaxtostr.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!721 = !{!722}
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !723, line: 102, baseType: !724)
!723 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !65, line: 73, baseType: !92)
!725 = distinct !DICompileUnit(language: DW_LANG_C99, file: !726, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !36, nameTableKind: None)
!726 = !DIFile(filename: "lib/root-dev-ino.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!727 = distinct !DICompileUnit(language: DW_LANG_C99, file: !728, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !729, retainedTypes: !738, globals: !770, nameTableKind: None)
!728 = !DIFile(filename: "lib/userspec.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!729 = !{!730}
!730 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !731, line: 25, baseType: !7, size: 32, elements: !732)
!731 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!732 = !{!733, !734, !735, !736, !737}
!733 = !DIEnumerator(name: "LONGINT_OK", value: 0, isUnsigned: true)
!734 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1, isUnsigned: true)
!735 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2, isUnsigned: true)
!736 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3, isUnsigned: true)
!737 = !DIEnumerator(name: "LONGINT_INVALID", value: 4, isUnsigned: true)
!738 = !{!88, !184, !387, !739, !752, !206, !755, !571, !765, !766, !767, !209, !408, !27}
!739 = !DISubprogram(name: "getpwnam", scope: !576, file: !576, line: 116, type: !740, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!740 = !DISubroutineType(types: !741)
!741 = !{!742, !33}
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !576, line: 49, size: 384, elements: !744)
!744 = !{!745, !746, !747, !748, !749, !750, !751}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !743, file: !576, line: 51, baseType: !31, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !743, file: !576, line: 52, baseType: !31, size: 64, offset: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !743, file: !576, line: 54, baseType: !207, size: 32, offset: 128)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !743, file: !576, line: 55, baseType: !210, size: 32, offset: 160)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !743, file: !576, line: 56, baseType: !31, size: 64, offset: 192)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !743, file: !576, line: 57, baseType: !31, size: 64, offset: 256)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !743, file: !576, line: 58, baseType: !31, size: 64, offset: 320)
!752 = !DISubprogram(name: "xstrtoul", scope: !731, file: !731, line: 44, type: !753, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!753 = !DISubroutineType(types: !754)
!754 = !{!730, !33, !164, !35, !395, !33}
!755 = !DISubprogram(name: "getgrgid", scope: !561, file: !561, line: 101, type: !756, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!756 = !DISubroutineType(types: !757)
!757 = !{!758, !7}
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "group", file: !561, line: 42, size: 256, elements: !760)
!760 = !{!761, !762, !763, !764}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "gr_name", scope: !759, file: !561, line: 44, baseType: !31, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "gr_passwd", scope: !759, file: !561, line: 45, baseType: !31, size: 64, offset: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "gr_gid", scope: !759, file: !561, line: 46, baseType: !210, size: 32, offset: 128)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "gr_mem", scope: !759, file: !561, line: 47, baseType: !164, size: 64, offset: 192)
!765 = !DISubprogram(name: "endgrent", scope: !561, file: !561, line: 67, type: !117, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!766 = !DISubprogram(name: "endpwent", scope: !576, file: !576, line: 78, type: !117, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!767 = !DISubprogram(name: "getgrnam", scope: !561, file: !561, line: 107, type: !768, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!768 = !DISubroutineType(types: !769)
!769 = !{!758, !33}
!770 = !{!771, !816, !818}
!771 = !DIGlobalVariableExpression(var: !772, expr: !DIExpression())
!772 = distinct !DIGlobalVariable(name: "E_invalid_user", scope: !773, file: !728, line: 106, type: !33, isLocal: true, isDefinition: true)
!773 = distinct !DISubprogram(name: "parse_with_separator", scope: !728, file: !728, line: 102, type: !774, scopeLine: 105, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !727, retainedNodes: !778)
!774 = !DISubroutineType(types: !775)
!775 = !{!33, !33, !33, !776, !777, !164, !164}
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!778 = !{!779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !796, !801, !804, !811}
!779 = !DILocalVariable(name: "spec", arg: 1, scope: !773, file: !728, line: 102, type: !33)
!780 = !DILocalVariable(name: "separator", arg: 2, scope: !773, file: !728, line: 102, type: !33)
!781 = !DILocalVariable(name: "uid", arg: 3, scope: !773, file: !728, line: 103, type: !776)
!782 = !DILocalVariable(name: "gid", arg: 4, scope: !773, file: !728, line: 103, type: !777)
!783 = !DILocalVariable(name: "username", arg: 5, scope: !773, file: !728, line: 104, type: !164)
!784 = !DILocalVariable(name: "groupname", arg: 6, scope: !773, file: !728, line: 104, type: !164)
!785 = !DILocalVariable(name: "error_msg", scope: !773, file: !728, line: 110, type: !33)
!786 = !DILocalVariable(name: "pwd", scope: !773, file: !728, line: 111, type: !742)
!787 = !DILocalVariable(name: "grp", scope: !773, file: !728, line: 112, type: !758)
!788 = !DILocalVariable(name: "u", scope: !773, file: !728, line: 113, type: !31)
!789 = !DILocalVariable(name: "g", scope: !773, file: !728, line: 114, type: !33)
!790 = !DILocalVariable(name: "gname", scope: !773, file: !728, line: 115, type: !31)
!791 = !DILocalVariable(name: "unum", scope: !773, file: !728, line: 116, type: !206)
!792 = !DILocalVariable(name: "gnum", scope: !773, file: !728, line: 117, type: !209)
!793 = !DILocalVariable(name: "ulen", scope: !794, file: !728, line: 137, type: !90)
!794 = distinct !DILexicalBlock(scope: !795, file: !728, line: 136, column: 5)
!795 = distinct !DILexicalBlock(scope: !773, file: !728, line: 130, column: 7)
!796 = !DILocalVariable(name: "use_login_group", scope: !797, file: !728, line: 164, type: !127)
!797 = distinct !DILexicalBlock(scope: !798, file: !728, line: 163, column: 9)
!798 = distinct !DILexicalBlock(scope: !799, file: !728, line: 162, column: 11)
!799 = distinct !DILexicalBlock(scope: !800, file: !728, line: 159, column: 5)
!800 = distinct !DILexicalBlock(scope: !773, file: !728, line: 158, column: 7)
!801 = !DILocalVariable(name: "tmp", scope: !802, file: !728, line: 173, type: !92)
!802 = distinct !DILexicalBlock(scope: !803, file: !728, line: 172, column: 13)
!803 = distinct !DILexicalBlock(scope: !797, file: !728, line: 165, column: 15)
!804 = !DILocalVariable(name: "buf", scope: !805, file: !728, line: 188, type: !808)
!805 = distinct !DILexicalBlock(scope: !806, file: !728, line: 185, column: 13)
!806 = distinct !DILexicalBlock(scope: !807, file: !728, line: 184, column: 15)
!807 = distinct !DILexicalBlock(scope: !798, file: !728, line: 182, column: 9)
!808 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 168, elements: !809)
!809 = !{!810}
!810 = !DISubrange(count: 21)
!811 = !DILocalVariable(name: "tmp", scope: !812, file: !728, line: 205, type: !92)
!812 = distinct !DILexicalBlock(scope: !813, file: !728, line: 204, column: 9)
!813 = distinct !DILexicalBlock(scope: !814, file: !728, line: 203, column: 11)
!814 = distinct !DILexicalBlock(scope: !815, file: !728, line: 199, column: 5)
!815 = distinct !DILexicalBlock(scope: !773, file: !728, line: 198, column: 7)
!816 = !DIGlobalVariableExpression(var: !817, expr: !DIExpression())
!817 = distinct !DIGlobalVariable(name: "E_invalid_group", scope: !773, file: !728, line: 107, type: !33, isLocal: true, isDefinition: true)
!818 = !DIGlobalVariableExpression(var: !819, expr: !DIExpression())
!819 = distinct !DIGlobalVariable(name: "E_bad_spec", scope: !773, file: !728, line: 108, type: !33, isLocal: true, isDefinition: true)
!820 = distinct !DICompileUnit(language: DW_LANG_C99, file: !821, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !822, retainedTypes: !826, nameTableKind: None)
!821 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!822 = !{!823}
!823 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !821, line: 40, baseType: !7, size: 32, elements: !824)
!824 = !{!825}
!825 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!826 = !{!27, !827, !88}
!827 = !DISubprogram(name: "fputs_unlocked", scope: !38, file: !38, line: 662, type: !828, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!828 = !DISubroutineType(types: !829)
!829 = !{!35, !33, !830}
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !43, line: 49, size: 1728, elements: !832)
!832 = !{!833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !831, file: !43, line: 51, baseType: !35, size: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !831, file: !43, line: 54, baseType: !31, size: 64, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !831, file: !43, line: 55, baseType: !31, size: 64, offset: 128)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !831, file: !43, line: 56, baseType: !31, size: 64, offset: 192)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !831, file: !43, line: 57, baseType: !31, size: 64, offset: 256)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !831, file: !43, line: 58, baseType: !31, size: 64, offset: 320)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !831, file: !43, line: 59, baseType: !31, size: 64, offset: 384)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !831, file: !43, line: 60, baseType: !31, size: 64, offset: 448)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !831, file: !43, line: 61, baseType: !31, size: 64, offset: 512)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !831, file: !43, line: 64, baseType: !31, size: 64, offset: 576)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !831, file: !43, line: 65, baseType: !31, size: 64, offset: 640)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !831, file: !43, line: 66, baseType: !31, size: 64, offset: 704)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !831, file: !43, line: 68, baseType: !58, size: 64, offset: 768)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !831, file: !43, line: 70, baseType: !830, size: 64, offset: 832)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !831, file: !43, line: 72, baseType: !35, size: 32, offset: 896)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !831, file: !43, line: 73, baseType: !35, size: 32, offset: 928)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !831, file: !43, line: 74, baseType: !64, size: 64, offset: 960)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !831, file: !43, line: 77, baseType: !68, size: 16, offset: 1024)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !831, file: !43, line: 78, baseType: !70, size: 8, offset: 1040)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !831, file: !43, line: 79, baseType: !72, size: 8, offset: 1048)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !831, file: !43, line: 81, baseType: !76, size: 64, offset: 1088)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !831, file: !43, line: 89, baseType: !79, size: 64, offset: 1152)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !831, file: !43, line: 91, baseType: !81, size: 64, offset: 1216)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !831, file: !43, line: 92, baseType: !84, size: 64, offset: 1280)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !831, file: !43, line: 93, baseType: !830, size: 64, offset: 1344)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !831, file: !43, line: 94, baseType: !88, size: 64, offset: 1408)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !831, file: !43, line: 95, baseType: !90, size: 64, offset: 1472)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !831, file: !43, line: 96, baseType: !35, size: 32, offset: 1536)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !831, file: !43, line: 98, baseType: !95, size: 160, offset: 1568)
!862 = distinct !DICompileUnit(language: DW_LANG_C99, file: !863, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !864, retainedTypes: !877, nameTableKind: None)
!863 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!864 = !{!865}
!865 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !866, file: !185, line: 186, baseType: !7, size: 32, elements: !875)
!866 = distinct !DISubprogram(name: "x2nrealloc", scope: !185, file: !185, line: 174, type: !867, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !862, retainedNodes: !870)
!867 = !DISubroutineType(types: !868)
!868 = !{!88, !88, !869, !90}
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!870 = !{!871, !872, !873, !874}
!871 = !DILocalVariable(name: "p", arg: 1, scope: !866, file: !185, line: 174, type: !88)
!872 = !DILocalVariable(name: "pn", arg: 2, scope: !866, file: !185, line: 174, type: !869)
!873 = !DILocalVariable(name: "s", arg: 3, scope: !866, file: !185, line: 174, type: !90)
!874 = !DILocalVariable(name: "n", scope: !866, file: !185, line: 176, type: !90)
!875 = !{!876}
!876 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!877 = !{!90, !452, !449, !453, !31, !408, !88, !878, !500}
!878 = !DISubprogram(name: "xcalloc", scope: !185, file: !185, line: 57, type: !502, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!879 = distinct !DICompileUnit(language: DW_LANG_C99, file: !880, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !36, retainedTypes: !881, nameTableKind: None)
!880 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!881 = !{!27, !169}
!882 = distinct !DICompileUnit(language: DW_LANG_C99, file: !883, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !36, retainedTypes: !884, nameTableKind: None)
!883 = !DIFile(filename: "lib/xfts.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!884 = !{!885, !88, !452}
!885 = !DISubprogram(name: "rpl_fts_open", scope: !595, file: !595, line: 277, type: !886, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !36)
!886 = !DISubroutineType(types: !887)
!887 = !{!888, !148, !35, !949}
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !595, line: 80, size: 1024, elements: !890)
!890 = !{!891, !939, !940, !942, !943, !944, !945, !946, !947, !948, !955, !956, !957, !962}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !889, file: !595, line: 81, baseType: !892, size: 64)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !595, line: 199, size: 2112, elements: !894)
!894 = !{!895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !909, !910, !911, !912, !913, !914, !915, !938}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !893, file: !595, line: 200, baseType: !892, size: 64)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !893, file: !595, line: 201, baseType: !892, size: 64, offset: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !893, file: !595, line: 202, baseType: !892, size: 64, offset: 128)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !893, file: !595, line: 203, baseType: !605, size: 64, offset: 192)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !893, file: !595, line: 206, baseType: !66, size: 64, offset: 256)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !893, file: !595, line: 207, baseType: !88, size: 64, offset: 320)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !893, file: !595, line: 208, baseType: !31, size: 64, offset: 384)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !893, file: !595, line: 209, baseType: !31, size: 64, offset: 448)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !893, file: !595, line: 210, baseType: !35, size: 32, offset: 512)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !893, file: !595, line: 211, baseType: !35, size: 32, offset: 544)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !893, file: !595, line: 212, baseType: !90, size: 64, offset: 576)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !893, file: !595, line: 214, baseType: !907, size: 64, offset: 640)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !595, line: 197, baseType: !889)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !893, file: !595, line: 218, baseType: !620, size: 64, offset: 704)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !893, file: !595, line: 220, baseType: !90, size: 64, offset: 768)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "fts_n_dirs_remaining", scope: !893, file: !595, line: 225, baseType: !623, size: 64, offset: 832)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !893, file: !595, line: 241, baseType: !68, size: 16, offset: 896)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !893, file: !595, line: 245, baseType: !68, size: 16, offset: 912)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !893, file: !595, line: 251, baseType: !68, size: 16, offset: 928)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !893, file: !595, line: 253, baseType: !916, size: 1152, offset: 960)
!916 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 1152, elements: !73)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !226, line: 46, size: 1152, elements: !918)
!918 = !{!919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !935, !936, !937}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !917, file: !226, line: 48, baseType: !139, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !917, file: !226, line: 53, baseType: !136, size: 64, offset: 64)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !917, file: !226, line: 61, baseType: !231, size: 64, offset: 128)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !917, file: !226, line: 62, baseType: !233, size: 32, offset: 192)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !917, file: !226, line: 64, baseType: !207, size: 32, offset: 224)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !917, file: !226, line: 65, baseType: !210, size: 32, offset: 256)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !917, file: !226, line: 67, baseType: !35, size: 32, offset: 288)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !917, file: !226, line: 69, baseType: !139, size: 64, offset: 320)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !917, file: !226, line: 74, baseType: !64, size: 64, offset: 384)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !917, file: !226, line: 78, baseType: !240, size: 64, offset: 448)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !917, file: !226, line: 80, baseType: !242, size: 64, offset: 512)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !917, file: !226, line: 91, baseType: !931, size: 128, offset: 576)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !245, line: 10, size: 128, elements: !932)
!932 = !{!933, !934}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !931, file: !245, line: 12, baseType: !248, size: 64)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !931, file: !245, line: 16, baseType: !250, size: 64, offset: 64)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !917, file: !226, line: 92, baseType: !931, size: 128, offset: 704)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !917, file: !226, line: 93, baseType: !931, size: 128, offset: 832)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !917, file: !226, line: 106, baseType: !254, size: 192, offset: 960)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "fts_name", scope: !893, file: !595, line: 254, baseType: !651, offset: 2112)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "fts_child", scope: !889, file: !595, line: 82, baseType: !892, size: 64, offset: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "fts_array", scope: !889, file: !595, line: 83, baseType: !941, size: 64, offset: 128)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !889, file: !595, line: 84, baseType: !138, size: 64, offset: 192)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !889, file: !595, line: 85, baseType: !31, size: 64, offset: 256)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "fts_rfd", scope: !889, file: !595, line: 86, baseType: !35, size: 32, offset: 320)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cwd_fd", scope: !889, file: !595, line: 87, baseType: !35, size: 32, offset: 352)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !889, file: !595, line: 89, baseType: !90, size: 64, offset: 384)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "fts_nitems", scope: !889, file: !595, line: 90, baseType: !90, size: 64, offset: 448)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "fts_compar", scope: !889, file: !595, line: 91, baseType: !949, size: 64, offset: 512)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DISubroutineType(types: !951)
!951 = !{!35, !952, !952}
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !893)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "fts_options", scope: !889, file: !595, line: 160, baseType: !35, size: 32, offset: 576)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "fts_leaf_optimization_works_ht", scope: !889, file: !595, line: 169, baseType: !672, size: 64, offset: 640)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !889, file: !595, line: 191, baseType: !958, size: 64, offset: 704)
!958 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !889, file: !595, line: 171, size: 64, elements: !959)
!959 = !{!960, !961}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !958, file: !595, line: 184, baseType: !672, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !958, file: !595, line: 190, baseType: !679, size: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fd_ring", scope: !889, file: !595, line: 196, baseType: !963, size: 256, offset: 768)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "I_ring", file: !683, line: 39, baseType: !964)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "I_ring", file: !683, line: 31, size: 256, elements: !965)
!965 = !{!966, !967, !968, !969, !970}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "ir_data", scope: !964, file: !683, line: 33, baseType: !687, size: 128)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "ir_default_val", scope: !964, file: !683, line: 34, baseType: !35, size: 32, offset: 128)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "ir_front", scope: !964, file: !683, line: 35, baseType: !7, size: 32, offset: 160)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "ir_back", scope: !964, file: !683, line: 36, baseType: !7, size: 32, offset: 192)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "ir_empty", scope: !964, file: !683, line: 37, baseType: !127, size: 8, offset: 224)
!971 = distinct !DICompileUnit(language: DW_LANG_C99, file: !972, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !973, retainedTypes: !974, nameTableKind: None)
