; ModuleID = 'coreutils-8.32/src/chroot.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.passwd = type { i8*, i8*, i32, i32, i8*, i8*, i8* }
%struct.group = type { i8*, i8*, i32, i8** }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [64 x i8] c"Usage: %s [OPTION] NEWROOT [COMMAND [ARG]...]\0A  or:  %s OPTION\0A\00", align 1
@.str.2 = private unnamed_addr constant [50 x i8] c"Run COMMAND with root directory set to NEWROOT.\0A\0A\00", align 1
@stdout = external local_unnamed_addr global %struct._IO_FILE*, align 8

!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!9 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 87, baseType: !7, size: 32, elements: !22)
!21 = !DIFile(filename: "src/system.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!22 = !{!23, !24, !25, !26}
!23 = !DIEnumerator(name: "EXIT_TIMEDOUT", value: 124, isUnsigned: true)
!24 = !DIEnumerator(name: "EXIT_CANCELED", value: 125, isUnsigned: true)
!25 = !DIEnumerator(name: "EXIT_CANNOT_INVOKE", value: 126, isUnsigned: true)
!26 = !DIEnumerator(name: "EXIT_ENOENT", value: 127, isUnsigned: true)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !28, line: 25, baseType: !7, size: 32, elements: !29)
!28 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!29 = !{!30, !31, !32, !33, !34}
!30 = !DIEnumerator(name: "LONGINT_OK", value: 0, isUnsigned: true)
!31 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1, isUnsigned: true)
!32 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2, isUnsigned: true)
!33 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3, isUnsigned: true)
!34 = !DIEnumerator(name: "LONGINT_INVALID", value: 4, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 46, baseType: !7, size: 32, elements: !37)
!36 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49}
!38 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!39 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!40 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!41 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!42 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!43 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!44 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!45 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!46 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!47 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!48 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!49 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !52, file: !51, line: 186, baseType: !7, size: 32, elements: !65)
!51 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!52 = distinct !DISubprogram(name: "x2nrealloc", scope: !51, file: !51, line: 174, type: !53, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !60)
!53 = !DISubroutineType(types: !54)
!54 = !{!55, !55, !56, !57}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !58, line: 46, baseType: !59)
!58 = !DIFile(filename: "/usr/lib/clang/12.0.1/include/stddef.h", directory: "")
!59 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!60 = !{!61, !62, !63, !64}
!61 = !DILocalVariable(name: "p", arg: 1, scope: !52, file: !51, line: 174, type: !55)
!62 = !DILocalVariable(name: "pn", arg: 2, scope: !52, file: !51, line: 174, type: !56)
!63 = !DILocalVariable(name: "s", arg: 3, scope: !52, file: !51, line: 174, type: !57)
!64 = !DILocalVariable(name: "n", scope: !52, file: !51, line: 176, type: !57)
!65 = !{!66}
!66 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!67 = !{!68, !55, !70, !71, !75, !77, !78, !87, !57}
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!70 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !72, line: 79, baseType: !73)
!72 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !74, line: 146, baseType: !7)
!74 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !72, line: 64, baseType: !76)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !74, line: 147, baseType: !7)
!77 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "group", file: !80, line: 42, size: 256, elements: !81)
!80 = !DIFile(filename: "/usr/include/grp.h", directory: "")
!81 = !{!82, !83, !84, !85}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "gr_name", scope: !79, file: !80, line: 44, baseType: !68, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "gr_passwd", scope: !79, file: !80, line: 45, baseType: !68, size: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "gr_gid", scope: !79, file: !80, line: 46, baseType: !76, size: 32, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "gr_mem", scope: !79, file: !80, line: 47, baseType: !86, size: 64, offset: 192)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !88, line: 267, baseType: !89)
!88 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intptr_t", file: !74, line: 207, baseType: !90)
!90 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!91 = !{!0}
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 1536, elements: !104)
!93 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !94)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !95, line: 50, size: 256, elements: !96)
!95 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!96 = !{!97, !100, !101, !103}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !94, file: !95, line: 52, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !94, file: !95, line: 55, baseType: !70, size: 32, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !94, file: !95, line: 56, baseType: !102, size: 64, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !94, file: !95, line: 57, baseType: !70, size: 32, offset: 192)
!104 = !{!105}
!105 = !DISubrange(count: 6)
!106 = !DIGlobalVariableExpression(var: !107, expr: !DIExpression())
!107 = distinct !DIGlobalVariable(name: "Version", scope: !108, file: !109, line: 2, type: !98, isLocal: false, isDefinition: true)
!108 = distinct !DICompileUnit(language: DW_LANG_C99, file: !109, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !110, globals: !111, splitDebugInlining: false, nameTableKind: None)
!109 = !DIFile(filename: "src/version.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!110 = !{}
!111 = !{!106}
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(name: "file_name", scope: !114, file: !115, line: 46, type: !98, isLocal: true, isDefinition: true)
!114 = distinct !DICompileUnit(language: DW_LANG_C99, file: !115, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !110, globals: !116, splitDebugInlining: false, nameTableKind: None)
!115 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!116 = !{!112, !117}
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !114, file: !115, line: 56, type: !119, isLocal: true, isDefinition: true)
!119 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(name: "exit_failure", scope: !122, file: !123, line: 24, type: !125, isLocal: false, isDefinition: true)
!122 = distinct !DICompileUnit(language: DW_LANG_C99, file: !123, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !110, globals: !124, splitDebugInlining: false, nameTableKind: None)
!123 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!124 = !{!120}
!125 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !70)
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(name: "program_name", scope: !128, file: !129, line: 33, type: !98, isLocal: false, isDefinition: true)
!128 = distinct !DICompileUnit(language: DW_LANG_C99, file: !129, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !110, retainedTypes: !130, globals: !131, splitDebugInlining: false, nameTableKind: None)
!129 = !DIFile(filename: "lib/progname.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!130 = !{!55, !68}
!131 = !{!126}
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !134, file: !135, line: 85, type: !180, isLocal: false, isDefinition: true)
!134 = distinct !DICompileUnit(language: DW_LANG_C99, file: !135, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !136, retainedTypes: !142, globals: !143, splitDebugInlining: false, nameTableKind: None)
!135 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!136 = !{!5, !137, !35}
!137 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, baseType: !7, size: 32, elements: !138)
!138 = !{!139, !140, !141}
!139 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!140 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!141 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!142 = !{!70, !77, !57, !68}
!143 = !{!132, !144, !150, !162, !164, !169, !176, !178}
!144 = !DIGlobalVariableExpression(var: !145, expr: !DIExpression())
!145 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !134, file: !135, line: 101, type: !146, isLocal: false, isDefinition: true)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 320, elements: !148)
!147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!148 = !{!149}
!149 = !DISubrange(count: 10)
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !134, file: !135, line: 1052, type: !152, isLocal: false, isDefinition: true)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !135, line: 65, size: 448, elements: !153)
!153 = !{!154, !155, !156, !160, !161}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !152, file: !135, line: 68, baseType: !5, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !152, file: !135, line: 71, baseType: !70, size: 32, offset: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !152, file: !135, line: 75, baseType: !157, size: 256, offset: 64)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !158)
!158 = !{!159}
!159 = !DISubrange(count: 8)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !152, file: !135, line: 78, baseType: !98, size: 64, offset: 320)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !152, file: !135, line: 81, baseType: !98, size: 64, offset: 384)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !134, file: !135, line: 116, type: !152, isLocal: true, isDefinition: true)
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(name: "slot0", scope: !134, file: !135, line: 842, type: !166, isLocal: true, isDefinition: true)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 2048, elements: !167)
!167 = !{!168}
!168 = !DISubrange(count: 256)
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(name: "slotvec", scope: !134, file: !135, line: 845, type: !171, isLocal: true, isDefinition: true)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !135, line: 834, size: 128, elements: !173)
!173 = !{!174, !175}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !172, file: !135, line: 836, baseType: !57, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !172, file: !135, line: 837, baseType: !68, size: 64, offset: 64)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(name: "nslots", scope: !134, file: !135, line: 843, type: !70, isLocal: true, isDefinition: true)
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(name: "slotvec0", scope: !134, file: !135, line: 844, type: !172, isLocal: true, isDefinition: true)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 704, elements: !182)
!181 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!182 = !{!183}
!183 = !DISubrange(count: 11)
!184 = !DIGlobalVariableExpression(var: !185, expr: !DIExpression())
!185 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !186, file: !187, line: 26, type: !189, isLocal: false, isDefinition: true)
!186 = distinct !DICompileUnit(language: DW_LANG_C99, file: !187, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !110, globals: !188, splitDebugInlining: false, nameTableKind: None)
!187 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!188 = !{!184}
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 376, elements: !190)
!190 = !{!191}
!191 = !DISubrange(count: 47)
!192 = distinct !DICompileUnit(language: DW_LANG_C99, file: !193, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !194, retainedTypes: !195, globals: !196, splitDebugInlining: false, nameTableKind: None)
!193 = !DIFile(filename: "lib/userspec.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!194 = !{!27}
!195 = !{!55, !71, !75}
!196 = !{!197, !260, !262}
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(name: "E_invalid_user", scope: !199, file: !193, line: 106, type: !98, isLocal: true, isDefinition: true)
!199 = distinct !DISubprogram(name: "parse_with_separator", scope: !193, file: !193, line: 102, type: !200, scopeLine: 105, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !192, retainedNodes: !204)
!200 = !DISubroutineType(types: !201)
!201 = !{!98, !98, !98, !202, !203, !86, !86}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!204 = !{!205, !206, !207, !208, !209, !210, !211, !212, !224, !232, !233, !234, !235, !236, !237, !240, !245, !248, !255}
!205 = !DILocalVariable(name: "spec", arg: 1, scope: !199, file: !193, line: 102, type: !98)
!206 = !DILocalVariable(name: "separator", arg: 2, scope: !199, file: !193, line: 102, type: !98)
!207 = !DILocalVariable(name: "uid", arg: 3, scope: !199, file: !193, line: 103, type: !202)
!208 = !DILocalVariable(name: "gid", arg: 4, scope: !199, file: !193, line: 103, type: !203)
!209 = !DILocalVariable(name: "username", arg: 5, scope: !199, file: !193, line: 104, type: !86)
!210 = !DILocalVariable(name: "groupname", arg: 6, scope: !199, file: !193, line: 104, type: !86)
!211 = !DILocalVariable(name: "error_msg", scope: !199, file: !193, line: 110, type: !98)
!212 = !DILocalVariable(name: "pwd", scope: !199, file: !193, line: 111, type: !213)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !215, line: 49, size: 384, elements: !216)
!215 = !DIFile(filename: "/usr/include/pwd.h", directory: "")
!216 = !{!217, !218, !219, !220, !221, !222, !223}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !214, file: !215, line: 51, baseType: !68, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !214, file: !215, line: 52, baseType: !68, size: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !214, file: !215, line: 54, baseType: !73, size: 32, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !214, file: !215, line: 55, baseType: !76, size: 32, offset: 160)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !214, file: !215, line: 56, baseType: !68, size: 64, offset: 192)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !214, file: !215, line: 57, baseType: !68, size: 64, offset: 256)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !214, file: !215, line: 58, baseType: !68, size: 64, offset: 320)
!224 = !DILocalVariable(name: "grp", scope: !199, file: !193, line: 112, type: !225)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "group", file: !80, line: 42, size: 256, elements: !227)
!227 = !{!228, !229, !230, !231}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "gr_name", scope: !226, file: !80, line: 44, baseType: !68, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "gr_passwd", scope: !226, file: !80, line: 45, baseType: !68, size: 64, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "gr_gid", scope: !226, file: !80, line: 46, baseType: !76, size: 32, offset: 128)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "gr_mem", scope: !226, file: !80, line: 47, baseType: !86, size: 64, offset: 192)
!232 = !DILocalVariable(name: "u", scope: !199, file: !193, line: 113, type: !68)
!233 = !DILocalVariable(name: "g", scope: !199, file: !193, line: 114, type: !98)
!234 = !DILocalVariable(name: "gname", scope: !199, file: !193, line: 115, type: !68)
!235 = !DILocalVariable(name: "unum", scope: !199, file: !193, line: 116, type: !71)
!236 = !DILocalVariable(name: "gnum", scope: !199, file: !193, line: 117, type: !75)
!237 = !DILocalVariable(name: "ulen", scope: !238, file: !193, line: 137, type: !57)
!238 = distinct !DILexicalBlock(scope: !239, file: !193, line: 136, column: 5)
!239 = distinct !DILexicalBlock(scope: !199, file: !193, line: 130, column: 7)
!240 = !DILocalVariable(name: "use_login_group", scope: !241, file: !193, line: 164, type: !119)
!241 = distinct !DILexicalBlock(scope: !242, file: !193, line: 163, column: 9)
!242 = distinct !DILexicalBlock(scope: !243, file: !193, line: 162, column: 11)
!243 = distinct !DILexicalBlock(scope: !244, file: !193, line: 159, column: 5)
!244 = distinct !DILexicalBlock(scope: !199, file: !193, line: 158, column: 7)
!245 = !DILocalVariable(name: "tmp", scope: !246, file: !193, line: 173, type: !59)
!246 = distinct !DILexicalBlock(scope: !247, file: !193, line: 172, column: 13)
!247 = distinct !DILexicalBlock(scope: !241, file: !193, line: 165, column: 15)
!248 = !DILocalVariable(name: "buf", scope: !249, file: !193, line: 188, type: !252)
!249 = distinct !DILexicalBlock(scope: !250, file: !193, line: 185, column: 13)
!250 = distinct !DILexicalBlock(scope: !251, file: !193, line: 184, column: 15)
!251 = distinct !DILexicalBlock(scope: !242, file: !193, line: 182, column: 9)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 168, elements: !253)
!253 = !{!254}
!254 = !DISubrange(count: 21)
!255 = !DILocalVariable(name: "tmp", scope: !256, file: !193, line: 205, type: !59)
!256 = distinct !DILexicalBlock(scope: !257, file: !193, line: 204, column: 9)
!257 = distinct !DILexicalBlock(scope: !258, file: !193, line: 203, column: 11)
!258 = distinct !DILexicalBlock(scope: !259, file: !193, line: 199, column: 5)
!259 = distinct !DILexicalBlock(scope: !199, file: !193, line: 198, column: 7)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(name: "E_invalid_group", scope: !199, file: !193, line: 107, type: !98, isLocal: true, isDefinition: true)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(name: "E_bad_spec", scope: !199, file: !193, line: 108, type: !98, isLocal: true, isDefinition: true)
!264 = distinct !DICompileUnit(language: DW_LANG_C99, file: !265, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !266, retainedTypes: !270, splitDebugInlining: false, nameTableKind: None)
!265 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!266 = !{!267}
!267 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !265, line: 40, baseType: !7, size: 32, elements: !268)
!268 = !{!269}
!269 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!270 = !{!55}
!271 = distinct !DICompileUnit(language: DW_LANG_C99, file: !272, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !273, retainedTypes: !281, splitDebugInlining: false, nameTableKind: None)
!272 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!273 = !{!274}
!274 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !275, file: !51, line: 186, baseType: !7, size: 32, elements: !65)
!275 = distinct !DISubprogram(name: "x2nrealloc", scope: !51, file: !51, line: 174, type: !53, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !271, retainedNodes: !276)
!276 = !{!277, !278, !279, !280}
!277 = !DILocalVariable(name: "p", arg: 1, scope: !275, file: !51, line: 174, type: !55)
!278 = !DILocalVariable(name: "pn", arg: 2, scope: !275, file: !51, line: 174, type: !56)
!279 = !DILocalVariable(name: "s", arg: 3, scope: !275, file: !51, line: 174, type: !57)
!280 = !DILocalVariable(name: "n", scope: !275, file: !51, line: 176, type: !57)
!281 = !{!57, !68, !55}
!282 = distinct !DICompileUnit(language: DW_LANG_C99, file: !283, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !110, splitDebugInlining: false, nameTableKind: None)
!283 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!284 = distinct !DICompileUnit(language: DW_LANG_C99, file: !285, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !110, splitDebugInlining: false, nameTableKind: None)
!285 = !DIFile(filename: "lib/xgetgroups.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!286 = distinct !DICompileUnit(language: DW_LANG_C99, file: !287, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !288, retainedTypes: !289, splitDebugInlining: false, nameTableKind: None)
!287 = !DIFile(filename: "lib/xstrtoul.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!288 = !{!27, !35}
!289 = !{!70, !77}
!290 = distinct !DICompileUnit(language: DW_LANG_C99, file: !291, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !288, retainedTypes: !289, splitDebugInlining: false, nameTableKind: None)
!291 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!292 = distinct !DICompileUnit(language: DW_LANG_C99, file: !293, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !110, retainedTypes: !270, splitDebugInlining: false, nameTableKind: None)
!293 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!294 = distinct !DICompileUnit(language: DW_LANG_C99, file: !295, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !110, retainedTypes: !296, splitDebugInlining: false, nameTableKind: None)
!295 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!296 = !{!57}
!297 = distinct !DICompileUnit(language: DW_LANG_C99, file: !298, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !110, splitDebugInlining: false, nameTableKind: None)
!298 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!299 = distinct !DICompileUnit(language: DW_LANG_C99, file: !300, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !110, splitDebugInlining: false, nameTableKind: None)
!300 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!301 = distinct !DICompileUnit(language: DW_LANG_C99, file: !302, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !110, retainedTypes: !303, splitDebugInlining: false, nameTableKind: None)
!302 = !DIFile(filename: "lib/umaxtostr.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!303 = !{!304}
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !305, line: 102, baseType: !306)
!305 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !74, line: 73, baseType: !59)
!307 = distinct !DICompileUnit(language: DW_LANG_C99, file: !308, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !309, retainedTypes: !270, splitDebugInlining: false, nameTableKind: None)
!308 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!309 = !{!310}
!310 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !311, line: 41, baseType: !7, size: 32, elements: !312)
!311 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!312 = !{!313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695}
!313 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!314 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!315 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!316 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!317 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!318 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!319 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!320 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!321 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!322 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!323 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!324 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!325 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!326 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!327 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!328 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!329 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!330 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!331 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!332 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!333 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!334 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!335 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!336 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!337 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!338 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!339 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!340 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!341 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!342 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!343 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!344 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!345 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!346 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!347 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!348 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!349 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!350 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!351 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!352 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!353 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!354 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!355 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!356 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!357 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!358 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!359 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!360 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!361 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!362 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!363 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!364 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!365 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!366 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!367 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!368 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!369 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!370 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!371 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!372 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!373 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!374 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!375 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!376 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!377 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!378 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!379 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!380 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!381 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!382 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!383 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!384 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!385 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!386 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!387 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!388 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!389 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!390 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!391 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!392 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!393 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!394 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!395 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!396 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!397 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!398 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!399 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!400 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!401 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!402 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!403 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!404 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!405 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!406 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!407 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!408 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!409 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!410 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!411 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!412 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!413 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!414 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!415 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!416 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!417 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!418 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!419 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!420 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!421 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!422 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!423 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!424 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!425 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!426 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!427 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!428 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!429 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!430 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!431 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!432 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!433 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!434 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!435 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!436 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!437 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!438 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!439 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!440 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!441 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!442 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!443 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!444 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!445 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!446 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!447 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!448 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!449 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!450 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!451 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!452 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!453 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!454 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!455 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!456 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!457 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!458 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!459 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!460 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!461 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!462 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!463 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!464 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!465 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!466 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!467 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!468 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!469 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!470 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!471 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!472 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!473 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!474 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!475 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!476 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!477 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!478 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!479 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!480 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!481 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!482 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!483 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!484 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!485 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!486 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!487 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!488 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!489 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!490 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!491 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!492 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!493 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!494 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!495 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!496 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!497 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!498 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!499 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!500 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!501 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!502 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!503 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!504 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!505 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!506 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!507 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!508 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!509 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!510 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!511 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!512 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!513 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!514 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!515 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!516 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!517 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!518 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!519 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!520 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!521 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!522 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!523 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!524 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!525 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!526 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!527 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!528 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!529 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!530 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!531 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!532 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!533 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!534 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!535 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!536 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!537 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!538 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!539 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!540 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!541 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!542 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!543 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!544 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!545 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!546 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!547 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!548 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!549 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!550 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!551 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!552 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!553 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!554 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!555 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!556 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!557 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!558 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!559 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!560 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!561 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!562 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!563 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!564 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!565 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!566 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!567 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!568 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!569 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!570 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!571 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!572 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!573 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!574 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!575 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!576 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!577 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!578 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!579 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!580 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!581 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!582 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!583 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!584 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!585 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!586 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!587 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!588 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!589 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!590 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!591 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!592 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!593 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!594 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!595 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!596 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!597 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!598 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!599 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!600 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!601 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!602 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!603 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!604 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!605 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!606 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!607 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!608 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!609 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!610 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!611 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!612 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!613 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!614 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!615 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!616 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!617 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!618 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!619 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!620 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!621 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!622 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!623 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!624 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!625 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!626 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!627 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!628 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!629 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!630 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!631 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!632 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!633 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!634 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!635 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!636 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!637 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!638 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!639 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!640 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!661 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!662 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!663 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!664 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!665 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!666 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!667 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!668 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!669 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!670 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!671 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!672 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!673 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!674 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!675 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!676 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!677 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!678 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!679 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!680 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!681 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!682 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!683 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!684 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!685 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!686 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!687 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!688 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!689 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!690 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!691 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!692 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!693 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!694 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!695 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!696 = distinct !DICompileUnit(language: DW_LANG_C99, file: !697, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !698, retainedTypes: !729, splitDebugInlining: false, nameTableKind: None)
!697 = !DIFile(filename: "lib/mgetgroups.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!698 = !{!699}
!699 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !700, file: !697, line: 83, baseType: !7, size: 32, elements: !727)
!700 = distinct !DISubprogram(name: "mgetgroups", scope: !697, file: !697, line: 66, type: !701, scopeLine: 67, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !696, retainedNodes: !704)
!701 = !DISubroutineType(types: !702)
!702 = !{!70, !98, !75, !703}
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!704 = !{!705, !706, !707, !708, !709, !710, !711, !715, !716, !719, !722, !725, !726}
!705 = !DILocalVariable(name: "username", arg: 1, scope: !700, file: !697, line: 66, type: !98)
!706 = !DILocalVariable(name: "gid", arg: 2, scope: !700, file: !697, line: 66, type: !75)
!707 = !DILocalVariable(name: "groups", arg: 3, scope: !700, file: !697, line: 66, type: !703)
!708 = !DILocalVariable(name: "max_n_groups", scope: !700, file: !697, line: 68, type: !70)
!709 = !DILocalVariable(name: "ng", scope: !700, file: !697, line: 69, type: !70)
!710 = !DILocalVariable(name: "g", scope: !700, file: !697, line: 70, type: !203)
!711 = !DILocalVariable(name: "h", scope: !712, file: !697, line: 92, type: !203)
!712 = distinct !DILexicalBlock(scope: !713, file: !697, line: 91, column: 9)
!713 = distinct !DILexicalBlock(scope: !714, file: !697, line: 82, column: 5)
!714 = distinct !DILexicalBlock(scope: !700, file: !697, line: 81, column: 7)
!715 = !DILocalVariable(name: "last_n_groups", scope: !712, file: !697, line: 93, type: !70)
!716 = !DILocalVariable(name: "saved_errno", scope: !717, file: !697, line: 105, type: !70)
!717 = distinct !DILexicalBlock(scope: !718, file: !697, line: 104, column: 13)
!718 = distinct !DILexicalBlock(scope: !712, file: !697, line: 103, column: 15)
!719 = !DILocalVariable(name: "saved_errno", scope: !720, file: !697, line: 156, type: !70)
!720 = distinct !DILexicalBlock(scope: !721, file: !697, line: 154, column: 5)
!721 = distinct !DILexicalBlock(scope: !700, file: !697, line: 153, column: 7)
!722 = !DILocalVariable(name: "first", scope: !723, file: !697, line: 187, type: !75)
!723 = distinct !DILexicalBlock(scope: !724, file: !697, line: 186, column: 5)
!724 = distinct !DILexicalBlock(scope: !700, file: !697, line: 185, column: 7)
!725 = !DILocalVariable(name: "next", scope: !723, file: !697, line: 188, type: !203)
!726 = !DILocalVariable(name: "groups_end", scope: !723, file: !697, line: 189, type: !203)
!727 = !{!728}
!728 = !DIEnumerator(name: "N_GROUPS_INIT", value: 10, isUnsigned: true)
!729 = !{!55, !75, !57}
!730 = distinct !DICompileUnit(language: DW_LANG_C99, file: !731, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !110, retainedTypes: !270, splitDebugInlining: false, nameTableKind: None)
!731 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!732 = distinct !DICompileUnit(language: DW_LANG_C99, file: !733, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !110, splitDebugInlining: false, nameTableKind: None)
!733 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!734 = distinct !DICompileUnit(language: DW_LANG_C99, file: !735, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !110, retainedTypes: !270, splitDebugInlining: false, nameTableKind: None)
!735 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!736 = distinct !DICompileUnit(language: DW_LANG_C99, file: !737, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !110, retainedTypes: !270, splitDebugInlining: false, nameTableKind: None)
!737 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!738 = !{!"clang version 12.0.1"}
!739 = !{i32 7, !"Dwarf Version", i32 4}
!740 = !{i32 2, !"Debug Info Version", i32 3}
!741 = !{i32 1, !"wchar_size", i32 4}
!742 = !{i32 7, !"PIC Level", i32 2}
!743 = !{i32 7, !"PIE Level", i32 2}
!744 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 181, type: !745, scopeLine: 182, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !747)
!745 = !DISubroutineType(types: !746)
!746 = !{null, !70}
!747 = !{!748}
!748 = !DILocalVariable(name: "status", arg: 1, scope: !744, file: !3, line: 181, type: !70)
!749 = !DILocation(line: 0, scope: !744)
!750 = !DILocation(line: 183, column: 14, scope: !751)
!751 = distinct !DILexicalBlock(scope: !744, file: !3, line: 183, column: 7)
!752 = !DILocation(line: 183, column: 7, scope: !744)
!753 = !DILocation(line: 184, column: 5, scope: !754)
!754 = distinct !DILexicalBlock(scope: !751, file: !3, line: 184, column: 5)
!755 = !{!756, !756, i64 0}
!756 = !{!"any pointer", !757, i64 0}
!757 = !{!"omnipotent char", !758, i64 0}
!758 = !{!"Simple C/C++ TBAA"}
!759 = !DILocation(line: 187, column: 7, scope: !760)
!760 = distinct !DILexicalBlock(scope: !751, file: !3, line: 186, column: 5)
!761 = !DILocation(line: 192, column: 7, scope: !760)
!762 = !DILocation(line: 197, column: 7, scope: !760)
!763 = !DILocation(line: 200, column: 7, scope: !760)
!764 = !DILocation(line: 203, column: 7, scope: !760)
!765 = !DILocation(line: 207, column: 7, scope: !760)
!766 = !DILocation(line: 208, column: 7, scope: !760)
!767 = !DILocation(line: 209, column: 7, scope: !760)
!768 = !DILocalVariable(name: "program", arg: 1, scope: !769, file: !21, line: 634, type: !98)
!769 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !21, file: !21, line: 634, type: !770, scopeLine: 635, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !772)
!770 = !DISubroutineType(types: !771)
!771 = !{null, !98}
!772 = !{!768, !773, !782, !783, !785}
!773 = !DILocalVariable(name: "infomap", scope: !769, file: !21, line: 636, type: !774)
!774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !775, size: 896, elements: !780)
!775 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !776)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !769, file: !21, line: 636, size: 128, elements: !777)
!777 = !{!778, !779}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !776, file: !21, line: 636, baseType: !98, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !776, file: !21, line: 636, baseType: !98, size: 64, offset: 64)
!780 = !{!781}
!781 = !DISubrange(count: 7)
!782 = !DILocalVariable(name: "node", scope: !769, file: !21, line: 646, type: !98)
!783 = !DILocalVariable(name: "map_prog", scope: !769, file: !21, line: 647, type: !784)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!785 = !DILocalVariable(name: "lc_messages", scope: !769, file: !21, line: 659, type: !98)
!786 = !DILocation(line: 0, scope: !769, inlinedAt: !787)
!787 = distinct !DILocation(line: 213, column: 7, scope: !760)
!788 = !DILocation(line: 636, column: 3, scope: !769, inlinedAt: !787)
!789 = !DILocation(line: 636, column: 67, scope: !769, inlinedAt: !787)
!790 = !DILocation(line: 647, column: 36, scope: !769, inlinedAt: !787)
!791 = !DILocation(line: 649, column: 3, scope: !769, inlinedAt: !787)
!792 = !DILocation(line: 649, column: 33, scope: !769, inlinedAt: !787)
!793 = !DILocation(line: 650, column: 13, scope: !769, inlinedAt: !787)
!794 = !DILocation(line: 649, column: 20, scope: !769, inlinedAt: !787)
!795 = !{!796, !756, i64 0}
!796 = !{!"infomap", !756, i64 0, !756, i64 8}
!797 = !DILocation(line: 649, column: 10, scope: !769, inlinedAt: !787)
!798 = !DILocation(line: 649, column: 28, scope: !769, inlinedAt: !787)
!799 = distinct !{!799, !791, !793, !800}
!800 = !{!"llvm.loop.mustprogress"}
!801 = !DILocation(line: 652, column: 17, scope: !802, inlinedAt: !787)
!802 = distinct !DILexicalBlock(scope: !769, file: !21, line: 652, column: 7)
!803 = !{!796, !756, i64 8}
!804 = !DILocation(line: 652, column: 7, scope: !802, inlinedAt: !787)
!805 = !DILocation(line: 652, column: 7, scope: !769, inlinedAt: !787)
!806 = !DILocation(line: 655, column: 3, scope: !769, inlinedAt: !787)
!807 = !DILocation(line: 659, column: 29, scope: !769, inlinedAt: !787)
!808 = !DILocation(line: 660, column: 7, scope: !809, inlinedAt: !787)
!809 = distinct !DILexicalBlock(scope: !769, file: !21, line: 660, column: 7)
!810 = !DILocation(line: 660, column: 19, scope: !809, inlinedAt: !787)
!811 = !DILocation(line: 660, column: 22, scope: !809, inlinedAt: !787)
!812 = !DILocation(line: 660, column: 7, scope: !769, inlinedAt: !787)
!813 = !DILocation(line: 666, column: 7, scope: !814, inlinedAt: !787)
!814 = distinct !DILexicalBlock(scope: !809, file: !21, line: 661, column: 5)
!815 = !DILocation(line: 668, column: 5, scope: !814, inlinedAt: !787)
!816 = !DILocation(line: 669, column: 3, scope: !769, inlinedAt: !787)
!817 = !DILocation(line: 671, column: 3, scope: !769, inlinedAt: !787)
!818 = !DILocation(line: 673, column: 1, scope: !769, inlinedAt: !787)
!819 = !DILocation(line: 215, column: 3, scope: !744)
!820 = !DISubprogram(name: "dcgettext", scope: !821, file: !821, line: 51, type: !822, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !110)
!821 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!822 = !DISubroutineType(types: !823)
!823 = !{!68, !98, !98, !70}
!824 = !DISubprogram(name: "fputs_unlocked", scope: !825, file: !825, line: 667, type: !826, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !110)
!825 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!826 = !DISubroutineType(types: !827)
!827 = !{!70, !98, !828}
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !830, line: 49, size: 1728, elements: !831)
!830 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!831 = !{!832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !847, !848, !849, !850, !852, !853, !855, !859, !862, !864, !867, !870, !871, !872, !873, !874}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !829, file: !830, line: 51, baseType: !70, size: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !829, file: !830, line: 54, baseType: !68, size: 64, offset: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !829, file: !830, line: 55, baseType: !68, size: 64, offset: 128)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !829, file: !830, line: 56, baseType: !68, size: 64, offset: 192)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !829, file: !830, line: 57, baseType: !68, size: 64, offset: 256)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !829, file: !830, line: 58, baseType: !68, size: 64, offset: 320)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !829, file: !830, line: 59, baseType: !68, size: 64, offset: 384)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !829, file: !830, line: 60, baseType: !68, size: 64, offset: 448)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !829, file: !830, line: 61, baseType: !68, size: 64, offset: 512)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !829, file: !830, line: 64, baseType: !68, size: 64, offset: 576)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !829, file: !830, line: 65, baseType: !68, size: 64, offset: 640)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !829, file: !830, line: 66, baseType: !68, size: 64, offset: 704)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !829, file: !830, line: 68, baseType: !845, size: 64, offset: 768)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !830, line: 36, flags: DIFlagFwdDecl)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !829, file: !830, line: 70, baseType: !828, size: 64, offset: 832)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !829, file: !830, line: 72, baseType: !70, size: 32, offset: 896)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !829, file: !830, line: 73, baseType: !70, size: 32, offset: 928)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !829, file: !830, line: 74, baseType: !851, size: 64, offset: 960)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !74, line: 152, baseType: !90)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !829, file: !830, line: 77, baseType: !77, size: 16, offset: 1024)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !829, file: !830, line: 78, baseType: !854, size: 8, offset: 1040)
!854 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !829, file: !830, line: 79, baseType: !856, size: 8, offset: 1048)
!856 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 8, elements: !857)
!857 = !{!858}
!858 = !DISubrange(count: 1)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !829, file: !830, line: 81, baseType: !860, size: 64, offset: 1088)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !830, line: 43, baseType: null)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !829, file: !830, line: 89, baseType: !863, size: 64, offset: 1152)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !74, line: 153, baseType: !90)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !829, file: !830, line: 91, baseType: !865, size: 64, offset: 1216)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !830, line: 37, flags: DIFlagFwdDecl)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !829, file: !830, line: 92, baseType: !868, size: 64, offset: 1280)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !830, line: 38, flags: DIFlagFwdDecl)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !829, file: !830, line: 93, baseType: !828, size: 64, offset: 1344)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !829, file: !830, line: 94, baseType: !55, size: 64, offset: 1408)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !829, file: !830, line: 95, baseType: !57, size: 64, offset: 1472)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !829, file: !830, line: 96, baseType: !70, size: 32, offset: 1536)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !829, file: !830, line: 98, baseType: !875, size: 160, offset: 1568)
!875 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 160, elements: !876)
!876 = !{!877}
!877 = !DISubrange(count: 20)
!878 = !DISubprogram(name: "setlocale", scope: !879, file: !879, line: 122, type: !880, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !110)
!879 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!880 = !DISubroutineType(types: !881)
!881 = !{!68, !70, !98}
!882 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 219, type: !883, scopeLine: 220, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !885)
!883 = !DISubroutineType(types: !884)
!884 = !{!70, !70, !86}
!885 = !{!886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !901, !902, !903, !908, !922, !925, !928, !931, !934, !937, !938, !939, !943}
!886 = !DILocalVariable(name: "argc", arg: 1, scope: !882, file: !3, line: 219, type: !70)
!887 = !DILocalVariable(name: "argv", arg: 2, scope: !882, file: !3, line: 219, type: !86)
!888 = !DILocalVariable(name: "c", scope: !882, file: !3, line: 221, type: !70)
!889 = !DILocalVariable(name: "userspec", scope: !882, file: !3, line: 224, type: !68)
!890 = !DILocalVariable(name: "username", scope: !882, file: !3, line: 225, type: !98)
!891 = !DILocalVariable(name: "groups", scope: !882, file: !3, line: 226, type: !98)
!892 = !DILocalVariable(name: "skip_chdir", scope: !882, file: !3, line: 227, type: !119)
!893 = !DILocalVariable(name: "uid", scope: !882, file: !3, line: 230, type: !71)
!894 = !DILocalVariable(name: "gid", scope: !882, file: !3, line: 231, type: !75)
!895 = !DILocalVariable(name: "out_gids", scope: !882, file: !3, line: 232, type: !203)
!896 = !DILocalVariable(name: "n_gids", scope: !882, file: !3, line: 233, type: !57)
!897 = !DILocalVariable(name: "userlen", scope: !898, file: !3, line: 254, type: !57)
!898 = distinct !DILexicalBlock(scope: !899, file: !3, line: 249, column: 11)
!899 = distinct !DILexicalBlock(scope: !900, file: !3, line: 247, column: 9)
!900 = distinct !DILexicalBlock(scope: !882, file: !3, line: 245, column: 5)
!901 = !DILocalVariable(name: "newroot", scope: !882, file: !3, line: 283, type: !98)
!902 = !DILocalVariable(name: "is_oldroot", scope: !882, file: !3, line: 284, type: !119)
!903 = !DILocalVariable(name: "__x", scope: !904, file: !3, line: 302, type: !98)
!904 = distinct !DILexicalBlock(scope: !905, file: !3, line: 302, column: 9)
!905 = distinct !DILexicalBlock(scope: !906, file: !3, line: 301, column: 11)
!906 = distinct !DILexicalBlock(scope: !907, file: !3, line: 294, column: 5)
!907 = distinct !DILexicalBlock(scope: !882, file: !3, line: 293, column: 7)
!908 = !DILocalVariable(name: "pwd", scope: !909, file: !3, line: 308, type: !911)
!909 = distinct !DILexicalBlock(scope: !910, file: !3, line: 307, column: 9)
!910 = distinct !DILexicalBlock(scope: !906, file: !3, line: 306, column: 11)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !913)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !215, line: 49, size: 384, elements: !914)
!914 = !{!915, !916, !917, !918, !919, !920, !921}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !913, file: !215, line: 51, baseType: !68, size: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !913, file: !215, line: 52, baseType: !68, size: 64, offset: 64)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !913, file: !215, line: 54, baseType: !73, size: 32, offset: 128)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !913, file: !215, line: 55, baseType: !76, size: 32, offset: 160)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !913, file: !215, line: 56, baseType: !68, size: 64, offset: 192)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !913, file: !215, line: 57, baseType: !68, size: 64, offset: 256)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !913, file: !215, line: 58, baseType: !68, size: 64, offset: 320)
!922 = !DILocalVariable(name: "__x", scope: !923, file: !3, line: 318, type: !70)
!923 = distinct !DILexicalBlock(scope: !924, file: !3, line: 318, column: 9)
!924 = distinct !DILexicalBlock(scope: !906, file: !3, line: 317, column: 11)
!925 = !DILocalVariable(name: "ngroups", scope: !926, file: !3, line: 323, type: !70)
!926 = distinct !DILexicalBlock(scope: !927, file: !3, line: 322, column: 9)
!927 = distinct !DILexicalBlock(scope: !924, file: !3, line: 321, column: 16)
!928 = !DILocalVariable(name: "shell", scope: !929, file: !3, line: 340, type: !68)
!929 = distinct !DILexicalBlock(scope: !930, file: !3, line: 338, column: 5)
!930 = distinct !DILexicalBlock(scope: !882, file: !3, line: 337, column: 7)
!931 = !DILocalVariable(name: "err", scope: !932, file: !3, line: 357, type: !98)
!932 = distinct !DILexicalBlock(scope: !933, file: !3, line: 356, column: 5)
!933 = distinct !DILexicalBlock(scope: !882, file: !3, line: 355, column: 7)
!934 = !DILocalVariable(name: "pwd", scope: !935, file: !3, line: 367, type: !911)
!935 = distinct !DILexicalBlock(scope: !936, file: !3, line: 366, column: 5)
!936 = distinct !DILexicalBlock(scope: !882, file: !3, line: 365, column: 7)
!937 = !DILocalVariable(name: "gids", scope: !882, file: !3, line: 381, type: !203)
!938 = !DILocalVariable(name: "in_gids", scope: !882, file: !3, line: 382, type: !203)
!939 = !DILocalVariable(name: "ngroups", scope: !940, file: !3, line: 397, type: !70)
!940 = distinct !DILexicalBlock(scope: !941, file: !3, line: 396, column: 5)
!941 = distinct !DILexicalBlock(scope: !942, file: !3, line: 395, column: 12)
!942 = distinct !DILexicalBlock(scope: !882, file: !3, line: 383, column: 7)
!943 = !DILocalVariable(name: "exit_status", scope: !882, file: !3, line: 428, type: !70)
!944 = !DILocation(line: 0, scope: !882)
!945 = !DILocation(line: 230, column: 3, scope: !882)
!946 = !DILocation(line: 230, column: 9, scope: !882)
!947 = !{!948, !948, i64 0}
!948 = !{!"int", !757, i64 0}
!949 = !DILocation(line: 231, column: 3, scope: !882)
!950 = !DILocation(line: 231, column: 9, scope: !882)
!951 = !DILocation(line: 232, column: 3, scope: !882)
!952 = !DILocation(line: 232, column: 16, scope: !882)
!953 = !DILocation(line: 233, column: 3, scope: !882)
!954 = !DILocation(line: 233, column: 10, scope: !882)
!955 = !{!956, !956, i64 0}
!956 = !{!"long", !757, i64 0}
!957 = !DILocation(line: 236, column: 21, scope: !882)
!958 = !DILocation(line: 236, column: 3, scope: !882)
!959 = !DILocation(line: 237, column: 3, scope: !882)
!960 = !DILocation(line: 238, column: 3, scope: !882)
!961 = !DILocation(line: 239, column: 3, scope: !882)
!962 = !DILocalVariable(name: "status", arg: 1, scope: !963, file: !21, line: 99, type: !70)
!963 = distinct !DISubprogram(name: "initialize_exit_failure", scope: !21, file: !21, line: 99, type: !745, scopeLine: 100, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !964)
!964 = !{!962}
!965 = !DILocation(line: 0, scope: !963, inlinedAt: !966)
!966 = distinct !DILocation(line: 241, column: 3, scope: !882)
!967 = !DILocation(line: 102, column: 18, scope: !968, inlinedAt: !966)
!968 = distinct !DILexicalBlock(scope: !963, file: !21, line: 101, column: 7)
!969 = !DILocation(line: 242, column: 3, scope: !882)
!970 = !DILocation(line: 244, column: 3, scope: !882)
!971 = !DILocation(line: 224, column: 9, scope: !882)
!972 = !DILocation(line: 244, column: 15, scope: !882)
!973 = distinct !{!973, !970, !974, !800}
!974 = !DILocation(line: 275, column: 5, scope: !882)
!975 = !DILocation(line: 250, column: 24, scope: !898)
!976 = !DILocation(line: 254, column: 30, scope: !898)
!977 = !DILocation(line: 0, scope: !898)
!978 = !DILocation(line: 255, column: 17, scope: !979)
!979 = distinct !DILexicalBlock(scope: !898, file: !3, line: 255, column: 17)
!980 = !DILocation(line: 255, column: 25, scope: !979)
!981 = !DILocation(line: 255, column: 45, scope: !979)
!982 = !DILocation(line: 255, column: 28, scope: !979)
!983 = !{!757, !757, i64 0}
!984 = !DILocation(line: 255, column: 50, scope: !979)
!985 = !DILocation(line: 255, column: 17, scope: !898)
!986 = !DILocation(line: 256, column: 37, scope: !979)
!987 = !DILocation(line: 256, column: 15, scope: !979)
!988 = !DILocation(line: 261, column: 20, scope: !899)
!989 = !DILocation(line: 262, column: 11, scope: !899)
!990 = !DILocation(line: 268, column: 9, scope: !899)
!991 = !DILocation(line: 270, column: 9, scope: !899)
!992 = !DILocation(line: 273, column: 11, scope: !899)
!993 = !DILocation(line: 277, column: 15, scope: !994)
!994 = distinct !DILexicalBlock(scope: !882, file: !3, line: 277, column: 7)
!995 = !DILocation(line: 277, column: 12, scope: !994)
!996 = !DILocation(line: 277, column: 7, scope: !882)
!997 = !DILocation(line: 279, column: 20, scope: !998)
!998 = distinct !DILexicalBlock(scope: !994, file: !3, line: 278, column: 5)
!999 = !DILocation(line: 279, column: 7, scope: !998)
!1000 = !DILocation(line: 280, column: 7, scope: !998)
!1001 = !DILocation(line: 283, column: 25, scope: !882)
!1002 = !DILocalVariable(name: "dir", arg: 1, scope: !1003, file: !3, line: 172, type: !98)
!1003 = distinct !DISubprogram(name: "is_root", scope: !3, file: !3, line: 172, type: !1004, scopeLine: 173, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1006)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!119, !98}
!1006 = !{!1002, !1007, !1008}
!1007 = !DILocalVariable(name: "resolved", scope: !1003, file: !3, line: 174, type: !68)
!1008 = !DILocalVariable(name: "is_res_root", scope: !1003, file: !3, line: 175, type: !119)
!1009 = !DILocation(line: 0, scope: !1003, inlinedAt: !1010)
!1010 = distinct !DILocation(line: 284, column: 21, scope: !882)
!1011 = !DILocation(line: 174, column: 20, scope: !1003, inlinedAt: !1010)
!1012 = !DILocation(line: 175, column: 22, scope: !1003, inlinedAt: !1010)
!1013 = !DILocation(line: 175, column: 31, scope: !1003, inlinedAt: !1010)
!1014 = !DILocation(line: 175, column: 34, scope: !1003, inlinedAt: !1010)
!1015 = !DILocation(line: 176, column: 3, scope: !1003, inlinedAt: !1010)
!1016 = !DILocation(line: 286, column: 20, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !882, file: !3, line: 286, column: 7)
!1018 = !DILocation(line: 288, column: 20, scope: !1019)
!1019 = distinct !DILexicalBlock(scope: !1017, file: !3, line: 287, column: 5)
!1020 = !DILocation(line: 289, column: 14, scope: !1019)
!1021 = !DILocation(line: 288, column: 7, scope: !1019)
!1022 = !DILocation(line: 290, column: 7, scope: !1019)
!1023 = !DILocation(line: 293, column: 7, scope: !882)
!1024 = !DILocation(line: 301, column: 11, scope: !905)
!1025 = !DILocation(line: 301, column: 11, scope: !906)
!1026 = !DILocation(line: 302, column: 9, scope: !904)
!1027 = !DILocation(line: 0, scope: !904)
!1028 = !DILocation(line: 302, column: 9, scope: !905)
!1029 = !DILocation(line: 306, column: 11, scope: !910)
!1030 = !DILocalVariable(name: "uid", arg: 1, scope: !1031, file: !3, line: 45, type: !71)
!1031 = distinct !DISubprogram(name: "uid_unset", scope: !3, file: !3, line: 45, type: !1032, scopeLine: 45, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1034)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!119, !71}
!1034 = !{!1030}
!1035 = !DILocation(line: 0, scope: !1031, inlinedAt: !1036)
!1036 = distinct !DILocation(line: 306, column: 11, scope: !910)
!1037 = !DILocation(line: 45, column: 55, scope: !1031, inlinedAt: !1036)
!1038 = !DILocation(line: 306, column: 25, scope: !910)
!1039 = !DILocation(line: 306, column: 31, scope: !910)
!1040 = !DILocation(line: 306, column: 38, scope: !910)
!1041 = !DILocalVariable(name: "gid", arg: 1, scope: !1042, file: !3, line: 46, type: !75)
!1042 = distinct !DISubprogram(name: "gid_unset", scope: !3, file: !3, line: 46, type: !1043, scopeLine: 46, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1045)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!119, !75}
!1045 = !{!1041}
!1046 = !DILocation(line: 0, scope: !1042, inlinedAt: !1047)
!1047 = distinct !DILocation(line: 306, column: 41, scope: !910)
!1048 = !DILocation(line: 309, column: 22, scope: !1049)
!1049 = distinct !DILexicalBlock(scope: !909, file: !3, line: 309, column: 15)
!1050 = !DILocation(line: 0, scope: !909)
!1051 = !DILocation(line: 309, column: 20, scope: !1049)
!1052 = !DILocation(line: 309, column: 15, scope: !909)
!1053 = !DILocation(line: 311, column: 30, scope: !1054)
!1054 = distinct !DILexicalBlock(scope: !1055, file: !3, line: 311, column: 19)
!1055 = distinct !DILexicalBlock(scope: !1049, file: !3, line: 310, column: 13)
!1056 = !DILocation(line: 0, scope: !1042, inlinedAt: !1057)
!1057 = distinct !DILocation(line: 311, column: 19, scope: !1054)
!1058 = !DILocation(line: 46, column: 55, scope: !1042, inlinedAt: !1057)
!1059 = !DILocation(line: 311, column: 19, scope: !1055)
!1060 = !DILocation(line: 312, column: 28, scope: !1054)
!1061 = !{!1062, !948, i64 20}
!1062 = !{!"passwd", !756, i64 0, !756, i64 8, !948, i64 16, !948, i64 20, !756, i64 24, !756, i64 32, !756, i64 40}
!1063 = !DILocation(line: 312, column: 21, scope: !1054)
!1064 = !DILocation(line: 312, column: 17, scope: !1054)
!1065 = !DILocation(line: 313, column: 31, scope: !1055)
!1066 = !{!1062, !756, i64 0}
!1067 = !DILocation(line: 314, column: 13, scope: !1055)
!1068 = !DILocation(line: 317, column: 11, scope: !924)
!1069 = !DILocation(line: 317, column: 18, scope: !924)
!1070 = !DILocation(line: 317, column: 21, scope: !924)
!1071 = !DILocation(line: 317, column: 11, scope: !906)
!1072 = !DILocation(line: 318, column: 9, scope: !923)
!1073 = !DILocation(line: 0, scope: !923)
!1074 = !DILocation(line: 318, column: 9, scope: !924)
!1075 = !DILocation(line: 321, column: 28, scope: !927)
!1076 = !DILocation(line: 0, scope: !1042, inlinedAt: !1077)
!1077 = distinct !DILocation(line: 321, column: 28, scope: !927)
!1078 = !DILocation(line: 46, column: 55, scope: !1042, inlinedAt: !1077)
!1079 = !DILocation(line: 321, column: 42, scope: !927)
!1080 = !DILocation(line: 323, column: 25, scope: !926)
!1081 = !DILocation(line: 0, scope: !926)
!1082 = !DILocation(line: 324, column: 17, scope: !1083)
!1083 = distinct !DILexicalBlock(scope: !926, file: !3, line: 324, column: 15)
!1084 = !DILocation(line: 324, column: 15, scope: !926)
!1085 = !DILocation(line: 325, column: 22, scope: !1083)
!1086 = !DILocation(line: 325, column: 20, scope: !1083)
!1087 = !DILocation(line: 325, column: 13, scope: !1083)
!1088 = !DILocation(line: 225, column: 15, scope: !882)
!1089 = !DILocation(line: 330, column: 7, scope: !1090)
!1090 = distinct !DILexicalBlock(scope: !882, file: !3, line: 330, column: 7)
!1091 = !DILocation(line: 330, column: 24, scope: !1090)
!1092 = !DILocation(line: 330, column: 7, scope: !882)
!1093 = !DILocation(line: 331, column: 5, scope: !1090)
!1094 = !DILocation(line: 334, column: 20, scope: !1095)
!1095 = distinct !DILexicalBlock(scope: !882, file: !3, line: 334, column: 7)
!1096 = !DILocation(line: 334, column: 23, scope: !1095)
!1097 = !DILocation(line: 334, column: 7, scope: !882)
!1098 = !DILocation(line: 335, column: 5, scope: !1095)
!1099 = !DILocation(line: 337, column: 15, scope: !930)
!1100 = !DILocation(line: 337, column: 22, scope: !930)
!1101 = !DILocation(line: 337, column: 12, scope: !930)
!1102 = !DILocation(line: 337, column: 7, scope: !882)
!1103 = !DILocation(line: 340, column: 21, scope: !929)
!1104 = !DILocation(line: 0, scope: !929)
!1105 = !DILocation(line: 341, column: 17, scope: !1106)
!1106 = distinct !DILexicalBlock(scope: !929, file: !3, line: 341, column: 11)
!1107 = !DILocation(line: 341, column: 11, scope: !929)
!1108 = !DILocation(line: 343, column: 15, scope: !929)
!1109 = !DILocation(line: 344, column: 7, scope: !929)
!1110 = !DILocation(line: 344, column: 15, scope: !929)
!1111 = !DILocation(line: 345, column: 7, scope: !929)
!1112 = !DILocation(line: 345, column: 15, scope: !929)
!1113 = !DILocation(line: 346, column: 5, scope: !929)
!1114 = !DILocation(line: 350, column: 12, scope: !1115)
!1115 = distinct !DILexicalBlock(scope: !930, file: !3, line: 348, column: 5)
!1116 = !DILocation(line: 355, column: 7, scope: !933)
!1117 = !DILocation(line: 355, column: 7, scope: !882)
!1118 = !DILocation(line: 357, column: 25, scope: !932)
!1119 = !DILocation(line: 0, scope: !932)
!1120 = !DILocation(line: 359, column: 11, scope: !1121)
!1121 = distinct !DILexicalBlock(scope: !932, file: !3, line: 359, column: 11)
!1122 = !DILocation(line: 359, column: 15, scope: !1121)
!1123 = !DILocation(line: 359, column: 29, scope: !1121)
!1124 = !DILocation(line: 0, scope: !1031, inlinedAt: !1125)
!1125 = distinct !DILocation(line: 359, column: 18, scope: !1121)
!1126 = !DILocation(line: 45, column: 55, scope: !1031, inlinedAt: !1125)
!1127 = !DILocation(line: 359, column: 34, scope: !1121)
!1128 = !DILocation(line: 359, column: 48, scope: !1121)
!1129 = !DILocation(line: 0, scope: !1042, inlinedAt: !1130)
!1130 = distinct !DILocation(line: 359, column: 37, scope: !1121)
!1131 = !DILocation(line: 46, column: 55, scope: !1042, inlinedAt: !1130)
!1132 = !DILocation(line: 359, column: 11, scope: !932)
!1133 = !DILocation(line: 360, column: 9, scope: !1121)
!1134 = !DILocation(line: 365, column: 7, scope: !936)
!1135 = !DILocation(line: 0, scope: !1031, inlinedAt: !1136)
!1136 = distinct !DILocation(line: 365, column: 7, scope: !936)
!1137 = !DILocation(line: 45, column: 55, scope: !1031, inlinedAt: !1136)
!1138 = !DILocation(line: 365, column: 21, scope: !936)
!1139 = !DILocation(line: 365, column: 27, scope: !936)
!1140 = !DILocation(line: 365, column: 34, scope: !936)
!1141 = !DILocation(line: 0, scope: !1042, inlinedAt: !1142)
!1142 = distinct !DILocation(line: 365, column: 37, scope: !936)
!1143 = !DILocation(line: 381, column: 23, scope: !882)
!1144 = !DILocation(line: 382, column: 3, scope: !882)
!1145 = !DILocation(line: 382, column: 16, scope: !882)
!1146 = !DILocation(line: 383, column: 14, scope: !942)
!1147 = !DILocation(line: 368, column: 18, scope: !1148)
!1148 = distinct !DILexicalBlock(scope: !935, file: !3, line: 368, column: 11)
!1149 = !DILocation(line: 0, scope: !935)
!1150 = !DILocation(line: 368, column: 16, scope: !1148)
!1151 = !DILocation(line: 0, scope: !1148)
!1152 = !DILocation(line: 0, scope: !1042, inlinedAt: !1153)
!1153 = distinct !DILocation(line: 374, column: 16, scope: !1154)
!1154 = distinct !DILexicalBlock(scope: !1148, file: !3, line: 374, column: 16)
!1155 = !DILocation(line: 0, scope: !1042, inlinedAt: !1156)
!1156 = distinct !DILocation(line: 370, column: 15, scope: !1157)
!1157 = distinct !DILexicalBlock(scope: !1158, file: !3, line: 370, column: 15)
!1158 = distinct !DILexicalBlock(scope: !1148, file: !3, line: 369, column: 9)
!1159 = !DILocation(line: 368, column: 11, scope: !935)
!1160 = !DILocation(line: 370, column: 15, scope: !1158)
!1161 = !DILocation(line: 371, column: 24, scope: !1157)
!1162 = !DILocation(line: 371, column: 17, scope: !1157)
!1163 = !DILocation(line: 371, column: 13, scope: !1157)
!1164 = !DILocation(line: 372, column: 27, scope: !1158)
!1165 = !DILocation(line: 373, column: 9, scope: !1158)
!1166 = !DILocation(line: 374, column: 16, scope: !1148)
!1167 = !DILocation(line: 376, column: 11, scope: !1168)
!1168 = distinct !DILexicalBlock(scope: !1154, file: !3, line: 375, column: 9)
!1169 = !DILocation(line: 383, column: 7, scope: !942)
!1170 = !DILocation(line: 383, column: 17, scope: !942)
!1171 = !DILocation(line: 383, column: 7, scope: !882)
!1172 = !DILocation(line: 385, column: 64, scope: !1173)
!1173 = distinct !DILexicalBlock(scope: !1174, file: !3, line: 385, column: 11)
!1174 = distinct !DILexicalBlock(scope: !942, file: !3, line: 384, column: 5)
!1175 = !DILocation(line: 385, column: 63, scope: !1173)
!1176 = !DILocation(line: 385, column: 11, scope: !1173)
!1177 = !DILocation(line: 385, column: 72, scope: !1173)
!1178 = !DILocation(line: 385, column: 11, scope: !1174)
!1179 = !DILocation(line: 387, column: 17, scope: !1180)
!1180 = distinct !DILexicalBlock(scope: !1181, file: !3, line: 387, column: 15)
!1181 = distinct !DILexicalBlock(scope: !1173, file: !3, line: 386, column: 9)
!1182 = !DILocation(line: 387, column: 15, scope: !1181)
!1183 = !DILocation(line: 392, column: 16, scope: !1173)
