; ModuleID = 'coreutils-8.32/src/chroot.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.passwd = type { i8*, i8*, i32, i32, i8*, i8*, i8* }
%struct.group = type { i8*, i8*, i32, i8** }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [64 x i8] c"Usage: %s [OPTION] NEWROOT [COMMAND [ARG]...]\0A  or:  %s OPTION\0A\00", align 1
@.str.2 = private unnamed_addr constant [50 x i8] c"Run COMMAND with root directory set to NEWROOT.\0A\0A\00", align 1
@stdout = external local_unnamed_addr global %struct._IO_FILE*, align 8

!13 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 87, baseType: !7, size: 32, elements: !22)
!21 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!22 = !{!23, !24, !25, !26}
!23 = !DIEnumerator(name: "EXIT_TIMEDOUT", value: 124, isUnsigned: true)
!24 = !DIEnumerator(name: "EXIT_CANCELED", value: 125, isUnsigned: true)
!25 = !DIEnumerator(name: "EXIT_CANNOT_INVOKE", value: 126, isUnsigned: true)
!26 = !DIEnumerator(name: "EXIT_ENOENT", value: 127, isUnsigned: true)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !28, line: 25, baseType: !7, size: 32, elements: !29)
!28 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!29 = !{!30, !31, !32, !33, !34}
!30 = !DIEnumerator(name: "LONGINT_OK", value: 0, isUnsigned: true)
!31 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1, isUnsigned: true)
!32 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2, isUnsigned: true)
!33 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3, isUnsigned: true)
!34 = !DIEnumerator(name: "LONGINT_INVALID", value: 4, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 46, baseType: !7, size: 32, elements: !37)
!36 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49}
!38 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!39 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!40 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!41 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!42 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!43 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!44 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!45 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!46 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!47 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!48 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!49 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !52, file: !51, line: 186, baseType: !7, size: 32, elements: !65)
!51 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!52 = distinct !DISubprogram(name: "x2nrealloc", scope: !51, file: !51, line: 174, type: !53, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !60)
!53 = !DISubroutineType(types: !54)
!54 = !{!55, !55, !56, !57}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !58, line: 46, baseType: !59)
!58 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!59 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!60 = !{!61, !62, !63, !64}
!61 = !DILocalVariable(name: "p", arg: 1, scope: !52, file: !51, line: 174, type: !55)
!62 = !DILocalVariable(name: "pn", arg: 2, scope: !52, file: !51, line: 174, type: !56)
!63 = !DILocalVariable(name: "s", arg: 3, scope: !52, file: !51, line: 174, type: !57)
!64 = !DILocalVariable(name: "n", scope: !52, file: !51, line: 176, type: !57)
!65 = !{!66}
!66 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!67 = !{!68, !78, !135, !138, !142, !146, !149, !152, !159, !72, !55, !174, !178, !182, !188, !204, !209, !213, !214, !76, !215, !221, !224, !227, !228, !231, !235, !236, !238, !239, !240, !109, !244, !247, !254, !57, !256, !257}
!68 = !DISubprogram(name: "dcgettext", scope: !69, file: !69, line: 51, type: !70, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !77)
!69 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!70 = !DISubroutineType(types: !71)
!71 = !{!72, !74, !74, !76}
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !73)
!76 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!77 = !{}
!78 = !DISubprogram(name: "fputs_unlocked", scope: !79, file: !79, line: 662, type: !80, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !77)
!79 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!80 = !DISubroutineType(types: !81)
!81 = !{!76, !74, !82}
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !84, line: 49, size: 1728, elements: !85)
!84 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!85 = !{!86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !101, !102, !103, !104, !108, !110, !112, !116, !119, !121, !124, !127, !128, !129, !130, !131}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !83, file: !84, line: 51, baseType: !76, size: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !83, file: !84, line: 54, baseType: !72, size: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !83, file: !84, line: 55, baseType: !72, size: 64, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !83, file: !84, line: 56, baseType: !72, size: 64, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !83, file: !84, line: 57, baseType: !72, size: 64, offset: 256)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !83, file: !84, line: 58, baseType: !72, size: 64, offset: 320)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !83, file: !84, line: 59, baseType: !72, size: 64, offset: 384)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !83, file: !84, line: 60, baseType: !72, size: 64, offset: 448)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !83, file: !84, line: 61, baseType: !72, size: 64, offset: 512)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !83, file: !84, line: 64, baseType: !72, size: 64, offset: 576)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !83, file: !84, line: 65, baseType: !72, size: 64, offset: 640)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !83, file: !84, line: 66, baseType: !72, size: 64, offset: 704)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !83, file: !84, line: 68, baseType: !99, size: 64, offset: 768)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !84, line: 36, flags: DIFlagFwdDecl)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !83, file: !84, line: 70, baseType: !82, size: 64, offset: 832)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !83, file: !84, line: 72, baseType: !76, size: 32, offset: 896)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !83, file: !84, line: 73, baseType: !76, size: 32, offset: 928)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !83, file: !84, line: 74, baseType: !105, size: 64, offset: 960)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !106, line: 152, baseType: !107)
!106 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!107 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !83, file: !84, line: 77, baseType: !109, size: 16, offset: 1024)
!109 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !83, file: !84, line: 78, baseType: !111, size: 8, offset: 1040)
!111 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !83, file: !84, line: 79, baseType: !113, size: 8, offset: 1048)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 8, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 1)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !83, file: !84, line: 81, baseType: !117, size: 64, offset: 1088)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !84, line: 43, baseType: null)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !83, file: !84, line: 89, baseType: !120, size: 64, offset: 1152)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !106, line: 153, baseType: !107)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !83, file: !84, line: 91, baseType: !122, size: 64, offset: 1216)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !84, line: 37, flags: DIFlagFwdDecl)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !83, file: !84, line: 92, baseType: !125, size: 64, offset: 1280)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !84, line: 38, flags: DIFlagFwdDecl)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !83, file: !84, line: 93, baseType: !82, size: 64, offset: 1344)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !83, file: !84, line: 94, baseType: !55, size: 64, offset: 1408)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !83, file: !84, line: 95, baseType: !57, size: 64, offset: 1472)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !83, file: !84, line: 96, baseType: !76, size: 32, offset: 1536)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !83, file: !84, line: 98, baseType: !132, size: 160, offset: 1568)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 160, elements: !133)
!133 = !{!134}
!134 = !DISubrange(count: 20)
!135 = !DISubprogram(name: "quotearg_style", scope: !6, file: !6, line: 377, type: !136, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !77)
!136 = !DISubroutineType(types: !137)
!137 = !{!72, !5, !74}
!138 = !DISubprogram(name: "set_program_name", scope: !139, file: !139, line: 37, type: !140, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !77)
!139 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!140 = !DISubroutineType(types: !141)
!141 = !{null, !74}
!142 = !DISubprogram(name: "setlocale", scope: !143, file: !143, line: 122, type: !144, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !77)
!143 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!144 = !DISubroutineType(types: !145)
!145 = !{!72, !76, !74}
!146 = !DISubprogram(name: "bindtextdomain", scope: !69, file: !69, line: 86, type: !147, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !77)
!147 = !DISubroutineType(types: !148)
!148 = !{!72, !74, !74}
!149 = !DISubprogram(name: "textdomain", scope: !69, file: !69, line: 82, type: !150, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !77)
!150 = !DISubroutineType(types: !151)
!151 = !{!72, !74}
!152 = !DISubprogram(name: "atexit", scope: !153, file: !153, line: 595, type: !154, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !77)
!153 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!154 = !DISubroutineType(types: !155)
!155 = !{!76, !156}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{null}
!159 = !DISubprogram(name: "getopt_long", scope: !160, file: !160, line: 66, type: !161, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !77)
!160 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!161 = !DISubroutineType(types: !162)
!162 = !{!76, !76, !163, !74, !165, !172}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !167)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !160, line: 50, size: 256, elements: !168)
!168 = !{!169, !170, !171, !173}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !167, file: !160, line: 52, baseType: !74, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !167, file: !160, line: 55, baseType: !76, size: 32, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !167, file: !160, line: 56, baseType: !172, size: 64, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !167, file: !160, line: 57, baseType: !76, size: 32, offset: 192)
!174 = !DISubprogram(name: "version_etc", scope: !175, file: !175, line: 69, type: !176, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !77)
!175 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!176 = !DISubroutineType(types: !177)
!177 = !{null, !82, !74, !74, !74, null}
!178 = !DISubprogram(name: "error", scope: !179, file: !179, line: 52, type: !180, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !77)
!179 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!180 = !DISubroutineType(types: !181)
!181 = !{null, !76, !76, !74, null}
!182 = !DISubprogram(name: "parse_user_spec", scope: !183, file: !183, line: 7, type: !184, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !77)
!183 = !DIFile(filename: "./lib/userspec.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!184 = !DISubroutineType(types: !185)
!185 = !{!74, !74, !186, !186, !187, !187}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!188 = !DISubprogram(name: "getpwuid", scope: !189, file: !189, line: 110, type: !190, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !77)
!189 = !DIFile(filename: "/usr/include/pwd.h", directory: "")
!190 = !DISubroutineType(types: !191)
!191 = !{!192, !7}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !189, line: 49, size: 384, elements: !194)
!194 = !{!195, !196, !197, !199, !201, !202, !203}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !193, file: !189, line: 51, baseType: !72, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !193, file: !189, line: 52, baseType: !72, size: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !193, file: !189, line: 54, baseType: !198, size: 32, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !106, line: 146, baseType: !7)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !193, file: !189, line: 55, baseType: !200, size: 32, offset: 160)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !106, line: 147, baseType: !7)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !193, file: !189, line: 56, baseType: !72, size: 64, offset: 192)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !193, file: !189, line: 57, baseType: !72, size: 64, offset: 256)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !193, file: !189, line: 58, baseType: !72, size: 64, offset: 320)
!204 = !DISubprogram(name: "xgetgroups", scope: !205, file: !205, line: 21, type: !206, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !77)
!205 = !DIFile(filename: "./lib/mgetgroups.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!206 = !DISubroutineType(types: !207)
!207 = !{!76, !74, !7, !208}
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!209 = !DISubprogram(name: "chroot", scope: !210, file: !210, line: 942, type: !211, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !77)
!210 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!211 = !DISubroutineType(types: !212)
!212 = !{!76, !74}
!213 = !DISubprogram(name: "chdir", scope: !210, file: !210, line: 497, type: !211, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !77)
!214 = !DISubprogram(name: "getenv", scope: !153, file: !153, line: 634, type: !150, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !77)
!215 = !DISubprogram(name: "setgroups", scope: !216, file: !216, line: 176, type: !217, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !77)
!216 = !DIFile(filename: "/usr/include/grp.h", directory: "")
!217 = !DISubroutineType(types: !218)
!218 = !{!76, !59, !219}
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!221 = !DISubprogram(name: "free", scope: !153, file: !153, line: 565, type: !222, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !77)
!222 = !DISubroutineType(types: !223)
!223 = !{null, !55}
!224 = !DISubprogram(name: "setgid", scope: !210, file: !210, line: 717, type: !225, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !77)
!225 = !DISubroutineType(types: !226)
!226 = !{!76, !7}
!227 = !DISubprogram(name: "setuid", scope: !210, file: !210, line: 700, type: !225, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !77)
!228 = !DISubprogram(name: "execvp", scope: !210, file: !210, line: 578, type: !229, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !77)
!229 = !DISubroutineType(types: !230)
!230 = !{!76, !74, !163}
!231 = !DISubprogram(name: "quote", scope: !232, file: !232, line: 44, type: !233, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !77)
!232 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!233 = !DISubroutineType(types: !234)
!234 = !{!74, !74}
!235 = !DISubprogram(name: "canonicalize_file_name", scope: !153, file: !153, line: 790, type: !150, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !77)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !237, line: 79, baseType: !198)
!237 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !237, line: 64, baseType: !200)
!239 = !DISubprogram(name: "xstrdup", scope: !51, file: !51, line: 64, type: !150, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !77)
!240 = !DISubprogram(name: "xstrtoumax", scope: !28, file: !28, line: 48, type: !241, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !77)
!241 = !DISubroutineType(types: !242)
!242 = !{!27, !74, !187, !76, !243, !74}
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!244 = !DISubprogram(name: "getgrnam", scope: !216, file: !216, line: 107, type: !245, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !77)
!245 = !DISubroutineType(types: !246)
!246 = !{!247, !74}
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "group", file: !216, line: 42, size: 256, elements: !249)
!249 = !{!250, !251, !252, !253}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "gr_name", scope: !248, file: !216, line: 44, baseType: !72, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "gr_passwd", scope: !248, file: !216, line: 45, baseType: !72, size: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "gr_gid", scope: !248, file: !216, line: 46, baseType: !200, size: 32, offset: 128)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "gr_mem", scope: !248, file: !216, line: 47, baseType: !187, size: 64, offset: 192)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !210, line: 267, baseType: !255)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intptr_t", file: !106, line: 206, baseType: !107)
!256 = !DISubprogram(name: "xalloc_die", scope: !51, file: !51, line: 51, type: !157, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !77)
!257 = !DISubprogram(name: "xrealloc", scope: !51, file: !51, line: 59, type: !258, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !77)
!258 = !DISubroutineType(types: !259)
!259 = !{!55, !55, !59}
!260 = !{!0}
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 1536, elements: !262)
!262 = !{!263}
!263 = !DISubrange(count: 6)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "Version", scope: !266, file: !267, line: 2, type: !74, isLocal: false, isDefinition: true)
!266 = distinct !DICompileUnit(language: DW_LANG_C99, file: !267, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !77, globals: !268, splitDebugInlining: false, nameTableKind: None)
!267 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!268 = !{!264}
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(name: "file_name", scope: !271, file: !272, line: 46, type: !74, isLocal: true, isDefinition: true)
!271 = distinct !DICompileUnit(language: DW_LANG_C99, file: !272, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !77, retainedTypes: !273, globals: !311, splitDebugInlining: false, nameTableKind: None)
!272 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!273 = !{!274, !68, !310, !178}
!274 = !DISubprogram(name: "close_stream", scope: !275, file: !275, line: 2, type: !276, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !77)
!275 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!276 = !DISubroutineType(types: !277)
!277 = !{!76, !278}
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !84, line: 49, size: 1728, elements: !280)
!280 = !{!281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !279, file: !84, line: 51, baseType: !76, size: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !279, file: !84, line: 54, baseType: !72, size: 64, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !279, file: !84, line: 55, baseType: !72, size: 64, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !279, file: !84, line: 56, baseType: !72, size: 64, offset: 192)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !279, file: !84, line: 57, baseType: !72, size: 64, offset: 256)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !279, file: !84, line: 58, baseType: !72, size: 64, offset: 320)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !279, file: !84, line: 59, baseType: !72, size: 64, offset: 384)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !279, file: !84, line: 60, baseType: !72, size: 64, offset: 448)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !279, file: !84, line: 61, baseType: !72, size: 64, offset: 512)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !279, file: !84, line: 64, baseType: !72, size: 64, offset: 576)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !279, file: !84, line: 65, baseType: !72, size: 64, offset: 640)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !279, file: !84, line: 66, baseType: !72, size: 64, offset: 704)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !279, file: !84, line: 68, baseType: !99, size: 64, offset: 768)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !279, file: !84, line: 70, baseType: !278, size: 64, offset: 832)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !279, file: !84, line: 72, baseType: !76, size: 32, offset: 896)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !279, file: !84, line: 73, baseType: !76, size: 32, offset: 928)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !279, file: !84, line: 74, baseType: !105, size: 64, offset: 960)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !279, file: !84, line: 77, baseType: !109, size: 16, offset: 1024)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !279, file: !84, line: 78, baseType: !111, size: 8, offset: 1040)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !279, file: !84, line: 79, baseType: !113, size: 8, offset: 1048)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !279, file: !84, line: 81, baseType: !117, size: 64, offset: 1088)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !279, file: !84, line: 89, baseType: !120, size: 64, offset: 1152)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !279, file: !84, line: 91, baseType: !122, size: 64, offset: 1216)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !279, file: !84, line: 92, baseType: !125, size: 64, offset: 1280)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !279, file: !84, line: 93, baseType: !278, size: 64, offset: 1344)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !279, file: !84, line: 94, baseType: !55, size: 64, offset: 1408)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !279, file: !84, line: 95, baseType: !57, size: 64, offset: 1472)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !279, file: !84, line: 96, baseType: !76, size: 32, offset: 1536)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !279, file: !84, line: 98, baseType: !132, size: 160, offset: 1568)
!310 = !DISubprogram(name: "quotearg_colon", scope: !6, file: !6, line: 391, type: !150, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !77)
!311 = !{!269, !312}
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !271, file: !272, line: 56, type: !314, isLocal: true, isDefinition: true)
!314 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(name: "exit_failure", scope: !317, file: !318, line: 24, type: !320, isLocal: false, isDefinition: true)
!317 = distinct !DICompileUnit(language: DW_LANG_C99, file: !318, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !77, globals: !319, splitDebugInlining: false, nameTableKind: None)
!318 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!319 = !{!315}
!320 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !76)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(name: "program_name", scope: !323, file: !324, line: 33, type: !74, isLocal: false, isDefinition: true)
!323 = distinct !DICompileUnit(language: DW_LANG_C99, file: !324, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !77, retainedTypes: !325, globals: !361, splitDebugInlining: false, nameTableKind: None)
!324 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!325 = !{!55, !326, !72}
!326 = !DISubprogram(name: "fputs", scope: !79, file: !79, line: 626, type: !327, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !77)
!327 = !DISubroutineType(types: !328)
!328 = !{!76, !74, !329}
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !84, line: 49, size: 1728, elements: !331)
!331 = !{!332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !330, file: !84, line: 51, baseType: !76, size: 32)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !330, file: !84, line: 54, baseType: !72, size: 64, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !330, file: !84, line: 55, baseType: !72, size: 64, offset: 128)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !330, file: !84, line: 56, baseType: !72, size: 64, offset: 192)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !330, file: !84, line: 57, baseType: !72, size: 64, offset: 256)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !330, file: !84, line: 58, baseType: !72, size: 64, offset: 320)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !330, file: !84, line: 59, baseType: !72, size: 64, offset: 384)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !330, file: !84, line: 60, baseType: !72, size: 64, offset: 448)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !330, file: !84, line: 61, baseType: !72, size: 64, offset: 512)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !330, file: !84, line: 64, baseType: !72, size: 64, offset: 576)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !330, file: !84, line: 65, baseType: !72, size: 64, offset: 640)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !330, file: !84, line: 66, baseType: !72, size: 64, offset: 704)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !330, file: !84, line: 68, baseType: !99, size: 64, offset: 768)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !330, file: !84, line: 70, baseType: !329, size: 64, offset: 832)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !330, file: !84, line: 72, baseType: !76, size: 32, offset: 896)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !330, file: !84, line: 73, baseType: !76, size: 32, offset: 928)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !330, file: !84, line: 74, baseType: !105, size: 64, offset: 960)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !330, file: !84, line: 77, baseType: !109, size: 16, offset: 1024)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !330, file: !84, line: 78, baseType: !111, size: 8, offset: 1040)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !330, file: !84, line: 79, baseType: !113, size: 8, offset: 1048)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !330, file: !84, line: 81, baseType: !117, size: 64, offset: 1088)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !330, file: !84, line: 89, baseType: !120, size: 64, offset: 1152)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !330, file: !84, line: 91, baseType: !122, size: 64, offset: 1216)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !330, file: !84, line: 92, baseType: !125, size: 64, offset: 1280)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !330, file: !84, line: 93, baseType: !329, size: 64, offset: 1344)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !330, file: !84, line: 94, baseType: !55, size: 64, offset: 1408)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !330, file: !84, line: 95, baseType: !57, size: 64, offset: 1472)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !330, file: !84, line: 96, baseType: !76, size: 32, offset: 1536)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !330, file: !84, line: 98, baseType: !132, size: 160, offset: 1568)
!361 = !{!321}
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !364, file: !365, line: 85, type: !459, isLocal: false, isDefinition: true)
!364 = distinct !DICompileUnit(language: DW_LANG_C99, file: !365, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !366, retainedTypes: !372, globals: !432, splitDebugInlining: false, nameTableKind: None)
!365 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!366 = !{!5, !367, !35}
!367 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, baseType: !7, size: 32, elements: !368)
!368 = !{!369, !370, !371}
!369 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!370 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!371 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!372 = !{!373, !378, !221, !393, !76, !109, !396, !57, !413, !415, !68, !421, !425, !72, !429, !256, !257}
!373 = !DISubprogram(name: "xmemdup", scope: !51, file: !51, line: 62, type: !374, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !77)
!374 = !DISubroutineType(types: !375)
!375 = !{!55, !376, !59}
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!378 = !DISubprogram(name: "quotearg_alloc_mem", scope: !6, file: !6, line: 342, type: !379, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !77)
!379 = !DISubroutineType(types: !380)
!380 = !{!72, !74, !59, !243, !381}
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !383)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !365, line: 65, size: 448, elements: !384)
!384 = !{!385, !386, !387, !391, !392}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !383, file: !365, line: 68, baseType: !5, size: 32)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !383, file: !365, line: 71, baseType: !76, size: 32, offset: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !383, file: !365, line: 75, baseType: !388, size: 256, offset: 64)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !389)
!389 = !{!390}
!390 = !DISubrange(count: 8)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !383, file: !365, line: 78, baseType: !74, size: 64, offset: 320)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !383, file: !365, line: 81, baseType: !74, size: 64, offset: 384)
!393 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !6, file: !6, line: 408, type: !394, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !77)
!394 = !DISubroutineType(types: !395)
!395 = !{!72, !76, !74, !74, !74, !59}
!396 = !DISubprogram(name: "rpl_mbrtowc", scope: !397, file: !397, line: 717, type: !398, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !77)
!397 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!398 = !DISubroutineType(types: !399)
!399 = !{!59, !172, !74, !59, !400}
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !402, line: 13, size: 64, elements: !403)
!402 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!403 = !{!404, !405}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !401, file: !402, line: 15, baseType: !76, size: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !401, file: !402, line: 20, baseType: !406, size: 32, offset: 32)
!406 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !401, file: !402, line: 16, size: 32, elements: !407)
!407 = !{!408, !409}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !406, file: !402, line: 18, baseType: !7, size: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !406, file: !402, line: 19, baseType: !410, size: 32)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 32, elements: !411)
!411 = !{!412}
!412 = !DISubrange(count: 4)
!413 = !DISubprogram(name: "iswprint", scope: !414, file: !414, line: 120, type: !225, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !77)
!414 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!415 = !DISubprogram(name: "mbsinit", scope: !416, file: !416, line: 292, type: !417, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !77)
!416 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!417 = !DISubroutineType(types: !418)
!418 = !{!76, !419}
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !401)
!421 = !DISubprogram(name: "locale_charset", scope: !422, file: !422, line: 35, type: !423, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !77)
!422 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!423 = !DISubroutineType(types: !424)
!424 = !{!74}
!425 = !DISubprogram(name: "c_strcasecmp", scope: !426, file: !426, line: 42, type: !427, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !77)
!426 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!427 = !DISubroutineType(types: !428)
!428 = !{!76, !74, !74}
!429 = !DISubprogram(name: "xmalloc", scope: !51, file: !51, line: 53, type: !430, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !77)
!430 = !DISubroutineType(types: !431)
!431 = !{!55, !59}
!432 = !{!362, !433, !439, !441, !443, !448, !455, !457}
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !364, file: !365, line: 101, type: !435, isLocal: false, isDefinition: true)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !436, size: 320, elements: !437)
!436 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!437 = !{!438}
!438 = !DISubrange(count: 10)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !364, file: !365, line: 1052, type: !383, isLocal: false, isDefinition: true)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !364, file: !365, line: 116, type: !383, isLocal: true, isDefinition: true)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(name: "slot0", scope: !364, file: !365, line: 842, type: !445, isLocal: true, isDefinition: true)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 2048, elements: !446)
!446 = !{!447}
!447 = !DISubrange(count: 256)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "slotvec", scope: !364, file: !365, line: 845, type: !450, isLocal: true, isDefinition: true)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !365, line: 834, size: 128, elements: !452)
!452 = !{!453, !454}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !451, file: !365, line: 836, baseType: !57, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !451, file: !365, line: 837, baseType: !72, size: 64, offset: 64)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(name: "nslots", scope: !364, file: !365, line: 843, type: !76, isLocal: true, isDefinition: true)
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(name: "slotvec0", scope: !364, file: !365, line: 844, type: !451, isLocal: true, isDefinition: true)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 704, elements: !461)
!460 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !74)
!461 = !{!462}
!462 = !DISubrange(count: 11)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !465, file: !466, line: 26, type: !468, isLocal: false, isDefinition: true)
!465 = distinct !DICompileUnit(language: DW_LANG_C99, file: !466, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !77, globals: !467, splitDebugInlining: false, nameTableKind: None)
!466 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!467 = !{!463}
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 376, elements: !469)
!469 = !{!470}
!470 = !DISubrange(count: 47)
!471 = distinct !DICompileUnit(language: DW_LANG_C99, file: !472, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !473, retainedTypes: !474, globals: !508, splitDebugInlining: false, nameTableKind: None)
!472 = !DIFile(filename: "lib/userspec.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!473 = !{!27}
!474 = !{!55, !239, !373, !475, !488, !236, !489, !499, !503, !504, !505, !238, !221, !68}
!475 = !DISubprogram(name: "getpwnam", scope: !189, file: !189, line: 116, type: !476, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !77)
!476 = !DISubroutineType(types: !477)
!477 = !{!478, !74}
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !189, line: 49, size: 384, elements: !480)
!480 = !{!481, !482, !483, !484, !485, !486, !487}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !479, file: !189, line: 51, baseType: !72, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !479, file: !189, line: 52, baseType: !72, size: 64, offset: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !479, file: !189, line: 54, baseType: !198, size: 32, offset: 128)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !479, file: !189, line: 55, baseType: !200, size: 32, offset: 160)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !479, file: !189, line: 56, baseType: !72, size: 64, offset: 192)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !479, file: !189, line: 57, baseType: !72, size: 64, offset: 256)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !479, file: !189, line: 58, baseType: !72, size: 64, offset: 320)
!488 = !DISubprogram(name: "xstrtoul", scope: !28, file: !28, line: 44, type: !241, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !77)
!489 = !DISubprogram(name: "getgrgid", scope: !216, file: !216, line: 101, type: !490, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !77)
!490 = !DISubroutineType(types: !491)
!491 = !{!492, !7}
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "group", file: !216, line: 42, size: 256, elements: !494)
!494 = !{!495, !496, !497, !498}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "gr_name", scope: !493, file: !216, line: 44, baseType: !72, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "gr_passwd", scope: !493, file: !216, line: 45, baseType: !72, size: 64, offset: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "gr_gid", scope: !493, file: !216, line: 46, baseType: !200, size: 32, offset: 128)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "gr_mem", scope: !493, file: !216, line: 47, baseType: !187, size: 64, offset: 192)
!499 = !DISubprogram(name: "umaxtostr", scope: !500, file: !500, line: 46, type: !501, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !77)
!500 = !DIFile(filename: "./lib/inttostr.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!501 = !DISubroutineType(types: !502)
!502 = !{!72, !59, !72}
!503 = !DISubprogram(name: "endgrent", scope: !216, file: !216, line: 67, type: !157, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !77)
!504 = !DISubprogram(name: "endpwent", scope: !189, file: !189, line: 78, type: !157, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !77)
!505 = !DISubprogram(name: "getgrnam", scope: !216, file: !216, line: 107, type: !506, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !77)
!506 = !DISubroutineType(types: !507)
!507 = !{!492, !74}
!508 = !{!509, !554, !556}
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(name: "E_invalid_user", scope: !511, file: !472, line: 106, type: !74, isLocal: true, isDefinition: true)
!511 = distinct !DISubprogram(name: "parse_with_separator", scope: !472, file: !472, line: 102, type: !512, scopeLine: 105, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !471, retainedNodes: !516)
!512 = !DISubroutineType(types: !513)
!513 = !{!74, !74, !74, !514, !515, !187, !187}
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!516 = !{!517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !534, !539, !542, !549}
!517 = !DILocalVariable(name: "spec", arg: 1, scope: !511, file: !472, line: 102, type: !74)
!518 = !DILocalVariable(name: "separator", arg: 2, scope: !511, file: !472, line: 102, type: !74)
!519 = !DILocalVariable(name: "uid", arg: 3, scope: !511, file: !472, line: 103, type: !514)
!520 = !DILocalVariable(name: "gid", arg: 4, scope: !511, file: !472, line: 103, type: !515)
!521 = !DILocalVariable(name: "username", arg: 5, scope: !511, file: !472, line: 104, type: !187)
!522 = !DILocalVariable(name: "groupname", arg: 6, scope: !511, file: !472, line: 104, type: !187)
!523 = !DILocalVariable(name: "error_msg", scope: !511, file: !472, line: 110, type: !74)
!524 = !DILocalVariable(name: "pwd", scope: !511, file: !472, line: 111, type: !478)
!525 = !DILocalVariable(name: "grp", scope: !511, file: !472, line: 112, type: !492)
!526 = !DILocalVariable(name: "u", scope: !511, file: !472, line: 113, type: !72)
!527 = !DILocalVariable(name: "g", scope: !511, file: !472, line: 114, type: !74)
!528 = !DILocalVariable(name: "gname", scope: !511, file: !472, line: 115, type: !72)
!529 = !DILocalVariable(name: "unum", scope: !511, file: !472, line: 116, type: !236)
!530 = !DILocalVariable(name: "gnum", scope: !511, file: !472, line: 117, type: !238)
!531 = !DILocalVariable(name: "ulen", scope: !532, file: !472, line: 137, type: !57)
!532 = distinct !DILexicalBlock(scope: !533, file: !472, line: 136, column: 5)
!533 = distinct !DILexicalBlock(scope: !511, file: !472, line: 130, column: 7)
!534 = !DILocalVariable(name: "use_login_group", scope: !535, file: !472, line: 164, type: !314)
!535 = distinct !DILexicalBlock(scope: !536, file: !472, line: 163, column: 9)
!536 = distinct !DILexicalBlock(scope: !537, file: !472, line: 162, column: 11)
!537 = distinct !DILexicalBlock(scope: !538, file: !472, line: 159, column: 5)
!538 = distinct !DILexicalBlock(scope: !511, file: !472, line: 158, column: 7)
!539 = !DILocalVariable(name: "tmp", scope: !540, file: !472, line: 173, type: !59)
!540 = distinct !DILexicalBlock(scope: !541, file: !472, line: 172, column: 13)
!541 = distinct !DILexicalBlock(scope: !535, file: !472, line: 165, column: 15)
!542 = !DILocalVariable(name: "buf", scope: !543, file: !472, line: 188, type: !546)
!543 = distinct !DILexicalBlock(scope: !544, file: !472, line: 185, column: 13)
!544 = distinct !DILexicalBlock(scope: !545, file: !472, line: 184, column: 15)
!545 = distinct !DILexicalBlock(scope: !536, file: !472, line: 182, column: 9)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 168, elements: !547)
!547 = !{!548}
!548 = !DISubrange(count: 21)
!549 = !DILocalVariable(name: "tmp", scope: !550, file: !472, line: 205, type: !59)
!550 = distinct !DILexicalBlock(scope: !551, file: !472, line: 204, column: 9)
!551 = distinct !DILexicalBlock(scope: !552, file: !472, line: 203, column: 11)
!552 = distinct !DILexicalBlock(scope: !553, file: !472, line: 199, column: 5)
!553 = distinct !DILexicalBlock(scope: !511, file: !472, line: 198, column: 7)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(name: "E_invalid_group", scope: !511, file: !472, line: 107, type: !74, isLocal: true, isDefinition: true)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(name: "E_bad_spec", scope: !511, file: !472, line: 108, type: !74, isLocal: true, isDefinition: true)
!558 = distinct !DICompileUnit(language: DW_LANG_C99, file: !559, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !560, retainedTypes: !564, splitDebugInlining: false, nameTableKind: None)
!559 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!560 = !{!561}
!561 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !559, line: 40, baseType: !7, size: 32, elements: !562)
!562 = !{!563}
!563 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!564 = !{!68, !565, !55}
!565 = !DISubprogram(name: "fputs_unlocked", scope: !79, file: !79, line: 662, type: !566, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !77)
!566 = !DISubroutineType(types: !567)
!567 = !{!76, !74, !568}
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !84, line: 49, size: 1728, elements: !570)
!570 = !{!571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !569, file: !84, line: 51, baseType: !76, size: 32)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !569, file: !84, line: 54, baseType: !72, size: 64, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !569, file: !84, line: 55, baseType: !72, size: 64, offset: 128)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !569, file: !84, line: 56, baseType: !72, size: 64, offset: 192)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !569, file: !84, line: 57, baseType: !72, size: 64, offset: 256)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !569, file: !84, line: 58, baseType: !72, size: 64, offset: 320)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !569, file: !84, line: 59, baseType: !72, size: 64, offset: 384)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !569, file: !84, line: 60, baseType: !72, size: 64, offset: 448)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !569, file: !84, line: 61, baseType: !72, size: 64, offset: 512)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !569, file: !84, line: 64, baseType: !72, size: 64, offset: 576)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !569, file: !84, line: 65, baseType: !72, size: 64, offset: 640)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !569, file: !84, line: 66, baseType: !72, size: 64, offset: 704)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !569, file: !84, line: 68, baseType: !99, size: 64, offset: 768)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !569, file: !84, line: 70, baseType: !568, size: 64, offset: 832)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !569, file: !84, line: 72, baseType: !76, size: 32, offset: 896)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !569, file: !84, line: 73, baseType: !76, size: 32, offset: 928)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !569, file: !84, line: 74, baseType: !105, size: 64, offset: 960)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !569, file: !84, line: 77, baseType: !109, size: 16, offset: 1024)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !569, file: !84, line: 78, baseType: !111, size: 8, offset: 1040)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !569, file: !84, line: 79, baseType: !113, size: 8, offset: 1048)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !569, file: !84, line: 81, baseType: !117, size: 64, offset: 1088)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !569, file: !84, line: 89, baseType: !120, size: 64, offset: 1152)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !569, file: !84, line: 91, baseType: !122, size: 64, offset: 1216)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !569, file: !84, line: 92, baseType: !125, size: 64, offset: 1280)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !569, file: !84, line: 93, baseType: !568, size: 64, offset: 1344)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !569, file: !84, line: 94, baseType: !55, size: 64, offset: 1408)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !569, file: !84, line: 95, baseType: !57, size: 64, offset: 1472)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !569, file: !84, line: 96, baseType: !76, size: 32, offset: 1536)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !569, file: !84, line: 98, baseType: !132, size: 160, offset: 1568)
!600 = distinct !DICompileUnit(language: DW_LANG_C99, file: !601, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !602, retainedTypes: !610, splitDebugInlining: false, nameTableKind: None)
!601 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!602 = !{!603}
!603 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !604, file: !51, line: 186, baseType: !7, size: 32, elements: !65)
!604 = distinct !DISubprogram(name: "x2nrealloc", scope: !51, file: !51, line: 174, type: !53, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !600, retainedNodes: !605)
!605 = !{!606, !607, !608, !609}
!606 = !DILocalVariable(name: "p", arg: 1, scope: !604, file: !51, line: 174, type: !55)
!607 = !DILocalVariable(name: "pn", arg: 2, scope: !604, file: !51, line: 174, type: !56)
!608 = !DILocalVariable(name: "s", arg: 3, scope: !604, file: !51, line: 174, type: !57)
!609 = !DILocalVariable(name: "n", scope: !604, file: !51, line: 176, type: !57)
!610 = !{!57, !256, !429, !257, !72, !221, !55, !611, !614}
!611 = !DISubprogram(name: "xcalloc", scope: !51, file: !51, line: 57, type: !612, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !77)
!612 = !DISubroutineType(types: !613)
!613 = !{!55, !59, !59}
!614 = !DISubprogram(name: "rpl_calloc", scope: !615, file: !615, line: 688, type: !612, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !77)
!615 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!616 = distinct !DICompileUnit(language: DW_LANG_C99, file: !617, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !77, retainedTypes: !618, splitDebugInlining: false, nameTableKind: None)
!617 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!618 = !{!68, !178}
!619 = distinct !DICompileUnit(language: DW_LANG_C99, file: !620, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !77, retainedTypes: !621, splitDebugInlining: false, nameTableKind: None)
!620 = !DIFile(filename: "lib/xgetgroups.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!621 = !{!622, !256}
!622 = !DISubprogram(name: "mgetgroups", scope: !205, file: !205, line: 19, type: !206, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !77)
!623 = distinct !DICompileUnit(language: DW_LANG_C99, file: !624, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !625, retainedTypes: !626, splitDebugInlining: false, nameTableKind: None)
!624 = !DIFile(filename: "lib/xstrtoul.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!625 = !{!27, !35}
!626 = !{!76, !109}
!627 = distinct !DICompileUnit(language: DW_LANG_C99, file: !628, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !625, retainedTypes: !626, splitDebugInlining: false, nameTableKind: None)
!628 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!629 = distinct !DICompileUnit(language: DW_LANG_C99, file: !630, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !77, retainedTypes: !631, splitDebugInlining: false, nameTableKind: None)
!630 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!631 = !{!55}
!632 = distinct !DICompileUnit(language: DW_LANG_C99, file: !633, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !77, retainedTypes: !634, splitDebugInlining: false, nameTableKind: None)
!633 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!634 = !{!635, !57, !647}
!635 = !DISubprogram(name: "mbrtowc", scope: !416, file: !416, line: 296, type: !636, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !77)
!636 = !DISubroutineType(types: !637)
!637 = !{!59, !172, !74, !59, !638}
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !402, line: 13, size: 64, elements: !640)
!640 = !{!641, !642}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !639, file: !402, line: 15, baseType: !76, size: 32)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !639, file: !402, line: 20, baseType: !643, size: 32, offset: 32)
!643 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !639, file: !402, line: 16, size: 32, elements: !644)
!644 = !{!645, !646}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !643, file: !402, line: 18, baseType: !7, size: 32)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !643, file: !402, line: 19, baseType: !410, size: 32)
!647 = !DISubprogram(name: "hard_locale", scope: !648, file: !648, line: 26, type: !649, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !77)
!648 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!649 = !DISubroutineType(types: !650)
!650 = !{!314, !76}
!651 = distinct !DICompileUnit(language: DW_LANG_C99, file: !652, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !77, retainedTypes: !653, splitDebugInlining: false, nameTableKind: None)
!652 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!653 = !{!654}
!654 = !DISubprogram(name: "rpl_fclose", scope: !655, file: !655, line: 672, type: !656, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !77)
!655 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!656 = !DISubroutineType(types: !657)
!657 = !{!76, !658}
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !84, line: 49, size: 1728, elements: !660)
!660 = !{!661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !659, file: !84, line: 51, baseType: !76, size: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !659, file: !84, line: 54, baseType: !72, size: 64, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !659, file: !84, line: 55, baseType: !72, size: 64, offset: 128)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !659, file: !84, line: 56, baseType: !72, size: 64, offset: 192)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !659, file: !84, line: 57, baseType: !72, size: 64, offset: 256)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !659, file: !84, line: 58, baseType: !72, size: 64, offset: 320)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !659, file: !84, line: 59, baseType: !72, size: 64, offset: 384)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !659, file: !84, line: 60, baseType: !72, size: 64, offset: 448)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !659, file: !84, line: 61, baseType: !72, size: 64, offset: 512)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !659, file: !84, line: 64, baseType: !72, size: 64, offset: 576)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !659, file: !84, line: 65, baseType: !72, size: 64, offset: 640)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !659, file: !84, line: 66, baseType: !72, size: 64, offset: 704)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !659, file: !84, line: 68, baseType: !99, size: 64, offset: 768)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !659, file: !84, line: 70, baseType: !658, size: 64, offset: 832)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !659, file: !84, line: 72, baseType: !76, size: 32, offset: 896)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !659, file: !84, line: 73, baseType: !76, size: 32, offset: 928)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !659, file: !84, line: 74, baseType: !105, size: 64, offset: 960)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !659, file: !84, line: 77, baseType: !109, size: 16, offset: 1024)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !659, file: !84, line: 78, baseType: !111, size: 8, offset: 1040)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !659, file: !84, line: 79, baseType: !113, size: 8, offset: 1048)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !659, file: !84, line: 81, baseType: !117, size: 64, offset: 1088)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !659, file: !84, line: 89, baseType: !120, size: 64, offset: 1152)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !659, file: !84, line: 91, baseType: !122, size: 64, offset: 1216)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !659, file: !84, line: 92, baseType: !125, size: 64, offset: 1280)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !659, file: !84, line: 93, baseType: !658, size: 64, offset: 1344)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !659, file: !84, line: 94, baseType: !55, size: 64, offset: 1408)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !659, file: !84, line: 95, baseType: !57, size: 64, offset: 1472)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !659, file: !84, line: 96, baseType: !76, size: 32, offset: 1536)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !659, file: !84, line: 98, baseType: !132, size: 160, offset: 1568)
!690 = distinct !DICompileUnit(language: DW_LANG_C99, file: !691, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !77, retainedTypes: !692, splitDebugInlining: false, nameTableKind: None)
!691 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!692 = !{!693}
!693 = !DISubprogram(name: "setlocale_null_r", scope: !694, file: !694, line: 64, type: !695, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !77)
!694 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!695 = !DISubroutineType(types: !696)
!696 = !{!76, !76, !72, !59}
!697 = distinct !DICompileUnit(language: DW_LANG_C99, file: !698, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !77, retainedTypes: !699, splitDebugInlining: false, nameTableKind: None)
!698 = !DIFile(filename: "lib/umaxtostr.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!699 = !{!700}
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !701, line: 102, baseType: !702)
!701 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !106, line: 73, baseType: !59)
!703 = distinct !DICompileUnit(language: DW_LANG_C99, file: !704, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !705, retainedTypes: !1092, splitDebugInlining: false, nameTableKind: None)
!704 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!705 = !{!706}
!706 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !707, line: 41, baseType: !7, size: 32, elements: !708)
!707 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!708 = !{!709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091}
!709 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!710 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!711 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!712 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!713 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!714 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!715 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!716 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!717 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!718 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!719 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!720 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!721 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!722 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!723 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!724 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!725 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!726 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!727 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!728 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!729 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!730 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!731 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!732 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!733 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!734 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!735 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!736 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!737 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!738 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!739 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!740 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!741 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!742 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!743 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!744 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!745 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!746 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!747 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!748 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!749 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!750 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!751 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!752 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!753 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!754 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!755 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!756 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!757 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!758 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!759 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!760 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!761 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!762 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!763 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!764 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!765 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!766 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!767 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!768 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!769 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!770 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!771 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!772 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!773 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!774 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!779 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!780 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!781 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!782 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!783 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!784 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!785 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!786 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!787 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!788 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!789 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!790 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!791 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!793 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!794 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!795 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!796 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!797 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!798 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!799 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!800 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!801 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!802 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!803 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!804 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!805 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!806 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!807 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!808 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!809 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!810 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!812 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!813 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!814 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!815 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!816 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!817 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!818 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!819 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!820 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!821 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!822 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!823 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!824 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!825 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!826 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!827 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!828 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!829 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!830 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!831 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!832 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!833 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!834 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!835 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!836 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!837 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!838 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!839 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!840 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!841 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!842 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!843 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!844 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!845 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!846 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!847 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!884 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!885 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!886 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!887 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!894 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!895 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!896 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!898 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!899 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!900 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!901 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!902 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!903 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!904 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!905 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!906 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!907 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!908 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!909 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!910 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!911 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!912 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!913 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!914 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!915 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!916 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!917 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!918 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!919 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!920 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!921 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!922 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!923 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!924 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!925 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!926 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!927 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!928 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!929 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!930 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!931 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!932 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!933 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!934 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!935 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!936 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!937 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!938 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!939 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!940 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!941 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!942 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!943 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!944 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!945 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!946 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!947 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!948 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!949 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!950 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!951 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!952 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!953 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!954 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!955 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!956 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!957 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!958 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!959 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!960 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!961 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!962 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!963 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!964 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!965 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!966 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!967 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!968 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!969 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!970 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!971 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!972 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!973 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!974 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!975 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!976 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!977 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!978 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!979 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!980 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!981 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!982 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!983 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!984 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!985 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!986 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!987 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!988 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!989 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!990 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!991 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!992 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!993 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!994 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!995 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!996 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!997 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!998 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!999 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!1000 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!1001 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!1002 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!1003 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!1004 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!1005 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!1006 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!1007 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!1008 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!1009 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!1010 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!1011 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!1012 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!1013 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!1014 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!1015 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!1016 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!1017 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!1018 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!1019 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!1020 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!1021 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!1022 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!1023 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!1024 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!1025 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!1026 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!1027 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!1028 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!1029 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!1030 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!1031 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!1032 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!1033 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!1034 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!1035 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!1036 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
