source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [40 x i8] c"Usage: %s [FILE]...\0A  or:  %s [OPTION]\0A\00", align 1
@.str.2 = private unnamed_addr constant [51 x i8] c"Print CRC checksum and byte counts of each FILE.\0A\0A\00", align 1
@stdout = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str.3 = private unnamed_addr constant [45 x i8] c"      --help     display this help and exit\0A\00", align 1

!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!9 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 45, baseType: !7, size: 32, elements: !22)
!21 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!22 = !{!23, !24, !25, !26, !27, !28}
!23 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0, isUnsigned: true)
!24 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2, isUnsigned: true)
!25 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5, isUnsigned: true)
!26 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4, isUnsigned: true)
!27 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3, isUnsigned: true)
!28 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1, isUnsigned: true)
!29 = !{!30, !33, !7}
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!32 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!34 = !{!35, !36}
!35 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!36 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression())
!37 = distinct !DIGlobalVariable(name: "crctab", scope: !2, file: !3, line: 112, type: !38, isLocal: true, isDefinition: true)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 16384, elements: !43)
!39 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !41, line: 74, baseType: !42)
!41 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!42 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!43 = !{!44}
!44 = !DISubrange(count: 256)
!45 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "Version", scope: !48, file: !49, line: 2, type: !30, isDefinition: true)
!48 = distinct !DICompileUnit(language: DW_LANG_C99, file: !49, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !50, globals: !51, nameTableKind: None)
!49 = !DIFile(filename: "src/version.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!50 = !{}
!51 = !{!46}
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(name: "file_name", scope: !54, file: !55, line: 46, type: !30, isLocal: true, isDefinition: true)
!54 = distinct !DICompileUnit(language: DW_LANG_C99, file: !55, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !50, globals: !56, nameTableKind: None)
!55 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!56 = !{!52, !57}
!57 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression())
!58 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !54, file: !55, line: 56, type: !45, isLocal: true, isDefinition: true)
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(name: "exit_failure", scope: !61, file: !62, line: 24, type: !64, isDefinition: true)
!61 = distinct !DICompileUnit(language: DW_LANG_C99, file: !62, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !50, globals: !63, nameTableKind: None)
!62 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!63 = !{!59}
!64 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !65)
!65 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!66 = !DIGlobalVariableExpression(var: !67, expr: !DIExpression())
!67 = distinct !DIGlobalVariable(name: "long_options", scope: !68, file: !69, line: 34, type: !71, isLocal: true, isDefinition: true)
!68 = distinct !DICompileUnit(language: DW_LANG_C99, file: !69, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !50, globals: !70, nameTableKind: None)
!69 = !DIFile(filename: "lib/long-options.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!70 = !{!66}
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 768, elements: !81)
!72 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !73)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !74, line: 50, size: 256, elements: !75)
!74 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!75 = !{!76, !77, !78, !80}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !73, file: !74, line: 52, baseType: !30, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !73, file: !74, line: 55, baseType: !65, size: 32, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !73, file: !74, line: 56, baseType: !79, size: 64, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !73, file: !74, line: 57, baseType: !65, size: 32, offset: 192)
!81 = !{!82}
!82 = !DISubrange(count: 3)
!83 = !DIGlobalVariableExpression(var: !84, expr: !DIExpression())
!84 = distinct !DIGlobalVariable(name: "program_name", scope: !85, file: !86, line: 33, type: !30, isDefinition: true)
!85 = distinct !DICompileUnit(language: DW_LANG_C99, file: !86, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !50, retainedTypes: !87, globals: !89, nameTableKind: None)
!86 = !DIFile(filename: "lib/progname.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!87 = !{!33, !88}
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!89 = !{!83}
!90 = !DIGlobalVariableExpression(var: !91, expr: !DIExpression())
!91 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !92, file: !93, line: 85, type: !154, isDefinition: true)
!92 = distinct !DICompileUnit(language: DW_LANG_C99, file: !93, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !94, retainedTypes: !115, globals: !119, nameTableKind: None)
!93 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!94 = !{!5, !95, !100}
!95 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, baseType: !7, size: 32, elements: !96)
!96 = !{!97, !98, !99}
!97 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!98 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!99 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!100 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !101, line: 46, baseType: !7, size: 32, elements: !102)
!101 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!102 = !{!103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114}
!103 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!104 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!105 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!106 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!107 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!108 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!109 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!110 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!111 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!112 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!113 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!114 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!115 = !{!65, !116, !117, !88}
!116 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !118, line: 46, baseType: !42)
!118 = !DIFile(filename: "/usr/lib/clang/12.0.1/include/stddef.h", directory: "")
!119 = !{!90, !120, !126, !138, !140, !143, !150, !152}
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !92, file: !93, line: 101, type: !122, isDefinition: true)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 320, elements: !124)
!123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!124 = !{!125}
!125 = !DISubrange(count: 10)
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !92, file: !93, line: 1052, type: !128, isDefinition: true)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !93, line: 65, size: 448, elements: !129)
!129 = !{!130, !131, !132, !136, !137}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !128, file: !93, line: 68, baseType: !5, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !128, file: !93, line: 71, baseType: !65, size: 32, offset: 32)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !128, file: !93, line: 75, baseType: !133, size: 256, offset: 64)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !134)
!134 = !{!135}
!135 = !DISubrange(count: 8)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !128, file: !93, line: 78, baseType: !30, size: 64, offset: 320)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !128, file: !93, line: 81, baseType: !30, size: 64, offset: 384)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !92, file: !93, line: 116, type: !128, isLocal: true, isDefinition: true)
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(name: "slot0", scope: !92, file: !93, line: 842, type: !142, isLocal: true, isDefinition: true)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 2048, elements: !43)
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(name: "slotvec", scope: !92, file: !93, line: 845, type: !145, isLocal: true, isDefinition: true)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !93, line: 834, size: 128, elements: !147)
!147 = !{!148, !149}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !146, file: !93, line: 836, baseType: !117, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !146, file: !93, line: 837, baseType: !88, size: 64, offset: 64)
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(name: "nslots", scope: !92, file: !93, line: 843, type: !65, isLocal: true, isDefinition: true)
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(name: "slotvec0", scope: !92, file: !93, line: 844, type: !146, isLocal: true, isDefinition: true)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 704, elements: !156)
!155 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!156 = !{!157}
!157 = !DISubrange(count: 11)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !160, file: !161, line: 26, type: !163, isDefinition: true)
!160 = distinct !DICompileUnit(language: DW_LANG_C99, file: !161, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !50, globals: !162, nameTableKind: None)
!161 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!162 = !{!158}
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 376, elements: !164)
!164 = !{!165}
!165 = !DISubrange(count: 47)
!166 = distinct !DICompileUnit(language: DW_LANG_C99, file: !167, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !168, nameTableKind: None)
!167 = !DIFile(filename: "lib/fadvise.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!168 = !{!20}
!169 = distinct !DICompileUnit(language: DW_LANG_C99, file: !170, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !50, retainedTypes: !171, nameTableKind: None)
!170 = !DIFile(filename: "lib/umaxtostr.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!171 = !{!172}
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !41, line: 102, baseType: !173)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !174, line: 73, baseType: !42)
!174 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!175 = distinct !DICompileUnit(language: DW_LANG_C99, file: !176, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !177, retainedTypes: !181, nameTableKind: None)
!176 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!177 = !{!178}
!178 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !176, line: 40, baseType: !7, size: 32, elements: !179)
!179 = !{!180}
!180 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!181 = !{!33}
!182 = distinct !DICompileUnit(language: DW_LANG_C99, file: !183, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !184, retainedTypes: !198, nameTableKind: None)
!183 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!184 = !{!185}
!185 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !187, file: !186, line: 186, baseType: !7, size: 32, elements: !196)
!186 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!187 = distinct !DISubprogram(name: "x2nrealloc", scope: !186, file: !186, line: 174, type: !188, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !182, retainedNodes: !191)
!188 = !DISubroutineType(types: !189)
!189 = !{!33, !33, !190, !117}
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!191 = !{!192, !193, !194, !195}
!192 = !DILocalVariable(name: "p", arg: 1, scope: !187, file: !186, line: 174, type: !33)
!193 = !DILocalVariable(name: "pn", arg: 2, scope: !187, file: !186, line: 174, type: !190)
!194 = !DILocalVariable(name: "s", arg: 3, scope: !187, file: !186, line: 174, type: !117)
!195 = !DILocalVariable(name: "n", scope: !187, file: !186, line: 176, type: !117)
!196 = !{!197}
!197 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!198 = !{!117, !88, !33}
!199 = distinct !DICompileUnit(language: DW_LANG_C99, file: !200, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !50, nameTableKind: None)
!200 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!201 = distinct !DICompileUnit(language: DW_LANG_C99, file: !202, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !50, retainedTypes: !181, nameTableKind: None)
!202 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!203 = distinct !DICompileUnit(language: DW_LANG_C99, file: !204, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !50, nameTableKind: None)
!204 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!205 = distinct !DICompileUnit(language: DW_LANG_C99, file: !206, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !50, retainedTypes: !181, nameTableKind: None)
!206 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!207 = distinct !DICompileUnit(language: DW_LANG_C99, file: !208, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !50, retainedTypes: !181, nameTableKind: None)
!208 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!209 = distinct !DICompileUnit(language: DW_LANG_C99, file: !210, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !50, retainedTypes: !211, nameTableKind: None)
!210 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!211 = !{!117}
!212 = distinct !DICompileUnit(language: DW_LANG_C99, file: !213, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !50, nameTableKind: None)
!213 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!214 = distinct !DICompileUnit(language: DW_LANG_C99, file: !215, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !50, nameTableKind: None)
!215 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!216 = distinct !DICompileUnit(language: DW_LANG_C99, file: !217, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !218, retainedTypes: !181, nameTableKind: None)
!217 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!218 = !{!219}
!219 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !220, line: 41, baseType: !7, size: 32, elements: !221)
!220 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!221 = !{!222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604}
!222 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!223 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!224 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!225 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!226 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!227 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!228 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!229 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!230 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!231 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!232 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!233 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!234 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!235 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!236 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!237 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!238 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!239 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!240 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!241 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!242 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!243 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!244 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!245 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!246 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!247 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!248 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!249 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!250 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!251 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!252 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!253 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!254 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!255 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!256 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!257 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!258 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!259 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!260 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!261 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!262 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!263 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!264 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!265 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!266 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!267 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!268 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!269 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!270 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!271 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!272 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!273 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!274 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!275 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!276 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!277 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!278 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!279 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!280 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!281 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!282 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!283 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!284 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!285 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!286 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!287 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!288 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!289 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!290 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!291 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!292 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!293 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!294 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!295 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!296 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!297 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!298 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!299 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!300 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!301 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!302 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!303 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!304 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!305 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!306 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!307 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!308 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!309 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!310 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!311 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!312 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!313 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!314 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!315 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!316 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!317 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!318 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!319 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!320 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!321 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!322 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!323 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!324 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!325 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!326 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!327 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!328 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!329 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!330 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!331 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!332 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!333 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!334 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!335 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!336 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!337 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!338 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!339 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!340 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!341 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!342 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!343 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!344 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!345 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!346 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!347 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!348 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!349 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!350 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!351 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!352 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!353 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!354 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!355 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!356 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!357 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!358 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!359 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!360 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!361 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!362 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!363 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!364 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!365 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!366 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!367 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!368 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!369 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!370 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!371 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!372 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!373 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!374 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!375 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!376 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!377 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!378 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!379 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!380 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!381 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!382 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!383 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!384 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!385 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!386 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!387 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!388 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!389 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!390 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!391 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!392 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!393 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!394 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!395 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!396 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!397 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!398 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!399 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!400 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!401 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!402 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!403 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!404 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!405 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!406 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!407 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!408 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!409 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!410 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!411 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!412 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!413 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!414 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!415 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!416 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!417 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!418 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!419 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!420 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!421 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!422 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!423 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!424 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!425 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!426 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!427 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!428 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!429 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!430 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!431 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!432 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!433 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!434 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!435 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!436 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!437 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!438 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!439 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!440 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!441 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!442 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!443 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!444 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!445 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!446 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!447 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!448 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!449 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!450 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!451 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!452 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!453 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!454 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!455 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!456 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!457 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!458 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!459 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!460 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!461 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!462 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!463 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!464 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!465 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!466 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!467 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!468 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!469 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!470 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!471 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!472 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!473 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!474 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!475 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!476 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!477 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!478 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!479 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!480 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!481 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!482 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!483 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!484 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!485 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!486 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!487 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!488 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!489 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!490 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!491 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!492 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!493 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!494 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!495 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!496 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!497 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!498 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!499 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!500 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!501 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!502 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!503 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!504 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!505 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!506 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!507 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!508 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!509 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!510 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!511 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!512 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!513 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!514 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!515 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!516 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!517 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!518 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!519 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!520 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!521 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!522 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!523 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!524 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!525 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!526 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!527 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!528 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!529 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!530 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!531 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!532 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!533 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!534 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!535 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!536 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!537 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!538 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!539 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!540 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!541 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!542 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!543 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!544 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!545 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!546 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!547 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!548 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!549 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!550 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!551 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!552 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!553 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!554 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!555 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!556 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!557 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!558 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!559 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!560 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!561 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!562 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!563 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!564 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!565 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!566 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!567 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!568 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!569 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!570 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!571 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!572 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!573 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!574 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!575 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!576 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!577 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!578 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!579 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!580 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!581 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!582 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!583 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!584 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!585 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!586 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!587 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!588 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!589 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!590 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!591 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!592 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!593 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!594 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!595 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!596 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!597 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!598 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!599 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!600 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!601 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!602 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!603 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!604 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!605 = distinct !DICompileUnit(language: DW_LANG_C99, file: !606, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !50, retainedTypes: !181, nameTableKind: None)
!606 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!607 = !{!"clang version 12.0.1"}
!608 = !{i32 7, !"Dwarf Version", i32 4}
!609 = !{i32 2, !"Debug Info Version", i32 3}
!610 = !{i32 1, !"wchar_size", i32 4}
!611 = !{i32 7, !"PIC Level", i32 2}
!612 = !{i32 7, !"PIE Level", i32 2}
!613 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 251, type: !614, scopeLine: 252, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !616)
!614 = !DISubroutineType(types: !615)
!615 = !{null, !65}
!616 = !{!617}
!617 = !DILocalVariable(name: "status", arg: 1, scope: !613, file: !3, line: 251, type: !65)
!618 = !DILocation(scope: !613)
!619 = !DILocation(line: 253, column: 14, scope: !620)
!620 = distinct !DILexicalBlock(scope: !613, file: !3, line: 253, column: 7)
!621 = !DILocation(line: 253, column: 7, scope: !613)
!622 = !DILocation(line: 254, column: 5, scope: !623)
!623 = distinct !DILexicalBlock(scope: !620, file: !3, line: 254, column: 5)
!624 = !{!625, !625, i64 0}
!625 = !{!"any pointer", !626, i64 0}
!626 = !{!"omnipotent char", !627, i64 0}
!627 = !{!"Simple C/C++ TBAA"}
!628 = !DILocation(line: 257, column: 7, scope: !629)
!629 = distinct !DILexicalBlock(scope: !620, file: !3, line: 256, column: 5)
!630 = !DILocation(line: 262, column: 7, scope: !629)
!631 = !DILocation(line: 266, column: 7, scope: !629)
!632 = !DILocation(line: 267, column: 7, scope: !629)
!633 = !DILocalVariable(name: "program", arg: 1, scope: !634, file: !635, line: 634, type: !30)
!634 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !635, file: !635, line: 634, type: !636, scopeLine: 635, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !638)
!635 = !DIFile(filename: "src/system.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!636 = !DISubroutineType(types: !637)
!637 = !{null, !30}
!638 = !{!633, !639, !648, !649, !651}
!639 = !DILocalVariable(name: "infomap", scope: !634, file: !635, line: 636, type: !640)
!640 = !DICompositeType(tag: DW_TAG_array_type, baseType: !641, size: 896, elements: !646)
!641 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !642)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !634, file: !635, line: 636, size: 128, elements: !643)
!643 = !{!644, !645}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !642, file: !635, line: 636, baseType: !30, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !642, file: !635, line: 636, baseType: !30, size: 64, offset: 64)
!646 = !{!647}
!647 = !DISubrange(count: 7)
!648 = !DILocalVariable(name: "node", scope: !634, file: !635, line: 646, type: !30)
!649 = !DILocalVariable(name: "map_prog", scope: !634, file: !635, line: 647, type: !650)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!651 = !DILocalVariable(name: "lc_messages", scope: !634, file: !635, line: 659, type: !30)
!652 = !DILocation(scope: !634, inlinedAt: !653)
!653 = distinct !DILocation(line: 268, column: 7, scope: !629)
!654 = !DILocation(line: 636, column: 3, scope: !634, inlinedAt: !653)
!655 = !DILocation(line: 636, column: 67, scope: !634, inlinedAt: !653)
!656 = !DILocation(line: 647, column: 36, scope: !634, inlinedAt: !653)
!657 = !DILocation(line: 649, column: 3, scope: !634, inlinedAt: !653)
!658 = !DILocation(line: 649, column: 33, scope: !634, inlinedAt: !653)
!659 = !DILocation(line: 650, column: 13, scope: !634, inlinedAt: !653)
!660 = !DILocation(line: 649, column: 20, scope: !634, inlinedAt: !653)
!661 = !{!662, !625, i64 0}
!662 = !{!"infomap", !625, i64 0, !625, i64 8}
!663 = !DILocation(line: 649, column: 10, scope: !634, inlinedAt: !653)
!664 = !DILocation(line: 649, column: 28, scope: !634, inlinedAt: !653)
!665 = distinct !{!665, !657, !659, !666}
!666 = !{!"llvm.loop.mustprogress"}
!667 = !DILocation(line: 652, column: 17, scope: !668, inlinedAt: !653)
!668 = distinct !DILexicalBlock(scope: !634, file: !635, line: 652, column: 7)
!669 = !{!662, !625, i64 8}
!670 = !DILocation(line: 652, column: 7, scope: !668, inlinedAt: !653)
!671 = !DILocation(line: 652, column: 7, scope: !634, inlinedAt: !653)
!672 = !DILocation(line: 655, column: 3, scope: !634, inlinedAt: !653)
!673 = !DILocation(line: 659, column: 29, scope: !634, inlinedAt: !653)
!674 = !DILocation(line: 660, column: 7, scope: !675, inlinedAt: !653)
!675 = distinct !DILexicalBlock(scope: !634, file: !635, line: 660, column: 7)
!676 = !DILocation(line: 660, column: 19, scope: !675, inlinedAt: !653)
!677 = !DILocation(line: 660, column: 22, scope: !675, inlinedAt: !653)
!678 = !DILocation(line: 660, column: 7, scope: !634, inlinedAt: !653)
!679 = !DILocation(line: 666, column: 7, scope: !680, inlinedAt: !653)
!680 = distinct !DILexicalBlock(scope: !675, file: !635, line: 661, column: 5)
!681 = !DILocation(line: 668, column: 5, scope: !680, inlinedAt: !653)
!682 = !DILocation(line: 669, column: 3, scope: !634, inlinedAt: !653)
!683 = !DILocation(line: 671, column: 3, scope: !634, inlinedAt: !653)
!684 = !DILocation(line: 673, column: 1, scope: !634, inlinedAt: !653)
!685 = !DILocation(line: 270, column: 3, scope: !613)
!686 = !DISubprogram(name: "dcgettext", scope: !687, file: !687, line: 51, type: !688, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!687 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!688 = !DISubroutineType(types: !689)
!689 = !{!88, !30, !30, !65}
!690 = !DISubprogram(name: "fputs_unlocked", scope: !691, file: !691, line: 667, type: !692, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!691 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!692 = !DISubroutineType(types: !693)
!693 = !{!65, !30, !694}
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !696, line: 49, size: 1728, elements: !697)
!696 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!697 = !{!698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !713, !714, !715, !716, !719, !720, !722, !726, !729, !731, !734, !737, !738, !739, !740, !741}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !695, file: !696, line: 51, baseType: !65, size: 32)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !695, file: !696, line: 54, baseType: !88, size: 64, offset: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !695, file: !696, line: 55, baseType: !88, size: 64, offset: 128)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !695, file: !696, line: 56, baseType: !88, size: 64, offset: 192)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !695, file: !696, line: 57, baseType: !88, size: 64, offset: 256)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !695, file: !696, line: 58, baseType: !88, size: 64, offset: 320)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !695, file: !696, line: 59, baseType: !88, size: 64, offset: 384)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !695, file: !696, line: 60, baseType: !88, size: 64, offset: 448)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !695, file: !696, line: 61, baseType: !88, size: 64, offset: 512)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !695, file: !696, line: 64, baseType: !88, size: 64, offset: 576)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !695, file: !696, line: 65, baseType: !88, size: 64, offset: 640)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !695, file: !696, line: 66, baseType: !88, size: 64, offset: 704)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !695, file: !696, line: 68, baseType: !711, size: 64, offset: 768)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !696, line: 36, flags: DIFlagFwdDecl)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !695, file: !696, line: 70, baseType: !694, size: 64, offset: 832)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !695, file: !696, line: 72, baseType: !65, size: 32, offset: 896)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !695, file: !696, line: 73, baseType: !65, size: 32, offset: 928)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !695, file: !696, line: 74, baseType: !717, size: 64, offset: 960)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !174, line: 152, baseType: !718)
!718 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !695, file: !696, line: 77, baseType: !116, size: 16, offset: 1024)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !695, file: !696, line: 78, baseType: !721, size: 8, offset: 1040)
!721 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !695, file: !696, line: 79, baseType: !723, size: 8, offset: 1048)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 8, elements: !724)
!724 = !{!725}
!725 = !DISubrange(count: 1)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !695, file: !696, line: 81, baseType: !727, size: 64, offset: 1088)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !696, line: 43, baseType: null)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !695, file: !696, line: 89, baseType: !730, size: 64, offset: 1152)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !174, line: 153, baseType: !718)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !695, file: !696, line: 91, baseType: !732, size: 64, offset: 1216)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !696, line: 37, flags: DIFlagFwdDecl)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !695, file: !696, line: 92, baseType: !735, size: 64, offset: 1280)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !696, line: 38, flags: DIFlagFwdDecl)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !695, file: !696, line: 93, baseType: !694, size: 64, offset: 1344)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !695, file: !696, line: 94, baseType: !33, size: 64, offset: 1408)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !695, file: !696, line: 95, baseType: !117, size: 64, offset: 1472)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !695, file: !696, line: 96, baseType: !65, size: 32, offset: 1536)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !695, file: !696, line: 98, baseType: !742, size: 160, offset: 1568)
!742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 160, elements: !743)
!743 = !{!744}
!744 = !DISubrange(count: 20)
!745 = !DISubprogram(name: "setlocale", scope: !746, file: !746, line: 122, type: !747, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!746 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!747 = !DISubroutineType(types: !748)
!748 = !{!88, !65, !30}
!749 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 274, type: !750, scopeLine: 275, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !753)
!750 = !DISubroutineType(types: !751)
!751 = !{!65, !65, !752}
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!753 = !{!754, !755, !756, !757}
!754 = !DILocalVariable(name: "argc", arg: 1, scope: !749, file: !3, line: 274, type: !65)
!755 = !DILocalVariable(name: "argv", arg: 2, scope: !749, file: !3, line: 274, type: !752)
!756 = !DILocalVariable(name: "i", scope: !749, file: !3, line: 276, type: !65)
!757 = !DILocalVariable(name: "ok", scope: !749, file: !3, line: 277, type: !45)
!758 = !DILocation(scope: !749)
!759 = !DILocation(line: 280, column: 21, scope: !749)
!760 = !DILocation(line: 280, column: 3, scope: !749)
!761 = !DILocation(line: 281, column: 3, scope: !749)
!762 = !DILocation(line: 282, column: 3, scope: !749)
!763 = !DILocation(line: 283, column: 3, scope: !749)
!764 = !DILocation(line: 285, column: 3, scope: !749)
!765 = !DILocation(line: 289, column: 12, scope: !749)
!766 = !DILocation(line: 289, column: 3, scope: !749)
!767 = !DILocation(line: 291, column: 71, scope: !749)
!768 = !DILocation(line: 291, column: 3, scope: !749)
!769 = !DILocation(line: 294, column: 19, scope: !749)
!770 = !DILocation(line: 296, column: 7, scope: !771)
!771 = distinct !DILexicalBlock(scope: !749, file: !3, line: 296, column: 7)
!772 = !{!773, !773, i64 0}
!773 = !{!"int", !626, i64 0}
!774 = !DILocation(line: 296, column: 14, scope: !771)
!775 = !DILocation(line: 296, column: 7, scope: !749)
!776 = !DILocation(line: 301, column: 26, scope: !777)
!777 = distinct !DILexicalBlock(scope: !778, file: !3, line: 301, column: 7)
!778 = distinct !DILexicalBlock(scope: !779, file: !3, line: 301, column: 7)
!779 = distinct !DILexicalBlock(scope: !771, file: !3, line: 299, column: 5)
!780 = !DILocation(line: 301, column: 7, scope: !778)
!781 = !DILocation(line: 297, column: 10, scope: !771)
!782 = !DILocation(line: 297, column: 8, scope: !771)
!783 = !DILocation(line: 297, column: 5, scope: !771)
!784 = !DILocation(line: 302, column: 22, scope: !777)
!785 = !DILocation(line: 302, column: 15, scope: !777)
!786 = !DILocation(line: 302, column: 12, scope: !777)
!787 = !DILocation(line: 301, column: 35, scope: !777)
!788 = distinct !{!788, !780, !789, !666}
!789 = !DILocation(line: 302, column: 35, scope: !778)
!790 = !DILocation(line: 305, column: 7, scope: !791)
!791 = distinct !DILexicalBlock(scope: !749, file: !3, line: 305, column: 7)
!792 = !DILocation(line: 305, column: 23, scope: !791)
!793 = !DILocation(line: 305, column: 34, scope: !791)
!794 = !DILocation(line: 305, column: 26, scope: !791)
!795 = !DILocation(line: 305, column: 41, scope: !791)
!796 = !DILocation(line: 305, column: 7, scope: !749)
!797 = !DILocation(line: 306, column: 5, scope: !791)
!798 = !DILocation(line: 307, column: 10, scope: !749)
!799 = !DILocation(line: 307, column: 3, scope: !749)
!800 = !DISubprogram(name: "bindtextdomain", scope: !687, file: !687, line: 86, type: !801, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!801 = !DISubroutineType(types: !802)
!802 = !{!88, !30, !30}
!803 = !DISubprogram(name: "textdomain", scope: !687, file: !687, line: 82, type: !804, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!804 = !DISubroutineType(types: !805)
!805 = !{!88, !30}
!806 = !DISubprogram(name: "atexit", scope: !807, file: !807, line: 595, type: !808, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!807 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!808 = !DISubroutineType(types: !809)
!809 = !{!65, !810}
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DISubroutineType(types: !812)
!812 = !{null}
!813 = !DISubprogram(name: "setvbuf", scope: !691, file: !691, line: 308, type: !814, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!814 = !DISubroutineType(types: !815)
!815 = !{!65, !694, !88, !65, !42}
!816 = distinct !DISubprogram(name: "cksum", scope: !3, file: !3, line: 177, type: !817, scopeLine: 178, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !819)
!817 = !DISubroutineType(types: !818)
!818 = !{!45, !30, !45}
!819 = !{!820, !821, !822, !827, !828, !829, !830, !834, !838, !839}
!820 = !DILocalVariable(name: "file", arg: 1, scope: !816, file: !3, line: 177, type: !30)
!821 = !DILocalVariable(name: "print_name", arg: 2, scope: !816, file: !3, line: 177, type: !45)
!822 = !DILocalVariable(name: "buf", scope: !816, file: !3, line: 179, type: !823)
!823 = !DICompositeType(tag: DW_TAG_array_type, baseType: !824, size: 524288, elements: !825)
!824 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!825 = !{!826}
!826 = !DISubrange(count: 65536)
!827 = !DILocalVariable(name: "crc", scope: !816, file: !3, line: 180, type: !40)
!828 = !DILocalVariable(name: "length", scope: !816, file: !3, line: 181, type: !172)
!829 = !DILocalVariable(name: "bytes_read", scope: !816, file: !3, line: 182, type: !117)
!830 = !DILocalVariable(name: "fp", scope: !816, file: !3, line: 183, type: !831)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !833, line: 7, baseType: !695)
!833 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "")
!834 = !DILocalVariable(name: "length_buf", scope: !816, file: !3, line: 184, type: !835)
!835 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 168, elements: !836)
!836 = !{!837}
!837 = !DISubrange(count: 21)
!838 = !DILocalVariable(name: "hp", scope: !816, file: !3, line: 185, type: !30)
!839 = !DILocalVariable(name: "cp", scope: !840, file: !3, line: 207, type: !841)
!840 = distinct !DILexicalBlock(scope: !816, file: !3, line: 206, column: 5)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!842 = !DILocation(scope: !816)
!843 = !DILocation(line: 179, column: 3, scope: !816)
!844 = !DILocation(line: 179, column: 17, scope: !816)
!845 = !DILocation(line: 184, column: 3, scope: !816)
!846 = !DILocation(line: 184, column: 8, scope: !816)
!847 = !DILocation(line: 187, column: 7, scope: !848)
!848 = distinct !DILexicalBlock(scope: !816, file: !3, line: 187, column: 7)
!849 = !DILocation(line: 187, column: 7, scope: !816)
!850 = !DILocation(line: 189, column: 12, scope: !851)
!851 = distinct !DILexicalBlock(scope: !848, file: !3, line: 188, column: 5)
!852 = !DILocation(line: 190, column: 23, scope: !851)
!853 = !DILocation(line: 192, column: 5, scope: !851)
!854 = !DILocation(line: 195, column: 12, scope: !855)
!855 = distinct !DILexicalBlock(scope: !848, file: !3, line: 194, column: 5)
!856 = !DILocation(line: 196, column: 14, scope: !857)
!857 = distinct !DILexicalBlock(scope: !855, file: !3, line: 196, column: 11)
!858 = !DILocation(line: 196, column: 11, scope: !855)
!859 = !DILocation(line: 198, column: 21, scope: !860)
!860 = distinct !DILexicalBlock(scope: !857, file: !3, line: 197, column: 9)
!861 = !DILocation(line: 198, column: 34, scope: !860)
!862 = !DILocation(line: 198, column: 11, scope: !860)
!863 = !DILocation(line: 199, column: 11, scope: !860)
!864 = !DILocation(scope: !848)
!865 = !DILocation(line: 203, column: 3, scope: !816)
!866 = !DILocation(line: 205, column: 3, scope: !816)
!867 = !DILocation(line: 180, column: 17, scope: !816)
!868 = !DILocation(line: 205, column: 24, scope: !816)
!869 = !DILocation(line: 205, column: 52, scope: !816)
!870 = !DILocation(line: 137, column: 10, scope: !871, inlinedAt: !877)
!871 = distinct !DISubprogram(name: "ferror_unlocked", scope: !872, file: !872, line: 135, type: !873, scopeLine: 136, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !875)
!872 = !DIFile(filename: "/usr/include/bits/stdio.h", directory: "")
!873 = !DISubroutineType(types: !874)
!874 = !{!65, !831}
!875 = !{!876}
!876 = !DILocalVariable(name: "__stream", arg: 1, scope: !871, file: !872, line: 135, type: !831)
!877 = distinct !DILocation(line: 218, column: 7, scope: !878)
!878 = distinct !DILexicalBlock(scope: !816, file: !3, line: 218, column: 7)
!879 = !{!880, !773, i64 0}
!880 = !{!"_IO_FILE", !773, i64 0, !625, i64 8, !625, i64 16, !625, i64 24, !625, i64 32, !625, i64 40, !625, i64 48, !625, i64 56, !625, i64 64, !625, i64 72, !625, i64 80, !625, i64 88, !625, i64 96, !625, i64 104, !773, i64 112, !773, i64 116, !881, i64 120, !882, i64 128, !626, i64 130, !626, i64 131, !625, i64 136, !881, i64 144, !625, i64 152, !625, i64 160, !625, i64 168, !625, i64 176, !881, i64 184, !773, i64 192, !626, i64 196}
!881 = !{!"long", !626, i64 0}
!882 = !{!"short", !626, i64 0}
!883 = !DILocation(scope: !840)
!884 = !DILocation(line: 209, column: 18, scope: !885)
!885 = distinct !DILexicalBlock(scope: !840, file: !3, line: 209, column: 11)
!886 = !DILocation(line: 209, column: 31, scope: !885)
!887 = !DILocation(line: 209, column: 11, scope: !840)
!888 = !DILocation(line: 212, column: 7, scope: !840)
!889 = !DILocation(line: 212, column: 24, scope: !840)
!890 = !DILocation(line: 213, column: 20, scope: !840)
!891 = !DILocation(line: 213, column: 41, scope: !840)
!892 = !DILocation(line: 213, column: 50, scope: !840)
!893 = !{!626, !626, i64 0}
!894 = !DILocation(line: 213, column: 57, scope: !840)
!895 = !DILocation(line: 213, column: 28, scope: !840)
!896 = !{!881, !881, i64 0}
!897 = !DILocation(line: 213, column: 26, scope: !840)
!898 = !DILocation(line: 210, column: 9, scope: !885)
!899 = !DILocation(line: 213, column: 53, scope: !840)
!900 = distinct !{!900, !888, !901, !666}
!901 = !DILocation(line: 213, column: 63, scope: !840)
!902 = !DILocalVariable(name: "__stream", arg: 1, scope: !903, file: !872, line: 128, type: !831)
!903 = distinct !DISubprogram(name: "feof_unlocked", scope: !872, file: !872, line: 128, type: !873, scopeLine: 129, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !904)
!904 = !{!902}
!905 = !DILocation(scope: !903, inlinedAt: !906)
!906 = distinct !DILocation(line: 214, column: 11, scope: !907)
!907 = distinct !DILexicalBlock(scope: !840, file: !3, line: 214, column: 11)
!908 = !DILocation(line: 130, column: 10, scope: !903, inlinedAt: !906)
!909 = !DILocation(line: 214, column: 11, scope: !907)
!910 = distinct !{!910, !866, !911, !666}
!911 = !DILocation(line: 216, column: 5, scope: !816)
!912 = !DILocation(scope: !871, inlinedAt: !877)
!913 = !DILocation(line: 218, column: 7, scope: !878)
!914 = !DILocation(line: 218, column: 7, scope: !816)
!915 = !DILocation(line: 220, column: 17, scope: !916)
!916 = distinct !DILexicalBlock(scope: !878, file: !3, line: 219, column: 5)
!917 = !DILocation(line: 220, column: 30, scope: !916)
!918 = !DILocation(line: 220, column: 7, scope: !916)
!919 = !DILocation(line: 221, column: 12, scope: !920)
!920 = distinct !DILexicalBlock(scope: !916, file: !3, line: 221, column: 11)
!921 = !DILocation(line: 221, column: 11, scope: !916)
!922 = !DILocation(line: 222, column: 9, scope: !920)
!923 = !DILocation(line: 226, column: 8, scope: !924)
!924 = distinct !DILexicalBlock(scope: !816, file: !3, line: 226, column: 7)
!925 = !DILocation(line: 226, column: 26, scope: !924)
!926 = !DILocation(line: 226, column: 29, scope: !924)
!927 = !DILocation(line: 226, column: 41, scope: !924)
!928 = !DILocation(line: 226, column: 7, scope: !816)
!929 = !DILocation(line: 228, column: 17, scope: !930)
!930 = distinct !DILexicalBlock(scope: !924, file: !3, line: 227, column: 5)
!931 = !DILocation(line: 228, column: 30, scope: !930)
!932 = !DILocation(line: 228, column: 7, scope: !930)
!933 = !DILocation(line: 229, column: 7, scope: !930)
!934 = !DILocation(line: 232, column: 8, scope: !816)
!935 = !DILocation(line: 234, column: 3, scope: !936)
!936 = distinct !DILexicalBlock(scope: !816, file: !3, line: 234, column: 3)
!937 = !DILocation(line: 235, column: 16, scope: !938)
!938 = distinct !DILexicalBlock(scope: !936, file: !3, line: 234, column: 3)
!939 = !DILocation(line: 235, column: 37, scope: !938)
!940 = !DILocation(line: 235, column: 44, scope: !938)
!941 = !DILocation(line: 235, column: 54, scope: !938)
!942 = !DILocation(line: 235, column: 24, scope: !938)
!943 = !DILocation(line: 235, column: 22, scope: !938)
!944 = !DILocation(line: 234, column: 25, scope: !938)
!945 = distinct !{!945, !935, !946, !666}
!946 = !DILocation(line: 235, column: 60, scope: !936)
!947 = !DILocation(scope: !948)
!948 = distinct !DILexicalBlock(scope: !816, file: !3, line: 239, column: 7)
!949 = !DILocation(line: 239, column: 7, scope: !816)
!950 = !DILocation(line: 240, column: 5, scope: !948)
!951 = !DILocation(line: 242, column: 5, scope: !948)
!952 = !DILocation(line: 244, column: 7, scope: !953)
!953 = distinct !DILexicalBlock(scope: !816, file: !3, line: 244, column: 7)
!954 = !DILocation(scope: !871, inlinedAt: !955)
!955 = distinct !DILocation(line: 244, column: 7, scope: !953)
!956 = !DILocation(line: 137, column: 10, scope: !871, inlinedAt: !955)
!957 = !DILocation(line: 244, column: 7, scope: !816)
!958 = !DILocation(line: 245, column: 5, scope: !953)
!959 = !DILocation(line: 248, column: 1, scope: !816)
!960 = !DISubprogram(name: "error", scope: !961, file: !961, line: 52, type: !962, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!961 = !DIFile(filename: "./lib/error.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!962 = !DISubroutineType(types: !963)
!963 = !{null, !65, !65, !30, null}
!964 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !55, file: !55, line: 51, type: !636, scopeLine: 52, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !54, retainedNodes: !965)
!965 = !{!966}
!966 = !DILocalVariable(name: "file", arg: 1, scope: !964, file: !55, line: 51, type: !30)
!967 = !DILocation(scope: !964)
!968 = !DILocation(line: 53, column: 13, scope: !964)
!969 = !DILocation(line: 54, column: 1, scope: !964)
!970 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !55, file: !55, line: 88, type: !971, scopeLine: 89, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !54, retainedNodes: !973)
!971 = !DISubroutineType(types: !972)
!972 = !{null, !45}
!973 = !{!974}
!974 = !DILocalVariable(name: "ignore", arg: 1, scope: !970, file: !55, line: 88, type: !45)
!975 = !DILocation(scope: !970)
!976 = !DILocation(line: 90, column: 16, scope: !970)
!977 = !{!978, !978, i64 0}
!978 = !{!"_Bool", !626, i64 0}
!979 = !DILocation(line: 91, column: 1, scope: !970)
!980 = distinct !DISubprogram(name: "close_stdout", scope: !55, file: !55, line: 117, type: !811, scopeLine: 118, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !54, retainedNodes: !981)
!981 = !{!982}
!982 = !DILocalVariable(name: "write_error", scope: !983, file: !55, line: 122, type: !30)
!983 = distinct !DILexicalBlock(scope: !984, file: !55, line: 121, column: 5)
!984 = distinct !DILexicalBlock(scope: !980, file: !55, line: 119, column: 7)
!985 = !DILocation(line: 119, column: 21, scope: !984)
!986 = !DILocation(line: 119, column: 7, scope: !984)
!987 = !DILocation(line: 119, column: 29, scope: !984)
!988 = !DILocation(line: 120, column: 7, scope: !984)
!989 = !DILocation(line: 120, column: 12, scope: !984)
!990 = !{i8 0, i8 2}
!991 = !DILocation(line: 120, column: 25, scope: !984)
!992 = !DILocation(line: 120, column: 28, scope: !984)
!993 = !DILocation(line: 120, column: 34, scope: !984)
!994 = !DILocation(line: 119, column: 7, scope: !980)
!995 = !DILocation(line: 122, column: 33, scope: !983)
!996 = !DILocation(scope: !983)
!997 = !DILocation(line: 123, column: 11, scope: !998)
!998 = distinct !DILexicalBlock(scope: !983, file: !55, line: 123, column: 11)
!999 = !DILocation(scope: !998)
!1000 = !DILocation(line: 123, column: 11, scope: !983)
!1001 = !DILocation(line: 124, column: 36, scope: !998)
!1002 = !DILocation(line: 124, column: 9, scope: !998)
!1003 = !DILocation(line: 127, column: 9, scope: !998)
!1004 = !DILocation(line: 129, column: 14, scope: !983)
!1005 = !DILocation(line: 129, column: 7, scope: !983)
!1006 = !DILocation(line: 134, column: 42, scope: !1007)
!1007 = distinct !DILexicalBlock(scope: !980, file: !55, line: 134, column: 7)
!1008 = !DILocation(line: 134, column: 28, scope: !1007)
!1009 = !DILocation(line: 134, column: 50, scope: !1007)
!1010 = !DILocation(line: 134, column: 7, scope: !980)
!1011 = !DILocation(line: 135, column: 12, scope: !1007)
!1012 = !DILocation(line: 135, column: 5, scope: !1007)
!1013 = !DILocation(line: 136, column: 1, scope: !980)
!1014 = distinct !DISubprogram(name: "fdadvise", scope: !167, file: !167, line: 31, type: !1015, scopeLine: 32, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !166, retainedNodes: !1019)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{null, !65, !1017, !1017, !1018}
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !691, line: 63, baseType: !717)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "fadvice_t", file: !21, line: 52, baseType: !20)
!1019 = !{!1020, !1021, !1022, !1023, !1024}
!1020 = !DILocalVariable(name: "fd", arg: 1, scope: !1014, file: !167, line: 31, type: !65)
!1021 = !DILocalVariable(name: "offset", arg: 2, scope: !1014, file: !167, line: 31, type: !1017)
!1022 = !DILocalVariable(name: "len", arg: 3, scope: !1014, file: !167, line: 31, type: !1017)
!1023 = !DILocalVariable(name: "advice", arg: 4, scope: !1014, file: !167, line: 31, type: !1018)
!1024 = !DILocalVariable(name: "__x", scope: !1025, file: !167, line: 34, type: !65)
!1025 = distinct !DILexicalBlock(scope: !1014, file: !167, line: 34, column: 3)
!1026 = !DILocation(scope: !1014)
!1027 = !DILocation(line: 34, column: 3, scope: !1025)
!1028 = !DILocation(scope: !1025)
!1029 = !DILocation(line: 36, column: 1, scope: !1014)
!1030 = !DISubprogram(name: "posix_fadvise", scope: !1031, file: !1031, line: 288, type: !1032, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!1031 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!65, !65, !718, !718, !65}
!1034 = distinct !DISubprogram(name: "fadvise", scope: !167, file: !167, line: 39, type: !1035, scopeLine: 40, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !166, retainedNodes: !1071)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{null, !1037, !1018}
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !833, line: 7, baseType: !1039)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !696, line: 49, size: 1728, elements: !1040)
!1040 = !{!1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1039, file: !696, line: 51, baseType: !65, size: 32)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1039, file: !696, line: 54, baseType: !88, size: 64, offset: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1039, file: !696, line: 55, baseType: !88, size: 64, offset: 128)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1039, file: !696, line: 56, baseType: !88, size: 64, offset: 192)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1039, file: !696, line: 57, baseType: !88, size: 64, offset: 256)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1039, file: !696, line: 58, baseType: !88, size: 64, offset: 320)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1039, file: !696, line: 59, baseType: !88, size: 64, offset: 384)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1039, file: !696, line: 60, baseType: !88, size: 64, offset: 448)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1039, file: !696, line: 61, baseType: !88, size: 64, offset: 512)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1039, file: !696, line: 64, baseType: !88, size: 64, offset: 576)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1039, file: !696, line: 65, baseType: !88, size: 64, offset: 640)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1039, file: !696, line: 66, baseType: !88, size: 64, offset: 704)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1039, file: !696, line: 68, baseType: !711, size: 64, offset: 768)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1039, file: !696, line: 70, baseType: !1055, size: 64, offset: 832)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1039, file: !696, line: 72, baseType: !65, size: 32, offset: 896)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1039, file: !696, line: 73, baseType: !65, size: 32, offset: 928)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1039, file: !696, line: 74, baseType: !717, size: 64, offset: 960)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1039, file: !696, line: 77, baseType: !116, size: 16, offset: 1024)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1039, file: !696, line: 78, baseType: !721, size: 8, offset: 1040)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1039, file: !696, line: 79, baseType: !723, size: 8, offset: 1048)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1039, file: !696, line: 81, baseType: !727, size: 64, offset: 1088)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1039, file: !696, line: 89, baseType: !730, size: 64, offset: 1152)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1039, file: !696, line: 91, baseType: !732, size: 64, offset: 1216)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1039, file: !696, line: 92, baseType: !735, size: 64, offset: 1280)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1039, file: !696, line: 93, baseType: !1055, size: 64, offset: 1344)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1039, file: !696, line: 94, baseType: !33, size: 64, offset: 1408)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1039, file: !696, line: 95, baseType: !117, size: 64, offset: 1472)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1039, file: !696, line: 96, baseType: !65, size: 32, offset: 1536)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1039, file: !696, line: 98, baseType: !742, size: 160, offset: 1568)
!1071 = !{!1072, !1073}
!1072 = !DILocalVariable(name: "fp", arg: 1, scope: !1034, file: !167, line: 39, type: !1037)
!1073 = !DILocalVariable(name: "advice", arg: 2, scope: !1034, file: !167, line: 39, type: !1018)
!1074 = !DILocation(scope: !1034)
!1075 = !DILocation(line: 41, column: 7, scope: !1076)
!1076 = distinct !DILexicalBlock(scope: !1034, file: !167, line: 41, column: 7)
!1077 = !DILocation(line: 41, column: 7, scope: !1034)
!1078 = !DILocation(line: 42, column: 15, scope: !1076)
!1079 = !DILocation(scope: !1014, inlinedAt: !1080)
!1080 = distinct !DILocation(line: 42, column: 5, scope: !1076)
!1081 = !DILocation(line: 34, column: 3, scope: !1025, inlinedAt: !1080)
!1082 = !DILocation(scope: !1025, inlinedAt: !1080)
!1083 = !DILocation(line: 42, column: 5, scope: !1076)
!1084 = !DILocation(line: 43, column: 1, scope: !1034)
!1085 = !DISubprogram(name: "fileno", scope: !691, file: !691, line: 785, type: !1086, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!1086 = !DISubroutineType(types: !1087)
!1087 = !{!65, !1055}
!1088 = distinct !DISubprogram(name: "umaxtostr", scope: !1089, file: !1089, line: 36, type: !1090, scopeLine: 37, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !169, retainedNodes: !1092)
!1089 = !DIFile(filename: "./lib/anytostr.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1090 = !DISubroutineType(types: !1091)
!1091 = !{!88, !172, !88}
!1092 = !{!1093, !1094, !1095}
!1093 = !DILocalVariable(name: "i", arg: 1, scope: !1088, file: !1089, line: 36, type: !172)
!1094 = !DILocalVariable(name: "buf", arg: 2, scope: !1088, file: !1089, line: 36, type: !88)
!1095 = !DILocalVariable(name: "p", scope: !1088, file: !1089, line: 38, type: !88)
!1096 = !DILocation(scope: !1088)
!1097 = !DILocation(line: 38, column: 17, scope: !1088)
!1098 = !DILocation(line: 39, column: 6, scope: !1088)
!1099 = !DILocation(line: 52, column: 24, scope: !1100)
!1100 = distinct !DILexicalBlock(scope: !1101, file: !1089, line: 50, column: 5)
!1101 = distinct !DILexicalBlock(scope: !1088, file: !1089, line: 41, column: 7)
!1102 = !DILocation(line: 52, column: 16, scope: !1100)
!1103 = !DILocation(line: 52, column: 10, scope: !1100)
!1104 = !DILocation(line: 52, column: 14, scope: !1100)
!1105 = !DILocation(line: 53, column: 17, scope: !1100)
!1106 = !DILocation(line: 53, column: 24, scope: !1100)
!1107 = !DILocation(line: 52, column: 9, scope: !1100)
!1108 = distinct !{!1108, !1109, !1110, !666}
!1109 = !DILocation(line: 51, column: 7, scope: !1100)
!1110 = !DILocation(line: 53, column: 28, scope: !1100)
!1111 = !DILocation(line: 56, column: 3, scope: !1088)
!1112 = distinct !DISubprogram(name: "parse_long_options", scope: !69, file: !69, line: 45, type: !1113, scopeLine: 52, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !68, retainedNodes: !1116)
!1113 = !DISubroutineType(types: !1114)
!1114 = !{null, !65, !752, !30, !30, !30, !1115, null}
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!1116 = !{!1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125}
!1117 = !DILocalVariable(name: "argc", arg: 1, scope: !1112, file: !69, line: 45, type: !65)
!1118 = !DILocalVariable(name: "argv", arg: 2, scope: !1112, file: !69, line: 46, type: !752)
!1119 = !DILocalVariable(name: "command_name", arg: 3, scope: !1112, file: !69, line: 47, type: !30)
!1120 = !DILocalVariable(name: "package", arg: 4, scope: !1112, file: !69, line: 48, type: !30)
!1121 = !DILocalVariable(name: "version", arg: 5, scope: !1112, file: !69, line: 49, type: !30)
!1122 = !DILocalVariable(name: "usage_func", arg: 6, scope: !1112, file: !69, line: 50, type: !1115)
!1123 = !DILocalVariable(name: "c", scope: !1112, file: !69, line: 53, type: !65)
!1124 = !DILocalVariable(name: "saved_opterr", scope: !1112, file: !69, line: 54, type: !65)
!1125 = !DILocalVariable(name: "authors", scope: !1126, file: !69, line: 72, type: !1130)
!1126 = distinct !DILexicalBlock(scope: !1127, file: !69, line: 71, column: 11)
!1127 = distinct !DILexicalBlock(scope: !1128, file: !69, line: 65, column: 9)
!1128 = distinct !DILexicalBlock(scope: !1129, file: !69, line: 63, column: 5)
!1129 = distinct !DILexicalBlock(scope: !1112, file: !69, line: 61, column: 7)
!1130 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !691, line: 52, baseType: !1131)
!1131 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !1132, line: 32, baseType: !1133)
!1132 = !DIFile(filename: "/usr/lib/clang/12.0.1/include/stdarg.h", directory: "")
!1133 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !69, baseType: !1134)
!1134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1135, size: 192, elements: !724)
!1135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !1136)
!1136 = !{!1137, !1138, !1139, !1140}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !1135, file: !69, line: 72, baseType: !7, size: 32)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !1135, file: !69, line: 72, baseType: !7, size: 32, offset: 32)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !1135, file: !69, line: 72, baseType: !33, size: 64, offset: 64)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !1135, file: !69, line: 72, baseType: !33, size: 64, offset: 128)
!1141 = !DILocation(scope: !1112)
!1142 = !DILocation(line: 56, column: 18, scope: !1112)
!1143 = !DILocation(line: 59, column: 10, scope: !1112)
!1144 = !DILocation(line: 61, column: 12, scope: !1129)
!1145 = !DILocation(line: 62, column: 7, scope: !1129)
!1146 = !DILocation(line: 62, column: 15, scope: !1129)
!1147 = !DILocation(line: 61, column: 7, scope: !1112)
!1148 = !DILocation(line: 67, column: 11, scope: !1127)
!1149 = !DILocation(line: 68, column: 11, scope: !1127)
!1150 = !DILocation(line: 72, column: 13, scope: !1126)
!1151 = !DILocation(line: 72, column: 21, scope: !1126)
!1152 = !DILocation(line: 73, column: 13, scope: !1126)
!1153 = !DILocation(line: 74, column: 29, scope: !1126)
!1154 = !DILocation(line: 74, column: 13, scope: !1126)
!1155 = !DILocation(line: 75, column: 13, scope: !1126)
!1156 = !DILocation(line: 85, column: 10, scope: !1112)
!1157 = !DILocation(line: 89, column: 10, scope: !1112)
!1158 = !DILocation(line: 90, column: 1, scope: !1112)
!1159 = !DISubprogram(name: "getopt_long", scope: !74, file: !74, line: 66, type: !1160, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!1160 = !DISubroutineType(types: !1161)
!1161 = !{!65, !65, !1162, !30, !1164, !79}
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64)
!1163 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !88)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!1165 = distinct !DISubprogram(name: "parse_gnu_standard_options_only", scope: !69, file: !69, line: 98, type: !1166, scopeLine: 106, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !68, retainedNodes: !1168)
!1166 = !DISubroutineType(types: !1167)
!1167 = !{null, !65, !752, !30, !30, !30, !45, !1115, null}
!1168 = !{!1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179}
!1169 = !DILocalVariable(name: "argc", arg: 1, scope: !1165, file: !69, line: 98, type: !65)
!1170 = !DILocalVariable(name: "argv", arg: 2, scope: !1165, file: !69, line: 99, type: !752)
!1171 = !DILocalVariable(name: "command_name", arg: 3, scope: !1165, file: !69, line: 100, type: !30)
!1172 = !DILocalVariable(name: "package", arg: 4, scope: !1165, file: !69, line: 101, type: !30)
!1173 = !DILocalVariable(name: "version", arg: 5, scope: !1165, file: !69, line: 102, type: !30)
!1174 = !DILocalVariable(name: "scan_all", arg: 6, scope: !1165, file: !69, line: 103, type: !45)
!1175 = !DILocalVariable(name: "usage_func", arg: 7, scope: !1165, file: !69, line: 104, type: !1115)
!1176 = !DILocalVariable(name: "c", scope: !1165, file: !69, line: 107, type: !65)
!1177 = !DILocalVariable(name: "saved_opterr", scope: !1165, file: !69, line: 108, type: !65)
!1178 = !DILocalVariable(name: "optstring", scope: !1165, file: !69, line: 113, type: !30)
!1179 = !DILocalVariable(name: "authors", scope: !1180, file: !69, line: 125, type: !1130)
!1180 = distinct !DILexicalBlock(scope: !1181, file: !69, line: 124, column: 11)
!1181 = distinct !DILexicalBlock(scope: !1182, file: !69, line: 118, column: 9)
!1182 = distinct !DILexicalBlock(scope: !1183, file: !69, line: 116, column: 5)
!1183 = distinct !DILexicalBlock(scope: !1165, file: !69, line: 115, column: 7)
!1184 = !DILocation(scope: !1165)
!1185 = !DILocation(line: 108, column: 22, scope: !1165)
!1186 = !DILocation(line: 111, column: 10, scope: !1165)
!1187 = !DILocation(line: 113, column: 27, scope: !1165)
!1188 = !DILocation(line: 115, column: 12, scope: !1183)
!1189 = !DILocation(line: 115, column: 7, scope: !1165)
!1190 = !DILocation(line: 125, column: 13, scope: !1180)
!1191 = !DILocation(line: 125, column: 21, scope: !1180)
!1192 = !DILocation(line: 126, column: 13, scope: !1180)
!1193 = !DILocation(line: 127, column: 29, scope: !1180)
!1194 = !DILocation(line: 127, column: 13, scope: !1180)
!1195 = !DILocation(line: 128, column: 13, scope: !1180)
!1196 = !DILocation(line: 132, column: 26, scope: !1181)
!1197 = !DILocation(line: 133, column: 11, scope: !1181)
!1198 = !DILocation(scope: !1181)
!1199 = !DILocation(line: 138, column: 10, scope: !1165)
!1200 = !DILocation(line: 139, column: 1, scope: !1165)
