source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [40 x i8] c"Usage: %s [FILE]...\0A  or:  %s [OPTION]\0A\00", align 1
@.str.2 = private unnamed_addr constant [51 x i8] c"Print CRC checksum and byte counts of each FILE.\0A\0A\00", align 1
@stdout = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str.3 = private unnamed_addr constant [45 x i8] c"      --help     display this help and exit\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 110, type: !47, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !29, globals: !34)
!3 = !DIFile(filename: "src/cksum.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!4 = !{!5, !20}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!9 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 45, baseType: !7, size: 32, elements: !22)
!21 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!22 = !{!23, !24, !25, !26, !27, !28}
!23 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0, isUnsigned: true)
!24 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2, isUnsigned: true)
!25 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5, isUnsigned: true)
!26 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4, isUnsigned: true)
!27 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3, isUnsigned: true)
!28 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1, isUnsigned: true)
!29 = !{!30, !33, !7}
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!32 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!34 = !{!35, !0, !38}
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 175, type: !37, isLocal: true, isDefinition: true)
!37 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "crctab", scope: !2, file: !3, line: 118, type: !40, isLocal: true, isDefinition: true)
!40 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 16384, elements: !45)
!41 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !43, line: 74, baseType: !44)
!43 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!44 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!45 = !{!46}
!46 = !DISubrange(count: 256)
!47 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 256, elements: !58)
!48 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !50, line: 50, size: 256, elements: !51)
!50 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!51 = !{!52, !53, !55, !57}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !49, file: !50, line: 52, baseType: !30, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !49, file: !50, line: 55, baseType: !54, size: 32, offset: 64)
!54 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !49, file: !50, line: 56, baseType: !56, size: 64, offset: 128)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !49, file: !50, line: 57, baseType: !54, size: 32, offset: 192)
!58 = !{!59}
!59 = !DISubrange(count: 1)
!60 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!62 = distinct !DIGlobalVariable(name: "Version", scope: !63, file: !64, line: 2, type: !30, isDefinition: true)
!63 = distinct !DICompileUnit(language: DW_LANG_C99, file: !64, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !65, globals: !66)
!64 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!65 = !{}
!66 = !{!61}
!67 = !DIGlobalVariableExpression(var: !68, expr: !DIExpression())
!68 = distinct !DIGlobalVariable(name: "file_name", scope: !69, file: !74, line: 46, type: !30, isLocal: true, isDefinition: true)
!69 = distinct !DICompileUnit(language: DW_LANG_C99, file: !70, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !65, globals: !71)
!70 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!71 = !{!67, !72}
!72 = !DIGlobalVariableExpression(var: !73, expr: !DIExpression())
!73 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !69, file: !74, line: 56, type: !37, isLocal: true, isDefinition: true)
!74 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!75 = !DIGlobalVariableExpression(var: !76, expr: !DIExpression())
!76 = distinct !DIGlobalVariable(name: "exit_failure", scope: !77, file: !80, line: 24, type: !81, isDefinition: true)
!77 = distinct !DICompileUnit(language: DW_LANG_C99, file: !78, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !65, globals: !79)
!78 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!79 = !{!75}
!80 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!81 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !54)
!82 = !DIGlobalVariableExpression(var: !83, expr: !DIExpression())
!83 = distinct !DIGlobalVariable(name: "long_options", scope: !84, file: !87, line: 33, type: !88, isLocal: true, isDefinition: true)
!84 = distinct !DICompileUnit(language: DW_LANG_C99, file: !85, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !65, globals: !86)
!85 = !DIFile(filename: "./lib/long-options.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!86 = !{!82}
!87 = !DIFile(filename: "lib/long-options.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 768, elements: !96)
!89 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !90)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !50, line: 50, size: 256, elements: !91)
!91 = !{!92, !93, !94, !95}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !90, file: !50, line: 52, baseType: !30, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !90, file: !50, line: 55, baseType: !54, size: 32, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !90, file: !50, line: 56, baseType: !56, size: 64, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !90, file: !50, line: 57, baseType: !54, size: 32, offset: 192)
!96 = !{!97}
!97 = !DISubrange(count: 3)
!98 = !DIGlobalVariableExpression(var: !99, expr: !DIExpression())
!99 = distinct !DIGlobalVariable(name: "program_name", scope: !100, file: !105, line: 33, type: !30, isDefinition: true)
!100 = distinct !DICompileUnit(language: DW_LANG_C99, file: !101, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !65, retainedTypes: !102, globals: !104)
!101 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!102 = !{!33, !103}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!104 = !{!98}
!105 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!106 = !DIGlobalVariableExpression(var: !107, expr: !DIExpression())
!107 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !108, file: !138, line: 85, type: !171, isDefinition: true)
!108 = distinct !DICompileUnit(language: DW_LANG_C99, file: !109, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !110, retainedTypes: !131, globals: !135)
!109 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!110 = !{!5, !111, !116}
!111 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, baseType: !7, size: 32, elements: !112)
!112 = !{!113, !114, !115}
!113 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!114 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!115 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!116 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !117, line: 46, baseType: !7, size: 32, elements: !118)
!117 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!118 = !{!119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130}
!119 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!120 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!121 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!122 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!123 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!124 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!125 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!126 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!127 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!128 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!129 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!130 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!131 = !{!54, !132, !133, !103}
!132 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !134, line: 62, baseType: !44)
!134 = !DIFile(filename: "/usr/lib/clang/7.0.0/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!135 = !{!106, !136, !143, !155, !157, !160, !167, !169}
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !108, file: !138, line: 101, type: !139, isDefinition: true)
!138 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 320, elements: !141)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!141 = !{!142}
!142 = !DISubrange(count: 10)
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !108, file: !138, line: 1052, type: !145, isDefinition: true)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !138, line: 65, size: 448, elements: !146)
!146 = !{!147, !148, !149, !153, !154}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !145, file: !138, line: 68, baseType: !5, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !145, file: !138, line: 71, baseType: !54, size: 32, offset: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !145, file: !138, line: 75, baseType: !150, size: 256, offset: 64)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 8)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !145, file: !138, line: 78, baseType: !30, size: 64, offset: 320)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !145, file: !138, line: 81, baseType: !30, size: 64, offset: 384)
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !108, file: !138, line: 116, type: !145, isLocal: true, isDefinition: true)
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!158 = distinct !DIGlobalVariable(name: "slot0", scope: !108, file: !138, line: 842, type: !159, isLocal: true, isDefinition: true)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 2048, elements: !45)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "slotvec", scope: !108, file: !138, line: 845, type: !162, isLocal: true, isDefinition: true)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !138, line: 834, size: 128, elements: !164)
!164 = !{!165, !166}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !163, file: !138, line: 836, baseType: !133, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !163, file: !138, line: 837, baseType: !103, size: 64, offset: 64)
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(name: "nslots", scope: !108, file: !138, line: 843, type: !54, isLocal: true, isDefinition: true)
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(name: "slotvec0", scope: !108, file: !138, line: 844, type: !163, isLocal: true, isDefinition: true)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 704, elements: !173)
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!173 = !{!174}
!174 = !DISubrange(count: 11)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !177, file: !180, line: 26, type: !181, isDefinition: true)
!177 = distinct !DICompileUnit(language: DW_LANG_C99, file: !178, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !65, globals: !179)
!178 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!179 = !{!175}
!180 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 376, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 47)
!184 = distinct !DICompileUnit(language: DW_LANG_C99, file: !185, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !186)
!185 = !DIFile(filename: "./lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!186 = !{!20}
!187 = distinct !DICompileUnit(language: DW_LANG_C99, file: !188, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !65, retainedTypes: !189)
!188 = !DIFile(filename: "./lib/umaxtostr.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!189 = !{!190}
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !43, line: 102, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !192, line: 72, baseType: !44)
!192 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!193 = distinct !DICompileUnit(language: DW_LANG_C99, file: !194, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !195, retainedTypes: !200)
!194 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!195 = !{!196}
!196 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !197, line: 41, baseType: !7, size: 32, elements: !198)
!197 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!198 = !{!199}
!199 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2018, isUnsigned: true)
!200 = !{!33}
!201 = distinct !DICompileUnit(language: DW_LANG_C99, file: !202, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !203, retainedTypes: !217)
!202 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!203 = !{!204}
!204 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !206, file: !205, line: 186, baseType: !7, size: 32, elements: !215)
!205 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!206 = distinct !DISubprogram(name: "x2nrealloc", scope: !205, file: !205, line: 174, type: !207, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: true, unit: !201, retainedNodes: !210)
!207 = !DISubroutineType(types: !208)
!208 = !{!33, !33, !209, !133}
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!210 = !{!211, !212, !213, !214}
!211 = !DILocalVariable(name: "p", arg: 1, scope: !206, file: !205, line: 174, type: !33)
!212 = !DILocalVariable(name: "pn", arg: 2, scope: !206, file: !205, line: 174, type: !209)
!213 = !DILocalVariable(name: "s", arg: 3, scope: !206, file: !205, line: 174, type: !133)
!214 = !DILocalVariable(name: "n", scope: !206, file: !205, line: 176, type: !133)
!215 = !{!216}
!216 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!217 = !{!133, !103, !33}
!218 = distinct !DICompileUnit(language: DW_LANG_C99, file: !219, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !65)
!219 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!220 = distinct !DICompileUnit(language: DW_LANG_C99, file: !221, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !65, retainedTypes: !200)
!221 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!222 = distinct !DICompileUnit(language: DW_LANG_C99, file: !223, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !65)
!223 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!224 = distinct !DICompileUnit(language: DW_LANG_C99, file: !225, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !65, retainedTypes: !200)
!225 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!226 = distinct !DICompileUnit(language: DW_LANG_C99, file: !227, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !65, retainedTypes: !200)
!227 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!228 = distinct !DICompileUnit(language: DW_LANG_C99, file: !229, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !65, retainedTypes: !230)
!229 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!230 = !{!133}
!231 = distinct !DICompileUnit(language: DW_LANG_C99, file: !232, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !65)
!232 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!233 = distinct !DICompileUnit(language: DW_LANG_C99, file: !234, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !65)
!234 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!235 = distinct !DICompileUnit(language: DW_LANG_C99, file: !236, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !237, retainedTypes: !200)
!236 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!237 = !{!238}
!238 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !239, line: 41, baseType: !7, size: 32, elements: !240)
!239 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!240 = !{!241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623}
!241 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!242 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!243 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!244 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!245 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!246 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!247 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!248 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!249 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!250 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!251 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!252 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!253 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!254 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!255 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!256 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!257 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!258 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!259 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!260 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!261 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!262 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!263 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!264 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!265 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!266 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!267 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!268 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!269 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!270 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!271 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!272 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!273 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!274 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!275 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!276 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!277 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!278 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!279 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!280 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!281 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!282 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!283 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!284 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!285 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!286 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!287 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!288 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!289 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!290 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!291 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!292 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!293 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!294 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!295 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!296 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!297 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!298 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!299 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!300 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!301 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!302 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!303 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!304 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!305 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!306 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!307 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!308 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!309 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!310 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!311 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!312 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!313 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!314 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!315 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!316 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!317 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!318 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!319 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!320 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!321 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!322 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!323 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!324 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!325 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!326 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!327 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!328 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!329 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!330 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!331 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!332 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!333 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!334 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!335 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!336 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!337 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!338 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!339 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!340 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!341 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!342 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!343 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!344 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!345 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!346 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!347 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!348 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!349 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!350 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!351 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!352 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!353 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!354 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!355 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!356 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!357 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!358 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!359 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!360 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!361 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!362 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!363 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!364 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!365 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!366 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!367 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!368 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!369 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!370 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!371 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!372 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!373 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!374 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!375 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!376 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!377 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!378 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!379 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!380 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!381 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!382 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!383 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!384 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!385 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!386 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!387 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!388 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!389 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!390 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!391 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!392 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!393 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!394 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!395 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!396 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!397 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!398 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!399 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!400 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!401 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!402 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!403 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!404 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!405 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!406 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!407 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!408 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!409 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!410 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!411 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!412 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!413 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!414 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!415 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!416 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!417 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!418 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!419 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!420 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!421 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!422 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!423 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!424 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!425 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!426 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!427 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!428 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!429 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!430 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!431 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!432 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!433 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!434 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!435 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!436 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!437 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!438 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!439 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!440 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!441 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!442 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!443 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!444 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!445 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!446 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!447 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!448 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!449 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!450 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!451 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!452 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!453 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!454 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!455 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!456 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!457 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!458 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!459 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!460 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!461 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!462 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!463 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!464 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!465 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!466 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!467 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!468 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!469 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!470 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!471 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!472 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!473 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!474 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!475 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!476 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!477 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!478 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!479 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!480 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!481 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!482 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!483 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!484 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!485 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!486 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!487 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!488 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!489 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!490 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!491 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!492 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!493 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!494 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!495 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!496 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!497 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!498 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!499 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!500 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!501 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!502 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!503 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!504 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!505 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!506 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!507 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!508 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!509 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!510 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!511 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!512 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!513 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!514 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!515 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!516 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!517 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!518 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!519 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!520 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!521 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!522 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!523 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!524 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!525 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!526 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!527 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!528 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!529 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!530 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!531 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!532 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!533 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!534 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!535 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!536 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!537 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!538 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!539 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!540 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!541 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!542 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!543 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!544 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!545 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!546 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!547 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!548 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!549 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!550 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!551 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!552 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!553 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!554 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!555 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!556 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!557 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!558 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!559 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!560 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!561 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!562 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!563 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!564 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!565 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!566 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!567 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!568 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!569 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!570 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!571 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!572 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!573 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!574 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!575 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!576 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!577 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!578 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!579 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!580 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!581 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!582 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!583 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!584 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!585 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!586 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!587 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!588 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!589 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!590 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!591 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!592 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!593 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!594 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!595 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!596 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!597 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!598 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!599 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!600 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!601 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!602 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!603 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!604 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!605 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!606 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!607 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!608 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!609 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!610 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!611 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!612 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!613 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!614 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!615 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!616 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!617 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!618 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!619 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!620 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!621 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!622 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!623 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!624 = !{!"clang version 7.0.0 (tags/RELEASE_700/final)"}
!625 = !{i32 2, !"Dwarf Version", i32 4}
!626 = !{i32 2, !"Debug Info Version", i32 3}
!627 = !{i32 1, !"wchar_size", i32 4}
!628 = !{i32 7, !"PIC Level", i32 2}
!629 = !{i32 7, !"PIE Level", i32 2}
!630 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 257, type: !631, isDefinition: true, scopeLine: 258, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, retainedNodes: !633)
!631 = !DISubroutineType(types: !632)
!632 = !{null, !54}
!633 = !{!634}
!634 = !DILocalVariable(name: "status", arg: 1, scope: !630, file: !3, line: 257, type: !54)
!635 = !DILocalVariable(name: "infomap", scope: !636, file: !637, line: 632, type: !651)
!636 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !637, file: !637, line: 630, type: !638, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !640)
!637 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!638 = !DISubroutineType(types: !639)
!639 = !{null, !30}
!640 = !{!641, !635, !642, !643, !650}
!641 = !DILocalVariable(name: "program", arg: 1, scope: !636, file: !637, line: 630, type: !30)
!642 = !DILocalVariable(name: "node", scope: !636, file: !637, line: 642, type: !30)
!643 = !DILocalVariable(name: "map_prog", scope: !636, file: !637, line: 643, type: !644)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !646)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !636, file: !637, line: 632, size: 128, elements: !647)
!647 = !{!648, !649}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !646, file: !637, line: 632, baseType: !30, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !646, file: !637, line: 632, baseType: !30, size: 64, offset: 64)
!650 = !DILocalVariable(name: "lc_messages", scope: !636, file: !637, line: 655, type: !30)
!651 = !DICompositeType(tag: DW_TAG_array_type, baseType: !645, size: 896, elements: !652)
!652 = !{!653}
!653 = !DISubrange(count: 7)
!654 = !DILocation(line: 632, column: 67, scope: !636, inlinedAt: !655)
!655 = distinct !DILocation(line: 274, column: 7, scope: !656)
!656 = distinct !DILexicalBlock(scope: !657, file: !3, line: 262, column: 5)
!657 = distinct !DILexicalBlock(scope: !630, file: !3, line: 259, column: 7)
!658 = !DILocation(line: 257, column: 12, scope: !630)
!659 = !DILocation(line: 259, column: 14, scope: !657)
!660 = !DILocation(line: 259, column: 7, scope: !630)
!661 = !DILocation(line: 260, column: 5, scope: !662)
!662 = distinct !DILexicalBlock(scope: !657, file: !3, line: 260, column: 5)
!663 = !{!664, !664, i64 0}
!664 = !{!"any pointer", !665, i64 0}
!665 = !{!"omnipotent char", !666, i64 0}
!666 = !{!"Simple C/C++ TBAA"}
!667 = !DILocation(line: 263, column: 7, scope: !656)
!668 = !DILocation(line: 268, column: 7, scope: !656)
!669 = !DILocation(line: 272, column: 7, scope: !656)
!670 = !DILocation(line: 273, column: 7, scope: !656)
!671 = !DILocation(line: 632, column: 3, scope: !636, inlinedAt: !655)
!672 = !DILocation(line: 643, column: 36, scope: !636, inlinedAt: !655)
!673 = !DILocation(line: 643, column: 25, scope: !636, inlinedAt: !655)
!674 = !DILocation(line: 645, column: 33, scope: !636, inlinedAt: !655)
!675 = !DILocation(line: 645, column: 3, scope: !636, inlinedAt: !655)
!676 = !DILocation(line: 646, column: 13, scope: !636, inlinedAt: !655)
!677 = !DILocation(line: 645, column: 20, scope: !636, inlinedAt: !655)
!678 = !{!679, !664, i64 0}
!679 = !{!"infomap", !664, i64 0, !664, i64 8}
!680 = !DILocation(line: 645, column: 10, scope: !636, inlinedAt: !655)
!681 = !DILocation(line: 645, column: 28, scope: !636, inlinedAt: !655)
!682 = distinct !{!682, !683, !684}
!683 = !DILocation(line: 645, column: 3, scope: !636)
!684 = !DILocation(line: 646, column: 13, scope: !636)
!685 = !DILocation(line: 648, column: 17, scope: !686, inlinedAt: !655)
!686 = distinct !DILexicalBlock(scope: !636, file: !637, line: 648, column: 7)
!687 = !{!679, !664, i64 8}
!688 = !DILocation(line: 648, column: 7, scope: !686, inlinedAt: !655)
!689 = !DILocation(line: 648, column: 7, scope: !636, inlinedAt: !655)
!690 = !DILocation(line: 642, column: 15, scope: !636, inlinedAt: !655)
!691 = !DILocation(line: 651, column: 3, scope: !636, inlinedAt: !655)
!692 = !DILocation(line: 655, column: 29, scope: !636, inlinedAt: !655)
!693 = !DILocation(line: 655, column: 15, scope: !636, inlinedAt: !655)
!694 = !DILocation(line: 656, column: 7, scope: !695, inlinedAt: !655)
!695 = distinct !DILexicalBlock(scope: !636, file: !637, line: 656, column: 7)
!696 = !DILocation(line: 656, column: 19, scope: !695, inlinedAt: !655)
!697 = !DILocation(line: 656, column: 22, scope: !695, inlinedAt: !655)
!698 = !DILocation(line: 656, column: 7, scope: !636, inlinedAt: !655)
!699 = !DILocation(line: 662, column: 7, scope: !700, inlinedAt: !655)
!700 = distinct !DILexicalBlock(scope: !695, file: !637, line: 657, column: 5)
!701 = !DILocation(line: 664, column: 5, scope: !700, inlinedAt: !655)
!702 = !DILocation(line: 665, column: 3, scope: !636, inlinedAt: !655)
!703 = !DILocation(line: 667, column: 3, scope: !636, inlinedAt: !655)
!704 = !DILocation(line: 669, column: 1, scope: !636, inlinedAt: !655)
!705 = !DILocation(line: 276, column: 3, scope: !630)
!706 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 280, type: !707, isDefinition: true, scopeLine: 281, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !710)
!707 = !DISubroutineType(types: !708)
!708 = !{!54, !54, !709}
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!710 = !{!711, !712, !713, !714}
!711 = !DILocalVariable(name: "argc", arg: 1, scope: !706, file: !3, line: 280, type: !54)
!712 = !DILocalVariable(name: "argv", arg: 2, scope: !706, file: !3, line: 280, type: !709)
!713 = !DILocalVariable(name: "i", scope: !706, file: !3, line: 282, type: !54)
!714 = !DILocalVariable(name: "ok", scope: !706, file: !3, line: 283, type: !37)
!715 = !DILocation(line: 280, column: 11, scope: !706)
!716 = !DILocation(line: 280, column: 24, scope: !706)
!717 = !DILocation(line: 286, column: 21, scope: !706)
!718 = !DILocation(line: 286, column: 3, scope: !706)
!719 = !DILocation(line: 287, column: 3, scope: !706)
!720 = !DILocation(line: 288, column: 3, scope: !706)
!721 = !DILocation(line: 289, column: 3, scope: !706)
!722 = !DILocation(line: 291, column: 3, scope: !706)
!723 = !DILocation(line: 295, column: 12, scope: !706)
!724 = !DILocation(line: 295, column: 3, scope: !706)
!725 = !DILocation(line: 297, column: 58, scope: !706)
!726 = !DILocation(line: 297, column: 3, scope: !706)
!727 = !DILocation(line: 299, column: 7, scope: !728)
!728 = distinct !DILexicalBlock(scope: !706, file: !3, line: 299, column: 7)
!729 = !DILocation(line: 299, column: 56, scope: !728)
!730 = !DILocation(line: 299, column: 7, scope: !706)
!731 = !DILocation(line: 300, column: 5, scope: !728)
!732 = !DILocation(line: 304, column: 7, scope: !733)
!733 = distinct !DILexicalBlock(scope: !706, file: !3, line: 304, column: 7)
!734 = !{!735, !735, i64 0}
!735 = !{!"int", !665, i64 0}
!736 = !DILocation(line: 304, column: 14, scope: !733)
!737 = !DILocation(line: 304, column: 7, scope: !706)
!738 = !DILocation(line: 283, column: 8, scope: !706)
!739 = !DILocation(line: 282, column: 7, scope: !706)
!740 = !DILocation(line: 309, column: 26, scope: !741)
!741 = distinct !DILexicalBlock(scope: !742, file: !3, line: 309, column: 7)
!742 = distinct !DILexicalBlock(scope: !743, file: !3, line: 309, column: 7)
!743 = distinct !DILexicalBlock(scope: !733, file: !3, line: 307, column: 5)
!744 = !DILocation(line: 309, column: 7, scope: !742)
!745 = !DILocation(line: 310, column: 22, scope: !741)
!746 = !DILocation(line: 305, column: 10, scope: !733)
!747 = !DILocation(line: 305, column: 8, scope: !733)
!748 = !DILocation(line: 305, column: 5, scope: !733)
!749 = !DILocation(line: 310, column: 15, scope: !741)
!750 = !DILocation(line: 310, column: 12, scope: !741)
!751 = !DILocation(line: 309, column: 35, scope: !741)
!752 = distinct !{!752, !744, !753}
!753 = !DILocation(line: 310, column: 35, scope: !742)
!754 = !DILocation(line: 313, column: 23, scope: !755)
!755 = distinct !DILexicalBlock(scope: !706, file: !3, line: 313, column: 7)
!756 = !DILocation(line: 313, column: 34, scope: !755)
!757 = !DILocation(line: 313, column: 26, scope: !755)
!758 = !DILocation(line: 313, column: 41, scope: !755)
!759 = !DILocation(line: 313, column: 7, scope: !706)
!760 = !DILocation(line: 314, column: 5, scope: !755)
!761 = !DILocation(line: 315, column: 10, scope: !706)
!762 = !DILocation(line: 315, column: 3, scope: !706)
!763 = distinct !DISubprogram(name: "cksum", scope: !3, file: !3, line: 183, type: !764, isLocal: true, isDefinition: true, scopeLine: 184, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !766)
!764 = !DISubroutineType(types: !765)
!765 = !{!37, !30, !37}
!766 = !{!767, !768, !769, !774, !775, !776, !777, !830, !834, !835}
!767 = !DILocalVariable(name: "file", arg: 1, scope: !763, file: !3, line: 183, type: !30)
!768 = !DILocalVariable(name: "print_name", arg: 2, scope: !763, file: !3, line: 183, type: !37)
!769 = !DILocalVariable(name: "buf", scope: !763, file: !3, line: 185, type: !770)
!770 = !DICompositeType(tag: DW_TAG_array_type, baseType: !771, size: 524288, elements: !772)
!771 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!772 = !{!773}
!773 = !DISubrange(count: 65536)
!774 = !DILocalVariable(name: "crc", scope: !763, file: !3, line: 186, type: !42)
!775 = !DILocalVariable(name: "length", scope: !763, file: !3, line: 187, type: !190)
!776 = !DILocalVariable(name: "bytes_read", scope: !763, file: !3, line: 188, type: !133)
!777 = !DILocalVariable(name: "fp", scope: !763, file: !3, line: 189, type: !778)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !780, line: 7, baseType: !781)
!780 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !782, line: 49, size: 1728, elements: !783)
!782 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!783 = !{!784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !799, !801, !802, !803, !806, !807, !809, !811, !814, !816, !819, !822, !823, !824, !825, !826}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !781, file: !782, line: 51, baseType: !54, size: 32)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !781, file: !782, line: 54, baseType: !103, size: 64, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !781, file: !782, line: 55, baseType: !103, size: 64, offset: 128)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !781, file: !782, line: 56, baseType: !103, size: 64, offset: 192)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !781, file: !782, line: 57, baseType: !103, size: 64, offset: 256)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !781, file: !782, line: 58, baseType: !103, size: 64, offset: 320)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !781, file: !782, line: 59, baseType: !103, size: 64, offset: 384)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !781, file: !782, line: 60, baseType: !103, size: 64, offset: 448)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !781, file: !782, line: 61, baseType: !103, size: 64, offset: 512)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !781, file: !782, line: 64, baseType: !103, size: 64, offset: 576)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !781, file: !782, line: 65, baseType: !103, size: 64, offset: 640)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !781, file: !782, line: 66, baseType: !103, size: 64, offset: 704)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !781, file: !782, line: 68, baseType: !797, size: 64, offset: 768)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !782, line: 36, flags: DIFlagFwdDecl)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !781, file: !782, line: 70, baseType: !800, size: 64, offset: 832)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !781, file: !782, line: 72, baseType: !54, size: 32, offset: 896)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !781, file: !782, line: 73, baseType: !54, size: 32, offset: 928)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !781, file: !782, line: 74, baseType: !804, size: 64, offset: 960)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !192, line: 150, baseType: !805)
!805 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !781, file: !782, line: 77, baseType: !132, size: 16, offset: 1024)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !781, file: !782, line: 78, baseType: !808, size: 8, offset: 1040)
!808 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !781, file: !782, line: 79, baseType: !810, size: 8, offset: 1048)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 8, elements: !58)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !781, file: !782, line: 81, baseType: !812, size: 64, offset: 1088)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !782, line: 43, baseType: null)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !781, file: !782, line: 89, baseType: !815, size: 64, offset: 1152)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !192, line: 151, baseType: !805)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !781, file: !782, line: 91, baseType: !817, size: 64, offset: 1216)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !782, line: 37, flags: DIFlagFwdDecl)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !781, file: !782, line: 92, baseType: !820, size: 64, offset: 1280)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !782, line: 38, flags: DIFlagFwdDecl)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !781, file: !782, line: 93, baseType: !800, size: 64, offset: 1344)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !781, file: !782, line: 94, baseType: !33, size: 64, offset: 1408)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !781, file: !782, line: 95, baseType: !133, size: 64, offset: 1472)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !781, file: !782, line: 96, baseType: !54, size: 32, offset: 1536)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !781, file: !782, line: 98, baseType: !827, size: 160, offset: 1568)
!827 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 160, elements: !828)
!828 = !{!829}
!829 = !DISubrange(count: 20)
!830 = !DILocalVariable(name: "length_buf", scope: !763, file: !3, line: 190, type: !831)
!831 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 168, elements: !832)
!832 = !{!833}
!833 = !DISubrange(count: 21)
!834 = !DILocalVariable(name: "hp", scope: !763, file: !3, line: 191, type: !30)
!835 = !DILocalVariable(name: "cp", scope: !836, file: !3, line: 213, type: !837)
!836 = distinct !DILexicalBlock(scope: !763, file: !3, line: 212, column: 5)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!838 = !DILocation(line: 183, column: 20, scope: !763)
!839 = !DILocation(line: 183, column: 31, scope: !763)
!840 = !DILocation(line: 185, column: 3, scope: !763)
!841 = !DILocation(line: 185, column: 17, scope: !763)
!842 = !DILocation(line: 186, column: 17, scope: !763)
!843 = !DILocation(line: 187, column: 13, scope: !763)
!844 = !DILocation(line: 190, column: 3, scope: !763)
!845 = !DILocation(line: 190, column: 8, scope: !763)
!846 = !DILocation(line: 193, column: 7, scope: !847)
!847 = distinct !DILexicalBlock(scope: !763, file: !3, line: 193, column: 7)
!848 = !DILocation(line: 193, column: 7, scope: !763)
!849 = !DILocation(line: 195, column: 12, scope: !850)
!850 = distinct !DILexicalBlock(scope: !847, file: !3, line: 194, column: 5)
!851 = !DILocation(line: 189, column: 9, scope: !763)
!852 = !DILocation(line: 198, column: 5, scope: !850)
!853 = !DILocation(line: 201, column: 12, scope: !854)
!854 = distinct !DILexicalBlock(scope: !847, file: !3, line: 200, column: 5)
!855 = !DILocation(line: 202, column: 14, scope: !856)
!856 = distinct !DILexicalBlock(scope: !854, file: !3, line: 202, column: 11)
!857 = !DILocation(line: 202, column: 11, scope: !854)
!858 = !DILocation(line: 204, column: 21, scope: !859)
!859 = distinct !DILexicalBlock(scope: !856, file: !3, line: 203, column: 9)
!860 = !DILocation(line: 204, column: 34, scope: !859)
!861 = !DILocation(line: 204, column: 11, scope: !859)
!862 = !DILocation(line: 205, column: 11, scope: !859)
!863 = !DILocation(scope: !854)
!864 = !DILocation(line: 209, column: 3, scope: !763)
!865 = !DILocation(line: 211, column: 3, scope: !763)
!866 = !DILocation(scope: !836)
!867 = !DILocation(line: 211, column: 24, scope: !763)
!868 = !DILocation(line: 188, column: 10, scope: !763)
!869 = !DILocation(line: 211, column: 52, scope: !763)
!870 = !DILocation(line: 137, column: 10, scope: !871, inlinedAt: !877)
!871 = distinct !DISubprogram(name: "ferror_unlocked", scope: !872, file: !872, line: 135, type: !873, isDefinition: true, scopeLine: 136, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !875)
!872 = !DIFile(filename: "/usr/include/bits/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!873 = !DISubroutineType(types: !874)
!874 = !{!54, !778}
!875 = !{!876}
!876 = !DILocalVariable(name: "__stream", arg: 1, scope: !871, file: !872, line: 135, type: !778)
!877 = distinct !DILocation(line: 224, column: 7, scope: !878)
!878 = distinct !DILexicalBlock(scope: !763, file: !3, line: 224, column: 7)
!879 = !{!880, !735, i64 0}
!880 = !{!"_IO_FILE", !735, i64 0, !664, i64 8, !664, i64 16, !664, i64 24, !664, i64 32, !664, i64 40, !664, i64 48, !664, i64 56, !664, i64 64, !664, i64 72, !664, i64 80, !664, i64 88, !664, i64 96, !664, i64 104, !735, i64 112, !735, i64 116, !881, i64 120, !882, i64 128, !665, i64 130, !665, i64 131, !664, i64 136, !881, i64 144, !664, i64 152, !664, i64 160, !664, i64 168, !664, i64 176, !881, i64 184, !735, i64 192, !665, i64 196}
!881 = !{!"long", !665, i64 0}
!882 = !{!"short", !665, i64 0}
!883 = !DILocation(line: 213, column: 22, scope: !836)
!884 = !DILocation(line: 215, column: 18, scope: !885)
!885 = distinct !DILexicalBlock(scope: !836, file: !3, line: 215, column: 11)
!886 = !DILocation(line: 215, column: 31, scope: !885)
!887 = !DILocation(line: 215, column: 11, scope: !836)
!888 = !DILocation(line: 218, column: 24, scope: !836)
!889 = !DILocation(line: 219, column: 20, scope: !836)
!890 = !DILocation(line: 219, column: 41, scope: !836)
!891 = !DILocation(line: 219, column: 50, scope: !836)
!892 = !{!665, !665, i64 0}
!893 = !DILocation(line: 219, column: 57, scope: !836)
!894 = !DILocation(line: 219, column: 28, scope: !836)
!895 = !{!881, !881, i64 0}
!896 = !DILocation(line: 219, column: 26, scope: !836)
!897 = !DILocation(line: 218, column: 7, scope: !836)
!898 = !DILocation(line: 216, column: 9, scope: !885)
!899 = !DILocation(line: 219, column: 53, scope: !836)
!900 = distinct !{!900, !897, !901}
!901 = !DILocation(line: 219, column: 63, scope: !836)
!902 = !DILocalVariable(name: "__stream", arg: 1, scope: !903, file: !872, line: 128, type: !778)
!903 = distinct !DISubprogram(name: "feof_unlocked", scope: !872, file: !872, line: 128, type: !873, isDefinition: true, scopeLine: 129, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !904)
!904 = !{!902}
!905 = !DILocation(line: 128, column: 1, scope: !903, inlinedAt: !906)
!906 = distinct !DILocation(line: 220, column: 11, scope: !907)
!907 = distinct !DILexicalBlock(scope: !836, file: !3, line: 220, column: 11)
!908 = !DILocation(line: 130, column: 10, scope: !903, inlinedAt: !906)
!909 = !DILocation(line: 220, column: 11, scope: !907)
!910 = distinct !{!910, !865, !911}
!911 = !DILocation(line: 222, column: 5, scope: !763)
!912 = !DILocation(scope: !763)
!913 = !DILocation(line: 135, column: 1, scope: !871, inlinedAt: !877)
!914 = !DILocation(line: 224, column: 7, scope: !878)
!915 = !DILocation(line: 224, column: 7, scope: !763)
!916 = !DILocation(line: 226, column: 17, scope: !917)
!917 = distinct !DILexicalBlock(scope: !878, file: !3, line: 225, column: 5)
!918 = !DILocation(line: 226, column: 30, scope: !917)
!919 = !DILocation(line: 226, column: 7, scope: !917)
!920 = !DILocation(line: 227, column: 12, scope: !921)
!921 = distinct !DILexicalBlock(scope: !917, file: !3, line: 227, column: 11)
!922 = !DILocation(line: 227, column: 11, scope: !917)
!923 = !DILocation(line: 228, column: 9, scope: !921)
!924 = !DILocation(line: 232, column: 8, scope: !925)
!925 = distinct !DILexicalBlock(scope: !763, file: !3, line: 232, column: 7)
!926 = !DILocation(line: 232, column: 26, scope: !925)
!927 = !DILocation(line: 232, column: 29, scope: !925)
!928 = !DILocation(line: 232, column: 41, scope: !925)
!929 = !DILocation(line: 232, column: 7, scope: !763)
!930 = !DILocation(line: 234, column: 17, scope: !931)
!931 = distinct !DILexicalBlock(scope: !925, file: !3, line: 233, column: 5)
!932 = !DILocation(line: 234, column: 30, scope: !931)
!933 = !DILocation(line: 234, column: 7, scope: !931)
!934 = !DILocation(line: 235, column: 7, scope: !931)
!935 = !DILocation(line: 238, column: 8, scope: !763)
!936 = !DILocation(line: 191, column: 15, scope: !763)
!937 = !DILocation(line: 240, column: 3, scope: !938)
!938 = distinct !DILexicalBlock(scope: !763, file: !3, line: 240, column: 3)
!939 = !DILocation(line: 241, column: 16, scope: !940)
!940 = distinct !DILexicalBlock(scope: !938, file: !3, line: 240, column: 3)
!941 = !DILocation(line: 241, column: 37, scope: !940)
!942 = !DILocation(line: 241, column: 44, scope: !940)
!943 = !DILocation(line: 241, column: 54, scope: !940)
!944 = !DILocation(line: 241, column: 24, scope: !940)
!945 = !DILocation(line: 241, column: 22, scope: !940)
!946 = !DILocation(line: 240, column: 25, scope: !940)
!947 = distinct !{!947, !937, !948}
!948 = !DILocation(line: 241, column: 60, scope: !938)
!949 = !DILocation(scope: !940)
!950 = !DILocation(scope: !951)
!951 = distinct !DILexicalBlock(scope: !763, file: !3, line: 245, column: 7)
!952 = !DILocation(line: 245, column: 7, scope: !763)
!953 = !DILocation(line: 246, column: 5, scope: !951)
!954 = !DILocation(line: 248, column: 5, scope: !951)
!955 = !DILocation(line: 250, column: 7, scope: !956)
!956 = distinct !DILexicalBlock(scope: !763, file: !3, line: 250, column: 7)
!957 = !DILocation(line: 135, column: 1, scope: !871, inlinedAt: !958)
!958 = distinct !DILocation(line: 250, column: 7, scope: !956)
!959 = !DILocation(line: 137, column: 10, scope: !871, inlinedAt: !958)
!960 = !DILocation(line: 250, column: 7, scope: !763)
!961 = !DILocation(line: 251, column: 5, scope: !956)
!962 = !DILocation(scope: !859)
!963 = !DILocation(line: 254, column: 1, scope: !763)
!964 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !74, file: !74, line: 51, type: !638, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: true, unit: !69, retainedNodes: !965)
!965 = !{!966}
!966 = !DILocalVariable(name: "file", arg: 1, scope: !964, file: !74, line: 51, type: !30)
!967 = !DILocation(line: 51, column: 41, scope: !964)
!968 = !DILocation(line: 53, column: 13, scope: !964)
!969 = !DILocation(line: 54, column: 1, scope: !964)
!970 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !74, file: !74, line: 88, type: !971, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: true, unit: !69, retainedNodes: !973)
!971 = !DISubroutineType(types: !972)
!972 = !{null, !37}
!973 = !{!974}
!974 = !DILocalVariable(name: "ignore", arg: 1, scope: !970, file: !74, line: 88, type: !37)
!975 = !DILocation(line: 88, column: 37, scope: !970)
!976 = !DILocation(line: 90, column: 16, scope: !970)
!977 = !{!978, !978, i64 0}
!978 = !{!"_Bool", !665, i64 0}
!979 = !DILocation(line: 91, column: 1, scope: !970)
!980 = distinct !DISubprogram(name: "close_stdout", scope: !74, file: !74, line: 117, type: !981, isDefinition: true, scopeLine: 118, flags: DIFlagPrototyped, isOptimized: true, unit: !69, retainedNodes: !983)
!981 = !DISubroutineType(types: !982)
!982 = !{null}
!983 = !{!984}
!984 = !DILocalVariable(name: "write_error", scope: !985, file: !74, line: 122, type: !30)
!985 = distinct !DILexicalBlock(scope: !986, file: !74, line: 121, column: 5)
!986 = distinct !DILexicalBlock(scope: !980, file: !74, line: 119, column: 7)
!987 = !DILocation(line: 119, column: 21, scope: !986)
!988 = !DILocation(line: 119, column: 7, scope: !986)
!989 = !DILocation(line: 119, column: 29, scope: !986)
!990 = !DILocation(line: 120, column: 7, scope: !986)
!991 = !DILocation(line: 120, column: 12, scope: !986)
!992 = !{i8 0, i8 2}
!993 = !DILocation(line: 120, column: 25, scope: !986)
!994 = !DILocation(line: 120, column: 28, scope: !986)
!995 = !DILocation(line: 120, column: 34, scope: !986)
!996 = !DILocation(line: 119, column: 7, scope: !980)
!997 = !DILocation(line: 122, column: 33, scope: !985)
!998 = !DILocation(line: 122, column: 19, scope: !985)
!999 = !DILocation(line: 123, column: 11, scope: !1000)
!1000 = distinct !DILexicalBlock(scope: !985, file: !74, line: 123, column: 11)
!1001 = !DILocation(scope: !1000)
!1002 = !DILocation(line: 123, column: 11, scope: !985)
!1003 = !DILocation(line: 124, column: 36, scope: !1000)
!1004 = !DILocation(line: 124, column: 9, scope: !1000)
!1005 = !DILocation(line: 127, column: 9, scope: !1000)
!1006 = !DILocation(line: 129, column: 14, scope: !985)
!1007 = !DILocation(line: 129, column: 7, scope: !985)
!1008 = !DILocation(line: 134, column: 42, scope: !1009)
!1009 = distinct !DILexicalBlock(scope: !980, file: !74, line: 134, column: 7)
!1010 = !DILocation(line: 134, column: 28, scope: !1009)
!1011 = !DILocation(line: 134, column: 50, scope: !1009)
!1012 = !DILocation(line: 134, column: 7, scope: !980)
!1013 = !DILocation(line: 135, column: 12, scope: !1009)
!1014 = !DILocation(line: 135, column: 5, scope: !1009)
!1015 = !DILocation(line: 136, column: 1, scope: !980)
!1016 = distinct !DISubprogram(name: "fdadvise", scope: !1017, file: !1017, line: 31, type: !1018, isDefinition: true, scopeLine: 32, flags: DIFlagPrototyped, isOptimized: true, unit: !184, retainedNodes: !1023)
!1017 = !DIFile(filename: "lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!1018 = !DISubroutineType(types: !1019)
!1019 = !{null, !54, !1020, !1020, !1022}
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !1021, line: 63, baseType: !804)
!1021 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "fadvice_t", file: !21, line: 52, baseType: !20)
!1023 = !{!1024, !1025, !1026, !1027, !1028}
!1024 = !DILocalVariable(name: "fd", arg: 1, scope: !1016, file: !1017, line: 31, type: !54)
!1025 = !DILocalVariable(name: "offset", arg: 2, scope: !1016, file: !1017, line: 31, type: !1020)
!1026 = !DILocalVariable(name: "len", arg: 3, scope: !1016, file: !1017, line: 31, type: !1020)
!1027 = !DILocalVariable(name: "advice", arg: 4, scope: !1016, file: !1017, line: 31, type: !1022)
!1028 = !DILocalVariable(name: "__x", scope: !1029, file: !1017, line: 34, type: !54)
!1029 = distinct !DILexicalBlock(scope: !1016, file: !1017, line: 34, column: 3)
!1030 = !DILocation(line: 31, column: 15, scope: !1016)
!1031 = !DILocation(line: 31, column: 25, scope: !1016)
!1032 = !DILocation(line: 31, column: 39, scope: !1016)
!1033 = !DILocation(line: 31, column: 54, scope: !1016)
!1034 = !DILocation(line: 34, column: 3, scope: !1029)
!1035 = !DILocation(line: 36, column: 1, scope: !1016)
!1036 = distinct !DISubprogram(name: "fadvise", scope: !1017, file: !1017, line: 39, type: !1037, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: true, unit: !184, retainedNodes: !1073)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{null, !1039, !1022}
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !780, line: 7, baseType: !1041)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !782, line: 49, size: 1728, elements: !1042)
!1042 = !{!1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1041, file: !782, line: 51, baseType: !54, size: 32)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1041, file: !782, line: 54, baseType: !103, size: 64, offset: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1041, file: !782, line: 55, baseType: !103, size: 64, offset: 128)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1041, file: !782, line: 56, baseType: !103, size: 64, offset: 192)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1041, file: !782, line: 57, baseType: !103, size: 64, offset: 256)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1041, file: !782, line: 58, baseType: !103, size: 64, offset: 320)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1041, file: !782, line: 59, baseType: !103, size: 64, offset: 384)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1041, file: !782, line: 60, baseType: !103, size: 64, offset: 448)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1041, file: !782, line: 61, baseType: !103, size: 64, offset: 512)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1041, file: !782, line: 64, baseType: !103, size: 64, offset: 576)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1041, file: !782, line: 65, baseType: !103, size: 64, offset: 640)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1041, file: !782, line: 66, baseType: !103, size: 64, offset: 704)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1041, file: !782, line: 68, baseType: !797, size: 64, offset: 768)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1041, file: !782, line: 70, baseType: !1057, size: 64, offset: 832)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1041, file: !782, line: 72, baseType: !54, size: 32, offset: 896)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1041, file: !782, line: 73, baseType: !54, size: 32, offset: 928)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1041, file: !782, line: 74, baseType: !804, size: 64, offset: 960)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1041, file: !782, line: 77, baseType: !132, size: 16, offset: 1024)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1041, file: !782, line: 78, baseType: !808, size: 8, offset: 1040)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1041, file: !782, line: 79, baseType: !810, size: 8, offset: 1048)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1041, file: !782, line: 81, baseType: !812, size: 64, offset: 1088)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1041, file: !782, line: 89, baseType: !815, size: 64, offset: 1152)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1041, file: !782, line: 91, baseType: !817, size: 64, offset: 1216)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1041, file: !782, line: 92, baseType: !820, size: 64, offset: 1280)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1041, file: !782, line: 93, baseType: !1057, size: 64, offset: 1344)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1041, file: !782, line: 94, baseType: !33, size: 64, offset: 1408)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1041, file: !782, line: 95, baseType: !133, size: 64, offset: 1472)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1041, file: !782, line: 96, baseType: !54, size: 32, offset: 1536)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1041, file: !782, line: 98, baseType: !827, size: 160, offset: 1568)
!1073 = !{!1074, !1075}
!1074 = !DILocalVariable(name: "fp", arg: 1, scope: !1036, file: !1017, line: 39, type: !1039)
!1075 = !DILocalVariable(name: "advice", arg: 2, scope: !1036, file: !1017, line: 39, type: !1022)
!1076 = !DILocation(line: 39, column: 16, scope: !1036)
!1077 = !DILocation(line: 39, column: 30, scope: !1036)
!1078 = !DILocation(line: 41, column: 7, scope: !1079)
!1079 = distinct !DILexicalBlock(scope: !1036, file: !1017, line: 41, column: 7)
!1080 = !DILocation(line: 41, column: 7, scope: !1036)
!1081 = !DILocation(line: 42, column: 15, scope: !1079)
!1082 = !DILocation(line: 31, column: 15, scope: !1016, inlinedAt: !1083)
!1083 = distinct !DILocation(line: 42, column: 5, scope: !1079)
!1084 = !DILocation(line: 31, column: 25, scope: !1016, inlinedAt: !1083)
!1085 = !DILocation(line: 31, column: 39, scope: !1016, inlinedAt: !1083)
!1086 = !DILocation(line: 31, column: 54, scope: !1016, inlinedAt: !1083)
!1087 = !DILocation(line: 34, column: 3, scope: !1029, inlinedAt: !1083)
!1088 = !DILocation(line: 42, column: 5, scope: !1079)
!1089 = !DILocation(line: 43, column: 1, scope: !1036)
!1090 = distinct !DISubprogram(name: "umaxtostr", scope: !1091, file: !1091, line: 36, type: !1092, isDefinition: true, scopeLine: 37, flags: DIFlagPrototyped, isOptimized: true, unit: !187, retainedNodes: !1094)
!1091 = !DIFile(filename: "./lib/anytostr.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!1092 = !DISubroutineType(types: !1093)
!1093 = !{!103, !190, !103}
!1094 = !{!1095, !1096, !1097}
!1095 = !DILocalVariable(name: "i", arg: 1, scope: !1090, file: !1091, line: 36, type: !190)
!1096 = !DILocalVariable(name: "buf", arg: 2, scope: !1090, file: !1091, line: 36, type: !103)
!1097 = !DILocalVariable(name: "p", scope: !1090, file: !1091, line: 38, type: !103)
!1098 = !DILocation(line: 36, column: 19, scope: !1090)
!1099 = !DILocation(line: 36, column: 28, scope: !1090)
!1100 = !DILocation(line: 38, column: 17, scope: !1090)
!1101 = !DILocation(line: 38, column: 9, scope: !1090)
!1102 = !DILocation(line: 39, column: 6, scope: !1090)
!1103 = !DILocation(line: 41, column: 7, scope: !1090)
!1104 = !DILocation(scope: !1105)
!1105 = distinct !DILexicalBlock(scope: !1106, file: !1091, line: 50, column: 5)
!1106 = distinct !DILexicalBlock(scope: !1090, file: !1091, line: 41, column: 7)
!1107 = !DILocation(line: 52, column: 24, scope: !1105)
!1108 = !DILocation(line: 52, column: 16, scope: !1105)
!1109 = !DILocation(line: 52, column: 10, scope: !1105)
!1110 = !DILocation(line: 52, column: 14, scope: !1105)
!1111 = !DILocation(line: 53, column: 17, scope: !1105)
!1112 = !DILocation(line: 53, column: 24, scope: !1105)
!1113 = !DILocation(line: 52, column: 9, scope: !1105)
!1114 = distinct !{!1114, !1115, !1116}
!1115 = !DILocation(line: 51, column: 7, scope: !1105)
!1116 = !DILocation(line: 53, column: 28, scope: !1105)
!1117 = !DILocation(line: 56, column: 3, scope: !1090)
!1118 = distinct !DISubprogram(name: "parse_long_options", scope: !87, file: !87, line: 44, type: !1119, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: true, unit: !84, retainedNodes: !1122)
!1119 = !DISubroutineType(types: !1120)
!1120 = !{null, !54, !709, !30, !30, !30, !1121, null}
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!1122 = !{!1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131}
!1123 = !DILocalVariable(name: "argc", arg: 1, scope: !1118, file: !87, line: 44, type: !54)
!1124 = !DILocalVariable(name: "argv", arg: 2, scope: !1118, file: !87, line: 45, type: !709)
!1125 = !DILocalVariable(name: "command_name", arg: 3, scope: !1118, file: !87, line: 46, type: !30)
!1126 = !DILocalVariable(name: "package", arg: 4, scope: !1118, file: !87, line: 47, type: !30)
!1127 = !DILocalVariable(name: "version", arg: 5, scope: !1118, file: !87, line: 48, type: !30)
!1128 = !DILocalVariable(name: "usage_func", arg: 6, scope: !1118, file: !87, line: 49, type: !1121)
!1129 = !DILocalVariable(name: "c", scope: !1118, file: !87, line: 52, type: !54)
!1130 = !DILocalVariable(name: "saved_opterr", scope: !1118, file: !87, line: 53, type: !54)
!1131 = !DILocalVariable(name: "authors", scope: !1132, file: !87, line: 71, type: !1136)
!1132 = distinct !DILexicalBlock(scope: !1133, file: !87, line: 70, column: 11)
!1133 = distinct !DILexicalBlock(scope: !1134, file: !87, line: 64, column: 9)
!1134 = distinct !DILexicalBlock(scope: !1135, file: !87, line: 62, column: 5)
!1135 = distinct !DILexicalBlock(scope: !1118, file: !87, line: 60, column: 7)
!1136 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !1021, line: 52, baseType: !1137)
!1137 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !1138, line: 48, baseType: !1139)
!1138 = !DIFile(filename: "/usr/lib/clang/7.0.0/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!1139 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !85, line: 71, baseType: !1140)
!1140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1141, size: 192, elements: !58)
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !85, line: 71, size: 192, elements: !1142)
!1142 = !{!1143, !1144, !1145, !1146}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !1141, file: !85, line: 71, baseType: !7, size: 32)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !1141, file: !85, line: 71, baseType: !7, size: 32, offset: 32)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !1141, file: !85, line: 71, baseType: !33, size: 64, offset: 64)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !1141, file: !85, line: 71, baseType: !33, size: 64, offset: 128)
!1147 = !DILocation(line: 44, column: 25, scope: !1118)
!1148 = !DILocation(line: 45, column: 28, scope: !1118)
!1149 = !DILocation(line: 46, column: 33, scope: !1118)
!1150 = !DILocation(line: 47, column: 33, scope: !1118)
!1151 = !DILocation(line: 48, column: 33, scope: !1118)
!1152 = !DILocation(line: 49, column: 28, scope: !1118)
!1153 = !DILocation(line: 55, column: 18, scope: !1118)
!1154 = !DILocation(line: 53, column: 7, scope: !1118)
!1155 = !DILocation(line: 58, column: 10, scope: !1118)
!1156 = !DILocation(line: 60, column: 12, scope: !1135)
!1157 = !DILocation(line: 61, column: 7, scope: !1135)
!1158 = !DILocation(line: 61, column: 15, scope: !1135)
!1159 = !DILocation(line: 52, column: 7, scope: !1118)
!1160 = !DILocation(line: 60, column: 7, scope: !1118)
!1161 = !DILocation(line: 66, column: 11, scope: !1133)
!1162 = !DILocation(line: 67, column: 11, scope: !1133)
!1163 = !DILocation(line: 71, column: 13, scope: !1132)
!1164 = !DILocation(line: 71, column: 21, scope: !1132)
!1165 = !DILocation(line: 72, column: 13, scope: !1132)
!1166 = !DILocation(line: 73, column: 29, scope: !1132)
!1167 = !DILocation(line: 73, column: 13, scope: !1132)
!1168 = !DILocation(line: 74, column: 13, scope: !1132)
!1169 = !DILocation(line: 84, column: 10, scope: !1118)
!1170 = !DILocation(line: 88, column: 10, scope: !1118)
!1171 = !DILocation(line: 89, column: 1, scope: !1118)
!1172 = distinct !DISubprogram(name: "set_program_name", scope: !105, file: !105, line: 39, type: !638, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: true, unit: !100, retainedNodes: !1173)
!1173 = !{!1174, !1175, !1176}
!1174 = !DILocalVariable(name: "argv0", arg: 1, scope: !1172, file: !105, line: 39, type: !30)
!1175 = !DILocalVariable(name: "slash", scope: !1172, file: !105, line: 46, type: !30)
!1176 = !DILocalVariable(name: "base", scope: !1172, file: !105, line: 47, type: !30)
!1177 = !DILocation(line: 39, column: 31, scope: !1172)
!1178 = !DILocation(line: 51, column: 13, scope: !1179)
!1179 = distinct !DILexicalBlock(scope: !1172, file: !105, line: 51, column: 7)
!1180 = !DILocation(line: 51, column: 7, scope: !1172)
!1181 = !DILocation(line: 55, column: 14, scope: !1182)
!1182 = distinct !DILexicalBlock(scope: !1179, file: !105, line: 52, column: 5)
!1183 = !DILocation(line: 54, column: 7, scope: !1182)
!1184 = !DILocation(line: 56, column: 7, scope: !1182)
!1185 = !DILocation(line: 59, column: 11, scope: !1172)
!1186 = !DILocation(line: 46, column: 15, scope: !1172)
!1187 = !DILocation(line: 60, column: 17, scope: !1172)
!1188 = !DILocation(line: 60, column: 33, scope: !1172)
!1189 = !DILocation(line: 60, column: 11, scope: !1172)
