source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [40 x i8] c"Usage: %s [FILE]...\0A  or:  %s [OPTION]\0A\00", align 1
@.str.2 = private unnamed_addr constant [51 x i8] c"Print CRC checksum and byte counts of each FILE.\0A\0A\00", align 1
@stdout = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str.3 = private unnamed_addr constant [45 x i8] c"      --help     display this help and exit\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 169, type: !130, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !29, globals: !152, nameTableKind: None)
!3 = !DIFile(filename: "src/cksum.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !20}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!9 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 45, baseType: !7, size: 32, elements: !22)
!21 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!22 = !{!23, !24, !25, !26, !27, !28}
!23 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0, isUnsigned: true)
!24 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2, isUnsigned: true)
!25 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5, isUnsigned: true)
!26 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4, isUnsigned: true)
!27 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3, isUnsigned: true)
!28 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1, isUnsigned: true)
!29 = !{!30, !40, !101, !105, !109, !112, !115, !122, !36, !91, !125, !134, !138, !142, !145, !148, !7}
!30 = !DISubprogram(name: "dcgettext", scope: !31, file: !31, line: 51, type: !32, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!31 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!32 = !DISubroutineType(types: !33)
!33 = !{!34, !36, !36, !38}
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!38 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!39 = !{}
!40 = !DISubprogram(name: "fputs_unlocked", scope: !41, file: !41, line: 662, type: !42, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!41 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!42 = !DISubroutineType(types: !43)
!43 = !{!38, !36, !44}
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !46, line: 49, size: 1728, elements: !47)
!46 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!47 = !{!48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !63, !64, !65, !66, !70, !72, !74, !78, !81, !83, !86, !89, !90, !92, !96, !97}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !45, file: !46, line: 51, baseType: !38, size: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !45, file: !46, line: 54, baseType: !34, size: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !45, file: !46, line: 55, baseType: !34, size: 64, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !45, file: !46, line: 56, baseType: !34, size: 64, offset: 192)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !45, file: !46, line: 57, baseType: !34, size: 64, offset: 256)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !45, file: !46, line: 58, baseType: !34, size: 64, offset: 320)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !45, file: !46, line: 59, baseType: !34, size: 64, offset: 384)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !45, file: !46, line: 60, baseType: !34, size: 64, offset: 448)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !45, file: !46, line: 61, baseType: !34, size: 64, offset: 512)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !45, file: !46, line: 64, baseType: !34, size: 64, offset: 576)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !45, file: !46, line: 65, baseType: !34, size: 64, offset: 640)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !45, file: !46, line: 66, baseType: !34, size: 64, offset: 704)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !45, file: !46, line: 68, baseType: !61, size: 64, offset: 768)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !46, line: 36, flags: DIFlagFwdDecl)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !45, file: !46, line: 70, baseType: !44, size: 64, offset: 832)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !45, file: !46, line: 72, baseType: !38, size: 32, offset: 896)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !45, file: !46, line: 73, baseType: !38, size: 32, offset: 928)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !45, file: !46, line: 74, baseType: !67, size: 64, offset: 960)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !68, line: 152, baseType: !69)
!68 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!69 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !45, file: !46, line: 77, baseType: !71, size: 16, offset: 1024)
!71 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !45, file: !46, line: 78, baseType: !73, size: 8, offset: 1040)
!73 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !45, file: !46, line: 79, baseType: !75, size: 8, offset: 1048)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 8, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 1)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !45, file: !46, line: 81, baseType: !79, size: 64, offset: 1088)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !46, line: 43, baseType: null)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !45, file: !46, line: 89, baseType: !82, size: 64, offset: 1152)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !68, line: 153, baseType: !69)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !45, file: !46, line: 91, baseType: !84, size: 64, offset: 1216)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !46, line: 37, flags: DIFlagFwdDecl)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !45, file: !46, line: 92, baseType: !87, size: 64, offset: 1280)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !46, line: 38, flags: DIFlagFwdDecl)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !45, file: !46, line: 93, baseType: !44, size: 64, offset: 1344)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !45, file: !46, line: 94, baseType: !91, size: 64, offset: 1408)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !45, file: !46, line: 95, baseType: !93, size: 64, offset: 1472)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !94, line: 46, baseType: !95)
!94 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!95 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !45, file: !46, line: 96, baseType: !38, size: 32, offset: 1536)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !45, file: !46, line: 98, baseType: !98, size: 160, offset: 1568)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 160, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 20)
!101 = !DISubprogram(name: "set_program_name", scope: !102, file: !102, line: 37, type: !103, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!102 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!103 = !DISubroutineType(types: !104)
!104 = !{null, !36}
!105 = !DISubprogram(name: "setlocale", scope: !106, file: !106, line: 122, type: !107, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!106 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!107 = !DISubroutineType(types: !108)
!108 = !{!34, !38, !36}
!109 = !DISubprogram(name: "bindtextdomain", scope: !31, file: !31, line: 86, type: !110, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!110 = !DISubroutineType(types: !111)
!111 = !{!34, !36, !36}
!112 = !DISubprogram(name: "textdomain", scope: !31, file: !31, line: 82, type: !113, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!113 = !DISubroutineType(types: !114)
!114 = !{!34, !36}
!115 = !DISubprogram(name: "atexit", scope: !116, file: !116, line: 595, type: !117, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!116 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!117 = !DISubroutineType(types: !118)
!118 = !{!38, !119}
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{null}
!122 = !DISubprogram(name: "setvbuf", scope: !41, file: !41, line: 308, type: !123, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!123 = !DISubroutineType(types: !124)
!124 = !{!38, !44, !34, !38, !95}
!125 = !DISubprogram(name: "parse_gnu_standard_options_only", scope: !126, file: !126, line: 33, type: !127, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!126 = !DIFile(filename: "./lib/long-options.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!127 = !DISubroutineType(types: !128)
!128 = !{null, !38, !129, !36, !36, !36, !130, !131, null}
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!130 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{null, !38}
!134 = !DISubprogram(name: "rpl_fclose", scope: !135, file: !135, line: 672, type: !136, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!135 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!136 = !DISubroutineType(types: !137)
!137 = !{!38, !44}
!138 = !DISubprogram(name: "error", scope: !139, file: !139, line: 52, type: !140, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!139 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!140 = !DISubroutineType(types: !141)
!141 = !{null, !38, !38, !36, null}
!142 = !DISubprogram(name: "quotearg_n_style_colon", scope: !6, file: !6, line: 397, type: !143, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!143 = !DISubroutineType(types: !144)
!144 = !{!34, !38, !5, !36}
!145 = !DISubprogram(name: "fadvise", scope: !21, file: !21, line: 72, type: !146, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!146 = !DISubroutineType(types: !147)
!147 = !{null, !44, !20}
!148 = !DISubprogram(name: "umaxtostr", scope: !149, file: !149, line: 46, type: !150, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!149 = !DIFile(filename: "./lib/inttostr.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!150 = !DISubroutineType(types: !151)
!151 = !{!34, !95, !34}
!152 = !{!153, !154}
!153 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(name: "crctab", scope: !2, file: !3, line: 112, type: !156, isLocal: true, isDefinition: true)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !157, size: 16384, elements: !160)
!157 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !158)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !159, line: 74, baseType: !95)
!159 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!160 = !{!161}
!161 = !DISubrange(count: 256)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(name: "Version", scope: !164, file: !165, line: 2, type: !36, isDefinition: true)
!164 = distinct !DICompileUnit(language: DW_LANG_C99, file: !165, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !39, globals: !166, nameTableKind: None)
!165 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!166 = !{!162}
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(name: "file_name", scope: !169, file: !170, line: 46, type: !36, isLocal: true, isDefinition: true)
!169 = distinct !DICompileUnit(language: DW_LANG_C99, file: !170, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !39, retainedTypes: !171, globals: !209, nameTableKind: None)
!170 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!171 = !{!172, !30, !208, !138}
!172 = !DISubprogram(name: "close_stream", scope: !173, file: !173, line: 2, type: !174, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!173 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!174 = !DISubroutineType(types: !175)
!175 = !{!38, !176}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !46, line: 49, size: 1728, elements: !178)
!178 = !{!179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !177, file: !46, line: 51, baseType: !38, size: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !177, file: !46, line: 54, baseType: !34, size: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !177, file: !46, line: 55, baseType: !34, size: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !177, file: !46, line: 56, baseType: !34, size: 64, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !177, file: !46, line: 57, baseType: !34, size: 64, offset: 256)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !177, file: !46, line: 58, baseType: !34, size: 64, offset: 320)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !177, file: !46, line: 59, baseType: !34, size: 64, offset: 384)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !177, file: !46, line: 60, baseType: !34, size: 64, offset: 448)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !177, file: !46, line: 61, baseType: !34, size: 64, offset: 512)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !177, file: !46, line: 64, baseType: !34, size: 64, offset: 576)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !177, file: !46, line: 65, baseType: !34, size: 64, offset: 640)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !177, file: !46, line: 66, baseType: !34, size: 64, offset: 704)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !177, file: !46, line: 68, baseType: !61, size: 64, offset: 768)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !177, file: !46, line: 70, baseType: !176, size: 64, offset: 832)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !177, file: !46, line: 72, baseType: !38, size: 32, offset: 896)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !177, file: !46, line: 73, baseType: !38, size: 32, offset: 928)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !177, file: !46, line: 74, baseType: !67, size: 64, offset: 960)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !177, file: !46, line: 77, baseType: !71, size: 16, offset: 1024)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !177, file: !46, line: 78, baseType: !73, size: 8, offset: 1040)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !177, file: !46, line: 79, baseType: !75, size: 8, offset: 1048)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !177, file: !46, line: 81, baseType: !79, size: 64, offset: 1088)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !177, file: !46, line: 89, baseType: !82, size: 64, offset: 1152)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !177, file: !46, line: 91, baseType: !84, size: 64, offset: 1216)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !177, file: !46, line: 92, baseType: !87, size: 64, offset: 1280)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !177, file: !46, line: 93, baseType: !176, size: 64, offset: 1344)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !177, file: !46, line: 94, baseType: !91, size: 64, offset: 1408)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !177, file: !46, line: 95, baseType: !93, size: 64, offset: 1472)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !177, file: !46, line: 96, baseType: !38, size: 32, offset: 1536)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !177, file: !46, line: 98, baseType: !98, size: 160, offset: 1568)
!208 = !DISubprogram(name: "quotearg_colon", scope: !6, file: !6, line: 391, type: !113, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!209 = !{!167, !210}
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !169, file: !170, line: 56, type: !130, isLocal: true, isDefinition: true)
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(name: "exit_failure", scope: !214, file: !215, line: 24, type: !217, isDefinition: true)
!214 = distinct !DICompileUnit(language: DW_LANG_C99, file: !215, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !39, globals: !216, nameTableKind: None)
!215 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!216 = !{!212}
!217 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !38)
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(name: "long_options", scope: !220, file: !221, line: 34, type: !282, isLocal: true, isDefinition: true)
!220 = distinct !DICompileUnit(language: DW_LANG_C99, file: !221, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !39, retainedTypes: !222, globals: !281, nameTableKind: None)
!221 = !DIFile(filename: "lib/long-options.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!222 = !{!223, !238}
!223 = !DISubprogram(name: "getopt_long", scope: !224, file: !224, line: 66, type: !225, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!224 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!225 = !DISubroutineType(types: !226)
!226 = !{!38, !38, !227, !36, !229, !236}
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !231)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !224, line: 50, size: 256, elements: !232)
!232 = !{!233, !234, !235, !237}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !231, file: !224, line: 52, baseType: !36, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !231, file: !224, line: 55, baseType: !38, size: 32, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !231, file: !224, line: 56, baseType: !236, size: 64, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !231, file: !224, line: 57, baseType: !38, size: 32, offset: 192)
!238 = !DISubprogram(name: "version_etc_va", scope: !239, file: !239, line: 63, type: !240, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!239 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!240 = !DISubroutineType(types: !241)
!241 = !{null, !242, !36, !36, !36, !274}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !46, line: 49, size: 1728, elements: !244)
!244 = !{!245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !243, file: !46, line: 51, baseType: !38, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !243, file: !46, line: 54, baseType: !34, size: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !243, file: !46, line: 55, baseType: !34, size: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !243, file: !46, line: 56, baseType: !34, size: 64, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !243, file: !46, line: 57, baseType: !34, size: 64, offset: 256)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !243, file: !46, line: 58, baseType: !34, size: 64, offset: 320)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !243, file: !46, line: 59, baseType: !34, size: 64, offset: 384)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !243, file: !46, line: 60, baseType: !34, size: 64, offset: 448)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !243, file: !46, line: 61, baseType: !34, size: 64, offset: 512)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !243, file: !46, line: 64, baseType: !34, size: 64, offset: 576)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !243, file: !46, line: 65, baseType: !34, size: 64, offset: 640)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !243, file: !46, line: 66, baseType: !34, size: 64, offset: 704)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !243, file: !46, line: 68, baseType: !61, size: 64, offset: 768)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !243, file: !46, line: 70, baseType: !242, size: 64, offset: 832)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !243, file: !46, line: 72, baseType: !38, size: 32, offset: 896)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !243, file: !46, line: 73, baseType: !38, size: 32, offset: 928)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !243, file: !46, line: 74, baseType: !67, size: 64, offset: 960)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !243, file: !46, line: 77, baseType: !71, size: 16, offset: 1024)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !243, file: !46, line: 78, baseType: !73, size: 8, offset: 1040)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !243, file: !46, line: 79, baseType: !75, size: 8, offset: 1048)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !243, file: !46, line: 81, baseType: !79, size: 64, offset: 1088)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !243, file: !46, line: 89, baseType: !82, size: 64, offset: 1152)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !243, file: !46, line: 91, baseType: !84, size: 64, offset: 1216)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !243, file: !46, line: 92, baseType: !87, size: 64, offset: 1280)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !243, file: !46, line: 93, baseType: !242, size: 64, offset: 1344)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !243, file: !46, line: 94, baseType: !91, size: 64, offset: 1408)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !243, file: !46, line: 95, baseType: !93, size: 64, offset: 1472)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !243, file: !46, line: 96, baseType: !38, size: 32, offset: 1536)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !243, file: !46, line: 98, baseType: !98, size: 160, offset: 1568)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !221, line: 72, size: 192, elements: !276)
!276 = !{!277, !278, !279, !280}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !275, file: !221, line: 72, baseType: !7, size: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !275, file: !221, line: 72, baseType: !7, size: 32, offset: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !275, file: !221, line: 72, baseType: !91, size: 64, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !275, file: !221, line: 72, baseType: !91, size: 64, offset: 128)
!281 = !{!218}
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !230, size: 768, elements: !283)
!283 = !{!284}
!284 = !DISubrange(count: 3)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(name: "program_name", scope: !287, file: !288, line: 33, type: !36, isDefinition: true)
!287 = distinct !DICompileUnit(language: DW_LANG_C99, file: !288, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !39, retainedTypes: !289, globals: !325, nameTableKind: None)
!288 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!289 = !{!91, !290, !34}
!290 = !DISubprogram(name: "fputs", scope: !41, file: !41, line: 626, type: !291, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!291 = !DISubroutineType(types: !292)
!292 = !{!38, !36, !293}
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !46, line: 49, size: 1728, elements: !295)
!295 = !{!296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !294, file: !46, line: 51, baseType: !38, size: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !294, file: !46, line: 54, baseType: !34, size: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !294, file: !46, line: 55, baseType: !34, size: 64, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !294, file: !46, line: 56, baseType: !34, size: 64, offset: 192)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !294, file: !46, line: 57, baseType: !34, size: 64, offset: 256)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !294, file: !46, line: 58, baseType: !34, size: 64, offset: 320)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !294, file: !46, line: 59, baseType: !34, size: 64, offset: 384)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !294, file: !46, line: 60, baseType: !34, size: 64, offset: 448)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !294, file: !46, line: 61, baseType: !34, size: 64, offset: 512)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !294, file: !46, line: 64, baseType: !34, size: 64, offset: 576)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !294, file: !46, line: 65, baseType: !34, size: 64, offset: 640)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !294, file: !46, line: 66, baseType: !34, size: 64, offset: 704)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !294, file: !46, line: 68, baseType: !61, size: 64, offset: 768)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !294, file: !46, line: 70, baseType: !293, size: 64, offset: 832)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !294, file: !46, line: 72, baseType: !38, size: 32, offset: 896)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !294, file: !46, line: 73, baseType: !38, size: 32, offset: 928)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !294, file: !46, line: 74, baseType: !67, size: 64, offset: 960)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !294, file: !46, line: 77, baseType: !71, size: 16, offset: 1024)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !294, file: !46, line: 78, baseType: !73, size: 8, offset: 1040)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !294, file: !46, line: 79, baseType: !75, size: 8, offset: 1048)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !294, file: !46, line: 81, baseType: !79, size: 64, offset: 1088)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !294, file: !46, line: 89, baseType: !82, size: 64, offset: 1152)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !294, file: !46, line: 91, baseType: !84, size: 64, offset: 1216)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !294, file: !46, line: 92, baseType: !87, size: 64, offset: 1280)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !294, file: !46, line: 93, baseType: !293, size: 64, offset: 1344)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !294, file: !46, line: 94, baseType: !91, size: 64, offset: 1408)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !294, file: !46, line: 95, baseType: !93, size: 64, offset: 1472)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !294, file: !46, line: 96, baseType: !38, size: 32, offset: 1536)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !294, file: !46, line: 98, baseType: !98, size: 160, offset: 1568)
!325 = !{!285}
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !328, file: !329, line: 85, type: !447, isDefinition: true)
!328 = distinct !DICompileUnit(language: DW_LANG_C99, file: !329, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !330, retainedTypes: !351, globals: !422, nameTableKind: None)
!329 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!330 = !{!5, !331, !336}
!331 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, baseType: !7, size: 32, elements: !332)
!332 = !{!333, !334, !335}
!333 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!334 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!335 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!336 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !337, line: 46, baseType: !7, size: 32, elements: !338)
!337 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!338 = !{!339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350}
!339 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!340 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!341 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!342 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!343 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!344 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!345 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!346 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!347 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!348 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!349 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!350 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!351 = !{!352, !358, !374, !377, !38, !71, !380, !93, !397, !401, !30, !407, !411, !34, !415, !418, !419}
!352 = !DISubprogram(name: "xmemdup", scope: !353, file: !353, line: 62, type: !354, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!353 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!354 = !DISubroutineType(types: !355)
!355 = !{!91, !356, !95}
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!358 = !DISubprogram(name: "quotearg_alloc_mem", scope: !6, file: !6, line: 342, type: !359, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!359 = !DISubroutineType(types: !360)
!360 = !{!34, !36, !95, !361, !362}
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !364)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !329, line: 65, size: 448, elements: !365)
!365 = !{!366, !367, !368, !372, !373}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !364, file: !329, line: 68, baseType: !5, size: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !364, file: !329, line: 71, baseType: !38, size: 32, offset: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !364, file: !329, line: 75, baseType: !369, size: 256, offset: 64)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !370)
!370 = !{!371}
!371 = !DISubrange(count: 8)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !364, file: !329, line: 78, baseType: !36, size: 64, offset: 320)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !364, file: !329, line: 81, baseType: !36, size: 64, offset: 384)
!374 = !DISubprogram(name: "free", scope: !116, file: !116, line: 565, type: !375, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!375 = !DISubroutineType(types: !376)
!376 = !{null, !91}
!377 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !6, file: !6, line: 408, type: !378, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!378 = !DISubroutineType(types: !379)
!379 = !{!34, !38, !36, !36, !36, !95}
!380 = !DISubprogram(name: "rpl_mbrtowc", scope: !381, file: !381, line: 717, type: !382, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!381 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!382 = !DISubroutineType(types: !383)
!383 = !{!95, !236, !36, !95, !384}
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !386, line: 13, size: 64, elements: !387)
!386 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!387 = !{!388, !389}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !385, file: !386, line: 15, baseType: !38, size: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !385, file: !386, line: 20, baseType: !390, size: 32, offset: 32)
!390 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !385, file: !386, line: 16, size: 32, elements: !391)
!391 = !{!392, !393}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !390, file: !386, line: 18, baseType: !7, size: 32)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !390, file: !386, line: 19, baseType: !394, size: 32)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 32, elements: !395)
!395 = !{!396}
!396 = !DISubrange(count: 4)
!397 = !DISubprogram(name: "iswprint", scope: !398, file: !398, line: 120, type: !399, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!398 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!399 = !DISubroutineType(types: !400)
!400 = !{!38, !7}
!401 = !DISubprogram(name: "mbsinit", scope: !402, file: !402, line: 292, type: !403, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!402 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!403 = !DISubroutineType(types: !404)
!404 = !{!38, !405}
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !385)
!407 = !DISubprogram(name: "locale_charset", scope: !408, file: !408, line: 35, type: !409, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!408 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!409 = !DISubroutineType(types: !410)
!410 = !{!36}
!411 = !DISubprogram(name: "c_strcasecmp", scope: !412, file: !412, line: 42, type: !413, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!412 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!413 = !DISubroutineType(types: !414)
!414 = !{!38, !36, !36}
!415 = !DISubprogram(name: "xmalloc", scope: !353, file: !353, line: 53, type: !416, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!416 = !DISubroutineType(types: !417)
!417 = !{!91, !95}
!418 = !DISubprogram(name: "xalloc_die", scope: !353, file: !353, line: 51, type: !120, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !39)
!419 = !DISubprogram(name: "xrealloc", scope: !353, file: !353, line: 59, type: !420, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!420 = !DISubroutineType(types: !421)
!421 = !{!91, !91, !95}
!422 = !{!326, !423, !429, !431, !433, !436, !443, !445}
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !328, file: !329, line: 101, type: !425, isDefinition: true)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !426, size: 320, elements: !427)
!426 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!427 = !{!428}
!428 = !DISubrange(count: 10)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !328, file: !329, line: 1052, type: !364, isDefinition: true)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !328, file: !329, line: 116, type: !364, isLocal: true, isDefinition: true)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(name: "slot0", scope: !328, file: !329, line: 842, type: !435, isLocal: true, isDefinition: true)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 2048, elements: !160)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(name: "slotvec", scope: !328, file: !329, line: 845, type: !438, isLocal: true, isDefinition: true)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !329, line: 834, size: 128, elements: !440)
!440 = !{!441, !442}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !439, file: !329, line: 836, baseType: !93, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !439, file: !329, line: 837, baseType: !34, size: 64, offset: 64)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(name: "nslots", scope: !328, file: !329, line: 843, type: !38, isLocal: true, isDefinition: true)
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(name: "slotvec0", scope: !328, file: !329, line: 844, type: !439, isLocal: true, isDefinition: true)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !448, size: 704, elements: !449)
!448 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!449 = !{!450}
!450 = !DISubrange(count: 11)
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !453, file: !454, line: 26, type: !456, isDefinition: true)
!453 = distinct !DICompileUnit(language: DW_LANG_C99, file: !454, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !39, globals: !455, nameTableKind: None)
!454 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!455 = !{!451}
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 376, elements: !457)
!457 = !{!458}
!458 = !DISubrange(count: 47)
!459 = distinct !DICompileUnit(language: DW_LANG_C99, file: !460, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !461, retainedTypes: !462, nameTableKind: None)
!460 = !DIFile(filename: "lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!461 = !{!20}
!462 = !{!463, !467}
!463 = !DISubprogram(name: "posix_fadvise", scope: !464, file: !464, line: 288, type: !465, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!464 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
!465 = !DISubroutineType(types: !466)
!466 = !{!38, !38, !69, !69, !38}
!467 = !DISubprogram(name: "fileno", scope: !41, file: !41, line: 786, type: !468, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!468 = !DISubroutineType(types: !469)
!469 = !{!38, !470}
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !46, line: 49, size: 1728, elements: !472)
!472 = !{!473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !471, file: !46, line: 51, baseType: !38, size: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !471, file: !46, line: 54, baseType: !34, size: 64, offset: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !471, file: !46, line: 55, baseType: !34, size: 64, offset: 128)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !471, file: !46, line: 56, baseType: !34, size: 64, offset: 192)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !471, file: !46, line: 57, baseType: !34, size: 64, offset: 256)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !471, file: !46, line: 58, baseType: !34, size: 64, offset: 320)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !471, file: !46, line: 59, baseType: !34, size: 64, offset: 384)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !471, file: !46, line: 60, baseType: !34, size: 64, offset: 448)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !471, file: !46, line: 61, baseType: !34, size: 64, offset: 512)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !471, file: !46, line: 64, baseType: !34, size: 64, offset: 576)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !471, file: !46, line: 65, baseType: !34, size: 64, offset: 640)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !471, file: !46, line: 66, baseType: !34, size: 64, offset: 704)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !471, file: !46, line: 68, baseType: !61, size: 64, offset: 768)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !471, file: !46, line: 70, baseType: !470, size: 64, offset: 832)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !471, file: !46, line: 72, baseType: !38, size: 32, offset: 896)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !471, file: !46, line: 73, baseType: !38, size: 32, offset: 928)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !471, file: !46, line: 74, baseType: !67, size: 64, offset: 960)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !471, file: !46, line: 77, baseType: !71, size: 16, offset: 1024)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !471, file: !46, line: 78, baseType: !73, size: 8, offset: 1040)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !471, file: !46, line: 79, baseType: !75, size: 8, offset: 1048)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !471, file: !46, line: 81, baseType: !79, size: 64, offset: 1088)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !471, file: !46, line: 89, baseType: !82, size: 64, offset: 1152)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !471, file: !46, line: 91, baseType: !84, size: 64, offset: 1216)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !471, file: !46, line: 92, baseType: !87, size: 64, offset: 1280)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !471, file: !46, line: 93, baseType: !470, size: 64, offset: 1344)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !471, file: !46, line: 94, baseType: !91, size: 64, offset: 1408)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !471, file: !46, line: 95, baseType: !93, size: 64, offset: 1472)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !471, file: !46, line: 96, baseType: !38, size: 32, offset: 1536)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !471, file: !46, line: 98, baseType: !98, size: 160, offset: 1568)
!502 = distinct !DICompileUnit(language: DW_LANG_C99, file: !503, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !39, retainedTypes: !504, nameTableKind: None)
!503 = !DIFile(filename: "lib/umaxtostr.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!504 = !{!505}
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !159, line: 102, baseType: !506)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !68, line: 73, baseType: !95)
!507 = distinct !DICompileUnit(language: DW_LANG_C99, file: !508, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !509, retainedTypes: !513, nameTableKind: None)
!508 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!509 = !{!510}
!510 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !508, line: 40, baseType: !7, size: 32, elements: !511)
!511 = !{!512}
!512 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!513 = !{!30, !514, !91}
!514 = !DISubprogram(name: "fputs_unlocked", scope: !41, file: !41, line: 662, type: !515, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!515 = !DISubroutineType(types: !516)
!516 = !{!38, !36, !517}
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !46, line: 49, size: 1728, elements: !519)
!519 = !{!520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !518, file: !46, line: 51, baseType: !38, size: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !518, file: !46, line: 54, baseType: !34, size: 64, offset: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !518, file: !46, line: 55, baseType: !34, size: 64, offset: 128)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !518, file: !46, line: 56, baseType: !34, size: 64, offset: 192)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !518, file: !46, line: 57, baseType: !34, size: 64, offset: 256)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !518, file: !46, line: 58, baseType: !34, size: 64, offset: 320)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !518, file: !46, line: 59, baseType: !34, size: 64, offset: 384)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !518, file: !46, line: 60, baseType: !34, size: 64, offset: 448)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !518, file: !46, line: 61, baseType: !34, size: 64, offset: 512)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !518, file: !46, line: 64, baseType: !34, size: 64, offset: 576)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !518, file: !46, line: 65, baseType: !34, size: 64, offset: 640)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !518, file: !46, line: 66, baseType: !34, size: 64, offset: 704)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !518, file: !46, line: 68, baseType: !61, size: 64, offset: 768)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !518, file: !46, line: 70, baseType: !517, size: 64, offset: 832)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !518, file: !46, line: 72, baseType: !38, size: 32, offset: 896)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !518, file: !46, line: 73, baseType: !38, size: 32, offset: 928)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !518, file: !46, line: 74, baseType: !67, size: 64, offset: 960)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !518, file: !46, line: 77, baseType: !71, size: 16, offset: 1024)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !518, file: !46, line: 78, baseType: !73, size: 8, offset: 1040)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !518, file: !46, line: 79, baseType: !75, size: 8, offset: 1048)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !518, file: !46, line: 81, baseType: !79, size: 64, offset: 1088)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !518, file: !46, line: 89, baseType: !82, size: 64, offset: 1152)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !518, file: !46, line: 91, baseType: !84, size: 64, offset: 1216)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !518, file: !46, line: 92, baseType: !87, size: 64, offset: 1280)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !518, file: !46, line: 93, baseType: !517, size: 64, offset: 1344)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !518, file: !46, line: 94, baseType: !91, size: 64, offset: 1408)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !518, file: !46, line: 95, baseType: !93, size: 64, offset: 1472)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !518, file: !46, line: 96, baseType: !38, size: 32, offset: 1536)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !518, file: !46, line: 98, baseType: !98, size: 160, offset: 1568)
!549 = distinct !DICompileUnit(language: DW_LANG_C99, file: !550, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !551, retainedTypes: !564, nameTableKind: None)
!550 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!551 = !{!552}
!552 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !553, file: !353, line: 186, baseType: !7, size: 32, elements: !562)
!553 = distinct !DISubprogram(name: "x2nrealloc", scope: !353, file: !353, line: 174, type: !554, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !549, retainedNodes: !557)
!554 = !DISubroutineType(types: !555)
!555 = !{!91, !91, !556, !93}
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!557 = !{!558, !559, !560, !561}
!558 = !DILocalVariable(name: "p", arg: 1, scope: !553, file: !353, line: 174, type: !91)
!559 = !DILocalVariable(name: "pn", arg: 2, scope: !553, file: !353, line: 174, type: !556)
!560 = !DILocalVariable(name: "s", arg: 3, scope: !553, file: !353, line: 174, type: !93)
!561 = !DILocalVariable(name: "n", scope: !553, file: !353, line: 176, type: !93)
!562 = !{!563}
!563 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!564 = !{!93, !418, !415, !419, !34, !374, !91, !565, !568}
!565 = !DISubprogram(name: "xcalloc", scope: !353, file: !353, line: 57, type: !566, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!566 = !DISubroutineType(types: !567)
!567 = !{!91, !95, !95}
!568 = !DISubprogram(name: "rpl_calloc", scope: !569, file: !569, line: 688, type: !566, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!569 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!570 = distinct !DICompileUnit(language: DW_LANG_C99, file: !571, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !39, retainedTypes: !572, nameTableKind: None)
!571 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!572 = !{!30, !138}
!573 = distinct !DICompileUnit(language: DW_LANG_C99, file: !574, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !39, retainedTypes: !575, nameTableKind: None)
!574 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!575 = !{!91}
!576 = distinct !DICompileUnit(language: DW_LANG_C99, file: !577, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !39, retainedTypes: !578, nameTableKind: None)
!577 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!578 = !{!579, !614, !615, !619}
!579 = !DISubprogram(name: "fileno", scope: !41, file: !41, line: 786, type: !580, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!580 = !DISubroutineType(types: !581)
!581 = !{!38, !582}
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !46, line: 49, size: 1728, elements: !584)
!584 = !{!585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !583, file: !46, line: 51, baseType: !38, size: 32)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !583, file: !46, line: 54, baseType: !34, size: 64, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !583, file: !46, line: 55, baseType: !34, size: 64, offset: 128)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !583, file: !46, line: 56, baseType: !34, size: 64, offset: 192)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !583, file: !46, line: 57, baseType: !34, size: 64, offset: 256)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !583, file: !46, line: 58, baseType: !34, size: 64, offset: 320)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !583, file: !46, line: 59, baseType: !34, size: 64, offset: 384)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !583, file: !46, line: 60, baseType: !34, size: 64, offset: 448)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !583, file: !46, line: 61, baseType: !34, size: 64, offset: 512)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !583, file: !46, line: 64, baseType: !34, size: 64, offset: 576)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !583, file: !46, line: 65, baseType: !34, size: 64, offset: 640)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !583, file: !46, line: 66, baseType: !34, size: 64, offset: 704)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !583, file: !46, line: 68, baseType: !61, size: 64, offset: 768)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !583, file: !46, line: 70, baseType: !582, size: 64, offset: 832)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !583, file: !46, line: 72, baseType: !38, size: 32, offset: 896)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !583, file: !46, line: 73, baseType: !38, size: 32, offset: 928)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !583, file: !46, line: 74, baseType: !67, size: 64, offset: 960)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !583, file: !46, line: 77, baseType: !71, size: 16, offset: 1024)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !583, file: !46, line: 78, baseType: !73, size: 8, offset: 1040)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !583, file: !46, line: 79, baseType: !75, size: 8, offset: 1048)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !583, file: !46, line: 81, baseType: !79, size: 64, offset: 1088)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !583, file: !46, line: 89, baseType: !82, size: 64, offset: 1152)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !583, file: !46, line: 91, baseType: !84, size: 64, offset: 1216)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !583, file: !46, line: 92, baseType: !87, size: 64, offset: 1280)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !583, file: !46, line: 93, baseType: !582, size: 64, offset: 1344)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !583, file: !46, line: 94, baseType: !91, size: 64, offset: 1408)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !583, file: !46, line: 95, baseType: !93, size: 64, offset: 1472)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !583, file: !46, line: 96, baseType: !38, size: 32, offset: 1536)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !583, file: !46, line: 98, baseType: !98, size: 160, offset: 1568)
!614 = !DISubprogram(name: "fclose", scope: !41, file: !41, line: 213, type: !580, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!615 = !DISubprogram(name: "lseek", scope: !616, file: !616, line: 334, type: !617, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!616 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!617 = !DISubroutineType(types: !618)
!618 = !{!69, !38, !69, !38}
!619 = !DISubprogram(name: "rpl_fflush", scope: !135, file: !135, line: 718, type: !580, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!620 = distinct !DICompileUnit(language: DW_LANG_C99, file: !621, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !39, retainedTypes: !622, nameTableKind: None)
!621 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!622 = !{!91, !623, !658}
!623 = !DISubprogram(name: "fflush", scope: !41, file: !41, line: 218, type: !624, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!624 = !DISubroutineType(types: !625)
!625 = !{!38, !626}
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !46, line: 49, size: 1728, elements: !628)
!628 = !{!629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !627, file: !46, line: 51, baseType: !38, size: 32)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !627, file: !46, line: 54, baseType: !34, size: 64, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !627, file: !46, line: 55, baseType: !34, size: 64, offset: 128)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !627, file: !46, line: 56, baseType: !34, size: 64, offset: 192)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !627, file: !46, line: 57, baseType: !34, size: 64, offset: 256)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !627, file: !46, line: 58, baseType: !34, size: 64, offset: 320)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !627, file: !46, line: 59, baseType: !34, size: 64, offset: 384)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !627, file: !46, line: 60, baseType: !34, size: 64, offset: 448)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !627, file: !46, line: 61, baseType: !34, size: 64, offset: 512)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !627, file: !46, line: 64, baseType: !34, size: 64, offset: 576)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !627, file: !46, line: 65, baseType: !34, size: 64, offset: 640)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !627, file: !46, line: 66, baseType: !34, size: 64, offset: 704)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !627, file: !46, line: 68, baseType: !61, size: 64, offset: 768)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !627, file: !46, line: 70, baseType: !626, size: 64, offset: 832)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !627, file: !46, line: 72, baseType: !38, size: 32, offset: 896)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !627, file: !46, line: 73, baseType: !38, size: 32, offset: 928)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !627, file: !46, line: 74, baseType: !67, size: 64, offset: 960)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !627, file: !46, line: 77, baseType: !71, size: 16, offset: 1024)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !627, file: !46, line: 78, baseType: !73, size: 8, offset: 1040)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !627, file: !46, line: 79, baseType: !75, size: 8, offset: 1048)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !627, file: !46, line: 81, baseType: !79, size: 64, offset: 1088)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !627, file: !46, line: 89, baseType: !82, size: 64, offset: 1152)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !627, file: !46, line: 91, baseType: !84, size: 64, offset: 1216)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !627, file: !46, line: 92, baseType: !87, size: 64, offset: 1280)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !627, file: !46, line: 93, baseType: !626, size: 64, offset: 1344)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !627, file: !46, line: 94, baseType: !91, size: 64, offset: 1408)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !627, file: !46, line: 95, baseType: !93, size: 64, offset: 1472)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !627, file: !46, line: 96, baseType: !38, size: 32, offset: 1536)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !627, file: !46, line: 98, baseType: !98, size: 160, offset: 1568)
!658 = !DISubprogram(name: "rpl_fseeko", scope: !135, file: !135, line: 1034, type: !659, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!659 = !DISubroutineType(types: !660)
!660 = !{!38, !626, !69, !38}
!661 = distinct !DICompileUnit(language: DW_LANG_C99, file: !662, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !39, retainedTypes: !663, nameTableKind: None)
!662 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!663 = !{!91, !664, !615, !699}
!664 = !DISubprogram(name: "fileno", scope: !41, file: !41, line: 786, type: !665, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!665 = !DISubroutineType(types: !666)
!666 = !{!38, !667}
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !46, line: 49, size: 1728, elements: !669)
!669 = !{!670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !668, file: !46, line: 51, baseType: !38, size: 32)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !668, file: !46, line: 54, baseType: !34, size: 64, offset: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !668, file: !46, line: 55, baseType: !34, size: 64, offset: 128)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !668, file: !46, line: 56, baseType: !34, size: 64, offset: 192)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !668, file: !46, line: 57, baseType: !34, size: 64, offset: 256)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !668, file: !46, line: 58, baseType: !34, size: 64, offset: 320)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !668, file: !46, line: 59, baseType: !34, size: 64, offset: 384)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !668, file: !46, line: 60, baseType: !34, size: 64, offset: 448)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !668, file: !46, line: 61, baseType: !34, size: 64, offset: 512)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !668, file: !46, line: 64, baseType: !34, size: 64, offset: 576)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !668, file: !46, line: 65, baseType: !34, size: 64, offset: 640)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !668, file: !46, line: 66, baseType: !34, size: 64, offset: 704)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !668, file: !46, line: 68, baseType: !61, size: 64, offset: 768)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !668, file: !46, line: 70, baseType: !667, size: 64, offset: 832)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !668, file: !46, line: 72, baseType: !38, size: 32, offset: 896)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !668, file: !46, line: 73, baseType: !38, size: 32, offset: 928)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !668, file: !46, line: 74, baseType: !67, size: 64, offset: 960)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !668, file: !46, line: 77, baseType: !71, size: 16, offset: 1024)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !668, file: !46, line: 78, baseType: !73, size: 8, offset: 1040)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !668, file: !46, line: 79, baseType: !75, size: 8, offset: 1048)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !668, file: !46, line: 81, baseType: !79, size: 64, offset: 1088)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !668, file: !46, line: 89, baseType: !82, size: 64, offset: 1152)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !668, file: !46, line: 91, baseType: !84, size: 64, offset: 1216)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !668, file: !46, line: 92, baseType: !87, size: 64, offset: 1280)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !668, file: !46, line: 93, baseType: !667, size: 64, offset: 1344)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !668, file: !46, line: 94, baseType: !91, size: 64, offset: 1408)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !668, file: !46, line: 95, baseType: !93, size: 64, offset: 1472)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !668, file: !46, line: 96, baseType: !38, size: 32, offset: 1536)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !668, file: !46, line: 98, baseType: !98, size: 160, offset: 1568)
!699 = !DISubprogram(name: "fseeko", scope: !41, file: !41, line: 707, type: !700, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!700 = !DISubroutineType(types: !701)
!701 = !{!38, !667, !69, !38}
!702 = distinct !DICompileUnit(language: DW_LANG_C99, file: !703, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !39, retainedTypes: !704, nameTableKind: None)
!703 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!704 = !{!705, !93, !717}
!705 = !DISubprogram(name: "mbrtowc", scope: !402, file: !402, line: 296, type: !706, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!706 = !DISubroutineType(types: !707)
!707 = !{!95, !236, !36, !95, !708}
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !386, line: 13, size: 64, elements: !710)
!710 = !{!711, !712}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !709, file: !386, line: 15, baseType: !38, size: 32)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !709, file: !386, line: 20, baseType: !713, size: 32, offset: 32)
!713 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !709, file: !386, line: 16, size: 32, elements: !714)
!714 = !{!715, !716}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !713, file: !386, line: 18, baseType: !7, size: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !713, file: !386, line: 19, baseType: !394, size: 32)
!717 = !DISubprogram(name: "hard_locale", scope: !718, file: !718, line: 26, type: !719, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!718 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!719 = !DISubroutineType(types: !720)
!720 = !{!130, !38}
!721 = distinct !DICompileUnit(language: DW_LANG_C99, file: !722, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !39, retainedTypes: !723, nameTableKind: None)
!722 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!723 = !{!724}
!724 = !DISubprogram(name: "rpl_fclose", scope: !135, file: !135, line: 672, type: !725, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!725 = !DISubroutineType(types: !726)
!726 = !{!38, !727}
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !46, line: 49, size: 1728, elements: !729)
!729 = !{!730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !728, file: !46, line: 51, baseType: !38, size: 32)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !728, file: !46, line: 54, baseType: !34, size: 64, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !728, file: !46, line: 55, baseType: !34, size: 64, offset: 128)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !728, file: !46, line: 56, baseType: !34, size: 64, offset: 192)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !728, file: !46, line: 57, baseType: !34, size: 64, offset: 256)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !728, file: !46, line: 58, baseType: !34, size: 64, offset: 320)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !728, file: !46, line: 59, baseType: !34, size: 64, offset: 384)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !728, file: !46, line: 60, baseType: !34, size: 64, offset: 448)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !728, file: !46, line: 61, baseType: !34, size: 64, offset: 512)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !728, file: !46, line: 64, baseType: !34, size: 64, offset: 576)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !728, file: !46, line: 65, baseType: !34, size: 64, offset: 640)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !728, file: !46, line: 66, baseType: !34, size: 64, offset: 704)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !728, file: !46, line: 68, baseType: !61, size: 64, offset: 768)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !728, file: !46, line: 70, baseType: !727, size: 64, offset: 832)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !728, file: !46, line: 72, baseType: !38, size: 32, offset: 896)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !728, file: !46, line: 73, baseType: !38, size: 32, offset: 928)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !728, file: !46, line: 74, baseType: !67, size: 64, offset: 960)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !728, file: !46, line: 77, baseType: !71, size: 16, offset: 1024)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !728, file: !46, line: 78, baseType: !73, size: 8, offset: 1040)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !728, file: !46, line: 79, baseType: !75, size: 8, offset: 1048)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !728, file: !46, line: 81, baseType: !79, size: 64, offset: 1088)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !728, file: !46, line: 89, baseType: !82, size: 64, offset: 1152)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !728, file: !46, line: 91, baseType: !84, size: 64, offset: 1216)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !728, file: !46, line: 92, baseType: !87, size: 64, offset: 1280)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !728, file: !46, line: 93, baseType: !727, size: 64, offset: 1344)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !728, file: !46, line: 94, baseType: !91, size: 64, offset: 1408)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !728, file: !46, line: 95, baseType: !93, size: 64, offset: 1472)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !728, file: !46, line: 96, baseType: !38, size: 32, offset: 1536)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !728, file: !46, line: 98, baseType: !98, size: 160, offset: 1568)
!759 = distinct !DICompileUnit(language: DW_LANG_C99, file: !760, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !39, retainedTypes: !761, nameTableKind: None)
!760 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!761 = !{!762}
!762 = !DISubprogram(name: "setlocale_null_r", scope: !763, file: !763, line: 64, type: !764, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!763 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!764 = !DISubroutineType(types: !765)
!765 = !{!38, !38, !34, !95}
!766 = distinct !DICompileUnit(language: DW_LANG_C99, file: !767, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !768, retainedTypes: !1155, nameTableKind: None)
!767 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!768 = !{!769}
!769 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !770, line: 41, baseType: !7, size: 32, elements: !771)
!770 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!771 = !{!772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154}
!772 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!773 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!774 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!775 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!776 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!777 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!778 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!779 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!780 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!781 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!782 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!783 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!784 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!785 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!786 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!787 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!788 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!789 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!790 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!791 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!792 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!793 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!794 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!795 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!796 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!797 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!798 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!799 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!800 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!801 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!802 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!803 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!804 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!805 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!806 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!807 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!808 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!809 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!810 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!811 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!812 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!813 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!814 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!815 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!816 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!817 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!818 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!819 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!820 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!821 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!822 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!823 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!824 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!825 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!826 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!827 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!828 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!829 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!830 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!831 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!832 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!833 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!834 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!835 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!836 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!837 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!838 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!839 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!840 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!841 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!842 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!843 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!844 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!845 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!846 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!847 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!880 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!883 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!884 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!885 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!886 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!887 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!888 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!889 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!890 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!891 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!892 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!893 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!894 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!895 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!896 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!898 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!899 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!900 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!901 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!902 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!903 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!904 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!905 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!906 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!907 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!908 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!909 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!910 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!911 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!912 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!913 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!914 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!915 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!916 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!917 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!918 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!919 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!920 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!921 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!922 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!923 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!924 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!925 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!926 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!927 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!928 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!929 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!930 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!931 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!932 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!933 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!934 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!935 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!936 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!937 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!938 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!939 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!940 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!941 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!942 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!943 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!944 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!945 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!946 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!947 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
