; ModuleID = 'coreutils-8.32/src/comm.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.linebuffer = type { i64, i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [35 x i8] c"Usage: %s [OPTION]... FILE1 FILE2\0A\00", align 1
@.str.2 = private unnamed_addr constant [52 x i8] c"Compare sorted files FILE1 and FILE2 line by line.\0A\00", align 1
@stdout = external local_unnamed_addr global %struct._IO_FILE*, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "hard_LC_COLLATE", scope: !2, file: !3, line: 46, type: !124, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !34, globals: !204, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/comm.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !11, !25}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 70, baseType: !6, size: 32, elements: !7)
!6 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!7 = !{!8, !9, !10}
!8 = !DIEnumerator(name: "CHECK_ORDER_DEFAULT", value: 0, isUnsigned: true)
!9 = !DIEnumerator(name: "CHECK_ORDER_ENABLED", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "CHECK_ORDER_DISABLED", value: 2, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !12, line: 32, baseType: !6, size: 32, elements: !13)
!12 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!13 = !{!14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24}
!14 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!17 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!18 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!19 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!20 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!21 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!22 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!23 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!24 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !26, line: 45, baseType: !6, size: 32, elements: !27)
!26 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!27 = !{!28, !29, !30, !31, !32, !33}
!28 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0, isUnsigned: true)
!29 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2, isUnsigned: true)
!30 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5, isUnsigned: true)
!31 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4, isUnsigned: true)
!32 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3, isUnsigned: true)
!33 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1, isUnsigned: true)
!34 = !{!35, !45, !106, !110, !114, !117, !120, !125, !132, !147, !39, !96, !151, !155, !159, !169, !173, !176, !179, !182, !186, !190, !98, !41, !194, !199, !200}
!35 = !DISubprogram(name: "dcgettext", scope: !36, file: !36, line: 51, type: !37, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!36 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!37 = !DISubroutineType(types: !38)
!38 = !{!39, !41, !41, !43}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!43 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!44 = !{}
!45 = !DISubprogram(name: "fputs_unlocked", scope: !46, file: !46, line: 662, type: !47, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!46 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!47 = !DISubroutineType(types: !48)
!48 = !{!43, !41, !49}
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !51, line: 49, size: 1728, elements: !52)
!51 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!52 = !{!53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !68, !69, !70, !71, !75, !77, !79, !83, !86, !88, !91, !94, !95, !97, !101, !102}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !50, file: !51, line: 51, baseType: !43, size: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !50, file: !51, line: 54, baseType: !39, size: 64, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !50, file: !51, line: 55, baseType: !39, size: 64, offset: 128)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !50, file: !51, line: 56, baseType: !39, size: 64, offset: 192)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !50, file: !51, line: 57, baseType: !39, size: 64, offset: 256)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !50, file: !51, line: 58, baseType: !39, size: 64, offset: 320)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !50, file: !51, line: 59, baseType: !39, size: 64, offset: 384)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !50, file: !51, line: 60, baseType: !39, size: 64, offset: 448)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !50, file: !51, line: 61, baseType: !39, size: 64, offset: 512)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !50, file: !51, line: 64, baseType: !39, size: 64, offset: 576)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !50, file: !51, line: 65, baseType: !39, size: 64, offset: 640)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !50, file: !51, line: 66, baseType: !39, size: 64, offset: 704)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !50, file: !51, line: 68, baseType: !66, size: 64, offset: 768)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !51, line: 36, flags: DIFlagFwdDecl)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !50, file: !51, line: 70, baseType: !49, size: 64, offset: 832)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !50, file: !51, line: 72, baseType: !43, size: 32, offset: 896)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !50, file: !51, line: 73, baseType: !43, size: 32, offset: 928)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !50, file: !51, line: 74, baseType: !72, size: 64, offset: 960)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !73, line: 152, baseType: !74)
!73 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!74 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !50, file: !51, line: 77, baseType: !76, size: 16, offset: 1024)
!76 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !50, file: !51, line: 78, baseType: !78, size: 8, offset: 1040)
!78 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !50, file: !51, line: 79, baseType: !80, size: 8, offset: 1048)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 8, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 1)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !50, file: !51, line: 81, baseType: !84, size: 64, offset: 1088)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !51, line: 43, baseType: null)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !50, file: !51, line: 89, baseType: !87, size: 64, offset: 1152)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !73, line: 153, baseType: !74)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !50, file: !51, line: 91, baseType: !89, size: 64, offset: 1216)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !51, line: 37, flags: DIFlagFwdDecl)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !50, file: !51, line: 92, baseType: !92, size: 64, offset: 1280)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !51, line: 38, flags: DIFlagFwdDecl)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !50, file: !51, line: 93, baseType: !49, size: 64, offset: 1344)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !50, file: !51, line: 94, baseType: !96, size: 64, offset: 1408)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !50, file: !51, line: 95, baseType: !98, size: 64, offset: 1472)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !99, line: 46, baseType: !100)
!99 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!100 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !50, file: !51, line: 96, baseType: !43, size: 32, offset: 1536)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !50, file: !51, line: 98, baseType: !103, size: 160, offset: 1568)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 160, elements: !104)
!104 = !{!105}
!105 = !DISubrange(count: 20)
!106 = !DISubprogram(name: "set_program_name", scope: !107, file: !107, line: 37, type: !108, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!107 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!108 = !DISubroutineType(types: !109)
!109 = !{null, !41}
!110 = !DISubprogram(name: "setlocale", scope: !111, file: !111, line: 122, type: !112, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!111 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!112 = !DISubroutineType(types: !113)
!113 = !{!39, !43, !41}
!114 = !DISubprogram(name: "bindtextdomain", scope: !36, file: !36, line: 86, type: !115, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!115 = !DISubroutineType(types: !116)
!116 = !{!39, !41, !41}
!117 = !DISubprogram(name: "textdomain", scope: !36, file: !36, line: 82, type: !118, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!118 = !DISubroutineType(types: !119)
!119 = !{!39, !41}
!120 = !DISubprogram(name: "hard_locale", scope: !121, file: !121, line: 26, type: !122, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!121 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!122 = !DISubroutineType(types: !123)
!123 = !{!124, !43}
!124 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!125 = !DISubprogram(name: "atexit", scope: !126, file: !126, line: 595, type: !127, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!126 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!127 = !DISubroutineType(types: !128)
!128 = !{!43, !129}
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{null}
!132 = !DISubprogram(name: "getopt_long", scope: !133, file: !133, line: 66, type: !134, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!133 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!134 = !DISubroutineType(types: !135)
!135 = !{!43, !43, !136, !41, !138, !145}
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !133, line: 50, size: 256, elements: !141)
!141 = !{!142, !143, !144, !146}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !140, file: !133, line: 52, baseType: !41, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !140, file: !133, line: 55, baseType: !43, size: 32, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !140, file: !133, line: 56, baseType: !145, size: 64, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !140, file: !133, line: 57, baseType: !43, size: 32, offset: 192)
!147 = !DISubprogram(name: "error", scope: !148, file: !148, line: 52, type: !149, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!148 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!149 = !DISubroutineType(types: !150)
!150 = !{null, !43, !43, !41, null}
!151 = !DISubprogram(name: "version_etc", scope: !152, file: !152, line: 69, type: !153, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!152 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!153 = !DISubroutineType(types: !154)
!154 = !{null, !49, !41, !41, !41, null}
!155 = !DISubprogram(name: "quote", scope: !156, file: !156, line: 44, type: !157, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!156 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!157 = !DISubroutineType(types: !158)
!158 = !{!41, !41}
!159 = !DISubprogram(name: "initbuffer", scope: !160, file: !160, line: 34, type: !161, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!160 = !DIFile(filename: "./lib/linebuffer.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!161 = !DISubroutineType(types: !162)
!162 = !{null, !163}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "linebuffer", file: !160, line: 26, size: 192, elements: !165)
!165 = !{!166, !167, !168}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !164, file: !160, line: 28, baseType: !98, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !164, file: !160, line: 29, baseType: !98, size: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !164, file: !160, line: 30, baseType: !39, size: 64, offset: 128)
!169 = !DISubprogram(name: "fopen_safer", scope: !170, file: !170, line: 23, type: !171, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!170 = !DIFile(filename: "./lib/stdio-safer.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!171 = !DISubroutineType(types: !172)
!172 = !{!49, !41, !41}
!173 = !DISubprogram(name: "quotearg_n_style_colon", scope: !12, file: !12, line: 397, type: !174, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!174 = !DISubroutineType(types: !175)
!175 = !{!39, !43, !11, !41}
!176 = !DISubprogram(name: "fadvise", scope: !26, file: !26, line: 72, type: !177, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!177 = !DISubroutineType(types: !178)
!178 = !{null, !49, !25}
!179 = !DISubprogram(name: "readlinebuffer_delim", scope: !160, file: !160, line: 41, type: !180, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!180 = !DISubroutineType(types: !181)
!181 = !{!163, !163, !49, !40}
!182 = !DISubprogram(name: "xmemcoll", scope: !183, file: !183, line: 2, type: !184, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!183 = !DIFile(filename: "./lib/xmemcoll.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!184 = !DISubroutineType(types: !185)
!185 = !{!43, !39, !100, !39, !100}
!186 = !DISubprogram(name: "rpl_fclose", scope: !187, file: !187, line: 672, type: !188, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!187 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!188 = !DISubroutineType(types: !189)
!189 = !{!43, !49}
!190 = !DISubprogram(name: "umaxtostr", scope: !191, file: !191, line: 46, type: !192, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!191 = !DIFile(filename: "./lib/inttostr.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!192 = !DISubroutineType(types: !193)
!193 = !{!39, !100, !39}
!194 = !DISubprogram(name: "fwrite_unlocked", scope: !46, file: !46, line: 675, type: !195, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!195 = !DISubroutineType(types: !196)
!196 = !{!100, !197, !100, !100, !49}
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!199 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!200 = !DISubprogram(name: "memcmp2", scope: !201, file: !201, line: 32, type: !202, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!201 = !DIFile(filename: "./lib/memcmp2.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!202 = !DISubroutineType(types: !203)
!203 = !{!43, !41, !100, !41, !100}
!204 = !{!0, !205, !207, !209, !211, !213, !218, !220, !222, !227, !229, !231}
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(name: "only_file_1", scope: !2, file: !3, line: 49, type: !124, isLocal: true, isDefinition: true)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "only_file_2", scope: !2, file: !3, line: 52, type: !124, isLocal: true, isDefinition: true)
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(name: "both", scope: !2, file: !3, line: 55, type: !124, isLocal: true, isDefinition: true)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "seen_unpairable", scope: !2, file: !3, line: 58, type: !124, isLocal: true, isDefinition: true)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(name: "issued_disorder_warning", scope: !2, file: !3, line: 61, type: !215, isLocal: true, isDefinition: true)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 16, elements: !216)
!216 = !{!217}
!217 = !DISubrange(count: 2)
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(name: "total_option", scope: !2, file: !3, line: 67, type: !124, isLocal: true, isDefinition: true)
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(name: "check_input_order", scope: !2, file: !3, line: 75, type: !5, isLocal: true, isDefinition: true)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 92, type: !224, isLocal: true, isDefinition: true)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 2048, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 8)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(name: "delim", scope: !2, file: !3, line: 64, type: !199, isLocal: true, isDefinition: true)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(name: "col_sep_len", scope: !2, file: !3, line: 80, type: !98, isLocal: true, isDefinition: true)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(name: "col_sep", scope: !2, file: !3, line: 79, type: !41, isLocal: true, isDefinition: true)
!233 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!234 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!235 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!236 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!237 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!238 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551606, DW_OP_mul, DW_OP_constu, 10, DW_OP_plus, DW_OP_stack_value))
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(name: "Version", scope: !241, file: !242, line: 2, type: !41, isLocal: false, isDefinition: true)
!241 = distinct !DICompileUnit(language: DW_LANG_C99, file: !242, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !44, globals: !243, splitDebugInlining: false, nameTableKind: None)
!242 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!243 = !{!239}
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(name: "file_name", scope: !246, file: !247, line: 46, type: !41, isLocal: true, isDefinition: true)
!246 = distinct !DICompileUnit(language: DW_LANG_C99, file: !247, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !44, retainedTypes: !248, globals: !286, splitDebugInlining: false, nameTableKind: None)
!247 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!248 = !{!249, !35, !285, !147}
!249 = !DISubprogram(name: "close_stream", scope: !250, file: !250, line: 2, type: !251, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!250 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!251 = !DISubroutineType(types: !252)
!252 = !{!43, !253}
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !51, line: 49, size: 1728, elements: !255)
!255 = !{!256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !254, file: !51, line: 51, baseType: !43, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !254, file: !51, line: 54, baseType: !39, size: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !254, file: !51, line: 55, baseType: !39, size: 64, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !254, file: !51, line: 56, baseType: !39, size: 64, offset: 192)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !254, file: !51, line: 57, baseType: !39, size: 64, offset: 256)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !254, file: !51, line: 58, baseType: !39, size: 64, offset: 320)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !254, file: !51, line: 59, baseType: !39, size: 64, offset: 384)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !254, file: !51, line: 60, baseType: !39, size: 64, offset: 448)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !254, file: !51, line: 61, baseType: !39, size: 64, offset: 512)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !254, file: !51, line: 64, baseType: !39, size: 64, offset: 576)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !254, file: !51, line: 65, baseType: !39, size: 64, offset: 640)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !254, file: !51, line: 66, baseType: !39, size: 64, offset: 704)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !254, file: !51, line: 68, baseType: !66, size: 64, offset: 768)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !254, file: !51, line: 70, baseType: !253, size: 64, offset: 832)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !254, file: !51, line: 72, baseType: !43, size: 32, offset: 896)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !254, file: !51, line: 73, baseType: !43, size: 32, offset: 928)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !254, file: !51, line: 74, baseType: !72, size: 64, offset: 960)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !254, file: !51, line: 77, baseType: !76, size: 16, offset: 1024)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !254, file: !51, line: 78, baseType: !78, size: 8, offset: 1040)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !254, file: !51, line: 79, baseType: !80, size: 8, offset: 1048)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !254, file: !51, line: 81, baseType: !84, size: 64, offset: 1088)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !254, file: !51, line: 89, baseType: !87, size: 64, offset: 1152)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !254, file: !51, line: 91, baseType: !89, size: 64, offset: 1216)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !254, file: !51, line: 92, baseType: !92, size: 64, offset: 1280)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !254, file: !51, line: 93, baseType: !253, size: 64, offset: 1344)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !254, file: !51, line: 94, baseType: !96, size: 64, offset: 1408)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !254, file: !51, line: 95, baseType: !98, size: 64, offset: 1472)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !254, file: !51, line: 96, baseType: !43, size: 32, offset: 1536)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !254, file: !51, line: 98, baseType: !103, size: 160, offset: 1568)
!285 = !DISubprogram(name: "quotearg_colon", scope: !12, file: !12, line: 391, type: !118, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!286 = !{!244, !287}
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !246, file: !247, line: 56, type: !124, isLocal: true, isDefinition: true)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(name: "exit_failure", scope: !291, file: !292, line: 24, type: !294, isLocal: false, isDefinition: true)
!291 = distinct !DICompileUnit(language: DW_LANG_C99, file: !292, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !44, globals: !293, splitDebugInlining: false, nameTableKind: None)
!292 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!293 = !{!289}
!294 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !43)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "program_name", scope: !297, file: !298, line: 33, type: !41, isLocal: false, isDefinition: true)
!297 = distinct !DICompileUnit(language: DW_LANG_C99, file: !298, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !44, retainedTypes: !299, globals: !335, splitDebugInlining: false, nameTableKind: None)
!298 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!299 = !{!96, !300, !39}
!300 = !DISubprogram(name: "fputs", scope: !46, file: !46, line: 626, type: !301, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!301 = !DISubroutineType(types: !302)
!302 = !{!43, !41, !303}
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !51, line: 49, size: 1728, elements: !305)
!305 = !{!306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !304, file: !51, line: 51, baseType: !43, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !304, file: !51, line: 54, baseType: !39, size: 64, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !304, file: !51, line: 55, baseType: !39, size: 64, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !304, file: !51, line: 56, baseType: !39, size: 64, offset: 192)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !304, file: !51, line: 57, baseType: !39, size: 64, offset: 256)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !304, file: !51, line: 58, baseType: !39, size: 64, offset: 320)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !304, file: !51, line: 59, baseType: !39, size: 64, offset: 384)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !304, file: !51, line: 60, baseType: !39, size: 64, offset: 448)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !304, file: !51, line: 61, baseType: !39, size: 64, offset: 512)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !304, file: !51, line: 64, baseType: !39, size: 64, offset: 576)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !304, file: !51, line: 65, baseType: !39, size: 64, offset: 640)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !304, file: !51, line: 66, baseType: !39, size: 64, offset: 704)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !304, file: !51, line: 68, baseType: !66, size: 64, offset: 768)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !304, file: !51, line: 70, baseType: !303, size: 64, offset: 832)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !304, file: !51, line: 72, baseType: !43, size: 32, offset: 896)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !304, file: !51, line: 73, baseType: !43, size: 32, offset: 928)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !304, file: !51, line: 74, baseType: !72, size: 64, offset: 960)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !304, file: !51, line: 77, baseType: !76, size: 16, offset: 1024)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !304, file: !51, line: 78, baseType: !78, size: 8, offset: 1040)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !304, file: !51, line: 79, baseType: !80, size: 8, offset: 1048)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !304, file: !51, line: 81, baseType: !84, size: 64, offset: 1088)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !304, file: !51, line: 89, baseType: !87, size: 64, offset: 1152)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !304, file: !51, line: 91, baseType: !89, size: 64, offset: 1216)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !304, file: !51, line: 92, baseType: !92, size: 64, offset: 1280)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !304, file: !51, line: 93, baseType: !303, size: 64, offset: 1344)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !304, file: !51, line: 94, baseType: !96, size: 64, offset: 1408)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !304, file: !51, line: 95, baseType: !98, size: 64, offset: 1472)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !304, file: !51, line: 96, baseType: !43, size: 32, offset: 1536)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !304, file: !51, line: 98, baseType: !103, size: 160, offset: 1568)
!335 = !{!295}
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !338, file: !339, line: 85, type: !455, isLocal: false, isDefinition: true)
!338 = distinct !DICompileUnit(language: DW_LANG_C99, file: !339, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !340, retainedTypes: !361, globals: !428, splitDebugInlining: false, nameTableKind: None)
!339 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!340 = !{!11, !341, !346}
!341 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !12, line: 242, baseType: !6, size: 32, elements: !342)
!342 = !{!343, !344, !345}
!343 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!344 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!345 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!346 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !347, line: 46, baseType: !6, size: 32, elements: !348)
!347 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!348 = !{!349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360}
!349 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!350 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!351 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!352 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!353 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!354 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!355 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!356 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!357 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!358 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!359 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!360 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!361 = !{!362, !366, !380, !383, !43, !76, !386, !98, !403, !407, !35, !413, !417, !39, !421, !424, !425}
!362 = !DISubprogram(name: "xmemdup", scope: !363, file: !363, line: 62, type: !364, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!363 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!364 = !DISubroutineType(types: !365)
!365 = !{!96, !197, !100}
!366 = !DISubprogram(name: "quotearg_alloc_mem", scope: !12, file: !12, line: 342, type: !367, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!367 = !DISubroutineType(types: !368)
!368 = !{!39, !41, !100, !369, !370}
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !372)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !339, line: 65, size: 448, elements: !373)
!373 = !{!374, !375, !376, !378, !379}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !372, file: !339, line: 68, baseType: !11, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !372, file: !339, line: 71, baseType: !43, size: 32, offset: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !372, file: !339, line: 75, baseType: !377, size: 256, offset: 64)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !225)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !372, file: !339, line: 78, baseType: !41, size: 64, offset: 320)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !372, file: !339, line: 81, baseType: !41, size: 64, offset: 384)
!380 = !DISubprogram(name: "free", scope: !126, file: !126, line: 565, type: !381, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!381 = !DISubroutineType(types: !382)
!382 = !{null, !96}
!383 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !12, file: !12, line: 408, type: !384, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!384 = !DISubroutineType(types: !385)
!385 = !{!39, !43, !41, !41, !41, !100}
!386 = !DISubprogram(name: "rpl_mbrtowc", scope: !387, file: !387, line: 717, type: !388, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!387 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!388 = !DISubroutineType(types: !389)
!389 = !{!100, !145, !41, !100, !390}
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !392, line: 13, size: 64, elements: !393)
!392 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!393 = !{!394, !395}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !391, file: !392, line: 15, baseType: !43, size: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !391, file: !392, line: 20, baseType: !396, size: 32, offset: 32)
!396 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !391, file: !392, line: 16, size: 32, elements: !397)
!397 = !{!398, !399}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !396, file: !392, line: 18, baseType: !6, size: 32)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !396, file: !392, line: 19, baseType: !400, size: 32)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 32, elements: !401)
!401 = !{!402}
!402 = !DISubrange(count: 4)
!403 = !DISubprogram(name: "iswprint", scope: !404, file: !404, line: 120, type: !405, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!404 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!405 = !DISubroutineType(types: !406)
!406 = !{!43, !6}
!407 = !DISubprogram(name: "mbsinit", scope: !408, file: !408, line: 292, type: !409, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!408 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!409 = !DISubroutineType(types: !410)
!410 = !{!43, !411}
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !391)
!413 = !DISubprogram(name: "locale_charset", scope: !414, file: !414, line: 35, type: !415, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!414 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!415 = !DISubroutineType(types: !416)
!416 = !{!41}
!417 = !DISubprogram(name: "c_strcasecmp", scope: !418, file: !418, line: 42, type: !419, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!418 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!419 = !DISubroutineType(types: !420)
!420 = !{!43, !41, !41}
!421 = !DISubprogram(name: "xmalloc", scope: !363, file: !363, line: 53, type: !422, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!422 = !DISubroutineType(types: !423)
!423 = !{!96, !100}
!424 = !DISubprogram(name: "xalloc_die", scope: !363, file: !363, line: 51, type: !130, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !44)
!425 = !DISubprogram(name: "xrealloc", scope: !363, file: !363, line: 59, type: !426, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!426 = !DISubroutineType(types: !427)
!427 = !{!96, !96, !100}
!428 = !{!336, !429, !435, !437, !439, !444, !451, !453}
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !338, file: !339, line: 101, type: !431, isLocal: false, isDefinition: true)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !432, size: 320, elements: !433)
!432 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!433 = !{!434}
!434 = !DISubrange(count: 10)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !338, file: !339, line: 1052, type: !372, isLocal: false, isDefinition: true)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !338, file: !339, line: 116, type: !372, isLocal: true, isDefinition: true)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(name: "slot0", scope: !338, file: !339, line: 842, type: !441, isLocal: true, isDefinition: true)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 2048, elements: !442)
!442 = !{!443}
!443 = !DISubrange(count: 256)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "slotvec", scope: !338, file: !339, line: 845, type: !446, isLocal: true, isDefinition: true)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !339, line: 834, size: 128, elements: !448)
!448 = !{!449, !450}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !447, file: !339, line: 836, baseType: !98, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !447, file: !339, line: 837, baseType: !39, size: 64, offset: 64)
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(name: "nslots", scope: !338, file: !339, line: 843, type: !43, isLocal: true, isDefinition: true)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(name: "slotvec0", scope: !338, file: !339, line: 844, type: !447, isLocal: true, isDefinition: true)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !456, size: 704, elements: !457)
!456 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!457 = !{!458}
!458 = !DISubrange(count: 11)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !461, file: !462, line: 26, type: !464, isLocal: false, isDefinition: true)
!461 = distinct !DICompileUnit(language: DW_LANG_C99, file: !462, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !44, globals: !463, splitDebugInlining: false, nameTableKind: None)
!462 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!463 = !{!459}
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 376, elements: !465)
!465 = !{!466}
!466 = !DISubrange(count: 47)
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !469, file: !470, line: 507, type: !43, isLocal: true, isDefinition: true)
!469 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !470, file: !470, line: 488, type: !471, scopeLine: 489, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !473, retainedNodes: !484)
!470 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!471 = !DISubroutineType(types: !472)
!472 = !{!43, !43, !43}
!473 = distinct !DICompileUnit(language: DW_LANG_C99, file: !470, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !44, retainedTypes: !474, globals: !483, splitDebugInlining: false, nameTableKind: None)
!474 = !{!475, !479}
!475 = !DISubprogram(name: "fcntl", scope: !476, file: !476, line: 176, type: !477, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!476 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
!477 = !DISubroutineType(types: !478)
!478 = !{!43, !43, !43, null}
!479 = !DISubprogram(name: "close", scope: !480, file: !480, line: 353, type: !481, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!480 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!481 = !DISubroutineType(types: !482)
!482 = !{!43, !43}
!483 = !{!467}
!484 = !{!485, !486, !487, !488, !491}
!485 = !DILocalVariable(name: "fd", arg: 1, scope: !469, file: !470, line: 488, type: !43)
!486 = !DILocalVariable(name: "target", arg: 2, scope: !469, file: !470, line: 488, type: !43)
!487 = !DILocalVariable(name: "result", scope: !469, file: !470, line: 490, type: !43)
!488 = !DILocalVariable(name: "flags", scope: !489, file: !470, line: 531, type: !43)
!489 = distinct !DILexicalBlock(scope: !490, file: !470, line: 530, column: 5)
!490 = distinct !DILexicalBlock(scope: !469, file: !470, line: 529, column: 7)
!491 = !DILocalVariable(name: "saved_errno", scope: !492, file: !470, line: 534, type: !43)
!492 = distinct !DILexicalBlock(scope: !493, file: !470, line: 533, column: 9)
!493 = distinct !DILexicalBlock(scope: !489, file: !470, line: 532, column: 11)
!494 = distinct !DICompileUnit(language: DW_LANG_C99, file: !495, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !496, retainedTypes: !497, splitDebugInlining: false, nameTableKind: None)
!495 = !DIFile(filename: "lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!496 = !{!25}
!497 = !{!498, !501}
!498 = !DISubprogram(name: "posix_fadvise", scope: !476, file: !476, line: 288, type: !499, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!499 = !DISubroutineType(types: !500)
!500 = !{!43, !43, !74, !74, !43}
!501 = !DISubprogram(name: "fileno", scope: !46, file: !46, line: 786, type: !502, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!502 = !DISubroutineType(types: !503)
!503 = !{!43, !504}
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !51, line: 49, size: 1728, elements: !506)
!506 = !{!507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !505, file: !51, line: 51, baseType: !43, size: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !505, file: !51, line: 54, baseType: !39, size: 64, offset: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !505, file: !51, line: 55, baseType: !39, size: 64, offset: 128)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !505, file: !51, line: 56, baseType: !39, size: 64, offset: 192)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !505, file: !51, line: 57, baseType: !39, size: 64, offset: 256)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !505, file: !51, line: 58, baseType: !39, size: 64, offset: 320)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !505, file: !51, line: 59, baseType: !39, size: 64, offset: 384)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !505, file: !51, line: 60, baseType: !39, size: 64, offset: 448)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !505, file: !51, line: 61, baseType: !39, size: 64, offset: 512)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !505, file: !51, line: 64, baseType: !39, size: 64, offset: 576)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !505, file: !51, line: 65, baseType: !39, size: 64, offset: 640)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !505, file: !51, line: 66, baseType: !39, size: 64, offset: 704)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !505, file: !51, line: 68, baseType: !66, size: 64, offset: 768)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !505, file: !51, line: 70, baseType: !504, size: 64, offset: 832)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !505, file: !51, line: 72, baseType: !43, size: 32, offset: 896)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !505, file: !51, line: 73, baseType: !43, size: 32, offset: 928)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !505, file: !51, line: 74, baseType: !72, size: 64, offset: 960)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !505, file: !51, line: 77, baseType: !76, size: 16, offset: 1024)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !505, file: !51, line: 78, baseType: !78, size: 8, offset: 1040)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !505, file: !51, line: 79, baseType: !80, size: 8, offset: 1048)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !505, file: !51, line: 81, baseType: !84, size: 64, offset: 1088)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !505, file: !51, line: 89, baseType: !87, size: 64, offset: 1152)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !505, file: !51, line: 91, baseType: !89, size: 64, offset: 1216)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !505, file: !51, line: 92, baseType: !92, size: 64, offset: 1280)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !505, file: !51, line: 93, baseType: !504, size: 64, offset: 1344)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !505, file: !51, line: 94, baseType: !96, size: 64, offset: 1408)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !505, file: !51, line: 95, baseType: !98, size: 64, offset: 1472)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !505, file: !51, line: 96, baseType: !43, size: 32, offset: 1536)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !505, file: !51, line: 98, baseType: !103, size: 160, offset: 1568)
!536 = distinct !DICompileUnit(language: DW_LANG_C99, file: !537, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !44, retainedTypes: !538, splitDebugInlining: false, nameTableKind: None)
!537 = !DIFile(filename: "lib/fopen-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!538 = !{!539, !574, !576, !577, !479}
!539 = !DISubprogram(name: "fileno", scope: !46, file: !46, line: 786, type: !540, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!540 = !DISubroutineType(types: !541)
!541 = !{!43, !542}
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !51, line: 49, size: 1728, elements: !544)
!544 = !{!545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !543, file: !51, line: 51, baseType: !43, size: 32)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !543, file: !51, line: 54, baseType: !39, size: 64, offset: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !543, file: !51, line: 55, baseType: !39, size: 64, offset: 128)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !543, file: !51, line: 56, baseType: !39, size: 64, offset: 192)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !543, file: !51, line: 57, baseType: !39, size: 64, offset: 256)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !543, file: !51, line: 58, baseType: !39, size: 64, offset: 320)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !543, file: !51, line: 59, baseType: !39, size: 64, offset: 384)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !543, file: !51, line: 60, baseType: !39, size: 64, offset: 448)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !543, file: !51, line: 61, baseType: !39, size: 64, offset: 512)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !543, file: !51, line: 64, baseType: !39, size: 64, offset: 576)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !543, file: !51, line: 65, baseType: !39, size: 64, offset: 640)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !543, file: !51, line: 66, baseType: !39, size: 64, offset: 704)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !543, file: !51, line: 68, baseType: !66, size: 64, offset: 768)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !543, file: !51, line: 70, baseType: !542, size: 64, offset: 832)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !543, file: !51, line: 72, baseType: !43, size: 32, offset: 896)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !543, file: !51, line: 73, baseType: !43, size: 32, offset: 928)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !543, file: !51, line: 74, baseType: !72, size: 64, offset: 960)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !543, file: !51, line: 77, baseType: !76, size: 16, offset: 1024)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !543, file: !51, line: 78, baseType: !78, size: 8, offset: 1040)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !543, file: !51, line: 79, baseType: !80, size: 8, offset: 1048)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !543, file: !51, line: 81, baseType: !84, size: 64, offset: 1088)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !543, file: !51, line: 89, baseType: !87, size: 64, offset: 1152)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !543, file: !51, line: 91, baseType: !89, size: 64, offset: 1216)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !543, file: !51, line: 92, baseType: !92, size: 64, offset: 1280)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !543, file: !51, line: 93, baseType: !542, size: 64, offset: 1344)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !543, file: !51, line: 94, baseType: !96, size: 64, offset: 1408)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !543, file: !51, line: 95, baseType: !98, size: 64, offset: 1472)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !543, file: !51, line: 96, baseType: !43, size: 32, offset: 1536)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !543, file: !51, line: 98, baseType: !103, size: 160, offset: 1568)
!574 = !DISubprogram(name: "dup_safer", scope: !575, file: !575, line: 20, type: !481, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!575 = !DIFile(filename: "./lib/unistd-safer.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!576 = !DISubprogram(name: "rpl_fclose", scope: !187, file: !187, line: 672, type: !540, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!577 = !DISubprogram(name: "fdopen", scope: !46, file: !46, line: 279, type: !578, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!578 = !DISubroutineType(types: !579)
!579 = !{!542, !43, !41}
!580 = distinct !DICompileUnit(language: DW_LANG_C99, file: !581, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !44, retainedTypes: !582, splitDebugInlining: false, nameTableKind: None)
!581 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!582 = !{!583}
!583 = !DISubprogram(name: "setlocale_null_r", scope: !584, file: !584, line: 64, type: !585, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!584 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!585 = !DISubroutineType(types: !586)
!586 = !{!43, !43, !39, !100}
!587 = distinct !DICompileUnit(language: DW_LANG_C99, file: !588, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !44, retainedTypes: !589, splitDebugInlining: false, nameTableKind: None)
!588 = !DIFile(filename: "lib/umaxtostr.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!589 = !{!590}
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !591, line: 102, baseType: !592)
!591 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !73, line: 73, baseType: !100)
!593 = distinct !DICompileUnit(language: DW_LANG_C99, file: !594, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !44, retainedTypes: !595, splitDebugInlining: false, nameTableKind: None)
!594 = !DIFile(filename: "lib/linebuffer.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!595 = !{!596, !637, !380, !640}
!596 = !DISubprogram(name: "readlinebuffer_delim", scope: !160, file: !160, line: 41, type: !597, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!597 = !DISubroutineType(types: !598)
!598 = !{!599, !599, !605, !40}
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "linebuffer", file: !160, line: 26, size: 192, elements: !601)
!601 = !{!602, !603, !604}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !600, file: !160, line: 28, baseType: !98, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !600, file: !160, line: 29, baseType: !98, size: 64, offset: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !600, file: !160, line: 30, baseType: !39, size: 64, offset: 128)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !51, line: 49, size: 1728, elements: !607)
!607 = !{!608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !606, file: !51, line: 51, baseType: !43, size: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !606, file: !51, line: 54, baseType: !39, size: 64, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !606, file: !51, line: 55, baseType: !39, size: 64, offset: 128)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !606, file: !51, line: 56, baseType: !39, size: 64, offset: 192)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !606, file: !51, line: 57, baseType: !39, size: 64, offset: 256)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !606, file: !51, line: 58, baseType: !39, size: 64, offset: 320)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !606, file: !51, line: 59, baseType: !39, size: 64, offset: 384)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !606, file: !51, line: 60, baseType: !39, size: 64, offset: 448)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !606, file: !51, line: 61, baseType: !39, size: 64, offset: 512)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !606, file: !51, line: 64, baseType: !39, size: 64, offset: 576)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !606, file: !51, line: 65, baseType: !39, size: 64, offset: 640)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !606, file: !51, line: 66, baseType: !39, size: 64, offset: 704)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !606, file: !51, line: 68, baseType: !66, size: 64, offset: 768)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !606, file: !51, line: 70, baseType: !605, size: 64, offset: 832)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !606, file: !51, line: 72, baseType: !43, size: 32, offset: 896)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !606, file: !51, line: 73, baseType: !43, size: 32, offset: 928)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !606, file: !51, line: 74, baseType: !72, size: 64, offset: 960)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !606, file: !51, line: 77, baseType: !76, size: 16, offset: 1024)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !606, file: !51, line: 78, baseType: !78, size: 8, offset: 1040)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !606, file: !51, line: 79, baseType: !80, size: 8, offset: 1048)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !606, file: !51, line: 81, baseType: !84, size: 64, offset: 1088)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !606, file: !51, line: 89, baseType: !87, size: 64, offset: 1152)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !606, file: !51, line: 91, baseType: !89, size: 64, offset: 1216)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !606, file: !51, line: 92, baseType: !92, size: 64, offset: 1280)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !606, file: !51, line: 93, baseType: !605, size: 64, offset: 1344)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !606, file: !51, line: 94, baseType: !96, size: 64, offset: 1408)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !606, file: !51, line: 95, baseType: !98, size: 64, offset: 1472)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !606, file: !51, line: 96, baseType: !43, size: 32, offset: 1536)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !606, file: !51, line: 98, baseType: !103, size: 160, offset: 1568)
!637 = !DISubprogram(name: "x2realloc", scope: !363, file: !363, line: 61, type: !638, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!638 = !DISubroutineType(types: !639)
!639 = !{!96, !96, !369}
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!641 = distinct !DICompileUnit(language: DW_LANG_C99, file: !642, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !44, splitDebugInlining: false, nameTableKind: None)
!642 = !DIFile(filename: "lib/memcmp2.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!643 = distinct !DICompileUnit(language: DW_LANG_C99, file: !644, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !44, retainedTypes: !645, splitDebugInlining: false, nameTableKind: None)
!644 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!645 = !{!96, !110}
!646 = distinct !DICompileUnit(language: DW_LANG_C99, file: !647, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !44, retainedTypes: !648, splitDebugInlining: false, nameTableKind: None)
!647 = !DIFile(filename: "lib/dup-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!648 = !{!649}
!649 = !DISubprogram(name: "rpl_fcntl", scope: !650, file: !650, line: 588, type: !477, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!650 = !DIFile(filename: "./lib/fcntl.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!651 = distinct !DICompileUnit(language: DW_LANG_C99, file: !652, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !653, retainedTypes: !657, splitDebugInlining: false, nameTableKind: None)
!652 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!653 = !{!654}
!654 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !652, line: 40, baseType: !6, size: 32, elements: !655)
!655 = !{!656}
!656 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!657 = !{!35, !658, !96}
!658 = !DISubprogram(name: "fputs_unlocked", scope: !46, file: !46, line: 662, type: !659, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!659 = !DISubroutineType(types: !660)
!660 = !{!43, !41, !661}
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !51, line: 49, size: 1728, elements: !663)
!663 = !{!664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !662, file: !51, line: 51, baseType: !43, size: 32)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !662, file: !51, line: 54, baseType: !39, size: 64, offset: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !662, file: !51, line: 55, baseType: !39, size: 64, offset: 128)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !662, file: !51, line: 56, baseType: !39, size: 64, offset: 192)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !662, file: !51, line: 57, baseType: !39, size: 64, offset: 256)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !662, file: !51, line: 58, baseType: !39, size: 64, offset: 320)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !662, file: !51, line: 59, baseType: !39, size: 64, offset: 384)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !662, file: !51, line: 60, baseType: !39, size: 64, offset: 448)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !662, file: !51, line: 61, baseType: !39, size: 64, offset: 512)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !662, file: !51, line: 64, baseType: !39, size: 64, offset: 576)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !662, file: !51, line: 65, baseType: !39, size: 64, offset: 640)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !662, file: !51, line: 66, baseType: !39, size: 64, offset: 704)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !662, file: !51, line: 68, baseType: !66, size: 64, offset: 768)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !662, file: !51, line: 70, baseType: !661, size: 64, offset: 832)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !662, file: !51, line: 72, baseType: !43, size: 32, offset: 896)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !662, file: !51, line: 73, baseType: !43, size: 32, offset: 928)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !662, file: !51, line: 74, baseType: !72, size: 64, offset: 960)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !662, file: !51, line: 77, baseType: !76, size: 16, offset: 1024)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !662, file: !51, line: 78, baseType: !78, size: 8, offset: 1040)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !662, file: !51, line: 79, baseType: !80, size: 8, offset: 1048)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !662, file: !51, line: 81, baseType: !84, size: 64, offset: 1088)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !662, file: !51, line: 89, baseType: !87, size: 64, offset: 1152)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !662, file: !51, line: 91, baseType: !89, size: 64, offset: 1216)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !662, file: !51, line: 92, baseType: !92, size: 64, offset: 1280)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !662, file: !51, line: 93, baseType: !661, size: 64, offset: 1344)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !662, file: !51, line: 94, baseType: !96, size: 64, offset: 1408)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !662, file: !51, line: 95, baseType: !98, size: 64, offset: 1472)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !662, file: !51, line: 96, baseType: !43, size: 32, offset: 1536)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !662, file: !51, line: 98, baseType: !103, size: 160, offset: 1568)
!693 = distinct !DICompileUnit(language: DW_LANG_C99, file: !694, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !695, retainedTypes: !708, splitDebugInlining: false, nameTableKind: None)
!694 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!695 = !{!696}
!696 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !697, file: !363, line: 186, baseType: !6, size: 32, elements: !706)
!697 = distinct !DISubprogram(name: "x2nrealloc", scope: !363, file: !363, line: 174, type: !698, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !693, retainedNodes: !701)
!698 = !DISubroutineType(types: !699)
!699 = !{!96, !96, !700, !98}
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!701 = !{!702, !703, !704, !705}
!702 = !DILocalVariable(name: "p", arg: 1, scope: !697, file: !363, line: 174, type: !96)
!703 = !DILocalVariable(name: "pn", arg: 2, scope: !697, file: !363, line: 174, type: !700)
!704 = !DILocalVariable(name: "s", arg: 3, scope: !697, file: !363, line: 174, type: !98)
!705 = !DILocalVariable(name: "n", scope: !697, file: !363, line: 176, type: !98)
!706 = !{!707}
!707 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!708 = !{!98, !424, !421, !425, !39, !380, !96, !709, !712}
!709 = !DISubprogram(name: "xcalloc", scope: !363, file: !363, line: 57, type: !710, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!710 = !DISubroutineType(types: !711)
!711 = !{!96, !100, !100}
!712 = !DISubprogram(name: "rpl_calloc", scope: !713, file: !713, line: 688, type: !710, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!713 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!714 = distinct !DICompileUnit(language: DW_LANG_C99, file: !715, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !44, retainedTypes: !716, splitDebugInlining: false, nameTableKind: None)
!715 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!716 = !{!35, !147}
!717 = distinct !DICompileUnit(language: DW_LANG_C99, file: !718, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !719, retainedTypes: !720, splitDebugInlining: false, nameTableKind: None)
!718 = !DIFile(filename: "lib/xmemcoll.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!719 = !{!11}
!720 = !{!721, !723, !35, !147, !724}
!721 = !DISubprogram(name: "memcoll", scope: !722, file: !722, line: 25, type: !184, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!722 = !DIFile(filename: "./lib/memcoll.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!723 = !DISubprogram(name: "memcoll0", scope: !722, file: !722, line: 26, type: !202, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!724 = !DISubprogram(name: "quotearg_n_style_mem", scope: !12, file: !12, line: 373, type: !725, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!725 = !DISubroutineType(types: !726)
!726 = !{!39, !43, !11, !41, !100}
!727 = distinct !DICompileUnit(language: DW_LANG_C99, file: !728, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !44, retainedTypes: !729, splitDebugInlining: false, nameTableKind: None)
!728 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!729 = !{!96}
!730 = distinct !DICompileUnit(language: DW_LANG_C99, file: !731, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !44, retainedTypes: !732, splitDebugInlining: false, nameTableKind: None)
!731 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!732 = !{!733, !768, !769, !772}
!733 = !DISubprogram(name: "fileno", scope: !46, file: !46, line: 786, type: !734, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!734 = !DISubroutineType(types: !735)
!735 = !{!43, !736}
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !51, line: 49, size: 1728, elements: !738)
!738 = !{!739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !737, file: !51, line: 51, baseType: !43, size: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !737, file: !51, line: 54, baseType: !39, size: 64, offset: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !737, file: !51, line: 55, baseType: !39, size: 64, offset: 128)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !737, file: !51, line: 56, baseType: !39, size: 64, offset: 192)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !737, file: !51, line: 57, baseType: !39, size: 64, offset: 256)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !737, file: !51, line: 58, baseType: !39, size: 64, offset: 320)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !737, file: !51, line: 59, baseType: !39, size: 64, offset: 384)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !737, file: !51, line: 60, baseType: !39, size: 64, offset: 448)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !737, file: !51, line: 61, baseType: !39, size: 64, offset: 512)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !737, file: !51, line: 64, baseType: !39, size: 64, offset: 576)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !737, file: !51, line: 65, baseType: !39, size: 64, offset: 640)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !737, file: !51, line: 66, baseType: !39, size: 64, offset: 704)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !737, file: !51, line: 68, baseType: !66, size: 64, offset: 768)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !737, file: !51, line: 70, baseType: !736, size: 64, offset: 832)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !737, file: !51, line: 72, baseType: !43, size: 32, offset: 896)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !737, file: !51, line: 73, baseType: !43, size: 32, offset: 928)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !737, file: !51, line: 74, baseType: !72, size: 64, offset: 960)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !737, file: !51, line: 77, baseType: !76, size: 16, offset: 1024)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !737, file: !51, line: 78, baseType: !78, size: 8, offset: 1040)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !737, file: !51, line: 79, baseType: !80, size: 8, offset: 1048)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !737, file: !51, line: 81, baseType: !84, size: 64, offset: 1088)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !737, file: !51, line: 89, baseType: !87, size: 64, offset: 1152)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !737, file: !51, line: 91, baseType: !89, size: 64, offset: 1216)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !737, file: !51, line: 92, baseType: !92, size: 64, offset: 1280)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !737, file: !51, line: 93, baseType: !736, size: 64, offset: 1344)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !737, file: !51, line: 94, baseType: !96, size: 64, offset: 1408)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !737, file: !51, line: 95, baseType: !98, size: 64, offset: 1472)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !737, file: !51, line: 96, baseType: !43, size: 32, offset: 1536)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !737, file: !51, line: 98, baseType: !103, size: 160, offset: 1568)
!768 = !DISubprogram(name: "fclose", scope: !46, file: !46, line: 213, type: !734, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!769 = !DISubprogram(name: "lseek", scope: !480, file: !480, line: 334, type: !770, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!770 = !DISubroutineType(types: !771)
!771 = !{!74, !43, !74, !43}
!772 = !DISubprogram(name: "rpl_fflush", scope: !187, file: !187, line: 718, type: !734, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!773 = distinct !DICompileUnit(language: DW_LANG_C99, file: !774, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !44, retainedTypes: !775, splitDebugInlining: false, nameTableKind: None)
!774 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!775 = !{!96, !776, !811}
!776 = !DISubprogram(name: "fflush", scope: !46, file: !46, line: 218, type: !777, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!777 = !DISubroutineType(types: !778)
!778 = !{!43, !779}
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !51, line: 49, size: 1728, elements: !781)
!781 = !{!782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !780, file: !51, line: 51, baseType: !43, size: 32)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !780, file: !51, line: 54, baseType: !39, size: 64, offset: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !780, file: !51, line: 55, baseType: !39, size: 64, offset: 128)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !780, file: !51, line: 56, baseType: !39, size: 64, offset: 192)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !780, file: !51, line: 57, baseType: !39, size: 64, offset: 256)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !780, file: !51, line: 58, baseType: !39, size: 64, offset: 320)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !780, file: !51, line: 59, baseType: !39, size: 64, offset: 384)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !780, file: !51, line: 60, baseType: !39, size: 64, offset: 448)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !780, file: !51, line: 61, baseType: !39, size: 64, offset: 512)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !780, file: !51, line: 64, baseType: !39, size: 64, offset: 576)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !780, file: !51, line: 65, baseType: !39, size: 64, offset: 640)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !780, file: !51, line: 66, baseType: !39, size: 64, offset: 704)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !780, file: !51, line: 68, baseType: !66, size: 64, offset: 768)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !780, file: !51, line: 70, baseType: !779, size: 64, offset: 832)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !780, file: !51, line: 72, baseType: !43, size: 32, offset: 896)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !780, file: !51, line: 73, baseType: !43, size: 32, offset: 928)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !780, file: !51, line: 74, baseType: !72, size: 64, offset: 960)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !780, file: !51, line: 77, baseType: !76, size: 16, offset: 1024)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !780, file: !51, line: 78, baseType: !78, size: 8, offset: 1040)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !780, file: !51, line: 79, baseType: !80, size: 8, offset: 1048)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !780, file: !51, line: 81, baseType: !84, size: 64, offset: 1088)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !780, file: !51, line: 89, baseType: !87, size: 64, offset: 1152)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !780, file: !51, line: 91, baseType: !89, size: 64, offset: 1216)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !780, file: !51, line: 92, baseType: !92, size: 64, offset: 1280)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !780, file: !51, line: 93, baseType: !779, size: 64, offset: 1344)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !780, file: !51, line: 94, baseType: !96, size: 64, offset: 1408)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !780, file: !51, line: 95, baseType: !98, size: 64, offset: 1472)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !780, file: !51, line: 96, baseType: !43, size: 32, offset: 1536)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !780, file: !51, line: 98, baseType: !103, size: 160, offset: 1568)
!811 = !DISubprogram(name: "rpl_fseeko", scope: !187, file: !187, line: 1034, type: !812, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!812 = !DISubroutineType(types: !813)
!813 = !{!43, !779, !74, !43}
!814 = distinct !DICompileUnit(language: DW_LANG_C99, file: !815, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !44, retainedTypes: !816, splitDebugInlining: false, nameTableKind: None)
!815 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!816 = !{!96, !817, !769, !852}
!817 = !DISubprogram(name: "fileno", scope: !46, file: !46, line: 786, type: !818, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!818 = !DISubroutineType(types: !819)
!819 = !{!43, !820}
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !51, line: 49, size: 1728, elements: !822)
!822 = !{!823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !821, file: !51, line: 51, baseType: !43, size: 32)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !821, file: !51, line: 54, baseType: !39, size: 64, offset: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !821, file: !51, line: 55, baseType: !39, size: 64, offset: 128)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !821, file: !51, line: 56, baseType: !39, size: 64, offset: 192)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !821, file: !51, line: 57, baseType: !39, size: 64, offset: 256)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !821, file: !51, line: 58, baseType: !39, size: 64, offset: 320)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !821, file: !51, line: 59, baseType: !39, size: 64, offset: 384)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !821, file: !51, line: 60, baseType: !39, size: 64, offset: 448)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !821, file: !51, line: 61, baseType: !39, size: 64, offset: 512)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !821, file: !51, line: 64, baseType: !39, size: 64, offset: 576)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !821, file: !51, line: 65, baseType: !39, size: 64, offset: 640)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !821, file: !51, line: 66, baseType: !39, size: 64, offset: 704)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !821, file: !51, line: 68, baseType: !66, size: 64, offset: 768)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !821, file: !51, line: 70, baseType: !820, size: 64, offset: 832)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !821, file: !51, line: 72, baseType: !43, size: 32, offset: 896)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !821, file: !51, line: 73, baseType: !43, size: 32, offset: 928)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !821, file: !51, line: 74, baseType: !72, size: 64, offset: 960)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !821, file: !51, line: 77, baseType: !76, size: 16, offset: 1024)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !821, file: !51, line: 78, baseType: !78, size: 8, offset: 1040)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !821, file: !51, line: 79, baseType: !80, size: 8, offset: 1048)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !821, file: !51, line: 81, baseType: !84, size: 64, offset: 1088)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !821, file: !51, line: 89, baseType: !87, size: 64, offset: 1152)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !821, file: !51, line: 91, baseType: !89, size: 64, offset: 1216)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !821, file: !51, line: 92, baseType: !92, size: 64, offset: 1280)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !821, file: !51, line: 93, baseType: !820, size: 64, offset: 1344)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !821, file: !51, line: 94, baseType: !96, size: 64, offset: 1408)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !821, file: !51, line: 95, baseType: !98, size: 64, offset: 1472)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !821, file: !51, line: 96, baseType: !43, size: 32, offset: 1536)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !821, file: !51, line: 98, baseType: !103, size: 160, offset: 1568)
!852 = !DISubprogram(name: "fseeko", scope: !46, file: !46, line: 707, type: !853, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!853 = !DISubroutineType(types: !854)
!854 = !{!43, !820, !74, !43}
!855 = distinct !DICompileUnit(language: DW_LANG_C99, file: !856, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !44, retainedTypes: !857, splitDebugInlining: false, nameTableKind: None)
!856 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!857 = !{!858, !98, !120}
!858 = !DISubprogram(name: "mbrtowc", scope: !408, file: !408, line: 296, type: !859, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!859 = !DISubroutineType(types: !860)
!860 = !{!100, !145, !41, !100, !861}
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !392, line: 13, size: 64, elements: !863)
!863 = !{!864, !865}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !862, file: !392, line: 15, baseType: !43, size: 32)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !862, file: !392, line: 20, baseType: !866, size: 32, offset: 32)
!866 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !862, file: !392, line: 16, size: 32, elements: !867)
!867 = !{!868, !869}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !866, file: !392, line: 18, baseType: !6, size: 32)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !866, file: !392, line: 19, baseType: !400, size: 32)
!870 = distinct !DICompileUnit(language: DW_LANG_C99, file: !871, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !44, retainedTypes: !872, splitDebugInlining: false, nameTableKind: None)
!871 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!872 = !{!873}
!873 = !DISubprogram(name: "rpl_fclose", scope: !187, file: !187, line: 672, type: !874, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!874 = !DISubroutineType(types: !875)
!875 = !{!43, !876}
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !51, line: 49, size: 1728, elements: !878)
!878 = !{!879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !877, file: !51, line: 51, baseType: !43, size: 32)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !877, file: !51, line: 54, baseType: !39, size: 64, offset: 64)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !877, file: !51, line: 55, baseType: !39, size: 64, offset: 128)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !877, file: !51, line: 56, baseType: !39, size: 64, offset: 192)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !877, file: !51, line: 57, baseType: !39, size: 64, offset: 256)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !877, file: !51, line: 58, baseType: !39, size: 64, offset: 320)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !877, file: !51, line: 59, baseType: !39, size: 64, offset: 384)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !877, file: !51, line: 60, baseType: !39, size: 64, offset: 448)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !877, file: !51, line: 61, baseType: !39, size: 64, offset: 512)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !877, file: !51, line: 64, baseType: !39, size: 64, offset: 576)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !877, file: !51, line: 65, baseType: !39, size: 64, offset: 640)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !877, file: !51, line: 66, baseType: !39, size: 64, offset: 704)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !877, file: !51, line: 68, baseType: !66, size: 64, offset: 768)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !877, file: !51, line: 70, baseType: !876, size: 64, offset: 832)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !877, file: !51, line: 72, baseType: !43, size: 32, offset: 896)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !877, file: !51, line: 73, baseType: !43, size: 32, offset: 928)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !877, file: !51, line: 74, baseType: !72, size: 64, offset: 960)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !877, file: !51, line: 77, baseType: !76, size: 16, offset: 1024)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !877, file: !51, line: 78, baseType: !78, size: 8, offset: 1040)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !877, file: !51, line: 79, baseType: !80, size: 8, offset: 1048)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !877, file: !51, line: 81, baseType: !84, size: 64, offset: 1088)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !877, file: !51, line: 89, baseType: !87, size: 64, offset: 1152)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !877, file: !51, line: 91, baseType: !89, size: 64, offset: 1216)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !877, file: !51, line: 92, baseType: !92, size: 64, offset: 1280)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !877, file: !51, line: 93, baseType: !876, size: 64, offset: 1344)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !877, file: !51, line: 94, baseType: !96, size: 64, offset: 1408)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !877, file: !51, line: 95, baseType: !98, size: 64, offset: 1472)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !877, file: !51, line: 96, baseType: !43, size: 32, offset: 1536)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !877, file: !51, line: 98, baseType: !103, size: 160, offset: 1568)
!908 = distinct !DICompileUnit(language: DW_LANG_C99, file: !909, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !910, retainedTypes: !1297, splitDebugInlining: false, nameTableKind: None)
!909 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!910 = !{!911}
