source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.F_triple = type { i8*, i64, i64 }
%struct.Src_to_dest = type { i64, i64, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__acl_entry_ext = type opaque
%struct.__acl_ext = type opaque
%struct.__dirstream = type opaque
%struct.__mbstate_t = type { i32, %union.anon.47 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.cp_options = type { i32, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i32, i32, %struct.hash_table*, %struct.hash_table* }
%struct.dir_attr = type { %struct.stat, i8, i64, %struct.dir_attr* }
%struct.dir_list = type { %struct.dir_list*, i64, i64 }
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%struct.direntry_t = type { i8*, i64 }
%struct.error_context = type { void (%struct.error_context*, i8*, ...)*, i8* (%struct.error_context*, i8*)*, void (%struct.error_context*, i8*)* }
%struct.extent_info = type { i64, i64, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "long_opts", scope: !2, file: !3, line: 107, type: !271, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !128, globals: !132, nameTableKind: None)
!3 = !DIFile(filename: "src/cp.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !13, !20, !26, !32, !37, !51}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "backup_type", file: !6, line: 30, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/backupfile.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "no_backups", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "simple_backups", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "numbered_existing_backups", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "numbered_backups", value: 3, isUnsigned: true)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Dereference_symlink", file: !14, line: 69, baseType: !7, size: 32, elements: !15)
!14 = !DIFile(filename: "src/copy.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!15 = !{!16, !17, !18, !19}
!16 = !DIEnumerator(name: "DEREF_UNDEFINED", value: 1, isUnsigned: true)
!17 = !DIEnumerator(name: "DEREF_NEVER", value: 2, isUnsigned: true)
!18 = !DIEnumerator(name: "DEREF_COMMAND_LINE_ARGUMENTS", value: 3, isUnsigned: true)
!19 = !DIEnumerator(name: "DEREF_ALWAYS", value: 4, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Interactive", file: !14, line: 60, baseType: !7, size: 32, elements: !21)
!21 = !{!22, !23, !24, !25}
!22 = !DIEnumerator(name: "I_ALWAYS_YES", value: 1, isUnsigned: true)
!23 = !DIEnumerator(name: "I_ALWAYS_NO", value: 2, isUnsigned: true)
!24 = !DIEnumerator(name: "I_ASK_USER", value: 3, isUnsigned: true)
!25 = !DIEnumerator(name: "I_UNSPECIFIED", value: 4, isUnsigned: true)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Sparse_type", file: !14, line: 26, baseType: !7, size: 32, elements: !27)
!27 = !{!28, !29, !30, !31}
!28 = !DIEnumerator(name: "SPARSE_UNUSED", value: 0, isUnsigned: true)
!29 = !DIEnumerator(name: "SPARSE_NEVER", value: 1, isUnsigned: true)
!30 = !DIEnumerator(name: "SPARSE_AUTO", value: 2, isUnsigned: true)
!31 = !DIEnumerator(name: "SPARSE_ALWAYS", value: 3, isUnsigned: true)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Reflink_type", file: !14, line: 47, baseType: !7, size: 32, elements: !33)
!33 = !{!34, !35, !36}
!34 = !DIEnumerator(name: "REFLINK_NEVER", value: 0, isUnsigned: true)
!35 = !DIEnumerator(name: "REFLINK_AUTO", value: 1, isUnsigned: true)
!36 = !DIEnumerator(name: "REFLINK_ALWAYS", value: 2, isUnsigned: true)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !38, line: 32, baseType: !7, size: 32, elements: !39)
!38 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!39 = !{!40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50}
!40 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!41 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!42 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!43 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!44 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!45 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!46 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!47 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!48 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!49 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!50 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "File_attribute", scope: !52, file: !3, line: 839, baseType: !7, size: 32, elements: !120)
!52 = distinct !DISubprogram(name: "decode_preserve_arg", scope: !3, file: !3, line: 837, type: !53, scopeLine: 838, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !110)
!53 = !DISubroutineType(types: !54)
!54 = !{null, !55, !58, !71}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!57 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cp_options", file: !14, line: 98, size: 640, elements: !60)
!60 = !{!61, !62, !63, !64, !65, !70, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !103, !104, !109}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "backup_type", scope: !59, file: !14, line: 100, baseType: !5, size: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "dereference", scope: !59, file: !14, line: 103, baseType: !13, size: 32, offset: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !59, file: !14, line: 108, baseType: !20, size: 32, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_mode", scope: !59, file: !14, line: 111, baseType: !26, size: 32, offset: 96)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !59, file: !14, line: 115, baseType: !66, size: 32, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !67, line: 69, baseType: !68)
!67 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !69, line: 150, baseType: !7)
!69 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!70 = !DIDerivedType(tag: DW_TAG_member, name: "copy_as_regular", scope: !59, file: !14, line: 119, baseType: !71, size: 8, offset: 160)
!71 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_before_opening", scope: !59, file: !14, line: 123, baseType: !71, size: 8, offset: 168)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_after_failed_open", scope: !59, file: !14, line: 130, baseType: !71, size: 8, offset: 176)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "hard_link", scope: !59, file: !14, line: 134, baseType: !71, size: 8, offset: 184)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "move_mode", scope: !59, file: !14, line: 138, baseType: !71, size: 8, offset: 192)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "install_mode", scope: !59, file: !14, line: 141, baseType: !71, size: 8, offset: 200)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "chown_privileges", scope: !59, file: !14, line: 145, baseType: !71, size: 8, offset: 208)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "owner_privileges", scope: !59, file: !14, line: 152, baseType: !71, size: 8, offset: 216)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "one_file_system", scope: !59, file: !14, line: 156, baseType: !71, size: 8, offset: 224)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_ownership", scope: !59, file: !14, line: 160, baseType: !71, size: 8, offset: 232)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_mode", scope: !59, file: !14, line: 161, baseType: !71, size: 8, offset: 240)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_timestamps", scope: !59, file: !14, line: 162, baseType: !71, size: 8, offset: 248)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "explicit_no_preserve_mode", scope: !59, file: !14, line: 163, baseType: !71, size: 8, offset: 256)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "set_security_context", scope: !59, file: !14, line: 166, baseType: !71, size: 8, offset: 264)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_links", scope: !59, file: !14, line: 178, baseType: !71, size: 8, offset: 272)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "data_copy_required", scope: !59, file: !14, line: 182, baseType: !71, size: 8, offset: 280)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve", scope: !59, file: !14, line: 188, baseType: !71, size: 8, offset: 288)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_security_context", scope: !59, file: !14, line: 192, baseType: !71, size: 8, offset: 296)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_context", scope: !59, file: !14, line: 201, baseType: !71, size: 8, offset: 304)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_xattr", scope: !59, file: !14, line: 205, baseType: !71, size: 8, offset: 312)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_xattr", scope: !59, file: !14, line: 214, baseType: !71, size: 8, offset: 320)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "reduce_diagnostics", scope: !59, file: !14, line: 223, baseType: !71, size: 8, offset: 328)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !59, file: !14, line: 227, baseType: !71, size: 8, offset: 336)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "set_mode", scope: !59, file: !14, line: 231, baseType: !71, size: 8, offset: 344)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "symbolic_link", scope: !59, file: !14, line: 235, baseType: !71, size: 8, offset: 352)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !59, file: !14, line: 239, baseType: !71, size: 8, offset: 360)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !59, file: !14, line: 242, baseType: !71, size: 8, offset: 368)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_tty", scope: !59, file: !14, line: 245, baseType: !71, size: 8, offset: 376)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "open_dangling_dest_symlink", scope: !59, file: !14, line: 250, baseType: !71, size: 8, offset: 384)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "last_file", scope: !59, file: !14, line: 254, baseType: !71, size: 8, offset: 392)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "rename_errno", scope: !59, file: !14, line: 259, baseType: !102, size: 32, offset: 416)
!102 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "reflink_mode", scope: !59, file: !14, line: 262, baseType: !32, size: 32, offset: 448)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "dest_info", scope: !59, file: !14, line: 273, baseType: !105, size: 64, offset: 512)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !107, line: 69, baseType: !108)
!107 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !107, line: 67, flags: DIFlagFwdDecl)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "src_info", scope: !59, file: !14, line: 276, baseType: !105, size: 64, offset: 576)
!110 = !{!111, !112, !113, !114, !116, !117, !119}
!111 = !DILocalVariable(name: "arg", arg: 1, scope: !52, file: !3, line: 837, type: !55)
!112 = !DILocalVariable(name: "x", arg: 2, scope: !52, file: !3, line: 837, type: !58)
!113 = !DILocalVariable(name: "on_off", arg: 3, scope: !52, file: !3, line: 837, type: !71)
!114 = !DILocalVariable(name: "arg_writable", scope: !52, file: !3, line: 863, type: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!116 = !DILocalVariable(name: "s", scope: !52, file: !3, line: 864, type: !115)
!117 = !DILocalVariable(name: "comma", scope: !118, file: !3, line: 868, type: !115)
!118 = distinct !DILexicalBlock(scope: !52, file: !3, line: 866, column: 5)
!119 = !DILocalVariable(name: "val", scope: !118, file: !3, line: 869, type: !51)
!120 = !{!121, !122, !123, !124, !125, !126, !127}
!121 = !DIEnumerator(name: "PRESERVE_MODE", value: 0, isUnsigned: true)
!122 = !DIEnumerator(name: "PRESERVE_TIMESTAMPS", value: 1, isUnsigned: true)
!123 = !DIEnumerator(name: "PRESERVE_OWNERSHIP", value: 2, isUnsigned: true)
!124 = !DIEnumerator(name: "PRESERVE_LINK", value: 3, isUnsigned: true)
!125 = !DIEnumerator(name: "PRESERVE_CONTEXT", value: 4, isUnsigned: true)
!126 = !DIEnumerator(name: "PRESERVE_XATTR", value: 5, isUnsigned: true)
!127 = !DIEnumerator(name: "PRESERVE_ALL", value: 6, isUnsigned: true)
!128 = !{!129, !131, !115}
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!132 = !{!133, !135, !0, !137, !143, !149, !153, !155, !161, !166, !168}
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(name: "selinux_enabled", scope: !2, file: !3, line: 78, type: !71, isLocal: true, isDefinition: true)
!135 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression())
!136 = distinct !DIGlobalVariable(name: "remove_trailing_slashes", scope: !2, file: !3, line: 85, type: !71, isLocal: true, isDefinition: true)
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(name: "sparse_type", scope: !2, file: !3, line: 91, type: !139, isLocal: true, isDefinition: true)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 96, elements: !141)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!141 = !{!142}
!142 = !DISubrange(count: 3)
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(name: "sparse_type_string", scope: !2, file: !3, line: 87, type: !145, isLocal: true, isDefinition: true)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 256, elements: !147)
!146 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!147 = !{!148}
!148 = !DISubrange(count: 4)
!149 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression())
!150 = distinct !DIGlobalVariable(name: "reflink_type", scope: !2, file: !3, line: 101, type: !151, isLocal: true, isDefinition: true)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 96, elements: !141)
!152 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "reflink_type_string", scope: !2, file: !3, line: 97, type: !145, isLocal: true, isDefinition: true)
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(name: "preserve_vals", scope: !52, file: !3, line: 849, type: !157, isLocal: true, isDefinition: true)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 224, elements: !159)
!158 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!159 = !{!160}
!160 = !DISubrange(count: 7)
!161 = !DIGlobalVariableExpression(var: !162, expr: !DIExpression())
!162 = distinct !DIGlobalVariable(name: "preserve_args", scope: !52, file: !3, line: 856, type: !163, isLocal: true, isDefinition: true)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 512, elements: !164)
!164 = !{!165}
!165 = !DISubrange(count: 8)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "parents_option", scope: !2, file: !3, line: 82, type: !71, isLocal: true, isDefinition: true)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "x_tmp", scope: !170, file: !3, line: 760, type: !59, isLocal: true, isDefinition: true)
!170 = distinct !DISubprogram(name: "do_copy", scope: !3, file: !3, line: 594, type: !171, scopeLine: 596, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !174)
!171 = !DISubroutineType(types: !172)
!172 = !{!71, !102, !173, !55, !71, !58}
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!174 = !{!175, !176, !177, !178, !179, !180, !217, !218, !219, !220, !224, !228, !231, !232, !242, !243, !244, !247, !250, !251, !252, !254, !257, !258, !259, !262, !266, !268, !269, !270}
!175 = !DILocalVariable(name: "n_files", arg: 1, scope: !170, file: !3, line: 594, type: !102)
!176 = !DILocalVariable(name: "file", arg: 2, scope: !170, file: !3, line: 594, type: !173)
!177 = !DILocalVariable(name: "target_directory", arg: 3, scope: !170, file: !3, line: 594, type: !55)
!178 = !DILocalVariable(name: "no_target_directory", arg: 4, scope: !170, file: !3, line: 595, type: !71)
!179 = !DILocalVariable(name: "x", arg: 5, scope: !170, file: !3, line: 595, type: !58)
!180 = !DILocalVariable(name: "sb", scope: !170, file: !3, line: 597, type: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !182, line: 26, size: 1152, elements: !183)
!182 = !DIFile(filename: "/usr/include/bits/struct_stat.h", directory: "")
!183 = !{!184, !187, !189, !191, !192, !194, !196, !197, !198, !201, !203, !205, !213, !214, !215}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !181, file: !182, line: 28, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !69, line: 145, baseType: !186)
!186 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !181, file: !182, line: 33, baseType: !188, size: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !69, line: 148, baseType: !186)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !181, file: !182, line: 41, baseType: !190, size: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !69, line: 151, baseType: !186)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !181, file: !182, line: 42, baseType: !68, size: 32, offset: 192)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !181, file: !182, line: 44, baseType: !193, size: 32, offset: 224)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !69, line: 146, baseType: !7)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !181, file: !182, line: 45, baseType: !195, size: 32, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !69, line: 147, baseType: !7)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !181, file: !182, line: 47, baseType: !102, size: 32, offset: 288)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !181, file: !182, line: 49, baseType: !185, size: 64, offset: 320)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !181, file: !182, line: 54, baseType: !199, size: 64, offset: 384)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !69, line: 152, baseType: !200)
!200 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !181, file: !182, line: 58, baseType: !202, size: 64, offset: 448)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !69, line: 175, baseType: !200)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !181, file: !182, line: 60, baseType: !204, size: 64, offset: 512)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !69, line: 180, baseType: !200)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !181, file: !182, line: 71, baseType: !206, size: 128, offset: 576)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !207, line: 10, size: 128, elements: !208)
!207 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!208 = !{!209, !211}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !206, file: !207, line: 12, baseType: !210, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !69, line: 160, baseType: !200)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !206, file: !207, line: 16, baseType: !212, size: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !69, line: 197, baseType: !200)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !181, file: !182, line: 72, baseType: !206, size: 128, offset: 704)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !181, file: !182, line: 73, baseType: !206, size: 128, offset: 832)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !181, file: !182, line: 86, baseType: !216, size: 192, offset: 960)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !212, size: 192, elements: !141)
!217 = !DILocalVariable(name: "new_dst", scope: !170, file: !3, line: 598, type: !71)
!218 = !DILocalVariable(name: "ok", scope: !170, file: !3, line: 599, type: !71)
!219 = !DILocalVariable(name: "forcing", scope: !170, file: !3, line: 600, type: !71)
!220 = !DILocalVariable(name: "__x", scope: !221, file: !3, line: 625, type: !71)
!221 = distinct !DILexicalBlock(scope: !222, file: !3, line: 625, column: 7)
!222 = distinct !DILexicalBlock(scope: !223, file: !3, line: 614, column: 5)
!223 = distinct !DILexicalBlock(scope: !170, file: !3, line: 613, column: 7)
!224 = !DILocalVariable(name: "i", scope: !225, file: !3, line: 654, type: !102)
!225 = distinct !DILexicalBlock(scope: !226, file: !3, line: 654, column: 7)
!226 = distinct !DILexicalBlock(scope: !227, file: !3, line: 640, column: 5)
!227 = distinct !DILexicalBlock(scope: !170, file: !3, line: 639, column: 7)
!228 = !DILocalVariable(name: "dst_name", scope: !229, file: !3, line: 656, type: !115)
!229 = distinct !DILexicalBlock(scope: !230, file: !3, line: 655, column: 9)
!230 = distinct !DILexicalBlock(scope: !225, file: !3, line: 654, column: 7)
!231 = !DILocalVariable(name: "parent_exists", scope: !229, file: !3, line: 657, type: !71)
!232 = !DILocalVariable(name: "attr_list", scope: !229, file: !3, line: 658, type: !233)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dir_attr", file: !3, line: 54, size: 1344, elements: !235)
!235 = !{!236, !237, !238, !241}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "st", scope: !234, file: !3, line: 56, baseType: !181, size: 1152)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !234, file: !3, line: 57, baseType: !71, size: 8, offset: 1152)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "slash_offset", scope: !234, file: !3, line: 58, baseType: !239, size: 64, offset: 1216)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !240, line: 46, baseType: !186)
!240 = !DIFile(filename: "/usr/lib/clang/12.0.1/include/stddef.h", directory: "")
!241 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !234, file: !3, line: 59, baseType: !233, size: 64, offset: 1280)
!242 = !DILocalVariable(name: "arg_in_concat", scope: !229, file: !3, line: 659, type: !115)
!243 = !DILocalVariable(name: "arg", scope: !229, file: !3, line: 660, type: !115)
!244 = !DILocalVariable(name: "arg_no_trailing_slash", scope: !245, file: !3, line: 669, type: !115)
!245 = distinct !DILexicalBlock(scope: !246, file: !3, line: 668, column: 13)
!246 = distinct !DILexicalBlock(scope: !229, file: !3, line: 667, column: 15)
!247 = !DILocalVariable(name: "__old", scope: !248, file: !3, line: 676, type: !55)
!248 = distinct !DILexicalBlock(scope: !249, file: !3, line: 676, column: 15)
!249 = distinct !DILexicalBlock(scope: !245, file: !3, line: 676, column: 15)
!250 = !DILocalVariable(name: "__len", scope: !248, file: !3, line: 676, type: !239)
!251 = !DILocalVariable(name: "__new", scope: !248, file: !3, line: 676, type: !115)
!252 = !DILocalVariable(name: "arg_base", scope: !253, file: !3, line: 695, type: !115)
!253 = distinct !DILexicalBlock(scope: !246, file: !3, line: 694, column: 13)
!254 = !DILocalVariable(name: "__old", scope: !255, file: !3, line: 697, type: !55)
!255 = distinct !DILexicalBlock(scope: !256, file: !3, line: 697, column: 15)
!256 = distinct !DILexicalBlock(scope: !253, file: !3, line: 697, column: 15)
!257 = !DILocalVariable(name: "__len", scope: !255, file: !3, line: 697, type: !239)
!258 = !DILocalVariable(name: "__new", scope: !255, file: !3, line: 697, type: !115)
!259 = !DILocalVariable(name: "copy_into_self", scope: !260, file: !3, line: 714, type: !71)
!260 = distinct !DILexicalBlock(scope: !261, file: !3, line: 713, column: 13)
!261 = distinct !DILexicalBlock(scope: !229, file: !3, line: 706, column: 15)
!262 = !DILocalVariable(name: "p", scope: !263, file: !3, line: 726, type: !233)
!263 = distinct !DILexicalBlock(scope: !264, file: !3, line: 725, column: 17)
!264 = distinct !DILexicalBlock(scope: !265, file: !3, line: 723, column: 13)
!265 = distinct !DILexicalBlock(scope: !229, file: !3, line: 722, column: 15)
!266 = !DILocalVariable(name: "new_dest", scope: !267, file: !3, line: 737, type: !55)
!267 = distinct !DILexicalBlock(scope: !227, file: !3, line: 736, column: 5)
!268 = !DILocalVariable(name: "source", scope: !267, file: !3, line: 738, type: !55)
!269 = !DILocalVariable(name: "dest", scope: !267, file: !3, line: 739, type: !55)
!270 = !DILocalVariable(name: "unused", scope: !267, file: !3, line: 740, type: !71)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 7680, elements: !281)
!272 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !273)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !274, line: 50, size: 256, elements: !275)
!274 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!275 = !{!276, !277, !278, !280}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !273, file: !274, line: 52, baseType: !55, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !273, file: !274, line: 55, baseType: !102, size: 32, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !273, file: !274, line: 56, baseType: !279, size: 64, offset: 128)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !273, file: !274, line: 57, baseType: !102, size: 32, offset: 192)
!281 = !{!282}
!282 = !DISubrange(count: 30)
!283 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!284 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(name: "top_level_src_name", scope: !287, file: !288, line: 147, type: !55, isLocal: true, isDefinition: true)
!287 = distinct !DICompileUnit(language: DW_LANG_C99, file: !288, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !289, retainedTypes: !314, globals: !316, nameTableKind: None)
!288 = !DIFile(filename: "src/copy.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!289 = !{!5, !13, !20, !26, !32, !37, !290, !294, !301, !310}
!290 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !291, line: 27, baseType: !7, size: 32, elements: !292)
!291 = !DIFile(filename: "./lib/utimecmp.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!292 = !{!293}
!293 = !DIEnumerator(name: "UTIMECMP_TRUNCATE_SOURCE", value: 1, isUnsigned: true)
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "savedir_option", file: !295, line: 26, baseType: !7, size: 32, elements: !296)
!295 = !DIFile(filename: "./lib/savedir.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!296 = !{!297, !298, !299, !300}
!297 = !DIEnumerator(name: "SAVEDIR_SORT_NONE", value: 0, isUnsigned: true)
!298 = !DIEnumerator(name: "SAVEDIR_SORT_NAME", value: 1, isUnsigned: true)
!299 = !DIEnumerator(name: "SAVEDIR_SORT_INODE", value: 2, isUnsigned: true)
!300 = !DIEnumerator(name: "SAVEDIR_SORT_FASTREAD", value: 2, isUnsigned: true)
!301 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !302, line: 45, baseType: !7, size: 32, elements: !303)
!302 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!303 = !{!304, !305, !306, !307, !308, !309}
!304 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0, isUnsigned: true)
!305 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2, isUnsigned: true)
!306 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5, isUnsigned: true)
!307 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4, isUnsigned: true)
!308 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3, isUnsigned: true)
!309 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1, isUnsigned: true)
!310 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !311, line: 73, baseType: !7, size: 32, elements: !312)
!311 = !DIFile(filename: "src/ioblksize.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!312 = !{!313}
!313 = !DIEnumerator(name: "IO_BUFSIZE", value: 131072, isUnsigned: true)
!314 = !{!66, !131, !7, !115, !186, !315, !239}
!315 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!316 = !{!317, !285, !323, !325, !337, !339}
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(name: "mask", scope: !319, file: !288, line: 3087, type: !66, isLocal: true, isDefinition: true)
!319 = distinct !DISubprogram(name: "cached_umask", scope: !288, file: !288, line: 3085, type: !320, scopeLine: 3086, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !287, retainedNodes: !322)
!320 = !DISubroutineType(types: !321)
!321 = !{!66}
!322 = !{}
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(name: "top_level_dst_name", scope: !287, file: !288, line: 148, type: !55, isLocal: true, isDefinition: true)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "zeros", scope: !327, file: !288, line: 385, type: !115, isLocal: true, isDefinition: true)
!327 = distinct !DISubprogram(name: "write_zeros", scope: !288, file: !288, line: 383, type: !328, scopeLine: 384, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !287, retainedNodes: !332)
!328 = !DISubroutineType(types: !329)
!329 = !{!71, !102, !330}
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !331, line: 63, baseType: !199)
!331 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!332 = !{!333, !334, !335}
!333 = !DILocalVariable(name: "fd", arg: 1, scope: !327, file: !288, line: 383, type: !102)
!334 = !DILocalVariable(name: "n_bytes", arg: 2, scope: !327, file: !288, line: 383, type: !330)
!335 = !DILocalVariable(name: "n", scope: !336, file: !288, line: 404, type: !239)
!336 = distinct !DILexicalBlock(scope: !327, file: !288, line: 403, column: 5)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(name: "nz", scope: !327, file: !288, line: 386, type: !239, isLocal: true, isDefinition: true)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "fallback", scope: !327, file: !288, line: 393, type: !341, isLocal: true, isDefinition: true)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 8192, elements: !342)
!342 = !{!343}
!343 = !DISubrange(count: 1024)
!344 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709421568, DW_OP_mul, DW_OP_constu, 131072, DW_OP_plus, DW_OP_stack_value))
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(name: "src_to_dest", scope: !347, file: !348, line: 45, type: !105, isLocal: true, isDefinition: true)
!347 = distinct !DICompileUnit(language: DW_LANG_C99, file: !348, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !322, retainedTypes: !349, globals: !353, nameTableKind: None)
!348 = !DIFile(filename: "src/cp-hash.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!349 = !{!131, !115, !350}
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !351, line: 102, baseType: !352)
!351 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !69, line: 73, baseType: !186)
!353 = !{!345}
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "simple_pattern", scope: !356, file: !357, line: 38, type: !366, isLocal: true, isDefinition: true)
!356 = distinct !DICompileUnit(language: DW_LANG_C99, file: !357, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !358, globals: !365, nameTableKind: None)
!357 = !DIFile(filename: "src/force-link.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!358 = !{!359, !362}
!359 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !357, line: 39, baseType: !7, size: 32, elements: !360)
!360 = !{!361}
!361 = !DIEnumerator(name: "x_suffix_len", value: 6, isUnsigned: true)
!362 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !357, line: 44, baseType: !7, size: 32, elements: !363)
!363 = !{!364}
!364 = !DIEnumerator(name: "smallsize", value: 256, isUnsigned: true)
!365 = !{!354}
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 72, elements: !367)
!367 = !{!368}
!368 = !DISubrange(count: 9)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(name: "Version", scope: !371, file: !372, line: 2, type: !55, isDefinition: true)
!371 = distinct !DICompileUnit(language: DW_LANG_C99, file: !372, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !322, globals: !373, nameTableKind: None)
!372 = !DIFile(filename: "src/version.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!373 = !{!369}
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !376, file: !377, line: 67, type: !381, isDefinition: true)
!376 = distinct !DICompileUnit(language: DW_LANG_C99, file: !377, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !378, retainedTypes: !379, globals: !380, nameTableKind: None)
!377 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!378 = !{!37}
!379 = !{!131, !55, !315}
!380 = !{!374}
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !382, line: 61, baseType: !383)
!382 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{null}
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "simple_backup_suffix", scope: !388, file: !389, line: 82, type: !55, isDefinition: true)
!388 = distinct !DICompileUnit(language: DW_LANG_C99, file: !389, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !390, retainedTypes: !451, globals: !452, nameTableKind: None)
!389 = !DIFile(filename: "lib/backupfile.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!390 = !{!5, !391, !421, !427}
!391 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !392, file: !389, line: 327, baseType: !7, size: 32, elements: !419)
!392 = distinct !DISubprogram(name: "backupfile_internal", scope: !389, file: !389, line: 314, type: !393, scopeLine: 316, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !388, retainedNodes: !395)
!393 = !DISubroutineType(types: !394)
!394 = !{!115, !102, !55, !5, !71}
!395 = !{!396, !397, !398, !399, !400, !402, !403, !404, !405, !408, !409, !414, !415, !416, !418}
!396 = !DILocalVariable(name: "dir_fd", arg: 1, scope: !392, file: !389, line: 314, type: !102)
!397 = !DILocalVariable(name: "file", arg: 2, scope: !392, file: !389, line: 314, type: !55)
!398 = !DILocalVariable(name: "backup_type", arg: 3, scope: !392, file: !389, line: 315, type: !5)
!399 = !DILocalVariable(name: "rename", arg: 4, scope: !392, file: !389, line: 315, type: !71)
!400 = !DILocalVariable(name: "base_offset", scope: !392, file: !389, line: 317, type: !401)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !240, line: 35, baseType: !200)
!402 = !DILocalVariable(name: "filelen", scope: !392, file: !389, line: 318, type: !239)
!403 = !DILocalVariable(name: "simple_backup_suffix_size", scope: !392, file: !389, line: 325, type: !239)
!404 = !DILocalVariable(name: "backup_suffix_size_guess", scope: !392, file: !389, line: 326, type: !239)
!405 = !DILocalVariable(name: "ssize", scope: !392, file: !389, line: 331, type: !406)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !67, line: 108, baseType: !407)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !69, line: 194, baseType: !200)
!408 = !DILocalVariable(name: "s", scope: !392, file: !389, line: 332, type: !115)
!409 = !DILocalVariable(name: "dirp", scope: !392, file: !389, line: 336, type: !410)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !412, line: 127, baseType: !413)
!412 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!413 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !412, line: 127, flags: DIFlagFwdDecl)
!414 = !DILocalVariable(name: "sdir", scope: !392, file: !389, line: 337, type: !102)
!415 = !DILocalVariable(name: "base_max", scope: !392, file: !389, line: 338, type: !239)
!416 = !DILocalVariable(name: "flags", scope: !417, file: !389, line: 380, type: !7)
!417 = distinct !DILexicalBlock(scope: !392, file: !389, line: 340, column: 5)
!418 = !DILocalVariable(name: "e", scope: !417, file: !389, line: 383, type: !102)
!419 = !{!420}
!420 = !DIEnumerator(name: "GUESS", value: 9, isUnsigned: true)
!421 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "numbered_backup_result", file: !389, line: 172, baseType: !7, size: 32, elements: !422)
!422 = !{!423, !424, !425, !426}
!423 = !DIEnumerator(name: "BACKUP_IS_SAME_LENGTH", value: 0, isUnsigned: true)
!424 = !DIEnumerator(name: "BACKUP_IS_LONGER", value: 1, isUnsigned: true)
!425 = !DIEnumerator(name: "BACKUP_IS_NEW", value: 2, isUnsigned: true)
!426 = !DIEnumerator(name: "BACKUP_NOMEM", value: 3, isUnsigned: true)
!427 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !428, line: 24, baseType: !7, size: 32, elements: !429)
!428 = !DIFile(filename: "/usr/include/bits/confname.h", directory: "")
!429 = !{!430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450}
!430 = !DIEnumerator(name: "_PC_LINK_MAX", value: 0, isUnsigned: true)
!431 = !DIEnumerator(name: "_PC_MAX_CANON", value: 1, isUnsigned: true)
!432 = !DIEnumerator(name: "_PC_MAX_INPUT", value: 2, isUnsigned: true)
!433 = !DIEnumerator(name: "_PC_NAME_MAX", value: 3, isUnsigned: true)
!434 = !DIEnumerator(name: "_PC_PATH_MAX", value: 4, isUnsigned: true)
!435 = !DIEnumerator(name: "_PC_PIPE_BUF", value: 5, isUnsigned: true)
!436 = !DIEnumerator(name: "_PC_CHOWN_RESTRICTED", value: 6, isUnsigned: true)
!437 = !DIEnumerator(name: "_PC_NO_TRUNC", value: 7, isUnsigned: true)
!438 = !DIEnumerator(name: "_PC_VDISABLE", value: 8, isUnsigned: true)
!439 = !DIEnumerator(name: "_PC_SYNC_IO", value: 9, isUnsigned: true)
!440 = !DIEnumerator(name: "_PC_ASYNC_IO", value: 10, isUnsigned: true)
!441 = !DIEnumerator(name: "_PC_PRIO_IO", value: 11, isUnsigned: true)
!442 = !DIEnumerator(name: "_PC_SOCK_MAXBUF", value: 12, isUnsigned: true)
!443 = !DIEnumerator(name: "_PC_FILESIZEBITS", value: 13, isUnsigned: true)
!444 = !DIEnumerator(name: "_PC_REC_INCR_XFER_SIZE", value: 14, isUnsigned: true)
!445 = !DIEnumerator(name: "_PC_REC_MAX_XFER_SIZE", value: 15, isUnsigned: true)
!446 = !DIEnumerator(name: "_PC_REC_MIN_XFER_SIZE", value: 16, isUnsigned: true)
!447 = !DIEnumerator(name: "_PC_REC_XFER_ALIGN", value: 17, isUnsigned: true)
!448 = !DIEnumerator(name: "_PC_ALLOC_SIZE_MIN", value: 18, isUnsigned: true)
!449 = !DIEnumerator(name: "_PC_SYMLINK_MAX", value: 19, isUnsigned: true)
!450 = !DIEnumerator(name: "_PC_2_SYMLINKS", value: 20, isUnsigned: true)
!451 = !{!131, !7, !239}
!452 = !{!386}
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(name: "backup_args", scope: !455, file: !456, line: 42, type: !464, isLocal: true, isDefinition: true)
!455 = distinct !DICompileUnit(language: DW_LANG_C99, file: !456, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !457, retainedTypes: !458, globals: !459, nameTableKind: None)
!456 = !DIFile(filename: "lib/backup-find.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!457 = !{!5}
!458 = !{!129}
!459 = !{!460, !453}
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(name: "backup_types", scope: !455, file: !456, line: 53, type: !462, isLocal: true, isDefinition: true)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !463, size: 256, elements: !164)
!463 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 576, elements: !367)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(name: "file_name", scope: !467, file: !468, line: 37, type: !55, isLocal: true, isDefinition: true)
!467 = distinct !DICompileUnit(language: DW_LANG_C99, file: !468, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !322, globals: !469, nameTableKind: None)
!468 = !DIFile(filename: "lib/closein.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!469 = !{!465}
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(name: "file_name", scope: !472, file: !473, line: 46, type: !55, isLocal: true, isDefinition: true)
!472 = distinct !DICompileUnit(language: DW_LANG_C99, file: !473, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !322, globals: !474, nameTableKind: None)
!473 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!474 = !{!470, !475}
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !472, file: !473, line: 56, type: !71, isLocal: true, isDefinition: true)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(name: "exit_failure", scope: !479, file: !480, line: 24, type: !482, isDefinition: true)
!479 = distinct !DICompileUnit(language: DW_LANG_C99, file: !480, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !322, globals: !481, nameTableKind: None)
!480 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!481 = !{!477}
!482 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !102)
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(name: "default_tuning", scope: !485, file: !486, line: 130, type: !489, isLocal: true, isDefinition: true)
!485 = distinct !DICompileUnit(language: DW_LANG_C99, file: !486, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !322, retainedTypes: !487, globals: !488, nameTableKind: None)
!486 = !DIFile(filename: "lib/hash.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!487 = !{!186, !131, !239}
!488 = !{!483}
!489 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !490)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !107, line: 65, baseType: !491)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !107, line: 53, size: 160, elements: !492)
!492 = !{!493, !495, !496, !497, !498}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !491, file: !107, line: 58, baseType: !494, size: 32)
!494 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !491, file: !107, line: 59, baseType: !494, size: 32, offset: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !491, file: !107, line: 60, baseType: !494, size: 32, offset: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !491, file: !107, line: 61, baseType: !494, size: 32, offset: 96)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !491, file: !107, line: 62, baseType: !71, size: 8, offset: 128)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(name: "program_name", scope: !501, file: !502, line: 33, type: !55, isDefinition: true)
!501 = distinct !DICompileUnit(language: DW_LANG_C99, file: !502, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !322, retainedTypes: !503, globals: !504, nameTableKind: None)
!502 = !DIFile(filename: "lib/progname.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!503 = !{!131, !115}
!504 = !{!499}
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !507, file: !508, line: 85, type: !567, isDefinition: true)
!507 = distinct !DICompileUnit(language: DW_LANG_C99, file: !508, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !509, retainedTypes: !530, globals: !532, nameTableKind: None)
!508 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!509 = !{!37, !510, !515}
!510 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !38, line: 242, baseType: !7, size: 32, elements: !511)
!511 = !{!512, !513, !514}
!512 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!513 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!514 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!515 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !516, line: 46, baseType: !7, size: 32, elements: !517)
!516 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!517 = !{!518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529}
!518 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!519 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!520 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!521 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!522 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!523 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!524 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!525 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!526 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!527 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!528 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!529 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!530 = !{!102, !531, !239, !115}
!531 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!532 = !{!505, !533, !539, !549, !551, !556, !563, !565}
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !507, file: !508, line: 101, type: !535, isDefinition: true)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !536, size: 320, elements: !537)
!536 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!537 = !{!538}
!538 = !DISubrange(count: 10)
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !507, file: !508, line: 1052, type: !541, isDefinition: true)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !508, line: 65, size: 448, elements: !542)
!542 = !{!543, !544, !545, !547, !548}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !541, file: !508, line: 68, baseType: !37, size: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !541, file: !508, line: 71, baseType: !102, size: 32, offset: 32)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !541, file: !508, line: 75, baseType: !546, size: 256, offset: 64)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !164)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !541, file: !508, line: 78, baseType: !55, size: 64, offset: 320)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !541, file: !508, line: 81, baseType: !55, size: 64, offset: 384)
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !507, file: !508, line: 116, type: !541, isLocal: true, isDefinition: true)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(name: "slot0", scope: !507, file: !508, line: 842, type: !553, isLocal: true, isDefinition: true)
!553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 2048, elements: !554)
!554 = !{!555}
!555 = !DISubrange(count: 256)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(name: "slotvec", scope: !507, file: !508, line: 845, type: !558, isLocal: true, isDefinition: true)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !508, line: 834, size: 128, elements: !560)
!560 = !{!561, !562}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !559, file: !508, line: 836, baseType: !239, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !559, file: !508, line: 837, baseType: !115, size: 64, offset: 64)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(name: "nslots", scope: !507, file: !508, line: 843, type: !102, isLocal: true, isDefinition: true)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(name: "slotvec0", scope: !507, file: !508, line: 844, type: !559, isLocal: true, isDefinition: true)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 704, elements: !568)
!568 = !{!569}
!569 = !DISubrange(count: 11)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(name: "comparison_function_table", scope: !572, file: !573, line: 74, type: !590, isLocal: true, isDefinition: true)
!572 = distinct !DICompileUnit(language: DW_LANG_C99, file: !573, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !574, retainedTypes: !588, globals: !589, nameTableKind: None)
!573 = !DIFile(filename: "lib/savedir.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!574 = !{!294, !575}
!575 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !577, file: !576, line: 186, baseType: !7, size: 32, elements: !586)
!576 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!577 = distinct !DISubprogram(name: "x2nrealloc", scope: !576, file: !576, line: 174, type: !578, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !572, retainedNodes: !581)
!578 = !DISubroutineType(types: !579)
!579 = !{!131, !131, !580, !239}
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!581 = !{!582, !583, !584, !585}
!582 = !DILocalVariable(name: "p", arg: 1, scope: !577, file: !576, line: 174, type: !131)
!583 = !DILocalVariable(name: "pn", arg: 2, scope: !577, file: !576, line: 174, type: !580)
!584 = !DILocalVariable(name: "s", arg: 3, scope: !577, file: !576, line: 174, type: !239)
!585 = !DILocalVariable(name: "n", scope: !577, file: !576, line: 176, type: !239)
!586 = !{!587}
!587 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!588 = !{!131, !239}
!589 = !{!570}
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !591, size: 192, elements: !141)
!591 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !592)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "comparison_function", file: !573, line: 72, baseType: !593)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DISubroutineType(types: !595)
!595 = !{!102, !129, !129}
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(name: "letters", scope: !598, file: !599, line: 184, type: !601, isLocal: true, isDefinition: true)
!598 = distinct !DICompileUnit(language: DW_LANG_C99, file: !599, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !322, globals: !600, nameTableKind: None)
!599 = !DIFile(filename: "lib/tempname.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!600 = !{!596}
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 504, elements: !602)
!602 = !{!603}
!603 = !DISubrange(count: 63)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(name: "ht", scope: !606, file: !607, line: 163, type: !105, isLocal: true, isDefinition: true)
!606 = distinct !DISubprogram(name: "utimecmpat", scope: !607, file: !607, line: 132, type: !608, scopeLine: 136, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !633, retainedNodes: !648)
!607 = !DIFile(filename: "lib/utimecmp.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!608 = !DISubroutineType(types: !609)
!609 = !{!102, !102, !55, !610, !610, !102}
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !612)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !182, line: 26, size: 1152, elements: !613)
!613 = !{!614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !630, !631, !632}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !612, file: !182, line: 28, baseType: !185, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !612, file: !182, line: 33, baseType: !188, size: 64, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !612, file: !182, line: 41, baseType: !190, size: 64, offset: 128)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !612, file: !182, line: 42, baseType: !68, size: 32, offset: 192)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !612, file: !182, line: 44, baseType: !193, size: 32, offset: 224)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !612, file: !182, line: 45, baseType: !195, size: 32, offset: 256)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !612, file: !182, line: 47, baseType: !102, size: 32, offset: 288)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !612, file: !182, line: 49, baseType: !185, size: 64, offset: 320)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !612, file: !182, line: 54, baseType: !199, size: 64, offset: 384)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !612, file: !182, line: 58, baseType: !202, size: 64, offset: 448)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !612, file: !182, line: 60, baseType: !204, size: 64, offset: 512)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !612, file: !182, line: 71, baseType: !626, size: 128, offset: 576)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !207, line: 10, size: 128, elements: !627)
!627 = !{!628, !629}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !626, file: !207, line: 12, baseType: !210, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !626, file: !207, line: 16, baseType: !212, size: 64, offset: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !612, file: !182, line: 72, baseType: !626, size: 128, offset: 704)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !612, file: !182, line: 73, baseType: !626, size: 128, offset: 832)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !612, file: !182, line: 86, baseType: !216, size: 192, offset: 960)
!633 = distinct !DICompileUnit(language: DW_LANG_C99, file: !607, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !634, globals: !638, nameTableKind: None)
!634 = !{!290, !635}
!635 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !607, line: 49, baseType: !7, size: 32, elements: !636)
!636 = !{!637}
!637 = !DIEnumerator(name: "SYSCALL_RESOLUTION", value: 1, isUnsigned: true)
!638 = !{!604, !639}
!639 = !DIGlobalVariableExpression(var: !640, expr: !DIExpression())
!640 = distinct !DIGlobalVariable(name: "new_dst_res", scope: !606, file: !607, line: 166, type: !641, isLocal: true, isDefinition: true)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fs_res", file: !607, line: 66, size: 128, elements: !643)
!643 = !{!644, !646, !647}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !642, file: !607, line: 69, baseType: !645, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !67, line: 59, baseType: !185)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "resolution", scope: !642, file: !607, line: 76, baseType: !102, size: 32, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "exact", scope: !642, file: !607, line: 80, baseType: !71, size: 8, offset: 96)
!648 = !{!649, !650, !651, !652, !653, !654, !657, !658, !659, !660, !663, !664, !665, !668, !669, !670, !671, !672, !673, !675, !678, !679, !680, !681, !687, !688, !690, !692, !694, !695}
!649 = !DILocalVariable(name: "dfd", arg: 1, scope: !606, file: !607, line: 132, type: !102)
!650 = !DILocalVariable(name: "dst_name", arg: 2, scope: !606, file: !607, line: 132, type: !55)
!651 = !DILocalVariable(name: "dst_stat", arg: 3, scope: !606, file: !607, line: 133, type: !610)
!652 = !DILocalVariable(name: "src_stat", arg: 4, scope: !606, file: !607, line: 134, type: !610)
!653 = !DILocalVariable(name: "options", arg: 5, scope: !606, file: !607, line: 135, type: !102)
!654 = !DILocalVariable(name: "dst_s", scope: !606, file: !607, line: 153, type: !655)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !656, line: 7, baseType: !210)
!656 = !DIFile(filename: "/usr/include/bits/types/time_t.h", directory: "")
!657 = !DILocalVariable(name: "src_s", scope: !606, file: !607, line: 154, type: !655)
!658 = !DILocalVariable(name: "dst_ns", scope: !606, file: !607, line: 155, type: !102)
!659 = !DILocalVariable(name: "src_ns", scope: !606, file: !607, line: 156, type: !102)
!660 = !DILocalVariable(name: "dst_res", scope: !661, file: !607, line: 167, type: !641)
!661 = distinct !DILexicalBlock(scope: !662, file: !607, line: 159, column: 5)
!662 = distinct !DILexicalBlock(scope: !606, file: !607, line: 158, column: 7)
!663 = !DILocalVariable(name: "tmp_dst_res", scope: !661, file: !607, line: 168, type: !642)
!664 = !DILocalVariable(name: "res", scope: !661, file: !607, line: 171, type: !102)
!665 = !DILocalVariable(name: "dst_a_s", scope: !666, file: !607, line: 262, type: !655)
!666 = distinct !DILexicalBlock(scope: !667, file: !607, line: 258, column: 9)
!667 = distinct !DILexicalBlock(scope: !661, file: !607, line: 257, column: 11)
!668 = !DILocalVariable(name: "dst_c_s", scope: !666, file: !607, line: 263, type: !655)
!669 = !DILocalVariable(name: "dst_m_s", scope: !666, file: !607, line: 264, type: !655)
!670 = !DILocalVariable(name: "dst_a_ns", scope: !666, file: !607, line: 265, type: !102)
!671 = !DILocalVariable(name: "dst_c_ns", scope: !666, file: !607, line: 266, type: !102)
!672 = !DILocalVariable(name: "dst_m_ns", scope: !666, file: !607, line: 267, type: !102)
!673 = !DILocalVariable(name: "odd_second", scope: !674, file: !607, line: 276, type: !71)
!674 = distinct !DILexicalBlock(scope: !666, file: !607, line: 275, column: 11)
!675 = !DILocalVariable(name: "a", scope: !676, file: !607, line: 285, type: !102)
!676 = distinct !DILexicalBlock(scope: !677, file: !607, line: 284, column: 15)
!677 = distinct !DILexicalBlock(scope: !674, file: !607, line: 278, column: 17)
!678 = !DILocalVariable(name: "c", scope: !676, file: !607, line: 286, type: !102)
!679 = !DILocalVariable(name: "m", scope: !676, file: !607, line: 287, type: !102)
!680 = !DILocalVariable(name: "SR10", scope: !676, file: !607, line: 291, type: !102)
!681 = !DILocalVariable(name: "timespec", scope: !682, file: !607, line: 313, type: !684)
!682 = distinct !DILexicalBlock(scope: !683, file: !607, line: 312, column: 13)
!683 = distinct !DILexicalBlock(scope: !666, file: !607, line: 311, column: 15)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !626, size: 256, elements: !685)
!685 = !{!686}
!686 = !DISubrange(count: 2)
!687 = !DILocalVariable(name: "dst_status", scope: !682, file: !607, line: 314, type: !612)
!688 = !DILocalVariable(name: "s", scope: !689, file: !607, line: 324, type: !655)
!689 = distinct !DILexicalBlock(scope: !682, file: !607, line: 323, column: 15)
!690 = !DILocalVariable(name: "stat_result", scope: !691, file: !607, line: 348, type: !102)
!691 = distinct !DILexicalBlock(scope: !682, file: !607, line: 347, column: 15)
!692 = !DILocalVariable(name: "old_res", scope: !693, file: !607, line: 369, type: !102)
!693 = distinct !DILexicalBlock(scope: !682, file: !607, line: 368, column: 15)
!694 = !DILocalVariable(name: "a", scope: !693, file: !607, line: 370, type: !102)
!695 = !DILabel(scope: !696, name: "low_memory", file: !607, line: 211)
!696 = distinct !DILexicalBlock(scope: !697, file: !607, line: 210, column: 9)
!697 = distinct !DILexicalBlock(scope: !661, file: !607, line: 187, column: 11)
!698 = !DIGlobalVariableExpression(var: !699, expr: !DIExpression())
!699 = distinct !DIGlobalVariable(name: "utimensat_works_really", scope: !700, file: !701, line: 75, type: !102, isLocal: true, isDefinition: true)
!700 = distinct !DICompileUnit(language: DW_LANG_C99, file: !701, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !702, globals: !707, nameTableKind: None)
!701 = !DIFile(filename: "lib/utimens.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!702 = !{!703}
!703 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !704, line: 42, baseType: !7, size: 32, elements: !705)
!704 = !DIFile(filename: "./lib/timespec.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!705 = !{!706}
!706 = !DIEnumerator(name: "TIMESPEC_HZ", value: 1000000000, isUnsigned: true)
!707 = !{!698, !708}
!708 = !DIGlobalVariableExpression(var: !709, expr: !DIExpression())
!709 = distinct !DIGlobalVariable(name: "lutimensat_works_really", scope: !700, file: !701, line: 76, type: !102, isLocal: true, isDefinition: true)
!710 = !DIGlobalVariableExpression(var: !711, expr: !DIExpression())
!711 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !712, file: !713, line: 26, type: !715, isDefinition: true)
!712 = distinct !DICompileUnit(language: DW_LANG_C99, file: !713, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !322, globals: !714, nameTableKind: None)
!713 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!714 = !{!710}
!715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 376, elements: !716)
!716 = !{!717}
!717 = !DISubrange(count: 47)
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!719 = distinct !DIGlobalVariable(name: "initialized", scope: !720, file: !721, line: 34, type: !71, isLocal: true, isDefinition: true)
!720 = distinct !DISubprogram(name: "can_write_any_file", scope: !721, file: !721, line: 32, type: !722, scopeLine: 33, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !724, retainedNodes: !729)
!721 = !DIFile(filename: "lib/write-any-file.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!722 = !DISubroutineType(types: !723)
!723 = !{!71}
!724 = distinct !DICompileUnit(language: DW_LANG_C99, file: !721, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !322, globals: !725, nameTableKind: None)
!725 = !{!726, !727}
!726 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!727 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression())
!728 = distinct !DIGlobalVariable(name: "can_write", scope: !720, file: !721, line: 35, type: !71, isLocal: true, isDefinition: true)
!729 = !{!730}
!730 = !DILocalVariable(name: "can", scope: !731, file: !721, line: 39, type: !71)
!731 = distinct !DILexicalBlock(scope: !732, file: !721, line: 38, column: 5)
!732 = distinct !DILexicalBlock(scope: !720, file: !721, line: 37, column: 7)
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !735, file: !736, line: 507, type: !102, isLocal: true, isDefinition: true)
!735 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !736, file: !736, line: 488, type: !737, scopeLine: 489, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !739, retainedNodes: !741)
!736 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!737 = !DISubroutineType(types: !738)
!738 = !{!102, !102, !102}
!739 = distinct !DICompileUnit(language: DW_LANG_C99, file: !736, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !322, globals: !740, nameTableKind: None)
!740 = !{!733}
!741 = !{!742, !743, !744, !745, !748}
!742 = !DILocalVariable(name: "fd", arg: 1, scope: !735, file: !736, line: 488, type: !102)
!743 = !DILocalVariable(name: "target", arg: 2, scope: !735, file: !736, line: 488, type: !102)
!744 = !DILocalVariable(name: "result", scope: !735, file: !736, line: 490, type: !102)
!745 = !DILocalVariable(name: "flags", scope: !746, file: !736, line: 531, type: !102)
!746 = distinct !DILexicalBlock(scope: !747, file: !736, line: 530, column: 5)
!747 = distinct !DILexicalBlock(scope: !735, file: !736, line: 529, column: 7)
!748 = !DILocalVariable(name: "saved_errno", scope: !749, file: !736, line: 534, type: !102)
!749 = distinct !DILexicalBlock(scope: !750, file: !736, line: 533, column: 9)
!750 = distinct !DILexicalBlock(scope: !746, file: !736, line: 532, column: 11)
!751 = distinct !DICompileUnit(language: DW_LANG_C99, file: !752, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !753, retainedTypes: !834, nameTableKind: None)
!752 = !DIFile(filename: "src/extent-scan.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!753 = !{!754}
!754 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !755, file: !752, line: 98, baseType: !7, size: 32, elements: !832)
!755 = distinct !DISubprogram(name: "extent_scan_read", scope: !752, file: !752, line: 87, type: !756, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !751, retainedNodes: !776)
!756 = !DISubroutineType(types: !757)
!757 = !{!71, !758}
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extent_scan", file: !760, line: 36, size: 384, elements: !761)
!760 = !DIFile(filename: "src/extent-scan.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!761 = !{!762, !763, !765, !766, !767, !768, !769}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !759, file: !760, line: 39, baseType: !102, size: 32)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "scan_start", scope: !759, file: !760, line: 42, baseType: !764, size: 64, offset: 64)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !67, line: 85, baseType: !199)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "fm_flags", scope: !759, file: !760, line: 45, baseType: !7, size: 32, offset: 128)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "ei_count", scope: !759, file: !760, line: 48, baseType: !239, size: 64, offset: 192)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "initial_scan_failed", scope: !759, file: !760, line: 52, baseType: !71, size: 8, offset: 256)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "hit_final_extent", scope: !759, file: !760, line: 55, baseType: !71, size: 8, offset: 264)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "ext_info", scope: !759, file: !760, line: 58, baseType: !770, size: 64, offset: 320)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extent_info", file: !760, line: 23, size: 192, elements: !772)
!772 = !{!773, !774, !775}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "ext_logical", scope: !771, file: !760, line: 26, baseType: !764, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "ext_length", scope: !771, file: !760, line: 29, baseType: !764, size: 64, offset: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "ext_flags", scope: !771, file: !760, line: 32, baseType: !7, size: 32, offset: 128)
!776 = !{!777, !778, !779, !780, !817, !819, !821, !823, !824, !831}
!777 = !DILocalVariable(name: "scan", arg: 1, scope: !755, file: !752, line: 87, type: !758)
!778 = !DILocalVariable(name: "si", scope: !755, file: !752, line: 89, type: !7)
!779 = !DILocalVariable(name: "last_ei", scope: !755, file: !752, line: 90, type: !770)
!780 = !DILocalVariable(name: "fiemap_buf", scope: !781, file: !752, line: 94, type: !782)
!781 = distinct !DILexicalBlock(scope: !755, file: !752, line: 93, column: 5)
!782 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !755, file: !752, line: 94, size: 32768, elements: !783)
!783 = !{!784, !813}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !782, file: !752, line: 94, baseType: !785, size: 256)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fiemap", file: !786, line: 35, size: 256, elements: !787)
!786 = !DIFile(filename: "src/fiemap.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!787 = !{!788, !792, !793, !796, !797, !798, !799}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "fm_start", scope: !785, file: !786, line: 38, baseType: !789, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !790, line: 27, baseType: !791)
!790 = !DIFile(filename: "/usr/include/bits/stdint-uintn.h", directory: "")
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !69, line: 45, baseType: !186)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "fm_length", scope: !785, file: !786, line: 41, baseType: !789, size: 64, offset: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "fm_flags", scope: !785, file: !786, line: 44, baseType: !794, size: 32, offset: 128)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !790, line: 26, baseType: !795)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !69, line: 42, baseType: !7)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "fm_mapped_extents", scope: !785, file: !786, line: 47, baseType: !794, size: 32, offset: 160)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "fm_extent_count", scope: !785, file: !786, line: 50, baseType: !794, size: 32, offset: 192)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "fm_reserved", scope: !785, file: !786, line: 52, baseType: !794, size: 32, offset: 224)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "fm_extents", scope: !785, file: !786, line: 55, baseType: !800, offset: 256)
!800 = !DICompositeType(tag: DW_TAG_array_type, baseType: !801, elements: !811)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fiemap_extent", file: !786, line: 14, size: 448, elements: !802)
!802 = !{!803, !804, !805, !806, !808, !809}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "fe_logical", scope: !801, file: !786, line: 18, baseType: !789, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "fe_physical", scope: !801, file: !786, line: 22, baseType: !789, size: 64, offset: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "fe_length", scope: !801, file: !786, line: 25, baseType: !789, size: 64, offset: 128)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "fe_reserved64", scope: !801, file: !786, line: 27, baseType: !807, size: 128, offset: 192)
!807 = !DICompositeType(tag: DW_TAG_array_type, baseType: !789, size: 128, elements: !685)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "fe_flags", scope: !801, file: !786, line: 30, baseType: !794, size: 32, offset: 320)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "fe_reserved", scope: !801, file: !786, line: 32, baseType: !810, size: 96, offset: 352)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !794, size: 96, elements: !141)
!811 = !{!812}
!812 = !DISubrange(count: -1)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !782, file: !752, line: 94, baseType: !814, size: 32768)
!814 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 32768, elements: !815)
!815 = !{!816}
!816 = !DISubrange(count: 4096)
!817 = !DILocalVariable(name: "fiemap", scope: !781, file: !752, line: 95, type: !818)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!819 = !DILocalVariable(name: "fm_extents", scope: !781, file: !752, line: 96, type: !820)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!821 = !DILocalVariable(name: "prev_idx", scope: !822, file: !752, line: 132, type: !239)
!822 = distinct !DILexicalBlock(scope: !781, file: !752, line: 129, column: 7)
!823 = !DILocalVariable(name: "i", scope: !781, file: !752, line: 138, type: !7)
!824 = !DILocalVariable(name: "new_logical", scope: !825, file: !752, line: 164, type: !789)
!825 = distinct !DILexicalBlock(scope: !826, file: !752, line: 159, column: 13)
!826 = distinct !DILexicalBlock(scope: !827, file: !752, line: 156, column: 20)
!827 = distinct !DILexicalBlock(scope: !828, file: !752, line: 146, column: 15)
!828 = distinct !DILexicalBlock(scope: !829, file: !752, line: 140, column: 9)
!829 = distinct !DILexicalBlock(scope: !830, file: !752, line: 139, column: 7)
!830 = distinct !DILexicalBlock(scope: !781, file: !752, line: 139, column: 7)
!831 = !DILocalVariable(name: "length_adjust", scope: !825, file: !752, line: 165, type: !789)
!832 = !{!833}
!833 = !DIEnumerator(name: "count", value: 72, isUnsigned: true)
!834 = !{!764, !239}
!835 = distinct !DICompileUnit(language: DW_LANG_C99, file: !836, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !322, nameTableKind: None)
!836 = !DIFile(filename: "src/selinux.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!837 = distinct !DICompileUnit(language: DW_LANG_C99, file: !838, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !322, nameTableKind: None)
!838 = !DIFile(filename: "lib/copy-acl.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!839 = distinct !DICompileUnit(language: DW_LANG_C99, file: !840, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !322, nameTableKind: None)
!840 = !DIFile(filename: "lib/set-acl.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!841 = distinct !DICompileUnit(language: DW_LANG_C99, file: !842, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !843, retainedTypes: !875, nameTableKind: None)
!842 = !DIFile(filename: "lib/areadlink-with-size.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!843 = !{!844}
!844 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !845, file: !842, line: 64, baseType: !7, size: 32, elements: !873)
!845 = distinct !DISubprogram(name: "areadlink_with_size", scope: !842, file: !842, line: 53, type: !846, scopeLine: 54, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !841, retainedNodes: !848)
!846 = !DISubroutineType(types: !847)
!847 = !{!115, !55, !239}
!848 = !{!849, !850, !851, !852, !853, !854, !855, !857, !858, !862, !863, !864, !867}
!849 = !DILocalVariable(name: "file", arg: 1, scope: !845, file: !842, line: 53, type: !55)
!850 = !DILocalVariable(name: "size", arg: 2, scope: !845, file: !842, line: 53, type: !239)
!851 = !DILocalVariable(name: "symlink_max", scope: !845, file: !842, line: 58, type: !239)
!852 = !DILocalVariable(name: "INITIAL_LIMIT_BOUND", scope: !845, file: !842, line: 59, type: !239)
!853 = !DILocalVariable(name: "initial_limit", scope: !845, file: !842, line: 60, type: !239)
!854 = !DILocalVariable(name: "buf_size", scope: !845, file: !842, line: 67, type: !239)
!855 = !DILocalVariable(name: "r", scope: !856, file: !842, line: 72, type: !406)
!856 = distinct !DILexicalBlock(scope: !845, file: !842, line: 71, column: 5)
!857 = !DILocalVariable(name: "link_length", scope: !856, file: !842, line: 73, type: !239)
!858 = !DILocalVariable(name: "stackbuf", scope: !856, file: !842, line: 74, type: !859)
!859 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 1024, elements: !860)
!860 = !{!861}
!861 = !DISubrange(count: 128)
!862 = !DILocalVariable(name: "buf", scope: !856, file: !842, line: 75, type: !115)
!863 = !DILocalVariable(name: "buffer", scope: !856, file: !842, line: 76, type: !115)
!864 = !DILocalVariable(name: "saved_errno", scope: !865, file: !842, line: 92, type: !102)
!865 = distinct !DILexicalBlock(scope: !866, file: !842, line: 91, column: 9)
!866 = distinct !DILexicalBlock(scope: !856, file: !842, line: 90, column: 11)
!867 = !DILocalVariable(name: "shrinked_buffer", scope: !868, file: !842, line: 110, type: !115)
!868 = distinct !DILexicalBlock(scope: !869, file: !842, line: 108, column: 13)
!869 = distinct !DILexicalBlock(scope: !870, file: !842, line: 107, column: 20)
!870 = distinct !DILexicalBlock(scope: !871, file: !842, line: 101, column: 15)
!871 = distinct !DILexicalBlock(scope: !872, file: !842, line: 99, column: 9)
!872 = distinct !DILexicalBlock(scope: !856, file: !842, line: 98, column: 11)
!873 = !{!874}
!874 = !DIEnumerator(name: "stackbuf_size", value: 128, isUnsigned: true)
!875 = !{!131}
!876 = distinct !DICompileUnit(language: DW_LANG_C99, file: !877, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !457, nameTableKind: None)
!877 = !DIFile(filename: "lib/backup-rename.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!878 = distinct !DICompileUnit(language: DW_LANG_C99, file: !879, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !322, nameTableKind: None)
!879 = !DIFile(filename: "lib/buffer-lcm.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!880 = distinct !DICompileUnit(language: DW_LANG_C99, file: !881, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !322, nameTableKind: None)
!881 = !DIFile(filename: "lib/dirname.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!882 = distinct !DICompileUnit(language: DW_LANG_C99, file: !883, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !322, nameTableKind: None)
!883 = !DIFile(filename: "lib/dirname-lgpl.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!884 = distinct !DICompileUnit(language: DW_LANG_C99, file: !885, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !322, retainedTypes: !886, nameTableKind: None)
!885 = !DIFile(filename: "lib/basename-lgpl.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!886 = !{!115}
!887 = distinct !DICompileUnit(language: DW_LANG_C99, file: !888, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !322, nameTableKind: None)
!888 = !DIFile(filename: "lib/stripslash.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!889 = distinct !DICompileUnit(language: DW_LANG_C99, file: !890, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !891, nameTableKind: None)
!890 = !DIFile(filename: "lib/fadvise.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!891 = !{!301}
!892 = distinct !DICompileUnit(language: DW_LANG_C99, file: !893, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !322, nameTableKind: None)
!893 = !DIFile(filename: "lib/open-safer.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!894 = distinct !DICompileUnit(language: DW_LANG_C99, file: !895, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !322, retainedTypes: !503, nameTableKind: None)
!895 = !DIFile(filename: "lib/file-set.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!896 = distinct !DICompileUnit(language: DW_LANG_C99, file: !897, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !322, nameTableKind: None)
!897 = !DIFile(filename: "lib/filemode.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!898 = distinct !DICompileUnit(language: DW_LANG_C99, file: !899, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !322, retainedTypes: !875, nameTableKind: None)
!899 = !DIFile(filename: "lib/filenamecat.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!900 = distinct !DICompileUnit(language: DW_LANG_C99, file: !901, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !322, retainedTypes: !875, nameTableKind: None)
!901 = !DIFile(filename: "lib/filenamecat-lgpl.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!902 = distinct !DICompileUnit(language: DW_LANG_C99, file: !903, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !322, retainedTypes: !904, nameTableKind: None)
!903 = !DIFile(filename: "lib/full-write.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!904 = !{!55, !239}
!905 = distinct !DICompileUnit(language: DW_LANG_C99, file: !906, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !322, nameTableKind: None)
!906 = !DIFile(filename: "lib/hash-triple.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!907 = distinct !DICompileUnit(language: DW_LANG_C99, file: !908, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !322, nameTableKind: None)
!908 = !DIFile(filename: "lib/opendirat.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!909 = distinct !DICompileUnit(language: DW_LANG_C99, file: !910, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !322, nameTableKind: None)
!910 = !DIFile(filename: "lib/qcopy-acl.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!911 = distinct !DICompileUnit(language: DW_LANG_C99, file: !912, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !322, nameTableKind: None)
!912 = !DIFile(filename: "lib/qset-acl.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!913 = distinct !DICompileUnit(language: DW_LANG_C99, file: !914, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !322, retainedTypes: !886, nameTableKind: None)
!914 = !DIFile(filename: "lib/renameatu.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!915 = distinct !DICompileUnit(language: DW_LANG_C99, file: !916, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !917, nameTableKind: None)
!916 = !DIFile(filename: "lib/safe-write.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!917 = !{!918}
!918 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !919, line: 40, baseType: !7, size: 32, elements: !920)
!919 = !DIFile(filename: "./lib/sys-limits.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!920 = !{!921}
!921 = !DIEnumerator(name: "SYS_BUFSIZE_MAX", value: 2146435072, isUnsigned: true)
!922 = distinct !DICompileUnit(language: DW_LANG_C99, file: !923, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !322, nameTableKind: None)
!923 = !DIFile(filename: "lib/same.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!924 = distinct !DICompileUnit(language: DW_LANG_C99, file: !925, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !322, nameTableKind: None)
!925 = !DIFile(filename: "lib/fd-safer.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!926 = distinct !DICompileUnit(language: DW_LANG_C99, file: !927, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !322, nameTableKind: None)
!927 = !DIFile(filename: "lib/verror.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!928 = distinct !DICompileUnit(language: DW_LANG_C99, file: !929, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !930, retainedTypes: !875, nameTableKind: None)
!929 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!930 = !{!931}
!931 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !929, line: 40, baseType: !7, size: 32, elements: !932)
!932 = !{!933}
!933 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!934 = distinct !DICompileUnit(language: DW_LANG_C99, file: !935, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !936, retainedTypes: !944, nameTableKind: None)
!935 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!936 = !{!937}
!937 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !938, file: !576, line: 186, baseType: !7, size: 32, elements: !586)
!938 = distinct !DISubprogram(name: "x2nrealloc", scope: !576, file: !576, line: 174, type: !578, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !934, retainedNodes: !939)
!939 = !{!940, !941, !942, !943}
!940 = !DILocalVariable(name: "p", arg: 1, scope: !938, file: !576, line: 174, type: !131)
!941 = !DILocalVariable(name: "pn", arg: 2, scope: !938, file: !576, line: 174, type: !580)
!942 = !DILocalVariable(name: "s", arg: 3, scope: !938, file: !576, line: 174, type: !239)
!943 = !DILocalVariable(name: "n", scope: !938, file: !576, line: 176, type: !239)
!944 = !{!239, !115, !131}
!945 = distinct !DICompileUnit(language: DW_LANG_C99, file: !946, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !322, nameTableKind: None)
!946 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!947 = distinct !DICompileUnit(language: DW_LANG_C99, file: !948, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !322, retainedTypes: !886, nameTableKind: None)
!948 = !DIFile(filename: "lib/xvasprintf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!949 = distinct !DICompileUnit(language: DW_LANG_C99, file: !950, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !322, nameTableKind: None)
!950 = !DIFile(filename: "lib/yesno.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!951 = distinct !DICompileUnit(language: DW_LANG_C99, file: !952, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !322, retainedTypes: !875, nameTableKind: None)
!952 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!953 = distinct !DICompileUnit(language: DW_LANG_C99, file: !954, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !322, retainedTypes: !875, nameTableKind: None)
!954 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!955 = distinct !DICompileUnit(language: DW_LANG_C99, file: !956, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !322, nameTableKind: None)
!956 = !DIFile(filename: "lib/freadahead.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!957 = distinct !DICompileUnit(language: DW_LANG_C99, file: !958, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !322, retainedTypes: !875, nameTableKind: None)
!958 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!959 = distinct !DICompileUnit(language: DW_LANG_C99, file: !960, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !322, retainedTypes: !961, nameTableKind: None)
!960 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!961 = !{!239}
!962 = distinct !DICompileUnit(language: DW_LANG_C99, file: !963, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !322, nameTableKind: None)
!963 = !DIFile(filename: "lib/acl-internal.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!964 = distinct !DICompileUnit(language: DW_LANG_C99, file: !965, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !322, retainedTypes: !875, nameTableKind: None)
!965 = !DIFile(filename: "lib/get-permissions.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!966 = distinct !DICompileUnit(language: DW_LANG_C99, file: !967, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !322, retainedTypes: !875, nameTableKind: None)
!967 = !DIFile(filename: "lib/set-permissions.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!968 = distinct !DICompileUnit(language: DW_LANG_C99, file: !969, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !322, nameTableKind: None)
!969 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!970 = distinct !DICompileUnit(language: DW_LANG_C99, file: !971, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !322, nameTableKind: None)
!971 = !DIFile(filename: "lib/opendir-safer.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!972 = distinct !DICompileUnit(language: DW_LANG_C99, file: !973, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !322, nameTableKind: None)
!973 = !DIFile(filename: "lib/gettime.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!974 = distinct !DICompileUnit(language: DW_LANG_C99, file: !975, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !322, nameTableKind: None)
!975 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!976 = distinct !DICompileUnit(language: DW_LANG_C99, file: !977, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !322, nameTableKind: None)
!977 = !DIFile(filename: "lib/hash-pjw.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!978 = distinct !DICompileUnit(language: DW_LANG_C99, file: !979, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !980, retainedTypes: !875, nameTableKind: None)
!979 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!980 = !{!981}
!981 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !982, line: 41, baseType: !7, size: 32, elements: !983)
!982 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
