source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.F_triple = type { i8*, i64, i64 }
%struct.Src_to_dest = type { i64, i64, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__acl_entry_ext = type opaque
%struct.__acl_ext = type opaque
%struct.__dirstream = type opaque
%struct.__mbstate_t = type { i32, %union.anon.47 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.cp_options = type { i32, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i32, i32, %struct.hash_table*, %struct.hash_table* }
%struct.dir_attr = type { %struct.stat, i8, i64, %struct.dir_attr* }
%struct.dir_list = type { %struct.dir_list*, i64, i64 }
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%struct.direntry_t = type { i8*, i64 }
%struct.error_context = type { void (%struct.error_context*, i8*, ...)*, i8* (%struct.error_context*, i8*)*, void (%struct.error_context*, i8*)* }
%struct.extent_info = type { i64, i64, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "long_opts", scope: !2, file: !3, line: 107, type: !269, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !128, globals: !130)
!3 = !DIFile(filename: "src/cp.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!4 = !{!5, !13, !20, !26, !32, !37, !51}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "backup_type", file: !6, line: 28, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/backupfile.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "no_backups", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "simple_backups", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "numbered_existing_backups", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "numbered_backups", value: 3, isUnsigned: true)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Dereference_symlink", file: !14, line: 69, baseType: !7, size: 32, elements: !15)
!14 = !DIFile(filename: "src/copy.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!15 = !{!16, !17, !18, !19}
!16 = !DIEnumerator(name: "DEREF_UNDEFINED", value: 1, isUnsigned: true)
!17 = !DIEnumerator(name: "DEREF_NEVER", value: 2, isUnsigned: true)
!18 = !DIEnumerator(name: "DEREF_COMMAND_LINE_ARGUMENTS", value: 3, isUnsigned: true)
!19 = !DIEnumerator(name: "DEREF_ALWAYS", value: 4, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Interactive", file: !14, line: 60, baseType: !7, size: 32, elements: !21)
!21 = !{!22, !23, !24, !25}
!22 = !DIEnumerator(name: "I_ALWAYS_YES", value: 1, isUnsigned: true)
!23 = !DIEnumerator(name: "I_ALWAYS_NO", value: 2, isUnsigned: true)
!24 = !DIEnumerator(name: "I_ASK_USER", value: 3, isUnsigned: true)
!25 = !DIEnumerator(name: "I_UNSPECIFIED", value: 4, isUnsigned: true)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Sparse_type", file: !14, line: 26, baseType: !7, size: 32, elements: !27)
!27 = !{!28, !29, !30, !31}
!28 = !DIEnumerator(name: "SPARSE_UNUSED", value: 0, isUnsigned: true)
!29 = !DIEnumerator(name: "SPARSE_NEVER", value: 1, isUnsigned: true)
!30 = !DIEnumerator(name: "SPARSE_AUTO", value: 2, isUnsigned: true)
!31 = !DIEnumerator(name: "SPARSE_ALWAYS", value: 3, isUnsigned: true)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Reflink_type", file: !14, line: 47, baseType: !7, size: 32, elements: !33)
!33 = !{!34, !35, !36}
!34 = !DIEnumerator(name: "REFLINK_NEVER", value: 0, isUnsigned: true)
!35 = !DIEnumerator(name: "REFLINK_AUTO", value: 1, isUnsigned: true)
!36 = !DIEnumerator(name: "REFLINK_ALWAYS", value: 2, isUnsigned: true)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !38, line: 32, baseType: !7, size: 32, elements: !39)
!38 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!39 = !{!40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50}
!40 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!41 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!42 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!43 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!44 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!45 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!46 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!47 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!48 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!49 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!50 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "File_attribute", scope: !52, file: !3, line: 839, baseType: !7, size: 32, elements: !120)
!52 = distinct !DISubprogram(name: "decode_preserve_arg", scope: !3, file: !3, line: 837, type: !53, isLocal: true, isDefinition: true, scopeLine: 838, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !110)
!53 = !DISubroutineType(types: !54)
!54 = !{null, !55, !58, !71}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!57 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cp_options", file: !14, line: 98, size: 640, elements: !60)
!60 = !{!61, !62, !63, !64, !65, !70, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !103, !104, !109}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "backup_type", scope: !59, file: !14, line: 100, baseType: !5, size: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "dereference", scope: !59, file: !14, line: 103, baseType: !13, size: 32, offset: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !59, file: !14, line: 108, baseType: !20, size: 32, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_mode", scope: !59, file: !14, line: 111, baseType: !26, size: 32, offset: 96)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !59, file: !14, line: 115, baseType: !66, size: 32, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !67, line: 69, baseType: !68)
!67 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !69, line: 148, baseType: !7)
!69 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!70 = !DIDerivedType(tag: DW_TAG_member, name: "copy_as_regular", scope: !59, file: !14, line: 119, baseType: !71, size: 8, offset: 160)
!71 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_before_opening", scope: !59, file: !14, line: 123, baseType: !71, size: 8, offset: 168)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_after_failed_open", scope: !59, file: !14, line: 130, baseType: !71, size: 8, offset: 176)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "hard_link", scope: !59, file: !14, line: 134, baseType: !71, size: 8, offset: 184)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "move_mode", scope: !59, file: !14, line: 138, baseType: !71, size: 8, offset: 192)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "install_mode", scope: !59, file: !14, line: 141, baseType: !71, size: 8, offset: 200)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "chown_privileges", scope: !59, file: !14, line: 145, baseType: !71, size: 8, offset: 208)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "owner_privileges", scope: !59, file: !14, line: 152, baseType: !71, size: 8, offset: 216)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "one_file_system", scope: !59, file: !14, line: 156, baseType: !71, size: 8, offset: 224)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_ownership", scope: !59, file: !14, line: 160, baseType: !71, size: 8, offset: 232)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_mode", scope: !59, file: !14, line: 161, baseType: !71, size: 8, offset: 240)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_timestamps", scope: !59, file: !14, line: 162, baseType: !71, size: 8, offset: 248)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "explicit_no_preserve_mode", scope: !59, file: !14, line: 163, baseType: !71, size: 8, offset: 256)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "set_security_context", scope: !59, file: !14, line: 166, baseType: !71, size: 8, offset: 264)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_links", scope: !59, file: !14, line: 178, baseType: !71, size: 8, offset: 272)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "data_copy_required", scope: !59, file: !14, line: 182, baseType: !71, size: 8, offset: 280)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve", scope: !59, file: !14, line: 188, baseType: !71, size: 8, offset: 288)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_security_context", scope: !59, file: !14, line: 192, baseType: !71, size: 8, offset: 296)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_context", scope: !59, file: !14, line: 201, baseType: !71, size: 8, offset: 304)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_xattr", scope: !59, file: !14, line: 205, baseType: !71, size: 8, offset: 312)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_xattr", scope: !59, file: !14, line: 214, baseType: !71, size: 8, offset: 320)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "reduce_diagnostics", scope: !59, file: !14, line: 223, baseType: !71, size: 8, offset: 328)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !59, file: !14, line: 227, baseType: !71, size: 8, offset: 336)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "set_mode", scope: !59, file: !14, line: 231, baseType: !71, size: 8, offset: 344)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "symbolic_link", scope: !59, file: !14, line: 235, baseType: !71, size: 8, offset: 352)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !59, file: !14, line: 239, baseType: !71, size: 8, offset: 360)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !59, file: !14, line: 242, baseType: !71, size: 8, offset: 368)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_tty", scope: !59, file: !14, line: 245, baseType: !71, size: 8, offset: 376)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "open_dangling_dest_symlink", scope: !59, file: !14, line: 250, baseType: !71, size: 8, offset: 384)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "last_file", scope: !59, file: !14, line: 254, baseType: !71, size: 8, offset: 392)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "rename_errno", scope: !59, file: !14, line: 259, baseType: !102, size: 32, offset: 416)
!102 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "reflink_mode", scope: !59, file: !14, line: 262, baseType: !32, size: 32, offset: 448)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "dest_info", scope: !59, file: !14, line: 273, baseType: !105, size: 64, offset: 512)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !107, line: 69, baseType: !108)
!107 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !107, line: 67, flags: DIFlagFwdDecl)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "src_info", scope: !59, file: !14, line: 276, baseType: !105, size: 64, offset: 576)
!110 = !{!111, !112, !113, !114, !116, !117, !119}
!111 = !DILocalVariable(name: "arg", arg: 1, scope: !52, file: !3, line: 837, type: !55)
!112 = !DILocalVariable(name: "x", arg: 2, scope: !52, file: !3, line: 837, type: !58)
!113 = !DILocalVariable(name: "on_off", arg: 3, scope: !52, file: !3, line: 837, type: !71)
!114 = !DILocalVariable(name: "arg_writable", scope: !52, file: !3, line: 863, type: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!116 = !DILocalVariable(name: "s", scope: !52, file: !3, line: 864, type: !115)
!117 = !DILocalVariable(name: "comma", scope: !118, file: !3, line: 868, type: !115)
!118 = distinct !DILexicalBlock(scope: !52, file: !3, line: 866, column: 5)
!119 = !DILocalVariable(name: "val", scope: !118, file: !3, line: 869, type: !51)
!120 = !{!121, !122, !123, !124, !125, !126, !127}
!121 = !DIEnumerator(name: "PRESERVE_MODE", value: 0, isUnsigned: true)
!122 = !DIEnumerator(name: "PRESERVE_TIMESTAMPS", value: 1, isUnsigned: true)
!123 = !DIEnumerator(name: "PRESERVE_OWNERSHIP", value: 2, isUnsigned: true)
!124 = !DIEnumerator(name: "PRESERVE_LINK", value: 3, isUnsigned: true)
!125 = !DIEnumerator(name: "PRESERVE_CONTEXT", value: 4, isUnsigned: true)
!126 = !DIEnumerator(name: "PRESERVE_XATTR", value: 5, isUnsigned: true)
!127 = !DIEnumerator(name: "PRESERVE_ALL", value: 6, isUnsigned: true)
!128 = !{!55, !129, !115}
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!130 = !{!131, !133, !0, !135, !141, !147, !151, !153, !159, !164, !166}
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "selinux_enabled", scope: !2, file: !3, line: 78, type: !71, isLocal: true, isDefinition: true)
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(name: "remove_trailing_slashes", scope: !2, file: !3, line: 85, type: !71, isLocal: true, isDefinition: true)
!135 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression())
!136 = distinct !DIGlobalVariable(name: "sparse_type", scope: !2, file: !3, line: 91, type: !137, isLocal: true, isDefinition: true)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 96, elements: !139)
!138 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!139 = !{!140}
!140 = !DISubrange(count: 3)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(name: "sparse_type_string", scope: !2, file: !3, line: 87, type: !143, isLocal: true, isDefinition: true)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 256, elements: !145)
!144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!145 = !{!146}
!146 = !DISubrange(count: 4)
!147 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression())
!148 = distinct !DIGlobalVariable(name: "reflink_type", scope: !2, file: !3, line: 101, type: !149, isLocal: true, isDefinition: true)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 96, elements: !139)
!150 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!151 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression())
!152 = distinct !DIGlobalVariable(name: "reflink_type_string", scope: !2, file: !3, line: 97, type: !143, isLocal: true, isDefinition: true)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "preserve_vals", scope: !52, file: !3, line: 849, type: !155, isLocal: true, isDefinition: true)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 224, elements: !157)
!156 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!157 = !{!158}
!158 = !DISubrange(count: 7)
!159 = !DIGlobalVariableExpression(var: !160, expr: !DIExpression())
!160 = distinct !DIGlobalVariable(name: "preserve_args", scope: !52, file: !3, line: 856, type: !161, isLocal: true, isDefinition: true)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 512, elements: !162)
!162 = !{!163}
!163 = !DISubrange(count: 8)
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(name: "parents_option", scope: !2, file: !3, line: 82, type: !71, isLocal: true, isDefinition: true)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "x_tmp", scope: !168, file: !3, line: 760, type: !59, isLocal: true, isDefinition: true)
!168 = distinct !DISubprogram(name: "do_copy", scope: !3, file: !3, line: 594, type: !169, isLocal: true, isDefinition: true, scopeLine: 596, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !172)
!169 = !DISubroutineType(types: !170)
!170 = !{!71, !102, !171, !55, !71, !58}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!172 = !{!173, !174, !175, !176, !177, !178, !215, !216, !217, !218, !222, !226, !229, !230, !240, !241, !242, !245, !248, !249, !250, !252, !255, !256, !257, !260, !264, !266, !267, !268}
!173 = !DILocalVariable(name: "n_files", arg: 1, scope: !168, file: !3, line: 594, type: !102)
!174 = !DILocalVariable(name: "file", arg: 2, scope: !168, file: !3, line: 594, type: !171)
!175 = !DILocalVariable(name: "target_directory", arg: 3, scope: !168, file: !3, line: 594, type: !55)
!176 = !DILocalVariable(name: "no_target_directory", arg: 4, scope: !168, file: !3, line: 595, type: !71)
!177 = !DILocalVariable(name: "x", arg: 5, scope: !168, file: !3, line: 595, type: !58)
!178 = !DILocalVariable(name: "sb", scope: !168, file: !3, line: 597, type: !179)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !180, line: 46, size: 1152, elements: !181)
!180 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!181 = !{!182, !185, !187, !189, !190, !192, !194, !195, !196, !199, !201, !203, !211, !212, !213}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !179, file: !180, line: 48, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !69, line: 143, baseType: !184)
!184 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !179, file: !180, line: 53, baseType: !186, size: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !69, line: 146, baseType: !184)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !179, file: !180, line: 61, baseType: !188, size: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !69, line: 149, baseType: !184)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !179, file: !180, line: 62, baseType: !68, size: 32, offset: 192)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !179, file: !180, line: 64, baseType: !191, size: 32, offset: 224)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !69, line: 144, baseType: !7)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !179, file: !180, line: 65, baseType: !193, size: 32, offset: 256)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !69, line: 145, baseType: !7)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !179, file: !180, line: 67, baseType: !102, size: 32, offset: 288)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !179, file: !180, line: 69, baseType: !183, size: 64, offset: 320)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !179, file: !180, line: 74, baseType: !197, size: 64, offset: 384)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !69, line: 150, baseType: !198)
!198 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !179, file: !180, line: 78, baseType: !200, size: 64, offset: 448)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !69, line: 172, baseType: !198)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !179, file: !180, line: 80, baseType: !202, size: 64, offset: 512)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !69, line: 177, baseType: !198)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !179, file: !180, line: 91, baseType: !204, size: 128, offset: 576)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !205, line: 9, size: 128, elements: !206)
!205 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!206 = !{!207, !209}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !204, file: !205, line: 11, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !69, line: 158, baseType: !198)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !204, file: !205, line: 12, baseType: !210, size: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !69, line: 194, baseType: !198)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !179, file: !180, line: 92, baseType: !204, size: 128, offset: 704)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !179, file: !180, line: 93, baseType: !204, size: 128, offset: 832)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !179, file: !180, line: 106, baseType: !214, size: 192, offset: 960)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 192, elements: !139)
!215 = !DILocalVariable(name: "new_dst", scope: !168, file: !3, line: 598, type: !71)
!216 = !DILocalVariable(name: "ok", scope: !168, file: !3, line: 599, type: !71)
!217 = !DILocalVariable(name: "forcing", scope: !168, file: !3, line: 600, type: !71)
!218 = !DILocalVariable(name: "__x", scope: !219, file: !3, line: 625, type: !71)
!219 = distinct !DILexicalBlock(scope: !220, file: !3, line: 625, column: 7)
!220 = distinct !DILexicalBlock(scope: !221, file: !3, line: 614, column: 5)
!221 = distinct !DILexicalBlock(scope: !168, file: !3, line: 613, column: 7)
!222 = !DILocalVariable(name: "i", scope: !223, file: !3, line: 654, type: !102)
!223 = distinct !DILexicalBlock(scope: !224, file: !3, line: 654, column: 7)
!224 = distinct !DILexicalBlock(scope: !225, file: !3, line: 640, column: 5)
!225 = distinct !DILexicalBlock(scope: !168, file: !3, line: 639, column: 7)
!226 = !DILocalVariable(name: "dst_name", scope: !227, file: !3, line: 656, type: !115)
!227 = distinct !DILexicalBlock(scope: !228, file: !3, line: 655, column: 9)
!228 = distinct !DILexicalBlock(scope: !223, file: !3, line: 654, column: 7)
!229 = !DILocalVariable(name: "parent_exists", scope: !227, file: !3, line: 657, type: !71)
!230 = !DILocalVariable(name: "attr_list", scope: !227, file: !3, line: 658, type: !231)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dir_attr", file: !3, line: 54, size: 1344, elements: !233)
!233 = !{!234, !235, !236, !239}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "st", scope: !232, file: !3, line: 56, baseType: !179, size: 1152)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !232, file: !3, line: 57, baseType: !71, size: 8, offset: 1152)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "slash_offset", scope: !232, file: !3, line: 58, baseType: !237, size: 64, offset: 1216)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !238, line: 62, baseType: !184)
!238 = !DIFile(filename: "/usr/lib/clang/7.0.0/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!239 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !232, file: !3, line: 59, baseType: !231, size: 64, offset: 1280)
!240 = !DILocalVariable(name: "arg_in_concat", scope: !227, file: !3, line: 659, type: !115)
!241 = !DILocalVariable(name: "arg", scope: !227, file: !3, line: 660, type: !115)
!242 = !DILocalVariable(name: "arg_no_trailing_slash", scope: !243, file: !3, line: 669, type: !115)
!243 = distinct !DILexicalBlock(scope: !244, file: !3, line: 668, column: 13)
!244 = distinct !DILexicalBlock(scope: !227, file: !3, line: 667, column: 15)
!245 = !DILocalVariable(name: "__old", scope: !246, file: !3, line: 676, type: !55)
!246 = distinct !DILexicalBlock(scope: !247, file: !3, line: 676, column: 15)
!247 = distinct !DILexicalBlock(scope: !243, file: !3, line: 676, column: 15)
!248 = !DILocalVariable(name: "__len", scope: !246, file: !3, line: 676, type: !237)
!249 = !DILocalVariable(name: "__new", scope: !246, file: !3, line: 676, type: !115)
!250 = !DILocalVariable(name: "arg_base", scope: !251, file: !3, line: 695, type: !115)
!251 = distinct !DILexicalBlock(scope: !244, file: !3, line: 694, column: 13)
!252 = !DILocalVariable(name: "__old", scope: !253, file: !3, line: 697, type: !55)
!253 = distinct !DILexicalBlock(scope: !254, file: !3, line: 697, column: 15)
!254 = distinct !DILexicalBlock(scope: !251, file: !3, line: 697, column: 15)
!255 = !DILocalVariable(name: "__len", scope: !253, file: !3, line: 697, type: !237)
!256 = !DILocalVariable(name: "__new", scope: !253, file: !3, line: 697, type: !115)
!257 = !DILocalVariable(name: "copy_into_self", scope: !258, file: !3, line: 714, type: !71)
!258 = distinct !DILexicalBlock(scope: !259, file: !3, line: 713, column: 13)
!259 = distinct !DILexicalBlock(scope: !227, file: !3, line: 706, column: 15)
!260 = !DILocalVariable(name: "p", scope: !261, file: !3, line: 726, type: !231)
!261 = distinct !DILexicalBlock(scope: !262, file: !3, line: 725, column: 17)
!262 = distinct !DILexicalBlock(scope: !263, file: !3, line: 723, column: 13)
!263 = distinct !DILexicalBlock(scope: !227, file: !3, line: 722, column: 15)
!264 = !DILocalVariable(name: "new_dest", scope: !265, file: !3, line: 737, type: !55)
!265 = distinct !DILexicalBlock(scope: !225, file: !3, line: 736, column: 5)
!266 = !DILocalVariable(name: "source", scope: !265, file: !3, line: 738, type: !55)
!267 = !DILocalVariable(name: "dest", scope: !265, file: !3, line: 739, type: !55)
!268 = !DILocalVariable(name: "unused", scope: !265, file: !3, line: 740, type: !71)
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !270, size: 7680, elements: !279)
!270 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !271)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !272, line: 50, size: 256, elements: !273)
!272 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!273 = !{!274, !275, !276, !278}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !271, file: !272, line: 52, baseType: !55, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !271, file: !272, line: 55, baseType: !102, size: 32, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !271, file: !272, line: 56, baseType: !277, size: 64, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !271, file: !272, line: 57, baseType: !102, size: 32, offset: 192)
!279 = !{!280}
!280 = !DISubrange(count: 30)
!281 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!282 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(name: "top_level_src_name", scope: !285, file: !286, line: 147, type: !55, isLocal: true, isDefinition: true)
!285 = distinct !DICompileUnit(language: DW_LANG_C99, file: !286, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !287, retainedTypes: !312, globals: !316)
!286 = !DIFile(filename: "src/copy.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!287 = !{!5, !13, !20, !26, !32, !37, !288, !292, !299, !308}
!288 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !289, line: 27, baseType: !7, size: 32, elements: !290)
!289 = !DIFile(filename: "./lib/utimecmp.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!290 = !{!291}
!291 = !DIEnumerator(name: "UTIMECMP_TRUNCATE_SOURCE", value: 1, isUnsigned: true)
!292 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "savedir_option", file: !293, line: 26, baseType: !7, size: 32, elements: !294)
!293 = !DIFile(filename: "./lib/savedir.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!294 = !{!295, !296, !297, !298}
!295 = !DIEnumerator(name: "SAVEDIR_SORT_NONE", value: 0, isUnsigned: true)
!296 = !DIEnumerator(name: "SAVEDIR_SORT_NAME", value: 1, isUnsigned: true)
!297 = !DIEnumerator(name: "SAVEDIR_SORT_INODE", value: 2, isUnsigned: true)
!298 = !DIEnumerator(name: "SAVEDIR_SORT_FASTREAD", value: 2, isUnsigned: true)
!299 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !300, line: 45, baseType: !7, size: 32, elements: !301)
!300 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!301 = !{!302, !303, !304, !305, !306, !307}
!302 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0, isUnsigned: true)
!303 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2, isUnsigned: true)
!304 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5, isUnsigned: true)
!305 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4, isUnsigned: true)
!306 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3, isUnsigned: true)
!307 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1, isUnsigned: true)
!308 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !309, line: 73, baseType: !7, size: 32, elements: !310)
!309 = !DIFile(filename: "src/ioblksize.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!310 = !{!311}
!311 = !DIEnumerator(name: "IO_BUFSIZE", value: 131072, isUnsigned: true)
!312 = !{!66, !129, !7, !115, !184, !313, !237, !314}
!313 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !315, line: 63, baseType: !197)
!315 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!316 = !{!317, !283, !323, !325, !335, !337}
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(name: "mask", scope: !319, file: !286, line: 3050, type: !66, isLocal: true, isDefinition: true)
!319 = distinct !DISubprogram(name: "cached_umask", scope: !286, file: !286, line: 3048, type: !320, isDefinition: true, scopeLine: 3049, flags: DIFlagPrototyped, isOptimized: true, unit: !285, retainedNodes: !322)
!320 = !DISubroutineType(types: !321)
!321 = !{!66}
!322 = !{}
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(name: "top_level_dst_name", scope: !285, file: !286, line: 148, type: !55, isLocal: true, isDefinition: true)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "zeros", scope: !327, file: !286, line: 351, type: !115, isLocal: true, isDefinition: true)
!327 = distinct !DISubprogram(name: "write_zeros", scope: !286, file: !286, line: 349, type: !328, isLocal: true, isDefinition: true, scopeLine: 350, flags: DIFlagPrototyped, isOptimized: true, unit: !285, retainedNodes: !330)
!328 = !DISubroutineType(types: !329)
!329 = !{!71, !102, !314}
!330 = !{!331, !332, !333}
!331 = !DILocalVariable(name: "fd", arg: 1, scope: !327, file: !286, line: 349, type: !102)
!332 = !DILocalVariable(name: "n_bytes", arg: 2, scope: !327, file: !286, line: 349, type: !314)
!333 = !DILocalVariable(name: "n", scope: !334, file: !286, line: 370, type: !237)
!334 = distinct !DILexicalBlock(scope: !327, file: !286, line: 369, column: 5)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(name: "nz", scope: !327, file: !286, line: 352, type: !237, isLocal: true, isDefinition: true)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(name: "fallback", scope: !327, file: !286, line: 359, type: !339, isLocal: true, isDefinition: true)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 8192, elements: !340)
!340 = !{!341}
!341 = !DISubrange(count: 1024)
!342 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 18446744073709421568, DW_OP_mul, DW_OP_constu, 131072, DW_OP_plus, DW_OP_stack_value))
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "src_to_dest", scope: !345, file: !346, line: 45, type: !105, isLocal: true, isDefinition: true)
!345 = distinct !DICompileUnit(language: DW_LANG_C99, file: !346, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !322, retainedTypes: !347, globals: !351)
!346 = !DIFile(filename: "src/cp-hash.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!347 = !{!129, !115, !348}
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !349, line: 102, baseType: !350)
!349 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !69, line: 72, baseType: !184)
!351 = !{!343}
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "simple_pattern", scope: !354, file: !355, line: 38, type: !364, isLocal: true, isDefinition: true)
!354 = distinct !DICompileUnit(language: DW_LANG_C99, file: !355, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !356, globals: !363)
!355 = !DIFile(filename: "src/force-link.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!356 = !{!357, !360}
!357 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !355, line: 39, baseType: !7, size: 32, elements: !358)
!358 = !{!359}
!359 = !DIEnumerator(name: "x_suffix_len", value: 6, isUnsigned: true)
!360 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !355, line: 44, baseType: !7, size: 32, elements: !361)
!361 = !{!362}
!362 = !DIEnumerator(name: "smallsize", value: 256, isUnsigned: true)
!363 = !{!352}
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 72, elements: !365)
!365 = !{!366}
!366 = !DISubrange(count: 9)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "Version", scope: !369, file: !370, line: 2, type: !55, isDefinition: true)
!369 = distinct !DICompileUnit(language: DW_LANG_C99, file: !370, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !322, globals: !371)
!370 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!371 = !{!367}
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !374, file: !379, line: 69, type: !380, isDefinition: true)
!374 = distinct !DICompileUnit(language: DW_LANG_C99, file: !375, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !376, retainedTypes: !377, globals: !378)
!375 = !DIFile(filename: "./lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!376 = !{!37}
!377 = !{!129, !313}
!378 = !{!372}
!379 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !381, line: 55, baseType: !382)
!381 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{null}
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "simple_backup_suffix", scope: !387, file: !391, line: 79, type: !55, isDefinition: true)
!387 = distinct !DICompileUnit(language: DW_LANG_C99, file: !388, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !389, retainedTypes: !449, globals: !450)
!388 = !DIFile(filename: "./lib/backupfile.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!389 = !{!5, !390, !419, !425}
!390 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !392, file: !391, line: 304, baseType: !7, size: 32, elements: !417)
!391 = !DIFile(filename: "lib/backupfile.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!392 = distinct !DISubprogram(name: "backupfile_internal", scope: !391, file: !391, line: 292, type: !393, isDefinition: true, scopeLine: 293, flags: DIFlagPrototyped, isOptimized: true, unit: !387, retainedNodes: !395)
!393 = !DISubroutineType(types: !394)
!394 = !{!115, !55, !5, !71}
!395 = !{!396, !397, !398, !399, !401, !402, !403, !404, !407, !408, !413, !415, !416}
!396 = !DILocalVariable(name: "file", arg: 1, scope: !392, file: !391, line: 292, type: !55)
!397 = !DILocalVariable(name: "backup_type", arg: 2, scope: !392, file: !391, line: 292, type: !5)
!398 = !DILocalVariable(name: "rename", arg: 3, scope: !392, file: !391, line: 292, type: !71)
!399 = !DILocalVariable(name: "base_offset", scope: !392, file: !391, line: 294, type: !400)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !238, line: 51, baseType: !198)
!401 = !DILocalVariable(name: "filelen", scope: !392, file: !391, line: 295, type: !237)
!402 = !DILocalVariable(name: "simple_backup_suffix_size", scope: !392, file: !391, line: 302, type: !237)
!403 = !DILocalVariable(name: "backup_suffix_size_guess", scope: !392, file: !391, line: 303, type: !237)
!404 = !DILocalVariable(name: "ssize", scope: !392, file: !391, line: 308, type: !405)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !67, line: 108, baseType: !406)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !69, line: 191, baseType: !198)
!407 = !DILocalVariable(name: "s", scope: !392, file: !391, line: 309, type: !115)
!408 = !DILocalVariable(name: "dirp", scope: !392, file: !391, line: 313, type: !409)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !411, line: 127, baseType: !412)
!411 = !DIFile(filename: "/usr/include/dirent.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !411, line: 127, flags: DIFlagFwdDecl)
!413 = !DILocalVariable(name: "sdir", scope: !414, file: !391, line: 349, type: !102)
!414 = distinct !DILexicalBlock(scope: !392, file: !391, line: 315, column: 5)
!415 = !DILocalVariable(name: "flags", scope: !414, file: !391, line: 355, type: !7)
!416 = !DILocalVariable(name: "e", scope: !414, file: !391, line: 358, type: !102)
!417 = !{!418}
!418 = !DIEnumerator(name: "GUESS", value: 9, isUnsigned: true)
!419 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "numbered_backup_result", file: !391, line: 152, baseType: !7, size: 32, elements: !420)
!420 = !{!421, !422, !423, !424}
!421 = !DIEnumerator(name: "BACKUP_IS_SAME_LENGTH", value: 0, isUnsigned: true)
!422 = !DIEnumerator(name: "BACKUP_IS_LONGER", value: 1, isUnsigned: true)
!423 = !DIEnumerator(name: "BACKUP_IS_NEW", value: 2, isUnsigned: true)
!424 = !DIEnumerator(name: "BACKUP_NOMEM", value: 3, isUnsigned: true)
!425 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !426, line: 24, baseType: !7, size: 32, elements: !427)
!426 = !DIFile(filename: "/usr/include/bits/confname.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!427 = !{!428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448}
!428 = !DIEnumerator(name: "_PC_LINK_MAX", value: 0, isUnsigned: true)
!429 = !DIEnumerator(name: "_PC_MAX_CANON", value: 1, isUnsigned: true)
!430 = !DIEnumerator(name: "_PC_MAX_INPUT", value: 2, isUnsigned: true)
!431 = !DIEnumerator(name: "_PC_NAME_MAX", value: 3, isUnsigned: true)
!432 = !DIEnumerator(name: "_PC_PATH_MAX", value: 4, isUnsigned: true)
!433 = !DIEnumerator(name: "_PC_PIPE_BUF", value: 5, isUnsigned: true)
!434 = !DIEnumerator(name: "_PC_CHOWN_RESTRICTED", value: 6, isUnsigned: true)
!435 = !DIEnumerator(name: "_PC_NO_TRUNC", value: 7, isUnsigned: true)
!436 = !DIEnumerator(name: "_PC_VDISABLE", value: 8, isUnsigned: true)
!437 = !DIEnumerator(name: "_PC_SYNC_IO", value: 9, isUnsigned: true)
!438 = !DIEnumerator(name: "_PC_ASYNC_IO", value: 10, isUnsigned: true)
!439 = !DIEnumerator(name: "_PC_PRIO_IO", value: 11, isUnsigned: true)
!440 = !DIEnumerator(name: "_PC_SOCK_MAXBUF", value: 12, isUnsigned: true)
!441 = !DIEnumerator(name: "_PC_FILESIZEBITS", value: 13, isUnsigned: true)
!442 = !DIEnumerator(name: "_PC_REC_INCR_XFER_SIZE", value: 14, isUnsigned: true)
!443 = !DIEnumerator(name: "_PC_REC_MAX_XFER_SIZE", value: 15, isUnsigned: true)
!444 = !DIEnumerator(name: "_PC_REC_MIN_XFER_SIZE", value: 16, isUnsigned: true)
!445 = !DIEnumerator(name: "_PC_REC_XFER_ALIGN", value: 17, isUnsigned: true)
!446 = !DIEnumerator(name: "_PC_ALLOC_SIZE_MIN", value: 18, isUnsigned: true)
!447 = !DIEnumerator(name: "_PC_SYMLINK_MAX", value: 19, isUnsigned: true)
!448 = !DIEnumerator(name: "_PC_2_SYMLINKS", value: 20, isUnsigned: true)
!449 = !{!129, !7, !237}
!450 = !{!385}
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(name: "backup_args", scope: !453, file: !460, line: 40, type: !463, isLocal: true, isDefinition: true)
!453 = distinct !DICompileUnit(language: DW_LANG_C99, file: !454, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !455, retainedTypes: !456, globals: !457)
!454 = !DIFile(filename: "./lib/backup-find.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!455 = !{!5}
!456 = !{!55}
!457 = !{!458, !451}
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(name: "backup_types", scope: !453, file: !460, line: 51, type: !461, isLocal: true, isDefinition: true)
!460 = !DIFile(filename: "lib/backup-find.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!461 = !DICompositeType(tag: DW_TAG_array_type, baseType: !462, size: 256, elements: !162)
!462 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 576, elements: !365)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(name: "file_name", scope: !466, file: !469, line: 37, type: !55, isLocal: true, isDefinition: true)
!466 = distinct !DICompileUnit(language: DW_LANG_C99, file: !467, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !322, globals: !468)
!467 = !DIFile(filename: "./lib/closein.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!468 = !{!464}
!469 = !DIFile(filename: "lib/closein.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(name: "file_name", scope: !472, file: !477, line: 46, type: !55, isLocal: true, isDefinition: true)
!472 = distinct !DICompileUnit(language: DW_LANG_C99, file: !473, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !322, globals: !474)
!473 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!474 = !{!470, !475}
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !472, file: !477, line: 56, type: !71, isLocal: true, isDefinition: true)
!477 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(name: "exit_failure", scope: !480, file: !483, line: 24, type: !484, isDefinition: true)
!480 = distinct !DICompileUnit(language: DW_LANG_C99, file: !481, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !322, globals: !482)
!481 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!482 = !{!478}
!483 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!484 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !102)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(name: "default_tuning", scope: !487, file: !491, line: 130, type: !492, isLocal: true, isDefinition: true)
!487 = distinct !DICompileUnit(language: DW_LANG_C99, file: !488, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !322, retainedTypes: !489, globals: !490)
!488 = !DIFile(filename: "./lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!489 = !{!184, !129, !237}
!490 = !{!485}
!491 = !DIFile(filename: "lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!492 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !493)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !107, line: 65, baseType: !494)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !107, line: 53, size: 160, elements: !495)
!495 = !{!496, !498, !499, !500, !501}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !494, file: !107, line: 58, baseType: !497, size: 32)
!497 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !494, file: !107, line: 59, baseType: !497, size: 32, offset: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !494, file: !107, line: 60, baseType: !497, size: 32, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !494, file: !107, line: 61, baseType: !497, size: 32, offset: 96)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !494, file: !107, line: 62, baseType: !71, size: 8, offset: 128)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(name: "program_name", scope: !504, file: !508, line: 33, type: !55, isDefinition: true)
!504 = distinct !DICompileUnit(language: DW_LANG_C99, file: !505, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !322, retainedTypes: !506, globals: !507)
!505 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!506 = !{!129, !115}
!507 = !{!502}
!508 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !511, file: !539, line: 85, type: !572, isDefinition: true)
!511 = distinct !DICompileUnit(language: DW_LANG_C99, file: !512, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !513, retainedTypes: !534, globals: !536)
!512 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!513 = !{!37, !514, !519}
!514 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !38, line: 242, baseType: !7, size: 32, elements: !515)
!515 = !{!516, !517, !518}
!516 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!517 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!518 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!519 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !520, line: 46, baseType: !7, size: 32, elements: !521)
!520 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!521 = !{!522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533}
!522 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!523 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!524 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!525 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!526 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!527 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!528 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!529 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!530 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!531 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!532 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!533 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!534 = !{!102, !535, !237, !115}
!535 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!536 = !{!509, !537, !544, !554, !556, !561, !568, !570}
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !511, file: !539, line: 101, type: !540, isDefinition: true)
!539 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !541, size: 320, elements: !542)
!541 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!542 = !{!543}
!543 = !DISubrange(count: 10)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !511, file: !539, line: 1052, type: !546, isDefinition: true)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !539, line: 65, size: 448, elements: !547)
!547 = !{!548, !549, !550, !552, !553}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !546, file: !539, line: 68, baseType: !37, size: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !546, file: !539, line: 71, baseType: !102, size: 32, offset: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !546, file: !539, line: 75, baseType: !551, size: 256, offset: 64)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !162)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !546, file: !539, line: 78, baseType: !55, size: 64, offset: 320)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !546, file: !539, line: 81, baseType: !55, size: 64, offset: 384)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !511, file: !539, line: 116, type: !546, isLocal: true, isDefinition: true)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(name: "slot0", scope: !511, file: !539, line: 842, type: !558, isLocal: true, isDefinition: true)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 2048, elements: !559)
!559 = !{!560}
!560 = !DISubrange(count: 256)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(name: "slotvec", scope: !511, file: !539, line: 845, type: !563, isLocal: true, isDefinition: true)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !539, line: 834, size: 128, elements: !565)
!565 = !{!566, !567}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !564, file: !539, line: 836, baseType: !237, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !564, file: !539, line: 837, baseType: !115, size: 64, offset: 64)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(name: "nslots", scope: !511, file: !539, line: 843, type: !102, isLocal: true, isDefinition: true)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(name: "slotvec0", scope: !511, file: !539, line: 844, type: !564, isLocal: true, isDefinition: true)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 704, elements: !573)
!573 = !{!574}
!574 = !DISubrange(count: 11)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(name: "comparison_function_table", scope: !577, file: !595, line: 74, type: !596, isLocal: true, isDefinition: true)
!577 = distinct !DICompileUnit(language: DW_LANG_C99, file: !578, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !579, retainedTypes: !593, globals: !594)
!578 = !DIFile(filename: "./lib/savedir.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!579 = !{!292, !580}
!580 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !582, file: !581, line: 186, baseType: !7, size: 32, elements: !591)
!581 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!582 = distinct !DISubprogram(name: "x2nrealloc", scope: !581, file: !581, line: 174, type: !583, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: true, unit: !577, retainedNodes: !586)
!583 = !DISubroutineType(types: !584)
!584 = !{!129, !129, !585, !237}
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!586 = !{!587, !588, !589, !590}
!587 = !DILocalVariable(name: "p", arg: 1, scope: !582, file: !581, line: 174, type: !129)
!588 = !DILocalVariable(name: "pn", arg: 2, scope: !582, file: !581, line: 174, type: !585)
!589 = !DILocalVariable(name: "s", arg: 3, scope: !582, file: !581, line: 174, type: !237)
!590 = !DILocalVariable(name: "n", scope: !582, file: !581, line: 176, type: !237)
!591 = !{!592}
!592 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!593 = !{!129, !237}
!594 = !{!575}
!595 = !DIFile(filename: "lib/savedir.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !597, size: 192, elements: !139)
!597 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !598)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "comparison_function", file: !595, line: 72, baseType: !599)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DISubroutineType(types: !601)
!601 = !{!102, !602, !602}
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(name: "letters", scope: !606, file: !609, line: 184, type: !610, isLocal: true, isDefinition: true)
!606 = distinct !DICompileUnit(language: DW_LANG_C99, file: !607, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !322, globals: !608)
!607 = !DIFile(filename: "./lib/tempname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!608 = !{!604}
!609 = !DIFile(filename: "lib/tempname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 504, elements: !611)
!611 = !{!612}
!612 = !DISubrange(count: 63)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(name: "ht", scope: !615, file: !616, line: 163, type: !105, isLocal: true, isDefinition: true)
!615 = distinct !DISubprogram(name: "utimecmpat", scope: !616, file: !616, line: 132, type: !617, isDefinition: true, scopeLine: 136, flags: DIFlagPrototyped, isOptimized: true, unit: !642, retainedNodes: !658)
!616 = !DIFile(filename: "lib/utimecmp.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!617 = !DISubroutineType(types: !618)
!618 = !{!102, !102, !55, !619, !619, !102}
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !621)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !180, line: 46, size: 1152, elements: !622)
!622 = !{!623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !639, !640, !641}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !621, file: !180, line: 48, baseType: !183, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !621, file: !180, line: 53, baseType: !186, size: 64, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !621, file: !180, line: 61, baseType: !188, size: 64, offset: 128)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !621, file: !180, line: 62, baseType: !68, size: 32, offset: 192)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !621, file: !180, line: 64, baseType: !191, size: 32, offset: 224)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !621, file: !180, line: 65, baseType: !193, size: 32, offset: 256)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !621, file: !180, line: 67, baseType: !102, size: 32, offset: 288)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !621, file: !180, line: 69, baseType: !183, size: 64, offset: 320)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !621, file: !180, line: 74, baseType: !197, size: 64, offset: 384)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !621, file: !180, line: 78, baseType: !200, size: 64, offset: 448)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !621, file: !180, line: 80, baseType: !202, size: 64, offset: 512)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !621, file: !180, line: 91, baseType: !635, size: 128, offset: 576)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !205, line: 9, size: 128, elements: !636)
!636 = !{!637, !638}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !635, file: !205, line: 11, baseType: !208, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !635, file: !205, line: 12, baseType: !210, size: 64, offset: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !621, file: !180, line: 92, baseType: !635, size: 128, offset: 704)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !621, file: !180, line: 93, baseType: !635, size: 128, offset: 832)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !621, file: !180, line: 106, baseType: !214, size: 192, offset: 960)
!642 = distinct !DICompileUnit(language: DW_LANG_C99, file: !643, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !644, globals: !648)
!643 = !DIFile(filename: "./lib/utimecmp.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!644 = !{!288, !645}
!645 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !616, line: 49, baseType: !7, size: 32, elements: !646)
!646 = !{!647}
!647 = !DIEnumerator(name: "SYSCALL_RESOLUTION", value: 1, isUnsigned: true)
!648 = !{!613, !649}
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(name: "new_dst_res", scope: !615, file: !616, line: 166, type: !651, isLocal: true, isDefinition: true)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fs_res", file: !616, line: 66, size: 128, elements: !653)
!653 = !{!654, !656, !657}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !652, file: !616, line: 69, baseType: !655, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !67, line: 59, baseType: !183)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "resolution", scope: !652, file: !616, line: 76, baseType: !102, size: 32, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "exact", scope: !652, file: !616, line: 80, baseType: !71, size: 8, offset: 96)
!658 = !{!659, !660, !661, !662, !663, !664, !667, !668, !669, !670, !673, !674, !675, !678, !679, !680, !681, !682, !683, !685, !688, !689, !690, !691, !697, !698, !700, !702, !704}
!659 = !DILocalVariable(name: "dfd", arg: 1, scope: !615, file: !616, line: 132, type: !102)
!660 = !DILocalVariable(name: "dst_name", arg: 2, scope: !615, file: !616, line: 132, type: !55)
!661 = !DILocalVariable(name: "dst_stat", arg: 3, scope: !615, file: !616, line: 133, type: !619)
!662 = !DILocalVariable(name: "src_stat", arg: 4, scope: !615, file: !616, line: 134, type: !619)
!663 = !DILocalVariable(name: "options", arg: 5, scope: !615, file: !616, line: 135, type: !102)
!664 = !DILocalVariable(name: "dst_s", scope: !615, file: !616, line: 153, type: !665)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !666, line: 7, baseType: !208)
!666 = !DIFile(filename: "/usr/include/bits/types/time_t.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!667 = !DILocalVariable(name: "src_s", scope: !615, file: !616, line: 154, type: !665)
!668 = !DILocalVariable(name: "dst_ns", scope: !615, file: !616, line: 155, type: !102)
!669 = !DILocalVariable(name: "src_ns", scope: !615, file: !616, line: 156, type: !102)
!670 = !DILocalVariable(name: "dst_res", scope: !671, file: !616, line: 167, type: !651)
!671 = distinct !DILexicalBlock(scope: !672, file: !616, line: 159, column: 5)
!672 = distinct !DILexicalBlock(scope: !615, file: !616, line: 158, column: 7)
!673 = !DILocalVariable(name: "tmp_dst_res", scope: !671, file: !616, line: 168, type: !652)
!674 = !DILocalVariable(name: "res", scope: !671, file: !616, line: 171, type: !102)
!675 = !DILocalVariable(name: "dst_a_s", scope: !676, file: !616, line: 262, type: !665)
!676 = distinct !DILexicalBlock(scope: !677, file: !616, line: 258, column: 9)
!677 = distinct !DILexicalBlock(scope: !671, file: !616, line: 257, column: 11)
!678 = !DILocalVariable(name: "dst_c_s", scope: !676, file: !616, line: 263, type: !665)
!679 = !DILocalVariable(name: "dst_m_s", scope: !676, file: !616, line: 264, type: !665)
!680 = !DILocalVariable(name: "dst_a_ns", scope: !676, file: !616, line: 265, type: !102)
!681 = !DILocalVariable(name: "dst_c_ns", scope: !676, file: !616, line: 266, type: !102)
!682 = !DILocalVariable(name: "dst_m_ns", scope: !676, file: !616, line: 267, type: !102)
!683 = !DILocalVariable(name: "odd_second", scope: !684, file: !616, line: 276, type: !71)
!684 = distinct !DILexicalBlock(scope: !676, file: !616, line: 275, column: 11)
!685 = !DILocalVariable(name: "a", scope: !686, file: !616, line: 285, type: !102)
!686 = distinct !DILexicalBlock(scope: !687, file: !616, line: 284, column: 15)
!687 = distinct !DILexicalBlock(scope: !684, file: !616, line: 278, column: 17)
!688 = !DILocalVariable(name: "c", scope: !686, file: !616, line: 286, type: !102)
!689 = !DILocalVariable(name: "m", scope: !686, file: !616, line: 287, type: !102)
!690 = !DILocalVariable(name: "SR10", scope: !686, file: !616, line: 291, type: !102)
!691 = !DILocalVariable(name: "timespec", scope: !692, file: !616, line: 313, type: !694)
!692 = distinct !DILexicalBlock(scope: !693, file: !616, line: 312, column: 13)
!693 = distinct !DILexicalBlock(scope: !676, file: !616, line: 311, column: 15)
!694 = !DICompositeType(tag: DW_TAG_array_type, baseType: !635, size: 256, elements: !695)
!695 = !{!696}
!696 = !DISubrange(count: 2)
!697 = !DILocalVariable(name: "dst_status", scope: !692, file: !616, line: 314, type: !621)
!698 = !DILocalVariable(name: "s", scope: !699, file: !616, line: 324, type: !665)
!699 = distinct !DILexicalBlock(scope: !692, file: !616, line: 323, column: 15)
!700 = !DILocalVariable(name: "stat_result", scope: !701, file: !616, line: 348, type: !102)
!701 = distinct !DILexicalBlock(scope: !692, file: !616, line: 347, column: 15)
!702 = !DILocalVariable(name: "old_res", scope: !703, file: !616, line: 369, type: !102)
!703 = distinct !DILexicalBlock(scope: !692, file: !616, line: 368, column: 15)
!704 = !DILocalVariable(name: "a", scope: !703, file: !616, line: 370, type: !102)
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(name: "utimensat_works_really", scope: !707, file: !717, line: 75, type: !102, isLocal: true, isDefinition: true)
!707 = distinct !DICompileUnit(language: DW_LANG_C99, file: !708, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !709, globals: !714)
!708 = !DIFile(filename: "./lib/utimens.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!709 = !{!710}
!710 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !711, line: 41, baseType: !7, size: 32, elements: !712)
!711 = !DIFile(filename: "./lib/timespec.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!712 = !{!713}
!713 = !DIEnumerator(name: "TIMESPEC_RESOLUTION", value: 1000000000, isUnsigned: true)
!714 = !{!705, !715}
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(name: "lutimensat_works_really", scope: !707, file: !717, line: 76, type: !102, isLocal: true, isDefinition: true)
!717 = !DIFile(filename: "lib/utimens.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !720, file: !723, line: 26, type: !724, isDefinition: true)
!720 = distinct !DICompileUnit(language: DW_LANG_C99, file: !721, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !322, globals: !722)
!721 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!722 = !{!718}
!723 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 376, elements: !725)
!725 = !{!726}
!726 = !DISubrange(count: 47)
!727 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!728 = distinct !DIGlobalVariable(name: "initialized", scope: !729, file: !730, line: 34, type: !71, isLocal: true, isDefinition: true)
!729 = distinct !DISubprogram(name: "can_write_any_file", scope: !730, file: !730, line: 32, type: !731, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: true, unit: !733, retainedNodes: !739)
!730 = !DIFile(filename: "lib/write-any-file.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!731 = !DISubroutineType(types: !732)
!732 = !{!71}
!733 = distinct !DICompileUnit(language: DW_LANG_C99, file: !734, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !322, globals: !735)
!734 = !DIFile(filename: "./lib/write-any-file.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!735 = !{!736, !737}
!736 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression())
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(name: "can_write", scope: !729, file: !730, line: 35, type: !71, isLocal: true, isDefinition: true)
!739 = !{!740}
!740 = !DILocalVariable(name: "can", scope: !741, file: !730, line: 39, type: !71)
!741 = distinct !DILexicalBlock(scope: !742, file: !730, line: 38, column: 5)
!742 = distinct !DILexicalBlock(scope: !729, file: !730, line: 37, column: 7)
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !745, file: !746, line: 339, type: !102, isLocal: true, isDefinition: true)
!745 = distinct !DISubprogram(name: "rpl_fcntl", scope: !746, file: !746, line: 276, type: !747, isDefinition: true, scopeLine: 277, flags: DIFlagPrototyped, isOptimized: true, unit: !749, retainedNodes: !752)
!746 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!747 = !DISubroutineType(types: !748)
!748 = !{!102, !102, !102, null}
!749 = distinct !DICompileUnit(language: DW_LANG_C99, file: !750, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !322, globals: !751)
!750 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!751 = !{!743}
!752 = !{!753, !754, !755, !768, !769, !772, !775, !778}
!753 = !DILocalVariable(name: "fd", arg: 1, scope: !745, file: !746, line: 276, type: !102)
!754 = !DILocalVariable(name: "action", arg: 2, scope: !745, file: !746, line: 276, type: !102)
!755 = !DILocalVariable(name: "arg", scope: !745, file: !746, line: 278, type: !756)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !757, line: 30, baseType: !758)
!757 = !DIFile(filename: "/usr/lib/clang/7.0.0/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !750, line: 278, baseType: !759)
!759 = !DICompositeType(tag: DW_TAG_array_type, baseType: !760, size: 192, elements: !766)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !750, line: 278, size: 192, elements: !761)
!761 = !{!762, !763, !764, !765}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !760, file: !750, line: 278, baseType: !7, size: 32)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !760, file: !750, line: 278, baseType: !7, size: 32, offset: 32)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !760, file: !750, line: 278, baseType: !129, size: 64, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !760, file: !750, line: 278, baseType: !129, size: 64, offset: 128)
!766 = !{!767}
!767 = !DISubrange(count: 1)
!768 = !DILocalVariable(name: "result", scope: !745, file: !746, line: 279, type: !102)
!769 = !DILocalVariable(name: "target", scope: !770, file: !746, line: 326, type: !102)
!770 = distinct !DILexicalBlock(scope: !771, file: !746, line: 325, column: 7)
!771 = distinct !DILexicalBlock(scope: !745, file: !746, line: 282, column: 5)
!772 = !DILocalVariable(name: "flags", scope: !773, file: !746, line: 363, type: !102)
!773 = distinct !DILexicalBlock(scope: !774, file: !746, line: 362, column: 11)
!774 = distinct !DILexicalBlock(scope: !770, file: !746, line: 361, column: 13)
!775 = !DILocalVariable(name: "saved_errno", scope: !776, file: !746, line: 366, type: !102)
!776 = distinct !DILexicalBlock(scope: !777, file: !746, line: 365, column: 15)
!777 = distinct !DILexicalBlock(scope: !773, file: !746, line: 364, column: 17)
!778 = !DILocalVariable(name: "p", scope: !779, file: !746, line: 408, type: !129)
!779 = distinct !DILexicalBlock(scope: !771, file: !746, line: 406, column: 7)
!780 = distinct !DICompileUnit(language: DW_LANG_C99, file: !781, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !782, retainedTypes: !863)
!781 = !DIFile(filename: "src/extent-scan.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!782 = !{!783}
!783 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !784, file: !781, line: 97, baseType: !7, size: 32, elements: !861)
!784 = distinct !DISubprogram(name: "extent_scan_read", scope: !781, file: !781, line: 87, type: !785, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: true, unit: !780, retainedNodes: !805)
!785 = !DISubroutineType(types: !786)
!786 = !{!71, !787}
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extent_scan", file: !789, line: 36, size: 384, elements: !790)
!789 = !DIFile(filename: "src/extent-scan.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!790 = !{!791, !792, !794, !795, !796, !797, !798}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !788, file: !789, line: 39, baseType: !102, size: 32)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "scan_start", scope: !788, file: !789, line: 42, baseType: !793, size: 64, offset: 64)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !67, line: 85, baseType: !197)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "fm_flags", scope: !788, file: !789, line: 45, baseType: !7, size: 32, offset: 128)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "ei_count", scope: !788, file: !789, line: 48, baseType: !237, size: 64, offset: 192)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "initial_scan_failed", scope: !788, file: !789, line: 52, baseType: !71, size: 8, offset: 256)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "hit_final_extent", scope: !788, file: !789, line: 55, baseType: !71, size: 8, offset: 264)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "ext_info", scope: !788, file: !789, line: 58, baseType: !799, size: 64, offset: 320)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extent_info", file: !789, line: 23, size: 192, elements: !801)
!801 = !{!802, !803, !804}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "ext_logical", scope: !800, file: !789, line: 26, baseType: !793, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "ext_length", scope: !800, file: !789, line: 29, baseType: !793, size: 64, offset: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "ext_flags", scope: !800, file: !789, line: 32, baseType: !7, size: 32, offset: 128)
!805 = !{!806, !807, !808, !809, !846, !848, !850, !852, !853, !860}
!806 = !DILocalVariable(name: "scan", arg: 1, scope: !784, file: !781, line: 87, type: !787)
!807 = !DILocalVariable(name: "si", scope: !784, file: !781, line: 89, type: !7)
!808 = !DILocalVariable(name: "last_ei", scope: !784, file: !781, line: 90, type: !799)
!809 = !DILocalVariable(name: "fiemap_buf", scope: !810, file: !781, line: 94, type: !811)
!810 = distinct !DILexicalBlock(scope: !784, file: !781, line: 93, column: 5)
!811 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !784, file: !781, line: 94, size: 32768, elements: !812)
!812 = !{!813, !842}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !811, file: !781, line: 94, baseType: !814, size: 256)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fiemap", file: !815, line: 35, size: 256, elements: !816)
!815 = !DIFile(filename: "src/fiemap.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!816 = !{!817, !821, !822, !825, !826, !827, !828}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "fm_start", scope: !814, file: !815, line: 38, baseType: !818, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !819, line: 27, baseType: !820)
!819 = !DIFile(filename: "/usr/include/bits/stdint-uintn.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !69, line: 44, baseType: !184)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "fm_length", scope: !814, file: !815, line: 41, baseType: !818, size: 64, offset: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "fm_flags", scope: !814, file: !815, line: 44, baseType: !823, size: 32, offset: 128)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !819, line: 26, baseType: !824)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !69, line: 41, baseType: !7)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "fm_mapped_extents", scope: !814, file: !815, line: 47, baseType: !823, size: 32, offset: 160)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "fm_extent_count", scope: !814, file: !815, line: 50, baseType: !823, size: 32, offset: 192)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "fm_reserved", scope: !814, file: !815, line: 52, baseType: !823, size: 32, offset: 224)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "fm_extents", scope: !814, file: !815, line: 59, baseType: !829, offset: 256)
!829 = !DICompositeType(tag: DW_TAG_array_type, baseType: !830, elements: !840)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fiemap_extent", file: !815, line: 14, size: 448, elements: !831)
!831 = !{!832, !833, !834, !835, !837, !838}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "fe_logical", scope: !830, file: !815, line: 18, baseType: !818, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "fe_physical", scope: !830, file: !815, line: 22, baseType: !818, size: 64, offset: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "fe_length", scope: !830, file: !815, line: 25, baseType: !818, size: 64, offset: 128)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "fe_reserved64", scope: !830, file: !815, line: 27, baseType: !836, size: 128, offset: 192)
!836 = !DICompositeType(tag: DW_TAG_array_type, baseType: !818, size: 128, elements: !695)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "fe_flags", scope: !830, file: !815, line: 30, baseType: !823, size: 32, offset: 320)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "fe_reserved", scope: !830, file: !815, line: 32, baseType: !839, size: 96, offset: 352)
!839 = !DICompositeType(tag: DW_TAG_array_type, baseType: !823, size: 96, elements: !139)
!840 = !{!841}
!841 = !DISubrange(count: 0)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !811, file: !781, line: 94, baseType: !843, size: 32768)
!843 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 32768, elements: !844)
!844 = !{!845}
!845 = !DISubrange(count: 4096)
!846 = !DILocalVariable(name: "fiemap", scope: !810, file: !781, line: 95, type: !847)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!848 = !DILocalVariable(name: "fm_extents", scope: !810, file: !781, line: 96, type: !849)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!850 = !DILocalVariable(name: "prev_idx", scope: !851, file: !781, line: 131, type: !237)
!851 = distinct !DILexicalBlock(scope: !810, file: !781, line: 128, column: 7)
!852 = !DILocalVariable(name: "i", scope: !810, file: !781, line: 137, type: !7)
!853 = !DILocalVariable(name: "new_logical", scope: !854, file: !781, line: 163, type: !818)
!854 = distinct !DILexicalBlock(scope: !855, file: !781, line: 158, column: 13)
!855 = distinct !DILexicalBlock(scope: !856, file: !781, line: 155, column: 20)
!856 = distinct !DILexicalBlock(scope: !857, file: !781, line: 145, column: 15)
!857 = distinct !DILexicalBlock(scope: !858, file: !781, line: 139, column: 9)
!858 = distinct !DILexicalBlock(scope: !859, file: !781, line: 138, column: 7)
!859 = distinct !DILexicalBlock(scope: !810, file: !781, line: 138, column: 7)
!860 = !DILocalVariable(name: "length_adjust", scope: !854, file: !781, line: 164, type: !818)
!861 = !{!862}
!862 = !DIEnumerator(name: "count", value: 72, isUnsigned: true)
!863 = !{!793, !237}
!864 = distinct !DICompileUnit(language: DW_LANG_C99, file: !865, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !322)
!865 = !DIFile(filename: "src/selinux.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!866 = distinct !DICompileUnit(language: DW_LANG_C99, file: !867, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !322)
!867 = !DIFile(filename: "./lib/copy-acl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!868 = distinct !DICompileUnit(language: DW_LANG_C99, file: !869, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !322)
!869 = !DIFile(filename: "./lib/set-acl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!870 = distinct !DICompileUnit(language: DW_LANG_C99, file: !871, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !322, retainedTypes: !872)
!871 = !DIFile(filename: "./lib/areadlink-with-size.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!872 = !{!129}
!873 = distinct !DICompileUnit(language: DW_LANG_C99, file: !874, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !455)
!874 = !DIFile(filename: "./lib/backup-rename.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!875 = distinct !DICompileUnit(language: DW_LANG_C99, file: !876, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !322)
!876 = !DIFile(filename: "./lib/buffer-lcm.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!877 = distinct !DICompileUnit(language: DW_LANG_C99, file: !878, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !322)
!878 = !DIFile(filename: "./lib/opendir-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!879 = distinct !DICompileUnit(language: DW_LANG_C99, file: !880, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !322)
!880 = !DIFile(filename: "./lib/dirname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!881 = distinct !DICompileUnit(language: DW_LANG_C99, file: !882, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !322)
!882 = !DIFile(filename: "./lib/dirname-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!883 = distinct !DICompileUnit(language: DW_LANG_C99, file: !884, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !322, retainedTypes: !885)
!884 = !DIFile(filename: "./lib/basename-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!885 = !{!115}
!886 = distinct !DICompileUnit(language: DW_LANG_C99, file: !887, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !322)
!887 = !DIFile(filename: "./lib/stripslash.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!888 = distinct !DICompileUnit(language: DW_LANG_C99, file: !889, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !890)
!889 = !DIFile(filename: "./lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!890 = !{!299}
!891 = distinct !DICompileUnit(language: DW_LANG_C99, file: !892, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !322)
!892 = !DIFile(filename: "./lib/open-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!893 = distinct !DICompileUnit(language: DW_LANG_C99, file: !894, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !322, retainedTypes: !506)
!894 = !DIFile(filename: "./lib/file-set.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!895 = distinct !DICompileUnit(language: DW_LANG_C99, file: !896, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !322)
!896 = !DIFile(filename: "./lib/filemode.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!897 = distinct !DICompileUnit(language: DW_LANG_C99, file: !898, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !322, retainedTypes: !872)
!898 = !DIFile(filename: "./lib/filenamecat.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!899 = distinct !DICompileUnit(language: DW_LANG_C99, file: !900, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !322, retainedTypes: !872)
!900 = !DIFile(filename: "./lib/filenamecat-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!901 = distinct !DICompileUnit(language: DW_LANG_C99, file: !902, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !322, retainedTypes: !903)
!902 = !DIFile(filename: "./lib/full-write.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!903 = !{!55, !237}
!904 = distinct !DICompileUnit(language: DW_LANG_C99, file: !905, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !322)
!905 = !DIFile(filename: "./lib/hash-triple.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!906 = distinct !DICompileUnit(language: DW_LANG_C99, file: !907, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !322)
!907 = !DIFile(filename: "./lib/qcopy-acl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!908 = distinct !DICompileUnit(language: DW_LANG_C99, file: !909, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !322)
!909 = !DIFile(filename: "./lib/qset-acl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!910 = distinct !DICompileUnit(language: DW_LANG_C99, file: !911, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !322, retainedTypes: !885)
!911 = !DIFile(filename: "./lib/renameat2.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!912 = distinct !DICompileUnit(language: DW_LANG_C99, file: !913, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !914)
!913 = !DIFile(filename: "./lib/safe-write.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!914 = !{!915}
!915 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !916, line: 40, baseType: !7, size: 32, elements: !917)
!916 = !DIFile(filename: "./lib/sys-limits.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!917 = !{!918}
!918 = !DIEnumerator(name: "SYS_BUFSIZE_MAX", value: 2146435072, isUnsigned: true)
!919 = distinct !DICompileUnit(language: DW_LANG_C99, file: !920, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !322)
!920 = !DIFile(filename: "./lib/same.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!921 = distinct !DICompileUnit(language: DW_LANG_C99, file: !922, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !322)
!922 = !DIFile(filename: "./lib/fd-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!923 = distinct !DICompileUnit(language: DW_LANG_C99, file: !924, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !322)
!924 = !DIFile(filename: "./lib/verror.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!925 = distinct !DICompileUnit(language: DW_LANG_C99, file: !926, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !927, retainedTypes: !872)
!926 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!927 = !{!928}
!928 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !929, line: 41, baseType: !7, size: 32, elements: !930)
!929 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!930 = !{!931}
!931 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2018, isUnsigned: true)
!932 = distinct !DICompileUnit(language: DW_LANG_C99, file: !933, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !934, retainedTypes: !942)
!933 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!934 = !{!935}
!935 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !936, file: !581, line: 186, baseType: !7, size: 32, elements: !591)
!936 = distinct !DISubprogram(name: "x2nrealloc", scope: !581, file: !581, line: 174, type: !583, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: true, unit: !932, retainedNodes: !937)
!937 = !{!938, !939, !940, !941}
!938 = !DILocalVariable(name: "p", arg: 1, scope: !936, file: !581, line: 174, type: !129)
!939 = !DILocalVariable(name: "pn", arg: 2, scope: !936, file: !581, line: 174, type: !585)
!940 = !DILocalVariable(name: "s", arg: 3, scope: !936, file: !581, line: 174, type: !237)
!941 = !DILocalVariable(name: "n", scope: !936, file: !581, line: 176, type: !237)
!942 = !{!237, !115, !129}
!943 = distinct !DICompileUnit(language: DW_LANG_C99, file: !944, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !322)
!944 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!945 = distinct !DICompileUnit(language: DW_LANG_C99, file: !946, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !322, retainedTypes: !885)
!946 = !DIFile(filename: "./lib/xvasprintf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!947 = distinct !DICompileUnit(language: DW_LANG_C99, file: !948, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !322)
!948 = !DIFile(filename: "./lib/yesno.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!949 = distinct !DICompileUnit(language: DW_LANG_C99, file: !950, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !322, retainedTypes: !872)
!950 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!951 = distinct !DICompileUnit(language: DW_LANG_C99, file: !952, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !322, retainedTypes: !872)
!952 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!953 = distinct !DICompileUnit(language: DW_LANG_C99, file: !954, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !322)
!954 = !DIFile(filename: "./lib/freadahead.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!955 = distinct !DICompileUnit(language: DW_LANG_C99, file: !956, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !322, retainedTypes: !872)
!956 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!957 = distinct !DICompileUnit(language: DW_LANG_C99, file: !958, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !322, retainedTypes: !959)
!958 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!959 = !{!237}
!960 = distinct !DICompileUnit(language: DW_LANG_C99, file: !961, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !322)
!961 = !DIFile(filename: "./lib/acl-internal.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!962 = distinct !DICompileUnit(language: DW_LANG_C99, file: !963, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !322, retainedTypes: !872)
!963 = !DIFile(filename: "./lib/get-permissions.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!964 = distinct !DICompileUnit(language: DW_LANG_C99, file: !965, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !322, retainedTypes: !872)
!965 = !DIFile(filename: "./lib/set-permissions.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!966 = distinct !DICompileUnit(language: DW_LANG_C99, file: !967, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !322)
!967 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!968 = distinct !DICompileUnit(language: DW_LANG_C99, file: !969, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !322)
!969 = !DIFile(filename: "./lib/gettime.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!970 = distinct !DICompileUnit(language: DW_LANG_C99, file: !971, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !322)
!971 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!972 = distinct !DICompileUnit(language: DW_LANG_C99, file: !973, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !322)
!973 = !DIFile(filename: "./lib/hash-pjw.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!974 = distinct !DICompileUnit(language: DW_LANG_C99, file: !975, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !976, retainedTypes: !872)
!975 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!976 = !{!977}
!977 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !978, line: 41, baseType: !7, size: 32, elements: !979)
!978 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
