; ModuleID = 'coreutils-8.32/src/cp.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.cp_options = type { i32, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i32, i32, %struct.hash_table*, %struct.hash_table* }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.hash_entry = type { i8*, %struct.hash_entry* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.fs_res = type { i64, i32, i8 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "long_opts", scope: !2, file: !3, line: 107, type: !454, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !128, globals: !328, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/cp.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !13, !20, !26, !32, !37, !51}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "backup_type", file: !6, line: 30, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/backupfile.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "no_backups", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "simple_backups", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "numbered_existing_backups", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "numbered_backups", value: 3, isUnsigned: true)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Dereference_symlink", file: !14, line: 69, baseType: !7, size: 32, elements: !15)
!14 = !DIFile(filename: "src/copy.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!15 = !{!16, !17, !18, !19}
!16 = !DIEnumerator(name: "DEREF_UNDEFINED", value: 1, isUnsigned: true)
!17 = !DIEnumerator(name: "DEREF_NEVER", value: 2, isUnsigned: true)
!18 = !DIEnumerator(name: "DEREF_COMMAND_LINE_ARGUMENTS", value: 3, isUnsigned: true)
!19 = !DIEnumerator(name: "DEREF_ALWAYS", value: 4, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Interactive", file: !14, line: 60, baseType: !7, size: 32, elements: !21)
!21 = !{!22, !23, !24, !25}
!22 = !DIEnumerator(name: "I_ALWAYS_YES", value: 1, isUnsigned: true)
!23 = !DIEnumerator(name: "I_ALWAYS_NO", value: 2, isUnsigned: true)
!24 = !DIEnumerator(name: "I_ASK_USER", value: 3, isUnsigned: true)
!25 = !DIEnumerator(name: "I_UNSPECIFIED", value: 4, isUnsigned: true)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Sparse_type", file: !14, line: 26, baseType: !7, size: 32, elements: !27)
!27 = !{!28, !29, !30, !31}
!28 = !DIEnumerator(name: "SPARSE_UNUSED", value: 0, isUnsigned: true)
!29 = !DIEnumerator(name: "SPARSE_NEVER", value: 1, isUnsigned: true)
!30 = !DIEnumerator(name: "SPARSE_AUTO", value: 2, isUnsigned: true)
!31 = !DIEnumerator(name: "SPARSE_ALWAYS", value: 3, isUnsigned: true)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Reflink_type", file: !14, line: 47, baseType: !7, size: 32, elements: !33)
!33 = !{!34, !35, !36}
!34 = !DIEnumerator(name: "REFLINK_NEVER", value: 0, isUnsigned: true)
!35 = !DIEnumerator(name: "REFLINK_AUTO", value: 1, isUnsigned: true)
!36 = !DIEnumerator(name: "REFLINK_ALWAYS", value: 2, isUnsigned: true)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !38, line: 32, baseType: !7, size: 32, elements: !39)
!38 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!39 = !{!40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50}
!40 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!41 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!42 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!43 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!44 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!45 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!46 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!47 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!48 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!49 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!50 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "File_attribute", scope: !52, file: !3, line: 839, baseType: !7, size: 32, elements: !120)
!52 = distinct !DISubprogram(name: "decode_preserve_arg", scope: !3, file: !3, line: 837, type: !53, scopeLine: 838, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !110)
!53 = !DISubroutineType(types: !54)
!54 = !{null, !55, !58, !71}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!57 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cp_options", file: !14, line: 98, size: 640, elements: !60)
!60 = !{!61, !62, !63, !64, !65, !70, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !103, !104, !109}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "backup_type", scope: !59, file: !14, line: 100, baseType: !5, size: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "dereference", scope: !59, file: !14, line: 103, baseType: !13, size: 32, offset: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !59, file: !14, line: 108, baseType: !20, size: 32, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_mode", scope: !59, file: !14, line: 111, baseType: !26, size: 32, offset: 96)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !59, file: !14, line: 115, baseType: !66, size: 32, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !67, line: 69, baseType: !68)
!67 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !69, line: 150, baseType: !7)
!69 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!70 = !DIDerivedType(tag: DW_TAG_member, name: "copy_as_regular", scope: !59, file: !14, line: 119, baseType: !71, size: 8, offset: 160)
!71 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_before_opening", scope: !59, file: !14, line: 123, baseType: !71, size: 8, offset: 168)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_after_failed_open", scope: !59, file: !14, line: 130, baseType: !71, size: 8, offset: 176)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "hard_link", scope: !59, file: !14, line: 134, baseType: !71, size: 8, offset: 184)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "move_mode", scope: !59, file: !14, line: 138, baseType: !71, size: 8, offset: 192)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "install_mode", scope: !59, file: !14, line: 141, baseType: !71, size: 8, offset: 200)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "chown_privileges", scope: !59, file: !14, line: 145, baseType: !71, size: 8, offset: 208)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "owner_privileges", scope: !59, file: !14, line: 152, baseType: !71, size: 8, offset: 216)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "one_file_system", scope: !59, file: !14, line: 156, baseType: !71, size: 8, offset: 224)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_ownership", scope: !59, file: !14, line: 160, baseType: !71, size: 8, offset: 232)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_mode", scope: !59, file: !14, line: 161, baseType: !71, size: 8, offset: 240)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_timestamps", scope: !59, file: !14, line: 162, baseType: !71, size: 8, offset: 248)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "explicit_no_preserve_mode", scope: !59, file: !14, line: 163, baseType: !71, size: 8, offset: 256)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "set_security_context", scope: !59, file: !14, line: 166, baseType: !71, size: 8, offset: 264)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_links", scope: !59, file: !14, line: 178, baseType: !71, size: 8, offset: 272)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "data_copy_required", scope: !59, file: !14, line: 182, baseType: !71, size: 8, offset: 280)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve", scope: !59, file: !14, line: 188, baseType: !71, size: 8, offset: 288)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_security_context", scope: !59, file: !14, line: 192, baseType: !71, size: 8, offset: 296)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_context", scope: !59, file: !14, line: 201, baseType: !71, size: 8, offset: 304)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_xattr", scope: !59, file: !14, line: 205, baseType: !71, size: 8, offset: 312)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_xattr", scope: !59, file: !14, line: 214, baseType: !71, size: 8, offset: 320)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "reduce_diagnostics", scope: !59, file: !14, line: 223, baseType: !71, size: 8, offset: 328)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !59, file: !14, line: 227, baseType: !71, size: 8, offset: 336)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "set_mode", scope: !59, file: !14, line: 231, baseType: !71, size: 8, offset: 344)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "symbolic_link", scope: !59, file: !14, line: 235, baseType: !71, size: 8, offset: 352)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !59, file: !14, line: 239, baseType: !71, size: 8, offset: 360)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !59, file: !14, line: 242, baseType: !71, size: 8, offset: 368)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_tty", scope: !59, file: !14, line: 245, baseType: !71, size: 8, offset: 376)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "open_dangling_dest_symlink", scope: !59, file: !14, line: 250, baseType: !71, size: 8, offset: 384)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "last_file", scope: !59, file: !14, line: 254, baseType: !71, size: 8, offset: 392)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "rename_errno", scope: !59, file: !14, line: 259, baseType: !102, size: 32, offset: 416)
!102 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "reflink_mode", scope: !59, file: !14, line: 262, baseType: !32, size: 32, offset: 448)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "dest_info", scope: !59, file: !14, line: 273, baseType: !105, size: 64, offset: 512)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !107, line: 69, baseType: !108)
!107 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !107, line: 67, flags: DIFlagFwdDecl)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "src_info", scope: !59, file: !14, line: 276, baseType: !105, size: 64, offset: 576)
!110 = !{!111, !112, !113, !114, !116, !117, !119}
!111 = !DILocalVariable(name: "arg", arg: 1, scope: !52, file: !3, line: 837, type: !55)
!112 = !DILocalVariable(name: "x", arg: 2, scope: !52, file: !3, line: 837, type: !58)
!113 = !DILocalVariable(name: "on_off", arg: 3, scope: !52, file: !3, line: 837, type: !71)
!114 = !DILocalVariable(name: "arg_writable", scope: !52, file: !3, line: 863, type: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!116 = !DILocalVariable(name: "s", scope: !52, file: !3, line: 864, type: !115)
!117 = !DILocalVariable(name: "comma", scope: !118, file: !3, line: 868, type: !115)
!118 = distinct !DILexicalBlock(scope: !52, file: !3, line: 866, column: 5)
!119 = !DILocalVariable(name: "val", scope: !118, file: !3, line: 869, type: !51)
!120 = !{!121, !122, !123, !124, !125, !126, !127}
!121 = !DIEnumerator(name: "PRESERVE_MODE", value: 0, isUnsigned: true)
!122 = !DIEnumerator(name: "PRESERVE_TIMESTAMPS", value: 1, isUnsigned: true)
!123 = !DIEnumerator(name: "PRESERVE_OWNERSHIP", value: 2, isUnsigned: true)
!124 = !DIEnumerator(name: "PRESERVE_LINK", value: 3, isUnsigned: true)
!125 = !DIEnumerator(name: "PRESERVE_CONTEXT", value: 4, isUnsigned: true)
!126 = !DIEnumerator(name: "PRESERVE_XATTR", value: 5, isUnsigned: true)
!127 = !DIEnumerator(name: "PRESERVE_ALL", value: 6, isUnsigned: true)
!128 = !{!129, !134, !194, !198, !202, !205, !208, !215, !230, !184, !232, !236, !115, !239, !243, !246, !247, !251, !253, !256, !257, !259, !262, !263, !264, !268, !273, !274, !280, !283, !286, !289, !292, !296, !299, !301, !304, !317, !321, !324}
!129 = !DISubprogram(name: "dcgettext", scope: !130, file: !130, line: 51, type: !131, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!130 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!131 = !DISubroutineType(types: !132)
!132 = !{!115, !55, !55, !102}
!133 = !{}
!134 = !DISubprogram(name: "fputs_unlocked", scope: !135, file: !135, line: 662, type: !136, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!135 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!136 = !DISubroutineType(types: !137)
!137 = !{!102, !55, !138}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !140, line: 49, size: 1728, elements: !141)
!140 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!141 = !{!142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !157, !158, !159, !160, !163, !165, !167, !171, !174, !176, !179, !182, !183, !185, !189, !190}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !139, file: !140, line: 51, baseType: !102, size: 32)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !139, file: !140, line: 54, baseType: !115, size: 64, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !139, file: !140, line: 55, baseType: !115, size: 64, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !139, file: !140, line: 56, baseType: !115, size: 64, offset: 192)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !139, file: !140, line: 57, baseType: !115, size: 64, offset: 256)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !139, file: !140, line: 58, baseType: !115, size: 64, offset: 320)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !139, file: !140, line: 59, baseType: !115, size: 64, offset: 384)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !139, file: !140, line: 60, baseType: !115, size: 64, offset: 448)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !139, file: !140, line: 61, baseType: !115, size: 64, offset: 512)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !139, file: !140, line: 64, baseType: !115, size: 64, offset: 576)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !139, file: !140, line: 65, baseType: !115, size: 64, offset: 640)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !139, file: !140, line: 66, baseType: !115, size: 64, offset: 704)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !139, file: !140, line: 68, baseType: !155, size: 64, offset: 768)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !140, line: 36, flags: DIFlagFwdDecl)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !139, file: !140, line: 70, baseType: !138, size: 64, offset: 832)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !139, file: !140, line: 72, baseType: !102, size: 32, offset: 896)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !139, file: !140, line: 73, baseType: !102, size: 32, offset: 928)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !139, file: !140, line: 74, baseType: !161, size: 64, offset: 960)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !69, line: 152, baseType: !162)
!162 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !139, file: !140, line: 77, baseType: !164, size: 16, offset: 1024)
!164 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !139, file: !140, line: 78, baseType: !166, size: 8, offset: 1040)
!166 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !139, file: !140, line: 79, baseType: !168, size: 8, offset: 1048)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 8, elements: !169)
!169 = !{!170}
!170 = !DISubrange(count: 1)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !139, file: !140, line: 81, baseType: !172, size: 64, offset: 1088)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !140, line: 43, baseType: null)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !139, file: !140, line: 89, baseType: !175, size: 64, offset: 1152)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !69, line: 153, baseType: !162)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !139, file: !140, line: 91, baseType: !177, size: 64, offset: 1216)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !140, line: 37, flags: DIFlagFwdDecl)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !139, file: !140, line: 92, baseType: !180, size: 64, offset: 1280)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !140, line: 38, flags: DIFlagFwdDecl)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !139, file: !140, line: 93, baseType: !138, size: 64, offset: 1344)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !139, file: !140, line: 94, baseType: !184, size: 64, offset: 1408)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !139, file: !140, line: 95, baseType: !186, size: 64, offset: 1472)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !187, line: 46, baseType: !188)
!187 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!188 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !139, file: !140, line: 96, baseType: !102, size: 32, offset: 1536)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !139, file: !140, line: 98, baseType: !191, size: 160, offset: 1568)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 160, elements: !192)
!192 = !{!193}
!193 = !DISubrange(count: 20)
!194 = !DISubprogram(name: "set_program_name", scope: !195, file: !195, line: 37, type: !196, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!195 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!196 = !DISubroutineType(types: !197)
!197 = !{null, !55}
!198 = !DISubprogram(name: "setlocale", scope: !199, file: !199, line: 122, type: !200, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!199 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!200 = !DISubroutineType(types: !201)
!201 = !{!115, !102, !55}
!202 = !DISubprogram(name: "bindtextdomain", scope: !130, file: !130, line: 86, type: !203, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!203 = !DISubroutineType(types: !204)
!204 = !{!115, !55, !55}
!205 = !DISubprogram(name: "textdomain", scope: !130, file: !130, line: 82, type: !206, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!206 = !DISubroutineType(types: !207)
!207 = !{!115, !55}
!208 = !DISubprogram(name: "atexit", scope: !209, file: !209, line: 595, type: !210, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!209 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!210 = !DISubroutineType(types: !211)
!211 = !{!102, !212}
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{null}
!215 = !DISubprogram(name: "getopt_long", scope: !216, file: !216, line: 66, type: !217, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!216 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!217 = !DISubroutineType(types: !218)
!218 = !{!102, !102, !219, !55, !221, !228}
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !115)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !223)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !216, line: 50, size: 256, elements: !224)
!224 = !{!225, !226, !227, !229}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !223, file: !216, line: 52, baseType: !55, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !223, file: !216, line: 55, baseType: !102, size: 32, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !223, file: !216, line: 56, baseType: !228, size: 64, offset: 128)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !223, file: !216, line: 57, baseType: !102, size: 32, offset: 192)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!232 = !DISubprogram(name: "error", scope: !233, file: !233, line: 52, type: !234, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!233 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!234 = !DISubroutineType(types: !235)
!235 = !{null, !102, !102, !55, null}
!236 = !DISubprogram(name: "quotearg_style", scope: !38, file: !38, line: 377, type: !237, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!237 = !DISubroutineType(types: !238)
!238 = !{!115, !37, !55}
!239 = !DISubprogram(name: "version_etc", scope: !240, file: !240, line: 69, type: !241, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!240 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!241 = !DISubroutineType(types: !242)
!242 = !{null, !138, !55, !55, !55, null}
!243 = !DISubprogram(name: "xget_version", scope: !6, file: !6, line: 55, type: !244, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!244 = !DISubroutineType(types: !245)
!245 = !{!5, !55, !55}
!246 = !DISubprogram(name: "set_simple_backup_suffix", scope: !6, file: !6, line: 51, type: !196, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!247 = !DISubprogram(name: "quote", scope: !248, file: !248, line: 44, type: !249, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!248 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!249 = !DISubroutineType(types: !250)
!250 = !{!55, !55}
!251 = !DISubprogram(name: "hash_init", scope: !252, file: !252, line: 1, type: !213, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!252 = !DIFile(filename: "src/cp-hash.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!253 = !DISubprogram(name: "cp_options_default", scope: !14, file: !14, line: 303, type: !254, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !58}
!256 = !DISubprogram(name: "getenv", scope: !209, file: !209, line: 634, type: !206, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!257 = !DISubprogram(name: "xstrdup", scope: !258, file: !258, line: 64, type: !206, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!258 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!259 = !DISubprogram(name: "free", scope: !209, file: !209, line: 565, type: !260, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!260 = !DISubroutineType(types: !261)
!261 = !{null, !184}
!262 = !DISubprogram(name: "dest_info_init", scope: !14, file: !14, line: 300, type: !254, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!263 = !DISubprogram(name: "src_info_init", scope: !14, file: !14, line: 301, type: !254, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!264 = !DISubprogram(name: "strip_trailing_slashes", scope: !265, file: !265, line: 48, type: !266, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!265 = !DIFile(filename: "./lib/dirname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!266 = !DISubroutineType(types: !267)
!267 = !{!71, !115}
!268 = !DISubprogram(name: "file_name_concat", scope: !269, file: !269, line: 22, type: !270, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!269 = !DIFile(filename: "./lib/filenamecat.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!270 = !DISubroutineType(types: !271)
!271 = !{!115, !55, !55, !272}
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!273 = !DISubprogram(name: "last_component", scope: !265, file: !265, line: 46, type: !206, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!274 = !DISubprogram(name: "copy", scope: !14, file: !14, line: 288, type: !275, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!275 = !DISubroutineType(types: !276)
!276 = !{!71, !55, !55, !71, !277, !279, !279}
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !59)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!280 = !DISubprogram(name: "find_backup_file_name", scope: !6, file: !6, line: 53, type: !281, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!281 = !DISubroutineType(types: !282)
!282 = !{!115, !102, !55, !5}
!283 = !DISubprogram(name: "dir_len", scope: !265, file: !265, line: 45, type: !284, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!284 = !DISubroutineType(types: !285)
!285 = !{!188, !55}
!286 = !DISubprogram(name: "xmalloc", scope: !258, file: !258, line: 53, type: !287, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!287 = !DISubroutineType(types: !288)
!288 = !{!184, !188}
!289 = !DISubprogram(name: "set_process_security_ctx", scope: !14, file: !14, line: 292, type: !290, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!290 = !DISubroutineType(types: !291)
!291 = !{!71, !55, !55, !7, !71, !277}
!292 = !DISubprogram(name: "mkdir", scope: !293, file: !293, line: 317, type: !294, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!293 = !DIFile(filename: "/usr/include/sys/stat.h", directory: "")
!294 = !DISubroutineType(types: !295)
!295 = !{!102, !55, !7}
!296 = !DISubprogram(name: "cached_umask", scope: !14, file: !14, line: 305, type: !297, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!297 = !DISubroutineType(types: !298)
!298 = !{!7}
!299 = !DISubprogram(name: "lchmod", scope: !300, file: !300, line: 993, type: !294, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!300 = !DIFile(filename: "./lib/sys/stat.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!301 = !DISubprogram(name: "set_file_security_ctx", scope: !14, file: !14, line: 297, type: !302, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!302 = !DISubroutineType(types: !303)
!303 = !{!71, !55, !71, !71, !277}
!304 = !DISubprogram(name: "utimens", scope: !305, file: !305, line: 22, type: !306, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!305 = !DIFile(filename: "./lib/utimens.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!306 = !DISubroutineType(types: !307)
!307 = !{!102, !55, !308}
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !310)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !311, line: 10, size: 128, elements: !312)
!311 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!312 = !{!313, !315}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !310, file: !311, line: 12, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !69, line: 160, baseType: !162)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !310, file: !311, line: 16, baseType: !316, size: 64, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !69, line: 196, baseType: !162)
!317 = !DISubprogram(name: "lchown", scope: !318, file: !318, line: 483, type: !319, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!318 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!319 = !DISubroutineType(types: !320)
!320 = !{!102, !55, !7, !7}
!321 = !DISubprogram(name: "chown_failure_ok", scope: !14, file: !14, line: 304, type: !322, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!322 = !DISubroutineType(types: !323)
!323 = !{!71, !277}
!324 = !DISubprogram(name: "copy_acl", scope: !325, file: !325, line: 32, type: !326, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!325 = !DIFile(filename: "./lib/acl.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!326 = !DISubroutineType(types: !327)
!327 = !{!102, !55, !102, !55, !102, !7}
!328 = !{!329, !331, !0, !333, !339, !345, !349, !351, !357, !362, !364}
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(name: "selinux_enabled", scope: !2, file: !3, line: 78, type: !71, isLocal: true, isDefinition: true)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(name: "remove_trailing_slashes", scope: !2, file: !3, line: 85, type: !71, isLocal: true, isDefinition: true)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(name: "sparse_type", scope: !2, file: !3, line: 91, type: !335, isLocal: true, isDefinition: true)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !336, size: 96, elements: !337)
!336 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!337 = !{!338}
!338 = !DISubrange(count: 3)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "sparse_type_string", scope: !2, file: !3, line: 87, type: !341, isLocal: true, isDefinition: true)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !342, size: 256, elements: !343)
!342 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!343 = !{!344}
!344 = !DISubrange(count: 4)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(name: "reflink_type", scope: !2, file: !3, line: 101, type: !347, isLocal: true, isDefinition: true)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !348, size: 96, elements: !337)
!348 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(name: "reflink_type_string", scope: !2, file: !3, line: 97, type: !341, isLocal: true, isDefinition: true)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "preserve_vals", scope: !52, file: !3, line: 849, type: !353, isLocal: true, isDefinition: true)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !354, size: 224, elements: !355)
!354 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!355 = !{!356}
!356 = !DISubrange(count: 7)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(name: "preserve_args", scope: !52, file: !3, line: 856, type: !359, isLocal: true, isDefinition: true)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !342, size: 512, elements: !360)
!360 = !{!361}
!361 = !DISubrange(count: 8)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "parents_option", scope: !2, file: !3, line: 82, type: !71, isLocal: true, isDefinition: true)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(name: "x_tmp", scope: !366, file: !3, line: 760, type: !59, isLocal: true, isDefinition: true)
!366 = distinct !DISubprogram(name: "do_copy", scope: !3, file: !3, line: 594, type: !367, scopeLine: 596, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !369)
!367 = !DISubroutineType(types: !368)
!368 = !{!71, !102, !272, !55, !71, !58}
!369 = !{!370, !371, !372, !373, !374, !375, !402, !403, !404, !405, !409, !413, !416, !417, !425, !426, !427, !430, !433, !434, !435, !437, !440, !441, !442, !445, !449, !451, !452, !453}
!370 = !DILocalVariable(name: "n_files", arg: 1, scope: !366, file: !3, line: 594, type: !102)
!371 = !DILocalVariable(name: "file", arg: 2, scope: !366, file: !3, line: 594, type: !272)
!372 = !DILocalVariable(name: "target_directory", arg: 3, scope: !366, file: !3, line: 594, type: !55)
!373 = !DILocalVariable(name: "no_target_directory", arg: 4, scope: !366, file: !3, line: 595, type: !71)
!374 = !DILocalVariable(name: "x", arg: 5, scope: !366, file: !3, line: 595, type: !58)
!375 = !DILocalVariable(name: "sb", scope: !366, file: !3, line: 597, type: !376)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !377, line: 46, size: 1152, elements: !378)
!377 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "")
!378 = !{!379, !381, !383, !385, !386, !388, !390, !391, !392, !393, !395, !397, !398, !399, !400}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !376, file: !377, line: 48, baseType: !380, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !69, line: 145, baseType: !188)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !376, file: !377, line: 53, baseType: !382, size: 64, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !69, line: 148, baseType: !188)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !376, file: !377, line: 61, baseType: !384, size: 64, offset: 128)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !69, line: 151, baseType: !188)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !376, file: !377, line: 62, baseType: !68, size: 32, offset: 192)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !376, file: !377, line: 64, baseType: !387, size: 32, offset: 224)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !69, line: 146, baseType: !7)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !376, file: !377, line: 65, baseType: !389, size: 32, offset: 256)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !69, line: 147, baseType: !7)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !376, file: !377, line: 67, baseType: !102, size: 32, offset: 288)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !376, file: !377, line: 69, baseType: !380, size: 64, offset: 320)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !376, file: !377, line: 74, baseType: !161, size: 64, offset: 384)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !376, file: !377, line: 78, baseType: !394, size: 64, offset: 448)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !69, line: 174, baseType: !162)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !376, file: !377, line: 80, baseType: !396, size: 64, offset: 512)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !69, line: 179, baseType: !162)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !376, file: !377, line: 91, baseType: !310, size: 128, offset: 576)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !376, file: !377, line: 92, baseType: !310, size: 128, offset: 704)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !376, file: !377, line: 93, baseType: !310, size: 128, offset: 832)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !376, file: !377, line: 106, baseType: !401, size: 192, offset: 960)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !316, size: 192, elements: !337)
!402 = !DILocalVariable(name: "new_dst", scope: !366, file: !3, line: 598, type: !71)
!403 = !DILocalVariable(name: "ok", scope: !366, file: !3, line: 599, type: !71)
!404 = !DILocalVariable(name: "forcing", scope: !366, file: !3, line: 600, type: !71)
!405 = !DILocalVariable(name: "__x", scope: !406, file: !3, line: 625, type: !71)
!406 = distinct !DILexicalBlock(scope: !407, file: !3, line: 625, column: 7)
!407 = distinct !DILexicalBlock(scope: !408, file: !3, line: 614, column: 5)
!408 = distinct !DILexicalBlock(scope: !366, file: !3, line: 613, column: 7)
!409 = !DILocalVariable(name: "i", scope: !410, file: !3, line: 654, type: !102)
!410 = distinct !DILexicalBlock(scope: !411, file: !3, line: 654, column: 7)
!411 = distinct !DILexicalBlock(scope: !412, file: !3, line: 640, column: 5)
!412 = distinct !DILexicalBlock(scope: !366, file: !3, line: 639, column: 7)
!413 = !DILocalVariable(name: "dst_name", scope: !414, file: !3, line: 656, type: !115)
!414 = distinct !DILexicalBlock(scope: !415, file: !3, line: 655, column: 9)
!415 = distinct !DILexicalBlock(scope: !410, file: !3, line: 654, column: 7)
!416 = !DILocalVariable(name: "parent_exists", scope: !414, file: !3, line: 657, type: !71)
!417 = !DILocalVariable(name: "attr_list", scope: !414, file: !3, line: 658, type: !418)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dir_attr", file: !3, line: 54, size: 1344, elements: !420)
!420 = !{!421, !422, !423, !424}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "st", scope: !419, file: !3, line: 56, baseType: !376, size: 1152)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !419, file: !3, line: 57, baseType: !71, size: 8, offset: 1152)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "slash_offset", scope: !419, file: !3, line: 58, baseType: !186, size: 64, offset: 1216)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !419, file: !3, line: 59, baseType: !418, size: 64, offset: 1280)
!425 = !DILocalVariable(name: "arg_in_concat", scope: !414, file: !3, line: 659, type: !115)
!426 = !DILocalVariable(name: "arg", scope: !414, file: !3, line: 660, type: !115)
!427 = !DILocalVariable(name: "arg_no_trailing_slash", scope: !428, file: !3, line: 669, type: !115)
!428 = distinct !DILexicalBlock(scope: !429, file: !3, line: 668, column: 13)
!429 = distinct !DILexicalBlock(scope: !414, file: !3, line: 667, column: 15)
!430 = !DILocalVariable(name: "__old", scope: !431, file: !3, line: 676, type: !55)
!431 = distinct !DILexicalBlock(scope: !432, file: !3, line: 676, column: 15)
!432 = distinct !DILexicalBlock(scope: !428, file: !3, line: 676, column: 15)
!433 = !DILocalVariable(name: "__len", scope: !431, file: !3, line: 676, type: !186)
!434 = !DILocalVariable(name: "__new", scope: !431, file: !3, line: 676, type: !115)
!435 = !DILocalVariable(name: "arg_base", scope: !436, file: !3, line: 695, type: !115)
!436 = distinct !DILexicalBlock(scope: !429, file: !3, line: 694, column: 13)
!437 = !DILocalVariable(name: "__old", scope: !438, file: !3, line: 697, type: !55)
!438 = distinct !DILexicalBlock(scope: !439, file: !3, line: 697, column: 15)
!439 = distinct !DILexicalBlock(scope: !436, file: !3, line: 697, column: 15)
!440 = !DILocalVariable(name: "__len", scope: !438, file: !3, line: 697, type: !186)
!441 = !DILocalVariable(name: "__new", scope: !438, file: !3, line: 697, type: !115)
!442 = !DILocalVariable(name: "copy_into_self", scope: !443, file: !3, line: 714, type: !71)
!443 = distinct !DILexicalBlock(scope: !444, file: !3, line: 713, column: 13)
!444 = distinct !DILexicalBlock(scope: !414, file: !3, line: 706, column: 15)
!445 = !DILocalVariable(name: "p", scope: !446, file: !3, line: 726, type: !418)
!446 = distinct !DILexicalBlock(scope: !447, file: !3, line: 725, column: 17)
!447 = distinct !DILexicalBlock(scope: !448, file: !3, line: 723, column: 13)
!448 = distinct !DILexicalBlock(scope: !414, file: !3, line: 722, column: 15)
!449 = !DILocalVariable(name: "new_dest", scope: !450, file: !3, line: 737, type: !55)
!450 = distinct !DILexicalBlock(scope: !412, file: !3, line: 736, column: 5)
!451 = !DILocalVariable(name: "source", scope: !450, file: !3, line: 738, type: !55)
!452 = !DILocalVariable(name: "dest", scope: !450, file: !3, line: 739, type: !55)
!453 = !DILocalVariable(name: "unused", scope: !450, file: !3, line: 740, type: !71)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 7680, elements: !455)
!455 = !{!456}
!456 = !DISubrange(count: 30)
!457 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!458 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(name: "top_level_src_name", scope: !461, file: !462, line: 147, type: !55, isLocal: true, isDefinition: true)
!461 = distinct !DICompileUnit(language: DW_LANG_C99, file: !462, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !463, retainedTypes: !488, globals: !729, splitDebugInlining: false, nameTableKind: None)
!462 = !DIFile(filename: "src/copy.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!463 = !{!5, !13, !20, !26, !32, !37, !464, !468, !475, !484}
!464 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !465, line: 27, baseType: !7, size: 32, elements: !466)
!465 = !DIFile(filename: "./lib/utimecmp.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!466 = !{!467}
!467 = !DIEnumerator(name: "UTIMECMP_TRUNCATE_SOURCE", value: 1, isUnsigned: true)
!468 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "savedir_option", file: !469, line: 26, baseType: !7, size: 32, elements: !470)
!469 = !DIFile(filename: "./lib/savedir.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!470 = !{!471, !472, !473, !474}
!471 = !DIEnumerator(name: "SAVEDIR_SORT_NONE", value: 0, isUnsigned: true)
!472 = !DIEnumerator(name: "SAVEDIR_SORT_NAME", value: 1, isUnsigned: true)
!473 = !DIEnumerator(name: "SAVEDIR_SORT_INODE", value: 2, isUnsigned: true)
!474 = !DIEnumerator(name: "SAVEDIR_SORT_FASTREAD", value: 2, isUnsigned: true)
!475 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !476, line: 45, baseType: !7, size: 32, elements: !477)
!476 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!477 = !{!478, !479, !480, !481, !482, !483}
!478 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0, isUnsigned: true)
!479 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2, isUnsigned: true)
!480 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5, isUnsigned: true)
!481 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4, isUnsigned: true)
!482 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3, isUnsigned: true)
!483 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1, isUnsigned: true)
!484 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !485, line: 73, baseType: !7, size: 32, elements: !486)
!485 = !DIFile(filename: "src/ioblksize.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!486 = !{!487}
!487 = !DIEnumerator(name: "IO_BUFSIZE", value: 131072, isUnsigned: true)
!488 = !{!129, !247, !232, !236, !489, !492, !513, !66, !514, !184, !7, !517, !521, !550, !553, !556, !559, !273, !560, !115, !259, !561, !564, !567, !571, !574, !577, !292, !299, !578, !579, !583, !584, !317, !588, !324, !593, !596, !597, !600, !604, !607, !188, !611, !286, !613, !614, !268, !617, !621, !186, !624, !627, !631, !634, !637, !640, !644, !665, !668, !671, !675, !679, !683, !686, !687, !688, !691, !714, !717, !728}
!489 = !DISubprogram(name: "quotearg_n_style", scope: !38, file: !38, line: 368, type: !490, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!490 = !DISubroutineType(types: !491)
!491 = !{!115, !102, !37, !55}
!492 = !DISubprogram(name: "hash_initialize", scope: !107, file: !107, line: 89, type: !493, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!493 = !DISubroutineType(types: !494)
!494 = !{!495, !188, !496, !506, !509, !512}
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !498)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !107, line: 53, size: 160, elements: !499)
!499 = !{!500, !502, !503, !504, !505}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !498, file: !107, line: 58, baseType: !501, size: 32)
!501 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !498, file: !107, line: 59, baseType: !501, size: 32, offset: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !498, file: !107, line: 60, baseType: !501, size: 32, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !498, file: !107, line: 61, baseType: !501, size: 32, offset: 96)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !498, file: !107, line: 62, baseType: !71, size: 8, offset: 128)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DISubroutineType(types: !508)
!508 = !{!188, !230, !188}
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DISubroutineType(types: !511)
!511 = !{!71, !230, !230}
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!513 = !DISubprogram(name: "geteuid", scope: !318, file: !318, line: 678, type: !297, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!514 = !DISubprogram(name: "umask", scope: !293, file: !293, line: 308, type: !515, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!515 = !DISubroutineType(types: !516)
!516 = !{!7, !7}
!517 = !DISubprogram(name: "renameatu", scope: !518, file: !518, line: 28, type: !519, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!518 = !DIFile(filename: "./lib/renameatu.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!519 = !DISubroutineType(types: !520)
!520 = !{!102, !102, !55, !102, !55, !7}
!521 = !DISubprogram(name: "seen_file", scope: !522, file: !522, line: 14, type: !523, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!522 = !DIFile(filename: "./lib/file-set.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!523 = !DISubroutineType(types: !524)
!524 = !{!71, !525, !55, !527}
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !108)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !529)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !377, line: 46, size: 1152, elements: !530)
!530 = !{!531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !547, !548, !549}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !529, file: !377, line: 48, baseType: !380, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !529, file: !377, line: 53, baseType: !382, size: 64, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !529, file: !377, line: 61, baseType: !384, size: 64, offset: 128)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !529, file: !377, line: 62, baseType: !68, size: 32, offset: 192)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !529, file: !377, line: 64, baseType: !387, size: 32, offset: 224)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !529, file: !377, line: 65, baseType: !389, size: 32, offset: 256)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !529, file: !377, line: 67, baseType: !102, size: 32, offset: 288)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !529, file: !377, line: 69, baseType: !380, size: 64, offset: 320)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !529, file: !377, line: 74, baseType: !161, size: 64, offset: 384)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !529, file: !377, line: 78, baseType: !394, size: 64, offset: 448)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !529, file: !377, line: 80, baseType: !396, size: 64, offset: 512)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !529, file: !377, line: 91, baseType: !543, size: 128, offset: 576)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !311, line: 10, size: 128, elements: !544)
!544 = !{!545, !546}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !543, file: !311, line: 12, baseType: !314, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !543, file: !311, line: 16, baseType: !316, size: 64, offset: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !529, file: !377, line: 92, baseType: !543, size: 128, offset: 704)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !529, file: !377, line: 93, baseType: !543, size: 128, offset: 832)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !529, file: !377, line: 106, baseType: !401, size: 192, offset: 960)
!550 = !DISubprogram(name: "record_file", scope: !522, file: !522, line: 7, type: !551, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!551 = !DISubroutineType(types: !552)
!552 = !{null, !495, !55, !527}
!553 = !DISubprogram(name: "utimecmp", scope: !465, file: !465, line: 35, type: !554, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!554 = !DISubroutineType(types: !555)
!555 = !{!102, !55, !527, !527, !102}
!556 = !DISubprogram(name: "remember_copied", scope: !252, file: !252, line: 4, type: !557, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!557 = !DISubroutineType(types: !558)
!558 = !{!115, !55, !188, !188}
!559 = !DISubprogram(name: "quotearg_n_style_colon", scope: !38, file: !38, line: 397, type: !490, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!560 = !DISubprogram(name: "backup_file_rename", scope: !6, file: !6, line: 52, type: !281, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!561 = !DISubprogram(name: "unlink", scope: !318, file: !318, line: 825, type: !562, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!562 = !DISubroutineType(types: !563)
!563 = !{!102, !55}
!564 = !DISubprogram(name: "src_to_dest_lookup", scope: !252, file: !252, line: 5, type: !565, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!565 = !DISubroutineType(types: !566)
!566 = !{!115, !188, !188}
!567 = !DISubprogram(name: "same_name", scope: !568, file: !568, line: 23, type: !569, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!568 = !DIFile(filename: "./lib/same.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!569 = !DISubroutineType(types: !570)
!570 = !{!71, !55, !55}
!571 = !DISubprogram(name: "rename", scope: !135, file: !135, line: 148, type: !572, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!572 = !DISubroutineType(types: !573)
!573 = !{!102, !55, !55}
!574 = !DISubprogram(name: "forget_created", scope: !252, file: !252, line: 3, type: !575, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!575 = !DISubroutineType(types: !576)
!576 = !{null, !188, !188}
!577 = !DISubprogram(name: "rmdir", scope: !318, file: !318, line: 834, type: !562, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!578 = !DISubprogram(name: "dir_name", scope: !265, file: !265, line: 40, type: !206, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!579 = !DISubprogram(name: "force_symlinkat", scope: !580, file: !580, line: 2, type: !581, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!580 = !DIFile(filename: "src/force-link.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!581 = !DISubroutineType(types: !582)
!582 = !{!102, !55, !102, !55, !71, !102}
!583 = !DISubprogram(name: "mkfifo", scope: !293, file: !293, line: 346, type: !294, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!584 = !DISubprogram(name: "areadlink_with_size", scope: !585, file: !585, line: 24, type: !586, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!585 = !DIFile(filename: "./lib/areadlink.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!586 = !DISubroutineType(types: !587)
!587 = !{!115, !55, !188}
!588 = !DISubprogram(name: "utimens", scope: !305, file: !305, line: 22, type: !589, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!589 = !DISubroutineType(types: !590)
!590 = !{!102, !55, !591}
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !543)
!593 = !DISubprogram(name: "set_acl", scope: !325, file: !325, line: 30, type: !594, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!594 = !DISubroutineType(types: !595)
!595 = !{!102, !55, !102, !7}
!596 = !DISubprogram(name: "canonicalize_file_name", scope: !209, file: !209, line: 790, type: !206, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!597 = !DISubprogram(name: "force_linkat", scope: !580, file: !580, line: 1, type: !598, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!598 = !DISubroutineType(types: !599)
!599 = !{!102, !102, !55, !102, !55, !102, !71, !102}
!600 = !DISubprogram(name: "can_write_any_file", scope: !601, file: !601, line: 2, type: !602, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!601 = !DIFile(filename: "./lib/write-any-file.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!602 = !DISubroutineType(types: !603)
!603 = !{!71}
!604 = !DISubprogram(name: "euidaccess", scope: !318, file: !318, line: 292, type: !605, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!605 = !DISubroutineType(types: !606)
!606 = !{!102, !55, !102}
!607 = !DISubprogram(name: "strmode", scope: !608, file: !608, line: 35, type: !609, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!608 = !DIFile(filename: "./lib/filemode.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!609 = !DISubroutineType(types: !610)
!610 = !{null, !7, !115}
!611 = !DISubprogram(name: "yesno", scope: !612, file: !612, line: 22, type: !602, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!612 = !DIFile(filename: "./lib/yesno.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!613 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!614 = !DISubprogram(name: "savedir", scope: !469, file: !469, line: 39, type: !615, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!615 = !DISubroutineType(types: !616)
!616 = !{!115, !55, !468}
!617 = !DISubprogram(name: "open_safer", scope: !618, file: !618, line: 22, type: !619, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!618 = !DIFile(filename: "./lib/fcntl-safer.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!619 = !DISubroutineType(types: !620)
!620 = !{!102, !55, !102, null}
!621 = !DISubprogram(name: "getpagesize", scope: !318, file: !318, line: 976, type: !622, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!622 = !DISubroutineType(types: !623)
!623 = !{!102}
!624 = !DISubprogram(name: "fdadvise", scope: !476, file: !476, line: 71, type: !625, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!625 = !DISubroutineType(types: !626)
!626 = !{null, !102, !162, !162, !475}
!627 = !DISubprogram(name: "buffer_lcm", scope: !628, file: !628, line: 2, type: !629, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!628 = !DIFile(filename: "./lib/buffer-lcm.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!629 = !DISubroutineType(types: !630)
!630 = !{!188, !188, !188, !188}
!631 = !DISubprogram(name: "ftruncate", scope: !318, file: !318, line: 1014, type: !632, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!632 = !DISubroutineType(types: !633)
!633 = !{!102, !102, !162}
!634 = !DISubprogram(name: "fdutimens", scope: !305, file: !305, line: 21, type: !635, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!635 = !DISubroutineType(types: !636)
!636 = !{!102, !102, !55, !591}
!637 = !DISubprogram(name: "close", scope: !318, file: !318, line: 353, type: !638, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!638 = !DISubroutineType(types: !639)
!639 = !{!102, !102}
!640 = !DISubprogram(name: "ioctl", scope: !641, file: !641, line: 41, type: !642, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!641 = !DIFile(filename: "/usr/include/sys/ioctl.h", directory: "")
!642 = !DISubroutineType(types: !643)
!643 = !{!102, !102, !188, null}
!644 = !DISubprogram(name: "extent_scan_init", scope: !645, file: !645, line: 61, type: !646, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!645 = !DIFile(filename: "src/extent-scan.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!646 = !DISubroutineType(types: !647)
!647 = !{null, !102, !648}
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extent_scan", file: !645, line: 36, size: 384, elements: !650)
!650 = !{!651, !652, !654, !655, !656, !657, !658}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !649, file: !645, line: 39, baseType: !102, size: 32)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "scan_start", scope: !649, file: !645, line: 42, baseType: !653, size: 64, offset: 64)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !135, line: 63, baseType: !161)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "fm_flags", scope: !649, file: !645, line: 45, baseType: !7, size: 32, offset: 128)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "ei_count", scope: !649, file: !645, line: 48, baseType: !186, size: 64, offset: 192)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "initial_scan_failed", scope: !649, file: !645, line: 52, baseType: !71, size: 8, offset: 256)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "hit_final_extent", scope: !649, file: !645, line: 55, baseType: !71, size: 8, offset: 264)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "ext_info", scope: !649, file: !645, line: 58, baseType: !659, size: 64, offset: 320)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extent_info", file: !645, line: 23, size: 192, elements: !661)
!661 = !{!662, !663, !664}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "ext_logical", scope: !660, file: !645, line: 26, baseType: !653, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "ext_length", scope: !660, file: !645, line: 29, baseType: !653, size: 64, offset: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "ext_flags", scope: !660, file: !645, line: 32, baseType: !7, size: 32, offset: 128)
!665 = !DISubprogram(name: "extent_scan_read", scope: !645, file: !645, line: 63, type: !666, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!666 = !DISubroutineType(types: !667)
!667 = !{!71, !648}
!668 = !DISubprogram(name: "lseek", scope: !318, file: !318, line: 334, type: !669, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!669 = !DISubroutineType(types: !670)
!670 = !{!162, !102, !162, !102}
!671 = !DISubprogram(name: "rpl_calloc", scope: !672, file: !672, line: 688, type: !673, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!672 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!673 = !DISubroutineType(types: !674)
!674 = !{!184, !188, !188}
!675 = !DISubprogram(name: "full_write", scope: !676, file: !676, line: 29, type: !677, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!676 = !DIFile(filename: "./lib/full-write.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!677 = !DISubroutineType(types: !678)
!678 = !{!188, !102, !230, !188}
!679 = !DISubprogram(name: "fallocate", scope: !680, file: !680, line: 413, type: !681, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!680 = !DIFile(filename: "/usr/include/bits/fcntl-linux.h", directory: "")
!681 = !DISubroutineType(types: !682)
!682 = !{!102, !102, !102, !162, !162}
!683 = !DISubprogram(name: "fchmod", scope: !293, file: !293, line: 293, type: !684, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!684 = !DISubroutineType(types: !685)
!685 = !{!102, !102, !7}
!686 = !DISubprogram(name: "lutimens", scope: !305, file: !305, line: 23, type: !589, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!687 = !DISubprogram(name: "qset_acl", scope: !325, file: !325, line: 29, type: !594, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!688 = !DISubprogram(name: "fchown", scope: !318, file: !318, line: 478, type: !689, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!689 = !DISubroutineType(types: !690)
!690 = !{!102, !102, !7, !7}
!691 = !DISubprogram(name: "attr_copy_fd", scope: !692, file: !692, line: 30, type: !693, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!692 = !DIFile(filename: "/usr/include/attr/libattr.h", directory: "")
!693 = !DISubroutineType(types: !694)
!694 = !{!102, !55, !102, !55, !102, !695, !698}
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DISubroutineType(types: !697)
!697 = !{!102, !55, !698}
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "error_context", file: !700, line: 25, size: 192, elements: !701)
!700 = !DIFile(filename: "/usr/include/attr/error_context.h", directory: "")
!701 = !{!702, !706, !710}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !699, file: !700, line: 27, baseType: !703, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DISubroutineType(types: !705)
!705 = !{null, !698, !55, null}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "quote", scope: !699, file: !700, line: 30, baseType: !707, size: 64, offset: 64)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DISubroutineType(types: !709)
!709 = !{!55, !698, !55}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "quote_free", scope: !699, file: !700, line: 33, baseType: !711, size: 64, offset: 128)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DISubroutineType(types: !713)
!713 = !{null, !698, !55}
!714 = !DISubprogram(name: "attr_copy_file", scope: !692, file: !692, line: 27, type: !715, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!715 = !DISubroutineType(types: !716)
!716 = !{!102, !55, !55, !695, !698}
!717 = !DISubprogram(name: "verror", scope: !718, file: !718, line: 34, type: !719, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!718 = !DIFile(filename: "./lib/verror.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!719 = !DISubroutineType(types: !720)
!720 = !{null, !102, !102, !55, !721}
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !462, line: 657, size: 192, elements: !723)
!723 = !{!724, !725, !726, !727}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !722, file: !462, line: 657, baseType: !7, size: 32)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !722, file: !462, line: 657, baseType: !7, size: 32, offset: 32)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !722, file: !462, line: 657, baseType: !184, size: 64, offset: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !722, file: !462, line: 657, baseType: !184, size: 64, offset: 128)
!728 = !DISubprogram(name: "attr_copy_check_permissions", scope: !692, file: !692, line: 35, type: !696, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!729 = !{!730, !459, !735, !737, !747, !749}
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(name: "mask", scope: !732, file: !462, line: 3087, type: !66, isLocal: true, isDefinition: true)
!732 = distinct !DISubprogram(name: "cached_umask", scope: !462, file: !462, line: 3085, type: !733, scopeLine: 3086, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !461, retainedNodes: !133)
!733 = !DISubroutineType(types: !734)
!734 = !{!66}
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(name: "top_level_dst_name", scope: !461, file: !462, line: 148, type: !55, isLocal: true, isDefinition: true)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(name: "zeros", scope: !739, file: !462, line: 385, type: !115, isLocal: true, isDefinition: true)
!739 = distinct !DISubprogram(name: "write_zeros", scope: !462, file: !462, line: 383, type: !740, scopeLine: 384, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !461, retainedNodes: !742)
!740 = !DISubroutineType(types: !741)
!741 = !{!71, !102, !653}
!742 = !{!743, !744, !745}
!743 = !DILocalVariable(name: "fd", arg: 1, scope: !739, file: !462, line: 383, type: !102)
!744 = !DILocalVariable(name: "n_bytes", arg: 2, scope: !739, file: !462, line: 383, type: !653)
!745 = !DILocalVariable(name: "n", scope: !746, file: !462, line: 404, type: !186)
!746 = distinct !DILexicalBlock(scope: !739, file: !462, line: 403, column: 5)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(name: "nz", scope: !739, file: !462, line: 386, type: !186, isLocal: true, isDefinition: true)
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(name: "fallback", scope: !739, file: !462, line: 393, type: !751, isLocal: true, isDefinition: true)
!751 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 8192, elements: !752)
!752 = !{!753}
!753 = !DISubrange(count: 1024)
!754 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709421568, DW_OP_mul, DW_OP_constu, 131072, DW_OP_plus, DW_OP_stack_value))
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(name: "src_to_dest", scope: !757, file: !758, line: 45, type: !105, isLocal: true, isDefinition: true)
!757 = distinct !DICompileUnit(language: DW_LANG_C99, file: !758, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !133, retainedTypes: !759, globals: !786, splitDebugInlining: false, nameTableKind: None)
!758 = !DIFile(filename: "src/cp-hash.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!759 = !{!760, !763, !286, !257, !766, !184, !767, !115, !768, !780, !259, !783}
!760 = !DISubprogram(name: "hash_delete", scope: !107, file: !107, line: 104, type: !761, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!761 = !DISubroutineType(types: !762)
!762 = !{!184, !495, !230}
!763 = !DISubprogram(name: "hash_lookup", scope: !107, file: !107, line: 78, type: !764, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!764 = !DISubroutineType(types: !765)
!765 = !{!184, !525, !230}
!766 = !DISubprogram(name: "hash_insert", scope: !107, file: !107, line: 100, type: !761, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!767 = !DISubprogram(name: "xalloc_die", scope: !258, file: !258, line: 51, type: !213, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !133)
!768 = !DISubprogram(name: "hash_initialize", scope: !107, file: !107, line: 89, type: !769, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!769 = !DISubroutineType(types: !770)
!770 = !{!495, !188, !771, !506, !509, !512}
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !773)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !107, line: 53, size: 160, elements: !774)
!774 = !{!775, !776, !777, !778, !779}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !773, file: !107, line: 58, baseType: !501, size: 32)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !773, file: !107, line: 59, baseType: !501, size: 32, offset: 32)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !773, file: !107, line: 60, baseType: !501, size: 32, offset: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !773, file: !107, line: 61, baseType: !501, size: 32, offset: 96)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !773, file: !107, line: 62, baseType: !71, size: 8, offset: 128)
!780 = !DISubprogram(name: "hash_free", scope: !107, file: !107, line: 96, type: !781, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!781 = !DISubroutineType(types: !782)
!782 = !{null, !495}
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !784, line: 102, baseType: !785)
!784 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !69, line: 73, baseType: !188)
!786 = !{!755}
!787 = !DIGlobalVariableExpression(var: !788, expr: !DIExpression())
!788 = distinct !DIGlobalVariable(name: "simple_pattern", scope: !789, file: !790, line: 38, type: !819, isLocal: true, isDefinition: true)
!789 = distinct !DICompileUnit(language: DW_LANG_C99, file: !790, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !791, retainedTypes: !798, globals: !818, splitDebugInlining: false, nameTableKind: None)
!790 = !DIFile(filename: "src/force-link.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!791 = !{!792, !795}
!792 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !790, line: 39, baseType: !7, size: 32, elements: !793)
!793 = !{!794}
!794 = !DIEnumerator(name: "x_suffix_len", value: 6, isUnsigned: true)
!795 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !790, line: 44, baseType: !7, size: 32, elements: !796)
!796 = !{!797}
!797 = !DIEnumerator(name: "smallsize", value: 256, isUnsigned: true)
!798 = !{!799, !802, !809, !812, !259, !815, !273}
!799 = !DISubprogram(name: "linkat", scope: !318, file: !318, line: 795, type: !800, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!800 = !DISubroutineType(types: !801)
!801 = !{!102, !102, !55, !102, !55, !102}
!802 = !DISubprogram(name: "try_tempname_len", scope: !803, file: !803, line: 62, type: !804, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!803 = !DIFile(filename: "./lib/tempname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!804 = !DISubroutineType(types: !805)
!805 = !{!102, !115, !102, !184, !806, !188}
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DISubroutineType(types: !808)
!808 = !{!102, !115, !184}
!809 = !DISubprogram(name: "renameat", scope: !135, file: !135, line: 152, type: !810, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!810 = !DISubroutineType(types: !811)
!811 = !{!102, !102, !55, !102, !55}
!812 = !DISubprogram(name: "unlinkat", scope: !318, file: !318, line: 829, type: !813, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!813 = !DISubroutineType(types: !814)
!814 = !{!102, !102, !55, !102}
!815 = !DISubprogram(name: "symlinkat", scope: !318, file: !318, line: 815, type: !816, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!816 = !DISubroutineType(types: !817)
!817 = !{!102, !55, !102, !55}
!818 = !{!787}
!819 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 72, elements: !820)
!820 = !{!821}
!821 = !DISubrange(count: 9)
!822 = !DIGlobalVariableExpression(var: !823, expr: !DIExpression())
!823 = distinct !DIGlobalVariable(name: "Version", scope: !824, file: !825, line: 2, type: !55, isLocal: false, isDefinition: true)
!824 = distinct !DICompileUnit(language: DW_LANG_C99, file: !825, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !133, globals: !826, splitDebugInlining: false, nameTableKind: None)
!825 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!826 = !{!822}
!827 = !DIGlobalVariableExpression(var: !828, expr: !DIExpression())
!828 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !829, file: !830, line: 67, type: !875, isLocal: false, isDefinition: true)
!829 = distinct !DICompileUnit(language: DW_LANG_C99, file: !830, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !831, retainedTypes: !832, globals: !874, splitDebugInlining: false, nameTableKind: None)
!830 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!831 = !{!37}
!832 = !{!184, !55, !129, !489, !833, !232, !836, !247, !871, !613}
!833 = !DISubprogram(name: "quote_n", scope: !248, file: !248, line: 40, type: !834, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!834 = !DISubroutineType(types: !835)
!835 = !{!55, !102, !55}
!836 = !DISubprogram(name: "fputs_unlocked", scope: !135, file: !135, line: 662, type: !837, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!837 = !DISubroutineType(types: !838)
!838 = !{!102, !55, !839}
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !140, line: 49, size: 1728, elements: !841)
!841 = !{!842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !840, file: !140, line: 51, baseType: !102, size: 32)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !840, file: !140, line: 54, baseType: !115, size: 64, offset: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !840, file: !140, line: 55, baseType: !115, size: 64, offset: 128)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !840, file: !140, line: 56, baseType: !115, size: 64, offset: 192)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !840, file: !140, line: 57, baseType: !115, size: 64, offset: 256)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !840, file: !140, line: 58, baseType: !115, size: 64, offset: 320)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !840, file: !140, line: 59, baseType: !115, size: 64, offset: 384)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !840, file: !140, line: 60, baseType: !115, size: 64, offset: 448)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !840, file: !140, line: 61, baseType: !115, size: 64, offset: 512)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !840, file: !140, line: 64, baseType: !115, size: 64, offset: 576)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !840, file: !140, line: 65, baseType: !115, size: 64, offset: 640)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !840, file: !140, line: 66, baseType: !115, size: 64, offset: 704)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !840, file: !140, line: 68, baseType: !155, size: 64, offset: 768)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !840, file: !140, line: 70, baseType: !839, size: 64, offset: 832)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !840, file: !140, line: 72, baseType: !102, size: 32, offset: 896)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !840, file: !140, line: 73, baseType: !102, size: 32, offset: 928)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !840, file: !140, line: 74, baseType: !161, size: 64, offset: 960)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !840, file: !140, line: 77, baseType: !164, size: 16, offset: 1024)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !840, file: !140, line: 78, baseType: !166, size: 8, offset: 1040)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !840, file: !140, line: 79, baseType: !168, size: 8, offset: 1048)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !840, file: !140, line: 81, baseType: !172, size: 64, offset: 1088)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !840, file: !140, line: 89, baseType: !175, size: 64, offset: 1152)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !840, file: !140, line: 91, baseType: !177, size: 64, offset: 1216)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !840, file: !140, line: 92, baseType: !180, size: 64, offset: 1280)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !840, file: !140, line: 93, baseType: !839, size: 64, offset: 1344)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !840, file: !140, line: 94, baseType: !184, size: 64, offset: 1408)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !840, file: !140, line: 95, baseType: !186, size: 64, offset: 1472)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !840, file: !140, line: 96, baseType: !102, size: 32, offset: 1536)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !840, file: !140, line: 98, baseType: !191, size: 160, offset: 1568)
!871 = !DISubprogram(name: "usage", scope: !830, file: !830, line: 56, type: !872, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!872 = !DISubroutineType(types: !873)
!873 = !{null, !102}
!874 = !{!827}
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !876, line: 61, baseType: !212)
!876 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!877 = !DIGlobalVariableExpression(var: !878, expr: !DIExpression())
!878 = distinct !DIGlobalVariable(name: "simple_backup_suffix", scope: !879, file: !880, line: 82, type: !55, isLocal: false, isDefinition: true)
!879 = distinct !DICompileUnit(language: DW_LANG_C99, file: !880, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !881, retainedTypes: !942, globals: !976, splitDebugInlining: false, nameTableKind: None)
!880 = !DIFile(filename: "lib/backupfile.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!881 = !{!5, !882, !912, !918}
!882 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !883, file: !880, line: 327, baseType: !7, size: 32, elements: !910)
!883 = distinct !DISubprogram(name: "backupfile_internal", scope: !880, file: !880, line: 314, type: !884, scopeLine: 316, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !879, retainedNodes: !886)
!884 = !DISubroutineType(types: !885)
!885 = !{!115, !102, !55, !5, !71}
!886 = !{!887, !888, !889, !890, !891, !893, !894, !895, !896, !899, !900, !905, !906, !907, !909}
!887 = !DILocalVariable(name: "dir_fd", arg: 1, scope: !883, file: !880, line: 314, type: !102)
!888 = !DILocalVariable(name: "file", arg: 2, scope: !883, file: !880, line: 314, type: !55)
!889 = !DILocalVariable(name: "backup_type", arg: 3, scope: !883, file: !880, line: 315, type: !5)
!890 = !DILocalVariable(name: "rename", arg: 4, scope: !883, file: !880, line: 315, type: !71)
!891 = !DILocalVariable(name: "base_offset", scope: !883, file: !880, line: 317, type: !892)
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !187, line: 35, baseType: !162)
!893 = !DILocalVariable(name: "filelen", scope: !883, file: !880, line: 318, type: !186)
!894 = !DILocalVariable(name: "simple_backup_suffix_size", scope: !883, file: !880, line: 325, type: !186)
!895 = !DILocalVariable(name: "backup_suffix_size_guess", scope: !883, file: !880, line: 326, type: !186)
!896 = !DILocalVariable(name: "ssize", scope: !883, file: !880, line: 331, type: !897)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !67, line: 108, baseType: !898)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !69, line: 193, baseType: !162)
!899 = !DILocalVariable(name: "s", scope: !883, file: !880, line: 332, type: !115)
!900 = !DILocalVariable(name: "dirp", scope: !883, file: !880, line: 336, type: !901)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !903, line: 127, baseType: !904)
!903 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!904 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !903, line: 127, flags: DIFlagFwdDecl)
!905 = !DILocalVariable(name: "sdir", scope: !883, file: !880, line: 337, type: !102)
!906 = !DILocalVariable(name: "base_max", scope: !883, file: !880, line: 338, type: !186)
!907 = !DILocalVariable(name: "flags", scope: !908, file: !880, line: 380, type: !7)
!908 = distinct !DILexicalBlock(scope: !883, file: !880, line: 340, column: 5)
!909 = !DILocalVariable(name: "e", scope: !908, file: !880, line: 383, type: !102)
!910 = !{!911}
!911 = !DIEnumerator(name: "GUESS", value: 9, isUnsigned: true)
!912 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "numbered_backup_result", file: !880, line: 172, baseType: !7, size: 32, elements: !913)
!913 = !{!914, !915, !916, !917}
!914 = !DIEnumerator(name: "BACKUP_IS_SAME_LENGTH", value: 0, isUnsigned: true)
!915 = !DIEnumerator(name: "BACKUP_IS_LONGER", value: 1, isUnsigned: true)
!916 = !DIEnumerator(name: "BACKUP_IS_NEW", value: 2, isUnsigned: true)
!917 = !DIEnumerator(name: "BACKUP_NOMEM", value: 3, isUnsigned: true)
!918 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !919, line: 24, baseType: !7, size: 32, elements: !920)
!919 = !DIFile(filename: "/usr/include/bits/confname.h", directory: "")
!920 = !{!921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941}
!921 = !DIEnumerator(name: "_PC_LINK_MAX", value: 0, isUnsigned: true)
!922 = !DIEnumerator(name: "_PC_MAX_CANON", value: 1, isUnsigned: true)
!923 = !DIEnumerator(name: "_PC_MAX_INPUT", value: 2, isUnsigned: true)
!924 = !DIEnumerator(name: "_PC_NAME_MAX", value: 3, isUnsigned: true)
!925 = !DIEnumerator(name: "_PC_PATH_MAX", value: 4, isUnsigned: true)
!926 = !DIEnumerator(name: "_PC_PIPE_BUF", value: 5, isUnsigned: true)
!927 = !DIEnumerator(name: "_PC_CHOWN_RESTRICTED", value: 6, isUnsigned: true)
!928 = !DIEnumerator(name: "_PC_NO_TRUNC", value: 7, isUnsigned: true)
!929 = !DIEnumerator(name: "_PC_VDISABLE", value: 8, isUnsigned: true)
!930 = !DIEnumerator(name: "_PC_SYNC_IO", value: 9, isUnsigned: true)
!931 = !DIEnumerator(name: "_PC_ASYNC_IO", value: 10, isUnsigned: true)
!932 = !DIEnumerator(name: "_PC_PRIO_IO", value: 11, isUnsigned: true)
!933 = !DIEnumerator(name: "_PC_SOCK_MAXBUF", value: 12, isUnsigned: true)
!934 = !DIEnumerator(name: "_PC_FILESIZEBITS", value: 13, isUnsigned: true)
!935 = !DIEnumerator(name: "_PC_REC_INCR_XFER_SIZE", value: 14, isUnsigned: true)
!936 = !DIEnumerator(name: "_PC_REC_MAX_XFER_SIZE", value: 15, isUnsigned: true)
!937 = !DIEnumerator(name: "_PC_REC_MIN_XFER_SIZE", value: 16, isUnsigned: true)
!938 = !DIEnumerator(name: "_PC_REC_XFER_ALIGN", value: 17, isUnsigned: true)
!939 = !DIEnumerator(name: "_PC_ALLOC_SIZE_MIN", value: 18, isUnsigned: true)
!940 = !DIEnumerator(name: "_PC_SYMLINK_MAX", value: 19, isUnsigned: true)
!941 = !DIEnumerator(name: "_PC_2_SYMLINKS", value: 20, isUnsigned: true)
!942 = !{!256, !273, !943, !259, !517, !947, !948, !951, !955, !184, !7, !186, !970, !973}
!943 = !DISubprogram(name: "closedir", scope: !903, file: !903, line: 149, type: !944, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!944 = !DISubroutineType(types: !945)
!945 = !{!102, !946}
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!947 = !DISubprogram(name: "base_len", scope: !265, file: !265, line: 44, type: !284, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!948 = !DISubprogram(name: "rewinddir", scope: !903, file: !903, line: 209, type: !949, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!949 = !DISubroutineType(types: !950)
!950 = !{null, !946}
!951 = !DISubprogram(name: "opendirat", scope: !952, file: !952, line: 2, type: !953, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!952 = !DIFile(filename: "./lib/opendirat.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!953 = !DISubroutineType(types: !954)
!954 = !{!946, !102, !55, !102, !228}
!955 = !DISubprogram(name: "readdir", scope: !903, file: !903, line: 162, type: !956, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!956 = !DISubroutineType(types: !957)
!957 = !{!958, !946}
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !960, line: 22, size: 2240, elements: !961)
!960 = !DIFile(filename: "/usr/include/bits/dirent.h", directory: "")
!961 = !{!962, !963, !964, !965, !966}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !959, file: !960, line: 25, baseType: !382, size: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !959, file: !960, line: 26, baseType: !161, size: 64, offset: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !959, file: !960, line: 31, baseType: !164, size: 16, offset: 128)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !959, file: !960, line: 32, baseType: !613, size: 8, offset: 144)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !959, file: !960, line: 33, baseType: !967, size: 2048, offset: 152)
!967 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 2048, elements: !968)
!968 = !{!969}
!969 = !DISubrange(count: 256)
!970 = !DISubprogram(name: "pathconf", scope: !318, file: !318, line: 612, type: !971, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!971 = !DISubroutineType(types: !972)
!972 = !{!162, !55, !102}
!973 = !DISubprogram(name: "fpathconf", scope: !318, file: !318, line: 616, type: !974, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!974 = !DISubroutineType(types: !975)
!975 = !{!162, !102, !102}
!976 = !{!877}
!977 = !DIGlobalVariableExpression(var: !978, expr: !DIExpression())
!978 = distinct !DIGlobalVariable(name: "backup_args", scope: !979, file: !980, line: 42, type: !990, isLocal: true, isDefinition: true)
!979 = distinct !DICompileUnit(language: DW_LANG_C99, file: !980, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !981, retainedTypes: !982, globals: !985, splitDebugInlining: false, nameTableKind: None)
!980 = !DIFile(filename: "lib/backup-find.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!981 = !{!5}
!982 = !{!983, !767, !230, !256}
!983 = !DISubprogram(name: "backupfile_internal", scope: !984, file: !984, line: 3, type: !884, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!984 = !DIFile(filename: "./lib/backup-internal.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!985 = !{!986, !977}
!986 = !DIGlobalVariableExpression(var: !987, expr: !DIExpression())
!987 = distinct !DIGlobalVariable(name: "backup_types", scope: !979, file: !980, line: 53, type: !988, isLocal: true, isDefinition: true)
!988 = !DICompositeType(tag: DW_TAG_array_type, baseType: !989, size: 256, elements: !360)
!989 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!990 = !DICompositeType(tag: DW_TAG_array_type, baseType: !342, size: 576, elements: !820)
!991 = !DIGlobalVariableExpression(var: !992, expr: !DIExpression())
!992 = distinct !DIGlobalVariable(name: "file_name", scope: !993, file: !994, line: 37, type: !55, isLocal: true, isDefinition: true)
!993 = distinct !DICompileUnit(language: DW_LANG_C99, file: !994, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !133, retainedTypes: !995, globals: !1044, splitDebugInlining: false, nameTableKind: None)
!994 = !DIFile(filename: "lib/closein.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!995 = !{!996, !1032, !1036, !1039, !129, !1041, !232, !1042}
!996 = !DISubprogram(name: "freadahead", scope: !997, file: !997, line: 41, type: !998, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !133)
!997 = !DIFile(filename: "./lib/freadahead.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!998 = !DISubroutineType(types: !999)
!999 = !{!188, !1000}
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !140, line: 49, size: 1728, elements: !1002)
!1002 = !{!1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1001, file: !140, line: 51, baseType: !102, size: 32)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1001, file: !140, line: 54, baseType: !115, size: 64, offset: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1001, file: !140, line: 55, baseType: !115, size: 64, offset: 128)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1001, file: !140, line: 56, baseType: !115, size: 64, offset: 192)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1001, file: !140, line: 57, baseType: !115, size: 64, offset: 256)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1001, file: !140, line: 58, baseType: !115, size: 64, offset: 320)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1001, file: !140, line: 59, baseType: !115, size: 64, offset: 384)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1001, file: !140, line: 60, baseType: !115, size: 64, offset: 448)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1001, file: !140, line: 61, baseType: !115, size: 64, offset: 512)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1001, file: !140, line: 64, baseType: !115, size: 64, offset: 576)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1001, file: !140, line: 65, baseType: !115, size: 64, offset: 640)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1001, file: !140, line: 66, baseType: !115, size: 64, offset: 704)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1001, file: !140, line: 68, baseType: !155, size: 64, offset: 768)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1001, file: !140, line: 70, baseType: !1000, size: 64, offset: 832)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1001, file: !140, line: 72, baseType: !102, size: 32, offset: 896)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1001, file: !140, line: 73, baseType: !102, size: 32, offset: 928)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1001, file: !140, line: 74, baseType: !161, size: 64, offset: 960)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1001, file: !140, line: 77, baseType: !164, size: 16, offset: 1024)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1001, file: !140, line: 78, baseType: !166, size: 8, offset: 1040)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1001, file: !140, line: 79, baseType: !168, size: 8, offset: 1048)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1001, file: !140, line: 81, baseType: !172, size: 64, offset: 1088)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1001, file: !140, line: 89, baseType: !175, size: 64, offset: 1152)
