source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon.12 }
%struct.__sigset_t = type { [16 x i64] }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.bin_tree_storage_t = type { %struct.bin_tree_storage_t*, [15 x %struct.bin_tree_t] }
%struct.bin_tree_t = type { %struct.bin_tree_t*, %struct.bin_tree_t*, %struct.bin_tree_t*, %struct.bin_tree_t*, %struct.bin_tree_t*, %struct.re_token_t, i64 }
%struct.bracket_elem_t = type { i32, %union.anon.1 }
%struct.buffer_record = type { i64, i64, i64, i64, i64, i8*, %struct.line*, %struct.line*, %struct.buffer_record* }
%struct.control = type { i64, i64, i64, i32, i8, i8, i8, %struct.re_pattern_buffer }
%struct.cstring = type { i64, i8* }
%struct.infomap = type { i8*, i8* }
%struct.line = type { i64, i64, i64, [80 x %struct.cstring], %struct.line* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "caught_signals", scope: !2, file: !3, line: 183, type: !574, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !192, globals: !431, nameTableKind: None)
!3 = !DIFile(filename: "src/csplit.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !138, !152, !156, !171, !179}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !6, file: !3, line: 1443, baseType: !65, size: 32, elements: !136)
!6 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 1338, type: !7, scopeLine: 1339, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !13)
!7 = !DISubroutineType(types: !8)
!8 = !{!9, !9, !10}
!9 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!13 = !{!14, !15, !16, !17, !21, !22, !24}
!14 = !DILocalVariable(name: "argc", arg: 1, scope: !6, file: !3, line: 1338, type: !9)
!15 = !DILocalVariable(name: "argv", arg: 2, scope: !6, file: !3, line: 1338, type: !10)
!16 = !DILocalVariable(name: "optc", scope: !6, file: !3, line: 1340, type: !9)
!17 = !DILocalVariable(name: "prefix_len", scope: !6, file: !3, line: 1408, type: !18)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !19, line: 46, baseType: !20)
!19 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!20 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!21 = !DILocalVariable(name: "max_digit_string_len", scope: !6, file: !3, line: 1409, type: !18)
!22 = !DILocalVariable(name: "i", scope: !23, file: !3, line: 1422, type: !9)
!23 = distinct !DILexicalBlock(scope: !6, file: !3, line: 1421, column: 3)
!24 = !DILocalVariable(name: "act", scope: !23, file: !3, line: 1445, type: !25)
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !26, line: 27, size: 1216, elements: !27)
!26 = !DIFile(filename: "/usr/include/bits/sigaction.h", directory: "")
!27 = !{!28, !122, !131, !132}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !25, file: !26, line: 38, baseType: !29, size: 64)
!29 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !25, file: !26, line: 31, size: 64, elements: !30)
!30 = !{!31, !37}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !29, file: !26, line: 34, baseType: !32, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !33, line: 72, baseType: !34)
!33 = !DIFile(filename: "/usr/include/signal.h", directory: "")
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DISubroutineType(types: !36)
!36 = !{null, !9}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !29, file: !26, line: 36, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DISubroutineType(types: !40)
!40 = !{null, !9, !41, !78}
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !43, line: 124, baseType: !44)
!43 = !DIFile(filename: "/usr/include/bits/types/siginfo_t.h", directory: "")
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !43, line: 36, size: 1024, elements: !45)
!45 = !{!46, !47, !48, !49, !50}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !44, file: !43, line: 38, baseType: !9, size: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !44, file: !43, line: 40, baseType: !9, size: 32, offset: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !44, file: !43, line: 42, baseType: !9, size: 32, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !44, file: !43, line: 48, baseType: !9, size: 32, offset: 96)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !44, file: !43, line: 123, baseType: !51, size: 896, offset: 128)
!51 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !44, file: !43, line: 51, size: 896, elements: !52)
!52 = !{!53, !57, !66, !79, !85, !95, !111, !116}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !51, file: !43, line: 53, baseType: !54, size: 896)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 896, elements: !55)
!55 = !{!56}
!56 = !DISubrange(count: 28)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !51, file: !43, line: 60, baseType: !58, size: 64)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !51, file: !43, line: 56, size: 64, elements: !59)
!59 = !{!60, !63}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !58, file: !43, line: 58, baseType: !61, size: 32)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !62, line: 154, baseType: !9)
!62 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!63 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !58, file: !43, line: 59, baseType: !64, size: 32, offset: 32)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !62, line: 146, baseType: !65)
!65 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !51, file: !43, line: 68, baseType: !67, size: 128)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !51, file: !43, line: 63, size: 128, elements: !68)
!68 = !{!69, !70, !71}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !67, file: !43, line: 65, baseType: !9, size: 32)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !67, file: !43, line: 66, baseType: !9, size: 32, offset: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !67, file: !43, line: 67, baseType: !72, size: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigval_t", file: !73, line: 30, baseType: !74)
!73 = !DIFile(filename: "/usr/include/bits/types/__sigval_t.h", directory: "")
!74 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !73, line: 24, size: 64, elements: !75)
!75 = !{!76, !77}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !74, file: !73, line: 26, baseType: !9, size: 32)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !74, file: !73, line: 27, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !51, file: !43, line: 76, baseType: !80, size: 128)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !51, file: !43, line: 71, size: 128, elements: !81)
!81 = !{!82, !83, !84}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !80, file: !43, line: 73, baseType: !61, size: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !80, file: !43, line: 74, baseType: !64, size: 32, offset: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !80, file: !43, line: 75, baseType: !72, size: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !51, file: !43, line: 86, baseType: !86, size: 256)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !51, file: !43, line: 79, size: 256, elements: !87)
!87 = !{!88, !89, !90, !91, !94}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !86, file: !43, line: 81, baseType: !61, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !86, file: !43, line: 82, baseType: !64, size: 32, offset: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !86, file: !43, line: 83, baseType: !9, size: 32, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !86, file: !43, line: 84, baseType: !92, size: 64, offset: 128)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !62, line: 156, baseType: !93)
!93 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !86, file: !43, line: 85, baseType: !92, size: 64, offset: 192)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !51, file: !43, line: 105, baseType: !96, size: 256)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !51, file: !43, line: 89, size: 256, elements: !97)
!97 = !{!98, !99, !101}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !96, file: !43, line: 91, baseType: !78, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_lsb", scope: !96, file: !43, line: 93, baseType: !100, size: 16, offset: 64)
!100 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_bounds", scope: !96, file: !43, line: 104, baseType: !102, size: 128, offset: 128)
!102 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !96, file: !43, line: 94, size: 128, elements: !103)
!103 = !{!104, !109}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_bnd", scope: !102, file: !43, line: 101, baseType: !105, size: 128)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !102, file: !43, line: 97, size: 128, elements: !106)
!106 = !{!107, !108}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_lower", scope: !105, file: !43, line: 99, baseType: !78, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_upper", scope: !105, file: !43, line: 100, baseType: !78, size: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_pkey", scope: !102, file: !43, line: 103, baseType: !110, size: 32)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !62, line: 42, baseType: !65)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !51, file: !43, line: 112, baseType: !112, size: 128)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !51, file: !43, line: 108, size: 128, elements: !113)
!113 = !{!114, !115}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !112, file: !43, line: 110, baseType: !93, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "si_fd", scope: !112, file: !43, line: 111, baseType: !9, size: 32, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !51, file: !43, line: 121, baseType: !117, size: 128)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !51, file: !43, line: 116, size: 128, elements: !118)
!118 = !{!119, !120, !121}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !117, file: !43, line: 118, baseType: !78, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !117, file: !43, line: 119, baseType: !9, size: 32, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !117, file: !43, line: 120, baseType: !65, size: 32, offset: 96)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !25, file: !26, line: 46, baseType: !123, size: 1024, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !124, line: 8, baseType: !125)
!124 = !DIFile(filename: "/usr/include/bits/types/__sigset_t.h", directory: "")
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !124, line: 5, size: 1024, elements: !126)
!126 = !{!127}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !125, file: !124, line: 7, baseType: !128, size: 1024)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 1024, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 16)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !25, file: !26, line: 49, baseType: !9, size: 32, offset: 1088)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !25, file: !26, line: 52, baseType: !133, size: 64, offset: 1152)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{null}
!136 = !{!137}
!137 = !DIEnumerator(name: "nsigs", value: 11, isUnsigned: true)
!138 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !139, line: 32, baseType: !65, size: 32, elements: !140)
!139 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!140 = !{!141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151}
!141 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!142 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!143 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!144 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!145 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!146 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!147 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!148 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!149 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!150 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!151 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!152 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 1227, baseType: !65, size: 32, elements: !153)
!153 = !{!154, !155}
!154 = !DIEnumerator(name: "FLAG_THOUSANDS", value: 1, isUnsigned: true)
!155 = !DIEnumerator(name: "FLAG_ALTERNATIVE", value: 2, isUnsigned: true)
!156 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !157, line: 46, baseType: !65, size: 32, elements: !158)
!157 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!158 = !{!159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170}
!159 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!160 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!161 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!162 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!163 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!164 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!165 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!166 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!167 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!168 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!169 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!170 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!171 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !172, line: 25, baseType: !65, size: 32, elements: !173)
!172 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!173 = !{!174, !175, !176, !177, !178}
!174 = !DIEnumerator(name: "LONGINT_OK", value: 0, isUnsigned: true)
!175 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1, isUnsigned: true)
!176 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2, isUnsigned: true)
!177 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3, isUnsigned: true)
!178 = !DIEnumerator(name: "LONGINT_INVALID", value: 4, isUnsigned: true)
!179 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !181, file: !180, line: 186, baseType: !65, size: 32, elements: !190)
!180 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!181 = distinct !DISubprogram(name: "x2nrealloc", scope: !180, file: !180, line: 174, type: !182, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !185)
!182 = !DISubroutineType(types: !183)
!183 = !{!78, !78, !184, !18}
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!185 = !{!186, !187, !188, !189}
!186 = !DILocalVariable(name: "p", arg: 1, scope: !181, file: !180, line: 174, type: !78)
!187 = !DILocalVariable(name: "pn", arg: 2, scope: !181, file: !180, line: 174, type: !184)
!188 = !DILocalVariable(name: "s", arg: 3, scope: !181, file: !180, line: 174, type: !18)
!189 = !DILocalVariable(name: "n", scope: !181, file: !180, line: 176, type: !18)
!190 = !{!191}
!191 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!192 = !{!193, !200, !204, !208, !212, !215, !218, !222, !237, !241, !11, !78, !243, !298, !65, !302, !305, !309, !32, !315, !318, !323, !327, !331, !334, !337, !341, !344, !347, !9, !272, !351, !355, !20, !359, !386, !18, !390, !393, !396, !397, !412, !415, !419, !197, !424, !377, !427}
!193 = !DISubprogram(name: "dcgettext", scope: !194, file: !194, line: 51, type: !195, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !199)
!194 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!195 = !DISubroutineType(types: !196)
!196 = !{!11, !197, !197, !9}
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!199 = !{}
!200 = !DISubprogram(name: "error", scope: !201, file: !201, line: 52, type: !202, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !199)
!201 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!202 = !DISubroutineType(types: !203)
!203 = !{null, !9, !9, !197, null}
!204 = !DISubprogram(name: "set_program_name", scope: !205, file: !205, line: 37, type: !206, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !199)
!205 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!206 = !DISubroutineType(types: !207)
!207 = !{null, !197}
!208 = !DISubprogram(name: "setlocale", scope: !209, file: !209, line: 122, type: !210, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !199)
!209 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!210 = !DISubroutineType(types: !211)
!211 = !{!11, !9, !197}
!212 = !DISubprogram(name: "bindtextdomain", scope: !194, file: !194, line: 86, type: !213, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !199)
!213 = !DISubroutineType(types: !214)
!214 = !{!11, !197, !197}
!215 = !DISubprogram(name: "textdomain", scope: !194, file: !194, line: 82, type: !216, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !199)
!216 = !DISubroutineType(types: !217)
!217 = !{!11, !197}
!218 = !DISubprogram(name: "atexit", scope: !219, file: !219, line: 595, type: !220, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !199)
!219 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!220 = !DISubroutineType(types: !221)
!221 = !{!9, !133}
!222 = !DISubprogram(name: "getopt_long", scope: !223, file: !223, line: 66, type: !224, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !199)
!223 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!224 = !DISubroutineType(types: !225)
!225 = !{!9, !9, !226, !197, !228, !235}
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !230)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !223, line: 50, size: 256, elements: !231)
!231 = !{!232, !233, !234, !236}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !230, file: !223, line: 52, baseType: !197, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !230, file: !223, line: 55, baseType: !9, size: 32, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !230, file: !223, line: 56, baseType: !235, size: 64, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !230, file: !223, line: 57, baseType: !9, size: 32, offset: 192)
!237 = !DISubprogram(name: "xdectoimax", scope: !238, file: !238, line: 30, type: !239, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !199)
!238 = !DIFile(filename: "./lib/xdectoint.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!239 = !DISubroutineType(types: !240)
!240 = !{!93, !197, !93, !93, !197, !197, !9}
!241 = !DISubprogram(name: "usage", scope: !242, file: !242, line: 711, type: !35, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !199)
!242 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!243 = !DISubprogram(name: "version_etc", scope: !244, file: !244, line: 69, type: !245, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !199)
!244 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!245 = !DISubroutineType(types: !246)
!246 = !{null, !247, !197, !197, !197, null}
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !249, line: 49, size: 1728, elements: !250)
!249 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!250 = !{!251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !266, !267, !268, !269, !271, !273, !275, !279, !282, !284, !287, !290, !291, !292, !293, !294}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !248, file: !249, line: 51, baseType: !9, size: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !248, file: !249, line: 54, baseType: !11, size: 64, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !248, file: !249, line: 55, baseType: !11, size: 64, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !248, file: !249, line: 56, baseType: !11, size: 64, offset: 192)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !248, file: !249, line: 57, baseType: !11, size: 64, offset: 256)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !248, file: !249, line: 58, baseType: !11, size: 64, offset: 320)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !248, file: !249, line: 59, baseType: !11, size: 64, offset: 384)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !248, file: !249, line: 60, baseType: !11, size: 64, offset: 448)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !248, file: !249, line: 61, baseType: !11, size: 64, offset: 512)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !248, file: !249, line: 64, baseType: !11, size: 64, offset: 576)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !248, file: !249, line: 65, baseType: !11, size: 64, offset: 640)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !248, file: !249, line: 66, baseType: !11, size: 64, offset: 704)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !248, file: !249, line: 68, baseType: !264, size: 64, offset: 768)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !249, line: 36, flags: DIFlagFwdDecl)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !248, file: !249, line: 70, baseType: !247, size: 64, offset: 832)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !248, file: !249, line: 72, baseType: !9, size: 32, offset: 896)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !248, file: !249, line: 73, baseType: !9, size: 32, offset: 928)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !248, file: !249, line: 74, baseType: !270, size: 64, offset: 960)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !62, line: 152, baseType: !93)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !248, file: !249, line: 77, baseType: !272, size: 16, offset: 1024)
!272 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !248, file: !249, line: 78, baseType: !274, size: 8, offset: 1040)
!274 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !248, file: !249, line: 79, baseType: !276, size: 8, offset: 1048)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 8, elements: !277)
!277 = !{!278}
!278 = !DISubrange(count: 1)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !248, file: !249, line: 81, baseType: !280, size: 64, offset: 1088)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !249, line: 43, baseType: null)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !248, file: !249, line: 89, baseType: !283, size: 64, offset: 1152)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !62, line: 153, baseType: !93)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !248, file: !249, line: 91, baseType: !285, size: 64, offset: 1216)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !249, line: 37, flags: DIFlagFwdDecl)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !248, file: !249, line: 92, baseType: !288, size: 64, offset: 1280)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !249, line: 38, flags: DIFlagFwdDecl)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !248, file: !249, line: 93, baseType: !247, size: 64, offset: 1344)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !248, file: !249, line: 94, baseType: !78, size: 64, offset: 1408)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !248, file: !249, line: 95, baseType: !18, size: 64, offset: 1472)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !248, file: !249, line: 96, baseType: !9, size: 32, offset: 1536)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !248, file: !249, line: 98, baseType: !295, size: 160, offset: 1568)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 160, elements: !296)
!296 = !{!297}
!297 = !DISubrange(count: 20)
!298 = !DISubprogram(name: "quote", scope: !299, file: !299, line: 44, type: !300, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !199)
!299 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!300 = !DISubroutineType(types: !301)
!301 = !{!197, !197}
!302 = !DISubprogram(name: "xmalloc", scope: !180, file: !180, line: 53, type: !303, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !199)
!303 = !DISubroutineType(types: !304)
!304 = !{!78, !20}
!305 = !DISubprogram(name: "sigemptyset", scope: !33, file: !33, line: 196, type: !306, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !199)
!306 = !DISubroutineType(types: !307)
!307 = !{!9, !308}
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!309 = !DISubprogram(name: "sigaction", scope: !33, file: !33, line: 240, type: !310, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !199)
!310 = !DISubroutineType(types: !311)
!311 = !{!9, !9, !312, !314}
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!315 = !DISubprogram(name: "sigaddset", scope: !33, file: !33, line: 202, type: !316, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !199)
!316 = !DISubroutineType(types: !317)
!317 = !{!9, !308, !9}
!318 = !DISubprogram(name: "sigismember", scope: !33, file: !33, line: 208, type: !319, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !199)
!319 = !DISubroutineType(types: !320)
!320 = !{!9, !321, !9}
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !125)
!323 = !DISubprogram(name: "close", scope: !324, file: !324, line: 353, type: !325, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !199)
!324 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!325 = !DISubroutineType(types: !326)
!326 = !{!9, !9}
!327 = !DISubprogram(name: "fputs_unlocked", scope: !328, file: !328, line: 662, type: !329, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !199)
!328 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!329 = !DISubroutineType(types: !330)
!330 = !{!9, !197, !247}
!331 = !DISubprogram(name: "sigprocmask", scope: !33, file: !33, line: 229, type: !332, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !199)
!332 = !DISubroutineType(types: !333)
!333 = !{!9, !9, !321, !308}
!334 = !DISubprogram(name: "quotearg_style", scope: !139, file: !139, line: 377, type: !335, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !199)
!335 = !DISubroutineType(types: !336)
!336 = !{!11, !138, !197}
!337 = !DISubprogram(name: "rpl_fclose", scope: !338, file: !338, line: 672, type: !339, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !199)
!338 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!339 = !DISubroutineType(types: !340)
!340 = !{!9, !247}
!341 = !DISubprogram(name: "quotearg_n_style_colon", scope: !139, file: !139, line: 397, type: !342, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !199)
!342 = !DISubroutineType(types: !343)
!343 = !{!11, !9, !138, !197}
!344 = !DISubprogram(name: "unlink", scope: !324, file: !324, line: 825, type: !345, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !199)
!345 = !DISubroutineType(types: !346)
!346 = !{!9, !197}
!347 = !DISubprogram(name: "umaxtostr", scope: !348, file: !348, line: 46, type: !349, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !199)
!348 = !DIFile(filename: "./lib/inttostr.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!349 = !DISubroutineType(types: !350)
!350 = !{!11, !20, !11}
!351 = !DISubprogram(name: "fd_reopen", scope: !352, file: !352, line: 22, type: !353, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !199)
!352 = !DIFile(filename: "./lib/fd-reopen.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!353 = !DISubroutineType(types: !354)
!354 = !{!9, !9, !197, !9, !65}
!355 = !DISubprogram(name: "xstrtoumax", scope: !172, file: !172, line: 48, type: !356, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !199)
!356 = !DISubroutineType(types: !357)
!357 = !{!171, !197, !10, !9, !358, !197}
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!359 = !DISubprogram(name: "rpl_re_compile_pattern", scope: !360, file: !360, line: 538, type: !361, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !199)
!360 = !DIFile(filename: "./lib/regex.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!361 = !DISubroutineType(types: !362)
!362 = !{!197, !197, !20, !363}
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_pattern_buffer", file: !360, line: 413, size: 512, elements: !365)
!365 = !{!366, !369, !371, !372, !374, !375, !378, !379, !380, !381, !382, !383, !384, !385}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !364, file: !360, line: 417, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "re_dfa_t", file: !360, line: 417, flags: DIFlagFwdDecl)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !364, file: !360, line: 420, baseType: !370, size: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "__re_long_size_t", file: !360, line: 49, baseType: !18)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !364, file: !360, line: 423, baseType: !370, size: 64, offset: 128)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "syntax", scope: !364, file: !360, line: 426, baseType: !373, size: 64, offset: 192)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_syntax_t", file: !360, line: 72, baseType: !20)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap", scope: !364, file: !360, line: 431, baseType: !11, size: 64, offset: 256)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "translate", scope: !364, file: !360, line: 437, baseType: !376, size: 64, offset: 320)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "re_nsub", scope: !364, file: !360, line: 440, baseType: !18, size: 64, offset: 384)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_null", scope: !364, file: !360, line: 446, baseType: !65, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "regs_allocated", scope: !364, file: !360, line: 457, baseType: !65, size: 2, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap_accurate", scope: !364, file: !360, line: 461, baseType: !65, size: 1, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "no_sub", scope: !364, file: !360, line: 465, baseType: !65, size: 1, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "not_bol", scope: !364, file: !360, line: 469, baseType: !65, size: 1, offset: 453, flags: DIFlagBitField, extraData: i64 448)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "not_eol", scope: !364, file: !360, line: 472, baseType: !65, size: 1, offset: 454, flags: DIFlagBitField, extraData: i64 448)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "newline_anchor", scope: !364, file: !360, line: 475, baseType: !65, size: 1, offset: 455, flags: DIFlagBitField, extraData: i64 448)
!386 = !DISubprogram(name: "xstrtoimax", scope: !172, file: !172, line: 47, type: !387, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !199)
!387 = !DISubroutineType(types: !388)
!388 = !{!171, !197, !10, !9, !389, !197}
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!390 = !DISubprogram(name: "xrealloc", scope: !180, file: !180, line: 59, type: !391, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !199)
!391 = !DISubroutineType(types: !392)
!392 = !{!78, !78, !20}
!393 = !DISubprogram(name: "signal", scope: !33, file: !33, line: 88, type: !394, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !199)
!394 = !DISubroutineType(types: !395)
!395 = !{!34, !9, !34}
!396 = !DISubprogram(name: "raise", scope: !33, file: !33, line: 123, type: !325, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !199)
!397 = !DISubprogram(name: "rpl_re_search", scope: !360, file: !360, line: 553, type: !398, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !199)
!398 = !DISubroutineType(types: !399)
!399 = !{!93, !363, !197, !93, !93, !93, !400}
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_registers", file: !360, line: 497, size: 192, elements: !402)
!402 = !{!403, !405, !411}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "num_regs", scope: !401, file: !360, line: 499, baseType: !404, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "__re_size_t", file: !360, line: 45, baseType: !18)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !401, file: !360, line: 500, baseType: !406, size: 64, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "regoff_t", file: !360, line: 486, baseType: !408)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !409, line: 108, baseType: !410)
!409 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !62, line: 193, baseType: !93)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !401, file: !360, line: 501, baseType: !406, size: 64, offset: 128)
!412 = !DISubprogram(name: "free", scope: !219, file: !219, line: 565, type: !413, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !199)
!413 = !DISubroutineType(types: !414)
!414 = !{null, !78}
!415 = !DISubprogram(name: "safe_read", scope: !416, file: !416, line: 42, type: !417, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !199)
!416 = !DIFile(filename: "./lib/safe-read.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!417 = !DISubroutineType(types: !418)
!418 = !{!20, !9, !78, !20}
!419 = !DISubprogram(name: "xmemdup", scope: !180, file: !180, line: 62, type: !420, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !199)
!420 = !DISubroutineType(types: !421)
!421 = !{!78, !422, !20}
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!424 = !DISubprogram(name: "fwrite_unlocked", scope: !328, file: !328, line: 675, type: !425, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !199)
!425 = !DISubroutineType(types: !426)
!426 = !{!20, !422, !20, !20, !247}
!427 = !DISubprogram(name: "fopen_safer", scope: !428, file: !428, line: 23, type: !429, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !199)
!428 = !DIFile(filename: "./lib/stdio-safer.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!429 = !DISubroutineType(types: !430)
!430 = !{!247, !197, !197}
!431 = !{!432, !438, !440, !443, !446, !448, !450, !468, !0, !470, !475, !477, !479, !482, !485, !488, !491, !494, !496, !519, !526, !528, !564, !566, !568, !570, !572}
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(name: "sig", scope: !6, file: !3, line: 1423, type: !434, isLocal: true, isDefinition: true)
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !435, size: 352, elements: !436)
!435 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!436 = !{!437}
!437 = !DISubrange(count: 11)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(name: "global_argv", scope: !2, file: !3, line: 161, type: !10, isLocal: true, isDefinition: true)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(name: "suppress_count", scope: !2, file: !3, line: 164, type: !442, isLocal: true, isDefinition: true)
!442 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(name: "remove_files", scope: !2, file: !3, line: 167, type: !445, isLocal: true, isDefinition: true)
!445 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !442)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "elide_empty_files", scope: !2, file: !3, line: 170, type: !442, isLocal: true, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "suppress_matched", scope: !2, file: !3, line: 173, type: !442, isLocal: true, isDefinition: true)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(name: "controls", scope: !2, file: !3, line: 177, type: !452, isLocal: true, isDefinition: true)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control", file: !3, line: 51, size: 768, elements: !454)
!454 = !{!455, !459, !462, !463, !464, !465, !466, !467}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !453, file: !3, line: 53, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !457, line: 101, baseType: !458)
!457 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !62, line: 72, baseType: !93)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "lines_required", scope: !453, file: !3, line: 54, baseType: !460, size: 64, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !457, line: 102, baseType: !461)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !62, line: 73, baseType: !20)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !453, file: !3, line: 55, baseType: !460, size: 64, offset: 128)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "argnum", scope: !453, file: !3, line: 56, baseType: !9, size: 32, offset: 192)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_forever", scope: !453, file: !3, line: 57, baseType: !442, size: 8, offset: 224)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !453, file: !3, line: 58, baseType: !442, size: 8, offset: 232)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "regexpr", scope: !453, file: !3, line: 59, baseType: !442, size: 8, offset: 240)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "re_compiled", scope: !453, file: !3, line: 60, baseType: !364, size: 512, offset: 256)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(name: "control_used", scope: !2, file: !3, line: 180, type: !18, isLocal: true, isDefinition: true)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(name: "output_stream", scope: !2, file: !3, line: 155, type: !472, isLocal: true, isDefinition: true)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !474, line: 7, baseType: !248)
!474 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "")
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(name: "output_filename", scope: !2, file: !3, line: 158, type: !11, isLocal: true, isDefinition: true)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(name: "bytes_written", scope: !2, file: !3, line: 152, type: !460, isLocal: true, isDefinition: true)
!479 = !DIGlobalVariableExpression(var: !480, expr: !DIExpression())
!480 = distinct !DIGlobalVariable(name: "files_created", scope: !2, file: !3, line: 149, type: !481, isLocal: true, isDefinition: true)
!481 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !65)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(name: "prefix", scope: !2, file: !3, line: 140, type: !484, isLocal: true, isDefinition: true)
!484 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !197)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 192, type: !487, isLocal: true, isDefinition: true)
!487 = !DICompositeType(tag: DW_TAG_array_type, baseType: !229, size: 2816, elements: !436)
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(name: "suffix", scope: !2, file: !3, line: 143, type: !490, isLocal: true, isDefinition: true)
!490 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !11)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(name: "digits", scope: !2, file: !3, line: 146, type: !493, isLocal: true, isDefinition: true)
!493 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !9)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(name: "filename_space", scope: !2, file: !3, line: 137, type: !490, isLocal: true, isDefinition: true)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(name: "last_val", scope: !498, file: !3, line: 1179, type: !460, isLocal: true, isDefinition: true)
!498 = distinct !DISubprogram(name: "parse_patterns", scope: !3, file: !3, line: 1175, type: !499, scopeLine: 1176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !501)
!499 = !DISubroutineType(types: !500)
!500 = !{null, !9, !9, !10}
!501 = !{!502, !503, !504, !505, !506, !507, !509}
!502 = !DILocalVariable(name: "argc", arg: 1, scope: !498, file: !3, line: 1175, type: !9)
!503 = !DILocalVariable(name: "start", arg: 2, scope: !498, file: !3, line: 1175, type: !9)
!504 = !DILocalVariable(name: "argv", arg: 3, scope: !498, file: !3, line: 1175, type: !10)
!505 = !DILocalVariable(name: "p", scope: !498, file: !3, line: 1177, type: !452)
!506 = !DILocalVariable(name: "val", scope: !498, file: !3, line: 1178, type: !460)
!507 = !DILocalVariable(name: "i", scope: !508, file: !3, line: 1181, type: !9)
!508 = distinct !DILexicalBlock(scope: !498, file: !3, line: 1181, column: 3)
!509 = !DILocalVariable(name: "buf", scope: !510, file: !3, line: 1199, type: !516)
!510 = distinct !DILexicalBlock(scope: !511, file: !3, line: 1198, column: 13)
!511 = distinct !DILexicalBlock(scope: !512, file: !3, line: 1197, column: 15)
!512 = distinct !DILexicalBlock(scope: !513, file: !3, line: 1188, column: 9)
!513 = distinct !DILexicalBlock(scope: !514, file: !3, line: 1183, column: 11)
!514 = distinct !DILexicalBlock(scope: !515, file: !3, line: 1182, column: 5)
!515 = distinct !DILexicalBlock(scope: !508, file: !3, line: 1181, column: 3)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 168, elements: !517)
!517 = !{!518}
!518 = !DISubrange(count: 21)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(name: "control_allocated", scope: !521, file: !3, line: 1066, type: !18, isLocal: true, isDefinition: true)
!521 = distinct !DISubprogram(name: "new_control_record", scope: !3, file: !3, line: 1064, type: !522, scopeLine: 1065, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !524)
!522 = !DISubroutineType(types: !523)
!523 = !{!452}
!524 = !{!525}
!525 = !DILocalVariable(name: "p", scope: !521, file: !3, line: 1067, type: !452)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(name: "current_line", scope: !2, file: !3, line: 131, type: !460, isLocal: true, isDefinition: true)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(name: "prev_buf", scope: !530, file: !3, line: 560, type: !552, isLocal: true, isDefinition: true)
!530 = distinct !DISubprogram(name: "remove_line", scope: !3, file: !3, line: 555, type: !531, scopeLine: 556, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !538)
!531 = !DISubroutineType(types: !532)
!532 = !{!533}
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cstring", file: !3, line: 80, size: 128, elements: !535)
!535 = !{!536, !537}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !534, file: !3, line: 82, baseType: !18, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !534, file: !3, line: 83, baseType: !11, size: 64, offset: 64)
!538 = !{!539, !540}
!539 = !DILocalVariable(name: "line", scope: !530, file: !3, line: 562, type: !533)
!540 = !DILocalVariable(name: "l", scope: !530, file: !3, line: 563, type: !541)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "line", file: !3, line: 88, size: 10496, elements: !543)
!543 = !{!544, !545, !546, !547, !551}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !542, file: !3, line: 90, baseType: !18, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "insert_index", scope: !542, file: !3, line: 91, baseType: !18, size: 64, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "retrieve_index", scope: !542, file: !3, line: 92, baseType: !18, size: 64, offset: 128)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "starts", scope: !542, file: !3, line: 93, baseType: !548, size: 10240, offset: 192)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !534, size: 10240, elements: !549)
!549 = !{!550}
!550 = !DISubrange(count: 80)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !542, file: !3, line: 94, baseType: !541, size: 64, offset: 10432)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "buffer_record", file: !3, line: 100, size: 576, elements: !554)
!554 = !{!555, !556, !557, !558, !559, !560, !561, !562, !563}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_alloc", scope: !553, file: !3, line: 102, baseType: !18, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_used", scope: !553, file: !3, line: 103, baseType: !18, size: 64, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "start_line", scope: !553, file: !3, line: 104, baseType: !460, size: 64, offset: 128)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "first_available", scope: !553, file: !3, line: 105, baseType: !460, size: 64, offset: 192)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "num_lines", scope: !553, file: !3, line: 106, baseType: !18, size: 64, offset: 256)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !553, file: !3, line: 107, baseType: !11, size: 64, offset: 320)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "line_start", scope: !553, file: !3, line: 108, baseType: !541, size: 64, offset: 384)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "curr_line", scope: !553, file: !3, line: 109, baseType: !541, size: 64, offset: 448)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !553, file: !3, line: 110, baseType: !552, size: 64, offset: 512)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(name: "head", scope: !2, file: !3, line: 119, type: !552, isLocal: true, isDefinition: true)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(name: "have_read_eof", scope: !2, file: !3, line: 134, type: !442, isLocal: true, isDefinition: true)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(name: "hold_count", scope: !2, file: !3, line: 125, type: !18, isLocal: true, isDefinition: true)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(name: "last_line_number", scope: !2, file: !3, line: 128, type: !460, isLocal: true, isDefinition: true)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(name: "hold_area", scope: !2, file: !3, line: 122, type: !11, isLocal: true, isDefinition: true)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !575, line: 7, baseType: !123)
!575 = !DIFile(filename: "/usr/include/bits/types/sigset_t.h", directory: "")
!576 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!577 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!578 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!579 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!580 = !DIGlobalVariableExpression(var: !581, expr: !DIExpression())
!581 = distinct !DIGlobalVariable(name: "Version", scope: !582, file: !583, line: 2, type: !197, isDefinition: true)
!582 = distinct !DICompileUnit(language: DW_LANG_C99, file: !583, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !199, globals: !584, nameTableKind: None)
!583 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!584 = !{!580}
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(name: "file_name", scope: !587, file: !588, line: 46, type: !197, isLocal: true, isDefinition: true)
!587 = distinct !DICompileUnit(language: DW_LANG_C99, file: !588, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !199, retainedTypes: !589, globals: !627, nameTableKind: None)
!588 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!589 = !{!590, !193, !626, !200}
!590 = !DISubprogram(name: "close_stream", scope: !591, file: !591, line: 2, type: !592, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !199)
!591 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!592 = !DISubroutineType(types: !593)
!593 = !{!9, !594}
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !249, line: 49, size: 1728, elements: !596)
!596 = !{!597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !595, file: !249, line: 51, baseType: !9, size: 32)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !595, file: !249, line: 54, baseType: !11, size: 64, offset: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !595, file: !249, line: 55, baseType: !11, size: 64, offset: 128)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !595, file: !249, line: 56, baseType: !11, size: 64, offset: 192)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !595, file: !249, line: 57, baseType: !11, size: 64, offset: 256)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !595, file: !249, line: 58, baseType: !11, size: 64, offset: 320)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !595, file: !249, line: 59, baseType: !11, size: 64, offset: 384)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !595, file: !249, line: 60, baseType: !11, size: 64, offset: 448)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !595, file: !249, line: 61, baseType: !11, size: 64, offset: 512)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !595, file: !249, line: 64, baseType: !11, size: 64, offset: 576)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !595, file: !249, line: 65, baseType: !11, size: 64, offset: 640)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !595, file: !249, line: 66, baseType: !11, size: 64, offset: 704)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !595, file: !249, line: 68, baseType: !264, size: 64, offset: 768)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !595, file: !249, line: 70, baseType: !594, size: 64, offset: 832)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !595, file: !249, line: 72, baseType: !9, size: 32, offset: 896)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !595, file: !249, line: 73, baseType: !9, size: 32, offset: 928)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !595, file: !249, line: 74, baseType: !270, size: 64, offset: 960)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !595, file: !249, line: 77, baseType: !272, size: 16, offset: 1024)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !595, file: !249, line: 78, baseType: !274, size: 8, offset: 1040)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !595, file: !249, line: 79, baseType: !276, size: 8, offset: 1048)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !595, file: !249, line: 81, baseType: !280, size: 64, offset: 1088)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !595, file: !249, line: 89, baseType: !283, size: 64, offset: 1152)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !595, file: !249, line: 91, baseType: !285, size: 64, offset: 1216)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !595, file: !249, line: 92, baseType: !288, size: 64, offset: 1280)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !595, file: !249, line: 93, baseType: !594, size: 64, offset: 1344)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !595, file: !249, line: 94, baseType: !78, size: 64, offset: 1408)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !595, file: !249, line: 95, baseType: !18, size: 64, offset: 1472)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !595, file: !249, line: 96, baseType: !9, size: 32, offset: 1536)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !595, file: !249, line: 98, baseType: !295, size: 160, offset: 1568)
!626 = !DISubprogram(name: "quotearg_colon", scope: !139, file: !139, line: 391, type: !216, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !199)
!627 = !{!585, !628}
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !587, file: !588, line: 56, type: !442, isLocal: true, isDefinition: true)
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(name: "exit_failure", scope: !632, file: !633, line: 24, type: !493, isDefinition: true)
!632 = distinct !DICompileUnit(language: DW_LANG_C99, file: !633, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !199, globals: !634, nameTableKind: None)
!633 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!634 = !{!630}
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(name: "program_name", scope: !637, file: !638, line: 33, type: !197, isDefinition: true)
!637 = distinct !DICompileUnit(language: DW_LANG_C99, file: !638, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !199, retainedTypes: !639, globals: !675, nameTableKind: None)
!638 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!639 = !{!78, !640, !11}
!640 = !DISubprogram(name: "fputs", scope: !328, file: !328, line: 626, type: !641, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !199)
!641 = !DISubroutineType(types: !642)
!642 = !{!9, !197, !643}
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !249, line: 49, size: 1728, elements: !645)
!645 = !{!646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !644, file: !249, line: 51, baseType: !9, size: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !644, file: !249, line: 54, baseType: !11, size: 64, offset: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !644, file: !249, line: 55, baseType: !11, size: 64, offset: 128)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !644, file: !249, line: 56, baseType: !11, size: 64, offset: 192)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !644, file: !249, line: 57, baseType: !11, size: 64, offset: 256)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !644, file: !249, line: 58, baseType: !11, size: 64, offset: 320)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !644, file: !249, line: 59, baseType: !11, size: 64, offset: 384)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !644, file: !249, line: 60, baseType: !11, size: 64, offset: 448)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !644, file: !249, line: 61, baseType: !11, size: 64, offset: 512)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !644, file: !249, line: 64, baseType: !11, size: 64, offset: 576)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !644, file: !249, line: 65, baseType: !11, size: 64, offset: 640)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !644, file: !249, line: 66, baseType: !11, size: 64, offset: 704)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !644, file: !249, line: 68, baseType: !264, size: 64, offset: 768)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !644, file: !249, line: 70, baseType: !643, size: 64, offset: 832)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !644, file: !249, line: 72, baseType: !9, size: 32, offset: 896)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !644, file: !249, line: 73, baseType: !9, size: 32, offset: 928)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !644, file: !249, line: 74, baseType: !270, size: 64, offset: 960)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !644, file: !249, line: 77, baseType: !272, size: 16, offset: 1024)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !644, file: !249, line: 78, baseType: !274, size: 8, offset: 1040)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !644, file: !249, line: 79, baseType: !276, size: 8, offset: 1048)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !644, file: !249, line: 81, baseType: !280, size: 64, offset: 1088)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !644, file: !249, line: 89, baseType: !283, size: 64, offset: 1152)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !644, file: !249, line: 91, baseType: !285, size: 64, offset: 1216)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !644, file: !249, line: 92, baseType: !288, size: 64, offset: 1280)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !644, file: !249, line: 93, baseType: !643, size: 64, offset: 1344)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !644, file: !249, line: 94, baseType: !78, size: 64, offset: 1408)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !644, file: !249, line: 95, baseType: !18, size: 64, offset: 1472)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !644, file: !249, line: 96, baseType: !9, size: 32, offset: 1536)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !644, file: !249, line: 98, baseType: !295, size: 160, offset: 1568)
!675 = !{!635}
!676 = !DIGlobalVariableExpression(var: !677, expr: !DIExpression())
!677 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !678, file: !679, line: 85, type: !768, isDefinition: true)
!678 = distinct !DICompileUnit(language: DW_LANG_C99, file: !679, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !680, retainedTypes: !686, globals: !741, nameTableKind: None)
!679 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!680 = !{!138, !681, !156}
!681 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !139, line: 242, baseType: !65, size: 32, elements: !682)
!682 = !{!683, !684, !685}
!683 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!684 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!685 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!686 = !{!419, !687, !412, !702, !9, !272, !705, !18, !722, !726, !193, !732, !736, !11, !302, !740, !390}
!687 = !DISubprogram(name: "quotearg_alloc_mem", scope: !139, file: !139, line: 342, type: !688, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !199)
!688 = !DISubroutineType(types: !689)
!689 = !{!11, !197, !20, !358, !690}
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !692)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !679, line: 65, size: 448, elements: !693)
!693 = !{!694, !695, !696, !700, !701}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !692, file: !679, line: 68, baseType: !138, size: 32)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !692, file: !679, line: 71, baseType: !9, size: 32, offset: 32)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !692, file: !679, line: 75, baseType: !697, size: 256, offset: 64)
!697 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 256, elements: !698)
!698 = !{!699}
!699 = !DISubrange(count: 8)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !692, file: !679, line: 78, baseType: !197, size: 64, offset: 320)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !692, file: !679, line: 81, baseType: !197, size: 64, offset: 384)
!702 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !139, file: !139, line: 408, type: !703, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !199)
!703 = !DISubroutineType(types: !704)
!704 = !{!11, !9, !197, !197, !197, !20}
!705 = !DISubprogram(name: "rpl_mbrtowc", scope: !706, file: !706, line: 717, type: !707, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !199)
!706 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!707 = !DISubroutineType(types: !708)
!708 = !{!20, !235, !197, !20, !709}
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !711, line: 13, size: 64, elements: !712)
!711 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!712 = !{!713, !714}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !710, file: !711, line: 15, baseType: !9, size: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !710, file: !711, line: 20, baseType: !715, size: 32, offset: 32)
!715 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !710, file: !711, line: 16, size: 32, elements: !716)
!716 = !{!717, !718}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !715, file: !711, line: 18, baseType: !65, size: 32)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !715, file: !711, line: 19, baseType: !719, size: 32)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 32, elements: !720)
!720 = !{!721}
!721 = !DISubrange(count: 4)
!722 = !DISubprogram(name: "iswprint", scope: !723, file: !723, line: 120, type: !724, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !199)
!723 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!724 = !DISubroutineType(types: !725)
!725 = !{!9, !65}
!726 = !DISubprogram(name: "mbsinit", scope: !727, file: !727, line: 292, type: !728, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !199)
!727 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!728 = !DISubroutineType(types: !729)
!729 = !{!9, !730}
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !710)
!732 = !DISubprogram(name: "locale_charset", scope: !733, file: !733, line: 35, type: !734, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !199)
!733 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!734 = !DISubroutineType(types: !735)
!735 = !{!197}
!736 = !DISubprogram(name: "c_strcasecmp", scope: !737, file: !737, line: 42, type: !738, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !199)
!737 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!738 = !DISubroutineType(types: !739)
!739 = !{!9, !197, !197}
!740 = !DISubprogram(name: "xalloc_die", scope: !180, file: !180, line: 51, type: !134, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !199)
!741 = !{!676, !742, !748, !750, !752, !757, !764, !766}
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !678, file: !679, line: 101, type: !744, isDefinition: true)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !745, size: 320, elements: !746)
!745 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !138)
!746 = !{!747}
!747 = !DISubrange(count: 10)
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !678, file: !679, line: 1052, type: !692, isDefinition: true)
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !678, file: !679, line: 116, type: !692, isLocal: true, isDefinition: true)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(name: "slot0", scope: !678, file: !679, line: 842, type: !754, isLocal: true, isDefinition: true)
!754 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 2048, elements: !755)
!755 = !{!756}
!756 = !DISubrange(count: 256)
!757 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression())
!758 = distinct !DIGlobalVariable(name: "slotvec", scope: !678, file: !679, line: 845, type: !759, isLocal: true, isDefinition: true)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !679, line: 834, size: 128, elements: !761)
!761 = !{!762, !763}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !760, file: !679, line: 836, baseType: !18, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !760, file: !679, line: 837, baseType: !11, size: 64, offset: 64)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(name: "nslots", scope: !678, file: !679, line: 843, type: !9, isLocal: true, isDefinition: true)
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(name: "slotvec0", scope: !678, file: !679, line: 844, type: !760, isLocal: true, isDefinition: true)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !769, size: 704, elements: !436)
!769 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !197)
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !772, file: !773, line: 26, type: !775, isDefinition: true)
!772 = distinct !DICompileUnit(language: DW_LANG_C99, file: !773, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !199, globals: !774, nameTableKind: None)
!773 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!774 = !{!770}
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 376, elements: !776)
!776 = !{!777}
!777 = !DISubrange(count: 47)
!778 = !DIGlobalVariableExpression(var: !779, expr: !DIExpression())
!779 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !780, file: !781, line: 507, type: !9, isLocal: true, isDefinition: true)
!780 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !781, file: !781, line: 488, type: !782, scopeLine: 489, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !784, retainedNodes: !791)
!781 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!782 = !DISubroutineType(types: !783)
!783 = !{!9, !9, !9}
!784 = distinct !DICompileUnit(language: DW_LANG_C99, file: !781, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !199, retainedTypes: !785, globals: !790, nameTableKind: None)
!785 = !{!786, !323}
!786 = !DISubprogram(name: "fcntl", scope: !787, file: !787, line: 176, type: !788, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !199)
!787 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
!788 = !DISubroutineType(types: !789)
!789 = !{!9, !9, !9, null}
!790 = !{!778}
!791 = !{!792, !793, !794, !795, !798}
!792 = !DILocalVariable(name: "fd", arg: 1, scope: !780, file: !781, line: 488, type: !9)
!793 = !DILocalVariable(name: "target", arg: 2, scope: !780, file: !781, line: 488, type: !9)
!794 = !DILocalVariable(name: "result", scope: !780, file: !781, line: 490, type: !9)
!795 = !DILocalVariable(name: "flags", scope: !796, file: !781, line: 531, type: !9)
!796 = distinct !DILexicalBlock(scope: !797, file: !781, line: 530, column: 5)
!797 = distinct !DILexicalBlock(scope: !780, file: !781, line: 529, column: 7)
!798 = !DILocalVariable(name: "saved_errno", scope: !799, file: !781, line: 534, type: !9)
!799 = distinct !DILexicalBlock(scope: !800, file: !781, line: 533, column: 9)
!800 = distinct !DILexicalBlock(scope: !796, file: !781, line: 532, column: 11)
!801 = !DIGlobalVariableExpression(var: !802, expr: !DIExpression())
!802 = distinct !DIGlobalVariable(name: "rpl_re_syntax_options", scope: !803, file: !1563, line: 243, type: !373, isDefinition: true)
!803 = distinct !DICompileUnit(language: DW_LANG_C99, file: !804, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !805, retainedTypes: !1268, globals: !1560, nameTableKind: None)
!804 = !DIFile(filename: "lib/regex.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!805 = !{!806, !819, !855, !875, !156, !1261}
!806 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !807, line: 206, baseType: !65, size: 32, elements: !808)
!807 = !DIFile(filename: "./lib/regex_internal.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!808 = !{!809, !810, !811, !812, !813, !814, !815, !816, !817, !818}
!809 = !DIEnumerator(name: "INSIDE_WORD", value: 5, isUnsigned: true)
!810 = !DIEnumerator(name: "WORD_FIRST", value: 6, isUnsigned: true)
!811 = !DIEnumerator(name: "WORD_LAST", value: 9, isUnsigned: true)
!812 = !DIEnumerator(name: "INSIDE_NOTWORD", value: 10, isUnsigned: true)
!813 = !DIEnumerator(name: "LINE_FIRST", value: 16, isUnsigned: true)
!814 = !DIEnumerator(name: "LINE_LAST", value: 32, isUnsigned: true)
!815 = !DIEnumerator(name: "BUF_FIRST", value: 64, isUnsigned: true)
!816 = !DIEnumerator(name: "BUF_LAST", value: 128, isUnsigned: true)
!817 = !DIEnumerator(name: "WORD_DELIM", value: 256, isUnsigned: true)
!818 = !DIEnumerator(name: "NOT_WORD_DELIM", value: 512, isUnsigned: true)
!819 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !807, line: 227, baseType: !65, size: 32, elements: !820)
!820 = !{!821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854}
!821 = !DIEnumerator(name: "NON_TYPE", value: 0, isUnsigned: true)
!822 = !DIEnumerator(name: "CHARACTER", value: 1, isUnsigned: true)
!823 = !DIEnumerator(name: "END_OF_RE", value: 2, isUnsigned: true)
!824 = !DIEnumerator(name: "SIMPLE_BRACKET", value: 3, isUnsigned: true)
!825 = !DIEnumerator(name: "OP_BACK_REF", value: 4, isUnsigned: true)
!826 = !DIEnumerator(name: "OP_PERIOD", value: 5, isUnsigned: true)
!827 = !DIEnumerator(name: "COMPLEX_BRACKET", value: 6, isUnsigned: true)
!828 = !DIEnumerator(name: "OP_UTF8_PERIOD", value: 7, isUnsigned: true)
!829 = !DIEnumerator(name: "OP_OPEN_SUBEXP", value: 8, isUnsigned: true)
!830 = !DIEnumerator(name: "OP_CLOSE_SUBEXP", value: 9, isUnsigned: true)
!831 = !DIEnumerator(name: "OP_ALT", value: 10, isUnsigned: true)
!832 = !DIEnumerator(name: "OP_DUP_ASTERISK", value: 11, isUnsigned: true)
!833 = !DIEnumerator(name: "ANCHOR", value: 12, isUnsigned: true)
!834 = !DIEnumerator(name: "CONCAT", value: 16, isUnsigned: true)
!835 = !DIEnumerator(name: "SUBEXP", value: 17, isUnsigned: true)
!836 = !DIEnumerator(name: "OP_DUP_PLUS", value: 18, isUnsigned: true)
!837 = !DIEnumerator(name: "OP_DUP_QUESTION", value: 19, isUnsigned: true)
!838 = !DIEnumerator(name: "OP_OPEN_BRACKET", value: 20, isUnsigned: true)
!839 = !DIEnumerator(name: "OP_CLOSE_BRACKET", value: 21, isUnsigned: true)
!840 = !DIEnumerator(name: "OP_CHARSET_RANGE", value: 22, isUnsigned: true)
!841 = !DIEnumerator(name: "OP_OPEN_DUP_NUM", value: 23, isUnsigned: true)
!842 = !DIEnumerator(name: "OP_CLOSE_DUP_NUM", value: 24, isUnsigned: true)
!843 = !DIEnumerator(name: "OP_NON_MATCH_LIST", value: 25, isUnsigned: true)
!844 = !DIEnumerator(name: "OP_OPEN_COLL_ELEM", value: 26, isUnsigned: true)
!845 = !DIEnumerator(name: "OP_CLOSE_COLL_ELEM", value: 27, isUnsigned: true)
!846 = !DIEnumerator(name: "OP_OPEN_EQUIV_CLASS", value: 28, isUnsigned: true)
!847 = !DIEnumerator(name: "OP_CLOSE_EQUIV_CLASS", value: 29, isUnsigned: true)
!848 = !DIEnumerator(name: "OP_OPEN_CHAR_CLASS", value: 30, isUnsigned: true)
!849 = !DIEnumerator(name: "OP_CLOSE_CHAR_CLASS", value: 31, isUnsigned: true)
!850 = !DIEnumerator(name: "OP_WORD", value: 32, isUnsigned: true)
!851 = !DIEnumerator(name: "OP_NOTWORD", value: 33, isUnsigned: true)
!852 = !DIEnumerator(name: "OP_SPACE", value: 34, isUnsigned: true)
!853 = !DIEnumerator(name: "OP_NOTSPACE", value: 35, isUnsigned: true)
!854 = !DIEnumerator(name: "BACK_SLASH", value: 36, isUnsigned: true)
!855 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !360, line: 346, baseType: !9, size: 32, elements: !856)
!856 = !{!857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874}
!857 = !DIEnumerator(name: "_REG_ENOSYS", value: -1)
!858 = !DIEnumerator(name: "_REG_NOERROR", value: 0)
!859 = !DIEnumerator(name: "_REG_NOMATCH", value: 1)
!860 = !DIEnumerator(name: "_REG_BADPAT", value: 2)
!861 = !DIEnumerator(name: "_REG_ECOLLATE", value: 3)
!862 = !DIEnumerator(name: "_REG_ECTYPE", value: 4)
!863 = !DIEnumerator(name: "_REG_EESCAPE", value: 5)
!864 = !DIEnumerator(name: "_REG_ESUBREG", value: 6)
!865 = !DIEnumerator(name: "_REG_EBRACK", value: 7)
!866 = !DIEnumerator(name: "_REG_EPAREN", value: 8)
!867 = !DIEnumerator(name: "_REG_EBRACE", value: 9)
!868 = !DIEnumerator(name: "_REG_BADBR", value: 10)
!869 = !DIEnumerator(name: "_REG_ERANGE", value: 11)
!870 = !DIEnumerator(name: "_REG_ESPACE", value: 12)
!871 = !DIEnumerator(name: "_REG_BADRPT", value: 13)
!872 = !DIEnumerator(name: "_REG_EEND", value: 14)
!873 = !DIEnumerator(name: "_REG_ESIZE", value: 15)
!874 = !DIEnumerator(name: "_REG_ERPAREN", value: 16)
!875 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !876, line: 41, baseType: !65, size: 32, elements: !877)
!876 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!877 = !{!878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260}
!878 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!879 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!880 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!881 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!882 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!883 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!884 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!885 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!886 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!887 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!888 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!889 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!890 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!891 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!892 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!893 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!894 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!895 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!896 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!897 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!898 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!899 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!900 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!901 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!902 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!903 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!904 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!905 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!906 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!907 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!908 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!909 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!910 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!911 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!912 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!913 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!914 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!915 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!916 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!917 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!918 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!919 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!920 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!921 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!922 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!923 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!924 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!925 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!926 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!927 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!928 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!929 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!930 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!931 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!932 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!933 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!934 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!935 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!936 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!937 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!938 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!939 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!940 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!941 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!942 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!943 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!944 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!945 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!946 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!947 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!948 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!949 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!950 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!951 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!952 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!953 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!954 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!955 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!956 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!957 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!958 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!959 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!960 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!961 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!962 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!963 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!964 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!965 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!966 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!967 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!968 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!969 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!970 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!971 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!972 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!973 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!974 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!975 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!976 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!977 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!978 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!979 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!980 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!981 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!982 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!983 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!984 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!985 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!986 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!987 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!988 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!989 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!990 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!991 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!992 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!993 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!994 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!995 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!996 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!997 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!998 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!999 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!1000 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!1001 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!1002 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!1003 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!1004 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!1005 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!1006 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!1007 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!1008 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!1009 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!1010 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!1011 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!1012 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!1013 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!1014 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!1015 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!1016 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!1017 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!1018 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!1019 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!1020 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!1021 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!1022 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!1023 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!1024 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!1025 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!1026 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!1027 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!1028 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!1029 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!1030 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!1031 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!1032 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!1033 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!1034 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!1035 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!1036 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!1037 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!1038 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!1039 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
