source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon.12 }
%struct.__sigset_t = type { [16 x i64] }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.buffer_record = type { i64, i64, i64, i64, i64, i8*, %struct.line*, %struct.line*, %struct.buffer_record* }
%struct.control = type { i64, i64, i64, i32, i8, i8, i8, %struct.re_pattern_buffer }
%struct.cstring = type { i64, i8* }
%struct.infomap = type { i8*, i8* }
%struct.line = type { i64, i64, i64, [80 x %struct.cstring], %struct.line* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.re_dfa_t = type opaque
%struct.re_pattern_buffer = type { %struct.re_dfa_t*, i64, i64, i64, i8*, i8*, i64, i8 }
%struct.re_registers = type { i32, i32*, i32* }
%struct.sigaction = type { %union.anon, %struct.__sigset_t, i32, void ()* }
%union.anon = type { void (i32)* }
%union.anon.12 = type { i32 }

@.str.1 = private unnamed_addr constant [17 x i8] c"memory exhausted\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "caught_signals", scope: !2, file: !3, line: 183, type: !421, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !192, globals: !194)
!3 = !DIFile(filename: "src/csplit.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!4 = !{!5, !138, !152, !156, !171, !179}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !6, file: !3, line: 1443, baseType: !65, size: 32, elements: !136)
!6 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 1338, type: !7, isDefinition: true, scopeLine: 1339, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !13)
!7 = !DISubroutineType(types: !8)
!8 = !{!9, !9, !10}
!9 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!13 = !{!14, !15, !16, !17, !21, !22, !24}
!14 = !DILocalVariable(name: "argc", arg: 1, scope: !6, file: !3, line: 1338, type: !9)
!15 = !DILocalVariable(name: "argv", arg: 2, scope: !6, file: !3, line: 1338, type: !10)
!16 = !DILocalVariable(name: "optc", scope: !6, file: !3, line: 1340, type: !9)
!17 = !DILocalVariable(name: "prefix_len", scope: !6, file: !3, line: 1408, type: !18)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !19, line: 62, baseType: !20)
!19 = !DIFile(filename: "/usr/lib/clang/7.0.0/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!20 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!21 = !DILocalVariable(name: "max_digit_string_len", scope: !6, file: !3, line: 1409, type: !18)
!22 = !DILocalVariable(name: "i", scope: !23, file: !3, line: 1422, type: !9)
!23 = distinct !DILexicalBlock(scope: !6, file: !3, line: 1421, column: 3)
!24 = !DILocalVariable(name: "act", scope: !23, file: !3, line: 1445, type: !25)
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !26, line: 27, size: 1216, elements: !27)
!26 = !DIFile(filename: "/usr/include/bits/sigaction.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!27 = !{!28, !122, !131, !132}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !25, file: !26, line: 38, baseType: !29, size: 64)
!29 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !25, file: !26, line: 31, size: 64, elements: !30)
!30 = !{!31, !37}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !29, file: !26, line: 34, baseType: !32, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !33, line: 72, baseType: !34)
!33 = !DIFile(filename: "/usr/include/signal.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DISubroutineType(types: !36)
!36 = !{null, !9}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !29, file: !26, line: 36, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DISubroutineType(types: !40)
!40 = !{null, !9, !41, !78}
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !43, line: 124, baseType: !44)
!43 = !DIFile(filename: "/usr/include/bits/types/siginfo_t.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !43, line: 36, size: 1024, elements: !45)
!45 = !{!46, !47, !48, !49, !50}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !44, file: !43, line: 38, baseType: !9, size: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !44, file: !43, line: 40, baseType: !9, size: 32, offset: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !44, file: !43, line: 42, baseType: !9, size: 32, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !44, file: !43, line: 48, baseType: !9, size: 32, offset: 96)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !44, file: !43, line: 123, baseType: !51, size: 896, offset: 128)
!51 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !44, file: !43, line: 51, size: 896, elements: !52)
!52 = !{!53, !57, !66, !79, !85, !95, !111, !116}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !51, file: !43, line: 53, baseType: !54, size: 896)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 896, elements: !55)
!55 = !{!56}
!56 = !DISubrange(count: 28)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !51, file: !43, line: 60, baseType: !58, size: 64)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !51, file: !43, line: 56, size: 64, elements: !59)
!59 = !{!60, !63}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !58, file: !43, line: 58, baseType: !61, size: 32)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !62, line: 152, baseType: !9)
!62 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!63 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !58, file: !43, line: 59, baseType: !64, size: 32, offset: 32)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !62, line: 144, baseType: !65)
!65 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !51, file: !43, line: 68, baseType: !67, size: 128)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !51, file: !43, line: 63, size: 128, elements: !68)
!68 = !{!69, !70, !71}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !67, file: !43, line: 65, baseType: !9, size: 32)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !67, file: !43, line: 66, baseType: !9, size: 32, offset: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !67, file: !43, line: 67, baseType: !72, size: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigval_t", file: !73, line: 30, baseType: !74)
!73 = !DIFile(filename: "/usr/include/bits/types/__sigval_t.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!74 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !73, line: 24, size: 64, elements: !75)
!75 = !{!76, !77}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !74, file: !73, line: 26, baseType: !9, size: 32)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !74, file: !73, line: 27, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !51, file: !43, line: 76, baseType: !80, size: 128)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !51, file: !43, line: 71, size: 128, elements: !81)
!81 = !{!82, !83, !84}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !80, file: !43, line: 73, baseType: !61, size: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !80, file: !43, line: 74, baseType: !64, size: 32, offset: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !80, file: !43, line: 75, baseType: !72, size: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !51, file: !43, line: 86, baseType: !86, size: 256)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !51, file: !43, line: 79, size: 256, elements: !87)
!87 = !{!88, !89, !90, !91, !94}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !86, file: !43, line: 81, baseType: !61, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !86, file: !43, line: 82, baseType: !64, size: 32, offset: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !86, file: !43, line: 83, baseType: !9, size: 32, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !86, file: !43, line: 84, baseType: !92, size: 64, offset: 128)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !62, line: 154, baseType: !93)
!93 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !86, file: !43, line: 85, baseType: !92, size: 64, offset: 192)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !51, file: !43, line: 105, baseType: !96, size: 256)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !51, file: !43, line: 89, size: 256, elements: !97)
!97 = !{!98, !99, !101}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !96, file: !43, line: 91, baseType: !78, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_lsb", scope: !96, file: !43, line: 93, baseType: !100, size: 16, offset: 64)
!100 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_bounds", scope: !96, file: !43, line: 104, baseType: !102, size: 128, offset: 128)
!102 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !96, file: !43, line: 94, size: 128, elements: !103)
!103 = !{!104, !109}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_bnd", scope: !102, file: !43, line: 101, baseType: !105, size: 128)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !102, file: !43, line: 97, size: 128, elements: !106)
!106 = !{!107, !108}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_lower", scope: !105, file: !43, line: 99, baseType: !78, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_upper", scope: !105, file: !43, line: 100, baseType: !78, size: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_pkey", scope: !102, file: !43, line: 103, baseType: !110, size: 32)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !62, line: 41, baseType: !65)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !51, file: !43, line: 112, baseType: !112, size: 128)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !51, file: !43, line: 108, size: 128, elements: !113)
!113 = !{!114, !115}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !112, file: !43, line: 110, baseType: !93, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "si_fd", scope: !112, file: !43, line: 111, baseType: !9, size: 32, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !51, file: !43, line: 121, baseType: !117, size: 128)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !51, file: !43, line: 116, size: 128, elements: !118)
!118 = !{!119, !120, !121}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !117, file: !43, line: 118, baseType: !78, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !117, file: !43, line: 119, baseType: !9, size: 32, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !117, file: !43, line: 120, baseType: !65, size: 32, offset: 96)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !25, file: !26, line: 46, baseType: !123, size: 1024, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !124, line: 8, baseType: !125)
!124 = !DIFile(filename: "/usr/include/bits/types/__sigset_t.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !124, line: 5, size: 1024, elements: !126)
!126 = !{!127}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !125, file: !124, line: 7, baseType: !128, size: 1024)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 1024, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 16)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !25, file: !26, line: 49, baseType: !9, size: 32, offset: 1088)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !25, file: !26, line: 52, baseType: !133, size: 64, offset: 1152)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{null}
!136 = !{!137}
!137 = !DIEnumerator(name: "nsigs", value: 11, isUnsigned: true)
!138 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !139, line: 32, baseType: !65, size: 32, elements: !140)
!139 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!140 = !{!141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151}
!141 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!142 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!143 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!144 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!145 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!146 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!147 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!148 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!149 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!150 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!151 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!152 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 1227, baseType: !65, size: 32, elements: !153)
!153 = !{!154, !155}
!154 = !DIEnumerator(name: "FLAG_THOUSANDS", value: 1, isUnsigned: true)
!155 = !DIEnumerator(name: "FLAG_ALTERNATIVE", value: 2, isUnsigned: true)
!156 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !157, line: 46, baseType: !65, size: 32, elements: !158)
!157 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!158 = !{!159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170}
!159 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!160 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!161 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!162 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!163 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!164 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!165 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!166 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!167 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!168 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!169 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!170 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!171 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !172, line: 26, baseType: !65, size: 32, elements: !173)
!172 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!173 = !{!174, !175, !176, !177, !178}
!174 = !DIEnumerator(name: "LONGINT_OK", value: 0, isUnsigned: true)
!175 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1, isUnsigned: true)
!176 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2, isUnsigned: true)
!177 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3, isUnsigned: true)
!178 = !DIEnumerator(name: "LONGINT_INVALID", value: 4, isUnsigned: true)
!179 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !181, file: !180, line: 186, baseType: !65, size: 32, elements: !190)
!180 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!181 = distinct !DISubprogram(name: "x2nrealloc", scope: !180, file: !180, line: 174, type: !182, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !185)
!182 = !DISubroutineType(types: !183)
!183 = !{!78, !78, !184, !18}
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!185 = !{!186, !187, !188, !189}
!186 = !DILocalVariable(name: "p", arg: 1, scope: !181, file: !180, line: 174, type: !78)
!187 = !DILocalVariable(name: "pn", arg: 2, scope: !181, file: !180, line: 174, type: !184)
!188 = !DILocalVariable(name: "s", arg: 3, scope: !181, file: !180, line: 174, type: !18)
!189 = !DILocalVariable(name: "n", scope: !181, file: !180, line: 176, type: !18)
!190 = !{!191}
!191 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!192 = !{!11, !78, !65, !32, !9, !193, !20, !18}
!193 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!194 = !{!195, !201, !203, !206, !209, !211, !213, !254, !0, !256, !311, !313, !315, !318, !323, !335, !338, !341, !343, !366, !373, !375, !411, !413, !415, !417, !419}
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "sig", scope: !6, file: !3, line: 1423, type: !197, isLocal: true, isDefinition: true)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 352, elements: !199)
!198 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!199 = !{!200}
!200 = !DISubrange(count: 11)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "global_argv", scope: !2, file: !3, line: 161, type: !10, isLocal: true, isDefinition: true)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(name: "suppress_count", scope: !2, file: !3, line: 164, type: !205, isLocal: true, isDefinition: true)
!205 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(name: "remove_files", scope: !2, file: !3, line: 167, type: !208, isLocal: true, isDefinition: true)
!208 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !205)
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(name: "elide_empty_files", scope: !2, file: !3, line: 170, type: !205, isLocal: true, isDefinition: true)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "suppress_matched", scope: !2, file: !3, line: 173, type: !205, isLocal: true, isDefinition: true)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(name: "controls", scope: !2, file: !3, line: 177, type: !215, isLocal: true, isDefinition: true)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control", file: !3, line: 51, size: 768, elements: !217)
!217 = !{!218, !222, !225, !226, !227, !228, !229, !230}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !216, file: !3, line: 53, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !220, line: 101, baseType: !221)
!220 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !62, line: 71, baseType: !93)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "lines_required", scope: !216, file: !3, line: 54, baseType: !223, size: 64, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !220, line: 102, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !62, line: 72, baseType: !20)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !216, file: !3, line: 55, baseType: !223, size: 64, offset: 128)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "argnum", scope: !216, file: !3, line: 56, baseType: !9, size: 32, offset: 192)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_forever", scope: !216, file: !3, line: 57, baseType: !205, size: 8, offset: 224)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !216, file: !3, line: 58, baseType: !205, size: 8, offset: 232)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "regexpr", scope: !216, file: !3, line: 59, baseType: !205, size: 8, offset: 240)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "re_compiled", scope: !216, file: !3, line: 60, baseType: !231, size: 512, offset: 256)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_pattern_buffer", file: !232, line: 414, size: 512, elements: !233)
!232 = !DIFile(filename: "./lib/regex.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!233 = !{!234, !237, !239, !240, !242, !243, !246, !247, !248, !249, !250, !251, !252, !253}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !231, file: !232, line: 418, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "re_dfa_t", file: !232, line: 418, flags: DIFlagFwdDecl)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !231, file: !232, line: 421, baseType: !238, size: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "__re_long_size_t", file: !232, line: 57, baseType: !20)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !231, file: !232, line: 424, baseType: !238, size: 64, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "syntax", scope: !231, file: !232, line: 427, baseType: !241, size: 64, offset: 192)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_syntax_t", file: !232, line: 73, baseType: !20)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap", scope: !231, file: !232, line: 432, baseType: !11, size: 64, offset: 256)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "translate", scope: !231, file: !232, line: 438, baseType: !244, size: 64, offset: 320)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "re_nsub", scope: !231, file: !232, line: 441, baseType: !18, size: 64, offset: 384)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_null", scope: !231, file: !232, line: 447, baseType: !65, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "regs_allocated", scope: !231, file: !232, line: 458, baseType: !65, size: 2, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap_accurate", scope: !231, file: !232, line: 462, baseType: !65, size: 1, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "no_sub", scope: !231, file: !232, line: 466, baseType: !65, size: 1, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "not_bol", scope: !231, file: !232, line: 470, baseType: !65, size: 1, offset: 453, flags: DIFlagBitField, extraData: i64 448)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "not_eol", scope: !231, file: !232, line: 473, baseType: !65, size: 1, offset: 454, flags: DIFlagBitField, extraData: i64 448)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "newline_anchor", scope: !231, file: !232, line: 476, baseType: !65, size: 1, offset: 455, flags: DIFlagBitField, extraData: i64 448)
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(name: "control_used", scope: !2, file: !3, line: 180, type: !18, isLocal: true, isDefinition: true)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(name: "output_stream", scope: !2, file: !3, line: 155, type: !258, isLocal: true, isDefinition: true)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !260, line: 7, baseType: !261)
!260 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !262, line: 49, size: 1728, elements: !263)
!262 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!263 = !{!264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !279, !281, !282, !283, !285, !286, !288, !292, !295, !297, !300, !303, !304, !305, !306, !307}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !261, file: !262, line: 51, baseType: !9, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !261, file: !262, line: 54, baseType: !11, size: 64, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !261, file: !262, line: 55, baseType: !11, size: 64, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !261, file: !262, line: 56, baseType: !11, size: 64, offset: 192)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !261, file: !262, line: 57, baseType: !11, size: 64, offset: 256)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !261, file: !262, line: 58, baseType: !11, size: 64, offset: 320)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !261, file: !262, line: 59, baseType: !11, size: 64, offset: 384)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !261, file: !262, line: 60, baseType: !11, size: 64, offset: 448)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !261, file: !262, line: 61, baseType: !11, size: 64, offset: 512)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !261, file: !262, line: 64, baseType: !11, size: 64, offset: 576)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !261, file: !262, line: 65, baseType: !11, size: 64, offset: 640)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !261, file: !262, line: 66, baseType: !11, size: 64, offset: 704)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !261, file: !262, line: 68, baseType: !277, size: 64, offset: 768)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !262, line: 36, flags: DIFlagFwdDecl)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !261, file: !262, line: 70, baseType: !280, size: 64, offset: 832)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !261, file: !262, line: 72, baseType: !9, size: 32, offset: 896)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !261, file: !262, line: 73, baseType: !9, size: 32, offset: 928)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !261, file: !262, line: 74, baseType: !284, size: 64, offset: 960)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !62, line: 150, baseType: !93)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !261, file: !262, line: 77, baseType: !193, size: 16, offset: 1024)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !261, file: !262, line: 78, baseType: !287, size: 8, offset: 1040)
!287 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !261, file: !262, line: 79, baseType: !289, size: 8, offset: 1048)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 8, elements: !290)
!290 = !{!291}
!291 = !DISubrange(count: 1)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !261, file: !262, line: 81, baseType: !293, size: 64, offset: 1088)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !262, line: 43, baseType: null)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !261, file: !262, line: 89, baseType: !296, size: 64, offset: 1152)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !62, line: 151, baseType: !93)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !261, file: !262, line: 91, baseType: !298, size: 64, offset: 1216)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !262, line: 37, flags: DIFlagFwdDecl)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !261, file: !262, line: 92, baseType: !301, size: 64, offset: 1280)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !262, line: 38, flags: DIFlagFwdDecl)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !261, file: !262, line: 93, baseType: !280, size: 64, offset: 1344)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !261, file: !262, line: 94, baseType: !78, size: 64, offset: 1408)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !261, file: !262, line: 95, baseType: !18, size: 64, offset: 1472)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !261, file: !262, line: 96, baseType: !9, size: 32, offset: 1536)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !261, file: !262, line: 98, baseType: !308, size: 160, offset: 1568)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 160, elements: !309)
!309 = !{!310}
!310 = !DISubrange(count: 20)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(name: "output_filename", scope: !2, file: !3, line: 158, type: !11, isLocal: true, isDefinition: true)
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(name: "bytes_written", scope: !2, file: !3, line: 152, type: !223, isLocal: true, isDefinition: true)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(name: "files_created", scope: !2, file: !3, line: 149, type: !317, isLocal: true, isDefinition: true)
!317 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !65)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "prefix", scope: !2, file: !3, line: 140, type: !320, isLocal: true, isDefinition: true)
!320 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !321)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 192, type: !325, isLocal: true, isDefinition: true)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !326, size: 2816, elements: !199)
!326 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !327)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !328, line: 50, size: 256, elements: !329)
!328 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!329 = !{!330, !331, !332, !334}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !327, file: !328, line: 52, baseType: !321, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !327, file: !328, line: 55, baseType: !9, size: 32, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !327, file: !328, line: 56, baseType: !333, size: 64, offset: 128)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !327, file: !328, line: 57, baseType: !9, size: 32, offset: 192)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(name: "suffix", scope: !2, file: !3, line: 143, type: !337, isLocal: true, isDefinition: true)
!337 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !11)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "digits", scope: !2, file: !3, line: 146, type: !340, isLocal: true, isDefinition: true)
!340 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !9)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "filename_space", scope: !2, file: !3, line: 137, type: !337, isLocal: true, isDefinition: true)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "last_val", scope: !345, file: !3, line: 1179, type: !223, isLocal: true, isDefinition: true)
!345 = distinct !DISubprogram(name: "parse_patterns", scope: !3, file: !3, line: 1175, type: !346, isLocal: true, isDefinition: true, scopeLine: 1176, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !348)
!346 = !DISubroutineType(types: !347)
!347 = !{null, !9, !9, !10}
!348 = !{!349, !350, !351, !352, !353, !354, !356}
!349 = !DILocalVariable(name: "argc", arg: 1, scope: !345, file: !3, line: 1175, type: !9)
!350 = !DILocalVariable(name: "start", arg: 2, scope: !345, file: !3, line: 1175, type: !9)
!351 = !DILocalVariable(name: "argv", arg: 3, scope: !345, file: !3, line: 1175, type: !10)
!352 = !DILocalVariable(name: "p", scope: !345, file: !3, line: 1177, type: !215)
!353 = !DILocalVariable(name: "val", scope: !345, file: !3, line: 1178, type: !223)
!354 = !DILocalVariable(name: "i", scope: !355, file: !3, line: 1181, type: !9)
!355 = distinct !DILexicalBlock(scope: !345, file: !3, line: 1181, column: 3)
!356 = !DILocalVariable(name: "buf", scope: !357, file: !3, line: 1199, type: !363)
!357 = distinct !DILexicalBlock(scope: !358, file: !3, line: 1198, column: 13)
!358 = distinct !DILexicalBlock(scope: !359, file: !3, line: 1197, column: 15)
!359 = distinct !DILexicalBlock(scope: !360, file: !3, line: 1188, column: 9)
!360 = distinct !DILexicalBlock(scope: !361, file: !3, line: 1183, column: 11)
!361 = distinct !DILexicalBlock(scope: !362, file: !3, line: 1182, column: 5)
!362 = distinct !DILexicalBlock(scope: !355, file: !3, line: 1181, column: 3)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 168, elements: !364)
!364 = !{!365}
!365 = !DISubrange(count: 21)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "control_allocated", scope: !368, file: !3, line: 1066, type: !18, isLocal: true, isDefinition: true)
!368 = distinct !DISubprogram(name: "new_control_record", scope: !3, file: !3, line: 1064, type: !369, isLocal: true, isDefinition: true, scopeLine: 1065, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !371)
!369 = !DISubroutineType(types: !370)
!370 = !{!215}
!371 = !{!372}
!372 = !DILocalVariable(name: "p", scope: !368, file: !3, line: 1067, type: !215)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "current_line", scope: !2, file: !3, line: 131, type: !223, isLocal: true, isDefinition: true)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(name: "prev_buf", scope: !377, file: !3, line: 560, type: !399, isLocal: true, isDefinition: true)
!377 = distinct !DISubprogram(name: "remove_line", scope: !3, file: !3, line: 555, type: !378, isLocal: true, isDefinition: true, scopeLine: 556, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !385)
!378 = !DISubroutineType(types: !379)
!379 = !{!380}
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cstring", file: !3, line: 80, size: 128, elements: !382)
!382 = !{!383, !384}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !381, file: !3, line: 82, baseType: !18, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !381, file: !3, line: 83, baseType: !11, size: 64, offset: 64)
!385 = !{!386, !387}
!386 = !DILocalVariable(name: "line", scope: !377, file: !3, line: 562, type: !380)
!387 = !DILocalVariable(name: "l", scope: !377, file: !3, line: 563, type: !388)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "line", file: !3, line: 88, size: 10496, elements: !390)
!390 = !{!391, !392, !393, !394, !398}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !389, file: !3, line: 90, baseType: !18, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "insert_index", scope: !389, file: !3, line: 91, baseType: !18, size: 64, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "retrieve_index", scope: !389, file: !3, line: 92, baseType: !18, size: 64, offset: 128)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "starts", scope: !389, file: !3, line: 93, baseType: !395, size: 10240, offset: 192)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !381, size: 10240, elements: !396)
!396 = !{!397}
!397 = !DISubrange(count: 80)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !389, file: !3, line: 94, baseType: !388, size: 64, offset: 10432)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "buffer_record", file: !3, line: 100, size: 576, elements: !401)
!401 = !{!402, !403, !404, !405, !406, !407, !408, !409, !410}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_alloc", scope: !400, file: !3, line: 102, baseType: !18, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_used", scope: !400, file: !3, line: 103, baseType: !18, size: 64, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "start_line", scope: !400, file: !3, line: 104, baseType: !223, size: 64, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "first_available", scope: !400, file: !3, line: 105, baseType: !223, size: 64, offset: 192)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "num_lines", scope: !400, file: !3, line: 106, baseType: !18, size: 64, offset: 256)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !400, file: !3, line: 107, baseType: !11, size: 64, offset: 320)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "line_start", scope: !400, file: !3, line: 108, baseType: !388, size: 64, offset: 384)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "curr_line", scope: !400, file: !3, line: 109, baseType: !388, size: 64, offset: 448)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !400, file: !3, line: 110, baseType: !399, size: 64, offset: 512)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(name: "head", scope: !2, file: !3, line: 119, type: !399, isLocal: true, isDefinition: true)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "have_read_eof", scope: !2, file: !3, line: 134, type: !205, isLocal: true, isDefinition: true)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(name: "hold_count", scope: !2, file: !3, line: 125, type: !18, isLocal: true, isDefinition: true)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(name: "last_line_number", scope: !2, file: !3, line: 128, type: !223, isLocal: true, isDefinition: true)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(name: "hold_area", scope: !2, file: !3, line: 122, type: !11, isLocal: true, isDefinition: true)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !422, line: 7, baseType: !123)
!422 = !DIFile(filename: "/usr/include/bits/types/sigset_t.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!423 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!424 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!425 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!426 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(name: "Version", scope: !429, file: !430, line: 2, type: !321, isDefinition: true)
!429 = distinct !DICompileUnit(language: DW_LANG_C99, file: !430, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !431, globals: !432)
!430 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!431 = !{}
!432 = !{!427}
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(name: "file_name", scope: !435, file: !440, line: 46, type: !321, isLocal: true, isDefinition: true)
!435 = distinct !DICompileUnit(language: DW_LANG_C99, file: !436, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !431, globals: !437)
!436 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!437 = !{!433, !438}
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !435, file: !440, line: 56, type: !205, isLocal: true, isDefinition: true)
!440 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(name: "exit_failure", scope: !443, file: !446, line: 24, type: !340, isDefinition: true)
!443 = distinct !DICompileUnit(language: DW_LANG_C99, file: !444, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !431, globals: !445)
!444 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!445 = !{!441}
!446 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(name: "program_name", scope: !449, file: !453, line: 33, type: !321, isDefinition: true)
!449 = distinct !DICompileUnit(language: DW_LANG_C99, file: !450, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !431, retainedTypes: !451, globals: !452)
!450 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!451 = !{!78, !11}
!452 = !{!447}
!453 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !456, file: !468, line: 85, type: !503, isDefinition: true)
!456 = distinct !DICompileUnit(language: DW_LANG_C99, file: !457, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !458, retainedTypes: !464, globals: !465)
!457 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!458 = !{!138, !459, !156}
!459 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !139, line: 242, baseType: !65, size: 32, elements: !460)
!460 = !{!461, !462, !463}
!461 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!462 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!463 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!464 = !{!9, !193, !18, !11}
!465 = !{!454, !466, !473, !485, !487, !492, !499, !501}
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !456, file: !468, line: 101, type: !469, isDefinition: true)
!468 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !470, size: 320, elements: !471)
!470 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !138)
!471 = !{!472}
!472 = !DISubrange(count: 10)
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !456, file: !468, line: 1052, type: !475, isDefinition: true)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !468, line: 65, size: 448, elements: !476)
!476 = !{!477, !478, !479, !483, !484}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !475, file: !468, line: 68, baseType: !138, size: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !475, file: !468, line: 71, baseType: !9, size: 32, offset: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !475, file: !468, line: 75, baseType: !480, size: 256, offset: 64)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 256, elements: !481)
!481 = !{!482}
!482 = !DISubrange(count: 8)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !475, file: !468, line: 78, baseType: !321, size: 64, offset: 320)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !475, file: !468, line: 81, baseType: !321, size: 64, offset: 384)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !456, file: !468, line: 116, type: !475, isLocal: true, isDefinition: true)
!487 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression())
!488 = distinct !DIGlobalVariable(name: "slot0", scope: !456, file: !468, line: 842, type: !489, isLocal: true, isDefinition: true)
!489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 2048, elements: !490)
!490 = !{!491}
!491 = !DISubrange(count: 256)
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(name: "slotvec", scope: !456, file: !468, line: 845, type: !494, isLocal: true, isDefinition: true)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !468, line: 834, size: 128, elements: !496)
!496 = !{!497, !498}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !495, file: !468, line: 836, baseType: !18, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !495, file: !468, line: 837, baseType: !11, size: 64, offset: 64)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(name: "nslots", scope: !456, file: !468, line: 843, type: !9, isLocal: true, isDefinition: true)
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(name: "slotvec0", scope: !456, file: !468, line: 844, type: !495, isLocal: true, isDefinition: true)
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !504, size: 704, elements: !199)
!504 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !321)
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !507, file: !510, line: 26, type: !511, isDefinition: true)
!507 = distinct !DICompileUnit(language: DW_LANG_C99, file: !508, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !431, globals: !509)
!508 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!509 = !{!505}
!510 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 376, elements: !512)
!512 = !{!513}
!513 = !DISubrange(count: 47)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !516, file: !517, line: 339, type: !9, isLocal: true, isDefinition: true)
!516 = distinct !DISubprogram(name: "rpl_fcntl", scope: !517, file: !517, line: 276, type: !518, isDefinition: true, scopeLine: 277, flags: DIFlagPrototyped, isOptimized: true, unit: !520, retainedNodes: !523)
!517 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!518 = !DISubroutineType(types: !519)
!519 = !{!9, !9, !9, null}
!520 = distinct !DICompileUnit(language: DW_LANG_C99, file: !521, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !431, globals: !522)
!521 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!522 = !{!514}
!523 = !{!524, !525, !526, !537, !538, !541, !544, !547}
!524 = !DILocalVariable(name: "fd", arg: 1, scope: !516, file: !517, line: 276, type: !9)
!525 = !DILocalVariable(name: "action", arg: 2, scope: !516, file: !517, line: 276, type: !9)
!526 = !DILocalVariable(name: "arg", scope: !516, file: !517, line: 278, type: !527)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !528, line: 30, baseType: !529)
!528 = !DIFile(filename: "/usr/lib/clang/7.0.0/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !521, line: 278, baseType: !530)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !531, size: 192, elements: !290)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !521, line: 278, size: 192, elements: !532)
!532 = !{!533, !534, !535, !536}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !531, file: !521, line: 278, baseType: !65, size: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !531, file: !521, line: 278, baseType: !65, size: 32, offset: 32)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !531, file: !521, line: 278, baseType: !78, size: 64, offset: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !531, file: !521, line: 278, baseType: !78, size: 64, offset: 128)
!537 = !DILocalVariable(name: "result", scope: !516, file: !517, line: 279, type: !9)
!538 = !DILocalVariable(name: "target", scope: !539, file: !517, line: 326, type: !9)
!539 = distinct !DILexicalBlock(scope: !540, file: !517, line: 325, column: 7)
!540 = distinct !DILexicalBlock(scope: !516, file: !517, line: 282, column: 5)
!541 = !DILocalVariable(name: "flags", scope: !542, file: !517, line: 363, type: !9)
!542 = distinct !DILexicalBlock(scope: !543, file: !517, line: 362, column: 11)
!543 = distinct !DILexicalBlock(scope: !539, file: !517, line: 361, column: 13)
!544 = !DILocalVariable(name: "saved_errno", scope: !545, file: !517, line: 366, type: !9)
!545 = distinct !DILexicalBlock(scope: !546, file: !517, line: 365, column: 15)
!546 = distinct !DILexicalBlock(scope: !542, file: !517, line: 364, column: 17)
!547 = !DILocalVariable(name: "p", scope: !548, file: !517, line: 408, type: !78)
!548 = distinct !DILexicalBlock(scope: !540, file: !517, line: 406, column: 7)
!549 = distinct !DICompileUnit(language: DW_LANG_C99, file: !550, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !431)
!550 = !DIFile(filename: "./lib/fd-reopen.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!551 = distinct !DICompileUnit(language: DW_LANG_C99, file: !552, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !431)
!552 = !DIFile(filename: "./lib/fopen-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!553 = distinct !DICompileUnit(language: DW_LANG_C99, file: !554, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !431, retainedTypes: !555)
!554 = !DIFile(filename: "./lib/umaxtostr.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!555 = !{!223}
!556 = distinct !DICompileUnit(language: DW_LANG_C99, file: !557, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !558)
!557 = !DIFile(filename: "./lib/safe-read.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!558 = !{!559}
!559 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !560, line: 40, baseType: !65, size: 32, elements: !561)
!560 = !DIFile(filename: "./lib/sys-limits.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!561 = !{!562}
!562 = !DIEnumerator(name: "SYS_BUFSIZE_MAX", value: 2146435072, isUnsigned: true)
!563 = distinct !DICompileUnit(language: DW_LANG_C99, file: !564, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !431)
!564 = !DIFile(filename: "./lib/dup-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!565 = distinct !DICompileUnit(language: DW_LANG_C99, file: !566, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !567, retainedTypes: !572)
!566 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!567 = !{!568}
!568 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !569, line: 41, baseType: !65, size: 32, elements: !570)
!569 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!570 = !{!571}
!571 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2018, isUnsigned: true)
!572 = !{!78}
!573 = distinct !DICompileUnit(language: DW_LANG_C99, file: !574, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !575, retainedTypes: !583)
!574 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!575 = !{!576}
!576 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !577, file: !180, line: 186, baseType: !65, size: 32, elements: !190)
!577 = distinct !DISubprogram(name: "x2nrealloc", scope: !180, file: !180, line: 174, type: !182, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: true, unit: !573, retainedNodes: !578)
!578 = !{!579, !580, !581, !582}
!579 = !DILocalVariable(name: "p", arg: 1, scope: !577, file: !180, line: 174, type: !78)
!580 = !DILocalVariable(name: "pn", arg: 2, scope: !577, file: !180, line: 174, type: !184)
!581 = !DILocalVariable(name: "s", arg: 3, scope: !577, file: !180, line: 174, type: !18)
!582 = !DILocalVariable(name: "n", scope: !577, file: !180, line: 176, type: !18)
!583 = !{!18, !11, !78}
!584 = distinct !DICompileUnit(language: DW_LANG_C99, file: !585, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !586)
!585 = !DIFile(filename: "./lib/xdectoimax.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!586 = !{!171}
!587 = distinct !DICompileUnit(language: DW_LANG_C99, file: !588, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !586)
!588 = !DIFile(filename: "./lib/xstrtoimax.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!589 = distinct !DICompileUnit(language: DW_LANG_C99, file: !590, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !591, retainedTypes: !592)
!590 = !DIFile(filename: "./lib/xstrtoumax.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!591 = !{!171, !156}
!592 = !{!9, !193}
!593 = distinct !DICompileUnit(language: DW_LANG_C99, file: !594, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !431, retainedTypes: !572)
!594 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!595 = distinct !DICompileUnit(language: DW_LANG_C99, file: !596, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !431)
!596 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!597 = distinct !DICompileUnit(language: DW_LANG_C99, file: !598, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !431, retainedTypes: !572)
!598 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!599 = distinct !DICompileUnit(language: DW_LANG_C99, file: !600, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !431, retainedTypes: !572)
!600 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!601 = distinct !DICompileUnit(language: DW_LANG_C99, file: !602, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !431, retainedTypes: !603)
!602 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!603 = !{!18}
!604 = distinct !DICompileUnit(language: DW_LANG_C99, file: !605, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !431)
!605 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!606 = distinct !DICompileUnit(language: DW_LANG_C99, file: !607, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !431)
!607 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!608 = distinct !DICompileUnit(language: DW_LANG_C99, file: !609, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !610, retainedTypes: !572)
!609 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!610 = !{!611}
!611 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !612, line: 41, baseType: !65, size: 32, elements: !613)
!612 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!613 = !{!614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996}
!614 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!615 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!616 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!617 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!618 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!619 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!620 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!621 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!622 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!623 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!624 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!625 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!626 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!627 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!628 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!629 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!630 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!631 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!632 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!633 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!634 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!635 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!636 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!637 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!638 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!639 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!640 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!641 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!642 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!643 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!644 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!645 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!646 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!647 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!648 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!649 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!650 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!651 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!652 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!653 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!654 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!655 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!656 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!657 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!658 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!659 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!660 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!661 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!662 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!663 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!664 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!665 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!666 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!667 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!668 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!669 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!670 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!671 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!672 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!673 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!674 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!675 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!676 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!677 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!678 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!679 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!680 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!681 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!682 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!683 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!684 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!685 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!686 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!687 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!688 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!689 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!690 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!691 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!692 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!693 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!694 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!695 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!696 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!697 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!698 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!699 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!700 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!701 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!702 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!703 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!704 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!705 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!706 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!707 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!708 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!709 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!710 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!711 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!712 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!713 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!714 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!715 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!716 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!717 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!719 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!720 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!721 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!722 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!723 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!724 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!725 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!726 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!727 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!728 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!729 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!730 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!731 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!732 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!733 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!734 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!735 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!736 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!737 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!738 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!739 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!740 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!741 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!742 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!743 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!744 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!745 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!746 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!747 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!748 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!749 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!750 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!751 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!752 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!753 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!754 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!755 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!756 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!757 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!758 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!759 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!760 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!761 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!762 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!763 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!764 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!765 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!766 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!767 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!768 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!769 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!770 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!771 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!772 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!773 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!774 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!779 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!780 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!781 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!782 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!783 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!784 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!785 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!786 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!787 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!788 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!789 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!790 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!791 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!793 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!794 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!795 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!796 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!797 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!798 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!799 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!800 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!801 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!802 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!803 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!804 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!805 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!806 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!807 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!808 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!809 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!810 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!812 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!813 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!814 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!815 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!816 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!817 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!818 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!819 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!820 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!821 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!822 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!823 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!824 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!825 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!826 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!827 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!828 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!829 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!830 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!831 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!832 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!833 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!834 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!835 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!836 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!837 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!838 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!839 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!840 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!841 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!842 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!843 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!844 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!845 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!846 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!847 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!882 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!883 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!884 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!885 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!886 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!887 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!888 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!889 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!890 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!891 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!892 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!893 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!894 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!895 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!896 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!898 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!899 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!900 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!901 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!902 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!903 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!904 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!905 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!906 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!907 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!908 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!909 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!910 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!911 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!912 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!913 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!914 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!915 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!916 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!917 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!918 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!919 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!920 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!921 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!922 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!923 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!924 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!925 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!926 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!927 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!928 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!929 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!930 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!931 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!932 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!933 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!934 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!935 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!936 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!937 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!938 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!939 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!940 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!941 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!942 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!943 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!944 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!945 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!946 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!947 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!948 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!949 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!950 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!951 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!952 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!953 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!954 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!955 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!956 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!957 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!958 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!959 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!960 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!961 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!962 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!963 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!964 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!965 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!966 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!967 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!968 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!969 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!970 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!971 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!972 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!973 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!974 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!975 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!976 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!977 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!978 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!979 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!980 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!981 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!982 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!983 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!984 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!985 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!986 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!987 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!988 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!989 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!990 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!991 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!992 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!993 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!994 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!995 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!996 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!997 = !{!"clang version 7.0.0 (tags/RELEASE_700/final)"}
!998 = !{i32 2, !"Dwarf Version", i32 4}
!999 = !{i32 2, !"Debug Info Version", i32 3}
!1000 = !{i32 1, !"wchar_size", i32 4}
!1001 = !{i32 7, !"PIC Level", i32 2}
!1002 = !{i32 7, !"PIE Level", i32 2}
!1003 = distinct !DISubprogram(name: "xalloc_die", scope: !3, file: !3, line: 231, type: !134, isDefinition: true, scopeLine: 232, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, retainedNodes: !431)
!1004 = !DILocation(line: 233, column: 22, scope: !1003)
!1005 = !DILocation(line: 233, column: 3, scope: !1003)
!1006 = !DILocation(line: 234, column: 3, scope: !1003)
!1007 = distinct !DISubprogram(name: "cleanup_fatal", scope: !3, file: !3, line: 224, type: !134, isLocal: true, isDefinition: true, scopeLine: 225, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, retainedNodes: !431)
!1008 = !DILocation(line: 226, column: 3, scope: !1007)
!1009 = !DILocation(line: 227, column: 3, scope: !1007)
!1010 = distinct !DISubprogram(name: "cleanup", scope: !3, file: !3, line: 211, type: !134, isLocal: true, isDefinition: true, scopeLine: 212, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1011)
!1011 = !{!1012}
!1012 = !DILocalVariable(name: "oldset", scope: !1010, file: !3, line: 213, type: !421)
!1013 = !DILocation(line: 213, column: 3, scope: !1010)
!1014 = !DILocation(line: 215, column: 3, scope: !1010)
!1015 = !DILocation(line: 213, column: 12, scope: !1010)
!1016 = !DILocation(line: 217, column: 3, scope: !1010)
!1017 = !DILocation(line: 218, column: 3, scope: !1010)
!1018 = !DILocation(line: 219, column: 3, scope: !1010)
!1019 = !DILocation(line: 220, column: 1, scope: !1010)
!1020 = distinct !DISubprogram(name: "close_output_file", scope: !3, file: !3, line: 1001, type: !134, isLocal: true, isDefinition: true, scopeLine: 1002, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1021)
!1021 = !{!1022, !1027, !1028, !1029}
!1022 = !DILocalVariable(name: "oldset", scope: !1023, file: !3, line: 1019, type: !421)
!1023 = distinct !DILexicalBlock(scope: !1024, file: !3, line: 1018, column: 9)
!1024 = distinct !DILexicalBlock(scope: !1025, file: !3, line: 1017, column: 11)
!1025 = distinct !DILexicalBlock(scope: !1026, file: !3, line: 1004, column: 5)
!1026 = distinct !DILexicalBlock(scope: !1020, file: !3, line: 1003, column: 7)
!1027 = !DILocalVariable(name: "unlink_ok", scope: !1023, file: !3, line: 1020, type: !205)
!1028 = !DILocalVariable(name: "unlink_errno", scope: !1023, file: !3, line: 1021, type: !9)
!1029 = !DILocalVariable(name: "buf", scope: !1030, file: !3, line: 1037, type: !363)
!1030 = distinct !DILexicalBlock(scope: !1031, file: !3, line: 1036, column: 13)
!1031 = distinct !DILexicalBlock(scope: !1032, file: !3, line: 1035, column: 15)
!1032 = distinct !DILexicalBlock(scope: !1024, file: !3, line: 1034, column: 9)
!1033 = !DILocation(line: 1003, column: 7, scope: !1026)
!1034 = !{!1035, !1035, i64 0}
!1035 = !{!"any pointer", !1036, i64 0}
!1036 = !{!"omnipotent char", !1037, i64 0}
!1037 = !{!"Simple C/C++ TBAA"}
!1038 = !DILocation(line: 1003, column: 7, scope: !1020)
!1039 = !DILocalVariable(name: "__stream", arg: 1, scope: !1040, file: !1041, line: 135, type: !258)
!1040 = distinct !DISubprogram(name: "ferror_unlocked", scope: !1041, file: !1041, line: 135, type: !1042, isDefinition: true, scopeLine: 136, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1044)
!1041 = !DIFile(filename: "/usr/include/bits/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!1042 = !DISubroutineType(types: !1043)
!1043 = !{!9, !258}
!1044 = !{!1039}
!1045 = !DILocation(line: 135, column: 1, scope: !1040, inlinedAt: !1046)
!1046 = distinct !DILocation(line: 1005, column: 11, scope: !1047)
!1047 = distinct !DILexicalBlock(scope: !1025, file: !3, line: 1005, column: 11)
!1048 = !DILocation(line: 137, column: 10, scope: !1040, inlinedAt: !1046)
!1049 = !{!1050, !1051, i64 0}
