source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.field_range_pair = type { i64, i64 }
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [31 x i8] c"Usage: %s OPTION... [FILE]...\0A\00", align 1
@.str.2 = private unnamed_addr constant [66 x i8] c"Print selected parts of lines from each FILE to standard output.\0A\00", align 1
@stdout = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str.27 = private unnamed_addr constant [56 x i8] c"\0AWith no FILE, or when FILE is -, read standard input.\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "operating_mode", scope: !2, file: !3, line: 87, type: !5, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !40, globals: !194, nameTableKind: None)
!3 = !DIFile(filename: "src/cut.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !11, !17, !31}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "operating_mode", file: !3, line: 76, baseType: !6, size: 32, elements: !7)
!6 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!7 = !{!8, !9, !10}
!8 = !DIEnumerator(name: "undefined_mode", value: 0, isUnsigned: true)
!9 = !DIEnumerator(name: "byte_mode", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "field_mode", value: 2, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 33, baseType: !6, size: 32, elements: !13)
!12 = !DIFile(filename: "src/set-fields.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!13 = !{!14, !15, !16}
!14 = !DIEnumerator(name: "SETFLD_ALLOW_DASH", value: 1, isUnsigned: true)
!15 = !DIEnumerator(name: "SETFLD_COMPLEMENT", value: 2, isUnsigned: true)
!16 = !DIEnumerator(name: "SETFLD_ERRMSG_USE_POS", value: 4, isUnsigned: true)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !18, line: 32, baseType: !6, size: 32, elements: !19)
!18 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!19 = !{!20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30}
!20 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!21 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!22 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!23 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!24 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!25 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!26 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!27 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!28 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!29 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!30 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!31 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !32, line: 45, baseType: !6, size: 32, elements: !33)
!32 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!33 = !{!34, !35, !36, !37, !38, !39}
!34 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0, isUnsigned: true)
!35 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2, isUnsigned: true)
!36 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5, isUnsigned: true)
!37 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4, isUnsigned: true)
!38 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3, isUnsigned: true)
!39 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1, isUnsigned: true)
!40 = !{!41, !51, !112, !116, !120, !123, !126, !133, !148, !152, !45, !102, !154, !158, !161, !165, !168, !171, !104, !47, !174, !179, !180, !181, !184, !190, !193}
!41 = !DISubprogram(name: "dcgettext", scope: !42, file: !42, line: 51, type: !43, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!42 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!43 = !DISubroutineType(types: !44)
!44 = !{!45, !47, !47, !49}
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!49 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!50 = !{}
!51 = !DISubprogram(name: "fputs_unlocked", scope: !52, file: !52, line: 662, type: !53, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!52 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!53 = !DISubroutineType(types: !54)
!54 = !{!49, !47, !55}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !57, line: 49, size: 1728, elements: !58)
!57 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!58 = !{!59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !74, !75, !76, !77, !81, !83, !85, !89, !92, !94, !97, !100, !101, !103, !107, !108}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !56, file: !57, line: 51, baseType: !49, size: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !56, file: !57, line: 54, baseType: !45, size: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !56, file: !57, line: 55, baseType: !45, size: 64, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !56, file: !57, line: 56, baseType: !45, size: 64, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !56, file: !57, line: 57, baseType: !45, size: 64, offset: 256)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !56, file: !57, line: 58, baseType: !45, size: 64, offset: 320)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !56, file: !57, line: 59, baseType: !45, size: 64, offset: 384)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !56, file: !57, line: 60, baseType: !45, size: 64, offset: 448)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !56, file: !57, line: 61, baseType: !45, size: 64, offset: 512)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !56, file: !57, line: 64, baseType: !45, size: 64, offset: 576)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !56, file: !57, line: 65, baseType: !45, size: 64, offset: 640)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !56, file: !57, line: 66, baseType: !45, size: 64, offset: 704)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !56, file: !57, line: 68, baseType: !72, size: 64, offset: 768)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !57, line: 36, flags: DIFlagFwdDecl)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !56, file: !57, line: 70, baseType: !55, size: 64, offset: 832)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !56, file: !57, line: 72, baseType: !49, size: 32, offset: 896)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !56, file: !57, line: 73, baseType: !49, size: 32, offset: 928)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !56, file: !57, line: 74, baseType: !78, size: 64, offset: 960)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !79, line: 152, baseType: !80)
!79 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!80 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !56, file: !57, line: 77, baseType: !82, size: 16, offset: 1024)
!82 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !56, file: !57, line: 78, baseType: !84, size: 8, offset: 1040)
!84 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !56, file: !57, line: 79, baseType: !86, size: 8, offset: 1048)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 8, elements: !87)
!87 = !{!88}
!88 = !DISubrange(count: 1)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !56, file: !57, line: 81, baseType: !90, size: 64, offset: 1088)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !57, line: 43, baseType: null)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !56, file: !57, line: 89, baseType: !93, size: 64, offset: 1152)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !79, line: 153, baseType: !80)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !56, file: !57, line: 91, baseType: !95, size: 64, offset: 1216)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !57, line: 37, flags: DIFlagFwdDecl)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !56, file: !57, line: 92, baseType: !98, size: 64, offset: 1280)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !57, line: 38, flags: DIFlagFwdDecl)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !56, file: !57, line: 93, baseType: !55, size: 64, offset: 1344)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !56, file: !57, line: 94, baseType: !102, size: 64, offset: 1408)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !56, file: !57, line: 95, baseType: !104, size: 64, offset: 1472)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !105, line: 46, baseType: !106)
!105 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!106 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !56, file: !57, line: 96, baseType: !49, size: 32, offset: 1536)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !56, file: !57, line: 98, baseType: !109, size: 160, offset: 1568)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 160, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 20)
!112 = !DISubprogram(name: "set_program_name", scope: !113, file: !113, line: 37, type: !114, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!113 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!114 = !DISubroutineType(types: !115)
!115 = !{null, !47}
!116 = !DISubprogram(name: "setlocale", scope: !117, file: !117, line: 122, type: !118, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!117 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!118 = !DISubroutineType(types: !119)
!119 = !{!45, !49, !47}
!120 = !DISubprogram(name: "bindtextdomain", scope: !42, file: !42, line: 86, type: !121, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!121 = !DISubroutineType(types: !122)
!122 = !{!45, !47, !47}
!123 = !DISubprogram(name: "textdomain", scope: !42, file: !42, line: 82, type: !124, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!124 = !DISubroutineType(types: !125)
!125 = !{!45, !47}
!126 = !DISubprogram(name: "atexit", scope: !127, file: !127, line: 595, type: !128, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!127 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!128 = !DISubroutineType(types: !129)
!129 = !{!49, !130}
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{null}
!133 = !DISubprogram(name: "getopt_long", scope: !134, file: !134, line: 66, type: !135, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!134 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!135 = !DISubroutineType(types: !136)
!136 = !{!49, !49, !137, !47, !139, !146}
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !134, line: 50, size: 256, elements: !142)
!142 = !{!143, !144, !145, !147}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !141, file: !134, line: 52, baseType: !47, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !141, file: !134, line: 55, baseType: !49, size: 32, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !141, file: !134, line: 56, baseType: !146, size: 64, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !141, file: !134, line: 57, baseType: !49, size: 32, offset: 192)
!148 = !DISubprogram(name: "error", scope: !149, file: !149, line: 52, type: !150, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!149 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!150 = !DISubroutineType(types: !151)
!151 = !{null, !49, !49, !47, null}
!152 = !DISubprogram(name: "xstrdup", scope: !153, file: !153, line: 64, type: !124, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!153 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!154 = !DISubprogram(name: "version_etc", scope: !155, file: !155, line: 69, type: !156, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!155 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!156 = !DISubroutineType(types: !157)
!157 = !{null, !55, !47, !47, !47, null}
!158 = !DISubprogram(name: "set_fields", scope: !12, file: !12, line: 42, type: !159, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!159 = !DISubroutineType(types: !160)
!160 = !{null, !47, !6}
!161 = !DISubprogram(name: "rpl_fclose", scope: !162, file: !162, line: 672, type: !163, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!162 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!163 = !DISubroutineType(types: !164)
!164 = !{!49, !55}
!165 = !DISubprogram(name: "quotearg_n_style_colon", scope: !18, file: !18, line: 397, type: !166, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!166 = !DISubroutineType(types: !167)
!167 = !{!45, !49, !17, !47}
!168 = !DISubprogram(name: "fadvise", scope: !32, file: !32, line: 72, type: !169, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!169 = !DISubroutineType(types: !170)
!170 = !{null, !55, !31}
!171 = !DISubprogram(name: "clearerr_unlocked", scope: !52, file: !52, line: 765, type: !172, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!172 = !DISubroutineType(types: !173)
!173 = !{null, !55}
!174 = !DISubprogram(name: "fwrite_unlocked", scope: !52, file: !52, line: 675, type: !175, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!175 = !DISubroutineType(types: !176)
!176 = !{!106, !177, !106, !106, !55}
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!181 = !DISubprogram(name: "ungetc", scope: !52, file: !52, line: 639, type: !182, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!182 = !DISubroutineType(types: !183)
!183 = !{!49, !49, !55}
!184 = !DISubprogram(name: "getndelim2", scope: !185, file: !185, line: 38, type: !186, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!185 = !DIFile(filename: "./lib/getndelim2.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!186 = !DISubroutineType(types: !187)
!187 = !{!80, !188, !189, !106, !106, !49, !49, !55}
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!190 = !DISubprogram(name: "free", scope: !127, file: !127, line: 565, type: !191, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!191 = !DISubroutineType(types: !192)
!192 = !{null, !102}
!193 = !DISubprogram(name: "xalloc_die", scope: !153, file: !153, line: 51, type: !131, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !50)
!194 = !{!195, !0, !211, !213, !215, !217, !219, !221, !223, !225, !230, !232, !242, !244}
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "dummy", scope: !197, file: !3, line: 586, type: !208, isLocal: true, isDefinition: true)
!197 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 480, type: !198, scopeLine: 481, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !200)
!198 = !DISubroutineType(types: !199)
!199 = !{!49, !49, !188}
!200 = !{!201, !202, !203, !204, !206, !207}
!201 = !DILocalVariable(name: "argc", arg: 1, scope: !197, file: !3, line: 480, type: !49)
!202 = !DILocalVariable(name: "argv", arg: 2, scope: !197, file: !3, line: 480, type: !188)
!203 = !DILocalVariable(name: "optc", scope: !197, file: !3, line: 482, type: !49)
!204 = !DILocalVariable(name: "ok", scope: !197, file: !3, line: 483, type: !205)
!205 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!206 = !DILocalVariable(name: "delim_specified", scope: !197, file: !3, line: 484, type: !205)
!207 = !DILocalVariable(name: "spec_list_string", scope: !197, file: !3, line: 485, type: !45)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 16, elements: !209)
!209 = !{!210}
!210 = !DISubrange(count: 2)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "suppress_non_delimited", scope: !2, file: !3, line: 92, type: !205, isLocal: true, isDefinition: true)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(name: "complement", scope: !2, file: !3, line: 96, type: !205, isLocal: true, isDefinition: true)
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(name: "delim", scope: !2, file: !3, line: 99, type: !180, isLocal: true, isDefinition: true)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(name: "output_delimiter_specified", scope: !2, file: !3, line: 105, type: !205, isLocal: true, isDefinition: true)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(name: "output_delimiter_length", scope: !2, file: !3, line: 108, type: !104, isLocal: true, isDefinition: true)
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(name: "output_delimiter_string", scope: !2, file: !3, line: 112, type: !45, isLocal: true, isDefinition: true)
!223 = !DIGlobalVariableExpression(var: !224, expr: !DIExpression())
!224 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 115, type: !205, isLocal: true, isDefinition: true)
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression())
!226 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 125, type: !227, isLocal: true, isDefinition: true)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 2816, elements: !228)
!228 = !{!229}
!229 = !DISubrange(count: 11)
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(name: "line_delim", scope: !2, file: !3, line: 102, type: !180, isLocal: true, isDefinition: true)
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(name: "current_rp", scope: !2, file: !3, line: 62, type: !234, isLocal: true, isDefinition: true)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "field_range_pair", file: !12, line: 20, size: 128, elements: !236)
!236 = !{!237, !241}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "lo", scope: !235, file: !12, line: 22, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !239, line: 102, baseType: !240)
!239 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !79, line: 73, baseType: !106)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "hi", scope: !235, file: !12, line: 23, baseType: !238, size: 64, offset: 64)
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(name: "field_1_buffer", scope: !2, file: !3, line: 71, type: !45, isLocal: true, isDefinition: true)
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(name: "field_1_bufsize", scope: !2, file: !3, line: 74, type: !104, isLocal: true, isDefinition: true)
!246 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!247 = !DIGlobalVariableExpression(var: !224, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!248 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!249 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551606, DW_OP_mul, DW_OP_constu, 10, DW_OP_plus, DW_OP_stack_value))
!250 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(name: "n_frp", scope: !253, file: !254, line: 31, type: !104, isDefinition: true)
!253 = distinct !DICompileUnit(language: DW_LANG_C99, file: !254, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !255, retainedTypes: !283, globals: !312, nameTableKind: None)
!254 = !DIFile(filename: "src/set-fields.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!255 = !{!11, !256, !271}
!256 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !257, line: 46, baseType: !6, size: 32, elements: !258)
!257 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!258 = !{!259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270}
!259 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!260 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!261 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!262 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!263 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!264 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!265 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!266 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!267 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!268 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!269 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!270 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!271 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !272, file: !153, line: 186, baseType: !6, size: 32, elements: !281)
!272 = distinct !DISubprogram(name: "x2nrealloc", scope: !153, file: !153, line: 174, type: !273, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !253, retainedNodes: !276)
!273 = !DISubroutineType(types: !274)
!274 = !{!102, !102, !275, !104}
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!276 = !{!277, !278, !279, !280}
!277 = !DILocalVariable(name: "p", arg: 1, scope: !272, file: !153, line: 174, type: !102)
!278 = !DILocalVariable(name: "pn", arg: 2, scope: !272, file: !153, line: 174, type: !275)
!279 = !DILocalVariable(name: "s", arg: 3, scope: !272, file: !153, line: 174, type: !104)
!280 = !DILocalVariable(name: "n", scope: !272, file: !153, line: 176, type: !104)
!281 = !{!282}
!282 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!283 = !{!41, !148, !284, !49, !82, !6, !288, !102, !238, !289, !293, !190, !297, !303, !104, !193, !306}
!284 = !DISubprogram(name: "usage", scope: !285, file: !285, line: 711, type: !286, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !50)
!285 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!286 = !DISubroutineType(types: !287)
!287 = !{null, !49}
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!289 = !DISubprogram(name: "xstrndup", scope: !290, file: !290, line: 23, type: !291, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!290 = !DIFile(filename: "./lib/xstrndup.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!291 = !DISubroutineType(types: !292)
!292 = !{!45, !47, !106}
!293 = !DISubprogram(name: "quote", scope: !294, file: !294, line: 44, type: !295, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!294 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!295 = !DISubroutineType(types: !296)
!296 = !{!47, !47}
!297 = !DISubprogram(name: "qsort", scope: !127, file: !127, line: 830, type: !298, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!298 = !DISubroutineType(types: !299)
!299 = !{null, !102, !106, !106, !300}
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DISubroutineType(types: !302)
!302 = !{!49, !177, !177}
!303 = !DISubprogram(name: "xrealloc", scope: !153, file: !153, line: 59, type: !304, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!304 = !DISubroutineType(types: !305)
!305 = !{!102, !102, !106}
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !308)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "field_range_pair", file: !12, line: 20, size: 128, elements: !309)
!309 = !{!310, !311}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "lo", scope: !308, file: !12, line: 22, baseType: !238, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "hi", scope: !308, file: !12, line: 23, baseType: !238, size: 64, offset: 64)
!312 = !{!313, !340, !251, !343}
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(name: "num_start", scope: !315, file: !254, line: 239, type: !47, isLocal: true, isDefinition: true)
!315 = distinct !DISubprogram(name: "set_fields", scope: !254, file: !254, line: 138, type: !159, scopeLine: 139, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !253, retainedNodes: !316)
!316 = !{!317, !318, !319, !320, !321, !322, !323, !324, !325, !333, !334, !336}
!317 = !DILocalVariable(name: "fieldstr", arg: 1, scope: !315, file: !254, line: 138, type: !47)
!318 = !DILocalVariable(name: "options", arg: 2, scope: !315, file: !254, line: 138, type: !6)
!319 = !DILocalVariable(name: "initial", scope: !315, file: !254, line: 140, type: !238)
!320 = !DILocalVariable(name: "value", scope: !315, file: !254, line: 141, type: !238)
!321 = !DILocalVariable(name: "lhs_specified", scope: !315, file: !254, line: 142, type: !205)
!322 = !DILocalVariable(name: "rhs_specified", scope: !315, file: !254, line: 143, type: !205)
!323 = !DILocalVariable(name: "dash_found", scope: !315, file: !254, line: 144, type: !205)
!324 = !DILocalVariable(name: "in_digits", scope: !315, file: !254, line: 146, type: !205)
!325 = !DILocalVariable(name: "len", scope: !326, file: !254, line: 256, type: !104)
!326 = distinct !DILexicalBlock(scope: !327, file: !254, line: 252, column: 13)
!327 = distinct !DILexicalBlock(scope: !328, file: !254, line: 250, column: 15)
!328 = distinct !DILexicalBlock(scope: !329, file: !254, line: 236, column: 9)
!329 = distinct !DILexicalBlock(scope: !330, file: !254, line: 235, column: 16)
!330 = distinct !DILexicalBlock(scope: !331, file: !254, line: 181, column: 16)
!331 = distinct !DILexicalBlock(scope: !332, file: !254, line: 161, column: 11)
!332 = distinct !DILexicalBlock(scope: !315, file: !254, line: 160, column: 5)
!333 = !DILocalVariable(name: "bad_num", scope: !326, file: !254, line: 257, type: !45)
!334 = !DILocalVariable(name: "i", scope: !335, file: !254, line: 286, type: !104)
!335 = distinct !DILexicalBlock(scope: !315, file: !254, line: 286, column: 3)
!336 = !DILocalVariable(name: "j", scope: !337, file: !254, line: 288, type: !104)
!337 = distinct !DILexicalBlock(scope: !338, file: !254, line: 288, column: 7)
!338 = distinct !DILexicalBlock(scope: !339, file: !254, line: 287, column: 5)
!339 = distinct !DILexicalBlock(scope: !335, file: !254, line: 286, column: 3)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(name: "frp", scope: !253, file: !254, line: 28, type: !342, isDefinition: true)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "n_frp_allocated", scope: !253, file: !254, line: 34, type: !104, isLocal: true, isDefinition: true)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(name: "Version", scope: !347, file: !348, line: 2, type: !47, isDefinition: true)
!347 = distinct !DICompileUnit(language: DW_LANG_C99, file: !348, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !50, globals: !349, nameTableKind: None)
!348 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!349 = !{!345}
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "file_name", scope: !352, file: !353, line: 46, type: !47, isLocal: true, isDefinition: true)
!352 = distinct !DICompileUnit(language: DW_LANG_C99, file: !353, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !50, retainedTypes: !354, globals: !392, nameTableKind: None)
!353 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!354 = !{!355, !41, !391, !148}
!355 = !DISubprogram(name: "close_stream", scope: !356, file: !356, line: 2, type: !357, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!356 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!357 = !DISubroutineType(types: !358)
!358 = !{!49, !359}
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !57, line: 49, size: 1728, elements: !361)
!361 = !{!362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !360, file: !57, line: 51, baseType: !49, size: 32)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !360, file: !57, line: 54, baseType: !45, size: 64, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !360, file: !57, line: 55, baseType: !45, size: 64, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !360, file: !57, line: 56, baseType: !45, size: 64, offset: 192)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !360, file: !57, line: 57, baseType: !45, size: 64, offset: 256)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !360, file: !57, line: 58, baseType: !45, size: 64, offset: 320)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !360, file: !57, line: 59, baseType: !45, size: 64, offset: 384)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !360, file: !57, line: 60, baseType: !45, size: 64, offset: 448)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !360, file: !57, line: 61, baseType: !45, size: 64, offset: 512)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !360, file: !57, line: 64, baseType: !45, size: 64, offset: 576)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !360, file: !57, line: 65, baseType: !45, size: 64, offset: 640)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !360, file: !57, line: 66, baseType: !45, size: 64, offset: 704)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !360, file: !57, line: 68, baseType: !72, size: 64, offset: 768)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !360, file: !57, line: 70, baseType: !359, size: 64, offset: 832)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !360, file: !57, line: 72, baseType: !49, size: 32, offset: 896)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !360, file: !57, line: 73, baseType: !49, size: 32, offset: 928)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !360, file: !57, line: 74, baseType: !78, size: 64, offset: 960)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !360, file: !57, line: 77, baseType: !82, size: 16, offset: 1024)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !360, file: !57, line: 78, baseType: !84, size: 8, offset: 1040)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !360, file: !57, line: 79, baseType: !86, size: 8, offset: 1048)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !360, file: !57, line: 81, baseType: !90, size: 64, offset: 1088)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !360, file: !57, line: 89, baseType: !93, size: 64, offset: 1152)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !360, file: !57, line: 91, baseType: !95, size: 64, offset: 1216)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !360, file: !57, line: 92, baseType: !98, size: 64, offset: 1280)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !360, file: !57, line: 93, baseType: !359, size: 64, offset: 1344)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !360, file: !57, line: 94, baseType: !102, size: 64, offset: 1408)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !360, file: !57, line: 95, baseType: !104, size: 64, offset: 1472)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !360, file: !57, line: 96, baseType: !49, size: 32, offset: 1536)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !360, file: !57, line: 98, baseType: !109, size: 160, offset: 1568)
!391 = !DISubprogram(name: "quotearg_colon", scope: !18, file: !18, line: 391, type: !124, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!392 = !{!350, !393}
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !352, file: !353, line: 56, type: !205, isLocal: true, isDefinition: true)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "exit_failure", scope: !397, file: !398, line: 24, type: !400, isDefinition: true)
!397 = distinct !DICompileUnit(language: DW_LANG_C99, file: !398, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !50, globals: !399, nameTableKind: None)
!398 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!399 = !{!395}
!400 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !49)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "program_name", scope: !403, file: !404, line: 33, type: !47, isDefinition: true)
!403 = distinct !DICompileUnit(language: DW_LANG_C99, file: !404, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !50, retainedTypes: !405, globals: !441, nameTableKind: None)
!404 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!405 = !{!102, !406, !45}
!406 = !DISubprogram(name: "fputs", scope: !52, file: !52, line: 626, type: !407, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!407 = !DISubroutineType(types: !408)
!408 = !{!49, !47, !409}
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !57, line: 49, size: 1728, elements: !411)
!411 = !{!412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !410, file: !57, line: 51, baseType: !49, size: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !410, file: !57, line: 54, baseType: !45, size: 64, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !410, file: !57, line: 55, baseType: !45, size: 64, offset: 128)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !410, file: !57, line: 56, baseType: !45, size: 64, offset: 192)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !410, file: !57, line: 57, baseType: !45, size: 64, offset: 256)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !410, file: !57, line: 58, baseType: !45, size: 64, offset: 320)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !410, file: !57, line: 59, baseType: !45, size: 64, offset: 384)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !410, file: !57, line: 60, baseType: !45, size: 64, offset: 448)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !410, file: !57, line: 61, baseType: !45, size: 64, offset: 512)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !410, file: !57, line: 64, baseType: !45, size: 64, offset: 576)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !410, file: !57, line: 65, baseType: !45, size: 64, offset: 640)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !410, file: !57, line: 66, baseType: !45, size: 64, offset: 704)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !410, file: !57, line: 68, baseType: !72, size: 64, offset: 768)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !410, file: !57, line: 70, baseType: !409, size: 64, offset: 832)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !410, file: !57, line: 72, baseType: !49, size: 32, offset: 896)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !410, file: !57, line: 73, baseType: !49, size: 32, offset: 928)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !410, file: !57, line: 74, baseType: !78, size: 64, offset: 960)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !410, file: !57, line: 77, baseType: !82, size: 16, offset: 1024)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !410, file: !57, line: 78, baseType: !84, size: 8, offset: 1040)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !410, file: !57, line: 79, baseType: !86, size: 8, offset: 1048)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !410, file: !57, line: 81, baseType: !90, size: 64, offset: 1088)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !410, file: !57, line: 89, baseType: !93, size: 64, offset: 1152)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !410, file: !57, line: 91, baseType: !95, size: 64, offset: 1216)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !410, file: !57, line: 92, baseType: !98, size: 64, offset: 1280)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !410, file: !57, line: 93, baseType: !409, size: 64, offset: 1344)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !410, file: !57, line: 94, baseType: !102, size: 64, offset: 1408)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !410, file: !57, line: 95, baseType: !104, size: 64, offset: 1472)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !410, file: !57, line: 96, baseType: !49, size: 32, offset: 1536)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !410, file: !57, line: 98, baseType: !109, size: 160, offset: 1568)
!441 = !{!401}
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !444, file: !445, line: 85, type: !539, isDefinition: true)
!444 = distinct !DICompileUnit(language: DW_LANG_C99, file: !445, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !446, retainedTypes: !452, globals: !512, nameTableKind: None)
!445 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!446 = !{!17, !447, !256}
!447 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !18, line: 242, baseType: !6, size: 32, elements: !448)
!448 = !{!449, !450, !451}
!449 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!450 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!451 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!452 = !{!453, !456, !190, !471, !49, !82, !474, !104, !491, !495, !41, !501, !505, !45, !509, !193, !303}
!453 = !DISubprogram(name: "xmemdup", scope: !153, file: !153, line: 62, type: !454, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!454 = !DISubroutineType(types: !455)
!455 = !{!102, !177, !106}
!456 = !DISubprogram(name: "quotearg_alloc_mem", scope: !18, file: !18, line: 342, type: !457, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!457 = !DISubroutineType(types: !458)
!458 = !{!45, !47, !106, !189, !459}
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !461)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !445, line: 65, size: 448, elements: !462)
!462 = !{!463, !464, !465, !469, !470}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !461, file: !445, line: 68, baseType: !17, size: 32)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !461, file: !445, line: 71, baseType: !49, size: 32, offset: 32)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !461, file: !445, line: 75, baseType: !466, size: 256, offset: 64)
!466 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !467)
!467 = !{!468}
!468 = !DISubrange(count: 8)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !461, file: !445, line: 78, baseType: !47, size: 64, offset: 320)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !461, file: !445, line: 81, baseType: !47, size: 64, offset: 384)
!471 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !18, file: !18, line: 408, type: !472, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!472 = !DISubroutineType(types: !473)
!473 = !{!45, !49, !47, !47, !47, !106}
!474 = !DISubprogram(name: "rpl_mbrtowc", scope: !475, file: !475, line: 717, type: !476, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!475 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!476 = !DISubroutineType(types: !477)
!477 = !{!106, !146, !47, !106, !478}
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !480, line: 13, size: 64, elements: !481)
!480 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!481 = !{!482, !483}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !479, file: !480, line: 15, baseType: !49, size: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !479, file: !480, line: 20, baseType: !484, size: 32, offset: 32)
!484 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !479, file: !480, line: 16, size: 32, elements: !485)
!485 = !{!486, !487}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !484, file: !480, line: 18, baseType: !6, size: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !484, file: !480, line: 19, baseType: !488, size: 32)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 32, elements: !489)
!489 = !{!490}
!490 = !DISubrange(count: 4)
!491 = !DISubprogram(name: "iswprint", scope: !492, file: !492, line: 120, type: !493, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!492 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!493 = !DISubroutineType(types: !494)
!494 = !{!49, !6}
!495 = !DISubprogram(name: "mbsinit", scope: !496, file: !496, line: 292, type: !497, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!496 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!497 = !DISubroutineType(types: !498)
!498 = !{!49, !499}
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !479)
!501 = !DISubprogram(name: "locale_charset", scope: !502, file: !502, line: 35, type: !503, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!502 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!503 = !DISubroutineType(types: !504)
!504 = !{!47}
!505 = !DISubprogram(name: "c_strcasecmp", scope: !506, file: !506, line: 42, type: !507, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!506 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!507 = !DISubroutineType(types: !508)
!508 = !{!49, !47, !47}
!509 = !DISubprogram(name: "xmalloc", scope: !153, file: !153, line: 53, type: !510, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!510 = !DISubroutineType(types: !511)
!511 = !{!102, !106}
!512 = !{!442, !513, !519, !521, !523, !528, !535, !537}
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !444, file: !445, line: 101, type: !515, isDefinition: true)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !516, size: 320, elements: !517)
!516 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!517 = !{!518}
!518 = !DISubrange(count: 10)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !444, file: !445, line: 1052, type: !461, isDefinition: true)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !444, file: !445, line: 116, type: !461, isLocal: true, isDefinition: true)
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(name: "slot0", scope: !444, file: !445, line: 842, type: !525, isLocal: true, isDefinition: true)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 2048, elements: !526)
!526 = !{!527}
!527 = !DISubrange(count: 256)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(name: "slotvec", scope: !444, file: !445, line: 845, type: !530, isLocal: true, isDefinition: true)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !445, line: 834, size: 128, elements: !532)
!532 = !{!533, !534}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !531, file: !445, line: 836, baseType: !104, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !531, file: !445, line: 837, baseType: !45, size: 64, offset: 64)
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(name: "nslots", scope: !444, file: !445, line: 843, type: !49, isLocal: true, isDefinition: true)
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(name: "slotvec0", scope: !444, file: !445, line: 844, type: !531, isLocal: true, isDefinition: true)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !540, size: 704, elements: !228)
!540 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !47)
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !543, file: !544, line: 26, type: !546, isDefinition: true)
!543 = distinct !DICompileUnit(language: DW_LANG_C99, file: !544, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !50, globals: !545, nameTableKind: None)
!544 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!545 = !{!541}
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 376, elements: !547)
!547 = !{!548}
!548 = !DISubrange(count: 47)
!549 = distinct !DICompileUnit(language: DW_LANG_C99, file: !550, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !551, retainedTypes: !552, nameTableKind: None)
!550 = !DIFile(filename: "lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!551 = !{!31}
!552 = !{!553, !557}
!553 = !DISubprogram(name: "posix_fadvise", scope: !554, file: !554, line: 288, type: !555, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!554 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
!555 = !DISubroutineType(types: !556)
!556 = !{!49, !49, !80, !80, !49}
!557 = !DISubprogram(name: "fileno", scope: !52, file: !52, line: 786, type: !558, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!558 = !DISubroutineType(types: !559)
!559 = !{!49, !560}
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !57, line: 49, size: 1728, elements: !562)
!562 = !{!563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !561, file: !57, line: 51, baseType: !49, size: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !561, file: !57, line: 54, baseType: !45, size: 64, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !561, file: !57, line: 55, baseType: !45, size: 64, offset: 128)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !561, file: !57, line: 56, baseType: !45, size: 64, offset: 192)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !561, file: !57, line: 57, baseType: !45, size: 64, offset: 256)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !561, file: !57, line: 58, baseType: !45, size: 64, offset: 320)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !561, file: !57, line: 59, baseType: !45, size: 64, offset: 384)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !561, file: !57, line: 60, baseType: !45, size: 64, offset: 448)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !561, file: !57, line: 61, baseType: !45, size: 64, offset: 512)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !561, file: !57, line: 64, baseType: !45, size: 64, offset: 576)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !561, file: !57, line: 65, baseType: !45, size: 64, offset: 640)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !561, file: !57, line: 66, baseType: !45, size: 64, offset: 704)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !561, file: !57, line: 68, baseType: !72, size: 64, offset: 768)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !561, file: !57, line: 70, baseType: !560, size: 64, offset: 832)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !561, file: !57, line: 72, baseType: !49, size: 32, offset: 896)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !561, file: !57, line: 73, baseType: !49, size: 32, offset: 928)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !561, file: !57, line: 74, baseType: !78, size: 64, offset: 960)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !561, file: !57, line: 77, baseType: !82, size: 16, offset: 1024)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !561, file: !57, line: 78, baseType: !84, size: 8, offset: 1040)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !561, file: !57, line: 79, baseType: !86, size: 8, offset: 1048)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !561, file: !57, line: 81, baseType: !90, size: 64, offset: 1088)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !561, file: !57, line: 89, baseType: !93, size: 64, offset: 1152)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !561, file: !57, line: 91, baseType: !95, size: 64, offset: 1216)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !561, file: !57, line: 92, baseType: !98, size: 64, offset: 1280)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !561, file: !57, line: 93, baseType: !560, size: 64, offset: 1344)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !561, file: !57, line: 94, baseType: !102, size: 64, offset: 1408)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !561, file: !57, line: 95, baseType: !104, size: 64, offset: 1472)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !561, file: !57, line: 96, baseType: !49, size: 32, offset: 1536)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !561, file: !57, line: 98, baseType: !109, size: 160, offset: 1568)
!592 = distinct !DICompileUnit(language: DW_LANG_C99, file: !593, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !50, retainedTypes: !594, nameTableKind: None)
!593 = !DIFile(filename: "lib/getndelim2.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!594 = !{!595, !631, !635, !179}
!595 = !DISubprogram(name: "freadptr", scope: !596, file: !596, line: 42, type: !597, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!596 = !DIFile(filename: "./lib/freadptr.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!597 = !DISubroutineType(types: !598)
!598 = !{!47, !599, !189}
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !57, line: 49, size: 1728, elements: !601)
!601 = !{!602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !600, file: !57, line: 51, baseType: !49, size: 32)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !600, file: !57, line: 54, baseType: !45, size: 64, offset: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !600, file: !57, line: 55, baseType: !45, size: 64, offset: 128)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !600, file: !57, line: 56, baseType: !45, size: 64, offset: 192)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !600, file: !57, line: 57, baseType: !45, size: 64, offset: 256)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !600, file: !57, line: 58, baseType: !45, size: 64, offset: 320)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !600, file: !57, line: 59, baseType: !45, size: 64, offset: 384)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !600, file: !57, line: 60, baseType: !45, size: 64, offset: 448)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !600, file: !57, line: 61, baseType: !45, size: 64, offset: 512)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !600, file: !57, line: 64, baseType: !45, size: 64, offset: 576)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !600, file: !57, line: 65, baseType: !45, size: 64, offset: 640)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !600, file: !57, line: 66, baseType: !45, size: 64, offset: 704)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !600, file: !57, line: 68, baseType: !72, size: 64, offset: 768)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !600, file: !57, line: 70, baseType: !599, size: 64, offset: 832)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !600, file: !57, line: 72, baseType: !49, size: 32, offset: 896)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !600, file: !57, line: 73, baseType: !49, size: 32, offset: 928)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !600, file: !57, line: 74, baseType: !78, size: 64, offset: 960)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !600, file: !57, line: 77, baseType: !82, size: 16, offset: 1024)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !600, file: !57, line: 78, baseType: !84, size: 8, offset: 1040)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !600, file: !57, line: 79, baseType: !86, size: 8, offset: 1048)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !600, file: !57, line: 81, baseType: !90, size: 64, offset: 1088)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !600, file: !57, line: 89, baseType: !93, size: 64, offset: 1152)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !600, file: !57, line: 91, baseType: !95, size: 64, offset: 1216)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !600, file: !57, line: 92, baseType: !98, size: 64, offset: 1280)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !600, file: !57, line: 93, baseType: !599, size: 64, offset: 1344)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !600, file: !57, line: 94, baseType: !102, size: 64, offset: 1408)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !600, file: !57, line: 95, baseType: !104, size: 64, offset: 1472)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !600, file: !57, line: 96, baseType: !49, size: 32, offset: 1536)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !600, file: !57, line: 98, baseType: !109, size: 160, offset: 1568)
!631 = !DISubprogram(name: "memchr2", scope: !632, file: !632, line: 27, type: !633, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!632 = !DIFile(filename: "./lib/memchr2.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!633 = !DISubroutineType(types: !634)
!634 = !{!102, !177, !49, !49, !106}
!635 = !DISubprogram(name: "freadseek", scope: !636, file: !636, line: 38, type: !637, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!636 = !DIFile(filename: "./lib/freadseek.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!637 = !DISubroutineType(types: !638)
!638 = !{!49, !599, !106}
!639 = distinct !DICompileUnit(language: DW_LANG_C99, file: !640, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !50, retainedTypes: !641, nameTableKind: None)
!640 = !DIFile(filename: "lib/memchr2.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!641 = !{!180, !642, !102, !643}
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !239, line: 90, baseType: !106)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !180)
!645 = distinct !DICompileUnit(language: DW_LANG_C99, file: !646, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !647, retainedTypes: !651, nameTableKind: None)
!646 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!647 = !{!648}
!648 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !646, line: 40, baseType: !6, size: 32, elements: !649)
!649 = !{!650}
!650 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!651 = !{!41, !652, !102}
!652 = !DISubprogram(name: "fputs_unlocked", scope: !52, file: !52, line: 662, type: !653, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!653 = !DISubroutineType(types: !654)
!654 = !{!49, !47, !655}
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !57, line: 49, size: 1728, elements: !657)
!657 = !{!658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !656, file: !57, line: 51, baseType: !49, size: 32)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !656, file: !57, line: 54, baseType: !45, size: 64, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !656, file: !57, line: 55, baseType: !45, size: 64, offset: 128)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !656, file: !57, line: 56, baseType: !45, size: 64, offset: 192)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !656, file: !57, line: 57, baseType: !45, size: 64, offset: 256)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !656, file: !57, line: 58, baseType: !45, size: 64, offset: 320)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !656, file: !57, line: 59, baseType: !45, size: 64, offset: 384)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !656, file: !57, line: 60, baseType: !45, size: 64, offset: 448)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !656, file: !57, line: 61, baseType: !45, size: 64, offset: 512)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !656, file: !57, line: 64, baseType: !45, size: 64, offset: 576)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !656, file: !57, line: 65, baseType: !45, size: 64, offset: 640)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !656, file: !57, line: 66, baseType: !45, size: 64, offset: 704)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !656, file: !57, line: 68, baseType: !72, size: 64, offset: 768)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !656, file: !57, line: 70, baseType: !655, size: 64, offset: 832)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !656, file: !57, line: 72, baseType: !49, size: 32, offset: 896)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !656, file: !57, line: 73, baseType: !49, size: 32, offset: 928)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !656, file: !57, line: 74, baseType: !78, size: 64, offset: 960)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !656, file: !57, line: 77, baseType: !82, size: 16, offset: 1024)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !656, file: !57, line: 78, baseType: !84, size: 8, offset: 1040)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !656, file: !57, line: 79, baseType: !86, size: 8, offset: 1048)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !656, file: !57, line: 81, baseType: !90, size: 64, offset: 1088)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !656, file: !57, line: 89, baseType: !93, size: 64, offset: 1152)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !656, file: !57, line: 91, baseType: !95, size: 64, offset: 1216)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !656, file: !57, line: 92, baseType: !98, size: 64, offset: 1280)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !656, file: !57, line: 93, baseType: !655, size: 64, offset: 1344)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !656, file: !57, line: 94, baseType: !102, size: 64, offset: 1408)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !656, file: !57, line: 95, baseType: !104, size: 64, offset: 1472)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !656, file: !57, line: 96, baseType: !49, size: 32, offset: 1536)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !656, file: !57, line: 98, baseType: !109, size: 160, offset: 1568)
!687 = distinct !DICompileUnit(language: DW_LANG_C99, file: !688, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !689, retainedTypes: !697, nameTableKind: None)
!688 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!689 = !{!690}
!690 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !691, file: !153, line: 186, baseType: !6, size: 32, elements: !281)
!691 = distinct !DISubprogram(name: "x2nrealloc", scope: !153, file: !153, line: 174, type: !273, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !687, retainedNodes: !692)
!692 = !{!693, !694, !695, !696}
!693 = !DILocalVariable(name: "p", arg: 1, scope: !691, file: !153, line: 174, type: !102)
!694 = !DILocalVariable(name: "pn", arg: 2, scope: !691, file: !153, line: 174, type: !275)
!695 = !DILocalVariable(name: "s", arg: 3, scope: !691, file: !153, line: 174, type: !104)
!696 = !DILocalVariable(name: "n", scope: !691, file: !153, line: 176, type: !104)
!697 = !{!104, !193, !509, !303, !45, !190, !102, !698, !701}
!698 = !DISubprogram(name: "xcalloc", scope: !153, file: !153, line: 57, type: !699, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!699 = !DISubroutineType(types: !700)
!700 = !{!102, !106, !106}
!701 = !DISubprogram(name: "rpl_calloc", scope: !702, file: !702, line: 688, type: !699, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!702 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!703 = distinct !DICompileUnit(language: DW_LANG_C99, file: !704, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !50, retainedTypes: !705, nameTableKind: None)
!704 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!705 = !{!41, !148}
!706 = distinct !DICompileUnit(language: DW_LANG_C99, file: !707, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !50, retainedTypes: !708, nameTableKind: None)
!707 = !DIFile(filename: "lib/xstrndup.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!708 = !{!193}
!709 = distinct !DICompileUnit(language: DW_LANG_C99, file: !710, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !50, retainedTypes: !711, nameTableKind: None)
!710 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!711 = !{!102}
!712 = distinct !DICompileUnit(language: DW_LANG_C99, file: !713, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !50, retainedTypes: !714, nameTableKind: None)
!713 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!714 = !{!715, !750, !751, !755}
!715 = !DISubprogram(name: "fileno", scope: !52, file: !52, line: 786, type: !716, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!716 = !DISubroutineType(types: !717)
!717 = !{!49, !718}
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !57, line: 49, size: 1728, elements: !720)
!720 = !{!721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !719, file: !57, line: 51, baseType: !49, size: 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !719, file: !57, line: 54, baseType: !45, size: 64, offset: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !719, file: !57, line: 55, baseType: !45, size: 64, offset: 128)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !719, file: !57, line: 56, baseType: !45, size: 64, offset: 192)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !719, file: !57, line: 57, baseType: !45, size: 64, offset: 256)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !719, file: !57, line: 58, baseType: !45, size: 64, offset: 320)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !719, file: !57, line: 59, baseType: !45, size: 64, offset: 384)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !719, file: !57, line: 60, baseType: !45, size: 64, offset: 448)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !719, file: !57, line: 61, baseType: !45, size: 64, offset: 512)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !719, file: !57, line: 64, baseType: !45, size: 64, offset: 576)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !719, file: !57, line: 65, baseType: !45, size: 64, offset: 640)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !719, file: !57, line: 66, baseType: !45, size: 64, offset: 704)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !719, file: !57, line: 68, baseType: !72, size: 64, offset: 768)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !719, file: !57, line: 70, baseType: !718, size: 64, offset: 832)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !719, file: !57, line: 72, baseType: !49, size: 32, offset: 896)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !719, file: !57, line: 73, baseType: !49, size: 32, offset: 928)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !719, file: !57, line: 74, baseType: !78, size: 64, offset: 960)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !719, file: !57, line: 77, baseType: !82, size: 16, offset: 1024)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !719, file: !57, line: 78, baseType: !84, size: 8, offset: 1040)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !719, file: !57, line: 79, baseType: !86, size: 8, offset: 1048)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !719, file: !57, line: 81, baseType: !90, size: 64, offset: 1088)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !719, file: !57, line: 89, baseType: !93, size: 64, offset: 1152)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !719, file: !57, line: 91, baseType: !95, size: 64, offset: 1216)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !719, file: !57, line: 92, baseType: !98, size: 64, offset: 1280)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !719, file: !57, line: 93, baseType: !718, size: 64, offset: 1344)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !719, file: !57, line: 94, baseType: !102, size: 64, offset: 1408)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !719, file: !57, line: 95, baseType: !104, size: 64, offset: 1472)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !719, file: !57, line: 96, baseType: !49, size: 32, offset: 1536)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !719, file: !57, line: 98, baseType: !109, size: 160, offset: 1568)
!750 = !DISubprogram(name: "fclose", scope: !52, file: !52, line: 213, type: !716, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!751 = !DISubprogram(name: "lseek", scope: !752, file: !752, line: 334, type: !753, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!752 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!753 = !DISubroutineType(types: !754)
!754 = !{!80, !49, !80, !49}
!755 = !DISubprogram(name: "rpl_fflush", scope: !162, file: !162, line: 718, type: !716, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!756 = distinct !DICompileUnit(language: DW_LANG_C99, file: !757, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !50, retainedTypes: !758, nameTableKind: None)
!757 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!758 = !{!102, !759, !794}
!759 = !DISubprogram(name: "fflush", scope: !52, file: !52, line: 218, type: !760, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!760 = !DISubroutineType(types: !761)
!761 = !{!49, !762}
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !57, line: 49, size: 1728, elements: !764)
!764 = !{!765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !763, file: !57, line: 51, baseType: !49, size: 32)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !763, file: !57, line: 54, baseType: !45, size: 64, offset: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !763, file: !57, line: 55, baseType: !45, size: 64, offset: 128)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !763, file: !57, line: 56, baseType: !45, size: 64, offset: 192)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !763, file: !57, line: 57, baseType: !45, size: 64, offset: 256)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !763, file: !57, line: 58, baseType: !45, size: 64, offset: 320)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !763, file: !57, line: 59, baseType: !45, size: 64, offset: 384)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !763, file: !57, line: 60, baseType: !45, size: 64, offset: 448)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !763, file: !57, line: 61, baseType: !45, size: 64, offset: 512)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !763, file: !57, line: 64, baseType: !45, size: 64, offset: 576)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !763, file: !57, line: 65, baseType: !45, size: 64, offset: 640)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !763, file: !57, line: 66, baseType: !45, size: 64, offset: 704)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !763, file: !57, line: 68, baseType: !72, size: 64, offset: 768)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !763, file: !57, line: 70, baseType: !762, size: 64, offset: 832)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !763, file: !57, line: 72, baseType: !49, size: 32, offset: 896)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !763, file: !57, line: 73, baseType: !49, size: 32, offset: 928)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !763, file: !57, line: 74, baseType: !78, size: 64, offset: 960)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !763, file: !57, line: 77, baseType: !82, size: 16, offset: 1024)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !763, file: !57, line: 78, baseType: !84, size: 8, offset: 1040)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !763, file: !57, line: 79, baseType: !86, size: 8, offset: 1048)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !763, file: !57, line: 81, baseType: !90, size: 64, offset: 1088)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !763, file: !57, line: 89, baseType: !93, size: 64, offset: 1152)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !763, file: !57, line: 91, baseType: !95, size: 64, offset: 1216)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !763, file: !57, line: 92, baseType: !98, size: 64, offset: 1280)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !763, file: !57, line: 93, baseType: !762, size: 64, offset: 1344)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !763, file: !57, line: 94, baseType: !102, size: 64, offset: 1408)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !763, file: !57, line: 95, baseType: !104, size: 64, offset: 1472)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !763, file: !57, line: 96, baseType: !49, size: 32, offset: 1536)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !763, file: !57, line: 98, baseType: !109, size: 160, offset: 1568)
!794 = !DISubprogram(name: "rpl_fseeko", scope: !162, file: !162, line: 1034, type: !795, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!795 = !DISubroutineType(types: !796)
!796 = !{!49, !762, !80, !49}
!797 = distinct !DICompileUnit(language: DW_LANG_C99, file: !798, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !50, retainedTypes: !504, nameTableKind: None)
!798 = !DIFile(filename: "lib/freadptr.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!799 = distinct !DICompileUnit(language: DW_LANG_C99, file: !800, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !50, retainedTypes: !801, nameTableKind: None)
!800 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!801 = !{!102, !802, !751, !837}
!802 = !DISubprogram(name: "fileno", scope: !52, file: !52, line: 786, type: !803, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!803 = !DISubroutineType(types: !804)
!804 = !{!49, !805}
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !57, line: 49, size: 1728, elements: !807)
!807 = !{!808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !806, file: !57, line: 51, baseType: !49, size: 32)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !806, file: !57, line: 54, baseType: !45, size: 64, offset: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !806, file: !57, line: 55, baseType: !45, size: 64, offset: 128)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !806, file: !57, line: 56, baseType: !45, size: 64, offset: 192)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !806, file: !57, line: 57, baseType: !45, size: 64, offset: 256)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !806, file: !57, line: 58, baseType: !45, size: 64, offset: 320)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !806, file: !57, line: 59, baseType: !45, size: 64, offset: 384)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !806, file: !57, line: 60, baseType: !45, size: 64, offset: 448)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !806, file: !57, line: 61, baseType: !45, size: 64, offset: 512)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !806, file: !57, line: 64, baseType: !45, size: 64, offset: 576)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !806, file: !57, line: 65, baseType: !45, size: 64, offset: 640)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !806, file: !57, line: 66, baseType: !45, size: 64, offset: 704)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !806, file: !57, line: 68, baseType: !72, size: 64, offset: 768)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !806, file: !57, line: 70, baseType: !805, size: 64, offset: 832)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !806, file: !57, line: 72, baseType: !49, size: 32, offset: 896)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !806, file: !57, line: 73, baseType: !49, size: 32, offset: 928)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !806, file: !57, line: 74, baseType: !78, size: 64, offset: 960)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !806, file: !57, line: 77, baseType: !82, size: 16, offset: 1024)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !806, file: !57, line: 78, baseType: !84, size: 8, offset: 1040)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !806, file: !57, line: 79, baseType: !86, size: 8, offset: 1048)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !806, file: !57, line: 81, baseType: !90, size: 64, offset: 1088)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !806, file: !57, line: 89, baseType: !93, size: 64, offset: 1152)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !806, file: !57, line: 91, baseType: !95, size: 64, offset: 1216)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !806, file: !57, line: 92, baseType: !98, size: 64, offset: 1280)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !806, file: !57, line: 93, baseType: !805, size: 64, offset: 1344)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !806, file: !57, line: 94, baseType: !102, size: 64, offset: 1408)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !806, file: !57, line: 95, baseType: !104, size: 64, offset: 1472)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !806, file: !57, line: 96, baseType: !49, size: 32, offset: 1536)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !806, file: !57, line: 98, baseType: !109, size: 160, offset: 1568)
!837 = !DISubprogram(name: "fseeko", scope: !52, file: !52, line: 707, type: !838, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!838 = !DISubroutineType(types: !839)
!839 = !{!49, !805, !80, !49}
!840 = distinct !DICompileUnit(language: DW_LANG_C99, file: !841, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !50, retainedTypes: !842, nameTableKind: None)
!841 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!842 = !{!843, !104, !855}
!843 = !DISubprogram(name: "mbrtowc", scope: !496, file: !496, line: 296, type: !844, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!844 = !DISubroutineType(types: !845)
!845 = !{!106, !146, !47, !106, !846}
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !480, line: 13, size: 64, elements: !848)
!848 = !{!849, !850}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !847, file: !480, line: 15, baseType: !49, size: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !847, file: !480, line: 20, baseType: !851, size: 32, offset: 32)
!851 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !847, file: !480, line: 16, size: 32, elements: !852)
!852 = !{!853, !854}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !851, file: !480, line: 18, baseType: !6, size: 32)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !851, file: !480, line: 19, baseType: !488, size: 32)
!855 = !DISubprogram(name: "hard_locale", scope: !856, file: !856, line: 26, type: !857, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!856 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!857 = !DISubroutineType(types: !858)
!858 = !{!205, !49}
!859 = distinct !DICompileUnit(language: DW_LANG_C99, file: !860, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !50, retainedTypes: !861, nameTableKind: None)
!860 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!861 = !{!862}
!862 = !DISubprogram(name: "rpl_fclose", scope: !162, file: !162, line: 672, type: !863, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!863 = !DISubroutineType(types: !864)
!864 = !{!49, !865}
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !57, line: 49, size: 1728, elements: !867)
!867 = !{!868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !866, file: !57, line: 51, baseType: !49, size: 32)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !866, file: !57, line: 54, baseType: !45, size: 64, offset: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !866, file: !57, line: 55, baseType: !45, size: 64, offset: 128)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !866, file: !57, line: 56, baseType: !45, size: 64, offset: 192)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !866, file: !57, line: 57, baseType: !45, size: 64, offset: 256)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !866, file: !57, line: 58, baseType: !45, size: 64, offset: 320)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !866, file: !57, line: 59, baseType: !45, size: 64, offset: 384)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !866, file: !57, line: 60, baseType: !45, size: 64, offset: 448)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !866, file: !57, line: 61, baseType: !45, size: 64, offset: 512)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !866, file: !57, line: 64, baseType: !45, size: 64, offset: 576)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !866, file: !57, line: 65, baseType: !45, size: 64, offset: 640)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !866, file: !57, line: 66, baseType: !45, size: 64, offset: 704)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !866, file: !57, line: 68, baseType: !72, size: 64, offset: 768)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !866, file: !57, line: 70, baseType: !865, size: 64, offset: 832)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !866, file: !57, line: 72, baseType: !49, size: 32, offset: 896)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !866, file: !57, line: 73, baseType: !49, size: 32, offset: 928)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !866, file: !57, line: 74, baseType: !78, size: 64, offset: 960)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !866, file: !57, line: 77, baseType: !82, size: 16, offset: 1024)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !866, file: !57, line: 78, baseType: !84, size: 8, offset: 1040)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !866, file: !57, line: 79, baseType: !86, size: 8, offset: 1048)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !866, file: !57, line: 81, baseType: !90, size: 64, offset: 1088)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !866, file: !57, line: 89, baseType: !93, size: 64, offset: 1152)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !866, file: !57, line: 91, baseType: !95, size: 64, offset: 1216)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !866, file: !57, line: 92, baseType: !98, size: 64, offset: 1280)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !866, file: !57, line: 93, baseType: !865, size: 64, offset: 1344)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !866, file: !57, line: 94, baseType: !102, size: 64, offset: 1408)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !866, file: !57, line: 95, baseType: !104, size: 64, offset: 1472)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !866, file: !57, line: 96, baseType: !49, size: 32, offset: 1536)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !866, file: !57, line: 98, baseType: !109, size: 160, offset: 1568)
!897 = distinct !DICompileUnit(language: DW_LANG_C99, file: !898, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !50, retainedTypes: !899, nameTableKind: None)
!898 = !DIFile(filename: "lib/freadseek.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!899 = !{!900, !936, !102, !939, !942, !751, !943, !946}
!900 = !DISubprogram(name: "freadahead", scope: !901, file: !901, line: 41, type: !902, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!901 = !DIFile(filename: "./lib/freadahead.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!902 = !DISubroutineType(types: !903)
!903 = !{!106, !904}
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !57, line: 49, size: 1728, elements: !906)
!906 = !{!907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !905, file: !57, line: 51, baseType: !49, size: 32)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !905, file: !57, line: 54, baseType: !45, size: 64, offset: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !905, file: !57, line: 55, baseType: !45, size: 64, offset: 128)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !905, file: !57, line: 56, baseType: !45, size: 64, offset: 192)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !905, file: !57, line: 57, baseType: !45, size: 64, offset: 256)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !905, file: !57, line: 58, baseType: !45, size: 64, offset: 320)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !905, file: !57, line: 59, baseType: !45, size: 64, offset: 384)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !905, file: !57, line: 60, baseType: !45, size: 64, offset: 448)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !905, file: !57, line: 61, baseType: !45, size: 64, offset: 512)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !905, file: !57, line: 64, baseType: !45, size: 64, offset: 576)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !905, file: !57, line: 65, baseType: !45, size: 64, offset: 640)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !905, file: !57, line: 66, baseType: !45, size: 64, offset: 704)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !905, file: !57, line: 68, baseType: !72, size: 64, offset: 768)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !905, file: !57, line: 70, baseType: !904, size: 64, offset: 832)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !905, file: !57, line: 72, baseType: !49, size: 32, offset: 896)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !905, file: !57, line: 73, baseType: !49, size: 32, offset: 928)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !905, file: !57, line: 74, baseType: !78, size: 64, offset: 960)
