source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.parser_control = type { i8*, i64, i32, i32, i32, i32, %struct.textint, i64, i64, i64, i64, %struct.timespec, %struct.relative_time, i8, i8, i64, i64, i64, i64, i64, i64, i8, i8, i8, i8, i8, i8, i8, i8, i8, [3 x %struct.table] }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.relative_time = type { i64, i64, i64, i64, i64, i64, i32 }
%struct.slotvec = type { i64, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.table = type { i8*, i32, i32 }
%struct.textint = type { i8, i64, i64 }
%struct.timespec = type { i64, i64 }
%struct.timezone = type { i32, i32 }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }

!365 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!366 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!367 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!368 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!369 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!370 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!371 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!372 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!373 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!374 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!375 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!376 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!377 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!378 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!379 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!380 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!381 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!382 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!383 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!384 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!385 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!386 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!387 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!388 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!389 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!390 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!391 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!392 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!393 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!394 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!395 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!396 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!397 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!398 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!399 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !400, line: 32, baseType: !6, size: 32, elements: !401)
!400 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!401 = !{!402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412}
!402 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!403 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!404 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!405 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!406 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!407 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!408 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!409 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!410 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!411 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!412 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!413 = !{!414, !424, !485, !489, !493, !496, !499, !506, !521, !523, !526, !418, !475, !528, !532, !536, !540, !543, !544, !550, !556, !568, !571, !577, !580, !584, !587, !607, !613, !614}
!414 = !DISubprogram(name: "dcgettext", scope: !415, file: !415, line: 51, type: !416, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !423)
!415 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!416 = !DISubroutineType(types: !417)
!417 = !{!418, !420, !420, !422}
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !419)
!422 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!423 = !{}
!424 = !DISubprogram(name: "fputs_unlocked", scope: !425, file: !425, line: 662, type: !426, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !423)
!425 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!426 = !DISubroutineType(types: !427)
!427 = !{!422, !420, !428}
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !430, line: 49, size: 1728, elements: !431)
!430 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!431 = !{!432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !447, !448, !449, !450, !454, !456, !458, !462, !465, !467, !470, !473, !474, !476, !480, !481}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !429, file: !430, line: 51, baseType: !422, size: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !429, file: !430, line: 54, baseType: !418, size: 64, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !429, file: !430, line: 55, baseType: !418, size: 64, offset: 128)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !429, file: !430, line: 56, baseType: !418, size: 64, offset: 192)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !429, file: !430, line: 57, baseType: !418, size: 64, offset: 256)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !429, file: !430, line: 58, baseType: !418, size: 64, offset: 320)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !429, file: !430, line: 59, baseType: !418, size: 64, offset: 384)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !429, file: !430, line: 60, baseType: !418, size: 64, offset: 448)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !429, file: !430, line: 61, baseType: !418, size: 64, offset: 512)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !429, file: !430, line: 64, baseType: !418, size: 64, offset: 576)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !429, file: !430, line: 65, baseType: !418, size: 64, offset: 640)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !429, file: !430, line: 66, baseType: !418, size: 64, offset: 704)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !429, file: !430, line: 68, baseType: !445, size: 64, offset: 768)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !430, line: 36, flags: DIFlagFwdDecl)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !429, file: !430, line: 70, baseType: !428, size: 64, offset: 832)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !429, file: !430, line: 72, baseType: !422, size: 32, offset: 896)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !429, file: !430, line: 73, baseType: !422, size: 32, offset: 928)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !429, file: !430, line: 74, baseType: !451, size: 64, offset: 960)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !452, line: 152, baseType: !453)
!452 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!453 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !429, file: !430, line: 77, baseType: !455, size: 16, offset: 1024)
!455 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !429, file: !430, line: 78, baseType: !457, size: 8, offset: 1040)
!457 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !429, file: !430, line: 79, baseType: !459, size: 8, offset: 1048)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !419, size: 8, elements: !460)
!460 = !{!461}
!461 = !DISubrange(count: 1)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !429, file: !430, line: 81, baseType: !463, size: 64, offset: 1088)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !430, line: 43, baseType: null)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !429, file: !430, line: 89, baseType: !466, size: 64, offset: 1152)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !452, line: 153, baseType: !453)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !429, file: !430, line: 91, baseType: !468, size: 64, offset: 1216)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !430, line: 37, flags: DIFlagFwdDecl)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !429, file: !430, line: 92, baseType: !471, size: 64, offset: 1280)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !430, line: 38, flags: DIFlagFwdDecl)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !429, file: !430, line: 93, baseType: !428, size: 64, offset: 1344)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !429, file: !430, line: 94, baseType: !475, size: 64, offset: 1408)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !429, file: !430, line: 95, baseType: !477, size: 64, offset: 1472)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !478, line: 46, baseType: !479)
!478 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!479 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !429, file: !430, line: 96, baseType: !422, size: 32, offset: 1536)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !429, file: !430, line: 98, baseType: !482, size: 160, offset: 1568)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !419, size: 160, elements: !483)
!483 = !{!484}
!484 = !DISubrange(count: 20)
!485 = !DISubprogram(name: "set_program_name", scope: !486, file: !486, line: 37, type: !487, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !423)
!486 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!487 = !DISubroutineType(types: !488)
!488 = !{null, !420}
!489 = !DISubprogram(name: "setlocale", scope: !490, file: !490, line: 122, type: !491, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !423)
!490 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!491 = !DISubroutineType(types: !492)
!492 = !{!418, !422, !420}
!493 = !DISubprogram(name: "bindtextdomain", scope: !415, file: !415, line: 86, type: !494, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !423)
!494 = !DISubroutineType(types: !495)
!495 = !{!418, !420, !420}
!496 = !DISubprogram(name: "textdomain", scope: !415, file: !415, line: 82, type: !497, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !423)
!497 = !DISubroutineType(types: !498)
!498 = !{!418, !420}
!499 = !DISubprogram(name: "atexit", scope: !500, file: !500, line: 595, type: !501, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !423)
!500 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!501 = !DISubroutineType(types: !502)
!502 = !{!422, !503}
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DISubroutineType(types: !505)
!505 = !{null}
!506 = !DISubprogram(name: "getopt_long", scope: !507, file: !507, line: 66, type: !508, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !423)
!507 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!508 = !DISubroutineType(types: !509)
!509 = !{!422, !422, !510, !420, !512, !519}
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !418)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !514)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !507, line: 50, size: 256, elements: !515)
!515 = !{!516, !517, !518, !520}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !514, file: !507, line: 52, baseType: !420, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !514, file: !507, line: 55, baseType: !422, size: 32, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !514, file: !507, line: 56, baseType: !519, size: 64, offset: 128)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !514, file: !507, line: 57, baseType: !422, size: 32, offset: 192)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!523 = !DISubprogram(name: "putenv", scope: !500, file: !500, line: 647, type: !524, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !423)
!524 = !DISubroutineType(types: !525)
!525 = !{!422, !418}
!526 = !DISubprogram(name: "xalloc_die", scope: !527, file: !527, line: 51, type: !504, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !423)
!527 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!528 = !DISubprogram(name: "version_etc", scope: !529, file: !529, line: 69, type: !530, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !423)
!529 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!530 = !DISubroutineType(types: !531)
!531 = !{null, !428, !420, !420, !420, null}
!532 = !DISubprogram(name: "error", scope: !533, file: !533, line: 52, type: !534, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !423)
!533 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!534 = !DISubroutineType(types: !535)
!535 = !{null, !422, !422, !420, null}
!536 = !DISubprogram(name: "quote", scope: !537, file: !537, line: 44, type: !538, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !423)
!537 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!538 = !DISubroutineType(types: !539)
!539 = !{!420, !420}
!540 = !DISubprogram(name: "nl_langinfo", scope: !14, file: !14, line: 661, type: !541, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !423)
!541 = !DISubroutineType(types: !542)
!542 = !{!418, !422}
!543 = !DISubprogram(name: "getenv", scope: !500, file: !500, line: 634, type: !497, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !423)
!544 = !DISubprogram(name: "tzalloc", scope: !545, file: !545, line: 779, type: !546, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !423)
!545 = !DIFile(filename: "./lib/time.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!546 = !DISubroutineType(types: !547)
!547 = !{!548, !420}
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !545, line: 778, flags: DIFlagFwdDecl)
!550 = !DISubprogram(name: "posixtime", scope: !551, file: !551, line: 37, type: !552, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !423)
!551 = !DIFile(filename: "./lib/posixtm.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!552 = !DISubroutineType(types: !553)
!553 = !{!554, !555, !420, !6}
!554 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!556 = !DISubprogram(name: "gettime", scope: !557, file: !557, line: 127, type: !558, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !423)
!557 = !DIFile(filename: "./lib/timespec.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!558 = !DISubroutineType(types: !559)
!559 = !{null, !560}
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !562, line: 10, size: 128, elements: !563)
!562 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!563 = !{!564, !566}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !561, file: !562, line: 12, baseType: !565, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !452, line: 160, baseType: !453)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !561, file: !562, line: 16, baseType: !567, size: 64, offset: 64)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !452, line: 196, baseType: !453)
!568 = !DISubprogram(name: "quotearg_n_style_colon", scope: !400, file: !400, line: 397, type: !569, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !423)
!569 = !DISubroutineType(types: !570)
!570 = !{!418, !422, !399, !420}
!571 = !DISubprogram(name: "parse_datetime2", scope: !572, file: !572, line: 29, type: !573, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !423)
!572 = !DIFile(filename: "./lib/parse-datetime.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!573 = !DISubroutineType(types: !574)
!574 = !{!554, !560, !420, !575, !6, !548, !420}
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !561)
!577 = !DISubprogram(name: "settime", scope: !557, file: !557, line: 128, type: !578, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !423)
!578 = !DISubroutineType(types: !579)
!579 = !{!422, !575}
!580 = !DISubprogram(name: "rpl_fclose", scope: !581, file: !581, line: 672, type: !582, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !423)
!581 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!582 = !DISubroutineType(types: !583)
!583 = !{!422, !428}
!584 = !DISubprogram(name: "free", scope: !500, file: !500, line: 565, type: !585, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !423)
!585 = !DISubroutineType(types: !586)
!586 = !{null, !475}
!587 = !DISubprogram(name: "localtime_rz", scope: !545, file: !545, line: 783, type: !588, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !423)
!588 = !DISubroutineType(types: !589)
!589 = !{!590, !548, !605, !590}
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !592, line: 7, size: 448, elements: !593)
!592 = !DIFile(filename: "/usr/include/bits/types/struct_tm.h", directory: "")
!593 = !{!594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !591, file: !592, line: 9, baseType: !422, size: 32)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !591, file: !592, line: 10, baseType: !422, size: 32, offset: 32)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !591, file: !592, line: 11, baseType: !422, size: 32, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !591, file: !592, line: 12, baseType: !422, size: 32, offset: 96)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !591, file: !592, line: 13, baseType: !422, size: 32, offset: 128)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !591, file: !592, line: 14, baseType: !422, size: 32, offset: 160)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !591, file: !592, line: 15, baseType: !422, size: 32, offset: 192)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !591, file: !592, line: 16, baseType: !422, size: 32, offset: 224)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !591, file: !592, line: 17, baseType: !422, size: 32, offset: 256)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !591, file: !592, line: 20, baseType: !453, size: 64, offset: 320)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !591, file: !592, line: 21, baseType: !420, size: 64, offset: 384)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !453)
!607 = !DISubprogram(name: "fprintftime", scope: !608, file: !608, line: 28, type: !609, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !423)
!608 = !DIFile(filename: "./lib/fprintftime.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!609 = !DISubroutineType(types: !610)
!610 = !{!479, !428, !420, !611, !548, !422}
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !591)
!613 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!614 = !DISubprogram(name: "imaxtostr", scope: !615, file: !615, line: 42, type: !616, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !423)
!615 = !DIFile(filename: "./lib/inttostr.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!616 = !DISubroutineType(types: !617)
!617 = !{!418, !453, !418}
!618 = !{!619, !684, !689, !0, !691, !696, !701, !707}
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(name: "rfc_3339_format", scope: !621, file: !3, line: 388, type: !681, isLocal: true, isDefinition: true)
!621 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 348, type: !622, scopeLine: 349, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !625)
!622 = !DISubroutineType(types: !623)
!623 = !{!422, !422, !624}
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!625 = !{!626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !666, !667, !668, !670, !673, !675, !676, !678}
!626 = !DILocalVariable(name: "argc", arg: 1, scope: !621, file: !3, line: 348, type: !422)
!627 = !DILocalVariable(name: "argv", arg: 2, scope: !621, file: !3, line: 348, type: !624)
!628 = !DILocalVariable(name: "optc", scope: !621, file: !3, line: 350, type: !422)
!629 = !DILocalVariable(name: "datestr", scope: !621, file: !3, line: 351, type: !420)
!630 = !DILocalVariable(name: "set_datestr", scope: !621, file: !3, line: 352, type: !420)
!631 = !DILocalVariable(name: "when", scope: !621, file: !3, line: 353, type: !561)
!632 = !DILocalVariable(name: "set_date", scope: !621, file: !3, line: 354, type: !554)
!633 = !DILocalVariable(name: "format", scope: !621, file: !3, line: 355, type: !420)
!634 = !DILocalVariable(name: "batch_file", scope: !621, file: !3, line: 356, type: !418)
!635 = !DILocalVariable(name: "reference", scope: !621, file: !3, line: 357, type: !418)
!636 = !DILocalVariable(name: "refstats", scope: !621, file: !3, line: 358, type: !637)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !638, line: 46, size: 1152, elements: !639)
!638 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "")
!639 = !{!640, !642, !644, !646, !648, !650, !652, !653, !654, !655, !657, !659, !660, !661, !662}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !637, file: !638, line: 48, baseType: !641, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !452, line: 145, baseType: !479)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !637, file: !638, line: 53, baseType: !643, size: 64, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !452, line: 148, baseType: !479)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !637, file: !638, line: 61, baseType: !645, size: 64, offset: 128)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !452, line: 151, baseType: !479)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !637, file: !638, line: 62, baseType: !647, size: 32, offset: 192)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !452, line: 150, baseType: !6)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !637, file: !638, line: 64, baseType: !649, size: 32, offset: 224)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !452, line: 146, baseType: !6)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !637, file: !638, line: 65, baseType: !651, size: 32, offset: 256)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !452, line: 147, baseType: !6)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !637, file: !638, line: 67, baseType: !422, size: 32, offset: 288)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !637, file: !638, line: 69, baseType: !641, size: 64, offset: 320)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !637, file: !638, line: 74, baseType: !451, size: 64, offset: 384)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !637, file: !638, line: 78, baseType: !656, size: 64, offset: 448)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !452, line: 174, baseType: !453)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !637, file: !638, line: 80, baseType: !658, size: 64, offset: 512)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !452, line: 179, baseType: !453)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !637, file: !638, line: 91, baseType: !561, size: 128, offset: 576)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !637, file: !638, line: 92, baseType: !561, size: 128, offset: 704)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !637, file: !638, line: 93, baseType: !561, size: 128, offset: 832)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !637, file: !638, line: 106, baseType: !663, size: 192, offset: 960)
!663 = !DICompositeType(tag: DW_TAG_array_type, baseType: !567, size: 192, elements: !664)
!664 = !{!665}
!665 = !DISubrange(count: 3)
!666 = !DILocalVariable(name: "ok", scope: !621, file: !3, line: 359, type: !554)
!667 = !DILocalVariable(name: "option_specified_date", scope: !621, file: !3, line: 360, type: !422)
!668 = !DILocalVariable(name: "new_format", scope: !669, file: !3, line: 373, type: !420)
!669 = distinct !DILexicalBlock(scope: !621, file: !3, line: 372, column: 5)
!670 = !DILocalVariable(name: "i", scope: !671, file: !3, line: 394, type: !5)
!671 = distinct !DILexicalBlock(scope: !672, file: !3, line: 387, column: 11)
!672 = distinct !DILexicalBlock(scope: !669, file: !3, line: 376, column: 9)
!673 = !DILocalVariable(name: "i", scope: !674, file: !3, line: 410, type: !5)
!674 = distinct !DILexicalBlock(scope: !672, file: !3, line: 401, column: 11)
!675 = !DILocalVariable(name: "tzstring", scope: !621, file: !3, line: 508, type: !420)
!676 = !DILocalVariable(name: "tz", scope: !621, file: !3, line: 509, type: !677)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !545, line: 778, baseType: !548)
!678 = !DILocalVariable(name: "valid_date", scope: !679, file: !3, line: 515, type: !554)
!679 = distinct !DILexicalBlock(scope: !680, file: !3, line: 514, column: 5)
!680 = distinct !DILexicalBlock(scope: !621, file: !3, line: 511, column: 7)
!681 = !DICompositeType(tag: DW_TAG_array_type, baseType: !421, size: 768, elements: !682)
!682 = !{!665, !683}
!683 = !DISubrange(count: 32)
!684 = !DIGlobalVariableExpression(var: !685, expr: !DIExpression())
!685 = distinct !DIGlobalVariable(name: "iso_8601_format", scope: !621, file: !3, line: 402, type: !686, isLocal: true, isDefinition: true)
!686 = !DICompositeType(tag: DW_TAG_array_type, baseType: !421, size: 1280, elements: !687)
!687 = !{!688, !683}
!688 = !DISubrange(count: 5)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(name: "parse_datetime_flags", scope: !2, file: !3, line: 109, type: !6, isLocal: true, isDefinition: true)
!691 = !DIGlobalVariableExpression(var: !692, expr: !DIExpression())
!692 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 88, type: !693, isLocal: true, isDefinition: true)
!693 = !DICompositeType(tag: DW_TAG_array_type, baseType: !513, size: 4096, elements: !694)
!694 = !{!695}
!695 = !DISubrange(count: 16)
!696 = !DIGlobalVariableExpression(var: !697, expr: !DIExpression())
!697 = distinct !DIGlobalVariable(name: "time_spec", scope: !2, file: !3, line: 68, type: !698, isLocal: true, isDefinition: true)
!698 = !DICompositeType(tag: DW_TAG_array_type, baseType: !699, size: 160, elements: !700)
!699 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!700 = !{!688}
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(name: "time_spec_string", scope: !2, file: !3, line: 61, type: !703, isLocal: true, isDefinition: true)
!703 = !DICompositeType(tag: DW_TAG_array_type, baseType: !704, size: 384, elements: !705)
!704 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !420)
!705 = !{!706}
!706 = !DISubrange(count: 6)
!707 = !DIGlobalVariableExpression(var: !708, expr: !DIExpression())
!708 = distinct !DIGlobalVariable(name: "rfc_email_format", scope: !2, file: !3, line: 76, type: !709, isLocal: true, isDefinition: true)
!709 = !DICompositeType(tag: DW_TAG_array_type, baseType: !421, size: 200, elements: !710)
!710 = !{!711}
!711 = !DISubrange(count: 25)
!712 = !DICompositeType(tag: DW_TAG_array_type, baseType: !421, size: 112, elements: !713)
!713 = !{!714}
!714 = !DISubrange(count: 14)
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(name: "Version", scope: !717, file: !718, line: 2, type: !420, isDefinition: true)
!717 = distinct !DICompileUnit(language: DW_LANG_C99, file: !718, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !423, globals: !719, nameTableKind: None)
!718 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!719 = !{!715}
!720 = !DIGlobalVariableExpression(var: !721, expr: !DIExpression())
!721 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !722, file: !723, line: 67, type: !769, isDefinition: true)
!722 = distinct !DICompileUnit(language: DW_LANG_C99, file: !723, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !724, retainedTypes: !725, globals: !768, nameTableKind: None)
!723 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!724 = !{!399}
!725 = !{!475, !420, !414, !726, !727, !532, !730, !536, !765, !613}
!726 = !DISubprogram(name: "quotearg_n_style", scope: !400, file: !400, line: 368, type: !569, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !423)
!727 = !DISubprogram(name: "quote_n", scope: !537, file: !537, line: 40, type: !728, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !423)
!728 = !DISubroutineType(types: !729)
!729 = !{!420, !422, !420}
!730 = !DISubprogram(name: "fputs_unlocked", scope: !425, file: !425, line: 662, type: !731, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !423)
!731 = !DISubroutineType(types: !732)
!732 = !{!422, !420, !733}
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !430, line: 49, size: 1728, elements: !735)
!735 = !{!736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !734, file: !430, line: 51, baseType: !422, size: 32)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !734, file: !430, line: 54, baseType: !418, size: 64, offset: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !734, file: !430, line: 55, baseType: !418, size: 64, offset: 128)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !734, file: !430, line: 56, baseType: !418, size: 64, offset: 192)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !734, file: !430, line: 57, baseType: !418, size: 64, offset: 256)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !734, file: !430, line: 58, baseType: !418, size: 64, offset: 320)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !734, file: !430, line: 59, baseType: !418, size: 64, offset: 384)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !734, file: !430, line: 60, baseType: !418, size: 64, offset: 448)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !734, file: !430, line: 61, baseType: !418, size: 64, offset: 512)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !734, file: !430, line: 64, baseType: !418, size: 64, offset: 576)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !734, file: !430, line: 65, baseType: !418, size: 64, offset: 640)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !734, file: !430, line: 66, baseType: !418, size: 64, offset: 704)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !734, file: !430, line: 68, baseType: !445, size: 64, offset: 768)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !734, file: !430, line: 70, baseType: !733, size: 64, offset: 832)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !734, file: !430, line: 72, baseType: !422, size: 32, offset: 896)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !734, file: !430, line: 73, baseType: !422, size: 32, offset: 928)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !734, file: !430, line: 74, baseType: !451, size: 64, offset: 960)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !734, file: !430, line: 77, baseType: !455, size: 16, offset: 1024)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !734, file: !430, line: 78, baseType: !457, size: 8, offset: 1040)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !734, file: !430, line: 79, baseType: !459, size: 8, offset: 1048)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !734, file: !430, line: 81, baseType: !463, size: 64, offset: 1088)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !734, file: !430, line: 89, baseType: !466, size: 64, offset: 1152)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !734, file: !430, line: 91, baseType: !468, size: 64, offset: 1216)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !734, file: !430, line: 92, baseType: !471, size: 64, offset: 1280)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !734, file: !430, line: 93, baseType: !733, size: 64, offset: 1344)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !734, file: !430, line: 94, baseType: !475, size: 64, offset: 1408)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !734, file: !430, line: 95, baseType: !477, size: 64, offset: 1472)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !734, file: !430, line: 96, baseType: !422, size: 32, offset: 1536)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !734, file: !430, line: 98, baseType: !482, size: 160, offset: 1568)
!765 = !DISubprogram(name: "usage", scope: !723, file: !723, line: 56, type: !766, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !423)
!766 = !DISubroutineType(types: !767)
!767 = !{null, !422}
!768 = !{!720}
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !770, line: 61, baseType: !503)
!770 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!771 = !DIGlobalVariableExpression(var: !772, expr: !DIExpression())
!772 = distinct !DIGlobalVariable(name: "file_name", scope: !773, file: !774, line: 46, type: !420, isLocal: true, isDefinition: true)
!773 = distinct !DICompileUnit(language: DW_LANG_C99, file: !774, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !423, retainedTypes: !775, globals: !813, nameTableKind: None)
!774 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!775 = !{!776, !414, !812, !532}
!776 = !DISubprogram(name: "close_stream", scope: !777, file: !777, line: 2, type: !778, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !423)
!777 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!778 = !DISubroutineType(types: !779)
!779 = !{!422, !780}
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !430, line: 49, size: 1728, elements: !782)
!782 = !{!783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !781, file: !430, line: 51, baseType: !422, size: 32)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !781, file: !430, line: 54, baseType: !418, size: 64, offset: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !781, file: !430, line: 55, baseType: !418, size: 64, offset: 128)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !781, file: !430, line: 56, baseType: !418, size: 64, offset: 192)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !781, file: !430, line: 57, baseType: !418, size: 64, offset: 256)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !781, file: !430, line: 58, baseType: !418, size: 64, offset: 320)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !781, file: !430, line: 59, baseType: !418, size: 64, offset: 384)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !781, file: !430, line: 60, baseType: !418, size: 64, offset: 448)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !781, file: !430, line: 61, baseType: !418, size: 64, offset: 512)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !781, file: !430, line: 64, baseType: !418, size: 64, offset: 576)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !781, file: !430, line: 65, baseType: !418, size: 64, offset: 640)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !781, file: !430, line: 66, baseType: !418, size: 64, offset: 704)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !781, file: !430, line: 68, baseType: !445, size: 64, offset: 768)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !781, file: !430, line: 70, baseType: !780, size: 64, offset: 832)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !781, file: !430, line: 72, baseType: !422, size: 32, offset: 896)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !781, file: !430, line: 73, baseType: !422, size: 32, offset: 928)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !781, file: !430, line: 74, baseType: !451, size: 64, offset: 960)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !781, file: !430, line: 77, baseType: !455, size: 16, offset: 1024)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !781, file: !430, line: 78, baseType: !457, size: 8, offset: 1040)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !781, file: !430, line: 79, baseType: !459, size: 8, offset: 1048)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !781, file: !430, line: 81, baseType: !463, size: 64, offset: 1088)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !781, file: !430, line: 89, baseType: !466, size: 64, offset: 1152)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !781, file: !430, line: 91, baseType: !468, size: 64, offset: 1216)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !781, file: !430, line: 92, baseType: !471, size: 64, offset: 1280)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !781, file: !430, line: 93, baseType: !780, size: 64, offset: 1344)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !781, file: !430, line: 94, baseType: !475, size: 64, offset: 1408)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !781, file: !430, line: 95, baseType: !477, size: 64, offset: 1472)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !781, file: !430, line: 96, baseType: !422, size: 32, offset: 1536)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !781, file: !430, line: 98, baseType: !482, size: 160, offset: 1568)
!812 = !DISubprogram(name: "quotearg_colon", scope: !400, file: !400, line: 391, type: !497, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !423)
!813 = !{!771, !814}
!814 = !DIGlobalVariableExpression(var: !815, expr: !DIExpression())
!815 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !773, file: !774, line: 56, type: !554, isLocal: true, isDefinition: true)
!816 = !DIGlobalVariableExpression(var: !817, expr: !DIExpression())
!817 = distinct !DIGlobalVariable(name: "exit_failure", scope: !818, file: !819, line: 24, type: !821, isDefinition: true)
!818 = distinct !DICompileUnit(language: DW_LANG_C99, file: !819, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !423, globals: !820, nameTableKind: None)
!819 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!820 = !{!816}
!821 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !422)
!822 = !DIGlobalVariableExpression(var: !823, expr: !DIExpression())
!823 = distinct !DIGlobalVariable(name: "yypact", scope: !824, file: !1047, line: 1067, type: !1306, isLocal: true, isDefinition: true)
!824 = distinct !DICompileUnit(language: DW_LANG_C99, file: !825, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !826, retainedTypes: !1073, globals: !1154, nameTableKind: None)
!825 = !DIFile(filename: "lib/parse-datetime.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!826 = !{!827, !833, !1043, !1046, !1069}
!827 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !828, line: 167, baseType: !6, size: 32, elements: !829)
!828 = !DIFile(filename: "parse-datetime.y", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!829 = !{!830, !831, !832}
!830 = !DIEnumerator(name: "MERam", value: 0, isUnsigned: true)
!831 = !DIEnumerator(name: "MERpm", value: 1, isUnsigned: true)
!832 = !DIEnumerator(name: "MER24", value: 2, isUnsigned: true)
!833 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !834, file: !828, line: 1746, baseType: !6, size: 32, elements: !1041)
!834 = distinct !DISubprogram(name: "parse_datetime2", scope: !828, file: !828, line: 1732, type: !835, scopeLine: 1735, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !824, retainedNodes: !844)
!835 = !DISubroutineType(types: !836)
!836 = !{!554, !837, !420, !842, !6, !677, !420}
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !562, line: 10, size: 128, elements: !839)
!839 = !{!840, !841}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !838, file: !562, line: 12, baseType: !565, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !838, file: !562, line: 16, baseType: !567, size: 64, offset: 64)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !838)
!844 = !{!845, !846, !847, !848, !849, !850, !851, !865, !866, !870, !874, !875, !876, !877, !878, !879, !882, !883, !884, !885, !900, !903, !905, !906, !912, !913, !914, !915, !963, !965, !969, !970, !971, !978, !981, !982, !988, !989, !990, !993, !996, !997, !998, !1006, !1009, !1010, !1011, !1012, !1015, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1029, !1032, !1033, !1034, !1035, !1036, !1039, !1040}
!845 = !DILocalVariable(name: "result", arg: 1, scope: !834, file: !828, line: 1732, type: !837)
!846 = !DILocalVariable(name: "p", arg: 2, scope: !834, file: !828, line: 1732, type: !420)
!847 = !DILocalVariable(name: "now", arg: 3, scope: !834, file: !828, line: 1733, type: !842)
!848 = !DILocalVariable(name: "flags", arg: 4, scope: !834, file: !828, line: 1733, type: !6)
!849 = !DILocalVariable(name: "tzdefault", arg: 5, scope: !834, file: !828, line: 1734, type: !677)
!850 = !DILocalVariable(name: "tzstring", arg: 6, scope: !834, file: !828, line: 1734, type: !420)
!851 = !DILocalVariable(name: "tm", scope: !834, file: !828, line: 1736, type: !852)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !592, line: 7, size: 448, elements: !853)
!853 = !{!854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !852, file: !592, line: 9, baseType: !422, size: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !852, file: !592, line: 10, baseType: !422, size: 32, offset: 32)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !852, file: !592, line: 11, baseType: !422, size: 32, offset: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !852, file: !592, line: 12, baseType: !422, size: 32, offset: 96)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !852, file: !592, line: 13, baseType: !422, size: 32, offset: 128)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !852, file: !592, line: 14, baseType: !422, size: 32, offset: 160)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !852, file: !592, line: 15, baseType: !422, size: 32, offset: 192)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !852, file: !592, line: 16, baseType: !422, size: 32, offset: 224)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !852, file: !592, line: 17, baseType: !422, size: 32, offset: 256)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !852, file: !592, line: 20, baseType: !453, size: 64, offset: 320)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !852, file: !592, line: 21, baseType: !420, size: 64, offset: 384)
!865 = !DILocalVariable(name: "tm0", scope: !834, file: !828, line: 1737, type: !852)
!866 = !DILocalVariable(name: "time_zone_buf", scope: !834, file: !828, line: 1738, type: !867)
!867 = !DICompositeType(tag: DW_TAG_array_type, baseType: !419, size: 216, elements: !868)
!868 = !{!869}
!869 = !DISubrange(count: 27)
!870 = !DILocalVariable(name: "dbg_tm", scope: !834, file: !828, line: 1739, type: !871)
!871 = !DICompositeType(tag: DW_TAG_array_type, baseType: !419, size: 800, elements: !872)
!872 = !{!873}
!873 = !DISubrange(count: 100)
!874 = !DILocalVariable(name: "ok", scope: !834, file: !828, line: 1740, type: !554)
!875 = !DILocalVariable(name: "input_sentinel", scope: !834, file: !828, line: 1741, type: !420)
!876 = !DILocalVariable(name: "tz1alloc", scope: !834, file: !828, line: 1742, type: !418)
!877 = !DILocalVariable(name: "tz1buf", scope: !834, file: !828, line: 1747, type: !871)
!878 = !DILocalVariable(name: "gettime_buffer", scope: !834, file: !828, line: 1749, type: !838)
!879 = !DILocalVariable(name: "Start", scope: !834, file: !828, line: 1756, type: !880)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !881, line: 7, baseType: !565)
!881 = !DIFile(filename: "/usr/include/bits/types/time_t.h", directory: "")
!882 = !DILocalVariable(name: "Start_ns", scope: !834, file: !828, line: 1757, type: !422)
!883 = !DILocalVariable(name: "c", scope: !834, file: !828, line: 1759, type: !613)
!884 = !DILocalVariable(name: "tz", scope: !834, file: !828, line: 1763, type: !677)
!885 = !DILocalVariable(name: "rel_time_0", scope: !834, file: !828, line: 1768, type: !886)
!886 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !887)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "relative_time", file: !828, line: 185, baseType: !888)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !828, line: 175, size: 448, elements: !889)
!889 = !{!890, !894, !895, !896, !897, !898, !899}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !888, file: !828, line: 178, baseType: !891, size: 64)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !892, line: 101, baseType: !893)
!892 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !452, line: 72, baseType: !453)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !888, file: !828, line: 179, baseType: !891, size: 64, offset: 64)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !888, file: !828, line: 180, baseType: !891, size: 64, offset: 128)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "hour", scope: !888, file: !828, line: 181, baseType: !891, size: 64, offset: 192)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "minutes", scope: !888, file: !828, line: 182, baseType: !891, size: 64, offset: 256)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "seconds", scope: !888, file: !828, line: 183, baseType: !891, size: 64, offset: 320)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !888, file: !828, line: 184, baseType: !422, size: 32, offset: 384)
!900 = !DILocalVariable(name: "tzbase", scope: !901, file: !828, line: 1772, type: !420)
!901 = distinct !DILexicalBlock(scope: !902, file: !828, line: 1771, column: 5)
!902 = distinct !DILexicalBlock(scope: !834, file: !828, line: 1770, column: 7)
!903 = !DILocalVariable(name: "tzsize", scope: !901, file: !828, line: 1773, type: !904)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !478, line: 35, baseType: !453)
!905 = !DILocalVariable(name: "s", scope: !901, file: !828, line: 1774, type: !420)
!906 = !DILocalVariable(name: "tz1", scope: !907, file: !828, line: 1785, type: !677)
!907 = distinct !DILexicalBlock(scope: !908, file: !828, line: 1784, column: 11)
!908 = distinct !DILexicalBlock(scope: !909, file: !828, line: 1783, column: 18)
!909 = distinct !DILexicalBlock(scope: !910, file: !828, line: 1777, column: 13)
!910 = distinct !DILexicalBlock(scope: !911, file: !828, line: 1776, column: 7)
!911 = distinct !DILexicalBlock(scope: !901, file: !828, line: 1776, column: 7)
!912 = !DILocalVariable(name: "tz1string", scope: !907, file: !828, line: 1786, type: !418)
!913 = !DILocalVariable(name: "z", scope: !907, file: !828, line: 1787, type: !418)
!914 = !DILocalVariable(name: "tmp", scope: !834, file: !828, line: 1813, type: !852)
!915 = !DILocalVariable(name: "pc", scope: !834, file: !828, line: 1823, type: !916)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "parser_control", file: !828, line: 252, baseType: !917)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !828, line: 194, size: 2240, elements: !918)
!918 = !{!919, !920, !921, !922, !923, !924, !925, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !917, file: !828, line: 197, baseType: !420, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "day_ordinal", scope: !917, file: !828, line: 200, baseType: !891, size: 64, offset: 64)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "day_number", scope: !917, file: !828, line: 203, baseType: !422, size: 32, offset: 128)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "local_isdst", scope: !917, file: !828, line: 206, baseType: !422, size: 32, offset: 160)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "time_zone", scope: !917, file: !828, line: 209, baseType: !422, size: 32, offset: 192)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "meridian", scope: !917, file: !828, line: 212, baseType: !422, size: 32, offset: 224)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !917, file: !828, line: 215, baseType: !926, size: 192, offset: 256)
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "textint", file: !828, line: 156, baseType: !927)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !828, line: 151, size: 192, elements: !928)
!928 = !{!929, !930, !931}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "negative", scope: !927, file: !828, line: 153, baseType: !554, size: 8)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !927, file: !828, line: 154, baseType: !891, size: 64, offset: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "digits", scope: !927, file: !828, line: 155, baseType: !904, size: 64, offset: 128)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !917, file: !828, line: 216, baseType: !891, size: 64, offset: 448)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !917, file: !828, line: 217, baseType: !891, size: 64, offset: 512)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "hour", scope: !917, file: !828, line: 218, baseType: !891, size: 64, offset: 576)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "minutes", scope: !917, file: !828, line: 219, baseType: !891, size: 64, offset: 640)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "seconds", scope: !917, file: !828, line: 220, baseType: !838, size: 128, offset: 704)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "rel", scope: !917, file: !828, line: 223, baseType: !887, size: 448, offset: 832)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "timespec_seen", scope: !917, file: !828, line: 226, baseType: !554, size: 8, offset: 1280)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "rels_seen", scope: !917, file: !828, line: 227, baseType: !554, size: 8, offset: 1288)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "dates_seen", scope: !917, file: !828, line: 228, baseType: !904, size: 64, offset: 1344)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "days_seen", scope: !917, file: !828, line: 229, baseType: !904, size: 64, offset: 1408)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "local_zones_seen", scope: !917, file: !828, line: 230, baseType: !904, size: 64, offset: 1472)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "dsts_seen", scope: !917, file: !828, line: 231, baseType: !904, size: 64, offset: 1536)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "times_seen", scope: !917, file: !828, line: 232, baseType: !904, size: 64, offset: 1600)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "zones_seen", scope: !917, file: !828, line: 233, baseType: !904, size: 64, offset: 1664)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "year_seen", scope: !917, file: !828, line: 234, baseType: !554, size: 8, offset: 1728)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "parse_datetime_debug", scope: !917, file: !828, line: 237, baseType: !554, size: 8, offset: 1736)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "debug_dates_seen", scope: !917, file: !828, line: 240, baseType: !554, size: 8, offset: 1744)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "debug_days_seen", scope: !917, file: !828, line: 241, baseType: !554, size: 8, offset: 1752)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "debug_local_zones_seen", scope: !917, file: !828, line: 242, baseType: !554, size: 8, offset: 1760)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "debug_times_seen", scope: !917, file: !828, line: 243, baseType: !554, size: 8, offset: 1768)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "debug_zones_seen", scope: !917, file: !828, line: 244, baseType: !554, size: 8, offset: 1776)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "debug_year_seen", scope: !917, file: !828, line: 245, baseType: !554, size: 8, offset: 1784)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "debug_ordinal_day_seen", scope: !917, file: !828, line: 248, baseType: !554, size: 8, offset: 1792)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "local_time_zone_table", scope: !917, file: !828, line: 251, baseType: !956, size: 384, offset: 1856)
!956 = !DICompositeType(tag: DW_TAG_array_type, baseType: !957, size: 384, elements: !664)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "table", file: !828, line: 164, baseType: !958)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !828, line: 159, size: 128, elements: !959)
!959 = !{!960, !961, !962}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !958, file: !828, line: 161, baseType: !420, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !958, file: !828, line: 162, baseType: !422, size: 32, offset: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !958, file: !828, line: 163, baseType: !422, size: 32, offset: 96)
!963 = !DILocalVariable(name: "quarter", scope: !964, file: !828, line: 1869, type: !422)
!964 = distinct !DILexicalBlock(scope: !834, file: !828, line: 1868, column: 3)
!965 = !DILocalVariable(name: "iprobe", scope: !966, file: !828, line: 1872, type: !891)
!966 = distinct !DILexicalBlock(scope: !967, file: !828, line: 1871, column: 7)
!967 = distinct !DILexicalBlock(scope: !968, file: !828, line: 1870, column: 5)
!968 = distinct !DILexicalBlock(scope: !964, file: !828, line: 1870, column: 5)
!969 = !DILocalVariable(name: "probe", scope: !966, file: !828, line: 1876, type: !880)
!970 = !DILocalVariable(name: "probe_tm", scope: !966, file: !828, line: 1877, type: !852)
!971 = !DILocalVariable(name: "mrd", scope: !972, file: !828, line: 2006, type: !420)
!972 = distinct !DILexicalBlock(scope: !973, file: !828, line: 2005, column: 13)
!973 = distinct !DILexicalBlock(scope: !974, file: !828, line: 2004, column: 15)
!974 = distinct !DILexicalBlock(scope: !975, file: !828, line: 2002, column: 9)
!975 = distinct !DILexicalBlock(scope: !976, file: !828, line: 2001, column: 11)
!976 = distinct !DILexicalBlock(scope: !977, file: !828, line: 1973, column: 5)
!977 = distinct !DILexicalBlock(scope: !834, file: !828, line: 1970, column: 7)
!978 = !DILocalVariable(name: "repaired", scope: !979, file: !828, line: 2051, type: !554)
!979 = distinct !DILexicalBlock(scope: !980, file: !828, line: 2050, column: 9)
!980 = distinct !DILexicalBlock(scope: !976, file: !828, line: 2049, column: 11)
!981 = !DILocalVariable(name: "time_zone_seen", scope: !979, file: !828, line: 2052, type: !554)
!982 = !DILocalVariable(name: "tz2buf", scope: !983, file: !828, line: 2065, type: !985)
!983 = distinct !DILexicalBlock(scope: !984, file: !828, line: 2054, column: 13)
!984 = distinct !DILexicalBlock(scope: !979, file: !828, line: 2053, column: 15)
!985 = !DICompositeType(tag: DW_TAG_array_type, baseType: !419, size: 240, elements: !986)
!986 = !{!987}
!987 = !DISubrange(count: 30)
!988 = !DILocalVariable(name: "tz2", scope: !983, file: !828, line: 2068, type: !677)
!989 = !DILocalVariable(name: "dbg_ord", scope: !976, file: !828, line: 2095, type: !871)
!990 = !DILocalVariable(name: "dayincr", scope: !991, file: !828, line: 2099, type: !891)
!991 = distinct !DILexicalBlock(scope: !992, file: !828, line: 2098, column: 9)
!992 = distinct !DILexicalBlock(scope: !976, file: !828, line: 2097, column: 11)
!993 = !DILocalVariable(name: "year", scope: !994, file: !828, line: 2164, type: !422)
!994 = distinct !DILexicalBlock(scope: !995, file: !828, line: 2151, column: 9)
!995 = distinct !DILexicalBlock(scope: !976, file: !828, line: 2150, column: 11)
!996 = !DILocalVariable(name: "month", scope: !994, file: !828, line: 2164, type: !422)
!997 = !DILocalVariable(name: "day", scope: !994, file: !828, line: 2164, type: !422)
!998 = !DILocalVariable(name: "tm_year_buf", scope: !999, file: !828, line: 2237, type: !1003)
!999 = distinct !DILexicalBlock(scope: !1000, file: !828, line: 2234, column: 17)
!1000 = distinct !DILexicalBlock(scope: !1001, file: !828, line: 2231, column: 19)
!1001 = distinct !DILexicalBlock(scope: !1002, file: !828, line: 2192, column: 13)
!1002 = distinct !DILexicalBlock(scope: !994, file: !828, line: 2191, column: 15)
!1003 = !DICompositeType(tag: DW_TAG_array_type, baseType: !419, size: 104, elements: !1004)
!1004 = !{!1005}
!1005 = !DISubrange(count: 13)
!1006 = !DILocalVariable(name: "delta", scope: !1007, file: !828, line: 2252, type: !891)
!1007 = distinct !DILexicalBlock(scope: !1008, file: !828, line: 2251, column: 9)
!1008 = distinct !DILexicalBlock(scope: !976, file: !828, line: 2250, column: 11)
!1009 = !DILocalVariable(name: "t1", scope: !1007, file: !828, line: 2252, type: !891)
!1010 = !DILocalVariable(name: "overflow", scope: !1007, file: !828, line: 2253, type: !554)
!1011 = !DILocalVariable(name: "utcoff", scope: !1007, file: !828, line: 2255, type: !453)
!1012 = !DILocalVariable(name: "Starti", scope: !1013, file: !828, line: 2277, type: !891)
!1013 = distinct !DILexicalBlock(scope: !1014, file: !828, line: 2276, column: 9)
!1014 = distinct !DILexicalBlock(scope: !976, file: !828, line: 2275, column: 11)
!1015 = !DILocalVariable(name: "orig_ns", scope: !1016, file: !828, line: 2292, type: !891)
!1016 = distinct !DILexicalBlock(scope: !976, file: !828, line: 2291, column: 7)
!1017 = !DILocalVariable(name: "sum_ns", scope: !1016, file: !828, line: 2293, type: !891)
!1018 = !DILocalVariable(name: "normalized_ns", scope: !1016, file: !828, line: 2294, type: !422)
!1019 = !DILocalVariable(name: "d4", scope: !1016, file: !828, line: 2295, type: !422)
!1020 = !DILocalVariable(name: "d1", scope: !1016, file: !828, line: 2296, type: !891)
!1021 = !DILocalVariable(name: "t1", scope: !1016, file: !828, line: 2296, type: !891)
!1022 = !DILocalVariable(name: "d2", scope: !1016, file: !828, line: 2296, type: !891)
!1023 = !DILocalVariable(name: "t2", scope: !1016, file: !828, line: 2296, type: !891)
!1024 = !DILocalVariable(name: "t3", scope: !1016, file: !828, line: 2296, type: !891)
!1025 = !DILocalVariable(name: "t4", scope: !1016, file: !828, line: 2296, type: !891)
!1026 = !DILocalVariable(name: "lmt", scope: !1027, file: !828, line: 2335, type: !852)
!1027 = distinct !DILexicalBlock(scope: !1028, file: !828, line: 2316, column: 11)
!1028 = distinct !DILexicalBlock(scope: !1016, file: !828, line: 2314, column: 13)
!1029 = !DILocalVariable(name: "sec", scope: !1030, file: !828, line: 2354, type: !891)
!1030 = distinct !DILexicalBlock(scope: !1031, file: !828, line: 2345, column: 5)
!1031 = distinct !DILexicalBlock(scope: !834, file: !828, line: 2344, column: 7)
!1032 = !DILocalVariable(name: "nsec", scope: !1030, file: !828, line: 2355, type: !422)
!1033 = !DILocalVariable(name: "gmt", scope: !1030, file: !828, line: 2359, type: !852)
!1034 = !DILocalVariable(name: "lmt", scope: !1030, file: !828, line: 2359, type: !852)
!1035 = !DILocalVariable(name: "got_utc", scope: !1030, file: !828, line: 2360, type: !554)
!1036 = !DILocalVariable(name: "got_utcoff", scope: !1037, file: !828, line: 2368, type: !554)
!1037 = distinct !DILexicalBlock(scope: !1038, file: !828, line: 2366, column: 9)
!1038 = distinct !DILexicalBlock(scope: !1030, file: !828, line: 2365, column: 11)
!1039 = !DILocalVariable(name: "utcoff", scope: !1037, file: !828, line: 2369, type: !453)
!1040 = !DILabel(scope: !834, name: "fail", file: !828, line: 2388)
!1041 = !{!1042}
!1042 = !DIEnumerator(name: "TZBUFSIZE", value: 100, isUnsigned: true)
!1043 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !828, line: 1249, baseType: !6, size: 32, elements: !1044)
!1044 = !{!1045}
!1045 = !DIEnumerator(name: "TM_YEAR_BASE", value: 1900, isUnsigned: true)
!1046 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "yytokentype", file: !1047, line: 671, baseType: !6, size: 32, elements: !1048)
!1047 = !DIFile(filename: "parse-datetime.tab.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1048 = !{!1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068}
!1049 = !DIEnumerator(name: "tAGO", value: 258, isUnsigned: true)
!1050 = !DIEnumerator(name: "tDST", value: 259, isUnsigned: true)
!1051 = !DIEnumerator(name: "tYEAR_UNIT", value: 260, isUnsigned: true)
!1052 = !DIEnumerator(name: "tMONTH_UNIT", value: 261, isUnsigned: true)
!1053 = !DIEnumerator(name: "tHOUR_UNIT", value: 262, isUnsigned: true)
!1054 = !DIEnumerator(name: "tMINUTE_UNIT", value: 263, isUnsigned: true)
!1055 = !DIEnumerator(name: "tSEC_UNIT", value: 264, isUnsigned: true)
!1056 = !DIEnumerator(name: "tDAY_UNIT", value: 265, isUnsigned: true)
!1057 = !DIEnumerator(name: "tDAY_SHIFT", value: 266, isUnsigned: true)
!1058 = !DIEnumerator(name: "tDAY", value: 267, isUnsigned: true)
!1059 = !DIEnumerator(name: "tDAYZONE", value: 268, isUnsigned: true)
!1060 = !DIEnumerator(name: "tLOCAL_ZONE", value: 269, isUnsigned: true)
!1061 = !DIEnumerator(name: "tMERIDIAN", value: 270, isUnsigned: true)
!1062 = !DIEnumerator(name: "tMONTH", value: 271, isUnsigned: true)
!1063 = !DIEnumerator(name: "tORDINAL", value: 272, isUnsigned: true)
!1064 = !DIEnumerator(name: "tZONE", value: 273, isUnsigned: true)
!1065 = !DIEnumerator(name: "tSNUMBER", value: 274, isUnsigned: true)
!1066 = !DIEnumerator(name: "tUNUMBER", value: 275, isUnsigned: true)
!1067 = !DIEnumerator(name: "tSDECIMAL_NUMBER", value: 276, isUnsigned: true)
!1068 = !DIEnumerator(name: "tUDECIMAL_NUMBER", value: 277, isUnsigned: true)
!1069 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !828, line: 172, baseType: !6, size: 32, elements: !1070)
!1070 = !{!1071, !1072}
!1071 = !DIEnumerator(name: "BILLION", value: 1000000000, isUnsigned: true)
!1072 = !DIEnumerator(name: "LOG10_BILLION", value: 9, isUnsigned: true)
!1073 = !{!1074, !479, !1076, !584, !6, !414, !891, !457, !613, !1075, !455, !422, !453, !1088, !1089, !543, !544, !1090, !1093, !1096, !1099, !1103, !1138, !880, !1141, !1145, !1148}
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "yytype_int16", file: !1047, line: 748, baseType: !1075)
!1075 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1077 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "yyalloc", file: !1047, line: 898, size: 448, elements: !1078)
!1078 = !{!1079, !1080}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "yyss_alloc", scope: !1077, file: !1047, line: 900, baseType: !1074, size: 16)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "yyvs_alloc", scope: !1077, file: !1047, line: 901, baseType: !1081, size: 448)
!1081 = !DIDerivedType(tag: DW_TAG_typedef, name: "YYSTYPE", file: !1047, line: 710, baseType: !1082)
!1082 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "YYSTYPE", file: !1047, line: 698, size: 448, elements: !1083)
!1083 = !{!1084, !1085, !1086, !1087}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "intval", scope: !1082, file: !828, line: 577, baseType: !891, size: 64)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "textintval", scope: !1082, file: !828, line: 578, baseType: !926, size: 192)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "timespec", scope: !1082, file: !828, line: 579, baseType: !838, size: 128)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "rel", scope: !1082, file: !828, line: 580, baseType: !887, size: 448)
!1088 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!1089 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1090 = !DISubprogram(name: "parse_datetime2", scope: !572, file: !572, line: 29, type: !1091, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !423)
!1091 = !DISubroutineType(types: !1092)
!1092 = !{!554, !837, !420, !842, !6, !548, !420}
!1093 = !DISubprogram(name: "tzfree", scope: !545, file: !545, line: 781, type: !1094, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !423)
!1094 = !DISubroutineType(types: !1095)
!1095 = !{null, !548}
!1096 = !DISubprogram(name: "gettime", scope: !557, file: !557, line: 127, type: !1097, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !423)
!1097 = !DISubroutineType(types: !1098)
!1098 = !{null, !837}
!1099 = !DISubprogram(name: "localtime_rz", scope: !545, file: !545, line: 783, type: !1100, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !423)
!1100 = !DISubroutineType(types: !1101)
!1101 = !{!1102, !548, !605, !1102}
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!1103 = !DISubprogram(name: "fputc", scope: !425, file: !425, line: 521, type: !1104, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !423)
!1104 = !DISubroutineType(types: !1105)
!1105 = !{!422, !422, !1106}
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64)
!1107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !430, line: 49, size: 1728, elements: !1108)
!1108 = !{!1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1107, file: !430, line: 51, baseType: !422, size: 32)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1107, file: !430, line: 54, baseType: !418, size: 64, offset: 64)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1107, file: !430, line: 55, baseType: !418, size: 64, offset: 128)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1107, file: !430, line: 56, baseType: !418, size: 64, offset: 192)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1107, file: !430, line: 57, baseType: !418, size: 64, offset: 256)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1107, file: !430, line: 58, baseType: !418, size: 64, offset: 320)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1107, file: !430, line: 59, baseType: !418, size: 64, offset: 384)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1107, file: !430, line: 60, baseType: !418, size: 64, offset: 448)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1107, file: !430, line: 61, baseType: !418, size: 64, offset: 512)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1107, file: !430, line: 64, baseType: !418, size: 64, offset: 576)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1107, file: !430, line: 65, baseType: !418, size: 64, offset: 640)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1107, file: !430, line: 66, baseType: !418, size: 64, offset: 704)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1107, file: !430, line: 68, baseType: !445, size: 64, offset: 768)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1107, file: !430, line: 70, baseType: !1106, size: 64, offset: 832)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1107, file: !430, line: 72, baseType: !422, size: 32, offset: 896)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1107, file: !430, line: 73, baseType: !422, size: 32, offset: 928)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1107, file: !430, line: 74, baseType: !451, size: 64, offset: 960)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1107, file: !430, line: 77, baseType: !455, size: 16, offset: 1024)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1107, file: !430, line: 78, baseType: !457, size: 8, offset: 1040)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1107, file: !430, line: 79, baseType: !459, size: 8, offset: 1048)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1107, file: !430, line: 81, baseType: !463, size: 64, offset: 1088)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1107, file: !430, line: 89, baseType: !466, size: 64, offset: 1152)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1107, file: !430, line: 91, baseType: !468, size: 64, offset: 1216)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1107, file: !430, line: 92, baseType: !471, size: 64, offset: 1280)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1107, file: !430, line: 93, baseType: !1106, size: 64, offset: 1344)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1107, file: !430, line: 94, baseType: !475, size: 64, offset: 1408)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1107, file: !430, line: 95, baseType: !477, size: 64, offset: 1472)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1107, file: !430, line: 96, baseType: !422, size: 32, offset: 1536)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1107, file: !430, line: 98, baseType: !482, size: 160, offset: 1568)
!1138 = !DISubprogram(name: "mktime_z", scope: !545, file: !545, line: 789, type: !1139, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !423)
!1139 = !DISubroutineType(types: !1140)
!1140 = !{!453, !548, !1102}
!1141 = !DISubprogram(name: "gmtime_r", scope: !1142, file: !1142, line: 128, type: !1143, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !423)
!1142 = !DIFile(filename: "/usr/include/time.h", directory: "")
!1143 = !DISubroutineType(types: !1144)
!1144 = !{!1102, !605, !1102}
!1145 = !DISubprogram(name: "fputs", scope: !425, file: !425, line: 626, type: !1146, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !423)
!1146 = !DISubroutineType(types: !1147)
!1147 = !{!422, !420, !1106}
!1148 = !DISubprogram(name: "nstrftime", scope: !1149, file: !1149, line: 28, type: !1150, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !423)
!1149 = !DIFile(filename: "./lib/strftime.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1150 = !DISubroutineType(types: !1151)
!1151 = !{!479, !418, !479, !420, !1152, !548, !422}
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64)
!1153 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !852)
!1154 = !{!1155, !822, !1218, !1225, !1232, !1235, !1240, !1245, !1247, !1252, !1254, !1256, !1260, !1263, !1268, !1273, !1276, !1281, !1286, !1289, !1301}
!1155 = !DIGlobalVariableExpression(var: !1156, expr: !DIExpression())
!1156 = distinct !DIGlobalVariable(name: "yyval_default", scope: !1157, file: !1047, line: 1647, type: !1081, isLocal: true, isDefinition: true)
!1157 = distinct !DISubprogram(name: "yyparse", scope: !1047, file: !1047, line: 1638, type: !1158, scopeLine: 1639, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !824, retainedNodes: !1161)
!1158 = !DISubroutineType(types: !1159)
!1159 = !{!422, !1160}
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!1161 = !{!1162, !1163, !1164, !1165, !1166, !1167, !1168, !1170, !1172, !1173, !1175, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1187, !1189, !1190, !1192, !1194, !1202, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217}
!1162 = !DILocalVariable(name: "pc", arg: 1, scope: !1157, file: !1047, line: 1638, type: !1160)
!1163 = !DILocalVariable(name: "yychar", scope: !1157, file: !1047, line: 1641, type: !422)
!1164 = !DILocalVariable(name: "yylval", scope: !1157, file: !1047, line: 1648, type: !1081)
!1165 = !DILocalVariable(name: "yynerrs", scope: !1157, file: !1047, line: 1651, type: !422)
!1166 = !DILocalVariable(name: "yystate", scope: !1157, file: !1047, line: 1653, type: !422)
!1167 = !DILocalVariable(name: "yyerrstatus", scope: !1157, file: !1047, line: 1655, type: !422)
!1168 = !DILocalVariable(name: "yyssa", scope: !1157, file: !1047, line: 1665, type: !1169)
!1169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1074, size: 320, elements: !483)
!1170 = !DILocalVariable(name: "yyss", scope: !1157, file: !1047, line: 1666, type: !1171)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64)
!1172 = !DILocalVariable(name: "yyssp", scope: !1157, file: !1047, line: 1667, type: !1171)
!1173 = !DILocalVariable(name: "yyvsa", scope: !1157, file: !1047, line: 1670, type: !1174)
!1174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1081, size: 8960, elements: !483)
!1175 = !DILocalVariable(name: "yyvs", scope: !1157, file: !1047, line: 1671, type: !1176)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1177 = !DILocalVariable(name: "yyvsp", scope: !1157, file: !1047, line: 1672, type: !1176)
!1178 = !DILocalVariable(name: "yystacksize", scope: !1157, file: !1047, line: 1674, type: !479)
!1179 = !DILocalVariable(name: "yyn", scope: !1157, file: !1047, line: 1676, type: !422)
!1180 = !DILocalVariable(name: "yyresult", scope: !1157, file: !1047, line: 1677, type: !422)
!1181 = !DILocalVariable(name: "yytoken", scope: !1157, file: !1047, line: 1679, type: !422)
!1182 = !DILocalVariable(name: "yyval", scope: !1157, file: !1047, line: 1682, type: !1081)
!1183 = !DILocalVariable(name: "yylen", scope: !1157, file: !1047, line: 1695, type: !422)
!1184 = !DILocalVariable(name: "yysize", scope: !1185, file: !1047, line: 1733, type: !479)
!1185 = distinct !DILexicalBlock(scope: !1186, file: !1047, line: 1731, column: 5)
!1186 = distinct !DILexicalBlock(scope: !1157, file: !1047, line: 1727, column: 7)
!1187 = !DILocalVariable(name: "yyss1", scope: !1188, file: !1047, line: 1763, type: !1171)
!1188 = distinct !DILexicalBlock(scope: !1185, file: !1047, line: 1762, column: 7)
!1189 = !DILocalVariable(name: "yyptr", scope: !1188, file: !1047, line: 1764, type: !1076)
!1190 = !DILocalVariable(name: "yynewbytes", scope: !1191, file: !1047, line: 1768, type: !479)
!1191 = distinct !DILexicalBlock(scope: !1188, file: !1047, line: 1768, column: 9)
!1192 = !DILocalVariable(name: "yynewbytes", scope: !1193, file: !1047, line: 1769, type: !479)
!1193 = distinct !DILexicalBlock(scope: !1188, file: !1047, line: 1769, column: 9)
!1194 = !DILocalVariable(name: "digits", scope: !1195, file: !828, line: 819, type: !891)
!1195 = distinct !DILexicalBlock(scope: !1196, file: !828, line: 818, column: 15)
!1196 = distinct !DILexicalBlock(scope: !1197, file: !828, line: 817, column: 17)
!1197 = distinct !DILexicalBlock(scope: !1198, file: !828, line: 816, column: 11)
!1198 = distinct !DILexicalBlock(scope: !1199, file: !828, line: 815, column: 13)
!1199 = distinct !DILexicalBlock(scope: !1200, file: !828, line: 809, column: 5)
!1200 = !DILexicalBlockFile(scope: !1201, file: !828, discriminator: 0)
!1201 = distinct !DILexicalBlock(scope: !1157, file: !1047, line: 1887, column: 5)
!1202 = !DILocalVariable(name: "yylhs", scope: !1203, file: !1047, line: 2514, type: !1204)
!1203 = distinct !DILexicalBlock(scope: !1157, file: !1047, line: 2513, column: 3)
!1204 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !422)
!1205 = !DILocalVariable(name: "yyi", scope: !1203, file: !1047, line: 2515, type: !1204)
!1206 = !DILabel(scope: !1157, name: "yynewstate", file: !1047, line: 1713)
!1207 = !DILabel(scope: !1157, name: "yysetstate", file: !1047, line: 1722)
!1208 = !DILabel(scope: !1157, name: "yybackup", file: !1047, line: 1796)
!1209 = !DILabel(scope: !1157, name: "yydefault", file: !1047, line: 1860)
!1210 = !DILabel(scope: !1157, name: "yyreduce", file: !1047, line: 1870)
!1211 = !DILabel(scope: !1157, name: "yyerrlab", file: !1047, line: 2527)
!1212 = !DILabel(scope: !1157, name: "yyerrorlab", file: !1047, line: 2601)
!1213 = !DILabel(scope: !1157, name: "yyerrlab1", file: !1047, line: 2619)
!1214 = !DILabel(scope: !1157, name: "yyacceptlab", file: !1047, line: 2663)
!1215 = !DILabel(scope: !1157, name: "yyabortlab", file: !1047, line: 2671)
!1216 = !DILabel(scope: !1157, name: "yyexhaustedlab", file: !1047, line: 2680)
!1217 = !DILabel(scope: !1157, name: "yyreturn", file: !1047, line: 2690)
!1218 = !DIGlobalVariableExpression(var: !1219, expr: !DIExpression())
!1219 = distinct !DIGlobalVariable(name: "yytranslate", scope: !824, file: !1047, line: 977, type: !1220, isLocal: true, isDefinition: true)
!1220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1221, size: 2224, elements: !1223)
!1221 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1222)
!1222 = !DIDerivedType(tag: DW_TAG_typedef, name: "yytype_uint8", file: !1047, line: 730, baseType: !613)
!1223 = !{!1224}
!1224 = !DISubrange(count: 278)
!1225 = !DIGlobalVariableExpression(var: !1226, expr: !DIExpression())
!1226 = distinct !DIGlobalVariable(name: "yycheck", scope: !824, file: !1047, line: 1137, type: !1227, isLocal: true, isDefinition: true)
!1227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1228, size: 904, elements: !1230)
!1228 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1229)
!1229 = !DIDerivedType(tag: DW_TAG_typedef, name: "yytype_int8", file: !1047, line: 736, baseType: !457)
!1230 = !{!1231}
!1231 = !DISubrange(count: 113)
!1232 = !DIGlobalVariableExpression(var: !1233, expr: !DIExpression())
!1233 = distinct !DIGlobalVariable(name: "yytable", scope: !824, file: !1047, line: 1121, type: !1234, isLocal: true, isDefinition: true)
!1234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1221, size: 904, elements: !1230)
!1235 = !DIGlobalVariableExpression(var: !1236, expr: !DIExpression())
!1236 = distinct !DIGlobalVariable(name: "yydefact", scope: !824, file: !1047, line: 1086, type: !1237, isLocal: true, isDefinition: true)
!1237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1221, size: 912, elements: !1238)
!1238 = !{!1239}
!1239 = !DISubrange(count: 114)
!1240 = !DIGlobalVariableExpression(var: !1241, expr: !DIExpression())
!1241 = distinct !DIGlobalVariable(name: "yyr2", scope: !824, file: !1047, line: 1187, type: !1242, isLocal: true, isDefinition: true)
!1242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1221, size: 736, elements: !1243)
!1243 = !{!1244}
!1244 = !DISubrange(count: 92)
!1245 = !DIGlobalVariableExpression(var: !1246, expr: !DIExpression())
!1246 = distinct !DIGlobalVariable(name: "yyr1", scope: !824, file: !1047, line: 1172, type: !1242, isLocal: true, isDefinition: true)
!1247 = !DIGlobalVariableExpression(var: !1248, expr: !DIExpression())
!1248 = distinct !DIGlobalVariable(name: "yypgoto", scope: !824, file: !1047, line: 1103, type: !1249, isLocal: true, isDefinition: true)
!1249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1228, size: 208, elements: !1250)
!1250 = !{!1251}
!1251 = !DISubrange(count: 26)
!1252 = !DIGlobalVariableExpression(var: !1253, expr: !DIExpression())
!1253 = distinct !DIGlobalVariable(name: "yydefgoto", scope: !824, file: !1047, line: 1111, type: !1249, isLocal: true, isDefinition: true)
!1254 = !DIGlobalVariableExpression(var: !1255, expr: !DIExpression())
!1255 = distinct !DIGlobalVariable(name: "yystos", scope: !824, file: !1047, line: 1155, type: !1237, isLocal: true, isDefinition: true)
!1256 = !DIGlobalVariableExpression(var: !1257, expr: !DIExpression())
!1257 = distinct !DIGlobalVariable(name: "meridian_table", scope: !824, file: !828, line: 1008, type: !1258, isLocal: true, isDefinition: true)
!1258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1259, size: 640, elements: !700)
!1259 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !957)
!1260 = !DIGlobalVariableExpression(var: !1261, expr: !DIExpression())
!1261 = distinct !DIGlobalVariable(name: "month_and_day_table", scope: !824, file: !828, line: 1022, type: !1262, isLocal: true, isDefinition: true)
!1262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1259, size: 3200, elements: !710)
!1263 = !DIGlobalVariableExpression(var: !1264, expr: !DIExpression())
!1264 = distinct !DIGlobalVariable(name: "universal_time_zone_table", scope: !824, file: !828, line: 1096, type: !1265, isLocal: true, isDefinition: true)
!1265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1259, size: 512, elements: !1266)
!1266 = !{!1267}
!1267 = !DISubrange(count: 4)
!1268 = !DIGlobalVariableExpression(var: !1269, expr: !DIExpression())
!1269 = distinct !DIGlobalVariable(name: "time_zone_table", scope: !824, file: !828, line: 1109, type: !1270, isLocal: true, isDefinition: true)
!1270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1259, size: 6144, elements: !1271)
!1271 = !{!1272}
!1272 = !DISubrange(count: 48)
!1273 = !DIGlobalVariableExpression(var: !1274, expr: !DIExpression())
!1274 = distinct !DIGlobalVariable(name: "dst_table", scope: !824, file: !828, line: 1017, type: !1275, isLocal: true, isDefinition: true)
!1275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1259, size: 128, elements: !460)
!1276 = !DIGlobalVariableExpression(var: !1277, expr: !DIExpression())
!1277 = distinct !DIGlobalVariable(name: "time_units_table", scope: !824, file: !828, line: 1051, type: !1278, isLocal: true, isDefinition: true)
!1278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1259, size: 1408, elements: !1279)
!1279 = !{!1280}
!1280 = !DISubrange(count: 11)
!1281 = !DIGlobalVariableExpression(var: !1282, expr: !DIExpression())
!1282 = distinct !DIGlobalVariable(name: "relative_time_table", scope: !824, file: !828, line: 1067, type: !1283, isLocal: true, isDefinition: true)
!1283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1259, size: 2688, elements: !1284)
!1284 = !{!1285}
!1285 = !DISubrange(count: 21)
!1286 = !DIGlobalVariableExpression(var: !1287, expr: !DIExpression())
!1287 = distinct !DIGlobalVariable(name: "military_table", scope: !824, file: !828, line: 1168, type: !1288, isLocal: true, isDefinition: true)
!1288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1259, size: 3328, elements: !1250)
!1289 = !DIGlobalVariableExpression(var: !1290, expr: !DIExpression())
!1290 = distinct !DIGlobalVariable(name: "ordinal_values", scope: !1291, file: !828, line: 343, type: !1299, isLocal: true, isDefinition: true)
!1291 = distinct !DISubprogram(name: "str_days", scope: !828, file: !828, line: 340, type: !1292, scopeLine: 341, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !824, retainedNodes: !1294)
!1292 = !DISubroutineType(types: !1293)
!1293 = !{!420, !1160, !418, !422}
!1294 = !{!1295, !1296, !1297, !1298}
!1295 = !DILocalVariable(name: "pc", arg: 1, scope: !1291, file: !828, line: 340, type: !1160)
!1296 = !DILocalVariable(name: "buffer", arg: 2, scope: !1291, file: !828, line: 340, type: !418)
!1297 = !DILocalVariable(name: "n", arg: 3, scope: !1291, file: !828, line: 340, type: !422)
!1298 = !DILocalVariable(name: "len", scope: !1291, file: !828, line: 370, type: !422)
!1299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !421, size: 1232, elements: !1300)
!1300 = !{!714, !1280}
!1301 = !DIGlobalVariableExpression(var: !1302, expr: !DIExpression())
!1302 = distinct !DIGlobalVariable(name: "days_values", scope: !1291, file: !828, line: 360, type: !1303, isLocal: true, isDefinition: true)
!1303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !421, size: 224, elements: !1304)
!1304 = !{!1305, !1267}
!1305 = !DISubrange(count: 7)
!1306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1228, size: 912, elements: !1238)
!1307 = !DIGlobalVariableExpression(var: !1308, expr: !DIExpression())
!1308 = distinct !DIGlobalVariable(name: "program_name", scope: !1309, file: !1310, line: 33, type: !420, isDefinition: true)
!1309 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1310, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !423, retainedTypes: !1311, globals: !1347, nameTableKind: None)
!1310 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1311 = !{!475, !1312, !418}
!1312 = !DISubprogram(name: "fputs", scope: !425, file: !425, line: 626, type: !1313, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !423)
!1313 = !DISubroutineType(types: !1314)
!1314 = !{!422, !420, !1315}
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64)
!1316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !430, line: 49, size: 1728, elements: !1317)
!1317 = !{!1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346}
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1316, file: !430, line: 51, baseType: !422, size: 32)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1316, file: !430, line: 54, baseType: !418, size: 64, offset: 64)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1316, file: !430, line: 55, baseType: !418, size: 64, offset: 128)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1316, file: !430, line: 56, baseType: !418, size: 64, offset: 192)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1316, file: !430, line: 57, baseType: !418, size: 64, offset: 256)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1316, file: !430, line: 58, baseType: !418, size: 64, offset: 320)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1316, file: !430, line: 59, baseType: !418, size: 64, offset: 384)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1316, file: !430, line: 60, baseType: !418, size: 64, offset: 448)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1316, file: !430, line: 61, baseType: !418, size: 64, offset: 512)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1316, file: !430, line: 64, baseType: !418, size: 64, offset: 576)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1316, file: !430, line: 65, baseType: !418, size: 64, offset: 640)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1316, file: !430, line: 66, baseType: !418, size: 64, offset: 704)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1316, file: !430, line: 68, baseType: !445, size: 64, offset: 768)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1316, file: !430, line: 70, baseType: !1315, size: 64, offset: 832)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1316, file: !430, line: 72, baseType: !422, size: 32, offset: 896)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1316, file: !430, line: 73, baseType: !422, size: 32, offset: 928)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1316, file: !430, line: 74, baseType: !451, size: 64, offset: 960)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1316, file: !430, line: 77, baseType: !455, size: 16, offset: 1024)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1316, file: !430, line: 78, baseType: !457, size: 8, offset: 1040)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1316, file: !430, line: 79, baseType: !459, size: 8, offset: 1048)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1316, file: !430, line: 81, baseType: !463, size: 64, offset: 1088)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1316, file: !430, line: 89, baseType: !466, size: 64, offset: 1152)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1316, file: !430, line: 91, baseType: !468, size: 64, offset: 1216)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1316, file: !430, line: 92, baseType: !471, size: 64, offset: 1280)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1316, file: !430, line: 93, baseType: !1315, size: 64, offset: 1344)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1316, file: !430, line: 94, baseType: !475, size: 64, offset: 1408)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1316, file: !430, line: 95, baseType: !477, size: 64, offset: 1472)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1316, file: !430, line: 96, baseType: !422, size: 32, offset: 1536)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1316, file: !430, line: 98, baseType: !482, size: 160, offset: 1568)
!1347 = !{!1307}
!1348 = !DIGlobalVariableExpression(var: !1349, expr: !DIExpression())
!1349 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !1350, file: !1351, line: 85, type: !1462, isDefinition: true)
!1350 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1351, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !1352, retainedTypes: !1373, globals: !1435, nameTableKind: None)
!1351 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1352 = !{!399, !1353, !1358}
!1353 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !400, line: 242, baseType: !6, size: 32, elements: !1354)
!1354 = !{!1355, !1356, !1357}
!1355 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!1356 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!1357 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!1358 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1359, line: 46, baseType: !6, size: 32, elements: !1360)
!1359 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!1360 = !{!1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372}
!1361 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
