; ModuleID = 'coreutils-8.32/src/date.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.table = type { i8*, i32, i32 }
%union.YYSTYPE = type { %struct.relative_time }
%struct.relative_time = type { i64, i64, i64, i64, i64, i64, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.timespec = type { i64, i64 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.tm_zone = type { %struct.tm_zone*, i8, [0 x i8] }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }
%struct.parser_control = type { i8*, i64, i32, i32, i32, i32, %struct.textint, i64, i64, i64, i64, %struct.timespec, %struct.relative_time, i8, i8, i64, i64, i64, i64, i64, i64, i8, i8, i8, i8, i8, i8, i8, i8, i8, [3 x %struct.table] }
%struct.textint = type { i8, i64, i64 }

!374 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!375 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!376 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!377 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!378 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!379 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!380 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!381 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!382 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!383 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!384 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!385 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!386 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!387 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!388 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!389 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!390 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!391 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!392 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!393 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!394 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!395 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!396 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!397 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!398 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!399 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !400, line: 32, baseType: !6, size: 32, elements: !401)
!400 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!401 = !{!402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412}
!402 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!403 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!404 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!405 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!406 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!407 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!408 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!409 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!410 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!411 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!412 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!413 = !{!414, !416, !418, !419}
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!419 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!420 = !{!421, !504, !509, !0, !511, !525, !530, !536}
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(name: "rfc_3339_format", scope: !423, file: !3, line: 388, type: !501, isLocal: true, isDefinition: true)
!423 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 348, type: !424, scopeLine: 349, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !428)
!424 = !DISubroutineType(types: !425)
!425 = !{!426, !426, !427}
!426 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!428 = !{!429, !430, !431, !432, !435, !436, !446, !448, !449, !450, !451, !483, !484, !485, !487, !490, !492, !493, !498}
!429 = !DILocalVariable(name: "argc", arg: 1, scope: !423, file: !3, line: 348, type: !426)
!430 = !DILocalVariable(name: "argv", arg: 2, scope: !423, file: !3, line: 348, type: !427)
!431 = !DILocalVariable(name: "optc", scope: !423, file: !3, line: 350, type: !426)
!432 = !DILocalVariable(name: "datestr", scope: !423, file: !3, line: 351, type: !433)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !417)
!435 = !DILocalVariable(name: "set_datestr", scope: !423, file: !3, line: 352, type: !433)
!436 = !DILocalVariable(name: "when", scope: !423, file: !3, line: 353, type: !437)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !438, line: 10, size: 128, elements: !439)
!438 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!439 = !{!440, !444}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !437, file: !438, line: 12, baseType: !441, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !442, line: 160, baseType: !443)
!442 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!443 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !437, file: !438, line: 16, baseType: !445, size: 64, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !442, line: 197, baseType: !443)
!446 = !DILocalVariable(name: "set_date", scope: !423, file: !3, line: 354, type: !447)
!447 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!448 = !DILocalVariable(name: "format", scope: !423, file: !3, line: 355, type: !433)
!449 = !DILocalVariable(name: "batch_file", scope: !423, file: !3, line: 356, type: !416)
!450 = !DILocalVariable(name: "reference", scope: !423, file: !3, line: 357, type: !416)
!451 = !DILocalVariable(name: "refstats", scope: !423, file: !3, line: 358, type: !452)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !453, line: 26, size: 1152, elements: !454)
!453 = !DIFile(filename: "/usr/include/bits/struct_stat.h", directory: "")
!454 = !{!455, !458, !460, !462, !464, !466, !468, !469, !470, !472, !474, !476, !477, !478, !479}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !452, file: !453, line: 28, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !442, line: 145, baseType: !457)
!457 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !452, file: !453, line: 33, baseType: !459, size: 64, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !442, line: 148, baseType: !457)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !452, file: !453, line: 41, baseType: !461, size: 64, offset: 128)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !442, line: 151, baseType: !457)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !452, file: !453, line: 42, baseType: !463, size: 32, offset: 192)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !442, line: 150, baseType: !6)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !452, file: !453, line: 44, baseType: !465, size: 32, offset: 224)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !442, line: 146, baseType: !6)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !452, file: !453, line: 45, baseType: !467, size: 32, offset: 256)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !442, line: 147, baseType: !6)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !452, file: !453, line: 47, baseType: !426, size: 32, offset: 288)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !452, file: !453, line: 49, baseType: !456, size: 64, offset: 320)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !452, file: !453, line: 54, baseType: !471, size: 64, offset: 384)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !442, line: 152, baseType: !443)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !452, file: !453, line: 58, baseType: !473, size: 64, offset: 448)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !442, line: 175, baseType: !443)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !452, file: !453, line: 60, baseType: !475, size: 64, offset: 512)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !442, line: 180, baseType: !443)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !452, file: !453, line: 71, baseType: !437, size: 128, offset: 576)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !452, file: !453, line: 72, baseType: !437, size: 128, offset: 704)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !452, file: !453, line: 73, baseType: !437, size: 128, offset: 832)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !452, file: !453, line: 86, baseType: !480, size: 192, offset: 960)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !445, size: 192, elements: !481)
!481 = !{!482}
!482 = !DISubrange(count: 3)
!483 = !DILocalVariable(name: "ok", scope: !423, file: !3, line: 359, type: !447)
!484 = !DILocalVariable(name: "option_specified_date", scope: !423, file: !3, line: 360, type: !426)
!485 = !DILocalVariable(name: "new_format", scope: !486, file: !3, line: 373, type: !433)
!486 = distinct !DILexicalBlock(scope: !423, file: !3, line: 372, column: 5)
!487 = !DILocalVariable(name: "i", scope: !488, file: !3, line: 394, type: !5)
!488 = distinct !DILexicalBlock(scope: !489, file: !3, line: 387, column: 11)
!489 = distinct !DILexicalBlock(scope: !486, file: !3, line: 376, column: 9)
!490 = !DILocalVariable(name: "i", scope: !491, file: !3, line: 410, type: !5)
!491 = distinct !DILexicalBlock(scope: !489, file: !3, line: 401, column: 11)
!492 = !DILocalVariable(name: "tzstring", scope: !423, file: !3, line: 508, type: !433)
!493 = !DILocalVariable(name: "tz", scope: !423, file: !3, line: 509, type: !494)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !495, line: 778, baseType: !496)
!495 = !DIFile(filename: "./lib/time.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !495, line: 778, flags: DIFlagFwdDecl)
!498 = !DILocalVariable(name: "valid_date", scope: !499, file: !3, line: 515, type: !447)
!499 = distinct !DILexicalBlock(scope: !500, file: !3, line: 514, column: 5)
!500 = distinct !DILexicalBlock(scope: !423, file: !3, line: 511, column: 7)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 768, elements: !502)
!502 = !{!482, !503}
!503 = !DISubrange(count: 32)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(name: "iso_8601_format", scope: !423, file: !3, line: 402, type: !506, isLocal: true, isDefinition: true)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 1280, elements: !507)
!507 = !{!508, !503}
!508 = !DISubrange(count: 5)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(name: "parse_datetime_flags", scope: !2, file: !3, line: 109, type: !6, isLocal: true, isDefinition: true)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 88, type: !513, isLocal: true, isDefinition: true)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !514, size: 4096, elements: !523)
!514 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !515)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !516, line: 50, size: 256, elements: !517)
!516 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!517 = !{!518, !519, !520, !522}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !515, file: !516, line: 52, baseType: !433, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !515, file: !516, line: 55, baseType: !426, size: 32, offset: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !515, file: !516, line: 56, baseType: !521, size: 64, offset: 128)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !515, file: !516, line: 57, baseType: !426, size: 32, offset: 192)
!523 = !{!524}
!524 = !DISubrange(count: 16)
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(name: "time_spec", scope: !2, file: !3, line: 68, type: !527, isLocal: true, isDefinition: true)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !528, size: 160, elements: !529)
!528 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!529 = !{!508}
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(name: "time_spec_string", scope: !2, file: !3, line: 61, type: !532, isLocal: true, isDefinition: true)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !533, size: 384, elements: !534)
!533 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !433)
!534 = !{!535}
!535 = !DISubrange(count: 6)
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(name: "rfc_email_format", scope: !2, file: !3, line: 76, type: !538, isLocal: true, isDefinition: true)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 200, elements: !539)
!539 = !{!540}
!540 = !DISubrange(count: 25)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 112, elements: !542)
!542 = !{!543}
!543 = !DISubrange(count: 14)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(name: "Version", scope: !546, file: !547, line: 2, type: !433, isLocal: false, isDefinition: true)
!546 = distinct !DICompileUnit(language: DW_LANG_C99, file: !547, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !548, globals: !549, splitDebugInlining: false, nameTableKind: None)
!547 = !DIFile(filename: "src/version.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!548 = !{}
!549 = !{!544}
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !552, file: !553, line: 67, type: !557, isLocal: false, isDefinition: true)
!552 = distinct !DICompileUnit(language: DW_LANG_C99, file: !553, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !554, retainedTypes: !555, globals: !556, splitDebugInlining: false, nameTableKind: None)
!553 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!554 = !{!399}
!555 = !{!418, !433, !419}
!556 = !{!550}
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !558, line: 61, baseType: !559)
!558 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DISubroutineType(types: !561)
!561 = !{null}
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(name: "file_name", scope: !564, file: !565, line: 46, type: !433, isLocal: true, isDefinition: true)
!564 = distinct !DICompileUnit(language: DW_LANG_C99, file: !565, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !548, globals: !566, splitDebugInlining: false, nameTableKind: None)
!565 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!566 = !{!562, !567}
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !564, file: !565, line: 56, type: !447, isLocal: true, isDefinition: true)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(name: "exit_failure", scope: !571, file: !572, line: 24, type: !574, isLocal: false, isDefinition: true)
!571 = distinct !DICompileUnit(language: DW_LANG_C99, file: !572, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !548, globals: !573, splitDebugInlining: false, nameTableKind: None)
!572 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!573 = !{!569}
!574 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !426)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(name: "yypact", scope: !577, file: !802, line: 1067, type: !1003, isLocal: true, isDefinition: true)
!577 = distinct !DICompileUnit(language: DW_LANG_C99, file: !578, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !579, retainedTypes: !828, globals: !847, splitDebugInlining: false, nameTableKind: None)
!578 = !DIFile(filename: "lib/parse-datetime.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!579 = !{!580, !586, !798, !801, !824}
!580 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !581, line: 167, baseType: !6, size: 32, elements: !582)
!581 = !DIFile(filename: "parse-datetime.y", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!582 = !{!583, !584, !585}
!583 = !DIEnumerator(name: "MERam", value: 0, isUnsigned: true)
!584 = !DIEnumerator(name: "MERpm", value: 1, isUnsigned: true)
!585 = !DIEnumerator(name: "MER24", value: 2, isUnsigned: true)
!586 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !587, file: !581, line: 1746, baseType: !6, size: 32, elements: !796)
!587 = distinct !DISubprogram(name: "parse_datetime2", scope: !581, file: !581, line: 1732, type: !588, scopeLine: 1735, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !577, retainedNodes: !597)
!588 = !DISubroutineType(types: !589)
!589 = !{!447, !590, !433, !595, !6, !494, !433}
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !438, line: 10, size: 128, elements: !592)
!592 = !{!593, !594}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !591, file: !438, line: 12, baseType: !441, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !591, file: !438, line: 16, baseType: !445, size: 64, offset: 64)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !591)
!597 = !{!598, !599, !600, !601, !602, !603, !604, !619, !620, !624, !628, !629, !630, !631, !632, !633, !636, !637, !638, !639, !654, !657, !660, !661, !667, !668, !669, !670, !718, !720, !724, !725, !726, !733, !736, !737, !743, !744, !745, !748, !751, !752, !753, !761, !764, !765, !766, !767, !770, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !784, !787, !788, !789, !790, !791, !794, !795}
!598 = !DILocalVariable(name: "result", arg: 1, scope: !587, file: !581, line: 1732, type: !590)
!599 = !DILocalVariable(name: "p", arg: 2, scope: !587, file: !581, line: 1732, type: !433)
!600 = !DILocalVariable(name: "now", arg: 3, scope: !587, file: !581, line: 1733, type: !595)
!601 = !DILocalVariable(name: "flags", arg: 4, scope: !587, file: !581, line: 1733, type: !6)
!602 = !DILocalVariable(name: "tzdefault", arg: 5, scope: !587, file: !581, line: 1734, type: !494)
!603 = !DILocalVariable(name: "tzstring", arg: 6, scope: !587, file: !581, line: 1734, type: !433)
!604 = !DILocalVariable(name: "tm", scope: !587, file: !581, line: 1736, type: !605)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !606, line: 7, size: 448, elements: !607)
!606 = !DIFile(filename: "/usr/include/bits/types/struct_tm.h", directory: "")
!607 = !{!608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !605, file: !606, line: 9, baseType: !426, size: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !605, file: !606, line: 10, baseType: !426, size: 32, offset: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !605, file: !606, line: 11, baseType: !426, size: 32, offset: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !605, file: !606, line: 12, baseType: !426, size: 32, offset: 96)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !605, file: !606, line: 13, baseType: !426, size: 32, offset: 128)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !605, file: !606, line: 14, baseType: !426, size: 32, offset: 160)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !605, file: !606, line: 15, baseType: !426, size: 32, offset: 192)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !605, file: !606, line: 16, baseType: !426, size: 32, offset: 224)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !605, file: !606, line: 17, baseType: !426, size: 32, offset: 256)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !605, file: !606, line: 20, baseType: !443, size: 64, offset: 320)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !605, file: !606, line: 21, baseType: !433, size: 64, offset: 384)
!619 = !DILocalVariable(name: "tm0", scope: !587, file: !581, line: 1737, type: !605)
!620 = !DILocalVariable(name: "time_zone_buf", scope: !587, file: !581, line: 1738, type: !621)
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !417, size: 216, elements: !622)
!622 = !{!623}
!623 = !DISubrange(count: 27)
!624 = !DILocalVariable(name: "dbg_tm", scope: !587, file: !581, line: 1739, type: !625)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !417, size: 800, elements: !626)
!626 = !{!627}
!627 = !DISubrange(count: 100)
!628 = !DILocalVariable(name: "ok", scope: !587, file: !581, line: 1740, type: !447)
!629 = !DILocalVariable(name: "input_sentinel", scope: !587, file: !581, line: 1741, type: !433)
!630 = !DILocalVariable(name: "tz1alloc", scope: !587, file: !581, line: 1742, type: !416)
!631 = !DILocalVariable(name: "tz1buf", scope: !587, file: !581, line: 1747, type: !625)
!632 = !DILocalVariable(name: "gettime_buffer", scope: !587, file: !581, line: 1749, type: !591)
!633 = !DILocalVariable(name: "Start", scope: !587, file: !581, line: 1756, type: !634)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !635, line: 7, baseType: !441)
!635 = !DIFile(filename: "/usr/include/bits/types/time_t.h", directory: "")
!636 = !DILocalVariable(name: "Start_ns", scope: !587, file: !581, line: 1757, type: !426)
!637 = !DILocalVariable(name: "c", scope: !587, file: !581, line: 1759, type: !419)
!638 = !DILocalVariable(name: "tz", scope: !587, file: !581, line: 1763, type: !494)
!639 = !DILocalVariable(name: "rel_time_0", scope: !587, file: !581, line: 1768, type: !640)
!640 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !641)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "relative_time", file: !581, line: 185, baseType: !642)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !581, line: 175, size: 448, elements: !643)
!643 = !{!644, !648, !649, !650, !651, !652, !653}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !642, file: !581, line: 178, baseType: !645, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !646, line: 101, baseType: !647)
!646 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !442, line: 72, baseType: !443)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !642, file: !581, line: 179, baseType: !645, size: 64, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !642, file: !581, line: 180, baseType: !645, size: 64, offset: 128)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "hour", scope: !642, file: !581, line: 181, baseType: !645, size: 64, offset: 192)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "minutes", scope: !642, file: !581, line: 182, baseType: !645, size: 64, offset: 256)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "seconds", scope: !642, file: !581, line: 183, baseType: !645, size: 64, offset: 320)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !642, file: !581, line: 184, baseType: !426, size: 32, offset: 384)
!654 = !DILocalVariable(name: "tzbase", scope: !655, file: !581, line: 1772, type: !433)
!655 = distinct !DILexicalBlock(scope: !656, file: !581, line: 1771, column: 5)
!656 = distinct !DILexicalBlock(scope: !587, file: !581, line: 1770, column: 7)
!657 = !DILocalVariable(name: "tzsize", scope: !655, file: !581, line: 1773, type: !658)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !659, line: 35, baseType: !443)
!659 = !DIFile(filename: "/usr/lib/clang/12.0.1/include/stddef.h", directory: "")
!660 = !DILocalVariable(name: "s", scope: !655, file: !581, line: 1774, type: !433)
!661 = !DILocalVariable(name: "tz1", scope: !662, file: !581, line: 1785, type: !494)
!662 = distinct !DILexicalBlock(scope: !663, file: !581, line: 1784, column: 11)
!663 = distinct !DILexicalBlock(scope: !664, file: !581, line: 1783, column: 18)
!664 = distinct !DILexicalBlock(scope: !665, file: !581, line: 1777, column: 13)
!665 = distinct !DILexicalBlock(scope: !666, file: !581, line: 1776, column: 7)
!666 = distinct !DILexicalBlock(scope: !655, file: !581, line: 1776, column: 7)
!667 = !DILocalVariable(name: "tz1string", scope: !662, file: !581, line: 1786, type: !416)
!668 = !DILocalVariable(name: "z", scope: !662, file: !581, line: 1787, type: !416)
!669 = !DILocalVariable(name: "tmp", scope: !587, file: !581, line: 1813, type: !605)
!670 = !DILocalVariable(name: "pc", scope: !587, file: !581, line: 1823, type: !671)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "parser_control", file: !581, line: 252, baseType: !672)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !581, line: 194, size: 2240, elements: !673)
!673 = !{!674, !675, !676, !677, !678, !679, !680, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !672, file: !581, line: 197, baseType: !433, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "day_ordinal", scope: !672, file: !581, line: 200, baseType: !645, size: 64, offset: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "day_number", scope: !672, file: !581, line: 203, baseType: !426, size: 32, offset: 128)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "local_isdst", scope: !672, file: !581, line: 206, baseType: !426, size: 32, offset: 160)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "time_zone", scope: !672, file: !581, line: 209, baseType: !426, size: 32, offset: 192)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "meridian", scope: !672, file: !581, line: 212, baseType: !426, size: 32, offset: 224)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !672, file: !581, line: 215, baseType: !681, size: 192, offset: 256)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "textint", file: !581, line: 156, baseType: !682)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !581, line: 151, size: 192, elements: !683)
!683 = !{!684, !685, !686}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "negative", scope: !682, file: !581, line: 153, baseType: !447, size: 8)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !682, file: !581, line: 154, baseType: !645, size: 64, offset: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "digits", scope: !682, file: !581, line: 155, baseType: !658, size: 64, offset: 128)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !672, file: !581, line: 216, baseType: !645, size: 64, offset: 448)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !672, file: !581, line: 217, baseType: !645, size: 64, offset: 512)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "hour", scope: !672, file: !581, line: 218, baseType: !645, size: 64, offset: 576)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "minutes", scope: !672, file: !581, line: 219, baseType: !645, size: 64, offset: 640)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "seconds", scope: !672, file: !581, line: 220, baseType: !591, size: 128, offset: 704)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "rel", scope: !672, file: !581, line: 223, baseType: !641, size: 448, offset: 832)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "timespec_seen", scope: !672, file: !581, line: 226, baseType: !447, size: 8, offset: 1280)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "rels_seen", scope: !672, file: !581, line: 227, baseType: !447, size: 8, offset: 1288)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "dates_seen", scope: !672, file: !581, line: 228, baseType: !658, size: 64, offset: 1344)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "days_seen", scope: !672, file: !581, line: 229, baseType: !658, size: 64, offset: 1408)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "local_zones_seen", scope: !672, file: !581, line: 230, baseType: !658, size: 64, offset: 1472)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "dsts_seen", scope: !672, file: !581, line: 231, baseType: !658, size: 64, offset: 1536)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "times_seen", scope: !672, file: !581, line: 232, baseType: !658, size: 64, offset: 1600)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "zones_seen", scope: !672, file: !581, line: 233, baseType: !658, size: 64, offset: 1664)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "year_seen", scope: !672, file: !581, line: 234, baseType: !447, size: 8, offset: 1728)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "parse_datetime_debug", scope: !672, file: !581, line: 237, baseType: !447, size: 8, offset: 1736)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "debug_dates_seen", scope: !672, file: !581, line: 240, baseType: !447, size: 8, offset: 1744)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "debug_days_seen", scope: !672, file: !581, line: 241, baseType: !447, size: 8, offset: 1752)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "debug_local_zones_seen", scope: !672, file: !581, line: 242, baseType: !447, size: 8, offset: 1760)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "debug_times_seen", scope: !672, file: !581, line: 243, baseType: !447, size: 8, offset: 1768)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "debug_zones_seen", scope: !672, file: !581, line: 244, baseType: !447, size: 8, offset: 1776)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "debug_year_seen", scope: !672, file: !581, line: 245, baseType: !447, size: 8, offset: 1784)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "debug_ordinal_day_seen", scope: !672, file: !581, line: 248, baseType: !447, size: 8, offset: 1792)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "local_time_zone_table", scope: !672, file: !581, line: 251, baseType: !711, size: 384, offset: 1856)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !712, size: 384, elements: !481)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "table", file: !581, line: 164, baseType: !713)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !581, line: 159, size: 128, elements: !714)
!714 = !{!715, !716, !717}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !713, file: !581, line: 161, baseType: !433, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !713, file: !581, line: 162, baseType: !426, size: 32, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !713, file: !581, line: 163, baseType: !426, size: 32, offset: 96)
!718 = !DILocalVariable(name: "quarter", scope: !719, file: !581, line: 1869, type: !426)
!719 = distinct !DILexicalBlock(scope: !587, file: !581, line: 1868, column: 3)
!720 = !DILocalVariable(name: "iprobe", scope: !721, file: !581, line: 1872, type: !645)
!721 = distinct !DILexicalBlock(scope: !722, file: !581, line: 1871, column: 7)
!722 = distinct !DILexicalBlock(scope: !723, file: !581, line: 1870, column: 5)
!723 = distinct !DILexicalBlock(scope: !719, file: !581, line: 1870, column: 5)
!724 = !DILocalVariable(name: "probe", scope: !721, file: !581, line: 1876, type: !634)
!725 = !DILocalVariable(name: "probe_tm", scope: !721, file: !581, line: 1877, type: !605)
!726 = !DILocalVariable(name: "mrd", scope: !727, file: !581, line: 2006, type: !433)
!727 = distinct !DILexicalBlock(scope: !728, file: !581, line: 2005, column: 13)
!728 = distinct !DILexicalBlock(scope: !729, file: !581, line: 2004, column: 15)
!729 = distinct !DILexicalBlock(scope: !730, file: !581, line: 2002, column: 9)
!730 = distinct !DILexicalBlock(scope: !731, file: !581, line: 2001, column: 11)
!731 = distinct !DILexicalBlock(scope: !732, file: !581, line: 1973, column: 5)
!732 = distinct !DILexicalBlock(scope: !587, file: !581, line: 1970, column: 7)
!733 = !DILocalVariable(name: "repaired", scope: !734, file: !581, line: 2051, type: !447)
!734 = distinct !DILexicalBlock(scope: !735, file: !581, line: 2050, column: 9)
!735 = distinct !DILexicalBlock(scope: !731, file: !581, line: 2049, column: 11)
!736 = !DILocalVariable(name: "time_zone_seen", scope: !734, file: !581, line: 2052, type: !447)
!737 = !DILocalVariable(name: "tz2buf", scope: !738, file: !581, line: 2065, type: !740)
!738 = distinct !DILexicalBlock(scope: !739, file: !581, line: 2054, column: 13)
!739 = distinct !DILexicalBlock(scope: !734, file: !581, line: 2053, column: 15)
!740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !417, size: 240, elements: !741)
!741 = !{!742}
!742 = !DISubrange(count: 30)
!743 = !DILocalVariable(name: "tz2", scope: !738, file: !581, line: 2068, type: !494)
!744 = !DILocalVariable(name: "dbg_ord", scope: !731, file: !581, line: 2095, type: !625)
!745 = !DILocalVariable(name: "dayincr", scope: !746, file: !581, line: 2099, type: !645)
!746 = distinct !DILexicalBlock(scope: !747, file: !581, line: 2098, column: 9)
!747 = distinct !DILexicalBlock(scope: !731, file: !581, line: 2097, column: 11)
!748 = !DILocalVariable(name: "year", scope: !749, file: !581, line: 2164, type: !426)
!749 = distinct !DILexicalBlock(scope: !750, file: !581, line: 2151, column: 9)
!750 = distinct !DILexicalBlock(scope: !731, file: !581, line: 2150, column: 11)
!751 = !DILocalVariable(name: "month", scope: !749, file: !581, line: 2164, type: !426)
!752 = !DILocalVariable(name: "day", scope: !749, file: !581, line: 2164, type: !426)
!753 = !DILocalVariable(name: "tm_year_buf", scope: !754, file: !581, line: 2237, type: !758)
!754 = distinct !DILexicalBlock(scope: !755, file: !581, line: 2234, column: 17)
!755 = distinct !DILexicalBlock(scope: !756, file: !581, line: 2231, column: 19)
!756 = distinct !DILexicalBlock(scope: !757, file: !581, line: 2192, column: 13)
!757 = distinct !DILexicalBlock(scope: !749, file: !581, line: 2191, column: 15)
!758 = !DICompositeType(tag: DW_TAG_array_type, baseType: !417, size: 104, elements: !759)
!759 = !{!760}
!760 = !DISubrange(count: 13)
!761 = !DILocalVariable(name: "delta", scope: !762, file: !581, line: 2252, type: !645)
!762 = distinct !DILexicalBlock(scope: !763, file: !581, line: 2251, column: 9)
!763 = distinct !DILexicalBlock(scope: !731, file: !581, line: 2250, column: 11)
!764 = !DILocalVariable(name: "t1", scope: !762, file: !581, line: 2252, type: !645)
!765 = !DILocalVariable(name: "overflow", scope: !762, file: !581, line: 2253, type: !447)
!766 = !DILocalVariable(name: "utcoff", scope: !762, file: !581, line: 2255, type: !443)
!767 = !DILocalVariable(name: "Starti", scope: !768, file: !581, line: 2277, type: !645)
!768 = distinct !DILexicalBlock(scope: !769, file: !581, line: 2276, column: 9)
!769 = distinct !DILexicalBlock(scope: !731, file: !581, line: 2275, column: 11)
!770 = !DILocalVariable(name: "orig_ns", scope: !771, file: !581, line: 2292, type: !645)
!771 = distinct !DILexicalBlock(scope: !731, file: !581, line: 2291, column: 7)
!772 = !DILocalVariable(name: "sum_ns", scope: !771, file: !581, line: 2293, type: !645)
!773 = !DILocalVariable(name: "normalized_ns", scope: !771, file: !581, line: 2294, type: !426)
!774 = !DILocalVariable(name: "d4", scope: !771, file: !581, line: 2295, type: !426)
!775 = !DILocalVariable(name: "d1", scope: !771, file: !581, line: 2296, type: !645)
!776 = !DILocalVariable(name: "t1", scope: !771, file: !581, line: 2296, type: !645)
!777 = !DILocalVariable(name: "d2", scope: !771, file: !581, line: 2296, type: !645)
!778 = !DILocalVariable(name: "t2", scope: !771, file: !581, line: 2296, type: !645)
!779 = !DILocalVariable(name: "t3", scope: !771, file: !581, line: 2296, type: !645)
!780 = !DILocalVariable(name: "t4", scope: !771, file: !581, line: 2296, type: !645)
!781 = !DILocalVariable(name: "lmt", scope: !782, file: !581, line: 2335, type: !605)
!782 = distinct !DILexicalBlock(scope: !783, file: !581, line: 2316, column: 11)
!783 = distinct !DILexicalBlock(scope: !771, file: !581, line: 2314, column: 13)
!784 = !DILocalVariable(name: "sec", scope: !785, file: !581, line: 2354, type: !645)
!785 = distinct !DILexicalBlock(scope: !786, file: !581, line: 2345, column: 5)
!786 = distinct !DILexicalBlock(scope: !587, file: !581, line: 2344, column: 7)
!787 = !DILocalVariable(name: "nsec", scope: !785, file: !581, line: 2355, type: !426)
!788 = !DILocalVariable(name: "gmt", scope: !785, file: !581, line: 2359, type: !605)
!789 = !DILocalVariable(name: "lmt", scope: !785, file: !581, line: 2359, type: !605)
!790 = !DILocalVariable(name: "got_utc", scope: !785, file: !581, line: 2360, type: !447)
!791 = !DILocalVariable(name: "got_utcoff", scope: !792, file: !581, line: 2368, type: !447)
!792 = distinct !DILexicalBlock(scope: !793, file: !581, line: 2366, column: 9)
!793 = distinct !DILexicalBlock(scope: !785, file: !581, line: 2365, column: 11)
!794 = !DILocalVariable(name: "utcoff", scope: !792, file: !581, line: 2369, type: !443)
!795 = !DILabel(scope: !587, name: "fail", file: !581, line: 2388)
!796 = !{!797}
!797 = !DIEnumerator(name: "TZBUFSIZE", value: 100, isUnsigned: true)
!798 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !581, line: 1249, baseType: !6, size: 32, elements: !799)
!799 = !{!800}
!800 = !DIEnumerator(name: "TM_YEAR_BASE", value: 1900, isUnsigned: true)
!801 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "yytokentype", file: !802, line: 671, baseType: !6, size: 32, elements: !803)
!802 = !DIFile(filename: "parse-datetime.tab.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!803 = !{!804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823}
!804 = !DIEnumerator(name: "tAGO", value: 258, isUnsigned: true)
!805 = !DIEnumerator(name: "tDST", value: 259, isUnsigned: true)
!806 = !DIEnumerator(name: "tYEAR_UNIT", value: 260, isUnsigned: true)
!807 = !DIEnumerator(name: "tMONTH_UNIT", value: 261, isUnsigned: true)
!808 = !DIEnumerator(name: "tHOUR_UNIT", value: 262, isUnsigned: true)
!809 = !DIEnumerator(name: "tMINUTE_UNIT", value: 263, isUnsigned: true)
!810 = !DIEnumerator(name: "tSEC_UNIT", value: 264, isUnsigned: true)
!811 = !DIEnumerator(name: "tDAY_UNIT", value: 265, isUnsigned: true)
!812 = !DIEnumerator(name: "tDAY_SHIFT", value: 266, isUnsigned: true)
!813 = !DIEnumerator(name: "tDAY", value: 267, isUnsigned: true)
!814 = !DIEnumerator(name: "tDAYZONE", value: 268, isUnsigned: true)
!815 = !DIEnumerator(name: "tLOCAL_ZONE", value: 269, isUnsigned: true)
!816 = !DIEnumerator(name: "tMERIDIAN", value: 270, isUnsigned: true)
!817 = !DIEnumerator(name: "tMONTH", value: 271, isUnsigned: true)
!818 = !DIEnumerator(name: "tORDINAL", value: 272, isUnsigned: true)
!819 = !DIEnumerator(name: "tZONE", value: 273, isUnsigned: true)
!820 = !DIEnumerator(name: "tSNUMBER", value: 274, isUnsigned: true)
!821 = !DIEnumerator(name: "tUNUMBER", value: 275, isUnsigned: true)
!822 = !DIEnumerator(name: "tSDECIMAL_NUMBER", value: 276, isUnsigned: true)
!823 = !DIEnumerator(name: "tUDECIMAL_NUMBER", value: 277, isUnsigned: true)
!824 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !581, line: 172, baseType: !6, size: 32, elements: !825)
!825 = !{!826, !827}
!826 = !DIEnumerator(name: "BILLION", value: 1000000000, isUnsigned: true)
!827 = !DIEnumerator(name: "LOG10_BILLION", value: 9, isUnsigned: true)
!828 = !{!829, !457, !831, !6, !645, !843, !419, !830, !844, !426, !443, !845, !846, !634}
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "yytype_int16", file: !802, line: 748, baseType: !830)
!830 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "yyalloc", file: !802, line: 898, size: 448, elements: !833)
!833 = !{!834, !835}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "yyss_alloc", scope: !832, file: !802, line: 900, baseType: !829, size: 16)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "yyvs_alloc", scope: !832, file: !802, line: 901, baseType: !836, size: 448)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "YYSTYPE", file: !802, line: 710, baseType: !837)
!837 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "YYSTYPE", file: !802, line: 698, size: 448, elements: !838)
!838 = !{!839, !840, !841, !842}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "intval", scope: !837, file: !581, line: 577, baseType: !645, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "textintval", scope: !837, file: !581, line: 578, baseType: !681, size: 192)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "timespec", scope: !837, file: !581, line: 579, baseType: !591, size: 128)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "rel", scope: !837, file: !581, line: 580, baseType: !641, size: 448)
!843 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!844 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!845 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!846 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!847 = !{!848, !575, !913, !920, !927, !930, !935, !940, !942, !947, !949, !951, !955, !958, !963, !968, !973, !978, !983, !986, !998}
!848 = !DIGlobalVariableExpression(var: !849, expr: !DIExpression())
!849 = distinct !DIGlobalVariable(name: "yyval_default", scope: !850, file: !802, line: 1647, type: !836, isLocal: true, isDefinition: true)
!850 = distinct !DISubprogram(name: "yyparse", scope: !802, file: !802, line: 1638, type: !851, scopeLine: 1639, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !577, retainedNodes: !854)
!851 = !DISubroutineType(types: !852)
!852 = !{!426, !853}
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!854 = !{!855, !856, !857, !858, !859, !860, !861, !865, !867, !868, !870, !872, !873, !874, !875, !876, !877, !878, !879, !882, !884, !885, !887, !889, !897, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912}
!855 = !DILocalVariable(name: "pc", arg: 1, scope: !850, file: !802, line: 1638, type: !853)
!856 = !DILocalVariable(name: "yychar", scope: !850, file: !802, line: 1641, type: !426)
!857 = !DILocalVariable(name: "yylval", scope: !850, file: !802, line: 1648, type: !836)
!858 = !DILocalVariable(name: "yynerrs", scope: !850, file: !802, line: 1651, type: !426)
!859 = !DILocalVariable(name: "yystate", scope: !850, file: !802, line: 1653, type: !426)
!860 = !DILocalVariable(name: "yyerrstatus", scope: !850, file: !802, line: 1655, type: !426)
!861 = !DILocalVariable(name: "yyssa", scope: !850, file: !802, line: 1665, type: !862)
!862 = !DICompositeType(tag: DW_TAG_array_type, baseType: !829, size: 320, elements: !863)
!863 = !{!864}
!864 = !DISubrange(count: 20)
!865 = !DILocalVariable(name: "yyss", scope: !850, file: !802, line: 1666, type: !866)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!867 = !DILocalVariable(name: "yyssp", scope: !850, file: !802, line: 1667, type: !866)
!868 = !DILocalVariable(name: "yyvsa", scope: !850, file: !802, line: 1670, type: !869)
!869 = !DICompositeType(tag: DW_TAG_array_type, baseType: !836, size: 8960, elements: !863)
!870 = !DILocalVariable(name: "yyvs", scope: !850, file: !802, line: 1671, type: !871)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!872 = !DILocalVariable(name: "yyvsp", scope: !850, file: !802, line: 1672, type: !871)
!873 = !DILocalVariable(name: "yystacksize", scope: !850, file: !802, line: 1674, type: !457)
!874 = !DILocalVariable(name: "yyn", scope: !850, file: !802, line: 1676, type: !426)
!875 = !DILocalVariable(name: "yyresult", scope: !850, file: !802, line: 1677, type: !426)
!876 = !DILocalVariable(name: "yytoken", scope: !850, file: !802, line: 1679, type: !426)
!877 = !DILocalVariable(name: "yyval", scope: !850, file: !802, line: 1682, type: !836)
!878 = !DILocalVariable(name: "yylen", scope: !850, file: !802, line: 1695, type: !426)
!879 = !DILocalVariable(name: "yysize", scope: !880, file: !802, line: 1733, type: !457)
!880 = distinct !DILexicalBlock(scope: !881, file: !802, line: 1731, column: 5)
!881 = distinct !DILexicalBlock(scope: !850, file: !802, line: 1727, column: 7)
!882 = !DILocalVariable(name: "yyss1", scope: !883, file: !802, line: 1763, type: !866)
!883 = distinct !DILexicalBlock(scope: !880, file: !802, line: 1762, column: 7)
!884 = !DILocalVariable(name: "yyptr", scope: !883, file: !802, line: 1764, type: !831)
!885 = !DILocalVariable(name: "yynewbytes", scope: !886, file: !802, line: 1768, type: !457)
!886 = distinct !DILexicalBlock(scope: !883, file: !802, line: 1768, column: 9)
!887 = !DILocalVariable(name: "yynewbytes", scope: !888, file: !802, line: 1769, type: !457)
!888 = distinct !DILexicalBlock(scope: !883, file: !802, line: 1769, column: 9)
!889 = !DILocalVariable(name: "digits", scope: !890, file: !581, line: 819, type: !645)
!890 = distinct !DILexicalBlock(scope: !891, file: !581, line: 818, column: 15)
!891 = distinct !DILexicalBlock(scope: !892, file: !581, line: 817, column: 17)
!892 = distinct !DILexicalBlock(scope: !893, file: !581, line: 816, column: 11)
!893 = distinct !DILexicalBlock(scope: !894, file: !581, line: 815, column: 13)
!894 = distinct !DILexicalBlock(scope: !895, file: !581, line: 809, column: 5)
!895 = !DILexicalBlockFile(scope: !896, file: !581, discriminator: 0)
!896 = distinct !DILexicalBlock(scope: !850, file: !802, line: 1887, column: 5)
!897 = !DILocalVariable(name: "yylhs", scope: !898, file: !802, line: 2514, type: !899)
!898 = distinct !DILexicalBlock(scope: !850, file: !802, line: 2513, column: 3)
!899 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !426)
!900 = !DILocalVariable(name: "yyi", scope: !898, file: !802, line: 2515, type: !899)
!901 = !DILabel(scope: !850, name: "yynewstate", file: !802, line: 1713)
!902 = !DILabel(scope: !850, name: "yysetstate", file: !802, line: 1722)
!903 = !DILabel(scope: !850, name: "yybackup", file: !802, line: 1796)
!904 = !DILabel(scope: !850, name: "yydefault", file: !802, line: 1860)
!905 = !DILabel(scope: !850, name: "yyreduce", file: !802, line: 1870)
!906 = !DILabel(scope: !850, name: "yyerrlab", file: !802, line: 2527)
!907 = !DILabel(scope: !850, name: "yyerrorlab", file: !802, line: 2601)
!908 = !DILabel(scope: !850, name: "yyerrlab1", file: !802, line: 2619)
!909 = !DILabel(scope: !850, name: "yyacceptlab", file: !802, line: 2663)
!910 = !DILabel(scope: !850, name: "yyabortlab", file: !802, line: 2671)
!911 = !DILabel(scope: !850, name: "yyexhaustedlab", file: !802, line: 2680)
!912 = !DILabel(scope: !850, name: "yyreturn", file: !802, line: 2690)
!913 = !DIGlobalVariableExpression(var: !914, expr: !DIExpression())
!914 = distinct !DIGlobalVariable(name: "yytranslate", scope: !577, file: !802, line: 977, type: !915, isLocal: true, isDefinition: true)
!915 = !DICompositeType(tag: DW_TAG_array_type, baseType: !916, size: 2224, elements: !918)
!916 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !917)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "yytype_uint8", file: !802, line: 730, baseType: !419)
!918 = !{!919}
!919 = !DISubrange(count: 278)
!920 = !DIGlobalVariableExpression(var: !921, expr: !DIExpression())
!921 = distinct !DIGlobalVariable(name: "yycheck", scope: !577, file: !802, line: 1137, type: !922, isLocal: true, isDefinition: true)
!922 = !DICompositeType(tag: DW_TAG_array_type, baseType: !923, size: 904, elements: !925)
!923 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !924)
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "yytype_int8", file: !802, line: 736, baseType: !843)
!925 = !{!926}
!926 = !DISubrange(count: 113)
!927 = !DIGlobalVariableExpression(var: !928, expr: !DIExpression())
!928 = distinct !DIGlobalVariable(name: "yytable", scope: !577, file: !802, line: 1121, type: !929, isLocal: true, isDefinition: true)
!929 = !DICompositeType(tag: DW_TAG_array_type, baseType: !916, size: 904, elements: !925)
!930 = !DIGlobalVariableExpression(var: !931, expr: !DIExpression())
!931 = distinct !DIGlobalVariable(name: "yydefact", scope: !577, file: !802, line: 1086, type: !932, isLocal: true, isDefinition: true)
!932 = !DICompositeType(tag: DW_TAG_array_type, baseType: !916, size: 912, elements: !933)
!933 = !{!934}
!934 = !DISubrange(count: 114)
!935 = !DIGlobalVariableExpression(var: !936, expr: !DIExpression())
!936 = distinct !DIGlobalVariable(name: "yyr2", scope: !577, file: !802, line: 1187, type: !937, isLocal: true, isDefinition: true)
!937 = !DICompositeType(tag: DW_TAG_array_type, baseType: !916, size: 736, elements: !938)
!938 = !{!939}
!939 = !DISubrange(count: 92)
!940 = !DIGlobalVariableExpression(var: !941, expr: !DIExpression())
!941 = distinct !DIGlobalVariable(name: "yyr1", scope: !577, file: !802, line: 1172, type: !937, isLocal: true, isDefinition: true)
!942 = !DIGlobalVariableExpression(var: !943, expr: !DIExpression())
!943 = distinct !DIGlobalVariable(name: "yypgoto", scope: !577, file: !802, line: 1103, type: !944, isLocal: true, isDefinition: true)
!944 = !DICompositeType(tag: DW_TAG_array_type, baseType: !923, size: 208, elements: !945)
!945 = !{!946}
!946 = !DISubrange(count: 26)
!947 = !DIGlobalVariableExpression(var: !948, expr: !DIExpression())
!948 = distinct !DIGlobalVariable(name: "yydefgoto", scope: !577, file: !802, line: 1111, type: !944, isLocal: true, isDefinition: true)
!949 = !DIGlobalVariableExpression(var: !950, expr: !DIExpression())
!950 = distinct !DIGlobalVariable(name: "yystos", scope: !577, file: !802, line: 1155, type: !932, isLocal: true, isDefinition: true)
!951 = !DIGlobalVariableExpression(var: !952, expr: !DIExpression())
!952 = distinct !DIGlobalVariable(name: "meridian_table", scope: !577, file: !581, line: 1008, type: !953, isLocal: true, isDefinition: true)
!953 = !DICompositeType(tag: DW_TAG_array_type, baseType: !954, size: 640, elements: !529)
!954 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !712)
!955 = !DIGlobalVariableExpression(var: !956, expr: !DIExpression())
!956 = distinct !DIGlobalVariable(name: "month_and_day_table", scope: !577, file: !581, line: 1022, type: !957, isLocal: true, isDefinition: true)
!957 = !DICompositeType(tag: DW_TAG_array_type, baseType: !954, size: 3200, elements: !539)
!958 = !DIGlobalVariableExpression(var: !959, expr: !DIExpression())
!959 = distinct !DIGlobalVariable(name: "universal_time_zone_table", scope: !577, file: !581, line: 1096, type: !960, isLocal: true, isDefinition: true)
!960 = !DICompositeType(tag: DW_TAG_array_type, baseType: !954, size: 512, elements: !961)
!961 = !{!962}
!962 = !DISubrange(count: 4)
!963 = !DIGlobalVariableExpression(var: !964, expr: !DIExpression())
!964 = distinct !DIGlobalVariable(name: "time_zone_table", scope: !577, file: !581, line: 1109, type: !965, isLocal: true, isDefinition: true)
!965 = !DICompositeType(tag: DW_TAG_array_type, baseType: !954, size: 6144, elements: !966)
!966 = !{!967}
!967 = !DISubrange(count: 48)
!968 = !DIGlobalVariableExpression(var: !969, expr: !DIExpression())
!969 = distinct !DIGlobalVariable(name: "dst_table", scope: !577, file: !581, line: 1017, type: !970, isLocal: true, isDefinition: true)
!970 = !DICompositeType(tag: DW_TAG_array_type, baseType: !954, size: 128, elements: !971)
!971 = !{!972}
!972 = !DISubrange(count: 1)
!973 = !DIGlobalVariableExpression(var: !974, expr: !DIExpression())
!974 = distinct !DIGlobalVariable(name: "time_units_table", scope: !577, file: !581, line: 1051, type: !975, isLocal: true, isDefinition: true)
!975 = !DICompositeType(tag: DW_TAG_array_type, baseType: !954, size: 1408, elements: !976)
!976 = !{!977}
!977 = !DISubrange(count: 11)
!978 = !DIGlobalVariableExpression(var: !979, expr: !DIExpression())
!979 = distinct !DIGlobalVariable(name: "relative_time_table", scope: !577, file: !581, line: 1067, type: !980, isLocal: true, isDefinition: true)
!980 = !DICompositeType(tag: DW_TAG_array_type, baseType: !954, size: 2688, elements: !981)
!981 = !{!982}
!982 = !DISubrange(count: 21)
!983 = !DIGlobalVariableExpression(var: !984, expr: !DIExpression())
!984 = distinct !DIGlobalVariable(name: "military_table", scope: !577, file: !581, line: 1168, type: !985, isLocal: true, isDefinition: true)
!985 = !DICompositeType(tag: DW_TAG_array_type, baseType: !954, size: 3328, elements: !945)
!986 = !DIGlobalVariableExpression(var: !987, expr: !DIExpression())
!987 = distinct !DIGlobalVariable(name: "ordinal_values", scope: !988, file: !581, line: 343, type: !996, isLocal: true, isDefinition: true)
!988 = distinct !DISubprogram(name: "str_days", scope: !581, file: !581, line: 340, type: !989, scopeLine: 341, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !577, retainedNodes: !991)
!989 = !DISubroutineType(types: !990)
!990 = !{!433, !853, !416, !426}
!991 = !{!992, !993, !994, !995}
!992 = !DILocalVariable(name: "pc", arg: 1, scope: !988, file: !581, line: 340, type: !853)
!993 = !DILocalVariable(name: "buffer", arg: 2, scope: !988, file: !581, line: 340, type: !416)
!994 = !DILocalVariable(name: "n", arg: 3, scope: !988, file: !581, line: 340, type: !426)
!995 = !DILocalVariable(name: "len", scope: !988, file: !581, line: 370, type: !426)
!996 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 1232, elements: !997)
!997 = !{!543, !977}
!998 = !DIGlobalVariableExpression(var: !999, expr: !DIExpression())
!999 = distinct !DIGlobalVariable(name: "days_values", scope: !988, file: !581, line: 360, type: !1000, isLocal: true, isDefinition: true)
!1000 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 224, elements: !1001)
!1001 = !{!1002, !962}
!1002 = !DISubrange(count: 7)
!1003 = !DICompositeType(tag: DW_TAG_array_type, baseType: !923, size: 912, elements: !933)
!1004 = !DIGlobalVariableExpression(var: !1005, expr: !DIExpression())
!1005 = distinct !DIGlobalVariable(name: "program_name", scope: !1006, file: !1007, line: 33, type: !433, isLocal: false, isDefinition: true)
!1006 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1007, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !548, retainedTypes: !1008, globals: !1009, splitDebugInlining: false, nameTableKind: None)
!1007 = !DIFile(filename: "lib/progname.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1008 = !{!418, !416}
!1009 = !{!1004}
!1010 = !DIGlobalVariableExpression(var: !1011, expr: !DIExpression())
!1011 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !1012, file: !1013, line: 85, type: !1074, isLocal: false, isDefinition: true)
!1012 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1013, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1014, retainedTypes: !1035, globals: !1037, splitDebugInlining: false, nameTableKind: None)
!1013 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1014 = !{!399, !1015, !1020}
!1015 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !400, line: 242, baseType: !6, size: 32, elements: !1016)
!1016 = !{!1017, !1018, !1019}
!1017 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!1018 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!1019 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!1020 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1021, line: 46, baseType: !6, size: 32, elements: !1022)
!1021 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!1022 = !{!1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034}
!1023 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!1024 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!1025 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!1026 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!1027 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!1028 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!1029 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!1030 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!1031 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!1032 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!1033 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!1034 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!1035 = !{!426, !844, !1036, !416}
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !659, line: 46, baseType: !457)
!1037 = !{!1010, !1038, !1044, !1056, !1058, !1063, !1070, !1072}
!1038 = !DIGlobalVariableExpression(var: !1039, expr: !DIExpression())
!1039 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !1012, file: !1013, line: 101, type: !1040, isLocal: false, isDefinition: true)
!1040 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1041, size: 320, elements: !1042)
!1041 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !399)
!1042 = !{!1043}
!1043 = !DISubrange(count: 10)
!1044 = !DIGlobalVariableExpression(var: !1045, expr: !DIExpression())
!1045 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !1012, file: !1013, line: 1052, type: !1046, isLocal: false, isDefinition: true)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !1013, line: 65, size: 448, elements: !1047)
!1047 = !{!1048, !1049, !1050, !1054, !1055}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !1046, file: !1013, line: 68, baseType: !399, size: 32)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1046, file: !1013, line: 71, baseType: !426, size: 32, offset: 32)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !1046, file: !1013, line: 75, baseType: !1051, size: 256, offset: 64)
!1051 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !1052)
!1052 = !{!1053}
!1053 = !DISubrange(count: 8)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !1046, file: !1013, line: 78, baseType: !433, size: 64, offset: 320)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !1046, file: !1013, line: 81, baseType: !433, size: 64, offset: 384)
!1056 = !DIGlobalVariableExpression(var: !1057, expr: !DIExpression())
!1057 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !1012, file: !1013, line: 116, type: !1046, isLocal: true, isDefinition: true)
!1058 = !DIGlobalVariableExpression(var: !1059, expr: !DIExpression())
!1059 = distinct !DIGlobalVariable(name: "slot0", scope: !1012, file: !1013, line: 842, type: !1060, isLocal: true, isDefinition: true)
!1060 = !DICompositeType(tag: DW_TAG_array_type, baseType: !417, size: 2048, elements: !1061)
!1061 = !{!1062}
!1062 = !DISubrange(count: 256)
!1063 = !DIGlobalVariableExpression(var: !1064, expr: !DIExpression())
!1064 = distinct !DIGlobalVariable(name: "slotvec", scope: !1012, file: !1013, line: 845, type: !1065, isLocal: true, isDefinition: true)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64)
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !1013, line: 834, size: 128, elements: !1067)
!1067 = !{!1068, !1069}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1066, file: !1013, line: 836, baseType: !1036, size: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1066, file: !1013, line: 837, baseType: !416, size: 64, offset: 64)
!1070 = !DIGlobalVariableExpression(var: !1071, expr: !DIExpression())
!1071 = distinct !DIGlobalVariable(name: "nslots", scope: !1012, file: !1013, line: 843, type: !426, isLocal: true, isDefinition: true)
!1072 = !DIGlobalVariableExpression(var: !1073, expr: !DIExpression())
!1073 = distinct !DIGlobalVariable(name: "slotvec0", scope: !1012, file: !1013, line: 844, type: !1066, isLocal: true, isDefinition: true)
!1074 = !DICompositeType(tag: DW_TAG_array_type, baseType: !533, size: 704, elements: !976)
!1075 = !DIGlobalVariableExpression(var: !1076, expr: !DIExpression())
!1076 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !1077, file: !1078, line: 26, type: !1080, isLocal: false, isDefinition: true)
!1077 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1078, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !548, globals: !1079, splitDebugInlining: false, nameTableKind: None)
!1078 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1079 = !{!1075}
!1080 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 376, elements: !1081)
!1081 = !{!1082}
!1082 = !DISubrange(count: 47)
!1083 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1084, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !548, retainedTypes: !1085, splitDebugInlining: false, nameTableKind: None)
!1084 = !DIFile(filename: "lib/fprintftime.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1085 = !{!1036, !433, !6, !426, !843, !419, !830, !844, !443, !457, !845, !846}
!1086 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1087, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !548, splitDebugInlining: false, nameTableKind: None)
!1087 = !DIFile(filename: "lib/gettime.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1088 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1089, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !548, retainedTypes: !1090, splitDebugInlining: false, nameTableKind: None)
!1089 = !DIFile(filename: "lib/imaxtostr.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1090 = !{!645}
!1091 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1092, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !548, retainedTypes: !1093, splitDebugInlining: false, nameTableKind: None)
!1092 = !DIFile(filename: "lib/posixtm.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1093 = !{!6}
!1094 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1095, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !548, splitDebugInlining: false, nameTableKind: None)
!1095 = !DIFile(filename: "lib/settime.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1096 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1097, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1098, retainedTypes: !1102, splitDebugInlining: false, nameTableKind: None)
!1097 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1098 = !{!1099}
!1099 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1097, line: 40, baseType: !6, size: 32, elements: !1100)
!1100 = !{!1101}
!1101 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!1102 = !{!418}
!1103 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1104, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1105, retainedTypes: !1119, splitDebugInlining: false, nameTableKind: None)
!1104 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1105 = !{!1106}
!1106 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1108, file: !1107, line: 186, baseType: !6, size: 32, elements: !1117)
!1107 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1108 = distinct !DISubprogram(name: "x2nrealloc", scope: !1107, file: !1107, line: 174, type: !1109, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1103, retainedNodes: !1112)
!1109 = !DISubroutineType(types: !1110)
!1110 = !{!418, !418, !1111, !1036}
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64)
!1112 = !{!1113, !1114, !1115, !1116}
!1113 = !DILocalVariable(name: "p", arg: 1, scope: !1108, file: !1107, line: 174, type: !418)
!1114 = !DILocalVariable(name: "pn", arg: 2, scope: !1108, file: !1107, line: 174, type: !1111)
!1115 = !DILocalVariable(name: "s", arg: 3, scope: !1108, file: !1107, line: 174, type: !1036)
!1116 = !DILocalVariable(name: "n", scope: !1108, file: !1107, line: 176, type: !1036)
!1117 = !{!1118}
!1118 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!1119 = !{!1036, !416, !418}
!1120 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1121, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !548, splitDebugInlining: false, nameTableKind: None)
!1121 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1122 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1123, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !548, retainedTypes: !1102, splitDebugInlining: false, nameTableKind: None)
!1123 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1124 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1125, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !548, splitDebugInlining: false, nameTableKind: None)
!1125 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1126 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1127, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !548, retainedTypes: !1102, splitDebugInlining: false, nameTableKind: None)
!1127 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1128 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1129, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !548, retainedTypes: !1102, splitDebugInlining: false, nameTableKind: None)
!1129 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1130 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1131, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !548, retainedTypes: !1132, splitDebugInlining: false, nameTableKind: None)
!1131 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1132 = !{!1036}
!1133 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1134, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1135, retainedTypes: !1139, globals: !1140, splitDebugInlining: false, nameTableKind: None)
!1134 = !DIFile(filename: "lib/time_rz.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1135 = !{!1136}
!1136 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1134, line: 50, baseType: !6, size: 32, elements: !1137)
!1137 = !{!1138}
!1138 = !DIEnumerator(name: "ABBR_SIZE_MIN", value: 119, isUnsigned: true)
!1139 = !{!416, !1036}
!1140 = !{!1141}
!1141 = !DIGlobalVariableExpression(var: !1142, expr: !DIExpression())
!1142 = distinct !DIGlobalVariable(name: "local_tz", scope: !1133, file: !1134, line: 55, type: !1143, isLocal: true, isDefinition: true)
!1143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1144)
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !495, line: 778, baseType: !1145)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64)
!1146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !1147, line: 21, size: 128, elements: !1148)
!1147 = !DIFile(filename: "./lib/time-internal.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1148 = !{!1149, !1150, !1151}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1146, file: !1147, line: 25, baseType: !1145, size: 64)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "tz_is_set", scope: !1146, file: !1147, line: 36, baseType: !417, size: 8, offset: 64)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "abbrs", scope: !1146, file: !1147, line: 48, baseType: !1152, offset: 72)
!1152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !417, elements: !1153)
!1153 = !{!1154}
!1154 = !DISubrange(count: -1)
!1155 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1156, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !548, splitDebugInlining: false, nameTableKind: None)
!1156 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1157 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1158, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !548, splitDebugInlining: false, nameTableKind: None)
!1158 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1159 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1160, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1161, retainedTypes: !1102, splitDebugInlining: false, nameTableKind: None)
!1160 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1161 = !{!13}
!1162 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1163, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !548, retainedTypes: !1164, splitDebugInlining: false, nameTableKind: None)
!1163 = !DIFile(filename: "lib/nstrftime.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1164 = !{!433, !6, !426, !843, !419, !830, !844, !443, !457, !845, !846, !1036, !418, !414}
!1165 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1166, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !548, retainedTypes: !1102, splitDebugInlining: false, nameTableKind: None)
!1166 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1167 = !{!"clang version 12.0.1"}
!1168 = !{i32 7, !"Dwarf Version", i32 4}
!1169 = !{i32 2, !"Debug Info Version", i32 3}
!1170 = !{i32 1, !"wchar_size", i32 4}
!1171 = !{i32 7, !"PIC Level", i32 2}
!1172 = !{i32 7, !"PIE Level", i32 2}
!1173 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 124, type: !1174, scopeLine: 125, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1176)
!1174 = !DISubroutineType(types: !1175)
!1175 = !{null, !426}
!1176 = !{!1177}
!1177 = !DILocalVariable(name: "status", arg: 1, scope: !1173, file: !3, line: 124, type: !426)
!1178 = !DILocation(line: 0, scope: !1173)
!1179 = !DILocation(line: 126, column: 14, scope: !1180)
!1180 = distinct !DILexicalBlock(scope: !1173, file: !3, line: 126, column: 7)
!1181 = !DILocation(line: 126, column: 7, scope: !1173)
!1182 = !DILocation(line: 127, column: 5, scope: !1183)
!1183 = distinct !DILexicalBlock(scope: !1180, file: !3, line: 127, column: 5)
!1184 = !{!1185, !1185, i64 0}
!1185 = !{!"any pointer", !1186, i64 0}
!1186 = !{!"omnipotent char", !1187, i64 0}
!1187 = !{!"Simple C/C++ TBAA"}
!1188 = !DILocation(line: 130, column: 7, scope: !1189)
!1189 = distinct !DILexicalBlock(scope: !1180, file: !3, line: 129, column: 5)
!1190 = !DILocation(line: 135, column: 7, scope: !1189)
!1191 = !DILocation(line: 590, column: 3, scope: !1192, inlinedAt: !1194)
!1192 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !1193, file: !1193, line: 588, type: !560, scopeLine: 589, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !548)
!1193 = !DIFile(filename: "src/system.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1194 = distinct !DILocation(line: 139, column: 7, scope: !1189)
!1195 = !DILocation(line: 141, column: 7, scope: !1189)
!1196 = !DILocation(line: 144, column: 7, scope: !1189)
!1197 = !DILocation(line: 148, column: 7, scope: !1189)
!1198 = !DILocation(line: 151, column: 7, scope: !1189)
!1199 = !DILocation(line: 158, column: 7, scope: !1189)
!1200 = !DILocation(line: 162, column: 7, scope: !1189)
!1201 = !DILocation(line: 168, column: 7, scope: !1189)
!1202 = !DILocation(line: 171, column: 7, scope: !1189)
!1203 = !DILocation(line: 175, column: 7, scope: !1189)
!1204 = !DILocation(line: 176, column: 7, scope: !1189)
!1205 = !DILocation(line: 177, column: 7, scope: !1189)
!1206 = !DILocation(line: 184, column: 7, scope: !1189)
!1207 = !DILocation(line: 190, column: 7, scope: !1189)
!1208 = !DILocation(line: 196, column: 7, scope: !1189)
!1209 = !DILocation(line: 201, column: 7, scope: !1189)
!1210 = !DILocation(line: 207, column: 7, scope: !1189)
!1211 = !DILocation(line: 213, column: 7, scope: !1189)
!1212 = !DILocation(line: 223, column: 7, scope: !1189)
!1213 = !DILocation(line: 229, column: 7, scope: !1189)
!1214 = !DILocation(line: 235, column: 7, scope: !1189)
!1215 = !DILocation(line: 241, column: 7, scope: !1189)
!1216 = !DILocation(line: 250, column: 7, scope: !1189)
!1217 = !DILocation(line: 260, column: 7, scope: !1189)
!1218 = !DILocation(line: 267, column: 7, scope: !1189)
!1219 = !DILocalVariable(name: "program", arg: 1, scope: !1220, file: !1193, line: 634, type: !433)
!1220 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !1193, file: !1193, line: 634, type: !1221, scopeLine: 635, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1223)
!1221 = !DISubroutineType(types: !1222)
!1222 = !{null, !433}
!1223 = !{!1219, !1224, !1232, !1233, !1235}
!1224 = !DILocalVariable(name: "infomap", scope: !1220, file: !1193, line: 636, type: !1225)
!1225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1226, size: 896, elements: !1231)
!1226 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1227)
!1227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !1220, file: !1193, line: 636, size: 128, elements: !1228)
!1228 = !{!1229, !1230}
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !1227, file: !1193, line: 636, baseType: !433, size: 64)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !1227, file: !1193, line: 636, baseType: !433, size: 64, offset: 64)
!1231 = !{!1002}
!1232 = !DILocalVariable(name: "node", scope: !1220, file: !1193, line: 646, type: !433)
!1233 = !DILocalVariable(name: "map_prog", scope: !1220, file: !1193, line: 647, type: !1234)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64)
!1235 = !DILocalVariable(name: "lc_messages", scope: !1220, file: !1193, line: 659, type: !433)
!1236 = !DILocation(line: 0, scope: !1220, inlinedAt: !1237)
!1237 = distinct !DILocation(line: 279, column: 7, scope: !1189)
!1238 = !DILocation(line: 636, column: 3, scope: !1220, inlinedAt: !1237)
!1239 = !DILocation(line: 636, column: 67, scope: !1220, inlinedAt: !1237)
!1240 = !DILocation(line: 647, column: 36, scope: !1220, inlinedAt: !1237)
!1241 = !DILocation(line: 649, column: 3, scope: !1220, inlinedAt: !1237)
!1242 = !DILocation(line: 649, column: 33, scope: !1220, inlinedAt: !1237)
!1243 = !DILocation(line: 650, column: 13, scope: !1220, inlinedAt: !1237)
!1244 = !DILocation(line: 649, column: 20, scope: !1220, inlinedAt: !1237)
!1245 = !{!1246, !1185, i64 0}
!1246 = !{!"infomap", !1185, i64 0, !1185, i64 8}
!1247 = !DILocation(line: 649, column: 10, scope: !1220, inlinedAt: !1237)
!1248 = !DILocation(line: 649, column: 28, scope: !1220, inlinedAt: !1237)
!1249 = distinct !{!1249, !1241, !1243, !1250}
!1250 = !{!"llvm.loop.mustprogress"}
!1251 = !DILocation(line: 652, column: 17, scope: !1252, inlinedAt: !1237)
!1252 = distinct !DILexicalBlock(scope: !1220, file: !1193, line: 652, column: 7)
!1253 = !{!1246, !1185, i64 8}
!1254 = !DILocation(line: 652, column: 7, scope: !1252, inlinedAt: !1237)
!1255 = !DILocation(line: 652, column: 7, scope: !1220, inlinedAt: !1237)
!1256 = !DILocation(line: 655, column: 3, scope: !1220, inlinedAt: !1237)
!1257 = !DILocation(line: 659, column: 29, scope: !1220, inlinedAt: !1237)
!1258 = !DILocation(line: 660, column: 7, scope: !1259, inlinedAt: !1237)
!1259 = distinct !DILexicalBlock(scope: !1220, file: !1193, line: 660, column: 7)
!1260 = !DILocation(line: 660, column: 19, scope: !1259, inlinedAt: !1237)
!1261 = !DILocation(line: 660, column: 22, scope: !1259, inlinedAt: !1237)
!1262 = !DILocation(line: 660, column: 7, scope: !1220, inlinedAt: !1237)
!1263 = !DILocation(line: 666, column: 7, scope: !1264, inlinedAt: !1237)
!1264 = distinct !DILexicalBlock(scope: !1259, file: !1193, line: 661, column: 5)
!1265 = !DILocation(line: 668, column: 5, scope: !1264, inlinedAt: !1237)
!1266 = !DILocation(line: 669, column: 3, scope: !1220, inlinedAt: !1237)
!1267 = !DILocation(line: 671, column: 3, scope: !1220, inlinedAt: !1237)
!1268 = !DILocation(line: 673, column: 1, scope: !1220, inlinedAt: !1237)
!1269 = !DILocation(line: 281, column: 3, scope: !1173)
!1270 = !DISubprogram(name: "dcgettext", scope: !1271, file: !1271, line: 51, type: !1272, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !548)
!1271 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!1272 = !DISubroutineType(types: !1273)
!1273 = !{!416, !433, !433, !426}
!1274 = !DISubprogram(name: "fputs_unlocked", scope: !1275, file: !1275, line: 667, type: !1276, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !548)
!1275 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!1276 = !DISubroutineType(types: !1277)
!1277 = !{!426, !433, !1278}
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64)
!1279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !1280, line: 49, size: 1728, elements: !1281)
!1280 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!1281 = !{!1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1305, !1308, !1310, !1313, !1316, !1317, !1318, !1319, !1320}
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1279, file: !1280, line: 51, baseType: !426, size: 32)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1279, file: !1280, line: 54, baseType: !416, size: 64, offset: 64)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1279, file: !1280, line: 55, baseType: !416, size: 64, offset: 128)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1279, file: !1280, line: 56, baseType: !416, size: 64, offset: 192)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1279, file: !1280, line: 57, baseType: !416, size: 64, offset: 256)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1279, file: !1280, line: 58, baseType: !416, size: 64, offset: 320)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1279, file: !1280, line: 59, baseType: !416, size: 64, offset: 384)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1279, file: !1280, line: 60, baseType: !416, size: 64, offset: 448)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1279, file: !1280, line: 61, baseType: !416, size: 64, offset: 512)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1279, file: !1280, line: 64, baseType: !416, size: 64, offset: 576)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1279, file: !1280, line: 65, baseType: !416, size: 64, offset: 640)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1279, file: !1280, line: 66, baseType: !416, size: 64, offset: 704)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1279, file: !1280, line: 68, baseType: !1295, size: 64, offset: 768)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64)
!1296 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !1280, line: 36, flags: DIFlagFwdDecl)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1279, file: !1280, line: 70, baseType: !1278, size: 64, offset: 832)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1279, file: !1280, line: 72, baseType: !426, size: 32, offset: 896)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1279, file: !1280, line: 73, baseType: !426, size: 32, offset: 928)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1279, file: !1280, line: 74, baseType: !471, size: 64, offset: 960)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1279, file: !1280, line: 77, baseType: !844, size: 16, offset: 1024)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1279, file: !1280, line: 78, baseType: !843, size: 8, offset: 1040)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1279, file: !1280, line: 79, baseType: !1304, size: 8, offset: 1048)
!1304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !417, size: 8, elements: !971)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1279, file: !1280, line: 81, baseType: !1306, size: 64, offset: 1088)
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64)
!1307 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !1280, line: 43, baseType: null)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1279, file: !1280, line: 89, baseType: !1309, size: 64, offset: 1152)
!1309 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !442, line: 153, baseType: !443)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1279, file: !1280, line: 91, baseType: !1311, size: 64, offset: 1216)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64)
!1312 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !1280, line: 37, flags: DIFlagFwdDecl)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1279, file: !1280, line: 92, baseType: !1314, size: 64, offset: 1280)
!1314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1315, size: 64)
!1315 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !1280, line: 38, flags: DIFlagFwdDecl)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1279, file: !1280, line: 93, baseType: !1278, size: 64, offset: 1344)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1279, file: !1280, line: 94, baseType: !418, size: 64, offset: 1408)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1279, file: !1280, line: 95, baseType: !1036, size: 64, offset: 1472)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1279, file: !1280, line: 96, baseType: !426, size: 32, offset: 1536)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1279, file: !1280, line: 98, baseType: !1321, size: 160, offset: 1568)
!1321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !417, size: 160, elements: !863)
!1322 = !DISubprogram(name: "setlocale", scope: !1323, file: !1323, line: 122, type: !1324, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !548)
!1323 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!1324 = !DISubroutineType(types: !1325)
!1325 = !{!416, !426, !433}
!1326 = !DILocation(line: 0, scope: !423)
!1327 = !DILocation(line: 353, column: 3, scope: !423)
!1328 = !DILocation(line: 353, column: 19, scope: !423)
!1329 = !DILocation(line: 358, column: 3, scope: !423)
!1330 = !DILocation(line: 358, column: 15, scope: !423)
!1331 = !DILocation(line: 363, column: 21, scope: !423)
!1332 = !DILocation(line: 363, column: 3, scope: !423)
!1333 = !DILocation(line: 364, column: 3, scope: !423)
!1334 = !DILocation(line: 365, column: 3, scope: !423)
!1335 = !DILocation(line: 366, column: 3, scope: !423)
!1336 = !DILocation(line: 368, column: 3, scope: !423)
!1337 = !DILocation(line: 370, column: 3, scope: !423)
!1338 = !DILocation(line: 370, column: 18, scope: !423)
!1339 = !DILocation(line: 378, column: 21, scope: !489)
!1340 = !DILocation(line: 379, column: 11, scope: !489)
!1341 = distinct !{!1341, !1337, !1342, !1250}
!1342 = !DILocation(line: 447, column: 5, scope: !423)
!1343 = !DILocation(line: 381, column: 32, scope: !489)
!1344 = !{!1345, !1345, i64 0}
!1345 = !{!"int", !1186, i64 0}
!1346 = !DILocation(line: 382, column: 11, scope: !489)
!1347 = !DILocation(line: 384, column: 24, scope: !489)
!1348 = !DILocation(line: 385, column: 11, scope: !489)
!1349 = !DILocation(line: 395, column: 15, scope: !488)
!1350 = !{!1186, !1186, i64 0}
!1351 = !DILocation(line: 0, scope: !488)
!1352 = !DILocation(line: 397, column: 26, scope: !488)
!1353 = !DILocation(line: 0, scope: !486)
!1354 = !DILocation(line: 411, column: 16, scope: !491)
!1355 = !DILocation(line: 412, column: 18, scope: !491)
!1356 = !DILocation(line: 0, scope: !491)
!1357 = !DILocation(line: 414, column: 26, scope: !491)
!1358 = !DILocation(line: 418, column: 23, scope: !489)
!1359 = !DILocation(line: 419, column: 11, scope: !489)
!1360 = !DILocation(line: 424, column: 25, scope: !489)
!1361 = !DILocation(line: 426, column: 11, scope: !489)
!1362 = !DILocation(line: 431, column: 15, scope: !1363)
!1363 = distinct !DILexicalBlock(scope: !489, file: !3, line: 431, column: 15)
!1364 = !DILocation(line: 431, column: 45, scope: !1363)
!1365 = !DILocation(line: 431, column: 15, scope: !489)
!1366 = !DILocation(line: 432, column: 13, scope: !1363)
!1367 = !DILocation(line: 435, column: 9, scope: !489)
!1368 = !DILocation(line: 436, column: 9, scope: !489)
!1369 = !DILocation(line: 438, column: 11, scope: !489)
!1370 = !DILocation(line: 443, column: 15, scope: !1371)
!1371 = distinct !DILexicalBlock(scope: !1372, file: !3, line: 443, column: 15)
!1372 = distinct !DILexicalBlock(scope: !1373, file: !3, line: 442, column: 9)
!1373 = distinct !DILexicalBlock(scope: !486, file: !3, line: 441, column: 11)
!1374 = !DILocation(line: 443, column: 15, scope: !1372)
!1375 = !DILocation(line: 444, column: 13, scope: !1371)
!1376 = !DILocation(line: 449, column: 29, scope: !423)
!1377 = !DILocation(line: 450, column: 31, scope: !423)
!1378 = !DILocation(line: 451, column: 31, scope: !423)
!1379 = !DILocation(line: 450, column: 28, scope: !423)
!1380 = !DILocation(line: 451, column: 28, scope: !423)
!1381 = !DILocation(line: 453, column: 29, scope: !1382)
!1382 = distinct !DILexicalBlock(scope: !423, file: !3, line: 453, column: 7)
!1383 = !DILocation(line: 453, column: 7, scope: !423)
!1384 = !DILocation(line: 456, column: 9, scope: !1385)
!1385 = distinct !DILexicalBlock(scope: !1382, file: !3, line: 454, column: 5)
!1386 = !DILocation(line: 455, column: 7, scope: !1385)
!1387 = !DILocation(line: 457, column: 7, scope: !1385)
!1388 = !DILocation(line: 460, column: 7, scope: !1389)
!1389 = distinct !DILexicalBlock(scope: !423, file: !3, line: 460, column: 7)
!1390 = !DILocation(line: 460, column: 16, scope: !1389)
!1391 = !DILocation(line: 463, column: 11, scope: !1392)
!1392 = distinct !DILexicalBlock(scope: !1389, file: !3, line: 461, column: 5)
!1393 = !DILocation(line: 462, column: 7, scope: !1392)
!1394 = !DILocation(line: 464, column: 7, scope: !1392)
!1395 = !DILocation(line: 467, column: 7, scope: !1396)
!1396 = distinct !DILexicalBlock(scope: !423, file: !3, line: 467, column: 7)
!1397 = !DILocation(line: 467, column: 14, scope: !1396)
!1398 = !DILocation(line: 467, column: 7, scope: !423)
!1399 = !DILocation(line: 469, column: 18, scope: !1400)
!1400 = distinct !DILexicalBlock(scope: !1401, file: !3, line: 469, column: 11)
!1401 = distinct !DILexicalBlock(scope: !1396, file: !3, line: 468, column: 5)
!1402 = !DILocation(line: 469, column: 22, scope: !1400)
!1403 = !DILocation(line: 469, column: 11, scope: !1401)
!1404 = !DILocation(line: 471, column: 24, scope: !1405)
!1405 = distinct !DILexicalBlock(scope: !1400, file: !3, line: 470, column: 9)
!1406 = !DILocation(line: 471, column: 59, scope: !1405)
!1407 = !DILocation(line: 471, column: 66, scope: !1405)
!1408 = !DILocation(line: 471, column: 54, scope: !1405)
!1409 = !DILocation(line: 471, column: 47, scope: !1405)
!1410 = !DILocation(line: 471, column: 11, scope: !1405)
!1411 = !DILocation(line: 472, column: 11, scope: !1405)
!1412 = !DILocation(line: 475, column: 11, scope: !1413)
!1413 = distinct !DILexicalBlock(scope: !1401, file: !3, line: 475, column: 11)
!1414 = !DILocation(line: 475, column: 27, scope: !1413)
!1415 = !DILocation(line: 475, column: 11, scope: !1401)
!1416 = !DILocation(line: 477, column: 15, scope: !1417)
!1417 = distinct !DILexicalBlock(scope: !1418, file: !3, line: 477, column: 15)
!1418 = distinct !DILexicalBlock(scope: !1413, file: !3, line: 476, column: 9)
!1419 = !DILocation(line: 477, column: 15, scope: !1418)
!1420 = !DILocation(line: 478, column: 13, scope: !1417)
!1421 = !DILocation(line: 479, column: 31, scope: !1418)
!1422 = !DILocation(line: 479, column: 35, scope: !1418)
!1423 = !DILocation(line: 492, column: 7, scope: !423)
!1424 = !DILocation(line: 481, column: 25, scope: !1425)
!1425 = distinct !DILexicalBlock(scope: !1413, file: !3, line: 481, column: 16)
!1426 = !DILocation(line: 484, column: 18, scope: !1427)
!1427 = distinct !DILexicalBlock(scope: !1425, file: !3, line: 482, column: 9)
!1428 = !DILocation(line: 487, column: 30, scope: !1427)
!1429 = !DILocation(line: 487, column: 25, scope: !1427)
!1430 = !DILocation(line: 487, column: 18, scope: !1427)
!1431 = !DILocation(line: 483, column: 11, scope: !1427)
!1432 = !DILocation(line: 488, column: 11, scope: !1427)
!1433 = !DILocation(line: 492, column: 8, scope: !1434)
!1434 = distinct !DILexicalBlock(scope: !423, file: !3, line: 492, column: 7)
!1435 = !DILocation(line: 494, column: 16, scope: !1436)
!1436 = distinct !DILexicalBlock(scope: !1434, file: !3, line: 493, column: 5)
!1437 = !DILocation(line: 495, column: 13, scope: !1438)
!1438 = distinct !DILexicalBlock(scope: !1436, file: !3, line: 495, column: 11)
!1439 = !DILocation(line: 495, column: 11, scope: !1436)
!1440 = !DILocation(line: 506, column: 5, scope: !1436)
!1441 = !DILocation(line: 508, column: 26, scope: !423)
!1442 = !DILocation(line: 509, column: 19, scope: !423)
!1443 = !DILocation(line: 511, column: 7, scope: !423)
!1444 = !DILocalVariable(name: "input_filename", arg: 1, scope: !1445, file: !3, line: 290, type: !433)
!1445 = distinct !DISubprogram(name: "batch_convert", scope: !3, file: !3, line: 290, type: !1446, scopeLine: 292, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1448)
!1446 = !DISubroutineType(types: !1447)
!1447 = !{!447, !433, !433, !494, !433}
!1448 = !{!1444, !1449, !1450, !1451, !1452, !1453, !1457, !1458, !1459, !1460}
!1449 = !DILocalVariable(name: "format", arg: 2, scope: !1445, file: !3, line: 290, type: !433)
!1450 = !DILocalVariable(name: "tz", arg: 3, scope: !1445, file: !3, line: 291, type: !494)
!1451 = !DILocalVariable(name: "tzstring", arg: 4, scope: !1445, file: !3, line: 291, type: !433)
!1452 = !DILocalVariable(name: "ok", scope: !1445, file: !3, line: 293, type: !447)
!1453 = !DILocalVariable(name: "in_stream", scope: !1445, file: !3, line: 294, type: !1454)
!1454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1455, size: 64)
!1455 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !1456, line: 7, baseType: !1279)
!1456 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "")
!1457 = !DILocalVariable(name: "line", scope: !1445, file: !3, line: 295, type: !416)
!1458 = !DILocalVariable(name: "buflen", scope: !1445, file: !3, line: 296, type: !1036)
!1459 = !DILocalVariable(name: "when", scope: !1445, file: !3, line: 297, type: !437)
!1460 = !DILocalVariable(name: "line_length", scope: !1461, file: !3, line: 318, type: !1462)
!1461 = distinct !DILexicalBlock(scope: !1445, file: !3, line: 317, column: 5)
!1462 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !1275, line: 77, baseType: !1463)
!1463 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !442, line: 194, baseType: !443)
!1464 = !DILocation(line: 0, scope: !1445, inlinedAt: !1465)
!1465 = distinct !DILocation(line: 512, column: 10, scope: !500)
!1466 = !DILocation(line: 295, column: 3, scope: !1445, inlinedAt: !1465)
!1467 = !DILocation(line: 296, column: 3, scope: !1445, inlinedAt: !1465)
!1468 = !DILocation(line: 297, column: 3, scope: !1445, inlinedAt: !1465)
!1469 = !DILocation(line: 297, column: 19, scope: !1445, inlinedAt: !1465)
!1470 = !DILocation(line: 299, column: 7, scope: !1471, inlinedAt: !1465)
!1471 = distinct !DILexicalBlock(scope: !1445, file: !3, line: 299, column: 7)
!1472 = !DILocation(line: 299, column: 7, scope: !1445, inlinedAt: !1465)
!1473 = !DILocation(line: 301, column: 24, scope: !1474, inlinedAt: !1465)
!1474 = distinct !DILexicalBlock(scope: !1471, file: !3, line: 300, column: 5)
!1475 = !DILocation(line: 302, column: 19, scope: !1474, inlinedAt: !1465)
!1476 = !DILocation(line: 303, column: 5, scope: !1474, inlinedAt: !1465)
!1477 = !DILocation(line: 306, column: 19, scope: !1478, inlinedAt: !1465)
!1478 = distinct !DILexicalBlock(scope: !1471, file: !3, line: 305, column: 5)
!1479 = !DILocation(line: 307, column: 21, scope: !1480, inlinedAt: !1465)
!1480 = distinct !DILexicalBlock(scope: !1478, file: !3, line: 307, column: 11)
!1481 = !DILocation(line: 307, column: 11, scope: !1478, inlinedAt: !1465)
!1482 = !DILocation(line: 309, column: 11, scope: !1483, inlinedAt: !1465)
