source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon.19 }
%struct.__sigset_t = type { [16 x i64] }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.infomap = type { i8*, i8* }
%struct.lconv = type { i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.mtget = type { i64, i64, i64, i64, i64, i32, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.sigaction = type { %union.anon, %struct.__sigset_t, i32, void ()* }
%struct.slotvec = type { i64, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.symbol_value = type { [12 x i8], i32 }
%struct.timespec = type { i64, i64 }
%union.anon = type { void (i32)* }
%union.anon.19 = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8

!44 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2, isUnsigned: true)
!45 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3, isUnsigned: true)
!46 = !DIEnumerator(name: "LONGINT_INVALID", value: 4, isUnsigned: true)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 308, baseType: !48, size: 32, elements: !49)
!48 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!49 = !{!50, !51, !52, !53, !54, !55, !56, !57, !58, !59}
!50 = !DIEnumerator(name: "v", value: -1531137)
!51 = !DIEnumerator(name: "O_FULLBLOCK", value: 1)
!52 = !DIEnumerator(name: "v2", value: -1531138)
!53 = !DIEnumerator(name: "O_NOCACHE", value: 2)
!54 = !DIEnumerator(name: "v3", value: -1531140)
!55 = !DIEnumerator(name: "O_COUNT_BYTES", value: 4)
!56 = !DIEnumerator(name: "v4", value: -1531144)
!57 = !DIEnumerator(name: "O_SKIP_BYTES", value: 8)
!58 = !DIEnumerator(name: "v5", value: -1531152)
!59 = !DIEnumerator(name: "O_SEEK_BYTES", value: 16)
!60 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 136, baseType: !7, size: 32, elements: !61)
!61 = !{!62, !63, !64, !65}
!62 = !DIEnumerator(name: "STATUS_NONE", value: 1, isUnsigned: true)
!63 = !DIEnumerator(name: "STATUS_NOXFER", value: 2, isUnsigned: true)
!64 = !DIEnumerator(name: "STATUS_DEFAULT", value: 3, isUnsigned: true)
!65 = !DIEnumerator(name: "STATUS_PROGRESS", value: 4, isUnsigned: true)
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 685, baseType: !7, size: 32, elements: !67)
!67 = !{!68}
!68 = !DIEnumerator(name: "human_opts", value: 465, isUnsigned: true)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !70, line: 43, baseType: !7, size: 32, elements: !71)
!70 = !DIFile(filename: "./lib/human.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!71 = !{!72, !73, !74, !75, !76, !77, !78, !79, !80, !81}
!72 = !DIEnumerator(name: "human_ceiling", value: 0, isUnsigned: true)
!73 = !DIEnumerator(name: "human_round_to_nearest", value: 1, isUnsigned: true)
!74 = !DIEnumerator(name: "human_floor", value: 2, isUnsigned: true)
!75 = !DIEnumerator(name: "human_group_digits", value: 4, isUnsigned: true)
!76 = !DIEnumerator(name: "human_suppress_point_zero", value: 8, isUnsigned: true)
!77 = !DIEnumerator(name: "human_autoscale", value: 16, isUnsigned: true)
!78 = !DIEnumerator(name: "human_base_1024", value: 32, isUnsigned: true)
!79 = !DIEnumerator(name: "human_space_before_unit", value: 64, isUnsigned: true)
!80 = !DIEnumerator(name: "human_SI", value: 128, isUnsigned: true)
!81 = !DIEnumerator(name: "human_B", value: 256, isUnsigned: true)
!82 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !84, file: !83, line: 187, baseType: !7, size: 32, elements: !94)
!83 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!84 = distinct !DISubprogram(name: "select_plural", scope: !83, file: !83, line: 183, type: !85, scopeLine: 184, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !92)
!85 = !DISubroutineType(types: !86)
!86 = !{!87, !88}
!87 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !89, line: 102, baseType: !90)
!89 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !91, line: 73, baseType: !87)
!91 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!92 = !{!93}
!93 = !DILocalVariable(name: "n", arg: 1, scope: !84, file: !83, line: 183, type: !88)
!94 = !{!95}
!95 = !DIEnumerator(name: "PLURAL_REDUCER", value: 1000000, isUnsigned: true)
!96 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !97, line: 73, baseType: !7, size: 32, elements: !98)
!97 = !DIFile(filename: "src/ioblksize.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!98 = !{!99}
!99 = !DIEnumerator(name: "IO_BUFSIZE", value: 131072, isUnsigned: true)
!100 = !{!101, !110, !169, !173, !177, !180, !183, !190, !107, !160, !194, !203, !206, !209, !211, !216, !219, !220, !232, !235, !247, !334, !339, !341, !88, !345, !349, !352, !356, !359, !362, !365, !368, !369, !370, !48, !373, !377, !381, !392, !395, !397, !401, !162, !406, !407, !408}
!101 = !DISubprogram(name: "dcgettext", scope: !102, file: !102, line: 51, type: !103, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!102 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!103 = !DISubroutineType(types: !104)
!104 = !{!105, !107, !107, !48}
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !106)
!109 = !{}
!110 = !DISubprogram(name: "fputs_unlocked", scope: !111, file: !111, line: 662, type: !112, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!111 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!112 = !DISubroutineType(types: !113)
!113 = !{!48, !107, !114}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !116, line: 49, size: 1728, elements: !117)
!116 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!117 = !{!118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !133, !134, !135, !136, !139, !141, !143, !147, !150, !152, !155, !158, !159, !161, !164, !165}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !115, file: !116, line: 51, baseType: !48, size: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !115, file: !116, line: 54, baseType: !105, size: 64, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !115, file: !116, line: 55, baseType: !105, size: 64, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !115, file: !116, line: 56, baseType: !105, size: 64, offset: 192)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !115, file: !116, line: 57, baseType: !105, size: 64, offset: 256)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !115, file: !116, line: 58, baseType: !105, size: 64, offset: 320)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !115, file: !116, line: 59, baseType: !105, size: 64, offset: 384)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !115, file: !116, line: 60, baseType: !105, size: 64, offset: 448)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !115, file: !116, line: 61, baseType: !105, size: 64, offset: 512)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !115, file: !116, line: 64, baseType: !105, size: 64, offset: 576)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !115, file: !116, line: 65, baseType: !105, size: 64, offset: 640)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !115, file: !116, line: 66, baseType: !105, size: 64, offset: 704)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !115, file: !116, line: 68, baseType: !131, size: 64, offset: 768)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !116, line: 36, flags: DIFlagFwdDecl)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !115, file: !116, line: 70, baseType: !114, size: 64, offset: 832)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !115, file: !116, line: 72, baseType: !48, size: 32, offset: 896)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !115, file: !116, line: 73, baseType: !48, size: 32, offset: 928)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !115, file: !116, line: 74, baseType: !137, size: 64, offset: 960)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !91, line: 152, baseType: !138)
!138 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !115, file: !116, line: 77, baseType: !140, size: 16, offset: 1024)
!140 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !115, file: !116, line: 78, baseType: !142, size: 8, offset: 1040)
!142 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !115, file: !116, line: 79, baseType: !144, size: 8, offset: 1048)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 8, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 1)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !115, file: !116, line: 81, baseType: !148, size: 64, offset: 1088)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !116, line: 43, baseType: null)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !115, file: !116, line: 89, baseType: !151, size: 64, offset: 1152)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !91, line: 153, baseType: !138)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !115, file: !116, line: 91, baseType: !153, size: 64, offset: 1216)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !116, line: 37, flags: DIFlagFwdDecl)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !115, file: !116, line: 92, baseType: !156, size: 64, offset: 1280)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !116, line: 38, flags: DIFlagFwdDecl)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !115, file: !116, line: 93, baseType: !114, size: 64, offset: 1344)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !115, file: !116, line: 94, baseType: !160, size: 64, offset: 1408)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !115, file: !116, line: 95, baseType: !162, size: 64, offset: 1472)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !163, line: 46, baseType: !87)
!163 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !115, file: !116, line: 96, baseType: !48, size: 32, offset: 1536)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !115, file: !116, line: 98, baseType: !166, size: 160, offset: 1568)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 160, elements: !167)
!167 = !{!168}
!168 = !DISubrange(count: 20)
!169 = !DISubprogram(name: "set_program_name", scope: !170, file: !170, line: 37, type: !171, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!170 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!171 = !DISubroutineType(types: !172)
!172 = !{null, !107}
!173 = !DISubprogram(name: "setlocale", scope: !174, file: !174, line: 122, type: !175, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!174 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!175 = !DISubroutineType(types: !176)
!176 = !{!105, !48, !107}
!177 = !DISubprogram(name: "bindtextdomain", scope: !102, file: !102, line: 86, type: !178, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!178 = !DISubroutineType(types: !179)
!179 = !{!105, !107, !107}
!180 = !DISubprogram(name: "textdomain", scope: !102, file: !102, line: 82, type: !181, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!181 = !DISubroutineType(types: !182)
!182 = !{!105, !107}
!183 = !DISubprogram(name: "atexit", scope: !184, file: !184, line: 595, type: !185, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!184 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!185 = !DISubroutineType(types: !186)
!186 = !{!48, !187}
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{null}
!190 = !DISubprogram(name: "getpagesize", scope: !191, file: !191, line: 976, type: !192, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!191 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!192 = !DISubroutineType(types: !193)
!193 = !{!48}
!194 = !DISubprogram(name: "parse_gnu_standard_options_only", scope: !195, file: !195, line: 33, type: !196, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!195 = !DIFile(filename: "./lib/long-options.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!196 = !DISubroutineType(types: !197)
!197 = !{null, !48, !198, !107, !107, !107, !199, !200, null}
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!199 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{null, !48}
!203 = !DISubprogram(name: "quotearg_style", scope: !6, file: !6, line: 377, type: !204, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!204 = !DISubroutineType(types: !205)
!205 = !{!105, !5, !107}
!206 = !DISubprogram(name: "lseek", scope: !191, file: !191, line: 334, type: !207, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!207 = !DISubroutineType(types: !208)
!208 = !{!138, !48, !138, !48}
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !210, line: 85, baseType: !137)
!210 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!211 = !DISubprogram(name: "gethrxtime", scope: !212, file: !212, line: 46, type: !213, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!212 = !DIFile(filename: "./lib/gethrxtime.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!213 = !DISubroutineType(types: !214)
!214 = !{!215}
!215 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!216 = !DISubprogram(name: "quotearg_n_style_colon", scope: !6, file: !6, line: 397, type: !217, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!217 = !DISubroutineType(types: !218)
!218 = !{!105, !48, !5, !107}
!219 = !DISubprogram(name: "getenv", scope: !184, file: !184, line: 634, type: !181, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!220 = !DISubprogram(name: "sigemptyset", scope: !221, file: !221, line: 196, type: !222, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!221 = !DIFile(filename: "/usr/include/signal.h", directory: "")
!222 = !DISubroutineType(types: !223)
!223 = !{!48, !224}
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !226, line: 5, size: 1024, elements: !227)
!226 = !DIFile(filename: "/usr/include/bits/types/__sigset_t.h", directory: "")
!227 = !{!228}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !225, file: !226, line: 7, baseType: !229, size: 1024)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 1024, elements: !230)
!230 = !{!231}
!231 = !DISubrange(count: 16)
!232 = !DISubprogram(name: "sigaddset", scope: !221, file: !221, line: 202, type: !233, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!233 = !DISubroutineType(types: !234)
!234 = !{!48, !224, !48}
!235 = !DISubprogram(name: "sigaction", scope: !221, file: !221, line: 240, type: !236, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!236 = !DISubroutineType(types: !237)
!237 = !{!48, !48, !238, !333}
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !240)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !241, line: 27, size: 1216, elements: !242)
!241 = !DIFile(filename: "/usr/include/bits/sigaction.h", directory: "")
!242 = !{!243, !329, !331, !332}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !240, file: !241, line: 38, baseType: !244, size: 64)
!244 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !240, file: !241, line: 31, size: 64, elements: !245)
!245 = !{!246, !248}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !244, file: !241, line: 34, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !221, line: 72, baseType: !200)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !244, file: !241, line: 36, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{null, !48, !252, !160}
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !254, line: 124, baseType: !255)
!254 = !DIFile(filename: "/usr/include/bits/types/siginfo_t.h", directory: "")
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !254, line: 36, size: 1024, elements: !256)
!256 = !{!257, !258, !259, !260, !261}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !255, file: !254, line: 38, baseType: !48, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !255, file: !254, line: 40, baseType: !48, size: 32, offset: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !255, file: !254, line: 42, baseType: !48, size: 32, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !255, file: !254, line: 48, baseType: !48, size: 32, offset: 96)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !255, file: !254, line: 123, baseType: !262, size: 896, offset: 128)
!262 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !255, file: !254, line: 51, size: 896, elements: !263)
!263 = !{!264, !268, !275, !287, !293, !302, !318, !323}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !262, file: !254, line: 53, baseType: !265, size: 896)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 896, elements: !266)
!266 = !{!267}
!267 = !DISubrange(count: 28)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !262, file: !254, line: 60, baseType: !269, size: 64)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !262, file: !254, line: 56, size: 64, elements: !270)
!270 = !{!271, !273}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !269, file: !254, line: 58, baseType: !272, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !91, line: 154, baseType: !48)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !269, file: !254, line: 59, baseType: !274, size: 32, offset: 32)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !91, line: 146, baseType: !7)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !262, file: !254, line: 68, baseType: !276, size: 128)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !262, file: !254, line: 63, size: 128, elements: !277)
!277 = !{!278, !279, !280}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !276, file: !254, line: 65, baseType: !48, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !276, file: !254, line: 66, baseType: !48, size: 32, offset: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !276, file: !254, line: 67, baseType: !281, size: 64, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigval_t", file: !282, line: 30, baseType: !283)
!282 = !DIFile(filename: "/usr/include/bits/types/__sigval_t.h", directory: "")
!283 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !282, line: 24, size: 64, elements: !284)
!284 = !{!285, !286}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !283, file: !282, line: 26, baseType: !48, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !283, file: !282, line: 27, baseType: !160, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !262, file: !254, line: 76, baseType: !288, size: 128)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !262, file: !254, line: 71, size: 128, elements: !289)
!289 = !{!290, !291, !292}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !288, file: !254, line: 73, baseType: !272, size: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !288, file: !254, line: 74, baseType: !274, size: 32, offset: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !288, file: !254, line: 75, baseType: !281, size: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !262, file: !254, line: 86, baseType: !294, size: 256)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !262, file: !254, line: 79, size: 256, elements: !295)
!295 = !{!296, !297, !298, !299, !301}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !294, file: !254, line: 81, baseType: !272, size: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !294, file: !254, line: 82, baseType: !274, size: 32, offset: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !294, file: !254, line: 83, baseType: !48, size: 32, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !294, file: !254, line: 84, baseType: !300, size: 64, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !91, line: 156, baseType: !138)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !294, file: !254, line: 85, baseType: !300, size: 64, offset: 192)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !262, file: !254, line: 105, baseType: !303, size: 256)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !262, file: !254, line: 89, size: 256, elements: !304)
!304 = !{!305, !306, !308}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !303, file: !254, line: 91, baseType: !160, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_lsb", scope: !303, file: !254, line: 93, baseType: !307, size: 16, offset: 64)
!307 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_bounds", scope: !303, file: !254, line: 104, baseType: !309, size: 128, offset: 128)
!309 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !303, file: !254, line: 94, size: 128, elements: !310)
!310 = !{!311, !316}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_bnd", scope: !309, file: !254, line: 101, baseType: !312, size: 128)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !309, file: !254, line: 97, size: 128, elements: !313)
!313 = !{!314, !315}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_lower", scope: !312, file: !254, line: 99, baseType: !160, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_upper", scope: !312, file: !254, line: 100, baseType: !160, size: 64, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_pkey", scope: !309, file: !254, line: 103, baseType: !317, size: 32)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !91, line: 42, baseType: !7)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !262, file: !254, line: 112, baseType: !319, size: 128)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !262, file: !254, line: 108, size: 128, elements: !320)
!320 = !{!321, !322}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !319, file: !254, line: 110, baseType: !138, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "si_fd", scope: !319, file: !254, line: 111, baseType: !48, size: 32, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !262, file: !254, line: 121, baseType: !324, size: 128)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !262, file: !254, line: 116, size: 128, elements: !325)
!325 = !{!326, !327, !328}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !324, file: !254, line: 118, baseType: !160, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !324, file: !254, line: 119, baseType: !48, size: 32, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !324, file: !254, line: 120, baseType: !7, size: 32, offset: 96)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !240, file: !241, line: 46, baseType: !330, size: 1024, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !226, line: 8, baseType: !225)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !240, file: !241, line: 49, baseType: !48, size: 32, offset: 1088)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !240, file: !241, line: 52, baseType: !187, size: 64, offset: 1152)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!334 = !DISubprogram(name: "sigismember", scope: !221, file: !221, line: 208, type: !335, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!335 = !DISubroutineType(types: !336)
!336 = !{!48, !337, !48}
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !225)
!339 = !DISubprogram(name: "close_stdout", scope: !340, file: !340, line: 30, type: !188, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!340 = !DIFile(filename: "./lib/closeout.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!341 = !DISubprogram(name: "close_stream", scope: !342, file: !342, line: 2, type: !343, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!342 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!343 = !DISubroutineType(types: !344)
!344 = !{!48, !114}
!345 = !DISubprogram(name: "quote", scope: !346, file: !346, line: 44, type: !347, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!346 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!347 = !DISubroutineType(types: !348)
!348 = !{!107, !107}
!349 = !DISubprogram(name: "quotearg_n_style_mem", scope: !6, file: !6, line: 373, type: !350, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!350 = !DISubroutineType(types: !351)
!351 = !{!105, !48, !5, !107, !87}
!352 = !DISubprogram(name: "xstrtoumax", scope: !40, file: !40, line: 48, type: !353, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!353 = !DISubroutineType(types: !354)
!354 = !{!39, !107, !198, !48, !355, !107}
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!356 = !DISubprogram(name: "quote_n", scope: !346, file: !346, line: 40, type: !357, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!357 = !DISubroutineType(types: !358)
!358 = !{!107, !48, !107}
!359 = !DISubprogram(name: "dcngettext", scope: !102, file: !102, line: 73, type: !360, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!360 = !DISubroutineType(types: !361)
!361 = !{!105, !107, !107, !107, !87, !48}
!362 = !DISubprogram(name: "sigprocmask", scope: !221, file: !221, line: 229, type: !363, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!363 = !DISubroutineType(types: !364)
!364 = !{!48, !48, !337, !224}
!365 = !DISubprogram(name: "raise", scope: !221, file: !221, line: 123, type: !366, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!366 = !DISubroutineType(types: !367)
!367 = !{!48, !48}
!368 = !DISubprogram(name: "close", scope: !191, file: !191, line: 353, type: !366, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!369 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!370 = !DISubprogram(name: "human_readable", scope: !70, file: !70, line: 79, type: !371, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!371 = !DISubroutineType(types: !372)
!372 = !{!105, !87, !105, !48, !87, !87}
!373 = !DISubprogram(name: "rpl_fcntl", scope: !374, file: !374, line: 588, type: !375, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!374 = !DIFile(filename: "./lib/fcntl.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!375 = !DISubroutineType(types: !376)
!376 = !{!48, !48, !48, null}
!377 = !DISubprogram(name: "fd_reopen", scope: !378, file: !378, line: 22, type: !379, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!378 = !DIFile(filename: "./lib/fd-reopen.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!379 = !DISubroutineType(types: !380)
!380 = !{!48, !48, !107, !48, !7}
!381 = !DISubprogram(name: "verror", scope: !382, file: !382, line: 34, type: !383, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!382 = !DIFile(filename: "./lib/verror.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!383 = !DISubroutineType(types: !384)
!384 = !{null, !48, !48, !107, !385}
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 543, size: 192, elements: !387)
!387 = !{!388, !389, !390, !391}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !386, file: !3, line: 543, baseType: !7, size: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !386, file: !3, line: 543, baseType: !7, size: 32, offset: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !386, file: !3, line: 543, baseType: !160, size: 64, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !386, file: !3, line: 543, baseType: !160, size: 64, offset: 128)
!392 = !DISubprogram(name: "ftruncate", scope: !191, file: !191, line: 1014, type: !393, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!393 = !DISubroutineType(types: !394)
!394 = !{!48, !48, !138}
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !89, line: 101, baseType: !396)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !91, line: 72, baseType: !138)
!397 = !DISubprogram(name: "ioctl", scope: !398, file: !398, line: 41, type: !399, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!398 = !DIFile(filename: "/usr/include/sys/ioctl.h", directory: "")
!399 = !DISubroutineType(types: !400)
!400 = !{!48, !48, !87, null}
!401 = !DISubprogram(name: "write", scope: !191, file: !191, line: 366, type: !402, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!402 = !DISubroutineType(types: !403)
!403 = !{!138, !48, !404, !87}
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!406 = !DISubprogram(name: "fdatasync", scope: !191, file: !191, line: 1115, type: !366, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!407 = !DISubprogram(name: "fsync", scope: !191, file: !191, line: 954, type: !366, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!408 = !DISubprogram(name: "posix_fadvise", scope: !409, file: !409, line: 288, type: !410, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!409 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
!410 = !DISubroutineType(types: !411)
!411 = !{!48, !48, !138, !138, !48}
!412 = !{!413, !415, !419, !421, !423, !425, !427, !429, !431, !433, !435, !0, !440, !446, !448, !450, !463, !468, !473, !475, !477, !479, !481, !483, !485, !502, !504, !506, !508, !510, !512, !514, !545, !547, !550, !553, !555, !557, !559, !561, !563, !565, !567, !569, !571, !573, !575, !577, !579, !581, !583, !585, !598, !600, !602, !604, !606, !608, !610, !612, !625, !638}
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "page_size", scope: !2, file: !3, line: 151, type: !162, isLocal: true, isDefinition: true)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(name: "start_time", scope: !2, file: !3, line: 214, type: !417, isLocal: true, isDefinition: true)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "xtime_t", file: !418, line: 33, baseType: !215)
!418 = !DIFile(filename: "./lib/xtime.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(name: "next_time", scope: !2, file: !3, line: 217, type: !417, isLocal: true, isDefinition: true)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(name: "input_seekable", scope: !2, file: !3, line: 223, type: !199, isLocal: true, isDefinition: true)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(name: "input_seek_errno", scope: !2, file: !3, line: 227, type: !48, isLocal: true, isDefinition: true)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(name: "input_offset", scope: !2, file: !3, line: 231, type: !88, isLocal: true, isDefinition: true)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(name: "i_nocache", scope: !2, file: !3, line: 267, type: !199, isLocal: true, isDefinition: true)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(name: "o_nocache", scope: !2, file: !3, line: 267, type: !199, isLocal: true, isDefinition: true)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(name: "i_nocache_eof", scope: !2, file: !3, line: 270, type: !199, isLocal: true, isDefinition: true)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(name: "o_nocache_eof", scope: !2, file: !3, line: 270, type: !199, isLocal: true, isDefinition: true)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(name: "trans_table", scope: !2, file: !3, line: 394, type: !437, isLocal: true, isDefinition: true)
!437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !369, size: 2048, elements: !438)
!438 = !{!439}
!439 = !DISubrange(count: 256)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(name: "info_signal_count", scope: !2, file: !3, line: 264, type: !442, isLocal: true, isDefinition: true)
!442 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !443)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "sig_atomic_t", file: !444, line: 8, baseType: !445)
!444 = !DIFile(filename: "/usr/include/bits/types/sig_atomic_t.h", directory: "")
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sig_atomic_t", file: !91, line: 214, baseType: !48)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "interrupt_signal", scope: !2, file: !3, line: 261, type: !442, isLocal: true, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "close_stdout_required", scope: !2, file: !3, line: 510, type: !199, isLocal: true, isDefinition: true)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(name: "conversions", scope: !2, file: !3, line: 286, type: !452, isLocal: true, isDefinition: true)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !453, size: 2176, elements: !461)
!453 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !454)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "symbol_value", file: !3, line: 279, size: 128, elements: !455)
!455 = !{!456, !460}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "symbol", scope: !454, file: !3, line: 281, baseType: !457, size: 96)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 96, elements: !458)
!458 = !{!459}
!459 = !DISubrange(count: 12)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !454, file: !3, line: 282, baseType: !48, size: 32, offset: 96)
!461 = !{!462}
!462 = !DISubrange(count: 17)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(name: "flags", scope: !2, file: !3, line: 361, type: !465, isLocal: true, isDefinition: true)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !453, size: 2432, elements: !466)
!466 = !{!467}
!467 = !DISubrange(count: 19)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(name: "statuses", scope: !2, file: !3, line: 385, type: !470, isLocal: true, isDefinition: true)
!470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !453, size: 512, elements: !471)
!471 = !{!472}
!472 = !DISubrange(count: 4)
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(name: "status_level", scope: !2, file: !3, line: 193, type: !48, isLocal: true, isDefinition: true)
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(name: "input_blocksize", scope: !2, file: !3, line: 154, type: !162, isLocal: true, isDefinition: true)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(name: "conversion_blocksize", scope: !2, file: !3, line: 160, type: !162, isLocal: true, isDefinition: true)
!479 = !DIGlobalVariableExpression(var: !480, expr: !DIExpression())
!480 = distinct !DIGlobalVariable(name: "skip_records", scope: !2, file: !3, line: 163, type: !88, isLocal: true, isDefinition: true)
!481 = !DIGlobalVariableExpression(var: !482, expr: !DIExpression())
!482 = distinct !DIGlobalVariable(name: "skip_bytes", scope: !2, file: !3, line: 167, type: !162, isLocal: true, isDefinition: true)
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(name: "warn_partial_read", scope: !2, file: !3, line: 235, type: !199, isLocal: true, isDefinition: true)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(name: "prev_nread", scope: !487, file: !3, line: 1129, type: !490, isLocal: true, isDefinition: true)
!487 = distinct !DISubprogram(name: "iread", scope: !3, file: !3, line: 1126, type: !488, scopeLine: 1127, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !492)
!488 = !DISubroutineType(types: !489)
!489 = !{!490, !48, !105, !162}
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !210, line: 108, baseType: !491)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !91, line: 193, baseType: !138)
!492 = !{!493, !494, !495, !496, !497}
!493 = !DILocalVariable(name: "fd", arg: 1, scope: !487, file: !3, line: 1126, type: !48)
!494 = !DILocalVariable(name: "buf", arg: 2, scope: !487, file: !3, line: 1126, type: !105)
!495 = !DILocalVariable(name: "size", arg: 3, scope: !487, file: !3, line: 1126, type: !162)
!496 = !DILocalVariable(name: "nread", scope: !487, file: !3, line: 1128, type: !490)
!497 = !DILocalVariable(name: "prev", scope: !498, file: !3, line: 1155, type: !88)
!498 = distinct !DILexicalBlock(scope: !499, file: !3, line: 1154, column: 9)
!499 = distinct !DILexicalBlock(scope: !500, file: !3, line: 1153, column: 11)
!500 = distinct !DILexicalBlock(scope: !501, file: !3, line: 1152, column: 5)
!501 = distinct !DILexicalBlock(scope: !487, file: !3, line: 1151, column: 7)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(name: "progress_len", scope: !2, file: !3, line: 220, type: !48, isLocal: true, isDefinition: true)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(name: "r_full", scope: !2, file: !3, line: 208, type: !88, isLocal: true, isDefinition: true)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(name: "r_partial", scope: !2, file: !3, line: 205, type: !88, isLocal: true, isDefinition: true)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(name: "w_full", scope: !2, file: !3, line: 202, type: !88, isLocal: true, isDefinition: true)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(name: "w_partial", scope: !2, file: !3, line: 199, type: !88, isLocal: true, isDefinition: true)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(name: "r_truncate", scope: !2, file: !3, line: 238, type: !88, isLocal: true, isDefinition: true)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(name: "slash_s", scope: !516, file: !3, line: 773, type: !543, isLocal: true, isDefinition: true)
!516 = distinct !DISubprogram(name: "print_xfer_stats", scope: !3, file: !3, line: 770, type: !517, scopeLine: 771, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !519)
!517 = !DISubroutineType(types: !518)
!518 = !{null, !417}
!519 = !{!520, !521, !522, !527, !529, !530, !531, !532, !533, !534, !537, !538, !542}
!520 = !DILocalVariable(name: "progress_time", arg: 1, scope: !516, file: !3, line: 770, type: !417)
!521 = !DILocalVariable(name: "now", scope: !516, file: !3, line: 772, type: !417)
!522 = !DILocalVariable(name: "hbuf", scope: !516, file: !3, line: 774, type: !523)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 15696, elements: !524)
!524 = !{!525, !526}
!525 = !DISubrange(count: 3)
!526 = !DISubrange(count: 654)
!527 = !DILocalVariable(name: "delta_s", scope: !516, file: !3, line: 775, type: !528)
!528 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!529 = !DILocalVariable(name: "bytes_per_second", scope: !516, file: !3, line: 776, type: !107)
!530 = !DILocalVariable(name: "si", scope: !516, file: !3, line: 777, type: !107)
!531 = !DILocalVariable(name: "iec", scope: !516, file: !3, line: 778, type: !107)
!532 = !DILocalVariable(name: "bpsbuf", scope: !516, file: !3, line: 783, type: !105)
!533 = !DILocalVariable(name: "bpsbufsize", scope: !516, file: !3, line: 784, type: !48)
!534 = !DILocalVariable(name: "XTIME_PRECISIONe0", scope: !535, file: !3, line: 787, type: !528)
!535 = distinct !DILexicalBlock(scope: !536, file: !3, line: 786, column: 5)
!536 = distinct !DILexicalBlock(scope: !516, file: !3, line: 785, column: 7)
!537 = !DILocalVariable(name: "delta_xtime", scope: !535, file: !3, line: 788, type: !88)
!538 = !DILocalVariable(name: "delta_s_buf", scope: !516, file: !3, line: 810, type: !539)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 192, elements: !540)
!540 = !{!541}
!541 = !DISubrange(count: 24)
!542 = !DILocalVariable(name: "stats_len", scope: !516, file: !3, line: 814, type: !48)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 24, elements: !544)
!544 = !{!525}
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(name: "w_bytes", scope: !2, file: !3, line: 211, type: !88, isLocal: true, isDefinition: true)
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(name: "iread_fnc", scope: !2, file: !3, line: 273, type: !549, isLocal: true, isDefinition: true)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(name: "ebcdic_to_ascii", scope: !2, file: !3, line: 473, type: !552, isLocal: true, isDefinition: true)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 2048, elements: !438)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(name: "translation_needed", scope: !2, file: !3, line: 196, type: !199, isLocal: true, isDefinition: true)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(name: "ascii_to_ebcdic", scope: !2, file: !3, line: 401, type: !552, isLocal: true, isDefinition: true)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(name: "newline_character", scope: !2, file: !3, line: 242, type: !106, isLocal: true, isDefinition: true)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(name: "space_character", scope: !2, file: !3, line: 243, type: !106, isLocal: true, isDefinition: true)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(name: "ascii_to_ibm", scope: !2, file: !3, line: 437, type: !552, isLocal: true, isDefinition: true)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(name: "input_file", scope: !2, file: !3, line: 145, type: !107, isLocal: true, isDefinition: true)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(name: "input_flags", scope: !2, file: !3, line: 189, type: !48, isLocal: true, isDefinition: true)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(name: "output_file", scope: !2, file: !3, line: 148, type: !107, isLocal: true, isDefinition: true)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(name: "output_flags", scope: !2, file: !3, line: 190, type: !48, isLocal: true, isDefinition: true)
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(name: "conversions_mask", scope: !2, file: !3, line: 186, type: !48, isLocal: true, isDefinition: true)
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(name: "seek_records", scope: !2, file: !3, line: 170, type: !88, isLocal: true, isDefinition: true)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(name: "output_blocksize", scope: !2, file: !3, line: 157, type: !162, isLocal: true, isDefinition: true)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(name: "seek_bytes", scope: !2, file: !3, line: 174, type: !88, isLocal: true, isDefinition: true)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(name: "input_offset_overflow", scope: !2, file: !3, line: 232, type: !199, isLocal: true, isDefinition: true)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(name: "obuf", scope: !2, file: !3, line: 249, type: !105, isLocal: true, isDefinition: true)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(name: "ibuf", scope: !2, file: !3, line: 246, type: !105, isLocal: true, isDefinition: true)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(name: "pending_spaces", scope: !587, file: !3, line: 2057, type: !162, isLocal: true, isDefinition: true)
!587 = distinct !DISubprogram(name: "copy_with_unblock", scope: !3, file: !3, line: 2055, type: !588, scopeLine: 2056, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !590)
!588 = !DISubroutineType(types: !589)
!589 = !{null, !107, !162}
!590 = !{!591, !592, !593, !595}
!591 = !DILocalVariable(name: "buf", arg: 1, scope: !587, file: !3, line: 2055, type: !107)
!592 = !DILocalVariable(name: "nread", arg: 2, scope: !587, file: !3, line: 2055, type: !162)
!593 = !DILocalVariable(name: "i", scope: !594, file: !3, line: 2059, type: !162)
!594 = distinct !DILexicalBlock(scope: !587, file: !3, line: 2059, column: 3)
!595 = !DILocalVariable(name: "c", scope: !596, file: !3, line: 2061, type: !106)
!596 = distinct !DILexicalBlock(scope: !597, file: !3, line: 2060, column: 5)
!597 = distinct !DILexicalBlock(scope: !594, file: !3, line: 2059, column: 3)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(name: "char_is_saved", scope: !2, file: !3, line: 1722, type: !199, isLocal: true, isDefinition: true)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(name: "saved_char", scope: !2, file: !3, line: 1725, type: !106, isLocal: true, isDefinition: true)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(name: "oc", scope: !2, file: !3, line: 252, type: !162, isLocal: true, isDefinition: true)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(name: "col", scope: !2, file: !3, line: 255, type: !162, isLocal: true, isDefinition: true)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(name: "final_op_was_seek", scope: !2, file: !3, line: 177, type: !199, isLocal: true, isDefinition: true)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(name: "max_records", scope: !2, file: !3, line: 180, type: !88, isLocal: true, isDefinition: true)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(name: "max_bytes", scope: !2, file: !3, line: 183, type: !162, isLocal: true, isDefinition: true)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(name: "output_offset", scope: !614, file: !3, line: 1082, type: !209, isLocal: true, isDefinition: true)
!614 = distinct !DISubprogram(name: "invalidate_cache", scope: !3, file: !3, line: 1056, type: !615, scopeLine: 1057, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !617)
!615 = !DISubroutineType(types: !616)
!616 = !{!199, !48, !209}
!617 = !{!618, !619, !620, !621, !622, !623, !624}
!618 = !DILocalVariable(name: "fd", arg: 1, scope: !614, file: !3, line: 1056, type: !48)
!619 = !DILocalVariable(name: "len", arg: 2, scope: !614, file: !3, line: 1056, type: !209)
!620 = !DILocalVariable(name: "adv_ret", scope: !614, file: !3, line: 1058, type: !48)
!621 = !DILocalVariable(name: "offset", scope: !614, file: !3, line: 1059, type: !209)
!622 = !DILocalVariable(name: "nocache_eof", scope: !614, file: !3, line: 1060, type: !199)
!623 = !DILocalVariable(name: "clen", scope: !614, file: !3, line: 1063, type: !209)
!624 = !DILocalVariable(name: "pending", scope: !614, file: !3, line: 1068, type: !209)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(name: "i_pending", scope: !627, file: !3, line: 1033, type: !209, isLocal: true, isDefinition: true)
!627 = distinct !DISubprogram(name: "cache_round", scope: !3, file: !3, line: 1031, type: !628, scopeLine: 1032, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !630)
!628 = !DISubroutineType(types: !629)
!629 = !{!209, !48, !209}
!630 = !{!631, !632, !633, !635}
!631 = !DILocalVariable(name: "fd", arg: 1, scope: !627, file: !3, line: 1031, type: !48)
!632 = !DILocalVariable(name: "len", arg: 2, scope: !627, file: !3, line: 1031, type: !209)
!633 = !DILocalVariable(name: "pending", scope: !627, file: !3, line: 1034, type: !634)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!635 = !DILocalVariable(name: "c_pending", scope: !636, file: !3, line: 1038, type: !88)
!636 = distinct !DILexicalBlock(scope: !637, file: !3, line: 1037, column: 5)
!637 = distinct !DILexicalBlock(scope: !627, file: !3, line: 1036, column: 7)
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(name: "o_pending", scope: !627, file: !3, line: 1033, type: !209, isLocal: true, isDefinition: true)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !641, line: 7, baseType: !330)
!641 = !DIFile(filename: "/usr/include/bits/types/sigset_t.h", directory: "")
!642 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!643 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!644 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!645 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!646 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 27, DW_OP_mul, DW_OP_constu, 10, DW_OP_plus, DW_OP_stack_value))
!647 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 32, DW_OP_mul, DW_OP_constu, 32, DW_OP_plus, DW_OP_stack_value))
!648 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!649 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(name: "Version", scope: !652, file: !653, line: 2, type: !107, isDefinition: true)
!652 = distinct !DICompileUnit(language: DW_LANG_C99, file: !653, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !109, globals: !654, nameTableKind: None)
!653 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!654 = !{!650}
!655 = !DIGlobalVariableExpression(var: !656, expr: !DIExpression())
!656 = distinct !DIGlobalVariable(name: "file_name", scope: !657, file: !658, line: 46, type: !107, isLocal: true, isDefinition: true)
!657 = distinct !DICompileUnit(language: DW_LANG_C99, file: !658, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !109, retainedTypes: !659, globals: !700, nameTableKind: None)
!658 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!659 = !{!660, !101, !695, !696}
!660 = !DISubprogram(name: "close_stream", scope: !342, file: !342, line: 2, type: !661, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!661 = !DISubroutineType(types: !662)
!662 = !{!48, !663}
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !116, line: 49, size: 1728, elements: !665)
!665 = !{!666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !664, file: !116, line: 51, baseType: !48, size: 32)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !664, file: !116, line: 54, baseType: !105, size: 64, offset: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !664, file: !116, line: 55, baseType: !105, size: 64, offset: 128)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !664, file: !116, line: 56, baseType: !105, size: 64, offset: 192)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !664, file: !116, line: 57, baseType: !105, size: 64, offset: 256)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !664, file: !116, line: 58, baseType: !105, size: 64, offset: 320)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !664, file: !116, line: 59, baseType: !105, size: 64, offset: 384)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !664, file: !116, line: 60, baseType: !105, size: 64, offset: 448)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !664, file: !116, line: 61, baseType: !105, size: 64, offset: 512)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !664, file: !116, line: 64, baseType: !105, size: 64, offset: 576)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !664, file: !116, line: 65, baseType: !105, size: 64, offset: 640)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !664, file: !116, line: 66, baseType: !105, size: 64, offset: 704)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !664, file: !116, line: 68, baseType: !131, size: 64, offset: 768)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !664, file: !116, line: 70, baseType: !663, size: 64, offset: 832)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !664, file: !116, line: 72, baseType: !48, size: 32, offset: 896)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !664, file: !116, line: 73, baseType: !48, size: 32, offset: 928)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !664, file: !116, line: 74, baseType: !137, size: 64, offset: 960)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !664, file: !116, line: 77, baseType: !140, size: 16, offset: 1024)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !664, file: !116, line: 78, baseType: !142, size: 8, offset: 1040)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !664, file: !116, line: 79, baseType: !144, size: 8, offset: 1048)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !664, file: !116, line: 81, baseType: !148, size: 64, offset: 1088)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !664, file: !116, line: 89, baseType: !151, size: 64, offset: 1152)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !664, file: !116, line: 91, baseType: !153, size: 64, offset: 1216)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !664, file: !116, line: 92, baseType: !156, size: 64, offset: 1280)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !664, file: !116, line: 93, baseType: !663, size: 64, offset: 1344)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !664, file: !116, line: 94, baseType: !160, size: 64, offset: 1408)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !664, file: !116, line: 95, baseType: !162, size: 64, offset: 1472)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !664, file: !116, line: 96, baseType: !48, size: 32, offset: 1536)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !664, file: !116, line: 98, baseType: !166, size: 160, offset: 1568)
!695 = !DISubprogram(name: "quotearg_colon", scope: !6, file: !6, line: 391, type: !181, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!696 = !DISubprogram(name: "error", scope: !697, file: !697, line: 52, type: !698, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!697 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!698 = !DISubroutineType(types: !699)
!699 = !{null, !48, !48, !107, null}
!700 = !{!655, !701}
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !657, file: !658, line: 56, type: !199, isLocal: true, isDefinition: true)
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(name: "exit_failure", scope: !705, file: !706, line: 24, type: !708, isDefinition: true)
!705 = distinct !DICompileUnit(language: DW_LANG_C99, file: !706, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !109, globals: !707, nameTableKind: None)
!706 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!707 = !{!703}
!708 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !48)
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(name: "power_letter", scope: !711, file: !712, line: 36, type: !761, isLocal: true, isDefinition: true)
!711 = distinct !DICompileUnit(language: DW_LANG_C99, file: !712, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !713, retainedTypes: !714, globals: !751, nameTableKind: None)
!712 = !DIFile(filename: "lib/human.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!713 = !{!69, !39}
!714 = !{!715, !219, !404, !745, !352}
!715 = !DISubprogram(name: "localeconv", scope: !174, file: !174, line: 125, type: !716, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!716 = !DISubroutineType(types: !717)
!717 = !{!718}
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", file: !174, line: 51, size: 768, elements: !720)
!720 = !{!721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !719, file: !174, line: 55, baseType: !105, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !719, file: !174, line: 56, baseType: !105, size: 64, offset: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !719, file: !174, line: 62, baseType: !105, size: 64, offset: 128)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !719, file: !174, line: 68, baseType: !105, size: 64, offset: 192)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !719, file: !174, line: 69, baseType: !105, size: 64, offset: 256)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !719, file: !174, line: 70, baseType: !105, size: 64, offset: 320)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !719, file: !174, line: 71, baseType: !105, size: 64, offset: 384)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !719, file: !174, line: 72, baseType: !105, size: 64, offset: 448)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !719, file: !174, line: 73, baseType: !105, size: 64, offset: 512)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !719, file: !174, line: 74, baseType: !105, size: 64, offset: 576)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !719, file: !174, line: 75, baseType: !106, size: 8, offset: 640)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !719, file: !174, line: 76, baseType: !106, size: 8, offset: 648)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !719, file: !174, line: 78, baseType: !106, size: 8, offset: 656)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !719, file: !174, line: 80, baseType: !106, size: 8, offset: 664)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !719, file: !174, line: 82, baseType: !106, size: 8, offset: 672)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !719, file: !174, line: 84, baseType: !106, size: 8, offset: 680)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !719, file: !174, line: 91, baseType: !106, size: 8, offset: 688)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !719, file: !174, line: 92, baseType: !106, size: 8, offset: 696)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !719, file: !174, line: 95, baseType: !106, size: 8, offset: 704)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !719, file: !174, line: 97, baseType: !106, size: 8, offset: 712)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !719, file: !174, line: 99, baseType: !106, size: 8, offset: 720)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !719, file: !174, line: 101, baseType: !106, size: 8, offset: 728)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !719, file: !174, line: 108, baseType: !106, size: 8, offset: 736)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !719, file: !174, line: 109, baseType: !106, size: 8, offset: 744)
!745 = !DISubprogram(name: "argmatch", scope: !746, file: !746, line: 52, type: !747, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!746 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!747 = !DISubroutineType(types: !748)
!748 = !{!138, !107, !749, !404, !87}
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!751 = !{!709, !752, !755}
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(name: "block_size_args", scope: !711, file: !712, line: 398, type: !754, isLocal: true, isDefinition: true)
!754 = !DICompositeType(tag: DW_TAG_array_type, baseType: !750, size: 192, elements: !544)
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(name: "block_size_opts", scope: !711, file: !712, line: 399, type: !757, isLocal: true, isDefinition: true)
!757 = !DICompositeType(tag: DW_TAG_array_type, baseType: !758, size: 64, elements: !759)
!758 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!759 = !{!760}
!760 = !DISubrange(count: 2)
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 72, elements: !762)
!762 = !{!763}
!763 = !DISubrange(count: 9)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(name: "long_options", scope: !766, file: !767, line: 34, type: !828, isLocal: true, isDefinition: true)
!766 = distinct !DICompileUnit(language: DW_LANG_C99, file: !767, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !109, retainedTypes: !768, globals: !827, nameTableKind: None)
!767 = !DIFile(filename: "lib/long-options.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!768 = !{!769, !784}
!769 = !DISubprogram(name: "getopt_long", scope: !770, file: !770, line: 66, type: !771, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!770 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!771 = !DISubroutineType(types: !772)
!772 = !{!48, !48, !773, !107, !775, !782}
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !105)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !777)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !770, line: 50, size: 256, elements: !778)
!778 = !{!779, !780, !781, !783}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !777, file: !770, line: 52, baseType: !107, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !777, file: !770, line: 55, baseType: !48, size: 32, offset: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !777, file: !770, line: 56, baseType: !782, size: 64, offset: 128)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !777, file: !770, line: 57, baseType: !48, size: 32, offset: 192)
!784 = !DISubprogram(name: "version_etc_va", scope: !785, file: !785, line: 63, type: !786, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!785 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!786 = !DISubroutineType(types: !787)
!787 = !{null, !788, !107, !107, !107, !820}
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !116, line: 49, size: 1728, elements: !790)
!790 = !{!791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !789, file: !116, line: 51, baseType: !48, size: 32)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !789, file: !116, line: 54, baseType: !105, size: 64, offset: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !789, file: !116, line: 55, baseType: !105, size: 64, offset: 128)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !789, file: !116, line: 56, baseType: !105, size: 64, offset: 192)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !789, file: !116, line: 57, baseType: !105, size: 64, offset: 256)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !789, file: !116, line: 58, baseType: !105, size: 64, offset: 320)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !789, file: !116, line: 59, baseType: !105, size: 64, offset: 384)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !789, file: !116, line: 60, baseType: !105, size: 64, offset: 448)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !789, file: !116, line: 61, baseType: !105, size: 64, offset: 512)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !789, file: !116, line: 64, baseType: !105, size: 64, offset: 576)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !789, file: !116, line: 65, baseType: !105, size: 64, offset: 640)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !789, file: !116, line: 66, baseType: !105, size: 64, offset: 704)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !789, file: !116, line: 68, baseType: !131, size: 64, offset: 768)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !789, file: !116, line: 70, baseType: !788, size: 64, offset: 832)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !789, file: !116, line: 72, baseType: !48, size: 32, offset: 896)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !789, file: !116, line: 73, baseType: !48, size: 32, offset: 928)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !789, file: !116, line: 74, baseType: !137, size: 64, offset: 960)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !789, file: !116, line: 77, baseType: !140, size: 16, offset: 1024)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !789, file: !116, line: 78, baseType: !142, size: 8, offset: 1040)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !789, file: !116, line: 79, baseType: !144, size: 8, offset: 1048)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !789, file: !116, line: 81, baseType: !148, size: 64, offset: 1088)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !789, file: !116, line: 89, baseType: !151, size: 64, offset: 1152)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !789, file: !116, line: 91, baseType: !153, size: 64, offset: 1216)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !789, file: !116, line: 92, baseType: !156, size: 64, offset: 1280)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !789, file: !116, line: 93, baseType: !788, size: 64, offset: 1344)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !789, file: !116, line: 94, baseType: !160, size: 64, offset: 1408)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !789, file: !116, line: 95, baseType: !162, size: 64, offset: 1472)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !789, file: !116, line: 96, baseType: !48, size: 32, offset: 1536)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !789, file: !116, line: 98, baseType: !166, size: 160, offset: 1568)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !767, line: 72, size: 192, elements: !822)
!822 = !{!823, !824, !825, !826}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !821, file: !767, line: 72, baseType: !7, size: 32)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !821, file: !767, line: 72, baseType: !7, size: 32, offset: 32)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !821, file: !767, line: 72, baseType: !160, size: 64, offset: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !821, file: !767, line: 72, baseType: !160, size: 64, offset: 128)
!827 = !{!764}
!828 = !DICompositeType(tag: DW_TAG_array_type, baseType: !776, size: 768, elements: !544)
!829 = !DIGlobalVariableExpression(var: !830, expr: !DIExpression())
!830 = distinct !DIGlobalVariable(name: "program_name", scope: !831, file: !832, line: 33, type: !107, isDefinition: true)
!831 = distinct !DICompileUnit(language: DW_LANG_C99, file: !832, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !109, retainedTypes: !833, globals: !869, nameTableKind: None)
!832 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!833 = !{!160, !834, !105}
!834 = !DISubprogram(name: "fputs", scope: !111, file: !111, line: 626, type: !835, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!835 = !DISubroutineType(types: !836)
!836 = !{!48, !107, !837}
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !116, line: 49, size: 1728, elements: !839)
!839 = !{!840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !838, file: !116, line: 51, baseType: !48, size: 32)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !838, file: !116, line: 54, baseType: !105, size: 64, offset: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !838, file: !116, line: 55, baseType: !105, size: 64, offset: 128)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !838, file: !116, line: 56, baseType: !105, size: 64, offset: 192)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !838, file: !116, line: 57, baseType: !105, size: 64, offset: 256)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !838, file: !116, line: 58, baseType: !105, size: 64, offset: 320)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !838, file: !116, line: 59, baseType: !105, size: 64, offset: 384)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !838, file: !116, line: 60, baseType: !105, size: 64, offset: 448)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !838, file: !116, line: 61, baseType: !105, size: 64, offset: 512)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !838, file: !116, line: 64, baseType: !105, size: 64, offset: 576)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !838, file: !116, line: 65, baseType: !105, size: 64, offset: 640)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !838, file: !116, line: 66, baseType: !105, size: 64, offset: 704)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !838, file: !116, line: 68, baseType: !131, size: 64, offset: 768)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !838, file: !116, line: 70, baseType: !837, size: 64, offset: 832)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !838, file: !116, line: 72, baseType: !48, size: 32, offset: 896)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !838, file: !116, line: 73, baseType: !48, size: 32, offset: 928)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !838, file: !116, line: 74, baseType: !137, size: 64, offset: 960)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !838, file: !116, line: 77, baseType: !140, size: 16, offset: 1024)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !838, file: !116, line: 78, baseType: !142, size: 8, offset: 1040)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !838, file: !116, line: 79, baseType: !144, size: 8, offset: 1048)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !838, file: !116, line: 81, baseType: !148, size: 64, offset: 1088)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !838, file: !116, line: 89, baseType: !151, size: 64, offset: 1152)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !838, file: !116, line: 91, baseType: !153, size: 64, offset: 1216)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !838, file: !116, line: 92, baseType: !156, size: 64, offset: 1280)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !838, file: !116, line: 93, baseType: !837, size: 64, offset: 1344)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !838, file: !116, line: 94, baseType: !160, size: 64, offset: 1408)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !838, file: !116, line: 95, baseType: !162, size: 64, offset: 1472)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !838, file: !116, line: 96, baseType: !48, size: 32, offset: 1536)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !838, file: !116, line: 98, baseType: !166, size: 160, offset: 1568)
!869 = !{!829}
!870 = !DIGlobalVariableExpression(var: !871, expr: !DIExpression())
!871 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !872, file: !873, line: 85, type: !986, isDefinition: true)
!872 = distinct !DICompileUnit(language: DW_LANG_C99, file: !873, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !874, retainedTypes: !895, globals: !961, nameTableKind: None)
!873 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!874 = !{!5, !875, !880}
!875 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, baseType: !7, size: 32, elements: !876)
!876 = !{!877, !878, !879}
!877 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!878 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!879 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!880 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !881, line: 46, baseType: !7, size: 32, elements: !882)
!881 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!882 = !{!883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894}
!883 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!884 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!885 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!886 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!887 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!888 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!889 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!890 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!891 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!892 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!893 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!894 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!895 = !{!896, !900, !915, !918, !48, !140, !921, !162, !936, !940, !101, !946, !950, !105, !954, !957, !958}
!896 = !DISubprogram(name: "xmemdup", scope: !897, file: !897, line: 62, type: !898, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!897 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!898 = !DISubroutineType(types: !899)
!899 = !{!160, !404, !87}
!900 = !DISubprogram(name: "quotearg_alloc_mem", scope: !6, file: !6, line: 342, type: !901, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!901 = !DISubroutineType(types: !902)
!902 = !{!105, !107, !87, !355, !903}
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !905)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !873, line: 65, size: 448, elements: !906)
!906 = !{!907, !908, !909, !913, !914}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !905, file: !873, line: 68, baseType: !5, size: 32)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !905, file: !873, line: 71, baseType: !48, size: 32, offset: 32)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !905, file: !873, line: 75, baseType: !910, size: 256, offset: 64)
!910 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !911)
!911 = !{!912}
!912 = !DISubrange(count: 8)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !905, file: !873, line: 78, baseType: !107, size: 64, offset: 320)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !905, file: !873, line: 81, baseType: !107, size: 64, offset: 384)
!915 = !DISubprogram(name: "free", scope: !184, file: !184, line: 565, type: !916, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!916 = !DISubroutineType(types: !917)
!917 = !{null, !160}
!918 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !6, file: !6, line: 408, type: !919, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!919 = !DISubroutineType(types: !920)
!920 = !{!105, !48, !107, !107, !107, !87}
!921 = !DISubprogram(name: "rpl_mbrtowc", scope: !922, file: !922, line: 717, type: !923, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!922 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!923 = !DISubroutineType(types: !924)
!924 = !{!87, !782, !107, !87, !925}
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !927, line: 13, size: 64, elements: !928)
!927 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!928 = !{!929, !930}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !926, file: !927, line: 15, baseType: !48, size: 32)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !926, file: !927, line: 20, baseType: !931, size: 32, offset: 32)
!931 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !926, file: !927, line: 16, size: 32, elements: !932)
!932 = !{!933, !934}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !931, file: !927, line: 18, baseType: !7, size: 32)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !931, file: !927, line: 19, baseType: !935, size: 32)
!935 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 32, elements: !471)
!936 = !DISubprogram(name: "iswprint", scope: !937, file: !937, line: 120, type: !938, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!937 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!938 = !DISubroutineType(types: !939)
!939 = !{!48, !7}
!940 = !DISubprogram(name: "mbsinit", scope: !941, file: !941, line: 292, type: !942, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!941 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!942 = !DISubroutineType(types: !943)
!943 = !{!48, !944}
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !926)
!946 = !DISubprogram(name: "locale_charset", scope: !947, file: !947, line: 35, type: !948, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!947 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!948 = !DISubroutineType(types: !949)
!949 = !{!107}
!950 = !DISubprogram(name: "c_strcasecmp", scope: !951, file: !951, line: 42, type: !952, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!951 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!952 = !DISubroutineType(types: !953)
!953 = !{!48, !107, !107}
!954 = !DISubprogram(name: "xmalloc", scope: !897, file: !897, line: 53, type: !955, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!955 = !DISubroutineType(types: !956)
!956 = !{!160, !87}
!957 = !DISubprogram(name: "xalloc_die", scope: !897, file: !897, line: 51, type: !188, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !109)
!958 = !DISubprogram(name: "xrealloc", scope: !897, file: !897, line: 59, type: !959, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!959 = !DISubroutineType(types: !960)
!960 = !{!160, !160, !87}
!961 = !{!870, !962, !968, !970, !972, !975, !982, !984}
!962 = !DIGlobalVariableExpression(var: !963, expr: !DIExpression())
!963 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !872, file: !873, line: 101, type: !964, isDefinition: true)
!964 = !DICompositeType(tag: DW_TAG_array_type, baseType: !965, size: 320, elements: !966)
!965 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!966 = !{!967}
!967 = !DISubrange(count: 10)
!968 = !DIGlobalVariableExpression(var: !969, expr: !DIExpression())
!969 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !872, file: !873, line: 1052, type: !905, isDefinition: true)
!970 = !DIGlobalVariableExpression(var: !971, expr: !DIExpression())
!971 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !872, file: !873, line: 116, type: !905, isLocal: true, isDefinition: true)
!972 = !DIGlobalVariableExpression(var: !973, expr: !DIExpression())
!973 = distinct !DIGlobalVariable(name: "slot0", scope: !872, file: !873, line: 842, type: !974, isLocal: true, isDefinition: true)
!974 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 2048, elements: !438)
!975 = !DIGlobalVariableExpression(var: !976, expr: !DIExpression())
!976 = distinct !DIGlobalVariable(name: "slotvec", scope: !872, file: !873, line: 845, type: !977, isLocal: true, isDefinition: true)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !873, line: 834, size: 128, elements: !979)
!979 = !{!980, !981}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !978, file: !873, line: 836, baseType: !162, size: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !978, file: !873, line: 837, baseType: !105, size: 64, offset: 64)
!982 = !DIGlobalVariableExpression(var: !983, expr: !DIExpression())
!983 = distinct !DIGlobalVariable(name: "nslots", scope: !872, file: !873, line: 843, type: !48, isLocal: true, isDefinition: true)
!984 = !DIGlobalVariableExpression(var: !985, expr: !DIExpression())
!985 = distinct !DIGlobalVariable(name: "slotvec0", scope: !872, file: !873, line: 844, type: !978, isLocal: true, isDefinition: true)
!986 = !DICompositeType(tag: DW_TAG_array_type, baseType: !750, size: 704, elements: !987)
!987 = !{!988}
!988 = !DISubrange(count: 11)
!989 = !DIGlobalVariableExpression(var: !990, expr: !DIExpression())
!990 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !991, file: !992, line: 26, type: !994, isDefinition: true)
!991 = distinct !DICompileUnit(language: DW_LANG_C99, file: !992, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !109, globals: !993, nameTableKind: None)
!992 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!993 = !{!989}
!994 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 376, elements: !995)
!995 = !{!996}
!996 = !DISubrange(count: 47)
!997 = !DIGlobalVariableExpression(var: !998, expr: !DIExpression())
!998 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !999, file: !1000, line: 507, type: !48, isLocal: true, isDefinition: true)
!999 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !1000, file: !1000, line: 488, type: !1001, scopeLine: 489, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !1003, retainedNodes: !1007)
!1000 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!48, !48, !48}
!1003 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1000, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !109, retainedTypes: !1004, globals: !1006, nameTableKind: None)
!1004 = !{!1005, !368}
!1005 = !DISubprogram(name: "fcntl", scope: !409, file: !409, line: 176, type: !375, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!1006 = !{!997}
!1007 = !{!1008, !1009, !1010, !1011, !1014}
!1008 = !DILocalVariable(name: "fd", arg: 1, scope: !999, file: !1000, line: 488, type: !48)
!1009 = !DILocalVariable(name: "target", arg: 2, scope: !999, file: !1000, line: 488, type: !48)
!1010 = !DILocalVariable(name: "result", scope: !999, file: !1000, line: 490, type: !48)
!1011 = !DILocalVariable(name: "flags", scope: !1012, file: !1000, line: 531, type: !48)
!1012 = distinct !DILexicalBlock(scope: !1013, file: !1000, line: 530, column: 5)
!1013 = distinct !DILexicalBlock(scope: !999, file: !1000, line: 529, column: 7)
!1014 = !DILocalVariable(name: "saved_errno", scope: !1015, file: !1000, line: 534, type: !48)
!1015 = distinct !DILexicalBlock(scope: !1016, file: !1000, line: 533, column: 9)
!1016 = distinct !DILexicalBlock(scope: !1012, file: !1000, line: 532, column: 11)
!1017 = !DIGlobalVariableExpression(var: !1018, expr: !DIExpression())
!1018 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !1019, file: !1020, line: 67, type: !1061, isDefinition: true)
!1019 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1020, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !1021, retainedTypes: !1022, globals: !1060, nameTableKind: None)
!1020 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1021 = !{!5}
!1022 = !{!160, !107, !101, !1023, !356, !696, !1024, !345, !1059, !369}
!1023 = !DISubprogram(name: "quotearg_n_style", scope: !6, file: !6, line: 368, type: !217, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!1024 = !DISubprogram(name: "fputs_unlocked", scope: !111, file: !111, line: 662, type: !1025, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !109)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!48, !107, !1027}
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !116, line: 49, size: 1728, elements: !1029)
!1029 = !{!1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1028, file: !116, line: 51, baseType: !48, size: 32)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1028, file: !116, line: 54, baseType: !105, size: 64, offset: 64)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1028, file: !116, line: 55, baseType: !105, size: 64, offset: 128)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1028, file: !116, line: 56, baseType: !105, size: 64, offset: 192)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1028, file: !116, line: 57, baseType: !105, size: 64, offset: 256)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1028, file: !116, line: 58, baseType: !105, size: 64, offset: 320)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1028, file: !116, line: 59, baseType: !105, size: 64, offset: 384)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1028, file: !116, line: 60, baseType: !105, size: 64, offset: 448)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1028, file: !116, line: 61, baseType: !105, size: 64, offset: 512)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1028, file: !116, line: 64, baseType: !105, size: 64, offset: 576)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1028, file: !116, line: 65, baseType: !105, size: 64, offset: 640)
