; ModuleID = 'coreutils-8.32/src/df.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.fs_type_list = type { i8*, %struct.fs_type_list* }
%struct.fs_usage = type { i64, i64, i64, i64, i8, i64, i64 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.field_data_t = type { i32, i8*, i32, i8*, i64, i32, i8 }
%struct.mount_entry = type { i8*, i8*, i8*, i8*, i64, i8, %struct.mount_entry* }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.hash_entry = type { i8*, %struct.hash_entry* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.devlist = type { i64, %struct.mount_entry*, %struct.devlist* }

!33 = !DIEnumerator(name: "human_B", value: 256, isUnsigned: true)
!34 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !35, line: 32, baseType: !7, size: 32, elements: !36)
!35 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!36 = !{!37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47}
!37 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!38 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!40 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!41 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!42 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!43 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!44 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!45 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!46 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!47 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!48 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 142, baseType: !7, size: 32, elements: !49)
!49 = !{!50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62}
!50 = !DIEnumerator(name: "SOURCE_FIELD", value: 0, isUnsigned: true)
!51 = !DIEnumerator(name: "FSTYPE_FIELD", value: 1, isUnsigned: true)
!52 = !DIEnumerator(name: "SIZE_FIELD", value: 2, isUnsigned: true)
!53 = !DIEnumerator(name: "USED_FIELD", value: 3, isUnsigned: true)
!54 = !DIEnumerator(name: "AVAIL_FIELD", value: 4, isUnsigned: true)
!55 = !DIEnumerator(name: "PCENT_FIELD", value: 5, isUnsigned: true)
!56 = !DIEnumerator(name: "ITOTAL_FIELD", value: 6, isUnsigned: true)
!57 = !DIEnumerator(name: "IUSED_FIELD", value: 7, isUnsigned: true)
!58 = !DIEnumerator(name: "IAVAIL_FIELD", value: 8, isUnsigned: true)
!59 = !DIEnumerator(name: "IPCENT_FIELD", value: 9, isUnsigned: true)
!60 = !DIEnumerator(name: "TARGET_FIELD", value: 10, isUnsigned: true)
!61 = !DIEnumerator(name: "FILE_FIELD", value: 11, isUnsigned: true)
!62 = !DIEnumerator(name: "INVALID_FIELD", value: 12, isUnsigned: true)
!63 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 160, baseType: !7, size: 32, elements: !64)
!64 = !{!65, !66, !67}
!65 = !DIEnumerator(name: "BLOCK_FLD", value: 0, isUnsigned: true)
!66 = !DIEnumerator(name: "INODE_FLD", value: 1, isUnsigned: true)
!67 = !DIEnumerator(name: "OTHER_FLD", value: 2, isUnsigned: true)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !69, line: 19, baseType: !7, size: 32, elements: !70)
!69 = !DIFile(filename: "./lib/mbsalign.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!70 = !{!71, !72, !73}
!71 = !DIEnumerator(name: "MBS_ALIGN_LEFT", value: 0, isUnsigned: true)
!72 = !DIEnumerator(name: "MBS_ALIGN_RIGHT", value: 1, isUnsigned: true)
!73 = !DIEnumerator(name: "MBS_ALIGN_CENTER", value: 2, isUnsigned: true)
!74 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "canonicalize_mode_t", file: !75, line: 28, baseType: !7, size: 32, elements: !76)
!75 = !DIFile(filename: "./lib/canonicalize.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!76 = !{!77, !78, !79, !80}
!77 = !DIEnumerator(name: "CAN_EXISTING", value: 0, isUnsigned: true)
!78 = !DIEnumerator(name: "CAN_ALL_BUT_LAST", value: 1, isUnsigned: true)
!79 = !DIEnumerator(name: "CAN_MISSING", value: 2, isUnsigned: true)
!80 = !DIEnumerator(name: "CAN_NOLINKS", value: 4, isUnsigned: true)
!81 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !69, line: 21, baseType: !7, size: 32, elements: !82)
!82 = !{!83, !84, !85, !86}
!83 = !DIEnumerator(name: "MBA_UNIBYTE_FALLBACK", value: 1, isUnsigned: true)
!84 = !DIEnumerator(name: "MBA_UNIBYTE_ONLY", value: 2, isUnsigned: true)
!85 = !DIEnumerator(name: "MBA_NO_LEFT_PAD", value: 4, isUnsigned: true)
!86 = !DIEnumerator(name: "MBA_NO_RIGHT_PAD", value: 8, isUnsigned: true)
!87 = !{!88, !98, !159, !163, !167, !170, !173, !180, !195, !199, !203, !92, !149, !207, !211, !212, !216, !219, !223, !227, !247, !248, !252, !253, !151, !256, !257, !260, !263, !267, !271, !272, !289, !293, !294, !239, !297, !338, !363, !366, !369, !372, !375, !380, !394, !397, !398, !401}
!88 = !DISubprogram(name: "dcgettext", scope: !89, file: !89, line: 51, type: !90, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!89 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!90 = !DISubroutineType(types: !91)
!91 = !{!92, !94, !94, !96}
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !93)
!96 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!97 = !{}
!98 = !DISubprogram(name: "fputs_unlocked", scope: !99, file: !99, line: 662, type: !100, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!99 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!100 = !DISubroutineType(types: !101)
!101 = !{!96, !94, !102}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !104, line: 49, size: 1728, elements: !105)
!104 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!105 = !{!106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !121, !122, !123, !124, !128, !130, !132, !136, !139, !141, !144, !147, !148, !150, !154, !155}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !103, file: !104, line: 51, baseType: !96, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !103, file: !104, line: 54, baseType: !92, size: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !103, file: !104, line: 55, baseType: !92, size: 64, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !103, file: !104, line: 56, baseType: !92, size: 64, offset: 192)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !103, file: !104, line: 57, baseType: !92, size: 64, offset: 256)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !103, file: !104, line: 58, baseType: !92, size: 64, offset: 320)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !103, file: !104, line: 59, baseType: !92, size: 64, offset: 384)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !103, file: !104, line: 60, baseType: !92, size: 64, offset: 448)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !103, file: !104, line: 61, baseType: !92, size: 64, offset: 512)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !103, file: !104, line: 64, baseType: !92, size: 64, offset: 576)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !103, file: !104, line: 65, baseType: !92, size: 64, offset: 640)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !103, file: !104, line: 66, baseType: !92, size: 64, offset: 704)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !103, file: !104, line: 68, baseType: !119, size: 64, offset: 768)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !104, line: 36, flags: DIFlagFwdDecl)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !103, file: !104, line: 70, baseType: !102, size: 64, offset: 832)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !103, file: !104, line: 72, baseType: !96, size: 32, offset: 896)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !103, file: !104, line: 73, baseType: !96, size: 32, offset: 928)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !103, file: !104, line: 74, baseType: !125, size: 64, offset: 960)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !126, line: 152, baseType: !127)
!126 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!127 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !103, file: !104, line: 77, baseType: !129, size: 16, offset: 1024)
!129 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !103, file: !104, line: 78, baseType: !131, size: 8, offset: 1040)
!131 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !103, file: !104, line: 79, baseType: !133, size: 8, offset: 1048)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 8, elements: !134)
!134 = !{!135}
!135 = !DISubrange(count: 1)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !103, file: !104, line: 81, baseType: !137, size: 64, offset: 1088)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !104, line: 43, baseType: null)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !103, file: !104, line: 89, baseType: !140, size: 64, offset: 1152)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !126, line: 153, baseType: !127)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !103, file: !104, line: 91, baseType: !142, size: 64, offset: 1216)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !104, line: 37, flags: DIFlagFwdDecl)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !103, file: !104, line: 92, baseType: !145, size: 64, offset: 1280)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !104, line: 38, flags: DIFlagFwdDecl)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !103, file: !104, line: 93, baseType: !102, size: 64, offset: 1344)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !103, file: !104, line: 94, baseType: !149, size: 64, offset: 1408)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !103, file: !104, line: 95, baseType: !151, size: 64, offset: 1472)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !152, line: 46, baseType: !153)
!152 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!153 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !103, file: !104, line: 96, baseType: !96, size: 32, offset: 1536)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !103, file: !104, line: 98, baseType: !156, size: 160, offset: 1568)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 160, elements: !157)
!157 = !{!158}
!158 = !DISubrange(count: 20)
!159 = !DISubprogram(name: "set_program_name", scope: !160, file: !160, line: 37, type: !161, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!160 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!161 = !DISubroutineType(types: !162)
!162 = !{null, !94}
!163 = !DISubprogram(name: "setlocale", scope: !164, file: !164, line: 122, type: !165, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!164 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!165 = !DISubroutineType(types: !166)
!166 = !{!92, !96, !94}
!167 = !DISubprogram(name: "bindtextdomain", scope: !89, file: !89, line: 86, type: !168, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!168 = !DISubroutineType(types: !169)
!169 = !{!92, !94, !94}
!170 = !DISubprogram(name: "textdomain", scope: !89, file: !89, line: 82, type: !171, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!171 = !DISubroutineType(types: !172)
!172 = !{!92, !94}
!173 = !DISubprogram(name: "atexit", scope: !174, file: !174, line: 595, type: !175, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!174 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!175 = !DISubroutineType(types: !176)
!176 = !{!96, !177}
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{null}
!180 = !DISubprogram(name: "getopt_long", scope: !181, file: !181, line: 66, type: !182, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!181 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!182 = !DISubroutineType(types: !183)
!183 = !{!96, !96, !184, !94, !186, !193}
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !92)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !188)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !181, line: 50, size: 256, elements: !189)
!189 = !{!190, !191, !192, !194}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !188, file: !181, line: 52, baseType: !94, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !188, file: !181, line: 55, baseType: !96, size: 32, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !188, file: !181, line: 56, baseType: !193, size: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !188, file: !181, line: 57, baseType: !96, size: 32, offset: 192)
!195 = !DISubprogram(name: "human_options", scope: !22, file: !22, line: 81, type: !196, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!196 = !DISubroutineType(types: !197)
!197 = !{!5, !94, !193, !198}
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!199 = !DISubprogram(name: "xstrtol_fatal", scope: !200, file: !200, line: 41, type: !201, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !97)
!200 = !DIFile(filename: "./lib/xstrtol-error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!201 = !DISubroutineType(types: !202)
!202 = !{null, !5, !96, !93, !186, !94}
!203 = !DISubprogram(name: "error", scope: !204, file: !204, line: 52, type: !205, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!204 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!205 = !DISubroutineType(types: !206)
!206 = !{null, !96, !96, !94, null}
!207 = !DISubprogram(name: "version_etc", scope: !208, file: !208, line: 69, type: !209, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!208 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!209 = !DISubroutineType(types: !210)
!210 = !{null, !102, !94, !94, !94, null}
!211 = !DISubprogram(name: "getenv", scope: !174, file: !174, line: 634, type: !171, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!212 = !DISubprogram(name: "quote", scope: !213, file: !213, line: 44, type: !214, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!213 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!214 = !DISubroutineType(types: !215)
!215 = !{!94, !94}
!216 = !DISubprogram(name: "quotearg_n_style_colon", scope: !35, file: !35, line: 397, type: !217, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!217 = !DISubroutineType(types: !218)
!218 = !{!92, !96, !34, !94}
!219 = !DISubprogram(name: "open", scope: !220, file: !220, line: 196, type: !221, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!220 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
!221 = !DISubroutineType(types: !222)
!222 = !{!96, !94, !96, null}
!223 = !DISubprogram(name: "close", scope: !224, file: !224, line: 353, type: !225, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!224 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!225 = !DISubroutineType(types: !226)
!226 = !{!96, !96}
!227 = !DISubprogram(name: "read_file_system_list", scope: !228, file: !228, line: 40, type: !229, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!228 = !DIFile(filename: "./lib/mountlist.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!229 = !DISubroutineType(types: !230)
!230 = !{!231, !246}
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mount_entry", file: !228, line: 26, size: 448, elements: !233)
!233 = !{!234, !235, !236, !237, !238, !242, !243, !244, !245}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "me_devname", scope: !232, file: !228, line: 28, baseType: !92, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "me_mountdir", scope: !232, file: !228, line: 29, baseType: !92, size: 64, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "me_mntroot", scope: !232, file: !228, line: 30, baseType: !92, size: 64, offset: 128)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "me_type", scope: !232, file: !228, line: 32, baseType: !92, size: 64, offset: 192)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "me_dev", scope: !232, file: !228, line: 33, baseType: !239, size: 64, offset: 256)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !240, line: 59, baseType: !241)
!240 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !126, line: 145, baseType: !153)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "me_dummy", scope: !232, file: !228, line: 34, baseType: !7, size: 1, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "me_remote", scope: !232, file: !228, line: 35, baseType: !7, size: 1, offset: 321, flags: DIFlagBitField, extraData: i64 320)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "me_type_malloced", scope: !232, file: !228, line: 36, baseType: !7, size: 1, offset: 322, flags: DIFlagBitField, extraData: i64 320)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "me_next", scope: !232, file: !228, line: 37, baseType: !231, size: 64, offset: 384)
!246 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!247 = !DISubprogram(name: "sync", scope: !224, file: !224, line: 970, type: !178, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!248 = !DISubprogram(name: "xmalloc", scope: !249, file: !249, line: 53, type: !250, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!249 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!250 = !DISubroutineType(types: !251)
!251 = !{!149, !153}
!252 = !DISubprogram(name: "xstrdup", scope: !249, file: !249, line: 64, type: !171, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!253 = !DISubprogram(name: "free", scope: !174, file: !174, line: 565, type: !254, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !149}
!256 = !DISubprogram(name: "xalloc_die", scope: !249, file: !249, line: 51, type: !178, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !97)
!257 = !DISubprogram(name: "xrealloc", scope: !249, file: !249, line: 59, type: !258, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!258 = !DISubroutineType(types: !259)
!259 = !{!149, !149, !153}
!260 = !DISubprogram(name: "human_readable", scope: !22, file: !22, line: 79, type: !261, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!261 = !DISubroutineType(types: !262)
!262 = !{!92, !153, !92, !96, !153, !153}
!263 = !DISubprogram(name: "umaxtostr", scope: !264, file: !264, line: 46, type: !265, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!264 = !DIFile(filename: "./lib/inttostr.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!265 = !DISubroutineType(types: !266)
!266 = !{!92, !153, !92}
!267 = !DISubprogram(name: "gnu_mbswidth", scope: !268, file: !268, line: 51, type: !269, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!268 = !DIFile(filename: "./lib/mbswidth.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!269 = !DISubroutineType(types: !270)
!270 = !{!96, !94, !96}
!271 = !DISubprogram(name: "isatty", scope: !224, file: !224, line: 779, type: !225, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!272 = !DISubprogram(name: "rpl_mbrtowc", scope: !273, file: !273, line: 717, type: !274, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!273 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!274 = !DISubroutineType(types: !275)
!275 = !{!153, !193, !94, !153, !276}
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !278, line: 13, size: 64, elements: !279)
!278 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!279 = !{!280, !281}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !277, file: !278, line: 15, baseType: !96, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !277, file: !278, line: 20, baseType: !282, size: 32, offset: 32)
!282 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !277, file: !278, line: 16, size: 32, elements: !283)
!283 = !{!284, !285}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !282, file: !278, line: 18, baseType: !7, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !282, file: !278, line: 19, baseType: !286, size: 32)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 32, elements: !287)
!287 = !{!288}
!288 = !DISubrange(count: 4)
!289 = !DISubprogram(name: "iswcntrl", scope: !290, file: !290, line: 104, type: !291, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!290 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!291 = !DISubroutineType(types: !292)
!292 = !{!96, !7}
!293 = !DISubprogram(name: "canonicalize_file_name", scope: !174, file: !174, line: 790, type: !171, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!294 = !DISubprogram(name: "quotearg_style", scope: !35, file: !35, line: 377, type: !295, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!295 = !DISubroutineType(types: !296)
!296 = !{!92, !34, !94}
!297 = !DISubprogram(name: "find_mount_point", scope: !298, file: !298, line: 17, type: !299, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!298 = !DIFile(filename: "src/find-mount-point.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!299 = !DISubroutineType(types: !300)
!300 = !{!92, !94, !301}
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !303)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !304, line: 46, size: 1152, elements: !305)
!304 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "")
!305 = !{!306, !307, !309, !311, !313, !315, !317, !318, !319, !320, !322, !324, !332, !333, !334}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !303, file: !304, line: 48, baseType: !241, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !303, file: !304, line: 53, baseType: !308, size: 64, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !126, line: 148, baseType: !153)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !303, file: !304, line: 61, baseType: !310, size: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !126, line: 151, baseType: !153)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !303, file: !304, line: 62, baseType: !312, size: 32, offset: 192)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !126, line: 150, baseType: !7)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !303, file: !304, line: 64, baseType: !314, size: 32, offset: 224)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !126, line: 146, baseType: !7)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !303, file: !304, line: 65, baseType: !316, size: 32, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !126, line: 147, baseType: !7)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !303, file: !304, line: 67, baseType: !96, size: 32, offset: 288)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !303, file: !304, line: 69, baseType: !241, size: 64, offset: 320)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !303, file: !304, line: 74, baseType: !125, size: 64, offset: 384)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !303, file: !304, line: 78, baseType: !321, size: 64, offset: 448)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !126, line: 174, baseType: !127)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !303, file: !304, line: 80, baseType: !323, size: 64, offset: 512)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !126, line: 179, baseType: !127)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !303, file: !304, line: 91, baseType: !325, size: 128, offset: 576)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !326, line: 10, size: 128, elements: !327)
!326 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!327 = !{!328, !330}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !325, file: !326, line: 12, baseType: !329, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !126, line: 160, baseType: !127)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !325, file: !326, line: 16, baseType: !331, size: 64, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !126, line: 196, baseType: !127)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !303, file: !304, line: 92, baseType: !325, size: 128, offset: 704)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !303, file: !304, line: 93, baseType: !325, size: 128, offset: 832)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !303, file: !304, line: 106, baseType: !335, size: 192, offset: 960)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !331, size: 192, elements: !336)
!336 = !{!337}
!337 = !DISubrange(count: 3)
!338 = !DISubprogram(name: "hash_initialize", scope: !339, file: !339, line: 89, type: !340, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!339 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!340 = !DISubroutineType(types: !341)
!341 = !{!342, !153, !344, !354, !359, !362}
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !339, line: 67, flags: DIFlagFwdDecl)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !346)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !339, line: 53, size: 160, elements: !347)
!347 = !{!348, !350, !351, !352, !353}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !346, file: !339, line: 58, baseType: !349, size: 32)
!349 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !346, file: !339, line: 59, baseType: !349, size: 32, offset: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !346, file: !339, line: 60, baseType: !349, size: 32, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !346, file: !339, line: 61, baseType: !349, size: 32, offset: 96)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !346, file: !339, line: 62, baseType: !246, size: 8, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DISubroutineType(types: !356)
!356 = !{!153, !357, !153}
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{!246, !357, !357}
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!363 = !DISubprogram(name: "free_mount_entry", scope: !228, file: !228, line: 41, type: !364, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!364 = !DISubroutineType(types: !365)
!365 = !{null, !231}
!366 = !DISubprogram(name: "hash_insert", scope: !339, file: !339, line: 100, type: !367, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!367 = !DISubroutineType(types: !368)
!368 = !{!149, !342, !357}
!369 = !DISubprogram(name: "hash_free", scope: !339, file: !339, line: 96, type: !370, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!370 = !DISubroutineType(types: !371)
!371 = !{null, !342}
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !373, line: 102, baseType: !374)
!373 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !126, line: 73, baseType: !153)
!375 = !DISubprogram(name: "hash_lookup", scope: !339, file: !339, line: 78, type: !376, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!376 = !DISubroutineType(types: !377)
!377 = !{!149, !378, !357}
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !343)
!380 = !DISubprogram(name: "get_fs_usage", scope: !381, file: !381, line: 38, type: !382, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!381 = !DIFile(filename: "./lib/fsusage.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!382 = !DISubroutineType(types: !383)
!383 = !{!96, !94, !94, !384}
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fs_usage", file: !381, line: 27, size: 448, elements: !386)
!386 = !{!387, !388, !389, !390, !391, !392, !393}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "fsu_blocksize", scope: !385, file: !381, line: 29, baseType: !372, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "fsu_blocks", scope: !385, file: !381, line: 30, baseType: !372, size: 64, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "fsu_bfree", scope: !385, file: !381, line: 31, baseType: !372, size: 64, offset: 128)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "fsu_bavail", scope: !385, file: !381, line: 32, baseType: !372, size: 64, offset: 192)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "fsu_bavail_top_bit_set", scope: !385, file: !381, line: 33, baseType: !246, size: 8, offset: 256)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "fsu_files", scope: !385, file: !381, line: 34, baseType: !372, size: 64, offset: 320)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "fsu_ffree", scope: !385, file: !381, line: 35, baseType: !372, size: 64, offset: 384)
!394 = !DISubprogram(name: "canonicalize_filename_mode", scope: !75, file: !75, line: 50, type: !395, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!395 = !DISubroutineType(types: !396)
!396 = !{!92, !94, !74}
!397 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!398 = !DISubprogram(name: "ambsalign", scope: !69, file: !69, line: 59, type: !399, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!399 = !DISubroutineType(types: !400)
!400 = !{!92, !94, !198, !68, !96}
!401 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!402 = !{!403, !405, !407, !409, !411, !413, !415, !417, !0, !419, !426, !428, !430, !432, !434, !439, !441, !443, !459, !464, !466, !473, !477, !479}
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(name: "show_all_fs", scope: !2, file: !3, line: 65, type: !246, isLocal: true, isDefinition: true)
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(name: "show_local_fs", scope: !2, file: !3, line: 68, type: !246, isLocal: true, isDefinition: true)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(name: "show_listed_fs", scope: !2, file: !3, line: 72, type: !246, isLocal: true, isDefinition: true)
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(name: "human_output_opts", scope: !2, file: !3, line: 75, type: !96, isLocal: true, isDefinition: true)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(name: "output_block_size", scope: !2, file: !3, line: 78, type: !372, isLocal: true, isDefinition: true)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "file_systems_processed", scope: !2, file: !3, line: 81, type: !246, isLocal: true, isDefinition: true)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(name: "require_sync", scope: !2, file: !3, line: 87, type: !246, isLocal: true, isDefinition: true)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(name: "exit_status", scope: !2, file: !3, line: 90, type: !96, isLocal: true, isDefinition: true)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(name: "fs_exclude_list", scope: !2, file: !3, line: 116, type: !421, isLocal: true, isDefinition: true)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fs_type_list", file: !3, line: 94, size: 128, elements: !423)
!423 = !{!424, !425}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "fs_name", scope: !422, file: !3, line: 96, baseType: !92, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "fs_next", scope: !422, file: !3, line: 97, baseType: !421, size: 64, offset: 64)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(name: "mount_list", scope: !2, file: !3, line: 119, type: !231, isLocal: true, isDefinition: true)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(name: "print_type", scope: !2, file: !3, line: 122, type: !246, isLocal: true, isDefinition: true)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(name: "print_grand_total", scope: !2, file: !3, line: 125, type: !246, isLocal: true, isDefinition: true)
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(name: "grand_fsu", scope: !2, file: !3, line: 128, type: !385, isLocal: true, isDefinition: true)
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 257, type: !436, isLocal: true, isDefinition: true)
!436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 4352, elements: !437)
!437 = !{!438}
!438 = !DISubrange(count: 17)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(name: "header_mode", scope: !2, file: !3, line: 139, type: !96, isLocal: true, isDefinition: true)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(name: "ncolumns", scope: !2, file: !3, line: 226, type: !151, isLocal: true, isDefinition: true)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(name: "columns", scope: !2, file: !3, line: 223, type: !445, isLocal: true, isDefinition: true)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "field_data_t", file: !3, line: 168, size: 384, elements: !448)
!448 = !{!449, !451, !452, !454, !455, !456, !458}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !447, file: !3, line: 170, baseType: !450, size: 32)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "display_field_t", file: !3, line: 157, baseType: !48)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !447, file: !3, line: 171, baseType: !94, size: 64, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "field_type", scope: !447, file: !3, line: 172, baseType: !453, size: 32, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "field_type_t", file: !3, line: 165, baseType: !63)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "caption", scope: !447, file: !3, line: 173, baseType: !94, size: 64, offset: 192)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !447, file: !3, line: 174, baseType: !151, size: 64, offset: 256)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !447, file: !3, line: 175, baseType: !457, size: 32, offset: 320)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbs_align_t", file: !69, line: 19, baseType: !68)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !447, file: !3, line: 176, baseType: !246, size: 8, offset: 352)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(name: "field_data", scope: !2, file: !3, line: 180, type: !461, isLocal: true, isDefinition: true)
!461 = !DICompositeType(tag: DW_TAG_array_type, baseType: !447, size: 4608, elements: !462)
!462 = !{!463}
!463 = !DISubrange(count: 12)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(name: "all_args_string", scope: !2, file: !3, line: 218, type: !94, isLocal: true, isDefinition: true)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(name: "tty_out", scope: !468, file: !3, line: 334, type: !96, isLocal: true, isDefinition: true)
!468 = distinct !DISubprogram(name: "replace_problematic_chars", scope: !3, file: !3, line: 332, type: !469, scopeLine: 333, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !471)
!469 = !DISubroutineType(types: !470)
!470 = !{null, !92}
!471 = !{!472}
!472 = !DILocalVariable(name: "cell", arg: 1, scope: !468, file: !3, line: 332, type: !92)
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(name: "table", scope: !2, file: !3, line: 242, type: !475, isLocal: true, isDefinition: true)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(name: "nrows", scope: !2, file: !3, line: 245, type: !151, isLocal: true, isDefinition: true)
!479 = !DIGlobalVariableExpression(var: !480, expr: !DIExpression())
!480 = distinct !DIGlobalVariable(name: "devlist_table", scope: !2, file: !3, line: 61, type: !481, isLocal: true, isDefinition: true)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !339, line: 69, baseType: !343)
!483 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!484 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!485 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!486 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!487 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!488 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!489 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!490 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(name: "Version", scope: !493, file: !494, line: 2, type: !94, isLocal: false, isDefinition: true)
!493 = distinct !DICompileUnit(language: DW_LANG_C99, file: !494, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !97, globals: !495, splitDebugInlining: false, nameTableKind: None)
!494 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!495 = !{!491}
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(name: "file_name", scope: !498, file: !499, line: 46, type: !94, isLocal: true, isDefinition: true)
!498 = distinct !DICompileUnit(language: DW_LANG_C99, file: !499, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !97, retainedTypes: !500, globals: !538, splitDebugInlining: false, nameTableKind: None)
!499 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!500 = !{!501, !88, !537, !203}
!501 = !DISubprogram(name: "close_stream", scope: !502, file: !502, line: 2, type: !503, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!502 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!503 = !DISubroutineType(types: !504)
!504 = !{!96, !505}
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !104, line: 49, size: 1728, elements: !507)
!507 = !{!508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !506, file: !104, line: 51, baseType: !96, size: 32)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !506, file: !104, line: 54, baseType: !92, size: 64, offset: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !506, file: !104, line: 55, baseType: !92, size: 64, offset: 128)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !506, file: !104, line: 56, baseType: !92, size: 64, offset: 192)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !506, file: !104, line: 57, baseType: !92, size: 64, offset: 256)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !506, file: !104, line: 58, baseType: !92, size: 64, offset: 320)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !506, file: !104, line: 59, baseType: !92, size: 64, offset: 384)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !506, file: !104, line: 60, baseType: !92, size: 64, offset: 448)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !506, file: !104, line: 61, baseType: !92, size: 64, offset: 512)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !506, file: !104, line: 64, baseType: !92, size: 64, offset: 576)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !506, file: !104, line: 65, baseType: !92, size: 64, offset: 640)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !506, file: !104, line: 66, baseType: !92, size: 64, offset: 704)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !506, file: !104, line: 68, baseType: !119, size: 64, offset: 768)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !506, file: !104, line: 70, baseType: !505, size: 64, offset: 832)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !506, file: !104, line: 72, baseType: !96, size: 32, offset: 896)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !506, file: !104, line: 73, baseType: !96, size: 32, offset: 928)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !506, file: !104, line: 74, baseType: !125, size: 64, offset: 960)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !506, file: !104, line: 77, baseType: !129, size: 16, offset: 1024)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !506, file: !104, line: 78, baseType: !131, size: 8, offset: 1040)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !506, file: !104, line: 79, baseType: !133, size: 8, offset: 1048)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !506, file: !104, line: 81, baseType: !137, size: 64, offset: 1088)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !506, file: !104, line: 89, baseType: !140, size: 64, offset: 1152)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !506, file: !104, line: 91, baseType: !142, size: 64, offset: 1216)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !506, file: !104, line: 92, baseType: !145, size: 64, offset: 1280)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !506, file: !104, line: 93, baseType: !505, size: 64, offset: 1344)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !506, file: !104, line: 94, baseType: !149, size: 64, offset: 1408)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !506, file: !104, line: 95, baseType: !151, size: 64, offset: 1472)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !506, file: !104, line: 96, baseType: !96, size: 32, offset: 1536)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !506, file: !104, line: 98, baseType: !156, size: 160, offset: 1568)
!537 = !DISubprogram(name: "quotearg_colon", scope: !35, file: !35, line: 391, type: !171, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!538 = !{!496, !539}
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !498, file: !499, line: 56, type: !246, isLocal: true, isDefinition: true)
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(name: "exit_failure", scope: !543, file: !544, line: 24, type: !546, isLocal: false, isDefinition: true)
!543 = distinct !DICompileUnit(language: DW_LANG_C99, file: !544, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !97, globals: !545, splitDebugInlining: false, nameTableKind: None)
!544 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!545 = !{!541}
!546 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !96)
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(name: "default_tuning", scope: !549, file: !550, line: 130, type: !557, isLocal: true, isDefinition: true)
!549 = distinct !DICompileUnit(language: DW_LANG_C99, file: !550, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !97, retainedTypes: !551, globals: !556, splitDebugInlining: false, nameTableKind: None)
!550 = !DIFile(filename: "lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!551 = !{!153, !149, !552, !253, !151}
!552 = !DISubprogram(name: "rpl_calloc", scope: !553, file: !553, line: 688, type: !554, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!553 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!554 = !DISubroutineType(types: !555)
!555 = !{!149, !153, !153}
!556 = !{!547}
!557 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !558)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !339, line: 65, baseType: !559)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !339, line: 53, size: 160, elements: !560)
!560 = !{!561, !562, !563, !564, !565}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !559, file: !339, line: 58, baseType: !349, size: 32)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !559, file: !339, line: 59, baseType: !349, size: 32, offset: 32)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !559, file: !339, line: 60, baseType: !349, size: 32, offset: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !559, file: !339, line: 61, baseType: !349, size: 32, offset: 96)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !559, file: !339, line: 62, baseType: !246, size: 8, offset: 128)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(name: "power_letter", scope: !568, file: !569, line: 36, type: !621, isLocal: true, isDefinition: true)
!568 = distinct !DICompileUnit(language: DW_LANG_C99, file: !569, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !570, retainedTypes: !571, globals: !611, splitDebugInlining: false, nameTableKind: None)
!569 = !DIFile(filename: "lib/human.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!570 = !{!21, !5}
!571 = !{!572, !211, !357, !602, !608}
!572 = !DISubprogram(name: "localeconv", scope: !164, file: !164, line: 125, type: !573, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!573 = !DISubroutineType(types: !574)
!574 = !{!575}
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", file: !164, line: 51, size: 768, elements: !577)
!577 = !{!578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !576, file: !164, line: 55, baseType: !92, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !576, file: !164, line: 56, baseType: !92, size: 64, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !576, file: !164, line: 62, baseType: !92, size: 64, offset: 128)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !576, file: !164, line: 68, baseType: !92, size: 64, offset: 192)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !576, file: !164, line: 69, baseType: !92, size: 64, offset: 256)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !576, file: !164, line: 70, baseType: !92, size: 64, offset: 320)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !576, file: !164, line: 71, baseType: !92, size: 64, offset: 384)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !576, file: !164, line: 72, baseType: !92, size: 64, offset: 448)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !576, file: !164, line: 73, baseType: !92, size: 64, offset: 512)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !576, file: !164, line: 74, baseType: !92, size: 64, offset: 576)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !576, file: !164, line: 75, baseType: !93, size: 8, offset: 640)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !576, file: !164, line: 76, baseType: !93, size: 8, offset: 648)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !576, file: !164, line: 78, baseType: !93, size: 8, offset: 656)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !576, file: !164, line: 80, baseType: !93, size: 8, offset: 664)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !576, file: !164, line: 82, baseType: !93, size: 8, offset: 672)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !576, file: !164, line: 84, baseType: !93, size: 8, offset: 680)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !576, file: !164, line: 91, baseType: !93, size: 8, offset: 688)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !576, file: !164, line: 92, baseType: !93, size: 8, offset: 696)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !576, file: !164, line: 95, baseType: !93, size: 8, offset: 704)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !576, file: !164, line: 97, baseType: !93, size: 8, offset: 712)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !576, file: !164, line: 99, baseType: !93, size: 8, offset: 720)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !576, file: !164, line: 101, baseType: !93, size: 8, offset: 728)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !576, file: !164, line: 108, baseType: !93, size: 8, offset: 736)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !576, file: !164, line: 109, baseType: !93, size: 8, offset: 744)
!602 = !DISubprogram(name: "argmatch", scope: !603, file: !603, line: 52, type: !604, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!603 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!604 = !DISubroutineType(types: !605)
!605 = !{!127, !94, !606, !357, !153}
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !94)
!608 = !DISubprogram(name: "xstrtoumax", scope: !6, file: !6, line: 48, type: !609, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!609 = !DISubroutineType(types: !610)
!610 = !{!5, !94, !476, !96, !198, !94}
!611 = !{!566, !612, !615}
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(name: "block_size_args", scope: !568, file: !569, line: 398, type: !614, isLocal: true, isDefinition: true)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !607, size: 192, elements: !336)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(name: "block_size_opts", scope: !568, file: !569, line: 399, type: !617, isLocal: true, isDefinition: true)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !618, size: 64, elements: !619)
!618 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !96)
!619 = !{!620}
!620 = !DISubrange(count: 2)
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 72, elements: !622)
!622 = !{!623}
!623 = !DISubrange(count: 9)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(name: "program_name", scope: !626, file: !627, line: 33, type: !94, isLocal: false, isDefinition: true)
!626 = distinct !DICompileUnit(language: DW_LANG_C99, file: !627, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !97, retainedTypes: !628, globals: !664, splitDebugInlining: false, nameTableKind: None)
!627 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!628 = !{!149, !629, !92}
!629 = !DISubprogram(name: "fputs", scope: !99, file: !99, line: 626, type: !630, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!630 = !DISubroutineType(types: !631)
!631 = !{!96, !94, !632}
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !104, line: 49, size: 1728, elements: !634)
!634 = !{!635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !633, file: !104, line: 51, baseType: !96, size: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !633, file: !104, line: 54, baseType: !92, size: 64, offset: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !633, file: !104, line: 55, baseType: !92, size: 64, offset: 128)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !633, file: !104, line: 56, baseType: !92, size: 64, offset: 192)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !633, file: !104, line: 57, baseType: !92, size: 64, offset: 256)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !633, file: !104, line: 58, baseType: !92, size: 64, offset: 320)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !633, file: !104, line: 59, baseType: !92, size: 64, offset: 384)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !633, file: !104, line: 60, baseType: !92, size: 64, offset: 448)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !633, file: !104, line: 61, baseType: !92, size: 64, offset: 512)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !633, file: !104, line: 64, baseType: !92, size: 64, offset: 576)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !633, file: !104, line: 65, baseType: !92, size: 64, offset: 640)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !633, file: !104, line: 66, baseType: !92, size: 64, offset: 704)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !633, file: !104, line: 68, baseType: !119, size: 64, offset: 768)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !633, file: !104, line: 70, baseType: !632, size: 64, offset: 832)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !633, file: !104, line: 72, baseType: !96, size: 32, offset: 896)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !633, file: !104, line: 73, baseType: !96, size: 32, offset: 928)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !633, file: !104, line: 74, baseType: !125, size: 64, offset: 960)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !633, file: !104, line: 77, baseType: !129, size: 16, offset: 1024)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !633, file: !104, line: 78, baseType: !131, size: 8, offset: 1040)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !633, file: !104, line: 79, baseType: !133, size: 8, offset: 1048)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !633, file: !104, line: 81, baseType: !137, size: 64, offset: 1088)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !633, file: !104, line: 89, baseType: !140, size: 64, offset: 1152)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !633, file: !104, line: 91, baseType: !142, size: 64, offset: 1216)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !633, file: !104, line: 92, baseType: !145, size: 64, offset: 1280)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !633, file: !104, line: 93, baseType: !632, size: 64, offset: 1344)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !633, file: !104, line: 94, baseType: !149, size: 64, offset: 1408)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !633, file: !104, line: 95, baseType: !151, size: 64, offset: 1472)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !633, file: !104, line: 96, baseType: !96, size: 32, offset: 1536)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !633, file: !104, line: 98, baseType: !156, size: 160, offset: 1568)
!664 = !{!624}
!665 = !DIGlobalVariableExpression(var: !666, expr: !DIExpression())
!666 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !667, file: !668, line: 85, type: !766, isLocal: false, isDefinition: true)
!667 = distinct !DICompileUnit(language: DW_LANG_C99, file: !668, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !669, retainedTypes: !690, globals: !739, splitDebugInlining: false, nameTableKind: None)
!668 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!669 = !{!34, !670, !675}
!670 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !35, line: 242, baseType: !7, size: 32, elements: !671)
!671 = !{!672, !673, !674}
!672 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!673 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!674 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!675 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !676, line: 46, baseType: !7, size: 32, elements: !677)
!676 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!677 = !{!678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689}
!678 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!679 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!680 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!681 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!682 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!683 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!684 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!685 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!686 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!687 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!688 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!689 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!690 = !{!691, !694, !253, !709, !96, !129, !712, !151, !724, !725, !88, !731, !735, !92, !248, !256, !257}
!691 = !DISubprogram(name: "xmemdup", scope: !249, file: !249, line: 62, type: !692, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!692 = !DISubroutineType(types: !693)
!693 = !{!149, !357, !153}
!694 = !DISubprogram(name: "quotearg_alloc_mem", scope: !35, file: !35, line: 342, type: !695, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!695 = !DISubroutineType(types: !696)
!696 = !{!92, !94, !153, !198, !697}
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !699)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !668, line: 65, size: 448, elements: !700)
!700 = !{!701, !702, !703, !707, !708}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !699, file: !668, line: 68, baseType: !34, size: 32)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !699, file: !668, line: 71, baseType: !96, size: 32, offset: 32)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !699, file: !668, line: 75, baseType: !704, size: 256, offset: 64)
!704 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !705)
!705 = !{!706}
!706 = !DISubrange(count: 8)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !699, file: !668, line: 78, baseType: !94, size: 64, offset: 320)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !699, file: !668, line: 81, baseType: !94, size: 64, offset: 384)
!709 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !35, file: !35, line: 408, type: !710, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!710 = !DISubroutineType(types: !711)
!711 = !{!92, !96, !94, !94, !94, !153}
!712 = !DISubprogram(name: "rpl_mbrtowc", scope: !273, file: !273, line: 717, type: !713, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!713 = !DISubroutineType(types: !714)
!714 = !{!153, !193, !94, !153, !715}
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !278, line: 13, size: 64, elements: !717)
!717 = !{!718, !719}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !716, file: !278, line: 15, baseType: !96, size: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !716, file: !278, line: 20, baseType: !720, size: 32, offset: 32)
!720 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !716, file: !278, line: 16, size: 32, elements: !721)
!721 = !{!722, !723}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !720, file: !278, line: 18, baseType: !7, size: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !720, file: !278, line: 19, baseType: !286, size: 32)
!724 = !DISubprogram(name: "iswprint", scope: !290, file: !290, line: 120, type: !291, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!725 = !DISubprogram(name: "mbsinit", scope: !726, file: !726, line: 292, type: !727, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!726 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!727 = !DISubroutineType(types: !728)
!728 = !{!96, !729}
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !716)
!731 = !DISubprogram(name: "locale_charset", scope: !732, file: !732, line: 35, type: !733, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!732 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!733 = !DISubroutineType(types: !734)
!734 = !{!94}
!735 = !DISubprogram(name: "c_strcasecmp", scope: !736, file: !736, line: 42, type: !737, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!736 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!737 = !DISubroutineType(types: !738)
!738 = !{!96, !94, !94}
!739 = !{!665, !740, !746, !748, !750, !755, !762, !764}
!740 = !DIGlobalVariableExpression(var: !741, expr: !DIExpression())
!741 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !667, file: !668, line: 101, type: !742, isLocal: false, isDefinition: true)
!742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !743, size: 320, elements: !744)
!743 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!744 = !{!745}
!745 = !DISubrange(count: 10)
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !667, file: !668, line: 1052, type: !699, isLocal: false, isDefinition: true)
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !667, file: !668, line: 116, type: !699, isLocal: true, isDefinition: true)
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(name: "slot0", scope: !667, file: !668, line: 842, type: !752, isLocal: true, isDefinition: true)
!752 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 2048, elements: !753)
!753 = !{!754}
!754 = !DISubrange(count: 256)
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(name: "slotvec", scope: !667, file: !668, line: 845, type: !757, isLocal: true, isDefinition: true)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !668, line: 834, size: 128, elements: !759)
!759 = !{!760, !761}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !758, file: !668, line: 836, baseType: !151, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !758, file: !668, line: 837, baseType: !92, size: 64, offset: 64)
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression())
!763 = distinct !DIGlobalVariable(name: "nslots", scope: !667, file: !668, line: 843, type: !96, isLocal: true, isDefinition: true)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(name: "slotvec0", scope: !667, file: !668, line: 844, type: !758, isLocal: true, isDefinition: true)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !607, size: 704, elements: !767)
!767 = !{!768}
!768 = !DISubrange(count: 11)
!769 = !DIGlobalVariableExpression(var: !770, expr: !DIExpression())
!770 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !771, file: !772, line: 26, type: !774, isLocal: false, isDefinition: true)
!771 = distinct !DICompileUnit(language: DW_LANG_C99, file: !772, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !97, globals: !773, splitDebugInlining: false, nameTableKind: None)
!772 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!773 = !{!769}
!774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 376, elements: !775)
!775 = !{!776}
!776 = !DISubrange(count: 47)
!777 = !DIGlobalVariableExpression(var: !778, expr: !DIExpression())
!778 = distinct !DIGlobalVariable(name: "statvfs_works_cache", scope: !779, file: !780, line: 93, type: !96, isLocal: true, isDefinition: true)
!779 = distinct !DISubprogram(name: "statvfs_works", scope: !780, file: !780, line: 91, type: !781, scopeLine: 92, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !783, retainedNodes: !856)
!780 = !DIFile(filename: "lib/fsusage.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!781 = !DISubroutineType(types: !782)
!782 = !{!96}
!783 = distinct !DICompileUnit(language: DW_LANG_C99, file: !780, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !97, retainedTypes: !784, globals: !855, splitDebugInlining: false, nameTableKind: None)
!784 = !{!785, !372, !810, !837, !853}
!785 = !DISubprogram(name: "statvfs", scope: !786, file: !786, line: 51, type: !787, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!786 = !DIFile(filename: "/usr/include/sys/statvfs.h", directory: "")
!787 = !DISubroutineType(types: !788)
!788 = !{!96, !94, !789}
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "statvfs", file: !791, line: 29, size: 896, elements: !792)
!791 = !DIFile(filename: "/usr/include/bits/statvfs.h", directory: "")
!792 = !{!793, !794, !795, !797, !798, !799, !801, !802, !803, !804, !805, !806}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "f_bsize", scope: !790, file: !791, line: 31, baseType: !153, size: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "f_frsize", scope: !790, file: !791, line: 32, baseType: !153, size: 64, offset: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "f_blocks", scope: !790, file: !791, line: 34, baseType: !796, size: 64, offset: 128)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fsblkcnt_t", file: !126, line: 183, baseType: !153)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "f_bfree", scope: !790, file: !791, line: 35, baseType: !796, size: 64, offset: 192)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "f_bavail", scope: !790, file: !791, line: 36, baseType: !796, size: 64, offset: 256)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "f_files", scope: !790, file: !791, line: 37, baseType: !800, size: 64, offset: 320)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fsfilcnt_t", file: !126, line: 187, baseType: !153)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "f_ffree", scope: !790, file: !791, line: 38, baseType: !800, size: 64, offset: 384)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "f_favail", scope: !790, file: !791, line: 39, baseType: !800, size: 64, offset: 448)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "f_fsid", scope: !790, file: !791, line: 48, baseType: !153, size: 64, offset: 512)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "f_flag", scope: !790, file: !791, line: 52, baseType: !153, size: 64, offset: 576)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "f_namemax", scope: !790, file: !791, line: 53, baseType: !153, size: 64, offset: 640)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "__f_spare", scope: !790, file: !791, line: 54, baseType: !807, size: 192, offset: 704)
!807 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 192, elements: !808)
!808 = !{!809}
!809 = !DISubrange(count: 6)
!810 = !DISubprogram(name: "statfs", scope: !811, file: !811, line: 31, type: !812, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!811 = !DIFile(filename: "/usr/include/sys/statfs.h", directory: "")
!812 = !DISubroutineType(types: !813)
!813 = !{!96, !94, !814}
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "statfs", file: !816, line: 24, size: 960, elements: !817)
!816 = !DIFile(filename: "/usr/include/bits/statfs.h", directory: "")
!817 = !{!818, !820, !821, !822, !823, !824, !825, !826, !832, !833, !834, !835}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "f_type", scope: !815, file: !816, line: 26, baseType: !819, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fsword_t", file: !126, line: 191, baseType: !127)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "f_bsize", scope: !815, file: !816, line: 27, baseType: !819, size: 64, offset: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "f_blocks", scope: !815, file: !816, line: 29, baseType: !796, size: 64, offset: 128)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "f_bfree", scope: !815, file: !816, line: 30, baseType: !796, size: 64, offset: 192)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "f_bavail", scope: !815, file: !816, line: 31, baseType: !796, size: 64, offset: 256)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "f_files", scope: !815, file: !816, line: 32, baseType: !800, size: 64, offset: 320)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "f_ffree", scope: !815, file: !816, line: 33, baseType: !800, size: 64, offset: 384)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "f_fsid", scope: !815, file: !816, line: 41, baseType: !827, size: 64, offset: 448)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fsid_t", file: !126, line: 155, baseType: !828)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !126, line: 155, size: 64, elements: !829)
!829 = !{!830}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !828, file: !126, line: 155, baseType: !831, size: 64)
!831 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 64, elements: !619)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "f_namelen", scope: !815, file: !816, line: 42, baseType: !819, size: 64, offset: 512)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "f_frsize", scope: !815, file: !816, line: 43, baseType: !819, size: 64, offset: 576)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "f_flags", scope: !815, file: !816, line: 44, baseType: !819, size: 64, offset: 640)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "f_spare", scope: !815, file: !816, line: 45, baseType: !836, size: 256, offset: 704)
!836 = !DICompositeType(tag: DW_TAG_array_type, baseType: !819, size: 256, elements: !287)
!837 = !DISubprogram(name: "uname", scope: !838, file: !838, line: 81, type: !839, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!838 = !DIFile(filename: "/usr/include/sys/utsname.h", directory: "")
!839 = !DISubroutineType(types: !840)
!840 = !{!96, !841}
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utsname", file: !838, line: 48, size: 3120, elements: !843)
!843 = !{!844, !848, !849, !850, !851, !852}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "sysname", scope: !842, file: !838, line: 51, baseType: !845, size: 520)
!845 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 520, elements: !846)
!846 = !{!847}
!847 = !DISubrange(count: 65)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "nodename", scope: !842, file: !838, line: 54, baseType: !845, size: 520, offset: 520)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !842, file: !838, line: 57, baseType: !845, size: 520, offset: 1040)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !842, file: !838, line: 59, baseType: !845, size: 520, offset: 1560)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !842, file: !838, line: 62, baseType: !845, size: 520, offset: 2080)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "domainname", scope: !842, file: !838, line: 67, baseType: !845, size: 520, offset: 2600)
!853 = !DISubprogram(name: "strverscmp", scope: !854, file: !854, line: 467, type: !737, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!854 = !DIFile(filename: "/usr/include/string.h", directory: "")
!855 = !{!777}
!856 = !{!857}
!857 = !DILocalVariable(name: "name", scope: !779, file: !780, line: 94, type: !842)
!858 = !DIGlobalVariableExpression(var: !859, expr: !DIExpression())
!859 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !860, file: !861, line: 67, type: !907, isLocal: false, isDefinition: true)
!860 = distinct !DICompileUnit(language: DW_LANG_C99, file: !861, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !862, retainedTypes: !863, globals: !906, splitDebugInlining: false, nameTableKind: None)
!861 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!862 = !{!34}
!863 = !{!149, !94, !88, !864, !865, !203, !868, !212, !903, !401}
!864 = !DISubprogram(name: "quotearg_n_style", scope: !35, file: !35, line: 368, type: !217, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!865 = !DISubprogram(name: "quote_n", scope: !213, file: !213, line: 40, type: !866, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!866 = !DISubroutineType(types: !867)
!867 = !{!94, !96, !94}
!868 = !DISubprogram(name: "fputs_unlocked", scope: !99, file: !99, line: 662, type: !869, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!869 = !DISubroutineType(types: !870)
!870 = !{!96, !94, !871}
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !104, line: 49, size: 1728, elements: !873)
!873 = !{!874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !872, file: !104, line: 51, baseType: !96, size: 32)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !872, file: !104, line: 54, baseType: !92, size: 64, offset: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !872, file: !104, line: 55, baseType: !92, size: 64, offset: 128)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !872, file: !104, line: 56, baseType: !92, size: 64, offset: 192)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !872, file: !104, line: 57, baseType: !92, size: 64, offset: 256)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !872, file: !104, line: 58, baseType: !92, size: 64, offset: 320)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !872, file: !104, line: 59, baseType: !92, size: 64, offset: 384)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !872, file: !104, line: 60, baseType: !92, size: 64, offset: 448)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !872, file: !104, line: 61, baseType: !92, size: 64, offset: 512)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !872, file: !104, line: 64, baseType: !92, size: 64, offset: 576)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !872, file: !104, line: 65, baseType: !92, size: 64, offset: 640)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !872, file: !104, line: 66, baseType: !92, size: 64, offset: 704)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !872, file: !104, line: 68, baseType: !119, size: 64, offset: 768)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !872, file: !104, line: 70, baseType: !871, size: 64, offset: 832)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !872, file: !104, line: 72, baseType: !96, size: 32, offset: 896)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !872, file: !104, line: 73, baseType: !96, size: 32, offset: 928)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !872, file: !104, line: 74, baseType: !125, size: 64, offset: 960)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !872, file: !104, line: 77, baseType: !129, size: 16, offset: 1024)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !872, file: !104, line: 78, baseType: !131, size: 8, offset: 1040)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !872, file: !104, line: 79, baseType: !133, size: 8, offset: 1048)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !872, file: !104, line: 81, baseType: !137, size: 64, offset: 1088)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !872, file: !104, line: 89, baseType: !140, size: 64, offset: 1152)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !872, file: !104, line: 91, baseType: !142, size: 64, offset: 1216)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !872, file: !104, line: 92, baseType: !145, size: 64, offset: 1280)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !872, file: !104, line: 93, baseType: !871, size: 64, offset: 1344)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !872, file: !104, line: 94, baseType: !149, size: 64, offset: 1408)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !872, file: !104, line: 95, baseType: !151, size: 64, offset: 1472)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !872, file: !104, line: 96, baseType: !96, size: 32, offset: 1536)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !872, file: !104, line: 98, baseType: !156, size: 160, offset: 1568)
!903 = !DISubprogram(name: "usage", scope: !861, file: !861, line: 56, type: !904, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!904 = !DISubroutineType(types: !905)
!905 = !{null, !96}
!906 = !{!858}
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !603, line: 61, baseType: !177)
!908 = !DIGlobalVariableExpression(var: !909, expr: !DIExpression())
!909 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !910, file: !911, line: 507, type: !96, isLocal: true, isDefinition: true)
!910 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !911, file: !911, line: 488, type: !912, scopeLine: 489, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !914, retainedNodes: !920)
!911 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!912 = !DISubroutineType(types: !913)
!913 = !{!96, !96, !96}
!914 = distinct !DICompileUnit(language: DW_LANG_C99, file: !911, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !97, retainedTypes: !915, globals: !919, splitDebugInlining: false, nameTableKind: None)
!915 = !{!916, !223}
!916 = !DISubprogram(name: "fcntl", scope: !220, file: !220, line: 176, type: !917, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!917 = !DISubroutineType(types: !918)
!918 = !{!96, !96, !96, null}
!919 = !{!908}
!920 = !{!921, !922, !923, !924, !927}
!921 = !DILocalVariable(name: "fd", arg: 1, scope: !910, file: !911, line: 488, type: !96)
!922 = !DILocalVariable(name: "target", arg: 2, scope: !910, file: !911, line: 488, type: !96)
!923 = !DILocalVariable(name: "result", scope: !910, file: !911, line: 490, type: !96)
!924 = !DILocalVariable(name: "flags", scope: !925, file: !911, line: 531, type: !96)
!925 = distinct !DILexicalBlock(scope: !926, file: !911, line: 530, column: 5)
!926 = distinct !DILexicalBlock(scope: !910, file: !911, line: 529, column: 7)
!927 = !DILocalVariable(name: "saved_errno", scope: !928, file: !911, line: 534, type: !96)
!928 = distinct !DILexicalBlock(scope: !929, file: !911, line: 533, column: 9)
!929 = distinct !DILexicalBlock(scope: !925, file: !911, line: 532, column: 11)
!930 = distinct !DICompileUnit(language: DW_LANG_C99, file: !931, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !862, retainedTypes: !932, splitDebugInlining: false, nameTableKind: None)
!931 = !DIFile(filename: "src/find-mount-point.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!932 = !{!933, !88, !203, !942, !294, !945, !92, !253, !947, !951, !956}
!933 = !DISubprogram(name: "save_cwd", scope: !934, file: !934, line: 30, type: !935, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!934 = !DIFile(filename: "./lib/save-cwd.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!935 = !DISubroutineType(types: !936)
!936 = !{!96, !937}
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "saved_cwd", file: !934, line: 24, size: 128, elements: !939)
!939 = !{!940, !941}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !938, file: !934, line: 26, baseType: !96, size: 32)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !938, file: !934, line: 27, baseType: !92, size: 64, offset: 64)
!942 = !DISubprogram(name: "chdir", scope: !224, file: !224, line: 497, type: !943, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!943 = !DISubroutineType(types: !944)
!944 = !{!96, !94}
!945 = !DISubprogram(name: "dir_name", scope: !946, file: !946, line: 40, type: !171, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!946 = !DIFile(filename: "./lib/dirname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!947 = !DISubprogram(name: "xgetcwd", scope: !948, file: !948, line: 17, type: !949, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!948 = !DIFile(filename: "./lib/xgetcwd.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!949 = !DISubroutineType(types: !950)
!950 = !{!92}
!951 = !DISubprogram(name: "restore_cwd", scope: !934, file: !934, line: 31, type: !952, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!952 = !DISubroutineType(types: !953)
!953 = !{!96, !954}
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !938)
!956 = !DISubprogram(name: "free_cwd", scope: !934, file: !934, line: 32, type: !957, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!957 = !DISubroutineType(types: !958)
!958 = !{null, !937}
!959 = distinct !DICompileUnit(language: DW_LANG_C99, file: !960, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !97, splitDebugInlining: false, nameTableKind: None)
!960 = !DIFile(filename: "lib/c-ctype.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!961 = distinct !DICompileUnit(language: DW_LANG_C99, file: !962, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !963, retainedTypes: !964, splitDebugInlining: false, nameTableKind: None)
!962 = !DIFile(filename: "lib/canonicalize.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!963 = !{!74}
!964 = !{!149, !947, !257, !248, !965, !253, !369, !969, !256, !981, !1008}
!965 = !DISubprogram(name: "areadlink_with_size", scope: !966, file: !966, line: 24, type: !967, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!966 = !DIFile(filename: "./lib/areadlink.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!967 = !DISubroutineType(types: !968)
!968 = !{!92, !94, !153}
!969 = !DISubprogram(name: "hash_initialize", scope: !339, file: !339, line: 89, type: !970, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!970 = !DISubroutineType(types: !971)
!971 = !{!342, !153, !972, !354, !359, !362}
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !974)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !339, line: 53, size: 160, elements: !975)
!975 = !{!976, !977, !978, !979, !980}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !974, file: !339, line: 58, baseType: !349, size: 32)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !974, file: !339, line: 59, baseType: !349, size: 32, offset: 32)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !974, file: !339, line: 60, baseType: !349, size: 32, offset: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !974, file: !339, line: 61, baseType: !349, size: 32, offset: 96)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !974, file: !339, line: 62, baseType: !246, size: 8, offset: 128)
!981 = !DISubprogram(name: "seen_file", scope: !982, file: !982, line: 14, type: !983, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!982 = !DIFile(filename: "./lib/file-set.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!983 = !DISubroutineType(types: !984)
!984 = !{!246, !378, !94, !985}
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !987)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !304, line: 46, size: 1152, elements: !988)
!988 = !{!989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1005, !1006, !1007}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !987, file: !304, line: 48, baseType: !241, size: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !987, file: !304, line: 53, baseType: !308, size: 64, offset: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !987, file: !304, line: 61, baseType: !310, size: 64, offset: 128)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !987, file: !304, line: 62, baseType: !312, size: 32, offset: 192)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !987, file: !304, line: 64, baseType: !314, size: 32, offset: 224)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !987, file: !304, line: 65, baseType: !316, size: 32, offset: 256)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !987, file: !304, line: 67, baseType: !96, size: 32, offset: 288)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !987, file: !304, line: 69, baseType: !241, size: 64, offset: 320)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !987, file: !304, line: 74, baseType: !125, size: 64, offset: 384)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !987, file: !304, line: 78, baseType: !321, size: 64, offset: 448)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !987, file: !304, line: 80, baseType: !323, size: 64, offset: 512)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !987, file: !304, line: 91, baseType: !1001, size: 128, offset: 576)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !326, line: 10, size: 128, elements: !1002)
!1002 = !{!1003, !1004}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1001, file: !326, line: 12, baseType: !329, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1001, file: !326, line: 16, baseType: !331, size: 64, offset: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !987, file: !304, line: 92, baseType: !1001, size: 128, offset: 704)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !987, file: !304, line: 93, baseType: !1001, size: 128, offset: 832)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !987, file: !304, line: 106, baseType: !335, size: 192, offset: 960)
!1008 = !DISubprogram(name: "record_file", scope: !982, file: !982, line: 7, type: !1009, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{null, !342, !94, !985}
!1011 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1012, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !97, retainedTypes: !1013, splitDebugInlining: false, nameTableKind: None)
!1012 = !DIFile(filename: "lib/dirname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1013 = !{!1014, !256}
!1014 = !DISubprogram(name: "mdir_name", scope: !946, file: !946, line: 43, type: !171, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !97)
