source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.F_triple = type { i8*, i64, i64 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__fsid_t = type { [2 x i32] }
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.devlist = type { i64, %struct.mount_entry*, %struct.devlist* }
%struct.field_data_t = type { i32, i8*, i32, i8*, i64, i32, i8 }
%struct.field_values_t = type { i64, i64, i64, i64, i8, i64, i64, i8 }
%struct.fs_type_list = type { i8*, %struct.fs_type_list* }
%struct.fs_usage = type { i64, i64, i64, i64, i8, i64, i64 }
%struct.hash_entry = type { i8*, %struct.hash_entry* }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.infomap = type { i8*, i8* }
%struct.lconv = type { i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8 }

!77 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!78 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!79 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!80 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!81 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!82 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!83 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!84 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!85 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!86 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!87 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!88 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!89 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "canonicalize_mode_t", file: !90, line: 24, baseType: !7, size: 32, elements: !91)
!90 = !DIFile(filename: "./lib/canonicalize.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!91 = !{!92, !93, !94, !95}
!92 = !DIEnumerator(name: "CAN_EXISTING", value: 0, isUnsigned: true)
!93 = !DIEnumerator(name: "CAN_ALL_BUT_LAST", value: 1, isUnsigned: true)
!94 = !DIEnumerator(name: "CAN_MISSING", value: 2, isUnsigned: true)
!95 = !DIEnumerator(name: "CAN_NOLINKS", value: 4, isUnsigned: true)
!96 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !69, line: 21, baseType: !7, size: 32, elements: !97)
!97 = !{!98, !99, !100, !101}
!98 = !DIEnumerator(name: "MBA_UNIBYTE_FALLBACK", value: 1, isUnsigned: true)
!99 = !DIEnumerator(name: "MBA_UNIBYTE_ONLY", value: 2, isUnsigned: true)
!100 = !DIEnumerator(name: "MBA_NO_LEFT_PAD", value: 4, isUnsigned: true)
!101 = !DIEnumerator(name: "MBA_NO_RIGHT_PAD", value: 8, isUnsigned: true)
!102 = !{!103, !105, !106, !109, !110, !111, !115, !118, !119}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !107, line: 62, baseType: !108)
!107 = !DIFile(filename: "/usr/lib/clang/7.0.0/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!108 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!109 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!110 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !112, line: 59, baseType: !113)
!112 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !114, line: 143, baseType: !108)
!114 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !116, line: 102, baseType: !117)
!116 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !114, line: 72, baseType: !108)
!118 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!119 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!120 = !{!121, !124, !126, !128, !130, !132, !134, !136, !0, !138, !145, !160, !162, !164, !176, !192, !194, !196, !212, !217, !219, !223, !225}
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(name: "show_all_fs", scope: !2, file: !3, line: 61, type: !123, isLocal: true, isDefinition: true)
!123 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!124 = !DIGlobalVariableExpression(var: !125, expr: !DIExpression())
!125 = distinct !DIGlobalVariable(name: "show_local_fs", scope: !2, file: !3, line: 64, type: !123, isLocal: true, isDefinition: true)
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(name: "show_listed_fs", scope: !2, file: !3, line: 68, type: !123, isLocal: true, isDefinition: true)
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(name: "human_output_opts", scope: !2, file: !3, line: 71, type: !109, isLocal: true, isDefinition: true)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(name: "output_block_size", scope: !2, file: !3, line: 74, type: !115, isLocal: true, isDefinition: true)
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(name: "file_systems_processed", scope: !2, file: !3, line: 77, type: !123, isLocal: true, isDefinition: true)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(name: "require_sync", scope: !2, file: !3, line: 83, type: !123, isLocal: true, isDefinition: true)
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(name: "exit_status", scope: !2, file: !3, line: 86, type: !109, isLocal: true, isDefinition: true)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "fs_exclude_list", scope: !2, file: !3, line: 112, type: !140, isLocal: true, isDefinition: true)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fs_type_list", file: !3, line: 90, size: 128, elements: !142)
!142 = !{!143, !144}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "fs_name", scope: !141, file: !3, line: 92, baseType: !103, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "fs_next", scope: !141, file: !3, line: 93, baseType: !140, size: 64, offset: 64)
!145 = !DIGlobalVariableExpression(var: !146, expr: !DIExpression())
!146 = distinct !DIGlobalVariable(name: "mount_list", scope: !2, file: !3, line: 115, type: !147, isLocal: true, isDefinition: true)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mount_entry", file: !149, line: 26, size: 448, elements: !150)
!149 = !DIFile(filename: "./lib/mountlist.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!150 = !{!151, !152, !153, !154, !155, !156, !157, !158, !159}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "me_devname", scope: !148, file: !149, line: 28, baseType: !103, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "me_mountdir", scope: !148, file: !149, line: 29, baseType: !103, size: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "me_mntroot", scope: !148, file: !149, line: 30, baseType: !103, size: 64, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "me_type", scope: !148, file: !149, line: 32, baseType: !103, size: 64, offset: 192)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "me_dev", scope: !148, file: !149, line: 33, baseType: !111, size: 64, offset: 256)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "me_dummy", scope: !148, file: !149, line: 34, baseType: !7, size: 1, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "me_remote", scope: !148, file: !149, line: 35, baseType: !7, size: 1, offset: 321, flags: DIFlagBitField, extraData: i64 320)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "me_type_malloced", scope: !148, file: !149, line: 36, baseType: !7, size: 1, offset: 322, flags: DIFlagBitField, extraData: i64 320)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "me_next", scope: !148, file: !149, line: 37, baseType: !147, size: 64, offset: 384)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "print_type", scope: !2, file: !3, line: 118, type: !123, isLocal: true, isDefinition: true)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(name: "print_grand_total", scope: !2, file: !3, line: 121, type: !123, isLocal: true, isDefinition: true)
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(name: "grand_fsu", scope: !2, file: !3, line: 124, type: !166, isLocal: true, isDefinition: true)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fs_usage", file: !167, line: 27, size: 448, elements: !168)
!167 = !DIFile(filename: "./lib/fsusage.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!168 = !{!169, !170, !171, !172, !173, !174, !175}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "fsu_blocksize", scope: !166, file: !167, line: 29, baseType: !115, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "fsu_blocks", scope: !166, file: !167, line: 30, baseType: !115, size: 64, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "fsu_bfree", scope: !166, file: !167, line: 31, baseType: !115, size: 64, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "fsu_bavail", scope: !166, file: !167, line: 32, baseType: !115, size: 64, offset: 192)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "fsu_bavail_top_bit_set", scope: !166, file: !167, line: 33, baseType: !123, size: 8, offset: 256)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "fsu_files", scope: !166, file: !167, line: 34, baseType: !115, size: 64, offset: 320)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "fsu_ffree", scope: !166, file: !167, line: 35, baseType: !115, size: 64, offset: 384)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 253, type: !178, isLocal: true, isDefinition: true)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 4352, elements: !190)
!179 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !180)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !181, line: 50, size: 256, elements: !182)
!181 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!182 = !{!183, !186, !187, !189}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !180, file: !181, line: 52, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !104)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !180, file: !181, line: 55, baseType: !109, size: 32, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !180, file: !181, line: 56, baseType: !188, size: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !180, file: !181, line: 57, baseType: !109, size: 32, offset: 192)
!190 = !{!191}
!191 = !DISubrange(count: 17)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(name: "header_mode", scope: !2, file: !3, line: 135, type: !109, isLocal: true, isDefinition: true)
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(name: "ncolumns", scope: !2, file: !3, line: 222, type: !106, isLocal: true, isDefinition: true)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "columns", scope: !2, file: !3, line: 219, type: !198, isLocal: true, isDefinition: true)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "field_data_t", file: !3, line: 164, size: 384, elements: !201)
!201 = !{!202, !204, !205, !207, !208, !209, !211}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !200, file: !3, line: 166, baseType: !203, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "display_field_t", file: !3, line: 153, baseType: !48)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !200, file: !3, line: 167, baseType: !184, size: 64, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "field_type", scope: !200, file: !3, line: 168, baseType: !206, size: 32, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "field_type_t", file: !3, line: 161, baseType: !63)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "caption", scope: !200, file: !3, line: 169, baseType: !184, size: 64, offset: 192)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !200, file: !3, line: 170, baseType: !106, size: 64, offset: 256)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !200, file: !3, line: 171, baseType: !210, size: 32, offset: 320)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbs_align_t", file: !69, line: 19, baseType: !68)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !200, file: !3, line: 172, baseType: !123, size: 8, offset: 352)
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(name: "field_data", scope: !2, file: !3, line: 176, type: !214, isLocal: true, isDefinition: true)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 4608, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 12)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(name: "all_args_string", scope: !2, file: !3, line: 214, type: !184, isLocal: true, isDefinition: true)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(name: "table", scope: !2, file: !3, line: 238, type: !221, isLocal: true, isDefinition: true)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!223 = !DIGlobalVariableExpression(var: !224, expr: !DIExpression())
!224 = distinct !DIGlobalVariable(name: "nrows", scope: !2, file: !3, line: 241, type: !106, isLocal: true, isDefinition: true)
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression())
!226 = distinct !DIGlobalVariable(name: "devlist_table", scope: !2, file: !3, line: 57, type: !227, isLocal: true, isDefinition: true)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !229, line: 69, baseType: !230)
!229 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !229, line: 67, flags: DIFlagFwdDecl)
!231 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!232 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!233 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!234 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!235 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!236 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!237 = !DIGlobalVariableExpression(var: !125, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!238 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(name: "Version", scope: !241, file: !242, line: 2, type: !184, isDefinition: true)
!241 = distinct !DICompileUnit(language: DW_LANG_C99, file: !242, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !243, globals: !244)
!242 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!243 = !{}
!244 = !{!239}
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(name: "file_name", scope: !247, file: !252, line: 46, type: !184, isLocal: true, isDefinition: true)
!247 = distinct !DICompileUnit(language: DW_LANG_C99, file: !248, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !243, globals: !249)
!248 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!249 = !{!245, !250}
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !247, file: !252, line: 56, type: !123, isLocal: true, isDefinition: true)
!252 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(name: "exit_failure", scope: !255, file: !258, line: 24, type: !259, isDefinition: true)
!255 = distinct !DICompileUnit(language: DW_LANG_C99, file: !256, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !243, globals: !257)
!256 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!257 = !{!253}
!258 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!259 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !109)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(name: "default_tuning", scope: !262, file: !266, line: 130, type: !267, isLocal: true, isDefinition: true)
!262 = distinct !DICompileUnit(language: DW_LANG_C99, file: !263, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !243, retainedTypes: !264, globals: !265)
!263 = !DIFile(filename: "./lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!264 = !{!108, !105, !106}
!265 = !{!260}
!266 = !DIFile(filename: "lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!267 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !268)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !229, line: 65, baseType: !269)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !229, line: 53, size: 160, elements: !270)
!270 = !{!271, !273, !274, !275, !276}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !269, file: !229, line: 58, baseType: !272, size: 32)
!272 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !269, file: !229, line: 59, baseType: !272, size: 32, offset: 32)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !269, file: !229, line: 60, baseType: !272, size: 32, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !269, file: !229, line: 61, baseType: !272, size: 32, offset: 96)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !269, file: !229, line: 62, baseType: !123, size: 8, offset: 128)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(name: "power_letter", scope: !279, file: !286, line: 36, type: !297, isLocal: true, isDefinition: true)
!279 = distinct !DICompileUnit(language: DW_LANG_C99, file: !280, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !281, retainedTypes: !282, globals: !283)
!280 = !DIFile(filename: "./lib/human.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!281 = !{!21, !5}
!282 = !{!184}
!283 = !{!277, !284, !291}
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(name: "block_size_args", scope: !279, file: !286, line: 398, type: !287, isLocal: true, isDefinition: true)
!286 = !DIFile(filename: "lib/human.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !288, size: 192, elements: !289)
!288 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !184)
!289 = !{!290}
!290 = !DISubrange(count: 3)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "block_size_opts", scope: !279, file: !286, line: 399, type: !293, isLocal: true, isDefinition: true)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 64, elements: !295)
!294 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!295 = !{!296}
!296 = !DISubrange(count: 2)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 72, elements: !298)
!298 = !{!299}
!299 = !DISubrange(count: 9)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(name: "program_name", scope: !302, file: !306, line: 33, type: !184, isDefinition: true)
!302 = distinct !DICompileUnit(language: DW_LANG_C99, file: !303, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !243, retainedTypes: !304, globals: !305)
!303 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!304 = !{!105, !103}
!305 = !{!300}
!306 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !309, file: !321, line: 85, type: !356, isDefinition: true)
!309 = distinct !DICompileUnit(language: DW_LANG_C99, file: !310, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !311, retainedTypes: !317, globals: !318)
!310 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!311 = !{!34, !312, !74}
!312 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !35, line: 242, baseType: !7, size: 32, elements: !313)
!313 = !{!314, !315, !316}
!314 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!315 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!316 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!317 = !{!109, !110, !106, !103}
!318 = !{!307, !319, !326, !338, !340, !345, !352, !354}
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !309, file: !321, line: 101, type: !322, isDefinition: true)
!321 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 320, elements: !324)
!323 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!324 = !{!325}
!325 = !DISubrange(count: 10)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !309, file: !321, line: 1052, type: !328, isDefinition: true)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !321, line: 65, size: 448, elements: !329)
!329 = !{!330, !331, !332, !336, !337}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !328, file: !321, line: 68, baseType: !34, size: 32)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !328, file: !321, line: 71, baseType: !109, size: 32, offset: 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !328, file: !321, line: 75, baseType: !333, size: 256, offset: 64)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !334)
!334 = !{!335}
!335 = !DISubrange(count: 8)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !328, file: !321, line: 78, baseType: !184, size: 64, offset: 320)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !328, file: !321, line: 81, baseType: !184, size: 64, offset: 384)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !309, file: !321, line: 116, type: !328, isLocal: true, isDefinition: true)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(name: "slot0", scope: !309, file: !321, line: 842, type: !342, isLocal: true, isDefinition: true)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 2048, elements: !343)
!343 = !{!344}
!344 = !DISubrange(count: 256)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(name: "slotvec", scope: !309, file: !321, line: 845, type: !347, isLocal: true, isDefinition: true)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !321, line: 834, size: 128, elements: !349)
!349 = !{!350, !351}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !348, file: !321, line: 836, baseType: !106, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !348, file: !321, line: 837, baseType: !103, size: 64, offset: 64)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "nslots", scope: !309, file: !321, line: 843, type: !109, isLocal: true, isDefinition: true)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "slotvec0", scope: !309, file: !321, line: 844, type: !348, isLocal: true, isDefinition: true)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !288, size: 704, elements: !357)
!357 = !{!358}
!358 = !DISubrange(count: 11)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !361, file: !364, line: 26, type: !365, isDefinition: true)
!361 = distinct !DICompileUnit(language: DW_LANG_C99, file: !362, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !243, globals: !363)
!362 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!363 = !{!359}
!364 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 376, elements: !366)
!366 = !{!367}
!367 = !DISubrange(count: 47)
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(name: "statvfs_works_cache", scope: !370, file: !371, line: 96, type: !109, isLocal: true, isDefinition: true)
!370 = distinct !DISubprogram(name: "statvfs_works", scope: !371, file: !371, line: 94, type: !372, isLocal: true, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: true, unit: !374, retainedNodes: !378)
!371 = !DIFile(filename: "lib/fsusage.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!372 = !DISubroutineType(types: !373)
!373 = !{!109}
!374 = distinct !DICompileUnit(language: DW_LANG_C99, file: !375, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !243, retainedTypes: !376, globals: !377)
!375 = !DIFile(filename: "./lib/fsusage.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!376 = !{!115}
!377 = !{!368}
!378 = !{!379}
!379 = !DILocalVariable(name: "name", scope: !370, file: !371, line: 97, type: !380)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utsname", file: !381, line: 48, size: 3120, elements: !382)
!381 = !DIFile(filename: "/usr/include/sys/utsname.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!382 = !{!383, !387, !388, !389, !390, !391}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "sysname", scope: !380, file: !381, line: 51, baseType: !384, size: 520)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 520, elements: !385)
!385 = !{!386}
!386 = !DISubrange(count: 65)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "nodename", scope: !380, file: !381, line: 54, baseType: !384, size: 520, offset: 520)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !380, file: !381, line: 57, baseType: !384, size: 520, offset: 1040)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !380, file: !381, line: 59, baseType: !384, size: 520, offset: 1560)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !380, file: !381, line: 62, baseType: !384, size: 520, offset: 2080)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "domainname", scope: !380, file: !381, line: 67, baseType: !384, size: 520, offset: 2600)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !394, file: !399, line: 69, type: !400, isDefinition: true)
!394 = distinct !DICompileUnit(language: DW_LANG_C99, file: !395, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !396, retainedTypes: !397, globals: !398)
!395 = !DIFile(filename: "./lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!396 = !{!34}
!397 = !{!105, !119}
!398 = !{!392}
!399 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !401, line: 55, baseType: !402)
!401 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DISubroutineType(types: !404)
!404 = !{null}
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !407, file: !408, line: 339, type: !109, isLocal: true, isDefinition: true)
!407 = distinct !DISubprogram(name: "rpl_fcntl", scope: !408, file: !408, line: 276, type: !409, isDefinition: true, scopeLine: 277, flags: DIFlagPrototyped, isOptimized: true, unit: !411, retainedNodes: !414)
!408 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!409 = !DISubroutineType(types: !410)
!410 = !{!109, !109, !109, null}
!411 = distinct !DICompileUnit(language: DW_LANG_C99, file: !412, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !243, globals: !413)
!412 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!413 = !{!405}
!414 = !{!415, !416, !417, !430, !431, !434, !437, !440}
!415 = !DILocalVariable(name: "fd", arg: 1, scope: !407, file: !408, line: 276, type: !109)
!416 = !DILocalVariable(name: "action", arg: 2, scope: !407, file: !408, line: 276, type: !109)
!417 = !DILocalVariable(name: "arg", scope: !407, file: !408, line: 278, type: !418)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !419, line: 30, baseType: !420)
!419 = !DIFile(filename: "/usr/lib/clang/7.0.0/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !412, line: 278, baseType: !421)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !422, size: 192, elements: !428)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !412, line: 278, size: 192, elements: !423)
!423 = !{!424, !425, !426, !427}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !422, file: !412, line: 278, baseType: !7, size: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !422, file: !412, line: 278, baseType: !7, size: 32, offset: 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !422, file: !412, line: 278, baseType: !105, size: 64, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !422, file: !412, line: 278, baseType: !105, size: 64, offset: 128)
!428 = !{!429}
!429 = !DISubrange(count: 1)
!430 = !DILocalVariable(name: "result", scope: !407, file: !408, line: 279, type: !109)
!431 = !DILocalVariable(name: "target", scope: !432, file: !408, line: 326, type: !109)
!432 = distinct !DILexicalBlock(scope: !433, file: !408, line: 325, column: 7)
!433 = distinct !DILexicalBlock(scope: !407, file: !408, line: 282, column: 5)
!434 = !DILocalVariable(name: "flags", scope: !435, file: !408, line: 363, type: !109)
!435 = distinct !DILexicalBlock(scope: !436, file: !408, line: 362, column: 11)
!436 = distinct !DILexicalBlock(scope: !432, file: !408, line: 361, column: 13)
!437 = !DILocalVariable(name: "saved_errno", scope: !438, file: !408, line: 366, type: !109)
!438 = distinct !DILexicalBlock(scope: !439, file: !408, line: 365, column: 15)
!439 = distinct !DILexicalBlock(scope: !435, file: !408, line: 364, column: 17)
!440 = !DILocalVariable(name: "p", scope: !441, file: !408, line: 408, type: !105)
!441 = distinct !DILexicalBlock(scope: !433, file: !408, line: 406, column: 7)
!442 = distinct !DICompileUnit(language: DW_LANG_C99, file: !443, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !396, retainedTypes: !444)
!443 = !DIFile(filename: "src/find-mount-point.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!444 = !{!103}
!445 = distinct !DICompileUnit(language: DW_LANG_C99, file: !446, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !447, retainedTypes: !448)
!446 = !DIFile(filename: "./lib/canonicalize.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!447 = !{!89}
!448 = !{!105}
!449 = distinct !DICompileUnit(language: DW_LANG_C99, file: !450, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !243)
!450 = !DIFile(filename: "./lib/dirname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!451 = distinct !DICompileUnit(language: DW_LANG_C99, file: !452, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !243)
!452 = !DIFile(filename: "./lib/dirname-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!453 = distinct !DICompileUnit(language: DW_LANG_C99, file: !454, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !243, retainedTypes: !444)
!454 = !DIFile(filename: "./lib/basename-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!455 = distinct !DICompileUnit(language: DW_LANG_C99, file: !456, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !243, retainedTypes: !304)
!456 = !DIFile(filename: "./lib/file-set.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!457 = distinct !DICompileUnit(language: DW_LANG_C99, file: !458, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !243)
!458 = !DIFile(filename: "./lib/hash-triple.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!459 = distinct !DICompileUnit(language: DW_LANG_C99, file: !460, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !243, retainedTypes: !376)
!460 = !DIFile(filename: "./lib/umaxtostr.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!461 = distinct !DICompileUnit(language: DW_LANG_C99, file: !462, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !463, retainedTypes: !464)
!462 = !DIFile(filename: "./lib/mbsalign.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!463 = !{!68, !96}
!464 = !{!105, !465}
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !466, line: 20, baseType: !7)
!466 = !DIFile(filename: "/usr/include/bits/types/wint_t.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!467 = distinct !DICompileUnit(language: DW_LANG_C99, file: !468, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !469, retainedTypes: !470)
!468 = !DIFile(filename: "./lib/mbswidth.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!469 = !{!74}
!470 = !{!106, !119, !109, !110}
!471 = distinct !DICompileUnit(language: DW_LANG_C99, file: !472, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !243)
!472 = !DIFile(filename: "./lib/same.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!473 = distinct !DICompileUnit(language: DW_LANG_C99, file: !474, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !243)
!474 = !DIFile(filename: "./lib/save-cwd.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!475 = distinct !DICompileUnit(language: DW_LANG_C99, file: !476, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !477, retainedTypes: !448)
!476 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!477 = !{!478}
!478 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !479, line: 41, baseType: !7, size: 32, elements: !480)
!479 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!480 = !{!481}
!481 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2018, isUnsigned: true)
!482 = distinct !DICompileUnit(language: DW_LANG_C99, file: !483, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !484, retainedTypes: !498)
!483 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!484 = !{!485}
!485 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !487, file: !486, line: 186, baseType: !7, size: 32, elements: !496)
!486 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!487 = distinct !DISubprogram(name: "x2nrealloc", scope: !486, file: !486, line: 174, type: !488, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: true, unit: !482, retainedNodes: !491)
!488 = !DISubroutineType(types: !489)
!489 = !{!105, !105, !490, !106}
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!491 = !{!492, !493, !494, !495}
!492 = !DILocalVariable(name: "p", arg: 1, scope: !487, file: !486, line: 174, type: !105)
!493 = !DILocalVariable(name: "pn", arg: 2, scope: !487, file: !486, line: 174, type: !490)
!494 = !DILocalVariable(name: "s", arg: 3, scope: !487, file: !486, line: 174, type: !106)
!495 = !DILocalVariable(name: "n", scope: !487, file: !486, line: 176, type: !106)
!496 = !{!497}
!497 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!498 = !{!106, !103, !105}
!499 = distinct !DICompileUnit(language: DW_LANG_C99, file: !500, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !243)
!500 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!501 = distinct !DICompileUnit(language: DW_LANG_C99, file: !502, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !243)
!502 = !DIFile(filename: "./lib/xgetcwd.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!503 = distinct !DICompileUnit(language: DW_LANG_C99, file: !504, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !505)
!504 = !DIFile(filename: "./lib/xstrtol-error.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!505 = !{!5}
!506 = distinct !DICompileUnit(language: DW_LANG_C99, file: !507, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !508, retainedTypes: !509)
!507 = !DIFile(filename: "./lib/xstrtoumax.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!508 = !{!5, !74}
!509 = !{!109, !110}
!510 = distinct !DICompileUnit(language: DW_LANG_C99, file: !511, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !243, retainedTypes: !448)
!511 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!512 = distinct !DICompileUnit(language: DW_LANG_C99, file: !513, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !243, retainedTypes: !304)
!513 = !DIFile(filename: "./lib/chdir-long.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!514 = distinct !DICompileUnit(language: DW_LANG_C99, file: !515, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !243, retainedTypes: !516)
!515 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!516 = !{!106}
!517 = distinct !DICompileUnit(language: DW_LANG_C99, file: !518, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !243, retainedTypes: !519)
!518 = !DIFile(filename: "./lib/mountlist.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!519 = !{!105, !113}
!520 = distinct !DICompileUnit(language: DW_LANG_C99, file: !521, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !243, retainedTypes: !448)
!521 = !DIFile(filename: "./lib/areadlink-with-size.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!522 = distinct !DICompileUnit(language: DW_LANG_C99, file: !523, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !243)
!523 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!524 = distinct !DICompileUnit(language: DW_LANG_C99, file: !525, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !243)
!525 = !DIFile(filename: "./lib/open-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!526 = distinct !DICompileUnit(language: DW_LANG_C99, file: !527, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !243)
!527 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!528 = distinct !DICompileUnit(language: DW_LANG_C99, file: !529, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !243)
!529 = !DIFile(filename: "./lib/hash-pjw.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!530 = distinct !DICompileUnit(language: DW_LANG_C99, file: !531, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !532, retainedTypes: !448)
!531 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!532 = !{!533}
!533 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !534, line: 41, baseType: !7, size: 32, elements: !535)
!534 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!535 = !{!536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918}
!536 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!537 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!538 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!539 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!540 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!541 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!542 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!543 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!544 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!545 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!546 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!547 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!548 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!549 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!550 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!551 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!552 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!553 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!554 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!555 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!556 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!557 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!558 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!559 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!560 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!561 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!562 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!563 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!564 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!565 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!566 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!567 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!568 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!569 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!570 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!571 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!572 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!573 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!574 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!575 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!576 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!577 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!578 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!579 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!580 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!581 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!582 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!583 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!584 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!585 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!586 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!587 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!588 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!589 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!590 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!591 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!592 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!593 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!594 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!595 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!596 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!597 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!598 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!599 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!600 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!601 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!602 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!603 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!604 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!605 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!606 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!607 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!608 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!609 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!610 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!611 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!612 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!613 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!614 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!615 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!616 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!617 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!618 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!619 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!620 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!621 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!622 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!623 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!624 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!625 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!626 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!627 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!628 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!629 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!630 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!631 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!632 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!633 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!634 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!635 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!636 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!637 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!644 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!647 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!648 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!649 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!650 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!651 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!652 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!653 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!654 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!655 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!656 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!657 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!658 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!661 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!662 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!663 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!664 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!665 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!666 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!667 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!668 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!669 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!670 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!671 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!672 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!673 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!674 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!675 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!676 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!677 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!678 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!679 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!680 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!681 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!682 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!683 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!684 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!685 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!686 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!687 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!688 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!689 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!690 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!691 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!692 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!693 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!694 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!695 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!696 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!697 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!698 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!699 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!700 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!701 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!702 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!703 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!704 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!705 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!706 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!707 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!708 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!709 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!710 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!711 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!712 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!713 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!714 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!715 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!716 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!717 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!719 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!720 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!721 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!722 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!723 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!724 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!725 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!726 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!727 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!728 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!729 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!730 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!731 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!732 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!733 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!734 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!735 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!736 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!737 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!738 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!739 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!740 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!741 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!742 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!743 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!744 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!745 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!746 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!747 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!748 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!749 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!750 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!751 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!752 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!753 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!754 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!755 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!756 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!757 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!758 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!759 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!760 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!761 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!762 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!763 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!764 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!765 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!766 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!767 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!768 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!769 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!770 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!771 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!772 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!773 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!774 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!779 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!780 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!781 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!782 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!783 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!784 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!785 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!786 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!787 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!788 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!789 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!790 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!791 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!793 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!794 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!795 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!796 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!797 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!798 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!799 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!800 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!801 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!802 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!803 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!804 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!805 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!806 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!807 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!808 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!809 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!810 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!811 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!812 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!813 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!814 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!815 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!816 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!817 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!818 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!819 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!820 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!821 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!822 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!823 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!824 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!825 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!826 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!827 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!828 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!829 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!830 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!831 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!832 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!833 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!834 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!835 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!836 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!837 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!838 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!839 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!840 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!841 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!842 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!843 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!844 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!845 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!846 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!847 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!851 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!852 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!853 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!854 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!855 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!860 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!861 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!862 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!863 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!884 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!885 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!886 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!887 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!894 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!895 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!896 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!898 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!899 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!900 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!901 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!902 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!903 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!904 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!905 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!906 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!907 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!908 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!909 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!910 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!911 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!912 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!913 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!914 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!915 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!916 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!917 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!918 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!919 = distinct !DICompileUnit(language: DW_LANG_C99, file: !920, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !243)
!920 = !DIFile(filename: "./lib/fd-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!921 = distinct !DICompileUnit(language: DW_LANG_C99, file: !922, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !243)
!922 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!923 = distinct !DICompileUnit(language: DW_LANG_C99, file: !924, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !243, retainedTypes: !448)
!924 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!925 = distinct !DICompileUnit(language: DW_LANG_C99, file: !926, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !243, retainedTypes: !448)
!926 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!927 = distinct !DICompileUnit(language: DW_LANG_C99, file: !928, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !243)
!928 = !DIFile(filename: "./lib/dup-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!929 = !{!"clang version 7.0.0 (tags/RELEASE_700/final)"}
!930 = !{i32 2, !"Dwarf Version", i32 4}
!931 = !{i32 2, !"Debug Info Version", i32 3}
!932 = !{i32 1, !"wchar_size", i32 4}
!933 = !{i32 7, !"PIC Level", i32 2}
!934 = !{i32 7, !"PIE Level", i32 2}
!935 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 1452, type: !936, isDefinition: true, scopeLine: 1453, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, retainedNodes: !938)
!936 = !DISubroutineType(types: !937)
!937 = !{null, !109}
!938 = !{!939}
!939 = !DILocalVariable(name: "status", arg: 1, scope: !935, file: !3, line: 1452, type: !109)
!940 = !DILocalVariable(name: "infomap", scope: !941, file: !942, line: 632, type: !956)
!941 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !942, file: !942, line: 630, type: !943, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !945)
!942 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!943 = !DISubroutineType(types: !944)
!944 = !{null, !184}
!945 = !{!946, !940, !947, !948, !955}
!946 = !DILocalVariable(name: "program", arg: 1, scope: !941, file: !942, line: 630, type: !184)
!947 = !DILocalVariable(name: "node", scope: !941, file: !942, line: 642, type: !184)
!948 = !DILocalVariable(name: "map_prog", scope: !941, file: !942, line: 643, type: !949)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !951)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !941, file: !942, line: 632, size: 128, elements: !952)
!952 = !{!953, !954}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !951, file: !942, line: 632, baseType: !184, size: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !951, file: !942, line: 632, baseType: !184, size: 64, offset: 64)
!955 = !DILocalVariable(name: "lc_messages", scope: !941, file: !942, line: 655, type: !184)
!956 = !DICompositeType(tag: DW_TAG_array_type, baseType: !950, size: 896, elements: !957)
!957 = !{!958}
!958 = !DISubrange(count: 7)
!959 = !DILocation(line: 632, column: 67, scope: !941, inlinedAt: !960)
!960 = distinct !DILocation(line: 1508, column: 7, scope: !961)
!961 = distinct !DILexicalBlock(scope: !962, file: !3, line: 1457, column: 5)
!962 = distinct !DILexicalBlock(scope: !935, file: !3, line: 1454, column: 7)
!963 = !DILocation(line: 1452, column: 12, scope: !935)
!964 = !DILocation(line: 1454, column: 14, scope: !962)
!965 = !DILocation(line: 1454, column: 7, scope: !935)
!966 = !DILocation(line: 1455, column: 5, scope: !967)
!967 = distinct !DILexicalBlock(scope: !962, file: !3, line: 1455, column: 5)
!968 = !{!969, !969, i64 0}
!969 = !{!"any pointer", !970, i64 0}
!970 = !{!"omnipotent char", !971, i64 0}
!971 = !{!"Simple C/C++ TBAA"}
!972 = !DILocation(line: 1458, column: 7, scope: !961)
!973 = !DILocation(line: 1459, column: 7, scope: !961)
!974 = !DILocation(line: 587, column: 3, scope: !975, inlinedAt: !976)
!975 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !942, file: !942, line: 585, type: !403, isLocal: true, isDefinition: true, scopeLine: 586, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !243)
!976 = distinct !DILocation(line: 1464, column: 7, scope: !961)
!977 = !DILocation(line: 1468, column: 7, scope: !961)
!978 = !DILocation(line: 1476, column: 7, scope: !961)
!979 = !DILocation(line: 1483, column: 7, scope: !961)
!980 = !DILocation(line: 1489, column: 7, scope: !961)
!981 = !DILocation(line: 1493, column: 7, scope: !961)
!982 = !DILocation(line: 1499, column: 7, scope: !961)
!983 = !DILocation(line: 1500, column: 7, scope: !961)
!984 = !DILocation(line: 604, column: 3, scope: !985, inlinedAt: !988)
!985 = distinct !DISubprogram(name: "emit_blocksize_note", scope: !942, file: !942, line: 602, type: !943, isLocal: true, isDefinition: true, scopeLine: 603, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !986)
!986 = !{!987}
!987 = !DILocalVariable(name: "program", arg: 1, scope: !985, file: !942, line: 602, type: !184)
!988 = distinct !DILocation(line: 1501, column: 7, scope: !961)
!989 = !DILocation(line: 595, column: 3, scope: !990, inlinedAt: !991)
!990 = distinct !DISubprogram(name: "emit_size_note", scope: !942, file: !942, line: 593, type: !403, isLocal: true, isDefinition: true, scopeLine: 594, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !243)
!991 = distinct !DILocation(line: 1502, column: 7, scope: !961)
!992 = !DILocation(line: 1503, column: 7, scope: !961)
!993 = !DILocation(line: 632, column: 3, scope: !941, inlinedAt: !960)
!994 = !DILocation(line: 643, column: 36, scope: !941, inlinedAt: !960)
!995 = !DILocation(line: 643, column: 25, scope: !941, inlinedAt: !960)
!996 = !DILocation(line: 645, column: 33, scope: !941, inlinedAt: !960)
!997 = !DILocation(line: 645, column: 3, scope: !941, inlinedAt: !960)
!998 = !DILocation(line: 646, column: 13, scope: !941, inlinedAt: !960)
!999 = !DILocation(line: 645, column: 20, scope: !941, inlinedAt: !960)
!1000 = !{!1001, !969, i64 0}
!1001 = !{!"infomap", !969, i64 0, !969, i64 8}
!1002 = !DILocation(line: 645, column: 10, scope: !941, inlinedAt: !960)
!1003 = !DILocation(line: 645, column: 28, scope: !941, inlinedAt: !960)
!1004 = distinct !{!1004, !1005, !1006}
!1005 = !DILocation(line: 645, column: 3, scope: !941)
!1006 = !DILocation(line: 646, column: 13, scope: !941)
!1007 = !DILocation(line: 648, column: 17, scope: !1008, inlinedAt: !960)
!1008 = distinct !DILexicalBlock(scope: !941, file: !942, line: 648, column: 7)
!1009 = !{!1001, !969, i64 8}
!1010 = !DILocation(line: 648, column: 7, scope: !1008, inlinedAt: !960)
!1011 = !DILocation(line: 648, column: 7, scope: !941, inlinedAt: !960)
!1012 = !DILocation(line: 642, column: 15, scope: !941, inlinedAt: !960)
!1013 = !DILocation(line: 651, column: 3, scope: !941, inlinedAt: !960)
!1014 = !DILocation(line: 655, column: 29, scope: !941, inlinedAt: !960)
!1015 = !DILocation(line: 655, column: 15, scope: !941, inlinedAt: !960)
!1016 = !DILocation(line: 656, column: 7, scope: !1017, inlinedAt: !960)
!1017 = distinct !DILexicalBlock(scope: !941, file: !942, line: 656, column: 7)
!1018 = !DILocation(line: 656, column: 19, scope: !1017, inlinedAt: !960)
!1019 = !DILocation(line: 656, column: 22, scope: !1017, inlinedAt: !960)
!1020 = !DILocation(line: 656, column: 7, scope: !941, inlinedAt: !960)
!1021 = !DILocation(line: 662, column: 7, scope: !1022, inlinedAt: !960)
!1022 = distinct !DILexicalBlock(scope: !1017, file: !942, line: 657, column: 5)
!1023 = !DILocation(line: 664, column: 5, scope: !1022, inlinedAt: !960)
!1024 = !DILocation(line: 665, column: 3, scope: !941, inlinedAt: !960)
!1025 = !DILocation(line: 667, column: 3, scope: !941, inlinedAt: !960)
!1026 = !DILocation(line: 669, column: 1, scope: !941, inlinedAt: !960)
!1027 = !DILocation(line: 1510, column: 3, scope: !935)
!1028 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 1514, type: !1029, isDefinition: true, scopeLine: 1515, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1031)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!109, !109, !222}
!1031 = !{!1032, !1033, !1034, !1071, !1072, !1073, !1075, !1076, !1079, !1081, !1082, !1086, !1090, !1096, !1099, !1100}
!1032 = !DILocalVariable(name: "argc", arg: 1, scope: !1028, file: !3, line: 1514, type: !109)
!1033 = !DILocalVariable(name: "argv", arg: 2, scope: !1028, file: !3, line: 1514, type: !222)
!1034 = !DILocalVariable(name: "stats", scope: !1028, file: !3, line: 1516, type: !1035)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !1037, line: 46, size: 1152, elements: !1038)
!1037 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!1038 = !{!1039, !1040, !1042, !1044, !1046, !1048, !1050, !1051, !1052, !1055, !1057, !1059, !1067, !1068, !1069}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1036, file: !1037, line: 48, baseType: !113, size: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1036, file: !1037, line: 53, baseType: !1041, size: 64, offset: 64)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !114, line: 146, baseType: !108)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1036, file: !1037, line: 61, baseType: !1043, size: 64, offset: 128)
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !114, line: 149, baseType: !108)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1036, file: !1037, line: 62, baseType: !1045, size: 32, offset: 192)
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !114, line: 148, baseType: !7)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1036, file: !1037, line: 64, baseType: !1047, size: 32, offset: 224)
!1047 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !114, line: 144, baseType: !7)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1036, file: !1037, line: 65, baseType: !1049, size: 32, offset: 256)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !114, line: 145, baseType: !7)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !1036, file: !1037, line: 67, baseType: !109, size: 32, offset: 288)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1036, file: !1037, line: 69, baseType: !113, size: 64, offset: 320)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1036, file: !1037, line: 74, baseType: !1053, size: 64, offset: 384)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !114, line: 150, baseType: !1054)
!1054 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1036, file: !1037, line: 78, baseType: !1056, size: 64, offset: 448)
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !114, line: 172, baseType: !1054)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1036, file: !1037, line: 80, baseType: !1058, size: 64, offset: 512)
!1058 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !114, line: 177, baseType: !1054)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1036, file: !1037, line: 91, baseType: !1060, size: 128, offset: 576)
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !1061, line: 9, size: 128, elements: !1062)
!1061 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!1062 = !{!1063, !1065}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1060, file: !1061, line: 11, baseType: !1064, size: 64)
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !114, line: 158, baseType: !1054)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1060, file: !1061, line: 12, baseType: !1066, size: 64, offset: 64)
!1066 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !114, line: 194, baseType: !1054)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !1036, file: !1037, line: 92, baseType: !1060, size: 128, offset: 704)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !1036, file: !1037, line: 93, baseType: !1060, size: 128, offset: 832)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !1036, file: !1037, line: 106, baseType: !1070, size: 192, offset: 960)
!1070 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1066, size: 192, elements: !289)
!1071 = !DILocalVariable(name: "posix_format", scope: !1028, file: !3, line: 1538, type: !123)
!1072 = !DILocalVariable(name: "msg_mut_excl", scope: !1028, file: !3, line: 1540, type: !184)
!1073 = !DILocalVariable(name: "oi", scope: !1074, file: !3, line: 1544, type: !109)
!1074 = distinct !DILexicalBlock(scope: !1028, file: !3, line: 1543, column: 5)
!1075 = !DILocalVariable(name: "c", scope: !1074, file: !3, line: 1545, type: !109)
!1076 = !DILocalVariable(name: "e", scope: !1077, file: !3, line: 1557, type: !5)
!1077 = distinct !DILexicalBlock(scope: !1078, file: !3, line: 1556, column: 11)
!1078 = distinct !DILexicalBlock(scope: !1074, file: !3, line: 1551, column: 9)
!1079 = !DILocalVariable(name: "match", scope: !1080, file: !3, line: 1680, type: !123)
!1080 = distinct !DILexicalBlock(scope: !1028, file: !3, line: 1679, column: 3)
!1081 = !DILocalVariable(name: "fs_incl", scope: !1080, file: !3, line: 1681, type: !140)
!1082 = !DILocalVariable(name: "fs_excl", scope: !1083, file: !3, line: 1684, type: !140)
!1083 = distinct !DILexicalBlock(scope: !1084, file: !3, line: 1683, column: 7)
!1084 = distinct !DILexicalBlock(scope: !1085, file: !3, line: 1682, column: 5)
!1085 = distinct !DILexicalBlock(scope: !1080, file: !3, line: 1682, column: 5)
!1086 = !DILocalVariable(name: "i", scope: !1087, file: !3, line: 1709, type: !109)
!1087 = distinct !DILexicalBlock(scope: !1088, file: !3, line: 1709, column: 7)
!1088 = distinct !DILexicalBlock(scope: !1089, file: !3, line: 1704, column: 5)
!1089 = distinct !DILexicalBlock(scope: !1028, file: !3, line: 1703, column: 7)
!1090 = !DILocalVariable(name: "fd", scope: !1091, file: !3, line: 1720, type: !109)
!1091 = distinct !DILexicalBlock(scope: !1092, file: !3, line: 1718, column: 13)
!1092 = distinct !DILexicalBlock(scope: !1093, file: !3, line: 1717, column: 20)
!1093 = distinct !DILexicalBlock(scope: !1094, file: !3, line: 1711, column: 15)
!1094 = distinct !DILexicalBlock(scope: !1095, file: !3, line: 1710, column: 9)
!1095 = distinct !DILexicalBlock(scope: !1087, file: !3, line: 1709, column: 7)
!1096 = !DILocalVariable(name: "status", scope: !1097, file: !3, line: 1740, type: !109)
!1097 = distinct !DILexicalBlock(scope: !1098, file: !3, line: 1735, column: 5)
!1098 = distinct !DILexicalBlock(scope: !1028, file: !3, line: 1734, column: 7)
!1099 = !DILocalVariable(name: "warning", scope: !1097, file: !3, line: 1749, type: !184)
!1100 = !DILocalVariable(name: "i", scope: !1101, file: !3, line: 1765, type: !109)
!1101 = distinct !DILexicalBlock(scope: !1102, file: !3, line: 1765, column: 7)
!1102 = distinct !DILexicalBlock(scope: !1103, file: !3, line: 1761, column: 5)
!1103 = distinct !DILexicalBlock(scope: !1028, file: !3, line: 1760, column: 7)
!1104 = !DILocalVariable(name: "buf", scope: !1105, file: !3, line: 519, type: !1128)
!1105 = distinct !DILexicalBlock(scope: !1106, file: !3, line: 518, column: 9)
!1106 = distinct !DILexicalBlock(scope: !1107, file: !3, line: 514, column: 11)
!1107 = distinct !DILexicalBlock(scope: !1108, file: !3, line: 510, column: 5)
!1108 = distinct !DILexicalBlock(scope: !1109, file: !3, line: 509, column: 3)
!1109 = distinct !DILexicalBlock(scope: !1110, file: !3, line: 509, column: 3)
!1110 = distinct !DISubprogram(name: "get_header", scope: !3, file: !3, line: 503, type: !403, isLocal: true, isDefinition: true, scopeLine: 504, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1111)
!1111 = !{!1112, !1113, !1114, !1104, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1127}
!1112 = !DILocalVariable(name: "col", scope: !1110, file: !3, line: 505, type: !106)
!1113 = !DILocalVariable(name: "cell", scope: !1107, file: !3, line: 511, type: !103)
!1114 = !DILocalVariable(name: "header", scope: !1107, file: !3, line: 512, type: !184)
!1115 = !DILocalVariable(name: "opts", scope: !1105, file: !3, line: 521, type: !109)
!1116 = !DILocalVariable(name: "q1000", scope: !1105, file: !3, line: 529, type: !115)
!1117 = !DILocalVariable(name: "q1024", scope: !1105, file: !3, line: 530, type: !115)
!1118 = !DILocalVariable(name: "divisible_by_1000", scope: !1105, file: !3, line: 531, type: !123)
!1119 = !DILocalVariable(name: "divisible_by_1024", scope: !1105, file: !3, line: 532, type: !123)
!1120 = !DILocalVariable(name: "num", scope: !1105, file: !3, line: 548, type: !103)
!1121 = !DILocalVariable(name: "buf", scope: !1122, file: !3, line: 559, type: !1124)
!1122 = distinct !DILexicalBlock(scope: !1123, file: !3, line: 558, column: 9)
!1123 = distinct !DILexicalBlock(scope: !1106, file: !3, line: 557, column: 16)
!1124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 168, elements: !1125)
!1125 = !{!1126}
!1126 = !DISubrange(count: 21)
!1127 = !DILocalVariable(name: "num", scope: !1122, file: !3, line: 560, type: !103)
!1128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 5216, elements: !1129)
!1129 = !{!1130}
!1130 = !DISubrange(count: 652)
!1131 = !DILocation(line: 519, column: 16, scope: !1105, inlinedAt: !1132)
!1132 = distinct !DILocation(line: 1758, column: 3, scope: !1028)
!1133 = !DILocation(line: 559, column: 16, scope: !1122, inlinedAt: !1132)
!1134 = !DILocation(line: 1514, column: 11, scope: !1028)
!1135 = !DILocation(line: 1514, column: 24, scope: !1028)
!1136 = !DILocation(line: 1519, column: 21, scope: !1028)
!1137 = !DILocation(line: 1519, column: 3, scope: !1028)
