source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.F_triple = type { i8*, i64, i64 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__fsid_t = type { [2 x i32] }
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.devlist = type { i64, %struct.mount_entry*, %struct.devlist* }
%struct.field_data_t = type { i32, i8*, i32, i8*, i64, i32, i8 }
%struct.field_values_t = type { i64, i64, i64, i64, i8, i64, i64, i8 }
%struct.fs_type_list = type { i8*, %struct.fs_type_list* }
%struct.fs_usage = type { i64, i64, i64, i64, i8, i64, i64 }
%struct.hash_entry = type { i8*, %struct.hash_entry* }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.infomap = type { i8*, i8* }
%struct.lconv = type { i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8 }

!57 = !DIEnumerator(name: "IUSED_FIELD", value: 7, isUnsigned: true)
!58 = !DIEnumerator(name: "IAVAIL_FIELD", value: 8, isUnsigned: true)
!59 = !DIEnumerator(name: "IPCENT_FIELD", value: 9, isUnsigned: true)
!60 = !DIEnumerator(name: "TARGET_FIELD", value: 10, isUnsigned: true)
!61 = !DIEnumerator(name: "FILE_FIELD", value: 11, isUnsigned: true)
!62 = !DIEnumerator(name: "INVALID_FIELD", value: 12, isUnsigned: true)
!63 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 160, baseType: !7, size: 32, elements: !64)
!64 = !{!65, !66, !67}
!65 = !DIEnumerator(name: "BLOCK_FLD", value: 0, isUnsigned: true)
!66 = !DIEnumerator(name: "INODE_FLD", value: 1, isUnsigned: true)
!67 = !DIEnumerator(name: "OTHER_FLD", value: 2, isUnsigned: true)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !69, line: 19, baseType: !7, size: 32, elements: !70)
!69 = !DIFile(filename: "./lib/mbsalign.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!70 = !{!71, !72, !73}
!71 = !DIEnumerator(name: "MBS_ALIGN_LEFT", value: 0, isUnsigned: true)
!72 = !DIEnumerator(name: "MBS_ALIGN_RIGHT", value: 1, isUnsigned: true)
!73 = !DIEnumerator(name: "MBS_ALIGN_CENTER", value: 2, isUnsigned: true)
!74 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "canonicalize_mode_t", file: !75, line: 28, baseType: !7, size: 32, elements: !76)
!75 = !DIFile(filename: "./lib/canonicalize.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!76 = !{!77, !78, !79, !80}
!77 = !DIEnumerator(name: "CAN_EXISTING", value: 0, isUnsigned: true)
!78 = !DIEnumerator(name: "CAN_ALL_BUT_LAST", value: 1, isUnsigned: true)
!79 = !DIEnumerator(name: "CAN_MISSING", value: 2, isUnsigned: true)
!80 = !DIEnumerator(name: "CAN_NOLINKS", value: 4, isUnsigned: true)
!81 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !69, line: 21, baseType: !7, size: 32, elements: !82)
!82 = !{!83, !84, !85, !86}
!83 = !DIEnumerator(name: "MBA_UNIBYTE_FALLBACK", value: 1, isUnsigned: true)
!84 = !DIEnumerator(name: "MBA_UNIBYTE_ONLY", value: 2, isUnsigned: true)
!85 = !DIEnumerator(name: "MBA_NO_LEFT_PAD", value: 4, isUnsigned: true)
!86 = !DIEnumerator(name: "MBA_NO_RIGHT_PAD", value: 8, isUnsigned: true)
!87 = !{!88, !90, !91, !94, !98, !101, !102}
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !92, line: 46, baseType: !93)
!92 = !DIFile(filename: "/usr/lib/clang/12.0.1/include/stddef.h", directory: "")
!93 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !95, line: 59, baseType: !96)
!95 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !97, line: 145, baseType: !93)
!97 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !99, line: 102, baseType: !100)
!99 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !97, line: 73, baseType: !93)
!101 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!102 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!103 = !{!104, !107, !109, !111, !114, !116, !118, !120, !0, !122, !129, !144, !146, !148, !160, !176, !178, !180, !196, !201, !203, !210, !214, !216}
!104 = !DIGlobalVariableExpression(var: !105, expr: !DIExpression())
!105 = distinct !DIGlobalVariable(name: "show_all_fs", scope: !2, file: !3, line: 65, type: !106, isLocal: true, isDefinition: true)
!106 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!107 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression())
!108 = distinct !DIGlobalVariable(name: "show_local_fs", scope: !2, file: !3, line: 68, type: !106, isLocal: true, isDefinition: true)
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "show_listed_fs", scope: !2, file: !3, line: 72, type: !106, isLocal: true, isDefinition: true)
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(name: "human_output_opts", scope: !2, file: !3, line: 75, type: !113, isLocal: true, isDefinition: true)
!113 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(name: "output_block_size", scope: !2, file: !3, line: 78, type: !98, isLocal: true, isDefinition: true)
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(name: "file_systems_processed", scope: !2, file: !3, line: 81, type: !106, isLocal: true, isDefinition: true)
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(name: "require_sync", scope: !2, file: !3, line: 87, type: !106, isLocal: true, isDefinition: true)
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(name: "exit_status", scope: !2, file: !3, line: 90, type: !113, isLocal: true, isDefinition: true)
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(name: "fs_exclude_list", scope: !2, file: !3, line: 116, type: !124, isLocal: true, isDefinition: true)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fs_type_list", file: !3, line: 94, size: 128, elements: !126)
!126 = !{!127, !128}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "fs_name", scope: !125, file: !3, line: 96, baseType: !88, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "fs_next", scope: !125, file: !3, line: 97, baseType: !124, size: 64, offset: 64)
!129 = !DIGlobalVariableExpression(var: !130, expr: !DIExpression())
!130 = distinct !DIGlobalVariable(name: "mount_list", scope: !2, file: !3, line: 119, type: !131, isLocal: true, isDefinition: true)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mount_entry", file: !133, line: 26, size: 448, elements: !134)
!133 = !DIFile(filename: "./lib/mountlist.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!134 = !{!135, !136, !137, !138, !139, !140, !141, !142, !143}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "me_devname", scope: !132, file: !133, line: 28, baseType: !88, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "me_mountdir", scope: !132, file: !133, line: 29, baseType: !88, size: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "me_mntroot", scope: !132, file: !133, line: 30, baseType: !88, size: 64, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "me_type", scope: !132, file: !133, line: 32, baseType: !88, size: 64, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "me_dev", scope: !132, file: !133, line: 33, baseType: !94, size: 64, offset: 256)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "me_dummy", scope: !132, file: !133, line: 34, baseType: !7, size: 1, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "me_remote", scope: !132, file: !133, line: 35, baseType: !7, size: 1, offset: 321, flags: DIFlagBitField, extraData: i64 320)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "me_type_malloced", scope: !132, file: !133, line: 36, baseType: !7, size: 1, offset: 322, flags: DIFlagBitField, extraData: i64 320)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "me_next", scope: !132, file: !133, line: 37, baseType: !131, size: 64, offset: 384)
!144 = !DIGlobalVariableExpression(var: !145, expr: !DIExpression())
!145 = distinct !DIGlobalVariable(name: "print_type", scope: !2, file: !3, line: 122, type: !106, isLocal: true, isDefinition: true)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(name: "print_grand_total", scope: !2, file: !3, line: 125, type: !106, isLocal: true, isDefinition: true)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(name: "grand_fsu", scope: !2, file: !3, line: 128, type: !150, isLocal: true, isDefinition: true)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fs_usage", file: !151, line: 27, size: 448, elements: !152)
!151 = !DIFile(filename: "./lib/fsusage.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!152 = !{!153, !154, !155, !156, !157, !158, !159}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "fsu_blocksize", scope: !150, file: !151, line: 29, baseType: !98, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "fsu_blocks", scope: !150, file: !151, line: 30, baseType: !98, size: 64, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "fsu_bfree", scope: !150, file: !151, line: 31, baseType: !98, size: 64, offset: 128)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "fsu_bavail", scope: !150, file: !151, line: 32, baseType: !98, size: 64, offset: 192)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "fsu_bavail_top_bit_set", scope: !150, file: !151, line: 33, baseType: !106, size: 8, offset: 256)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "fsu_files", scope: !150, file: !151, line: 34, baseType: !98, size: 64, offset: 320)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "fsu_ffree", scope: !150, file: !151, line: 35, baseType: !98, size: 64, offset: 384)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 257, type: !162, isLocal: true, isDefinition: true)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 4352, elements: !174)
!163 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !164)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !165, line: 50, size: 256, elements: !166)
!165 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!166 = !{!167, !170, !171, !173}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !164, file: !165, line: 52, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !89)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !164, file: !165, line: 55, baseType: !113, size: 32, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !164, file: !165, line: 56, baseType: !172, size: 64, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !164, file: !165, line: 57, baseType: !113, size: 32, offset: 192)
!174 = !{!175}
!175 = !DISubrange(count: 17)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(name: "header_mode", scope: !2, file: !3, line: 139, type: !113, isLocal: true, isDefinition: true)
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(name: "ncolumns", scope: !2, file: !3, line: 226, type: !91, isLocal: true, isDefinition: true)
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(name: "columns", scope: !2, file: !3, line: 223, type: !182, isLocal: true, isDefinition: true)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "field_data_t", file: !3, line: 168, size: 384, elements: !185)
!185 = !{!186, !188, !189, !191, !192, !193, !195}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !184, file: !3, line: 170, baseType: !187, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "display_field_t", file: !3, line: 157, baseType: !48)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !184, file: !3, line: 171, baseType: !168, size: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "field_type", scope: !184, file: !3, line: 172, baseType: !190, size: 32, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "field_type_t", file: !3, line: 165, baseType: !63)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "caption", scope: !184, file: !3, line: 173, baseType: !168, size: 64, offset: 192)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !184, file: !3, line: 174, baseType: !91, size: 64, offset: 256)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !184, file: !3, line: 175, baseType: !194, size: 32, offset: 320)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbs_align_t", file: !69, line: 19, baseType: !68)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !184, file: !3, line: 176, baseType: !106, size: 8, offset: 352)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "field_data", scope: !2, file: !3, line: 180, type: !198, isLocal: true, isDefinition: true)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 4608, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 12)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "all_args_string", scope: !2, file: !3, line: 218, type: !168, isLocal: true, isDefinition: true)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(name: "tty_out", scope: !205, file: !3, line: 334, type: !113, isLocal: true, isDefinition: true)
!205 = distinct !DISubprogram(name: "replace_problematic_chars", scope: !3, file: !3, line: 332, type: !206, scopeLine: 333, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !208)
!206 = !DISubroutineType(types: !207)
!207 = !{null, !88}
!208 = !{!209}
!209 = !DILocalVariable(name: "cell", arg: 1, scope: !205, file: !3, line: 332, type: !88)
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(name: "table", scope: !2, file: !3, line: 242, type: !212, isLocal: true, isDefinition: true)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(name: "nrows", scope: !2, file: !3, line: 245, type: !91, isLocal: true, isDefinition: true)
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "devlist_table", scope: !2, file: !3, line: 61, type: !218, isLocal: true, isDefinition: true)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !220, line: 69, baseType: !221)
!220 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!221 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !220, line: 67, flags: DIFlagFwdDecl)
!222 = !DIGlobalVariableExpression(var: !105, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!223 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!224 = !DIGlobalVariableExpression(var: !145, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!225 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!226 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!227 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!228 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!229 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(name: "Version", scope: !232, file: !233, line: 2, type: !168, isDefinition: true)
!232 = distinct !DICompileUnit(language: DW_LANG_C99, file: !233, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !234, globals: !235, nameTableKind: None)
!233 = !DIFile(filename: "src/version.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!234 = !{}
!235 = !{!230}
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(name: "file_name", scope: !238, file: !239, line: 46, type: !168, isLocal: true, isDefinition: true)
!238 = distinct !DICompileUnit(language: DW_LANG_C99, file: !239, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !234, globals: !240, nameTableKind: None)
!239 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!240 = !{!236, !241}
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !238, file: !239, line: 56, type: !106, isLocal: true, isDefinition: true)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(name: "exit_failure", scope: !245, file: !246, line: 24, type: !248, isDefinition: true)
!245 = distinct !DICompileUnit(language: DW_LANG_C99, file: !246, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !234, globals: !247, nameTableKind: None)
!246 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!247 = !{!243}
!248 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !113)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(name: "default_tuning", scope: !251, file: !252, line: 130, type: !255, isLocal: true, isDefinition: true)
!251 = distinct !DICompileUnit(language: DW_LANG_C99, file: !252, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !234, retainedTypes: !253, globals: !254, nameTableKind: None)
!252 = !DIFile(filename: "lib/hash.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!253 = !{!93, !90, !91}
!254 = !{!249}
!255 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !256)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !220, line: 65, baseType: !257)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !220, line: 53, size: 160, elements: !258)
!258 = !{!259, !261, !262, !263, !264}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !257, file: !220, line: 58, baseType: !260, size: 32)
!260 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !257, file: !220, line: 59, baseType: !260, size: 32, offset: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !257, file: !220, line: 60, baseType: !260, size: 32, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !257, file: !220, line: 61, baseType: !260, size: 32, offset: 96)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !257, file: !220, line: 62, baseType: !106, size: 8, offset: 128)
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(name: "power_letter", scope: !267, file: !268, line: 36, type: !286, isLocal: true, isDefinition: true)
!267 = distinct !DICompileUnit(language: DW_LANG_C99, file: !268, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !269, retainedTypes: !270, globals: !273, nameTableKind: None)
!268 = !DIFile(filename: "lib/human.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!269 = !{!21, !5}
!270 = !{!271}
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!273 = !{!265, !274, !280}
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(name: "block_size_args", scope: !267, file: !268, line: 398, type: !276, isLocal: true, isDefinition: true)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !277, size: 192, elements: !278)
!277 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !168)
!278 = !{!279}
!279 = !DISubrange(count: 3)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "block_size_opts", scope: !267, file: !268, line: 399, type: !282, isLocal: true, isDefinition: true)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !283, size: 64, elements: !284)
!283 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !113)
!284 = !{!285}
!285 = !DISubrange(count: 2)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 72, elements: !287)
!287 = !{!288}
!288 = !DISubrange(count: 9)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(name: "program_name", scope: !291, file: !292, line: 33, type: !168, isDefinition: true)
!291 = distinct !DICompileUnit(language: DW_LANG_C99, file: !292, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !234, retainedTypes: !293, globals: !294, nameTableKind: None)
!292 = !DIFile(filename: "lib/progname.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!293 = !{!90, !88}
!294 = !{!289}
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !297, file: !298, line: 85, type: !359, isDefinition: true)
!297 = distinct !DICompileUnit(language: DW_LANG_C99, file: !298, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !299, retainedTypes: !320, globals: !322, nameTableKind: None)
!298 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!299 = !{!34, !300, !305}
!300 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !35, line: 242, baseType: !7, size: 32, elements: !301)
!301 = !{!302, !303, !304}
!302 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!303 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!304 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!305 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !306, line: 46, baseType: !7, size: 32, elements: !307)
!306 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!307 = !{!308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319}
!308 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!309 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!310 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!311 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!312 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!313 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!314 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!315 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!316 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!317 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!318 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!319 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!320 = !{!113, !321, !91, !88}
!321 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!322 = !{!295, !323, !329, !341, !343, !348, !355, !357}
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !297, file: !298, line: 101, type: !325, isDefinition: true)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !326, size: 320, elements: !327)
!326 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!327 = !{!328}
!328 = !DISubrange(count: 10)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !297, file: !298, line: 1052, type: !331, isDefinition: true)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !298, line: 65, size: 448, elements: !332)
!332 = !{!333, !334, !335, !339, !340}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !331, file: !298, line: 68, baseType: !34, size: 32)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !331, file: !298, line: 71, baseType: !113, size: 32, offset: 32)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !331, file: !298, line: 75, baseType: !336, size: 256, offset: 64)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !337)
!337 = !{!338}
!338 = !DISubrange(count: 8)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !331, file: !298, line: 78, baseType: !168, size: 64, offset: 320)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !331, file: !298, line: 81, baseType: !168, size: 64, offset: 384)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !297, file: !298, line: 116, type: !331, isLocal: true, isDefinition: true)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "slot0", scope: !297, file: !298, line: 842, type: !345, isLocal: true, isDefinition: true)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 2048, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 256)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "slotvec", scope: !297, file: !298, line: 845, type: !350, isLocal: true, isDefinition: true)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !298, line: 834, size: 128, elements: !352)
!352 = !{!353, !354}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !351, file: !298, line: 836, baseType: !91, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !351, file: !298, line: 837, baseType: !88, size: 64, offset: 64)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(name: "nslots", scope: !297, file: !298, line: 843, type: !113, isLocal: true, isDefinition: true)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(name: "slotvec0", scope: !297, file: !298, line: 844, type: !351, isLocal: true, isDefinition: true)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !277, size: 704, elements: !360)
!360 = !{!361}
!361 = !DISubrange(count: 11)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !364, file: !365, line: 26, type: !367, isDefinition: true)
!364 = distinct !DICompileUnit(language: DW_LANG_C99, file: !365, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !234, globals: !366, nameTableKind: None)
!365 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!366 = !{!362}
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 376, elements: !368)
!368 = !{!369}
!369 = !DISubrange(count: 47)
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(name: "statvfs_works_cache", scope: !372, file: !373, line: 93, type: !113, isLocal: true, isDefinition: true)
!372 = distinct !DISubprogram(name: "statvfs_works", scope: !373, file: !373, line: 91, type: !374, scopeLine: 92, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !376, retainedNodes: !379)
!373 = !DIFile(filename: "lib/fsusage.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!374 = !DISubroutineType(types: !375)
!375 = !{!113}
!376 = distinct !DICompileUnit(language: DW_LANG_C99, file: !373, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !234, retainedTypes: !377, globals: !378, nameTableKind: None)
!377 = !{!98}
!378 = !{!370}
!379 = !{!380}
!380 = !DILocalVariable(name: "name", scope: !372, file: !373, line: 94, type: !381)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utsname", file: !382, line: 48, size: 3120, elements: !383)
!382 = !DIFile(filename: "/usr/include/sys/utsname.h", directory: "")
!383 = !{!384, !388, !389, !390, !391, !392}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "sysname", scope: !381, file: !382, line: 51, baseType: !385, size: 520)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 520, elements: !386)
!386 = !{!387}
!387 = !DISubrange(count: 65)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "nodename", scope: !381, file: !382, line: 54, baseType: !385, size: 520, offset: 520)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !381, file: !382, line: 57, baseType: !385, size: 520, offset: 1040)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !381, file: !382, line: 59, baseType: !385, size: 520, offset: 1560)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !381, file: !382, line: 62, baseType: !385, size: 520, offset: 2080)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "domainname", scope: !381, file: !382, line: 67, baseType: !385, size: 520, offset: 2600)
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !395, file: !396, line: 67, type: !400, isDefinition: true)
!395 = distinct !DICompileUnit(language: DW_LANG_C99, file: !396, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !397, retainedTypes: !398, globals: !399, nameTableKind: None)
!396 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!397 = !{!34}
!398 = !{!90, !168, !102}
!399 = !{!393}
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !401, line: 61, baseType: !402)
!401 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DISubroutineType(types: !404)
!404 = !{null}
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !407, file: !408, line: 507, type: !113, isLocal: true, isDefinition: true)
!407 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !408, file: !408, line: 488, type: !409, scopeLine: 489, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !411, retainedNodes: !413)
!408 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!409 = !DISubroutineType(types: !410)
!410 = !{!113, !113, !113}
!411 = distinct !DICompileUnit(language: DW_LANG_C99, file: !408, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !234, globals: !412, nameTableKind: None)
!412 = !{!405}
!413 = !{!414, !415, !416, !417, !420}
!414 = !DILocalVariable(name: "fd", arg: 1, scope: !407, file: !408, line: 488, type: !113)
!415 = !DILocalVariable(name: "target", arg: 2, scope: !407, file: !408, line: 488, type: !113)
!416 = !DILocalVariable(name: "result", scope: !407, file: !408, line: 490, type: !113)
!417 = !DILocalVariable(name: "flags", scope: !418, file: !408, line: 531, type: !113)
!418 = distinct !DILexicalBlock(scope: !419, file: !408, line: 530, column: 5)
!419 = distinct !DILexicalBlock(scope: !407, file: !408, line: 529, column: 7)
!420 = !DILocalVariable(name: "saved_errno", scope: !421, file: !408, line: 534, type: !113)
!421 = distinct !DILexicalBlock(scope: !422, file: !408, line: 533, column: 9)
!422 = distinct !DILexicalBlock(scope: !418, file: !408, line: 532, column: 11)
!423 = distinct !DICompileUnit(language: DW_LANG_C99, file: !424, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !397, retainedTypes: !425, nameTableKind: None)
!424 = !DIFile(filename: "src/find-mount-point.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!425 = !{!88}
!426 = distinct !DICompileUnit(language: DW_LANG_C99, file: !427, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !234, nameTableKind: None)
!427 = !DIFile(filename: "lib/c-ctype.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!428 = distinct !DICompileUnit(language: DW_LANG_C99, file: !429, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !430, retainedTypes: !431, nameTableKind: None)
!429 = !DIFile(filename: "lib/canonicalize.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!430 = !{!74}
!431 = !{!90}
!432 = distinct !DICompileUnit(language: DW_LANG_C99, file: !433, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !234, nameTableKind: None)
!433 = !DIFile(filename: "lib/dirname.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!434 = distinct !DICompileUnit(language: DW_LANG_C99, file: !435, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !234, nameTableKind: None)
!435 = !DIFile(filename: "lib/dirname-lgpl.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!436 = distinct !DICompileUnit(language: DW_LANG_C99, file: !437, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !234, retainedTypes: !425, nameTableKind: None)
!437 = !DIFile(filename: "lib/basename-lgpl.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!438 = distinct !DICompileUnit(language: DW_LANG_C99, file: !439, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !234, retainedTypes: !293, nameTableKind: None)
!439 = !DIFile(filename: "lib/file-set.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!440 = distinct !DICompileUnit(language: DW_LANG_C99, file: !441, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !234, nameTableKind: None)
!441 = !DIFile(filename: "lib/hash-triple.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!442 = distinct !DICompileUnit(language: DW_LANG_C99, file: !443, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !234, retainedTypes: !377, nameTableKind: None)
!443 = !DIFile(filename: "lib/umaxtostr.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!444 = distinct !DICompileUnit(language: DW_LANG_C99, file: !445, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !446, retainedTypes: !447, nameTableKind: None)
!445 = !DIFile(filename: "lib/mbsalign.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!446 = !{!68, !81}
!447 = !{!90, !448}
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !449, line: 20, baseType: !7)
!449 = !DIFile(filename: "/usr/include/bits/types/wint_t.h", directory: "")
!450 = distinct !DICompileUnit(language: DW_LANG_C99, file: !451, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !452, retainedTypes: !453, nameTableKind: None)
!451 = !DIFile(filename: "lib/mbswidth.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!452 = !{!305}
!453 = !{!91, !102, !113, !321}
!454 = distinct !DICompileUnit(language: DW_LANG_C99, file: !455, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !234, nameTableKind: None)
!455 = !DIFile(filename: "lib/same.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!456 = distinct !DICompileUnit(language: DW_LANG_C99, file: !457, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !234, nameTableKind: None)
!457 = !DIFile(filename: "lib/save-cwd.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!458 = distinct !DICompileUnit(language: DW_LANG_C99, file: !459, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !460, retainedTypes: !431, nameTableKind: None)
!459 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!460 = !{!461}
!461 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !459, line: 40, baseType: !7, size: 32, elements: !462)
!462 = !{!463}
!463 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!464 = distinct !DICompileUnit(language: DW_LANG_C99, file: !465, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !466, retainedTypes: !480, nameTableKind: None)
!465 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!466 = !{!467}
!467 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !469, file: !468, line: 186, baseType: !7, size: 32, elements: !478)
!468 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!469 = distinct !DISubprogram(name: "x2nrealloc", scope: !468, file: !468, line: 174, type: !470, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !464, retainedNodes: !473)
!470 = !DISubroutineType(types: !471)
!471 = !{!90, !90, !472, !91}
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!473 = !{!474, !475, !476, !477}
!474 = !DILocalVariable(name: "p", arg: 1, scope: !469, file: !468, line: 174, type: !90)
!475 = !DILocalVariable(name: "pn", arg: 2, scope: !469, file: !468, line: 174, type: !472)
!476 = !DILocalVariable(name: "s", arg: 3, scope: !469, file: !468, line: 174, type: !91)
!477 = !DILocalVariable(name: "n", scope: !469, file: !468, line: 176, type: !91)
!478 = !{!479}
!479 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!480 = !{!91, !88, !90}
!481 = distinct !DICompileUnit(language: DW_LANG_C99, file: !482, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !234, nameTableKind: None)
!482 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!483 = distinct !DICompileUnit(language: DW_LANG_C99, file: !484, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !234, nameTableKind: None)
!484 = !DIFile(filename: "lib/xgetcwd.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!485 = distinct !DICompileUnit(language: DW_LANG_C99, file: !486, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !487, nameTableKind: None)
!486 = !DIFile(filename: "lib/xstrtol-error.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!487 = !{!5}
!488 = distinct !DICompileUnit(language: DW_LANG_C99, file: !489, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !490, retainedTypes: !491, nameTableKind: None)
!489 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!490 = !{!5, !305}
!491 = !{!113, !321}
!492 = distinct !DICompileUnit(language: DW_LANG_C99, file: !493, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !234, retainedTypes: !431, nameTableKind: None)
!493 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!494 = distinct !DICompileUnit(language: DW_LANG_C99, file: !495, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !234, retainedTypes: !293, nameTableKind: None)
!495 = !DIFile(filename: "lib/chdir-long.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!496 = distinct !DICompileUnit(language: DW_LANG_C99, file: !497, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !234, retainedTypes: !498, nameTableKind: None)
!497 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!498 = !{!91}
!499 = distinct !DICompileUnit(language: DW_LANG_C99, file: !500, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !234, retainedTypes: !501, nameTableKind: None)
!500 = !DIFile(filename: "lib/mountlist.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!501 = !{!90, !96}
!502 = distinct !DICompileUnit(language: DW_LANG_C99, file: !503, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !504, retainedTypes: !431, nameTableKind: None)
!503 = !DIFile(filename: "lib/areadlink-with-size.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!504 = !{!505}
!505 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !506, file: !503, line: 64, baseType: !7, size: 32, elements: !537)
!506 = distinct !DISubprogram(name: "areadlink_with_size", scope: !503, file: !503, line: 53, type: !507, scopeLine: 54, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !502, retainedNodes: !509)
!507 = !DISubroutineType(types: !508)
!508 = !{!88, !168, !91}
!509 = !{!510, !511, !512, !513, !514, !515, !516, !521, !522, !526, !527, !528, !531}
!510 = !DILocalVariable(name: "file", arg: 1, scope: !506, file: !503, line: 53, type: !168)
!511 = !DILocalVariable(name: "size", arg: 2, scope: !506, file: !503, line: 53, type: !91)
!512 = !DILocalVariable(name: "symlink_max", scope: !506, file: !503, line: 58, type: !91)
!513 = !DILocalVariable(name: "INITIAL_LIMIT_BOUND", scope: !506, file: !503, line: 59, type: !91)
!514 = !DILocalVariable(name: "initial_limit", scope: !506, file: !503, line: 60, type: !91)
!515 = !DILocalVariable(name: "buf_size", scope: !506, file: !503, line: 67, type: !91)
!516 = !DILocalVariable(name: "r", scope: !517, file: !503, line: 72, type: !518)
!517 = distinct !DILexicalBlock(scope: !506, file: !503, line: 71, column: 5)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !95, line: 108, baseType: !519)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !97, line: 194, baseType: !520)
!520 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!521 = !DILocalVariable(name: "link_length", scope: !517, file: !503, line: 73, type: !91)
!522 = !DILocalVariable(name: "stackbuf", scope: !517, file: !503, line: 74, type: !523)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 1024, elements: !524)
!524 = !{!525}
!525 = !DISubrange(count: 128)
!526 = !DILocalVariable(name: "buf", scope: !517, file: !503, line: 75, type: !88)
!527 = !DILocalVariable(name: "buffer", scope: !517, file: !503, line: 76, type: !88)
!528 = !DILocalVariable(name: "saved_errno", scope: !529, file: !503, line: 92, type: !113)
!529 = distinct !DILexicalBlock(scope: !530, file: !503, line: 91, column: 9)
!530 = distinct !DILexicalBlock(scope: !517, file: !503, line: 90, column: 11)
!531 = !DILocalVariable(name: "shrinked_buffer", scope: !532, file: !503, line: 110, type: !88)
!532 = distinct !DILexicalBlock(scope: !533, file: !503, line: 108, column: 13)
!533 = distinct !DILexicalBlock(scope: !534, file: !503, line: 107, column: 20)
!534 = distinct !DILexicalBlock(scope: !535, file: !503, line: 101, column: 15)
!535 = distinct !DILexicalBlock(scope: !536, file: !503, line: 99, column: 9)
!536 = distinct !DILexicalBlock(scope: !517, file: !503, line: 98, column: 11)
!537 = !{!538}
!538 = !DIEnumerator(name: "stackbuf_size", value: 128, isUnsigned: true)
!539 = distinct !DICompileUnit(language: DW_LANG_C99, file: !540, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !234, nameTableKind: None)
!540 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!541 = distinct !DICompileUnit(language: DW_LANG_C99, file: !542, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !234, nameTableKind: None)
!542 = !DIFile(filename: "lib/open-safer.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!543 = distinct !DICompileUnit(language: DW_LANG_C99, file: !544, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !234, nameTableKind: None)
!544 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!545 = distinct !DICompileUnit(language: DW_LANG_C99, file: !546, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !234, nameTableKind: None)
!546 = !DIFile(filename: "lib/hash-pjw.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!547 = distinct !DICompileUnit(language: DW_LANG_C99, file: !548, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !549, retainedTypes: !431, nameTableKind: None)
!548 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!549 = !{!550}
!550 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !551, line: 41, baseType: !7, size: 32, elements: !552)
!551 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!552 = !{!553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935}
!553 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!554 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!555 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!556 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!557 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!558 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!559 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!560 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!561 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!562 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!563 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!564 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!565 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!566 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!567 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!568 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!569 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!570 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!571 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!572 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!573 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!574 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!575 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!576 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!577 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!578 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!579 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!580 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!581 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!582 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!583 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!584 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!585 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!586 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!587 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!588 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!589 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!590 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!591 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!592 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!593 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!594 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!595 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!596 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!597 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!598 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!599 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!600 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!601 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!602 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!603 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!604 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!605 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!606 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!607 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!608 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!609 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!610 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!611 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!612 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!613 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!614 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!615 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!616 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!617 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!618 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!619 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!620 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!621 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!622 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!623 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!624 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!625 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!626 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!627 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!628 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!629 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!630 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!631 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!632 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!633 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!634 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!635 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!636 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!637 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!661 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!662 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!663 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!664 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!665 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!666 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!667 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!668 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!669 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!670 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!671 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!672 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!673 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!674 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!675 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!676 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!677 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!678 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!679 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!680 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!681 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!682 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!683 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!684 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!685 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!686 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!687 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!688 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!689 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!690 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!691 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!692 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!693 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!694 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!695 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!696 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!697 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!698 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!699 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!700 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!701 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!702 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!703 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!704 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!705 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!706 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!707 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!708 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!709 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!710 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!711 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!712 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!713 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!714 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!715 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!716 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!717 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!719 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!720 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!721 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!722 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!723 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!724 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!725 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!726 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!727 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!728 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!729 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!730 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!731 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!732 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!733 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!734 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!735 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!736 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!737 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!738 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!739 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!740 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!741 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!742 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!743 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!744 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!745 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!746 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!747 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!748 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!749 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!750 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!751 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!752 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!753 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!754 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!755 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!756 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!757 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!758 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!759 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!760 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!761 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!762 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!763 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!764 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!765 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!766 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!767 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!768 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!769 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!770 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!771 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!772 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!773 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!774 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!779 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!780 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!781 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!782 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!783 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!784 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!785 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!786 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!787 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!788 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!789 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!790 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!791 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!793 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!794 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!795 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!796 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!797 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!798 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!799 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!800 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!801 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!802 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!803 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!804 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!805 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!806 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!807 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!808 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!809 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!810 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!812 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!813 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!814 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!815 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!816 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!817 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!818 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!819 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!820 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!821 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!822 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!823 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!824 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!825 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!826 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!827 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!828 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!829 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!830 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!831 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!832 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!833 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!834 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!835 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!836 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!837 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!838 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!839 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!840 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!841 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!842 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!843 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!844 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!845 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!846 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!847 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!868 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!869 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!870 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!871 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!872 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!877 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!878 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!879 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!880 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!884 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!885 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!886 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!887 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!894 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!895 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!896 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!898 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!899 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!900 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!901 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!902 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!903 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!904 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!905 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!906 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!907 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!908 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!909 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!910 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!911 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!912 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!913 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!914 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!915 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!916 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!917 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!918 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!919 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!920 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!921 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!922 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!923 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!924 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!925 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!926 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!927 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!928 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!929 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!930 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!931 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!932 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!933 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!934 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!935 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!936 = distinct !DICompileUnit(language: DW_LANG_C99, file: !937, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !234, retainedTypes: !431, nameTableKind: None)
!937 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!938 = distinct !DICompileUnit(language: DW_LANG_C99, file: !939, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !234, nameTableKind: None)
!939 = !DIFile(filename: "lib/fd-safer.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!940 = distinct !DICompileUnit(language: DW_LANG_C99, file: !941, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !234, nameTableKind: None)
!941 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!942 = distinct !DICompileUnit(language: DW_LANG_C99, file: !943, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !234, retainedTypes: !431, nameTableKind: None)
!943 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!944 = distinct !DICompileUnit(language: DW_LANG_C99, file: !945, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !234, retainedTypes: !431, nameTableKind: None)
!945 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!946 = distinct !DICompileUnit(language: DW_LANG_C99, file: !947, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !234, nameTableKind: None)
!947 = !DIFile(filename: "lib/dup-safer.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!948 = !{!"clang version 12.0.1"}
!949 = !{i32 7, !"Dwarf Version", i32 4}
!950 = !{i32 2, !"Debug Info Version", i32 3}
!951 = !{i32 1, !"wchar_size", i32 4}
!952 = !{i32 7, !"PIC Level", i32 2}
!953 = !{i32 7, !"PIE Level", i32 2}
!954 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 1505, type: !955, scopeLine: 1506, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !957)
!955 = !DISubroutineType(types: !956)
!956 = !{null, !113}
!957 = !{!958}
!958 = !DILocalVariable(name: "status", arg: 1, scope: !954, file: !3, line: 1505, type: !113)
!959 = !DILocation(scope: !954)
!960 = !DILocation(line: 1507, column: 14, scope: !961)
!961 = distinct !DILexicalBlock(scope: !954, file: !3, line: 1507, column: 7)
!962 = !DILocation(line: 1507, column: 7, scope: !954)
!963 = !DILocation(line: 1508, column: 5, scope: !964)
!964 = distinct !DILexicalBlock(scope: !961, file: !3, line: 1508, column: 5)
!965 = !{!966, !966, i64 0}
!966 = !{!"any pointer", !967, i64 0}
!967 = !{!"omnipotent char", !968, i64 0}
!968 = !{!"Simple C/C++ TBAA"}
!969 = !DILocation(line: 1511, column: 7, scope: !970)
!970 = distinct !DILexicalBlock(scope: !961, file: !3, line: 1510, column: 5)
!971 = !DILocation(line: 1512, column: 7, scope: !970)
!972 = !DILocation(line: 590, column: 3, scope: !973, inlinedAt: !975)
!973 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !974, file: !974, line: 588, type: !403, scopeLine: 589, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !234)
!974 = !DIFile(filename: "src/system.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!975 = distinct !DILocation(line: 1517, column: 7, scope: !970)
!976 = !DILocation(line: 1521, column: 7, scope: !970)
!977 = !DILocation(line: 1529, column: 7, scope: !970)
!978 = !DILocation(line: 1536, column: 7, scope: !970)
!979 = !DILocation(line: 1542, column: 7, scope: !970)
!980 = !DILocation(line: 1546, column: 7, scope: !970)
!981 = !DILocation(line: 1552, column: 7, scope: !970)
!982 = !DILocation(line: 1553, column: 7, scope: !970)
!983 = !DILocalVariable(name: "program", arg: 1, scope: !984, file: !974, line: 606, type: !168)
!984 = distinct !DISubprogram(name: "emit_blocksize_note", scope: !974, file: !974, line: 606, type: !985, scopeLine: 607, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !987)
!985 = !DISubroutineType(types: !986)
!986 = !{null, !168}
!987 = !{!983}
!988 = !DILocation(scope: !984, inlinedAt: !989)
!989 = distinct !DILocation(line: 1554, column: 7, scope: !970)
!990 = !DILocation(line: 608, column: 3, scope: !984, inlinedAt: !989)
!991 = !DILocation(line: 598, column: 3, scope: !992, inlinedAt: !993)
!992 = distinct !DISubprogram(name: "emit_size_note", scope: !974, file: !974, line: 596, type: !403, scopeLine: 597, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !234)
!993 = distinct !DILocation(line: 1555, column: 7, scope: !970)
!994 = !DILocation(line: 1556, column: 7, scope: !970)
!995 = !DILocalVariable(name: "program", arg: 1, scope: !996, file: !974, line: 634, type: !168)
!996 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !974, file: !974, line: 634, type: !985, scopeLine: 635, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !997)
!997 = !{!995, !998, !1007, !1008, !1010}
!998 = !DILocalVariable(name: "infomap", scope: !996, file: !974, line: 636, type: !999)
!999 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1000, size: 896, elements: !1005)
!1000 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1001)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !996, file: !974, line: 636, size: 128, elements: !1002)
!1002 = !{!1003, !1004}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !1001, file: !974, line: 636, baseType: !168, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !1001, file: !974, line: 636, baseType: !168, size: 64, offset: 64)
!1005 = !{!1006}
!1006 = !DISubrange(count: 7)
!1007 = !DILocalVariable(name: "node", scope: !996, file: !974, line: 646, type: !168)
!1008 = !DILocalVariable(name: "map_prog", scope: !996, file: !974, line: 647, type: !1009)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1010 = !DILocalVariable(name: "lc_messages", scope: !996, file: !974, line: 659, type: !168)
!1011 = !DILocation(scope: !996, inlinedAt: !1012)
!1012 = distinct !DILocation(line: 1561, column: 7, scope: !970)
!1013 = !DILocation(line: 636, column: 3, scope: !996, inlinedAt: !1012)
!1014 = !DILocation(line: 636, column: 67, scope: !996, inlinedAt: !1012)
!1015 = !DILocation(line: 647, column: 36, scope: !996, inlinedAt: !1012)
!1016 = !DILocation(line: 649, column: 3, scope: !996, inlinedAt: !1012)
!1017 = !DILocation(line: 649, column: 33, scope: !996, inlinedAt: !1012)
!1018 = !DILocation(line: 650, column: 13, scope: !996, inlinedAt: !1012)
!1019 = !DILocation(line: 649, column: 20, scope: !996, inlinedAt: !1012)
!1020 = !{!1021, !966, i64 0}
!1021 = !{!"infomap", !966, i64 0, !966, i64 8}
!1022 = !DILocation(line: 649, column: 10, scope: !996, inlinedAt: !1012)
!1023 = !DILocation(line: 649, column: 28, scope: !996, inlinedAt: !1012)
!1024 = distinct !{!1024, !1016, !1018, !1025}
!1025 = !{!"llvm.loop.mustprogress"}
!1026 = !DILocation(line: 652, column: 17, scope: !1027, inlinedAt: !1012)
!1027 = distinct !DILexicalBlock(scope: !996, file: !974, line: 652, column: 7)
!1028 = !{!1021, !966, i64 8}
!1029 = !DILocation(line: 652, column: 7, scope: !1027, inlinedAt: !1012)
!1030 = !DILocation(line: 652, column: 7, scope: !996, inlinedAt: !1012)
!1031 = !DILocation(line: 655, column: 3, scope: !996, inlinedAt: !1012)
!1032 = !DILocation(line: 659, column: 29, scope: !996, inlinedAt: !1012)
!1033 = !DILocation(line: 660, column: 7, scope: !1034, inlinedAt: !1012)
!1034 = distinct !DILexicalBlock(scope: !996, file: !974, line: 660, column: 7)
!1035 = !DILocation(line: 660, column: 19, scope: !1034, inlinedAt: !1012)
!1036 = !DILocation(line: 660, column: 22, scope: !1034, inlinedAt: !1012)
!1037 = !DILocation(line: 660, column: 7, scope: !996, inlinedAt: !1012)
!1038 = !DILocation(line: 666, column: 7, scope: !1039, inlinedAt: !1012)
!1039 = distinct !DILexicalBlock(scope: !1034, file: !974, line: 661, column: 5)
!1040 = !DILocation(line: 668, column: 5, scope: !1039, inlinedAt: !1012)
!1041 = !DILocation(line: 669, column: 3, scope: !996, inlinedAt: !1012)
!1042 = !DILocation(line: 671, column: 3, scope: !996, inlinedAt: !1012)
!1043 = !DILocation(line: 673, column: 1, scope: !996, inlinedAt: !1012)
!1044 = !DILocation(line: 1563, column: 3, scope: !954)
!1045 = !DISubprogram(name: "dcgettext", scope: !1046, file: !1046, line: 51, type: !1047, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !234)
!1046 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!88, !168, !168, !113}
!1049 = !DISubprogram(name: "fputs_unlocked", scope: !1050, file: !1050, line: 667, type: !1051, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !234)
!1050 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!113, !168, !1053}
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !1055, line: 49, size: 1728, elements: !1056)
!1055 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!1056 = !{!1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1072, !1073, !1074, !1075, !1077, !1078, !1080, !1084, !1087, !1089, !1092, !1095, !1096, !1097, !1098, !1099}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1054, file: !1055, line: 51, baseType: !113, size: 32)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1054, file: !1055, line: 54, baseType: !88, size: 64, offset: 64)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1054, file: !1055, line: 55, baseType: !88, size: 64, offset: 128)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1054, file: !1055, line: 56, baseType: !88, size: 64, offset: 192)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1054, file: !1055, line: 57, baseType: !88, size: 64, offset: 256)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1054, file: !1055, line: 58, baseType: !88, size: 64, offset: 320)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1054, file: !1055, line: 59, baseType: !88, size: 64, offset: 384)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1054, file: !1055, line: 60, baseType: !88, size: 64, offset: 448)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1054, file: !1055, line: 61, baseType: !88, size: 64, offset: 512)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1054, file: !1055, line: 64, baseType: !88, size: 64, offset: 576)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1054, file: !1055, line: 65, baseType: !88, size: 64, offset: 640)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1054, file: !1055, line: 66, baseType: !88, size: 64, offset: 704)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1054, file: !1055, line: 68, baseType: !1070, size: 64, offset: 768)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64)
!1071 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !1055, line: 36, flags: DIFlagFwdDecl)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1054, file: !1055, line: 70, baseType: !1053, size: 64, offset: 832)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1054, file: !1055, line: 72, baseType: !113, size: 32, offset: 896)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1054, file: !1055, line: 73, baseType: !113, size: 32, offset: 928)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1054, file: !1055, line: 74, baseType: !1076, size: 64, offset: 960)
!1076 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !97, line: 152, baseType: !520)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1054, file: !1055, line: 77, baseType: !321, size: 16, offset: 1024)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1054, file: !1055, line: 78, baseType: !1079, size: 8, offset: 1040)
!1079 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1054, file: !1055, line: 79, baseType: !1081, size: 8, offset: 1048)
!1081 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 8, elements: !1082)
!1082 = !{!1083}
!1083 = !DISubrange(count: 1)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1054, file: !1055, line: 81, baseType: !1085, size: 64, offset: 1088)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64)
!1086 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !1055, line: 43, baseType: null)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1054, file: !1055, line: 89, baseType: !1088, size: 64, offset: 1152)
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !97, line: 153, baseType: !520)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1054, file: !1055, line: 91, baseType: !1090, size: 64, offset: 1216)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64)
!1091 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !1055, line: 37, flags: DIFlagFwdDecl)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1054, file: !1055, line: 92, baseType: !1093, size: 64, offset: 1280)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !1055, line: 38, flags: DIFlagFwdDecl)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1054, file: !1055, line: 93, baseType: !1053, size: 64, offset: 1344)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1054, file: !1055, line: 94, baseType: !90, size: 64, offset: 1408)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1054, file: !1055, line: 95, baseType: !91, size: 64, offset: 1472)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1054, file: !1055, line: 96, baseType: !113, size: 32, offset: 1536)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1054, file: !1055, line: 98, baseType: !1100, size: 160, offset: 1568)
!1100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 160, elements: !1101)
!1101 = !{!1102}
!1102 = !DISubrange(count: 20)
!1103 = !DISubprogram(name: "setlocale", scope: !1104, file: !1104, line: 122, type: !1105, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !234)
!1104 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!1105 = !DISubroutineType(types: !1106)
!1106 = !{!88, !113, !168}
!1107 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 1567, type: !1108, scopeLine: 1568, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1110)
!1108 = !DISubroutineType(types: !1109)
!1109 = !{!113, !113, !213}
!1110 = !{!1111, !1112, !1113, !1148, !1149, !1150, !1152, !1153, !1156, !1158, !1159, !1163, !1167, !1173, !1176, !1177}
!1111 = !DILocalVariable(name: "argc", arg: 1, scope: !1107, file: !3, line: 1567, type: !113)
!1112 = !DILocalVariable(name: "argv", arg: 2, scope: !1107, file: !3, line: 1567, type: !213)
!1113 = !DILocalVariable(name: "stats", scope: !1107, file: !3, line: 1569, type: !1114)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64)
!1115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !1116, line: 26, size: 1152, elements: !1117)
!1116 = !DIFile(filename: "/usr/include/bits/struct_stat.h", directory: "")
!1117 = !{!1118, !1119, !1121, !1123, !1125, !1127, !1129, !1130, !1131, !1132, !1134, !1136, !1144, !1145, !1146}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1115, file: !1116, line: 28, baseType: !96, size: 64)
