source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.F_triple = type { i8*, i64, i64 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__dirstream = type opaque
%struct.__jmp_buf_tag = type { [8 x i64], i32, %struct.__sigset_t }
%struct.__mbstate_t = type { i32, %union.anon.12 }
%struct.__sigset_t = type { [16 x i64] }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct._cap_struct = type opaque
%struct._obstack_chunk = type { i8*, %struct._obstack_chunk*, [0 x i8] }
%struct.bin_str = type { i64, i8* }
%struct.color_ext_type = type { %struct.bin_str, %struct.bin_str, %struct.color_ext_type* }
%struct.column_info = type { i8, i64, i64* }
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%struct.fileinfo = type { i8*, i8*, i8*, %struct.stat, i32, i32, i8*, i8, i8, i32, i8, i32 }
%struct.group = type { i8*, i8*, i32, i8** }
%struct.hash_entry = type { i8*, %struct.hash_entry* }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }

!42 = !DIEnumerator(name: "with_commas", value: 4, isUnsigned: true)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Dereference_symlink", file: !3, line: 576, baseType: !6, size: 32, elements: !44)
!44 = !{!45, !46, !47, !48, !49}
!45 = !DIEnumerator(name: "DEREF_UNDEFINED", value: 1, isUnsigned: true)
!46 = !DIEnumerator(name: "DEREF_NEVER", value: 2, isUnsigned: true)
!47 = !DIEnumerator(name: "DEREF_COMMAND_LINE_ARGUMENTS", value: 3, isUnsigned: true)
!48 = !DIEnumerator(name: "DEREF_COMMAND_LINE_SYMLINK_TO_DIR", value: 4, isUnsigned: true)
!49 = !DIEnumerator(name: "DEREF_ALWAYS", value: 5, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "indicator_style", file: !3, line: 534, baseType: !6, size: 32, elements: !51)
!51 = !{!52, !53, !54, !55}
!52 = !DIEnumerator(name: "none", value: 0, isUnsigned: true)
!53 = !DIEnumerator(name: "slash", value: 1, isUnsigned: true)
!54 = !DIEnumerator(name: "file_type", value: 2, isUnsigned: true)
!55 = !DIEnumerator(name: "classify", value: 3, isUnsigned: true)
!56 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sort_type", file: !3, line: 470, baseType: !57, size: 32, elements: !58)
!57 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!58 = !{!59, !60, !61, !62, !63, !64, !65}
!59 = !DIEnumerator(name: "sort_none", value: -1)
!60 = !DIEnumerator(name: "sort_name", value: 0)
!61 = !DIEnumerator(name: "sort_extension", value: 1)
!62 = !DIEnumerator(name: "sort_size", value: 2)
!63 = !DIEnumerator(name: "sort_version", value: 3)
!64 = !DIEnumerator(name: "sort_time", value: 4)
!65 = !DIEnumerator(name: "sort_numtypes", value: 5)
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "filetype", file: !3, line: 164, baseType: !6, size: 32, elements: !67)
!67 = !{!68, !69, !70, !71, !72, !73, !74, !75, !76, !77}
!68 = !DIEnumerator(name: "unknown", value: 0, isUnsigned: true)
!69 = !DIEnumerator(name: "fifo", value: 1, isUnsigned: true)
!70 = !DIEnumerator(name: "chardev", value: 2, isUnsigned: true)
!71 = !DIEnumerator(name: "directory", value: 3, isUnsigned: true)
!72 = !DIEnumerator(name: "blockdev", value: 4, isUnsigned: true)
!73 = !DIEnumerator(name: "normal", value: 5, isUnsigned: true)
!74 = !DIEnumerator(name: "symbolic_link", value: 6, isUnsigned: true)
!75 = !DIEnumerator(name: "sock", value: 7, isUnsigned: true)
!76 = !DIEnumerator(name: "whiteout", value: 8, isUnsigned: true)
!77 = !DIEnumerator(name: "arg_directory", value: 9, isUnsigned: true)
!78 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !79, line: 112, baseType: !6, size: 32, elements: !80)
!79 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!80 = !{!81}
!81 = !DIEnumerator(name: "NOT_AN_INODE_NUMBER", value: 0, isUnsigned: true)
!82 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "acl_type", file: !3, line: 192, baseType: !6, size: 32, elements: !83)
!83 = !{!84, !85, !86}
!84 = !DIEnumerator(name: "ACL_T_NONE", value: 0, isUnsigned: true)
!85 = !DIEnumerator(name: "ACL_T_LSM_CONTEXT_ONLY", value: 1, isUnsigned: true)
!86 = !DIEnumerator(name: "ACL_T_YES", value: 2, isUnsigned: true)
!87 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !88, file: !3, line: 1379, baseType: !6, size: 32, elements: !209)
!88 = distinct !DISubprogram(name: "signal_setup", scope: !3, file: !3, line: 1353, type: !89, isLocal: true, isDefinition: true, scopeLine: 1354, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !92)
!89 = !DISubroutineType(types: !90)
!90 = !{null, !91}
!91 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!92 = !{!93, !94, !95}
!93 = !DILocalVariable(name: "init", arg: 1, scope: !88, file: !3, line: 1353, type: !91)
!94 = !DILocalVariable(name: "j", scope: !88, file: !3, line: 1385, type: !57)
!95 = !DILocalVariable(name: "act", scope: !96, file: !3, line: 1390, type: !98)
!96 = distinct !DILexicalBlock(scope: !97, file: !3, line: 1388, column: 5)
!97 = distinct !DILexicalBlock(scope: !88, file: !3, line: 1387, column: 7)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !99, line: 27, size: 1216, elements: !100)
!99 = !DIFile(filename: "/usr/include/bits/sigaction.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!100 = !{!101, !194, !204, !205}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !98, file: !99, line: 38, baseType: !102, size: 64)
!102 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !98, file: !99, line: 31, size: 64, elements: !103)
!103 = !{!104, !110}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !102, file: !99, line: 34, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !106, line: 72, baseType: !107)
!106 = !DIFile(filename: "/usr/include/signal.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{null, !57}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !102, file: !99, line: 36, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{null, !57, !114, !150}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !116, line: 124, baseType: !117)
!116 = !DIFile(filename: "/usr/include/bits/types/siginfo_t.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 36, size: 1024, elements: !118)
!118 = !{!119, !120, !121, !122, !123}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !117, file: !116, line: 38, baseType: !57, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !117, file: !116, line: 40, baseType: !57, size: 32, offset: 32)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !117, file: !116, line: 42, baseType: !57, size: 32, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !117, file: !116, line: 48, baseType: !57, size: 32, offset: 96)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !117, file: !116, line: 123, baseType: !124, size: 896, offset: 128)
!124 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !117, file: !116, line: 51, size: 896, elements: !125)
!125 = !{!126, !130, !138, !151, !157, !167, !183, !188}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !124, file: !116, line: 53, baseType: !127, size: 896)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 896, elements: !128)
!128 = !{!129}
!129 = !DISubrange(count: 28)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !124, file: !116, line: 60, baseType: !131, size: 64)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !124, file: !116, line: 56, size: 64, elements: !132)
!132 = !{!133, !136}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !131, file: !116, line: 58, baseType: !134, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !135, line: 152, baseType: !57)
!135 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!136 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !131, file: !116, line: 59, baseType: !137, size: 32, offset: 32)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !135, line: 144, baseType: !6)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !124, file: !116, line: 68, baseType: !139, size: 128)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !124, file: !116, line: 63, size: 128, elements: !140)
!140 = !{!141, !142, !143}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !139, file: !116, line: 65, baseType: !57, size: 32)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !139, file: !116, line: 66, baseType: !57, size: 32, offset: 32)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !139, file: !116, line: 67, baseType: !144, size: 64, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigval_t", file: !145, line: 30, baseType: !146)
!145 = !DIFile(filename: "/usr/include/bits/types/__sigval_t.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!146 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !145, line: 24, size: 64, elements: !147)
!147 = !{!148, !149}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !146, file: !145, line: 26, baseType: !57, size: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !146, file: !145, line: 27, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !124, file: !116, line: 76, baseType: !152, size: 128)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !124, file: !116, line: 71, size: 128, elements: !153)
!153 = !{!154, !155, !156}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !152, file: !116, line: 73, baseType: !134, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !152, file: !116, line: 74, baseType: !137, size: 32, offset: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !152, file: !116, line: 75, baseType: !144, size: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !124, file: !116, line: 86, baseType: !158, size: 256)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !124, file: !116, line: 79, size: 256, elements: !159)
!159 = !{!160, !161, !162, !163, !166}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !158, file: !116, line: 81, baseType: !134, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !158, file: !116, line: 82, baseType: !137, size: 32, offset: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !158, file: !116, line: 83, baseType: !57, size: 32, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !158, file: !116, line: 84, baseType: !164, size: 64, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !135, line: 154, baseType: !165)
!165 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !158, file: !116, line: 85, baseType: !164, size: 64, offset: 192)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !124, file: !116, line: 105, baseType: !168, size: 256)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !124, file: !116, line: 89, size: 256, elements: !169)
!169 = !{!170, !171, !173}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !168, file: !116, line: 91, baseType: !150, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_lsb", scope: !168, file: !116, line: 93, baseType: !172, size: 16, offset: 64)
!172 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_bounds", scope: !168, file: !116, line: 104, baseType: !174, size: 128, offset: 128)
!174 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !168, file: !116, line: 94, size: 128, elements: !175)
!175 = !{!176, !181}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_bnd", scope: !174, file: !116, line: 101, baseType: !177, size: 128)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !174, file: !116, line: 97, size: 128, elements: !178)
!178 = !{!179, !180}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_lower", scope: !177, file: !116, line: 99, baseType: !150, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_upper", scope: !177, file: !116, line: 100, baseType: !150, size: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_pkey", scope: !174, file: !116, line: 103, baseType: !182, size: 32)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !135, line: 41, baseType: !6)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !124, file: !116, line: 112, baseType: !184, size: 128)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !124, file: !116, line: 108, size: 128, elements: !185)
!185 = !{!186, !187}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !184, file: !116, line: 110, baseType: !165, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "si_fd", scope: !184, file: !116, line: 111, baseType: !57, size: 32, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !124, file: !116, line: 121, baseType: !189, size: 128)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !124, file: !116, line: 116, size: 128, elements: !190)
!190 = !{!191, !192, !193}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !189, file: !116, line: 118, baseType: !150, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !189, file: !116, line: 119, baseType: !57, size: 32, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !189, file: !116, line: 120, baseType: !6, size: 32, offset: 96)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !98, file: !99, line: 46, baseType: !195, size: 1024, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !196, line: 8, baseType: !197)
!196 = !DIFile(filename: "/usr/include/bits/types/__sigset_t.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !196, line: 5, size: 1024, elements: !198)
!198 = !{!199}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !197, file: !196, line: 7, baseType: !200, size: 1024)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 1024, elements: !202)
!201 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!202 = !{!203}
!203 = !DISubrange(count: 16)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !98, file: !99, line: 49, baseType: !57, size: 32, offset: 1088)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !98, file: !99, line: 52, baseType: !206, size: 64, offset: 1152)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{null}
!209 = !{!210}
!210 = !DIEnumerator(name: "nsigs", value: 12, isUnsigned: true)
!211 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !212, line: 32, baseType: !6, size: 32, elements: !213)
!212 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!213 = !{!214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224}
!214 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!215 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!216 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!217 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!218 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!219 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!220 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!221 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!222 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!223 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!224 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!225 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "time_type", file: !3, line: 456, baseType: !6, size: 32, elements: !226)
!226 = !{!227, !228, !229, !230}
!227 = !DIEnumerator(name: "time_mtime", value: 0, isUnsigned: true)
!228 = !DIEnumerator(name: "time_ctime", value: 1, isUnsigned: true)
!229 = !DIEnumerator(name: "time_atime", value: 2, isUnsigned: true)
!230 = !DIEnumerator(name: "time_numtypes", value: 3, isUnsigned: true)
!231 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 672, baseType: !6, size: 32, elements: !232)
!232 = !{!233, !234, !235}
!233 = !DIEnumerator(name: "IGNORE_DEFAULT", value: 0, isUnsigned: true)
!234 = !DIEnumerator(name: "IGNORE_DOT_AND_DOTDOT", value: 1, isUnsigned: true)
!235 = !DIEnumerator(name: "IGNORE_MINIMAL", value: 2, isUnsigned: true)
!236 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !237, line: 26, baseType: !6, size: 32, elements: !238)
!237 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!238 = !{!239, !240, !241, !242, !243}
!239 = !DIEnumerator(name: "LONGINT_OK", value: 0, isUnsigned: true)
!240 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1, isUnsigned: true)
!241 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2, isUnsigned: true)
!242 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3, isUnsigned: true)
!243 = !DIEnumerator(name: "LONGINT_INVALID", value: 4, isUnsigned: true)
!244 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !245, line: 43, baseType: !6, size: 32, elements: !246)
!245 = !DIFile(filename: "./lib/human.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!246 = !{!247, !248, !249, !250, !251, !252, !253, !254, !255, !256}
!247 = !DIEnumerator(name: "human_ceiling", value: 0, isUnsigned: true)
!248 = !DIEnumerator(name: "human_round_to_nearest", value: 1, isUnsigned: true)
!249 = !DIEnumerator(name: "human_floor", value: 2, isUnsigned: true)
!250 = !DIEnumerator(name: "human_group_digits", value: 4, isUnsigned: true)
!251 = !DIEnumerator(name: "human_suppress_point_zero", value: 8, isUnsigned: true)
!252 = !DIEnumerator(name: "human_autoscale", value: 16, isUnsigned: true)
!253 = !DIEnumerator(name: "human_base_1024", value: 32, isUnsigned: true)
!254 = !DIEnumerator(name: "human_space_before_unit", value: 64, isUnsigned: true)
!255 = !DIEnumerator(name: "human_SI", value: 128, isUnsigned: true)
!256 = !DIEnumerator(name: "human_B", value: 256, isUnsigned: true)
!257 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "when_type", file: !3, line: 569, baseType: !6, size: 32, elements: !258)
!258 = !{!259, !260, !261}
!259 = !DIEnumerator(name: "when_never", value: 0, isUnsigned: true)
!260 = !DIEnumerator(name: "when_always", value: 1, isUnsigned: true)
!261 = !DIEnumerator(name: "when_if_tty", value: 2, isUnsigned: true)
!262 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "time_style", file: !3, line: 433, baseType: !6, size: 32, elements: !263)
!263 = !{!264, !265, !266, !267}
!264 = !DIEnumerator(name: "full_iso_time_style", value: 0, isUnsigned: true)
!265 = !DIEnumerator(name: "long_iso_time_style", value: 1, isUnsigned: true)
!266 = !DIEnumerator(name: "iso_time_style", value: 2, isUnsigned: true)
!267 = !DIEnumerator(name: "locale_time_style", value: 3, isUnsigned: true)
!268 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 1106, baseType: !6, size: 32, elements: !269)
!269 = !{!270}
!270 = !DIEnumerator(name: "ABFORMAT_SIZE", value: 128, isUnsigned: true)
!271 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 1103, baseType: !6, size: 32, elements: !272)
!272 = !{!273}
!273 = !DIEnumerator(name: "MAX_MON_WIDTH", value: 12, isUnsigned: true)
!274 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !275, line: 41, baseType: !6, size: 32, elements: !276)
!275 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!276 = !{!277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659}
!277 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!278 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!279 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!280 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!281 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!282 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!283 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!284 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!285 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!286 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!287 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!288 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!289 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!290 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!291 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!292 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!293 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!294 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!295 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!296 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!297 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!298 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!299 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!300 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!301 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!302 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!303 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!304 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!305 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!306 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!307 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!308 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!309 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!310 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!311 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!312 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!313 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!314 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!315 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!316 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!317 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!318 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!319 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!320 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!321 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!322 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!323 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!324 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!325 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!326 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!327 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!328 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!329 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!330 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!331 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!332 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!333 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!334 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!335 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!336 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!337 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!338 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!339 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!340 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!341 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!342 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!343 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!344 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!345 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!346 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!347 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!348 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!349 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!350 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!351 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!352 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!353 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!354 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!355 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!356 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!357 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!358 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!359 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!360 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!361 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!362 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!363 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!364 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!365 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!366 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!367 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!368 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!369 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!370 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!371 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!372 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!373 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!374 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!375 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!376 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!377 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!378 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!379 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!380 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!381 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!382 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!383 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!384 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!385 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!386 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!387 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!388 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!389 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!390 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!391 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!392 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!393 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!394 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!395 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!396 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!397 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!398 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!399 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!400 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!401 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!402 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!403 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!404 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!405 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!406 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!407 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!408 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!409 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!410 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!411 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!412 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!413 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!414 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!415 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!416 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!417 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!418 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!419 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!420 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!421 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!422 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!423 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!424 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!425 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!426 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!427 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!428 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!429 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!430 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!431 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!432 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!433 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!434 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!435 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!436 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!437 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!438 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!439 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!440 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!441 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!442 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!443 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!444 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!445 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!446 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!447 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!448 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!449 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!450 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!451 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!452 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!453 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!454 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!455 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!456 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!457 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!458 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!459 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!460 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!461 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!462 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!463 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!464 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!465 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!466 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!467 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!468 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!469 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!470 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!471 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!472 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!473 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!474 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!475 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!476 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!477 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!478 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!479 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!480 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!481 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!482 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!483 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!484 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!485 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!486 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!487 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!488 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!489 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!490 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!491 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!492 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!493 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!494 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!495 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!496 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!497 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!498 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!499 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!500 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!501 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!502 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!503 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!504 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!505 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!506 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!507 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!508 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!509 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!510 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!511 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!512 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!513 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!514 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!515 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!516 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!517 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!518 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!519 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!520 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!521 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!522 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!523 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!524 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!525 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!526 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!527 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!528 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!529 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!530 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!531 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!532 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!533 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!534 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!535 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!536 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!537 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!538 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!539 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!540 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!541 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!542 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!543 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!544 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!545 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!546 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!547 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!548 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!549 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!550 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!551 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!552 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!553 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!554 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!555 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!556 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!557 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!558 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!559 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!560 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!561 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!562 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!563 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!564 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!565 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!566 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!567 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!568 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!569 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!570 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!571 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!572 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!573 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!574 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!575 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!576 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!577 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!578 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!579 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!580 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!581 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!582 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!583 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!584 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!585 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!586 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!587 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!588 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!589 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!590 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!591 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!592 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!593 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!594 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!595 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!596 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!597 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!598 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!599 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!600 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!601 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!602 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!603 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!604 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!605 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!606 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!607 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!608 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!609 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!610 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!611 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!612 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!613 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!614 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!615 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!616 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!617 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!618 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!619 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!620 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!621 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!622 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!623 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!624 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!625 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!626 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!627 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!628 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!629 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!630 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!631 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!632 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!633 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!634 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!635 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!636 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!637 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!660 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !661, line: 19, baseType: !6, size: 32, elements: !662)
!661 = !DIFile(filename: "./lib/mbsalign.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!662 = !{!663, !664, !665}
!663 = !DIEnumerator(name: "MBS_ALIGN_LEFT", value: 0, isUnsigned: true)
!664 = !DIEnumerator(name: "MBS_ALIGN_RIGHT", value: 1, isUnsigned: true)
!665 = !DIEnumerator(name: "MBS_ALIGN_CENTER", value: 2, isUnsigned: true)
!666 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "parse_state", file: !3, line: 2471, baseType: !6, size: 32, elements: !667)
!667 = !{!668, !669, !670, !671, !672, !673}
!668 = !DIEnumerator(name: "PS_START", value: 1, isUnsigned: true)
!669 = !DIEnumerator(name: "PS_2", value: 2, isUnsigned: true)
!670 = !DIEnumerator(name: "PS_3", value: 3, isUnsigned: true)
!671 = !DIEnumerator(name: "PS_4", value: 4, isUnsigned: true)
!672 = !DIEnumerator(name: "PS_DONE", value: 5, isUnsigned: true)
!673 = !DIEnumerator(name: "PS_FAIL", value: 6, isUnsigned: true)
!674 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !675, file: !3, line: 2282, baseType: !6, size: 32, elements: !697)
!675 = distinct !DISubprogram(name: "get_funky_string", scope: !3, file: !3, line: 2277, type: !676, isLocal: true, isDefinition: true, scopeLine: 2279, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !687)
!676 = !DISubroutineType(types: !677)
!677 = !{!91, !678, !681, !91, !684}
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !680)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !686, line: 62, baseType: !201)
!686 = !DIFile(filename: "/usr/lib/clang/7.0.0/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!687 = !{!688, !689, !690, !691, !692, !693, !694, !695, !696}
!688 = !DILocalVariable(name: "dest", arg: 1, scope: !675, file: !3, line: 2277, type: !678)
!689 = !DILocalVariable(name: "src", arg: 2, scope: !675, file: !3, line: 2277, type: !681)
!690 = !DILocalVariable(name: "equals_end", arg: 3, scope: !675, file: !3, line: 2277, type: !91)
!691 = !DILocalVariable(name: "output_count", arg: 4, scope: !675, file: !3, line: 2278, type: !684)
!692 = !DILocalVariable(name: "num", scope: !675, file: !3, line: 2280, type: !680)
!693 = !DILocalVariable(name: "count", scope: !675, file: !3, line: 2281, type: !685)
!694 = !DILocalVariable(name: "state", scope: !675, file: !3, line: 2284, type: !674)
!695 = !DILocalVariable(name: "p", scope: !675, file: !3, line: 2285, type: !682)
!696 = !DILocalVariable(name: "q", scope: !675, file: !3, line: 2286, type: !679)
!697 = !{!698, !699, !700, !701, !702, !703, !704}
!698 = !DIEnumerator(name: "ST_GND", value: 0, isUnsigned: true)
!699 = !DIEnumerator(name: "ST_BACKSLASH", value: 1, isUnsigned: true)
!700 = !DIEnumerator(name: "ST_OCTAL", value: 2, isUnsigned: true)
!701 = !DIEnumerator(name: "ST_HEX", value: 3, isUnsigned: true)
!702 = !DIEnumerator(name: "ST_CARET", value: 4, isUnsigned: true)
!703 = !DIEnumerator(name: "ST_END", value: 5, isUnsigned: true)
!704 = !DIEnumerator(name: "ST_ERROR", value: 6, isUnsigned: true)
!705 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "canonicalize_mode_t", file: !706, line: 24, baseType: !6, size: 32, elements: !707)
!706 = !DIFile(filename: "./lib/canonicalize.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!707 = !{!708, !709, !710, !711}
!708 = !DIEnumerator(name: "CAN_EXISTING", value: 0, isUnsigned: true)
!709 = !DIEnumerator(name: "CAN_ALL_BUT_LAST", value: 1, isUnsigned: true)
!710 = !DIEnumerator(name: "CAN_MISSING", value: 2, isUnsigned: true)
!711 = !DIEnumerator(name: "CAN_NOLINKS", value: 4, isUnsigned: true)
!712 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !713, line: 46, baseType: !6, size: 32, elements: !714)
!713 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!714 = !{!715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726}
!715 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!716 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!717 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!718 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!719 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!720 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!721 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!722 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!723 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!724 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!725 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!726 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!727 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !728, line: 41, baseType: !6, size: 32, elements: !729)
!728 = !DIFile(filename: "./lib/timespec.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!729 = !{!730}
!730 = !DIEnumerator(name: "TIMESPEC_RESOLUTION", value: 1000000000, isUnsigned: true)
!731 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 751, baseType: !6, size: 32, elements: !732)
!732 = !{!733}
!733 = !DIEnumerator(name: "TIME_STAMP_LEN_MAXIMUM", value: 1000, isUnsigned: true)
!734 = !{!735, !150, !738, !685, !741, !105, !684, !679, !201, !682, !57, !742, !743, !744, !747, !750}
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !736, line: 7, baseType: !737)
!736 = !DIFile(filename: "/usr/include/bits/types/time_t.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !135, line: 158, baseType: !165)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !739, line: 102, baseType: !740)
!739 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !135, line: 72, baseType: !201)
!741 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!742 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !135, line: 143, baseType: !201)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !745, line: 85, baseType: !746)
!745 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !135, line: 150, baseType: !165)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !752)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fileinfo", file: !3, line: 199, size: 1600, elements: !753)
!753 = !{!754, !755, !756, !757, !791, !792, !794, !795, !796, !797, !798, !799}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !752, file: !3, line: 202, baseType: !679, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "linkname", scope: !752, file: !3, line: 205, baseType: !679, size: 64, offset: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "absolute_name", scope: !752, file: !3, line: 208, baseType: !679, size: 64, offset: 128)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "stat", scope: !752, file: !3, line: 210, baseType: !758, size: 1152, offset: 192)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !759, line: 46, size: 1152, elements: !760)
!759 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!760 = !{!761, !762, !764, !766, !768, !769, !771, !772, !773, !774, !776, !778, !785, !786, !787}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !758, file: !759, line: 48, baseType: !743, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !758, file: !759, line: 53, baseType: !763, size: 64, offset: 64)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !135, line: 146, baseType: !201)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !758, file: !759, line: 61, baseType: !765, size: 64, offset: 128)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !135, line: 149, baseType: !201)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !758, file: !759, line: 62, baseType: !767, size: 32, offset: 192)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !135, line: 148, baseType: !6)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !758, file: !759, line: 64, baseType: !137, size: 32, offset: 224)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !758, file: !759, line: 65, baseType: !770, size: 32, offset: 256)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !135, line: 145, baseType: !6)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !758, file: !759, line: 67, baseType: !57, size: 32, offset: 288)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !758, file: !759, line: 69, baseType: !743, size: 64, offset: 320)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !758, file: !759, line: 74, baseType: !746, size: 64, offset: 384)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !758, file: !759, line: 78, baseType: !775, size: 64, offset: 448)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !135, line: 172, baseType: !165)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !758, file: !759, line: 80, baseType: !777, size: 64, offset: 512)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !135, line: 177, baseType: !165)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !758, file: !759, line: 91, baseType: !779, size: 128, offset: 576)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !780, line: 9, size: 128, elements: !781)
!780 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!781 = !{!782, !783}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !779, file: !780, line: 11, baseType: !737, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !779, file: !780, line: 12, baseType: !784, size: 64, offset: 64)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !135, line: 194, baseType: !165)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !758, file: !759, line: 92, baseType: !779, size: 128, offset: 704)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !758, file: !759, line: 93, baseType: !779, size: 128, offset: 832)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !758, file: !759, line: 106, baseType: !788, size: 192, offset: 960)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !784, size: 192, elements: !789)
!789 = !{!790}
!790 = !DISubrange(count: 3)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "filetype", scope: !752, file: !3, line: 212, baseType: !66, size: 32, offset: 1344)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "linkmode", scope: !752, file: !3, line: 216, baseType: !793, size: 32, offset: 1376)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !745, line: 69, baseType: !767)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "scontext", scope: !752, file: !3, line: 219, baseType: !679, size: 64, offset: 1408)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "stat_ok", scope: !752, file: !3, line: 221, baseType: !91, size: 8, offset: 1472)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "linkok", scope: !752, file: !3, line: 225, baseType: !91, size: 8, offset: 1480)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "acl_type", scope: !752, file: !3, line: 229, baseType: !82, size: 32, offset: 1504)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "has_capability", scope: !752, file: !3, line: 232, baseType: !91, size: 8, offset: 1536)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "quoted", scope: !752, file: !3, line: 235, baseType: !57, size: 32, offset: 1568)
!800 = !{!801, !807, !810, !812, !814, !816, !818, !827, !829, !831, !833, !835, !837, !839, !841, !843, !845, !847, !849, !851, !853, !855, !859, !861, !867, !869, !871, !877, !0, !879, !881, !932, !934, !936, !941, !943, !952, !958, !962, !1036, !1038, !1040, !1042, !1044, !1046, !1048, !1050, !1052, !1054, !1056, !1070, !1072, !1074, !1076, !1078, !1080, !1082, !1084, !1090, !1095, !1099, !1101, !1105, !1110, !1116, !1121, !1127, !1130, !1132, !1134, !1136, !1141, !1143, !1147, !1152, !1154, !1160, !1162, !1170, !1175, !1220, !1222, !1225, !1228, !1230, !1232, !1234, !1236, !1238, !1240, !1242, !1244, !1246, !1248, !1250, !1260, !1270, !1279, !1281, !1296, !1306, !1325, !1343, !1351, !1356}
!801 = !DIGlobalVariableExpression(var: !802, expr: !DIExpression())
!802 = distinct !DIGlobalVariable(name: "active_dir_set", scope: !2, file: !3, line: 319, type: !803, isLocal: true, isDefinition: true)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !805, line: 69, baseType: !806)
!805 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!806 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !805, line: 67, flags: DIFlagFwdDecl)
!807 = !DIGlobalVariableExpression(var: !808, expr: !DIExpression())
!808 = distinct !DIGlobalVariable(name: "cwd_file", scope: !2, file: !3, line: 330, type: !809, isLocal: true, isDefinition: true)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!810 = !DIGlobalVariableExpression(var: !811, expr: !DIExpression())
!811 = distinct !DIGlobalVariable(name: "cwd_n_alloc", scope: !2, file: !3, line: 333, type: !685, isLocal: true, isDefinition: true)
!812 = !DIGlobalVariableExpression(var: !813, expr: !DIExpression())
!813 = distinct !DIGlobalVariable(name: "cwd_n_used", scope: !2, file: !3, line: 336, type: !685, isLocal: true, isDefinition: true)
!814 = !DIGlobalVariableExpression(var: !815, expr: !DIExpression())
!815 = distinct !DIGlobalVariable(name: "color_symlink_as_referent", scope: !2, file: !3, line: 355, type: !91, isLocal: true, isDefinition: true)
!816 = !DIGlobalVariableExpression(var: !817, expr: !DIExpression())
!817 = distinct !DIGlobalVariable(name: "hostname", scope: !2, file: !3, line: 357, type: !682, isLocal: true, isDefinition: true)
!818 = !DIGlobalVariableExpression(var: !819, expr: !DIExpression())
!819 = distinct !DIGlobalVariable(name: "pending_dirs", scope: !2, file: !3, line: 378, type: !820, isLocal: true, isDefinition: true)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pending", file: !3, line: 367, size: 256, elements: !822)
!822 = !{!823, !824, !825, !826}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !821, file: !3, line: 369, baseType: !679, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !821, file: !3, line: 373, baseType: !679, size: 64, offset: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "command_line_arg", scope: !821, file: !3, line: 374, baseType: !91, size: 8, offset: 128)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !821, file: !3, line: 375, baseType: !820, size: 64, offset: 192)
!827 = !DIGlobalVariableExpression(var: !828, expr: !DIExpression())
!828 = distinct !DIGlobalVariable(name: "current_time", scope: !2, file: !3, line: 383, type: !779, isLocal: true, isDefinition: true)
!829 = !DIGlobalVariableExpression(var: !830, expr: !DIExpression())
!830 = distinct !DIGlobalVariable(name: "print_scontext", scope: !2, file: !3, line: 385, type: !91, isLocal: true, isDefinition: true)
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(name: "format", scope: !2, file: !3, line: 428, type: !36, isLocal: true, isDefinition: true)
!833 = !DIGlobalVariableExpression(var: !834, expr: !DIExpression())
!834 = distinct !DIGlobalVariable(name: "sort_type", scope: !2, file: !3, line: 481, type: !56, isLocal: true, isDefinition: true)
!835 = !DIGlobalVariableExpression(var: !836, expr: !DIExpression())
!836 = distinct !DIGlobalVariable(name: "print_block_size", scope: !2, file: !3, line: 510, type: !91, isLocal: true, isDefinition: true)
!837 = !DIGlobalVariableExpression(var: !838, expr: !DIExpression())
!838 = distinct !DIGlobalVariable(name: "dired", scope: !2, file: !3, line: 525, type: !91, isLocal: true, isDefinition: true)
!839 = !DIGlobalVariableExpression(var: !840, expr: !DIExpression())
!840 = distinct !DIGlobalVariable(name: "indicator_style", scope: !2, file: !3, line: 542, type: !50, isLocal: true, isDefinition: true)
!841 = !DIGlobalVariableExpression(var: !842, expr: !DIExpression())
!842 = distinct !DIGlobalVariable(name: "print_with_color", scope: !2, file: !3, line: 559, type: !91, isLocal: true, isDefinition: true)
!843 = !DIGlobalVariableExpression(var: !844, expr: !DIExpression())
!844 = distinct !DIGlobalVariable(name: "print_hyperlink", scope: !2, file: !3, line: 561, type: !91, isLocal: true, isDefinition: true)
!845 = !DIGlobalVariableExpression(var: !846, expr: !DIExpression())
!846 = distinct !DIGlobalVariable(name: "check_symlink_color", scope: !2, file: !3, line: 645, type: !91, isLocal: true, isDefinition: true)
!847 = !DIGlobalVariableExpression(var: !848, expr: !DIExpression())
!848 = distinct !DIGlobalVariable(name: "dereference", scope: !2, file: !3, line: 654, type: !43, isLocal: true, isDefinition: true)
!849 = !DIGlobalVariableExpression(var: !850, expr: !DIExpression())
!850 = distinct !DIGlobalVariable(name: "recursive", scope: !2, file: !3, line: 659, type: !91, isLocal: true, isDefinition: true)
!851 = !DIGlobalVariableExpression(var: !852, expr: !DIExpression())
!852 = distinct !DIGlobalVariable(name: "immediate_dirs", scope: !2, file: !3, line: 664, type: !91, isLocal: true, isDefinition: true)
!853 = !DIGlobalVariableExpression(var: !854, expr: !DIExpression())
!854 = distinct !DIGlobalVariable(name: "directories_first", scope: !2, file: !3, line: 668, type: !91, isLocal: true, isDefinition: true)
!855 = !DIGlobalVariableExpression(var: !856, expr: !DIExpression())
!856 = distinct !DIGlobalVariable(name: "filename_quoting_options", scope: !2, file: !3, line: 715, type: !857, isLocal: true, isDefinition: true)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !212, line: 270, flags: DIFlagFwdDecl)
!859 = !DIGlobalVariableExpression(var: !860, expr: !DIExpression())
!860 = distinct !DIGlobalVariable(name: "print_dir_name", scope: !2, file: !3, line: 724, type: !91, isLocal: true, isDefinition: true)
!861 = !DIGlobalVariableExpression(var: !862, expr: !DIExpression())
!862 = distinct !DIGlobalVariable(name: "localtz", scope: !2, file: !3, line: 733, type: !863, isLocal: true, isDefinition: true)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !864, line: 742, baseType: !865)
!864 = !DIFile(filename: "./lib/time.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !864, line: 742, flags: DIFlagFwdDecl)
!867 = !DIGlobalVariableExpression(var: !868, expr: !DIExpression())
!868 = distinct !DIGlobalVariable(name: "format_needs_stat", scope: !2, file: !3, line: 738, type: !91, isLocal: true, isDefinition: true)
!869 = !DIGlobalVariableExpression(var: !870, expr: !DIExpression())
!870 = distinct !DIGlobalVariable(name: "format_needs_type", scope: !2, file: !3, line: 743, type: !91, isLocal: true, isDefinition: true)
!871 = !DIGlobalVariableExpression(var: !872, expr: !DIExpression())
!872 = distinct !DIGlobalVariable(name: "interrupt_signal", scope: !2, file: !3, line: 792, type: !873, isLocal: true, isDefinition: true)
!873 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !874)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "sig_atomic_t", file: !875, line: 8, baseType: !876)
!875 = !DIFile(filename: "/usr/include/bits/types/sig_atomic_t.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sig_atomic_t", file: !135, line: 212, baseType: !57)
!877 = !DIGlobalVariableExpression(var: !878, expr: !DIExpression())
!878 = distinct !DIGlobalVariable(name: "stop_signal_count", scope: !2, file: !3, line: 796, type: !873, isLocal: true, isDefinition: true)
!879 = !DIGlobalVariableExpression(var: !880, expr: !DIExpression())
!880 = distinct !DIGlobalVariable(name: "dired_pos", scope: !2, file: !3, line: 960, type: !685, isLocal: true, isDefinition: true)
!881 = !DIGlobalVariableExpression(var: !882, expr: !DIExpression())
!882 = distinct !DIGlobalVariable(name: "dired_obstack", scope: !2, file: !3, line: 981, type: !883, isLocal: true, isDefinition: true)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !884, line: 174, size: 704, elements: !885)
!884 = !DIFile(filename: "./lib/obstack.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!885 = !{!886, !887, !897, !898, !899, !900, !905, !906, !917, !928, !929, !930, !931}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !883, file: !884, line: 176, baseType: !685, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !883, file: !884, line: 177, baseType: !888, size: 64, offset: 64)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !884, line: 167, size: 128, elements: !890)
!890 = !{!891, !892, !893}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !889, file: !884, line: 169, baseType: !679, size: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !889, file: !884, line: 170, baseType: !888, size: 64, offset: 64)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !889, file: !884, line: 171, baseType: !894, offset: 128)
!894 = !DICompositeType(tag: DW_TAG_array_type, baseType: !680, elements: !895)
!895 = !{!896}
!896 = !DISubrange(count: -1)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !883, file: !884, line: 178, baseType: !679, size: 64, offset: 128)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !883, file: !884, line: 179, baseType: !679, size: 64, offset: 192)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !883, file: !884, line: 180, baseType: !679, size: 64, offset: 256)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !883, file: !884, line: 185, baseType: !901, size: 64, offset: 320)
!901 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !883, file: !884, line: 181, size: 64, elements: !902)
!902 = !{!903, !904}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !901, file: !884, line: 183, baseType: !685, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !901, file: !884, line: 184, baseType: !150, size: 64)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !883, file: !884, line: 186, baseType: !685, size: 64, offset: 384)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !883, file: !884, line: 193, baseType: !907, size: 64, offset: 448)
!907 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !883, file: !884, line: 189, size: 64, elements: !908)
!908 = !{!909, !913}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !907, file: !884, line: 191, baseType: !910, size: 64)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DISubroutineType(types: !912)
!912 = !{!150, !685}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !907, file: !884, line: 192, baseType: !914, size: 64)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DISubroutineType(types: !916)
!916 = !{!150, !150, !685}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !883, file: !884, line: 198, baseType: !918, size: 64, offset: 512)
!918 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !883, file: !884, line: 194, size: 64, elements: !919)
!919 = !{!920, !924}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !918, file: !884, line: 196, baseType: !921, size: 64)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DISubroutineType(types: !923)
!923 = !{null, !150}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !918, file: !884, line: 197, baseType: !925, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DISubroutineType(types: !927)
!927 = !{null, !150, !150}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !883, file: !884, line: 200, baseType: !150, size: 64, offset: 576)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !883, file: !884, line: 201, baseType: !6, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !883, file: !884, line: 202, baseType: !6, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !883, file: !884, line: 206, baseType: !6, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!932 = !DIGlobalVariableExpression(var: !933, expr: !DIExpression())
!933 = distinct !DIGlobalVariable(name: "subdired_obstack", scope: !2, file: !3, line: 988, type: !883, isLocal: true, isDefinition: true)
!934 = !DIGlobalVariableExpression(var: !935, expr: !DIExpression())
!935 = distinct !DIGlobalVariable(name: "dev_ino_obstack", scope: !2, file: !3, line: 1002, type: !883, isLocal: true, isDefinition: true)
!936 = !DIGlobalVariableExpression(var: !937, expr: !DIExpression())
!937 = distinct !DIGlobalVariable(name: "RFC3986", scope: !2, file: !3, line: 1083, type: !938, isLocal: true, isDefinition: true)
!938 = !DICompositeType(tag: DW_TAG_array_type, baseType: !680, size: 2048, elements: !939)
!939 = !{!940}
!940 = !DISubrange(count: 256)
!941 = !DIGlobalVariableExpression(var: !942, expr: !DIExpression())
!942 = distinct !DIGlobalVariable(name: "used_color", scope: !2, file: !3, line: 567, type: !91, isLocal: true, isDefinition: true)
!943 = !DIGlobalVariableExpression(var: !944, expr: !DIExpression())
!944 = distinct !DIGlobalVariable(name: "color_indicator", scope: !2, file: !3, line: 608, type: !945, isLocal: true, isDefinition: true)
!945 = !DICompositeType(tag: DW_TAG_array_type, baseType: !946, size: 3072, elements: !950)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_str", file: !3, line: 244, size: 128, elements: !947)
!947 = !{!948, !949}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !946, file: !3, line: 246, baseType: !685, size: 64)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !946, file: !3, line: 247, baseType: !682, size: 64, offset: 64)
!950 = !{!951}
!951 = !DISubrange(count: 24)
!952 = !DIGlobalVariableExpression(var: !953, expr: !DIExpression())
!953 = distinct !DIGlobalVariable(name: "sig", scope: !88, file: !3, line: 1356, type: !954, isLocal: true, isDefinition: true)
!954 = !DICompositeType(tag: DW_TAG_array_type, baseType: !955, size: 384, elements: !956)
!955 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!956 = !{!957}
!957 = !DISubrange(count: 12)
!958 = !DIGlobalVariableExpression(var: !959, expr: !DIExpression())
!959 = distinct !DIGlobalVariable(name: "caught_signals", scope: !2, file: !3, line: 788, type: !960, isLocal: true, isDefinition: true)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !961, line: 7, baseType: !195)
!961 = !DIFile(filename: "/usr/include/bits/types/sigset_t.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!962 = !DIGlobalVariableExpression(var: !963, expr: !DIExpression())
!963 = distinct !DIGlobalVariable(name: "posix_prefix", scope: !964, file: !3, line: 2177, type: !1033, isLocal: true, isDefinition: true)
!964 = distinct !DISubprogram(name: "decode_switches", scope: !3, file: !3, line: 1684, type: !965, isLocal: true, isDefinition: true, scopeLine: 1685, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !967)
!965 = !DISubroutineType(types: !966)
!966 = !{!57, !57, !678}
!967 = !{!968, !969, !970, !971, !972, !973, !975, !984, !986, !989, !991, !992, !1000, !1002, !1004, !1006, !1009, !1010, !1013, !1016, !1019, !1020, !1023, !1028}
!968 = !DILocalVariable(name: "argc", arg: 1, scope: !964, file: !3, line: 1684, type: !57)
!969 = !DILocalVariable(name: "argv", arg: 2, scope: !964, file: !3, line: 1684, type: !678)
!970 = !DILocalVariable(name: "time_style_option", scope: !964, file: !3, line: 1686, type: !679)
!971 = !DILocalVariable(name: "sort_type_specified", scope: !964, file: !3, line: 1688, type: !91)
!972 = !DILocalVariable(name: "kibibytes_specified", scope: !964, file: !3, line: 1689, type: !91)
!973 = !DILocalVariable(name: "p", scope: !974, file: !3, line: 1748, type: !682)
!974 = distinct !DILexicalBlock(scope: !964, file: !3, line: 1747, column: 3)
!975 = !DILocalVariable(name: "ws", scope: !976, file: !3, line: 1757, type: !977)
!976 = distinct !DILexicalBlock(scope: !964, file: !3, line: 1756, column: 3)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "winsize", file: !978, line: 27, size: 64, elements: !979)
!978 = !DIFile(filename: "/usr/include/bits/ioctl-types.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!979 = !{!980, !981, !982, !983}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "ws_row", scope: !977, file: !978, line: 29, baseType: !742, size: 16)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "ws_col", scope: !977, file: !978, line: 30, baseType: !742, size: 16, offset: 16)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "ws_xpixel", scope: !977, file: !978, line: 31, baseType: !742, size: 16, offset: 32)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "ws_ypixel", scope: !977, file: !978, line: 32, baseType: !742, size: 16, offset: 48)
!984 = !DILocalVariable(name: "p", scope: !985, file: !3, line: 1766, type: !682)
!985 = distinct !DILexicalBlock(scope: !964, file: !3, line: 1765, column: 3)
!986 = !DILocalVariable(name: "tmp_ulong", scope: !987, file: !3, line: 1770, type: !201)
!987 = distinct !DILexicalBlock(scope: !988, file: !3, line: 1769, column: 7)
!988 = distinct !DILexicalBlock(scope: !985, file: !3, line: 1768, column: 9)
!989 = !DILocalVariable(name: "oi", scope: !990, file: !3, line: 1787, type: !57)
!990 = distinct !DILexicalBlock(scope: !964, file: !3, line: 1786, column: 5)
!991 = !DILocalVariable(name: "c", scope: !990, file: !3, line: 1788, type: !57)
!992 = !DILocalVariable(name: "hide", scope: !993, file: !3, line: 1991, type: !995)
!993 = distinct !DILexicalBlock(scope: !994, file: !3, line: 1990, column: 11)
!994 = distinct !DILexicalBlock(scope: !990, file: !3, line: 1795, column: 9)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ignore_pattern", file: !3, line: 690, size: 128, elements: !997)
!997 = !{!998, !999}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "pattern", scope: !996, file: !3, line: 692, baseType: !682, size: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !996, file: !3, line: 693, baseType: !995, size: 64, offset: 64)
!1000 = !DILocalVariable(name: "i", scope: !1001, file: !3, line: 2022, type: !57)
!1001 = distinct !DILexicalBlock(scope: !994, file: !3, line: 2021, column: 11)
!1002 = !DILocalVariable(name: "i", scope: !1003, file: !3, line: 2046, type: !57)
!1003 = distinct !DILexicalBlock(scope: !994, file: !3, line: 2045, column: 11)
!1004 = !DILocalVariable(name: "e", scope: !1005, file: !3, line: 2083, type: !236)
!1005 = distinct !DILexicalBlock(scope: !994, file: !3, line: 2082, column: 11)
!1006 = !DILocalVariable(name: "ls_block_size", scope: !1007, file: !3, line: 2113, type: !682)
!1007 = distinct !DILexicalBlock(scope: !1008, file: !3, line: 2112, column: 5)
!1008 = distinct !DILexicalBlock(scope: !964, file: !3, line: 2111, column: 7)
!1009 = !DILocalVariable(name: "qs", scope: !964, file: !3, line: 2134, type: !211)
!1010 = !DILocalVariable(name: "p", scope: !1011, file: !3, line: 2146, type: !682)
!1011 = distinct !DILexicalBlock(scope: !1012, file: !3, line: 2145, column: 5)
!1012 = distinct !DILexicalBlock(scope: !964, file: !3, line: 2144, column: 7)
!1013 = !DILocalVariable(name: "style", scope: !1014, file: !3, line: 2176, type: !679)
!1014 = distinct !DILexicalBlock(scope: !1015, file: !3, line: 2175, column: 5)
!1015 = distinct !DILexicalBlock(scope: !964, file: !3, line: 2174, column: 7)
!1016 = !DILocalVariable(name: "p0", scope: !1017, file: !3, line: 2192, type: !679)
!1017 = distinct !DILexicalBlock(scope: !1018, file: !3, line: 2191, column: 9)
!1018 = distinct !DILexicalBlock(scope: !1014, file: !3, line: 2190, column: 11)
!1019 = !DILocalVariable(name: "p1", scope: !1017, file: !3, line: 2193, type: !679)
!1020 = !DILocalVariable(name: "res", scope: !1021, file: !3, line: 2208, type: !1022)
!1021 = distinct !DILexicalBlock(scope: !1018, file: !3, line: 2207, column: 9)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !686, line: 51, baseType: !165)
!1023 = !DILocalVariable(name: "p", scope: !1024, file: !3, line: 2224, type: !1026)
!1024 = distinct !DILexicalBlock(scope: !1025, file: !3, line: 2212, column: 13)
!1025 = distinct !DILexicalBlock(scope: !1021, file: !3, line: 2211, column: 15)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !682)
!1028 = !DILocalVariable(name: "i", scope: !1029, file: !3, line: 2250, type: !57)
!1029 = distinct !DILexicalBlock(scope: !1030, file: !3, line: 2250, column: 19)
!1030 = distinct !DILexicalBlock(scope: !1031, file: !3, line: 2249, column: 17)
!1031 = distinct !DILexicalBlock(scope: !1032, file: !3, line: 2248, column: 19)
!1032 = distinct !DILexicalBlock(scope: !1021, file: !3, line: 2232, column: 13)
!1033 = !DICompositeType(tag: DW_TAG_array_type, baseType: !683, size: 56, elements: !1034)
!1034 = !{!1035}
!1035 = !DISubrange(count: 7)
!1036 = !DIGlobalVariableExpression(var: !1037, expr: !DIExpression())
!1037 = distinct !DIGlobalVariable(name: "qmark_funny_chars", scope: !2, file: !3, line: 711, type: !91, isLocal: true, isDefinition: true)
!1038 = !DIGlobalVariableExpression(var: !1039, expr: !DIExpression())
!1039 = distinct !DIGlobalVariable(name: "time_type", scope: !2, file: !3, line: 464, type: !225, isLocal: true, isDefinition: true)
!1040 = !DIGlobalVariableExpression(var: !1041, expr: !DIExpression())
!1041 = distinct !DIGlobalVariable(name: "sort_reverse", scope: !2, file: !3, line: 489, type: !91, isLocal: true, isDefinition: true)
!1042 = !DIGlobalVariableExpression(var: !1043, expr: !DIExpression())
!1043 = distinct !DIGlobalVariable(name: "numeric_ids", scope: !2, file: !3, line: 506, type: !91, isLocal: true, isDefinition: true)
!1044 = !DIGlobalVariableExpression(var: !1045, expr: !DIExpression())
!1045 = distinct !DIGlobalVariable(name: "print_inode", scope: !2, file: !3, line: 649, type: !91, isLocal: true, isDefinition: true)
!1046 = !DIGlobalVariableExpression(var: !1047, expr: !DIExpression())
!1047 = distinct !DIGlobalVariable(name: "ignore_mode", scope: !2, file: !3, line: 683, type: !231, isLocal: true, isDefinition: true)
!1048 = !DIGlobalVariableExpression(var: !1049, expr: !DIExpression())
!1049 = distinct !DIGlobalVariable(name: "ignore_patterns", scope: !2, file: !3, line: 696, type: !995, isLocal: true, isDefinition: true)
!1050 = !DIGlobalVariableExpression(var: !1051, expr: !DIExpression())
!1051 = distinct !DIGlobalVariable(name: "hide_patterns", scope: !2, file: !3, line: 700, type: !995, isLocal: true, isDefinition: true)
!1052 = !DIGlobalVariableExpression(var: !1053, expr: !DIExpression())
!1053 = distinct !DIGlobalVariable(name: "line_length", scope: !2, file: !3, line: 729, type: !685, isLocal: true, isDefinition: true)
!1054 = !DIGlobalVariableExpression(var: !1055, expr: !DIExpression())
!1055 = distinct !DIGlobalVariable(name: "tabsize", scope: !2, file: !3, line: 720, type: !685, isLocal: true, isDefinition: true)
!1056 = !DIGlobalVariableExpression(var: !1057, expr: !DIExpression())
!1057 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 839, type: !1058, isLocal: true, isDefinition: true)
!1058 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1059, size: 11264, elements: !1068)
!1059 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1060)
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !1061, line: 50, size: 256, elements: !1062)
!1061 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!1062 = !{!1063, !1064, !1065, !1067}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1060, file: !1061, line: 52, baseType: !682, size: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !1060, file: !1061, line: 55, baseType: !57, size: 32, offset: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1060, file: !1061, line: 56, baseType: !1066, size: 64, offset: 128)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1060, file: !1061, line: 57, baseType: !57, size: 32, offset: 192)
!1068 = !{!1069}
!1069 = !DISubrange(count: 44)
!1070 = !DIGlobalVariableExpression(var: !1071, expr: !DIExpression())
!1071 = distinct !DIGlobalVariable(name: "print_owner", scope: !2, file: !3, line: 493, type: !91, isLocal: true, isDefinition: true)
!1072 = !DIGlobalVariableExpression(var: !1073, expr: !DIExpression())
!1073 = distinct !DIGlobalVariable(name: "human_output_opts", scope: !2, file: !3, line: 513, type: !57, isLocal: true, isDefinition: true)
!1074 = !DIGlobalVariableExpression(var: !1075, expr: !DIExpression())
!1075 = distinct !DIGlobalVariable(name: "file_human_output_opts", scope: !2, file: !3, line: 519, type: !57, isLocal: true, isDefinition: true)
!1076 = !DIGlobalVariableExpression(var: !1077, expr: !DIExpression())
!1077 = distinct !DIGlobalVariable(name: "output_block_size", scope: !2, file: !3, line: 516, type: !738, isLocal: true, isDefinition: true)
!1078 = !DIGlobalVariableExpression(var: !1079, expr: !DIExpression())
!1079 = distinct !DIGlobalVariable(name: "file_output_block_size", scope: !2, file: !3, line: 520, type: !738, isLocal: true, isDefinition: true)
!1080 = !DIGlobalVariableExpression(var: !1081, expr: !DIExpression())
!1081 = distinct !DIGlobalVariable(name: "print_group", scope: !2, file: !3, line: 501, type: !91, isLocal: true, isDefinition: true)
!1082 = !DIGlobalVariableExpression(var: !1083, expr: !DIExpression())
!1083 = distinct !DIGlobalVariable(name: "print_author", scope: !2, file: !3, line: 497, type: !91, isLocal: true, isDefinition: true)
!1084 = !DIGlobalVariableExpression(var: !1085, expr: !DIExpression())
!1085 = distinct !DIGlobalVariable(name: "sort_types", scope: !2, file: !3, line: 905, type: !1086, isLocal: true, isDefinition: true)
!1086 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1087, size: 160, elements: !1088)
!1087 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!1088 = !{!1089}
!1089 = !DISubrange(count: 5)
!1090 = !DIGlobalVariableExpression(var: !1091, expr: !DIExpression())
!1091 = distinct !DIGlobalVariable(name: "sort_args", scope: !2, file: !3, line: 901, type: !1092, isLocal: true, isDefinition: true)
!1092 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1027, size: 384, elements: !1093)
!1093 = !{!1094}
!1094 = !DISubrange(count: 6)
!1095 = !DIGlobalVariableExpression(var: !1096, expr: !DIExpression())
!1096 = distinct !DIGlobalVariable(name: "time_types", scope: !2, file: !3, line: 915, type: !1097, isLocal: true, isDefinition: true)
!1097 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1098, size: 160, elements: !1088)
!1098 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !225)
!1099 = !DIGlobalVariableExpression(var: !1100, expr: !DIExpression())
!1100 = distinct !DIGlobalVariable(name: "time_args", scope: !2, file: !3, line: 911, type: !1092, isLocal: true, isDefinition: true)
!1101 = !DIGlobalVariableExpression(var: !1102, expr: !DIExpression())
!1102 = distinct !DIGlobalVariable(name: "format_types", scope: !2, file: !3, line: 894, type: !1103, isLocal: true, isDefinition: true)
!1103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1104, size: 224, elements: !1034)
!1104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!1105 = !DIGlobalVariableExpression(var: !1106, expr: !DIExpression())
!1106 = distinct !DIGlobalVariable(name: "format_args", scope: !2, file: !3, line: 889, type: !1107, isLocal: true, isDefinition: true)
!1107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1027, size: 512, elements: !1108)
!1108 = !{!1109}
!1109 = !DISubrange(count: 8)
!1110 = !DIGlobalVariableExpression(var: !1111, expr: !DIExpression())
!1111 = distinct !DIGlobalVariable(name: "when_types", scope: !2, file: !3, line: 928, type: !1112, isLocal: true, isDefinition: true)
!1112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1113, size: 288, elements: !1114)
!1113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !257)
!1114 = !{!1115}
!1115 = !DISubrange(count: 9)
!1116 = !DIGlobalVariableExpression(var: !1117, expr: !DIExpression())
!1117 = distinct !DIGlobalVariable(name: "when_args", scope: !2, file: !3, line: 921, type: !1118, isLocal: true, isDefinition: true)
!1118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1027, size: 640, elements: !1119)
!1119 = !{!1120}
!1120 = !DISubrange(count: 10)
!1121 = !DIGlobalVariableExpression(var: !1122, expr: !DIExpression())
!1122 = distinct !DIGlobalVariable(name: "indicator_style_types", scope: !2, file: !3, line: 549, type: !1123, isLocal: true, isDefinition: true)
!1123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1124, size: 128, elements: !1125)
!1124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!1125 = !{!1126}
!1126 = !DISubrange(count: 4)
!1127 = !DIGlobalVariableExpression(var: !1128, expr: !DIExpression())
!1128 = distinct !DIGlobalVariable(name: "indicator_style_args", scope: !2, file: !3, line: 545, type: !1129, isLocal: true, isDefinition: true)
!1129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1027, size: 320, elements: !1088)
!1130 = !DIGlobalVariableExpression(var: !1131, expr: !DIExpression())
!1131 = distinct !DIGlobalVariable(name: "max_idx", scope: !2, file: !3, line: 948, type: !685, isLocal: true, isDefinition: true)
!1132 = !DIGlobalVariableExpression(var: !1133, expr: !DIExpression())
!1133 = distinct !DIGlobalVariable(name: "align_variable_outer_quotes", scope: !2, file: !3, line: 343, type: !91, isLocal: true, isDefinition: true)
!1134 = !DIGlobalVariableExpression(var: !1135, expr: !DIExpression())
