source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.F_triple = type { i8*, i64, i64 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__dirstream = type opaque
%struct.__jmp_buf_tag = type { [8 x i64], i32, %struct.__sigset_t }
%struct.__mbstate_t = type { i32, %union.anon.12 }
%struct.__sigset_t = type { [16 x i64] }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct._cap_struct = type opaque
%struct._obstack_chunk = type { i8*, %struct._obstack_chunk*, [0 x i8] }
%struct.bin_str = type { i64, i8* }
%struct.color_ext_type = type { %struct.bin_str, %struct.bin_str, %struct.color_ext_type* }
%struct.column_info = type { i8, i64, i64* }
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%struct.fileinfo = type { i8*, i8*, i8*, %struct.stat, i32, i32, i8*, i8, i8, i32, i8, i32 }
%struct.group = type { i8*, i8*, i32, i8** }
%struct.hash_entry = type { i8*, %struct.hash_entry* }

!56 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sort_type", file: !3, line: 477, baseType: !57, size: 32, elements: !58)
!57 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!58 = !{!59, !60, !61, !62, !63, !64, !65}
!59 = !DIEnumerator(name: "sort_none", value: -1)
!60 = !DIEnumerator(name: "sort_name", value: 0)
!61 = !DIEnumerator(name: "sort_extension", value: 1)
!62 = !DIEnumerator(name: "sort_size", value: 2)
!63 = !DIEnumerator(name: "sort_version", value: 3)
!64 = !DIEnumerator(name: "sort_time", value: 4)
!65 = !DIEnumerator(name: "sort_numtypes", value: 5)
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "filetype", file: !3, line: 170, baseType: !6, size: 32, elements: !67)
!67 = !{!68, !69, !70, !71, !72, !73, !74, !75, !76, !77}
!68 = !DIEnumerator(name: "unknown", value: 0, isUnsigned: true)
!69 = !DIEnumerator(name: "fifo", value: 1, isUnsigned: true)
!70 = !DIEnumerator(name: "chardev", value: 2, isUnsigned: true)
!71 = !DIEnumerator(name: "directory", value: 3, isUnsigned: true)
!72 = !DIEnumerator(name: "blockdev", value: 4, isUnsigned: true)
!73 = !DIEnumerator(name: "normal", value: 5, isUnsigned: true)
!74 = !DIEnumerator(name: "symbolic_link", value: 6, isUnsigned: true)
!75 = !DIEnumerator(name: "sock", value: 7, isUnsigned: true)
!76 = !DIEnumerator(name: "whiteout", value: 8, isUnsigned: true)
!77 = !DIEnumerator(name: "arg_directory", value: 9, isUnsigned: true)
!78 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !79, line: 112, baseType: !6, size: 32, elements: !80)
!79 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!80 = !{!81}
!81 = !DIEnumerator(name: "NOT_AN_INODE_NUMBER", value: 0, isUnsigned: true)
!82 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !83, line: 32, baseType: !6, size: 32, elements: !84)
!83 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!84 = !{!85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95}
!85 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!86 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!87 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!88 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!89 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!90 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!91 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!92 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!93 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!94 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!95 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!96 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "acl_type", file: !3, line: 198, baseType: !6, size: 32, elements: !97)
!97 = !{!98, !99, !100}
!98 = !DIEnumerator(name: "ACL_T_NONE", value: 0, isUnsigned: true)
!99 = !DIEnumerator(name: "ACL_T_LSM_CONTEXT_ONLY", value: 1, isUnsigned: true)
!100 = !DIEnumerator(name: "ACL_T_YES", value: 2, isUnsigned: true)
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !102, file: !3, line: 1556, baseType: !6, size: 32, elements: !223)
!102 = distinct !DISubprogram(name: "signal_setup", scope: !3, file: !3, line: 1530, type: !103, scopeLine: 1531, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !106)
!103 = !DISubroutineType(types: !104)
!104 = !{null, !105}
!105 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!106 = !{!107, !108, !109}
!107 = !DILocalVariable(name: "init", arg: 1, scope: !102, file: !3, line: 1530, type: !105)
!108 = !DILocalVariable(name: "j", scope: !102, file: !3, line: 1562, type: !57)
!109 = !DILocalVariable(name: "act", scope: !110, file: !3, line: 1567, type: !112)
!110 = distinct !DILexicalBlock(scope: !111, file: !3, line: 1565, column: 5)
!111 = distinct !DILexicalBlock(scope: !102, file: !3, line: 1564, column: 7)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !113, line: 27, size: 1216, elements: !114)
!113 = !DIFile(filename: "/usr/include/bits/sigaction.h", directory: "")
!114 = !{!115, !208, !218, !219}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !112, file: !113, line: 38, baseType: !116, size: 64)
!116 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !112, file: !113, line: 31, size: 64, elements: !117)
!117 = !{!118, !124}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !116, file: !113, line: 34, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !120, line: 72, baseType: !121)
!120 = !DIFile(filename: "/usr/include/signal.h", directory: "")
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{null, !57}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !116, file: !113, line: 36, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{null, !57, !128, !164}
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !130, line: 124, baseType: !131)
!130 = !DIFile(filename: "/usr/include/bits/types/siginfo_t.h", directory: "")
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !130, line: 36, size: 1024, elements: !132)
!132 = !{!133, !134, !135, !136, !137}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !131, file: !130, line: 38, baseType: !57, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !131, file: !130, line: 40, baseType: !57, size: 32, offset: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !131, file: !130, line: 42, baseType: !57, size: 32, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !131, file: !130, line: 48, baseType: !57, size: 32, offset: 96)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !131, file: !130, line: 123, baseType: !138, size: 896, offset: 128)
!138 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !131, file: !130, line: 51, size: 896, elements: !139)
!139 = !{!140, !144, !152, !165, !171, !181, !197, !202}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !138, file: !130, line: 53, baseType: !141, size: 896)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 896, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 28)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !138, file: !130, line: 60, baseType: !145, size: 64)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !138, file: !130, line: 56, size: 64, elements: !146)
!146 = !{!147, !150}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !145, file: !130, line: 58, baseType: !148, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !149, line: 154, baseType: !57)
!149 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!150 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !145, file: !130, line: 59, baseType: !151, size: 32, offset: 32)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !149, line: 146, baseType: !6)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !138, file: !130, line: 68, baseType: !153, size: 128)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !138, file: !130, line: 63, size: 128, elements: !154)
!154 = !{!155, !156, !157}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !153, file: !130, line: 65, baseType: !57, size: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !153, file: !130, line: 66, baseType: !57, size: 32, offset: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !153, file: !130, line: 67, baseType: !158, size: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigval_t", file: !159, line: 30, baseType: !160)
!159 = !DIFile(filename: "/usr/include/bits/types/__sigval_t.h", directory: "")
!160 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !159, line: 24, size: 64, elements: !161)
!161 = !{!162, !163}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !160, file: !159, line: 26, baseType: !57, size: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !160, file: !159, line: 27, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !138, file: !130, line: 76, baseType: !166, size: 128)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !138, file: !130, line: 71, size: 128, elements: !167)
!167 = !{!168, !169, !170}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !166, file: !130, line: 73, baseType: !148, size: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !166, file: !130, line: 74, baseType: !151, size: 32, offset: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !166, file: !130, line: 75, baseType: !158, size: 64, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !138, file: !130, line: 86, baseType: !172, size: 256)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !138, file: !130, line: 79, size: 256, elements: !173)
!173 = !{!174, !175, !176, !177, !180}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !172, file: !130, line: 81, baseType: !148, size: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !172, file: !130, line: 82, baseType: !151, size: 32, offset: 32)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !172, file: !130, line: 83, baseType: !57, size: 32, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !172, file: !130, line: 84, baseType: !178, size: 64, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !149, line: 156, baseType: !179)
!179 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !172, file: !130, line: 85, baseType: !178, size: 64, offset: 192)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !138, file: !130, line: 105, baseType: !182, size: 256)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !138, file: !130, line: 89, size: 256, elements: !183)
!183 = !{!184, !185, !187}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !182, file: !130, line: 91, baseType: !164, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_lsb", scope: !182, file: !130, line: 93, baseType: !186, size: 16, offset: 64)
!186 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_bounds", scope: !182, file: !130, line: 104, baseType: !188, size: 128, offset: 128)
!188 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !182, file: !130, line: 94, size: 128, elements: !189)
!189 = !{!190, !195}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_bnd", scope: !188, file: !130, line: 101, baseType: !191, size: 128)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !188, file: !130, line: 97, size: 128, elements: !192)
!192 = !{!193, !194}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_lower", scope: !191, file: !130, line: 99, baseType: !164, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_upper", scope: !191, file: !130, line: 100, baseType: !164, size: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_pkey", scope: !188, file: !130, line: 103, baseType: !196, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !149, line: 42, baseType: !6)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !138, file: !130, line: 112, baseType: !198, size: 128)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !138, file: !130, line: 108, size: 128, elements: !199)
!199 = !{!200, !201}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !198, file: !130, line: 110, baseType: !179, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "si_fd", scope: !198, file: !130, line: 111, baseType: !57, size: 32, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !138, file: !130, line: 121, baseType: !203, size: 128)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !138, file: !130, line: 116, size: 128, elements: !204)
!204 = !{!205, !206, !207}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !203, file: !130, line: 118, baseType: !164, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !203, file: !130, line: 119, baseType: !57, size: 32, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !203, file: !130, line: 120, baseType: !6, size: 32, offset: 96)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !112, file: !113, line: 46, baseType: !209, size: 1024, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !210, line: 8, baseType: !211)
!210 = !DIFile(filename: "/usr/include/bits/types/__sigset_t.h", directory: "")
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !210, line: 5, size: 1024, elements: !212)
!212 = !{!213}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !211, file: !210, line: 7, baseType: !214, size: 1024)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 1024, elements: !216)
!215 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!216 = !{!217}
!217 = !DISubrange(count: 16)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !112, file: !113, line: 49, baseType: !57, size: 32, offset: 1088)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !112, file: !113, line: 52, baseType: !220, size: 64, offset: 1152)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{null}
!223 = !{!224}
!224 = !DIEnumerator(name: "nsigs", value: 12, isUnsigned: true)
!225 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "time_type", file: !3, line: 462, baseType: !6, size: 32, elements: !226)
!226 = !{!227, !228, !229, !230, !231}
!227 = !DIEnumerator(name: "time_mtime", value: 0, isUnsigned: true)
!228 = !DIEnumerator(name: "time_ctime", value: 1, isUnsigned: true)
!229 = !DIEnumerator(name: "time_atime", value: 2, isUnsigned: true)
!230 = !DIEnumerator(name: "time_btime", value: 3, isUnsigned: true)
!231 = !DIEnumerator(name: "time_numtypes", value: 4, isUnsigned: true)
!232 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 679, baseType: !6, size: 32, elements: !233)
!233 = !{!234, !235, !236}
!234 = !DIEnumerator(name: "IGNORE_DEFAULT", value: 0, isUnsigned: true)
!235 = !DIEnumerator(name: "IGNORE_DOT_AND_DOTDOT", value: 1, isUnsigned: true)
!236 = !DIEnumerator(name: "IGNORE_MINIMAL", value: 2, isUnsigned: true)
!237 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !238, line: 25, baseType: !6, size: 32, elements: !239)
!238 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!239 = !{!240, !241, !242, !243, !244}
!240 = !DIEnumerator(name: "LONGINT_OK", value: 0, isUnsigned: true)
!241 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1, isUnsigned: true)
!242 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2, isUnsigned: true)
!243 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3, isUnsigned: true)
!244 = !DIEnumerator(name: "LONGINT_INVALID", value: 4, isUnsigned: true)
!245 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !246, line: 43, baseType: !6, size: 32, elements: !247)
!246 = !DIFile(filename: "./lib/human.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!247 = !{!248, !249, !250, !251, !252, !253, !254, !255, !256, !257}
!248 = !DIEnumerator(name: "human_ceiling", value: 0, isUnsigned: true)
!249 = !DIEnumerator(name: "human_round_to_nearest", value: 1, isUnsigned: true)
!250 = !DIEnumerator(name: "human_floor", value: 2, isUnsigned: true)
!251 = !DIEnumerator(name: "human_group_digits", value: 4, isUnsigned: true)
!252 = !DIEnumerator(name: "human_suppress_point_zero", value: 8, isUnsigned: true)
!253 = !DIEnumerator(name: "human_autoscale", value: 16, isUnsigned: true)
!254 = !DIEnumerator(name: "human_base_1024", value: 32, isUnsigned: true)
!255 = !DIEnumerator(name: "human_space_before_unit", value: 64, isUnsigned: true)
!256 = !DIEnumerator(name: "human_SI", value: 128, isUnsigned: true)
!257 = !DIEnumerator(name: "human_B", value: 256, isUnsigned: true)
!258 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "when_type", file: !3, line: 576, baseType: !6, size: 32, elements: !259)
!259 = !{!260, !261, !262}
!260 = !DIEnumerator(name: "when_never", value: 0, isUnsigned: true)
!261 = !DIEnumerator(name: "when_always", value: 1, isUnsigned: true)
!262 = !DIEnumerator(name: "when_if_tty", value: 2, isUnsigned: true)
!263 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "time_style", file: !3, line: 439, baseType: !6, size: 32, elements: !264)
!264 = !{!265, !266, !267, !268}
!265 = !DIEnumerator(name: "full_iso_time_style", value: 0, isUnsigned: true)
!266 = !DIEnumerator(name: "long_iso_time_style", value: 1, isUnsigned: true)
!267 = !DIEnumerator(name: "iso_time_style", value: 2, isUnsigned: true)
!268 = !DIEnumerator(name: "locale_time_style", value: 3, isUnsigned: true)
!269 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 1281, baseType: !6, size: 32, elements: !270)
!270 = !{!271}
!271 = !DIEnumerator(name: "ABFORMAT_SIZE", value: 128, isUnsigned: true)
!272 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 1278, baseType: !6, size: 32, elements: !273)
!273 = !{!274}
!274 = !DIEnumerator(name: "MAX_MON_WIDTH", value: 12, isUnsigned: true)
!275 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !276, line: 41, baseType: !6, size: 32, elements: !277)
!276 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!277 = !{!278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660}
!278 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!279 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!280 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!281 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!282 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!283 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!284 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!285 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!286 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!287 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!288 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!289 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!290 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!291 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!292 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!293 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!294 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!295 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!296 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!297 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!298 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!299 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!300 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!301 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!302 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!303 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!304 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!305 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!306 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!307 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!308 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!309 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!310 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!311 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!312 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!313 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!314 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!315 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!316 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!317 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!318 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!319 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!320 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!321 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!322 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!323 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!324 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!325 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!326 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!327 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!328 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!329 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!330 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!331 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!332 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!333 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!334 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!335 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!336 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!337 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!338 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!339 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!340 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!341 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!342 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!343 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!344 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!345 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!346 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!347 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!348 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!349 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!350 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!351 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!352 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!353 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!354 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!355 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!356 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!357 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!358 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!359 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!360 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!361 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!362 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!363 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!364 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!365 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!366 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!367 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!368 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!369 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!370 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!371 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!372 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!373 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!374 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!375 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!376 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!377 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!378 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!379 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!380 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!381 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!382 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!383 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!384 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!385 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!386 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!387 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!388 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!389 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!390 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!391 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!392 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!393 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!394 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!395 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!396 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!397 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!398 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!399 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!400 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!401 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!402 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!403 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!404 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!405 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!406 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!407 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!408 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!409 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!410 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!411 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!412 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!413 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!414 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!415 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!416 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!417 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!418 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!419 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!420 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!421 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!422 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!423 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!424 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!425 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!426 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!427 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!428 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!429 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!430 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!431 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!432 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!433 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!434 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!435 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!436 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!437 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!438 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!439 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!440 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!441 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!442 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!443 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!444 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!445 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!446 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!447 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!448 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!449 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!450 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!451 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!452 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!453 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!454 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!455 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!456 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!457 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!458 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!459 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!460 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!461 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!462 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!463 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!464 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!465 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!466 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!467 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!468 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!469 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!470 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!471 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!472 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!473 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!474 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!475 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!476 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!477 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!478 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!479 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!480 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!481 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!482 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!483 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!484 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!485 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!486 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!487 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!488 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!489 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!490 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!491 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!492 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!493 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!494 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!495 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!496 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!497 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!498 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!499 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!500 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!501 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!502 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!503 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!504 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!505 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!506 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!507 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!508 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!509 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!510 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!511 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!512 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!513 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!514 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!515 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!516 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!517 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!518 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!519 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!520 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!521 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!522 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!523 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!524 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!525 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!526 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!527 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!528 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!529 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!530 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!531 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!532 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!533 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!534 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!535 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!536 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!537 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!538 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!539 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!540 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!541 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!542 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!543 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!544 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!545 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!546 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!547 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!548 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!549 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!550 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!551 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!552 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!553 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!554 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!555 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!556 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!557 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!558 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!559 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!560 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!561 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!562 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!563 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!564 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!565 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!566 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!567 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!568 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!569 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!570 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!571 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!572 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!573 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!574 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!575 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!576 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!577 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!578 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!579 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!580 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!581 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!582 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!583 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!584 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!585 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!586 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!587 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!588 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!589 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!590 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!591 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!592 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!593 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!594 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!595 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!596 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!597 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!598 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!599 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!600 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!601 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!602 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!603 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!604 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!605 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!606 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!607 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!608 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!609 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!610 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!611 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!612 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!613 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!614 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!615 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!616 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!617 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!618 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!619 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!620 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!621 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!622 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!623 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!624 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!625 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!626 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!627 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!628 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!629 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!630 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!631 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!632 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!633 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!634 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!635 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!636 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!637 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!661 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !662, line: 19, baseType: !6, size: 32, elements: !663)
!662 = !DIFile(filename: "./lib/mbsalign.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!663 = !{!664, !665, !666}
!664 = !DIEnumerator(name: "MBS_ALIGN_LEFT", value: 0, isUnsigned: true)
!665 = !DIEnumerator(name: "MBS_ALIGN_RIGHT", value: 1, isUnsigned: true)
!666 = !DIEnumerator(name: "MBS_ALIGN_CENTER", value: 2, isUnsigned: true)
!667 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !668, line: 46, baseType: !6, size: 32, elements: !669)
!668 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!669 = !{!670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681}
!670 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!671 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!672 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!673 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!674 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!675 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!676 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!677 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!678 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!679 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!680 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!681 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!682 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "parse_state", file: !3, line: 2648, baseType: !6, size: 32, elements: !683)
!683 = !{!684, !685, !686, !687, !688, !689}
!684 = !DIEnumerator(name: "PS_START", value: 1, isUnsigned: true)
!685 = !DIEnumerator(name: "PS_2", value: 2, isUnsigned: true)
!686 = !DIEnumerator(name: "PS_3", value: 3, isUnsigned: true)
!687 = !DIEnumerator(name: "PS_4", value: 4, isUnsigned: true)
!688 = !DIEnumerator(name: "PS_DONE", value: 5, isUnsigned: true)
!689 = !DIEnumerator(name: "PS_FAIL", value: 6, isUnsigned: true)
!690 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !691, file: !3, line: 2459, baseType: !6, size: 32, elements: !713)
!691 = distinct !DISubprogram(name: "get_funky_string", scope: !3, file: !3, line: 2454, type: !692, scopeLine: 2456, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !703)
!692 = !DISubroutineType(types: !693)
!693 = !{!105, !694, !697, !105, !700}
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !696)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !702, line: 46, baseType: !215)
!702 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!703 = !{!704, !705, !706, !707, !708, !709, !710, !711, !712}
!704 = !DILocalVariable(name: "dest", arg: 1, scope: !691, file: !3, line: 2454, type: !694)
!705 = !DILocalVariable(name: "src", arg: 2, scope: !691, file: !3, line: 2454, type: !697)
!706 = !DILocalVariable(name: "equals_end", arg: 3, scope: !691, file: !3, line: 2454, type: !105)
!707 = !DILocalVariable(name: "output_count", arg: 4, scope: !691, file: !3, line: 2455, type: !700)
!708 = !DILocalVariable(name: "num", scope: !691, file: !3, line: 2457, type: !696)
!709 = !DILocalVariable(name: "count", scope: !691, file: !3, line: 2458, type: !701)
!710 = !DILocalVariable(name: "state", scope: !691, file: !3, line: 2461, type: !690)
!711 = !DILocalVariable(name: "p", scope: !691, file: !3, line: 2462, type: !698)
!712 = !DILocalVariable(name: "q", scope: !691, file: !3, line: 2463, type: !695)
!713 = !{!714, !715, !716, !717, !718, !719, !720}
!714 = !DIEnumerator(name: "ST_GND", value: 0, isUnsigned: true)
!715 = !DIEnumerator(name: "ST_BACKSLASH", value: 1, isUnsigned: true)
!716 = !DIEnumerator(name: "ST_OCTAL", value: 2, isUnsigned: true)
!717 = !DIEnumerator(name: "ST_HEX", value: 3, isUnsigned: true)
!718 = !DIEnumerator(name: "ST_CARET", value: 4, isUnsigned: true)
!719 = !DIEnumerator(name: "ST_END", value: 5, isUnsigned: true)
!720 = !DIEnumerator(name: "ST_ERROR", value: 6, isUnsigned: true)
!721 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "canonicalize_mode_t", file: !722, line: 28, baseType: !6, size: 32, elements: !723)
!722 = !DIFile(filename: "./lib/canonicalize.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!723 = !{!724, !725, !726, !727}
!724 = !DIEnumerator(name: "CAN_EXISTING", value: 0, isUnsigned: true)
!725 = !DIEnumerator(name: "CAN_ALL_BUT_LAST", value: 1, isUnsigned: true)
!726 = !DIEnumerator(name: "CAN_MISSING", value: 2, isUnsigned: true)
!727 = !DIEnumerator(name: "CAN_NOLINKS", value: 4, isUnsigned: true)
!728 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !729, line: 42, baseType: !6, size: 32, elements: !730)
!729 = !DIFile(filename: "./lib/timespec.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!730 = !{!731}
!731 = !DIEnumerator(name: "TIMESPEC_HZ", value: 1000000000, isUnsigned: true)
!732 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 758, baseType: !6, size: 32, elements: !733)
!733 = !{!734}
!734 = !DIEnumerator(name: "TIME_STAMP_LEN_MAXIMUM", value: 1000, isUnsigned: true)
!735 = !{!736, !741, !745, !749, !752, !756, !759, !164, !786, !788, !841, !842, !848, !852, !855, !910, !913, !919, !924, !927, !930, !933, !936, !701, !937, !938, !939, !698, !941, !944, !948, !119, !954, !957, !962, !700, !695, !215, !965, !969, !970, !974, !978, !982, !986, !1001, !778, !1005, !1008, !1012, !1016, !1019, !1022, !1026, !1032, !1035, !57, !884, !1038, !1041, !1042, !1046, !1052, !1055, !1056, !1059, !1062, !1078, !1081, !1084, !1087, !1133, !1134, !1135, !1138, !1141, !1158, !1160, !1165, !1169, !1172, !1175, !1179, !1182, !1188, !1192, !1195, !1233, !1237, !1241, !1245, !1246, !1248, !1252, !1253, !1254, !1261, !1265, !1268, !1285, !1287, !1291, !1295, !1315, !1319, !1325}
!736 = !DISubprogram(name: "set_program_name", scope: !737, file: !737, line: 37, type: !738, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!737 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!738 = !DISubroutineType(types: !739)
!739 = !{null, !698}
!740 = !{}
!741 = !DISubprogram(name: "setlocale", scope: !742, file: !742, line: 122, type: !743, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!742 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!743 = !DISubroutineType(types: !744)
!744 = !{!695, !57, !698}
!745 = !DISubprogram(name: "bindtextdomain", scope: !746, file: !746, line: 86, type: !747, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!746 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!747 = !DISubroutineType(types: !748)
!748 = !{!695, !698, !698}
!749 = !DISubprogram(name: "textdomain", scope: !746, file: !746, line: 82, type: !750, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!750 = !DISubroutineType(types: !751)
!751 = !{!695, !698}
!752 = !DISubprogram(name: "atexit", scope: !753, file: !753, line: 595, type: !754, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!753 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!754 = !DISubroutineType(types: !755)
!755 = !{!57, !220}
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !757, line: 7, baseType: !758)
!757 = !DIFile(filename: "/usr/include/bits/types/time_t.h", directory: "")
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !149, line: 160, baseType: !179)
!759 = !DISubprogram(name: "hash_initialize", scope: !760, file: !760, line: 89, type: !761, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!760 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!761 = !DISubroutineType(types: !762)
!762 = !{!763, !215, !765, !775, !780, !783}
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !760, line: 67, flags: DIFlagFwdDecl)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !767)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !760, line: 53, size: 160, elements: !768)
!768 = !{!769, !771, !772, !773, !774}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !767, file: !760, line: 58, baseType: !770, size: 32)
!770 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !767, file: !760, line: 59, baseType: !770, size: 32, offset: 32)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !767, file: !760, line: 60, baseType: !770, size: 32, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !767, file: !760, line: 61, baseType: !770, size: 32, offset: 96)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !767, file: !760, line: 62, baseType: !105, size: 8, offset: 128)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DISubroutineType(types: !777)
!777 = !{!215, !778, !215}
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DISubroutineType(types: !782)
!782 = !{!105, !778, !778}
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DISubroutineType(types: !785)
!785 = !{null, !164}
!786 = !DISubprogram(name: "xalloc_die", scope: !787, file: !787, line: 51, type: !221, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !740)
!787 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!788 = !DISubprogram(name: "_obstack_begin", scope: !789, file: !789, line: 215, type: !790, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!789 = !DIFile(filename: "./lib/obstack.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!790 = !DISubroutineType(types: !791)
!791 = !{!57, !792, !215, !215, !838, !783}
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !789, line: 174, size: 704, elements: !794)
!794 = !{!795, !796, !806, !807, !808, !809, !814, !815, !826, !834, !835, !836, !837}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !793, file: !789, line: 176, baseType: !701, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !793, file: !789, line: 177, baseType: !797, size: 64, offset: 64)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !789, line: 167, size: 128, elements: !799)
!799 = !{!800, !801, !802}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !798, file: !789, line: 169, baseType: !695, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !798, file: !789, line: 170, baseType: !797, size: 64, offset: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !798, file: !789, line: 171, baseType: !803, offset: 128)
!803 = !DICompositeType(tag: DW_TAG_array_type, baseType: !696, elements: !804)
!804 = !{!805}
!805 = !DISubrange(count: -1)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !793, file: !789, line: 178, baseType: !695, size: 64, offset: 128)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !793, file: !789, line: 179, baseType: !695, size: 64, offset: 192)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !793, file: !789, line: 180, baseType: !695, size: 64, offset: 256)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !793, file: !789, line: 185, baseType: !810, size: 64, offset: 320)
!810 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !793, file: !789, line: 181, size: 64, elements: !811)
!811 = !{!812, !813}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !810, file: !789, line: 183, baseType: !701, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !810, file: !789, line: 184, baseType: !164, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !793, file: !789, line: 186, baseType: !701, size: 64, offset: 384)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !793, file: !789, line: 193, baseType: !816, size: 64, offset: 448)
!816 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !793, file: !789, line: 189, size: 64, elements: !817)
!817 = !{!818, !822}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !816, file: !789, line: 191, baseType: !819, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DISubroutineType(types: !821)
!821 = !{!164, !701}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !816, file: !789, line: 192, baseType: !823, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DISubroutineType(types: !825)
!825 = !{!164, !164, !701}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !793, file: !789, line: 198, baseType: !827, size: 64, offset: 512)
!827 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !793, file: !789, line: 194, size: 64, elements: !828)
!828 = !{!829, !830}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !827, file: !789, line: 196, baseType: !783, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !827, file: !789, line: 197, baseType: !831, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DISubroutineType(types: !833)
!833 = !{null, !164, !164}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !793, file: !789, line: 200, baseType: !164, size: 64, offset: 576)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !793, file: !789, line: 201, baseType: !6, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !793, file: !789, line: 202, baseType: !6, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !793, file: !789, line: 206, baseType: !6, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DISubroutineType(types: !840)
!840 = !{!164, !215}
!841 = !DISubprogram(name: "getenv", scope: !753, file: !753, line: 634, type: !750, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!842 = !DISubprogram(name: "tzalloc", scope: !843, file: !843, line: 779, type: !844, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!843 = !DIFile(filename: "./lib/time.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!844 = !DISubroutineType(types: !845)
!845 = !{!846, !698}
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !843, line: 778, flags: DIFlagFwdDecl)
!848 = !DISubprogram(name: "xgethostname", scope: !849, file: !849, line: 1, type: !850, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!849 = !DIFile(filename: "./lib/xgethostname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!850 = !DISubroutineType(types: !851)
!851 = !{!695}
!852 = !DISubprogram(name: "hash_delete", scope: !760, file: !760, line: 104, type: !853, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!853 = !DISubroutineType(types: !854)
!854 = !{!164, !763, !778}
!855 = !DISubprogram(name: "fflush_unlocked", scope: !856, file: !856, line: 227, type: !857, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!856 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!857 = !DISubroutineType(types: !858)
!858 = !{!57, !859}
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !861, line: 49, size: 1728, elements: !862)
!861 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!862 = !{!863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !878, !879, !880, !881, !883, !885, !887, !891, !894, !896, !899, !902, !903, !904, !905, !906}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !860, file: !861, line: 51, baseType: !57, size: 32)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !860, file: !861, line: 54, baseType: !695, size: 64, offset: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !860, file: !861, line: 55, baseType: !695, size: 64, offset: 128)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !860, file: !861, line: 56, baseType: !695, size: 64, offset: 192)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !860, file: !861, line: 57, baseType: !695, size: 64, offset: 256)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !860, file: !861, line: 58, baseType: !695, size: 64, offset: 320)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !860, file: !861, line: 59, baseType: !695, size: 64, offset: 384)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !860, file: !861, line: 60, baseType: !695, size: 64, offset: 448)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !860, file: !861, line: 61, baseType: !695, size: 64, offset: 512)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !860, file: !861, line: 64, baseType: !695, size: 64, offset: 576)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !860, file: !861, line: 65, baseType: !695, size: 64, offset: 640)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !860, file: !861, line: 66, baseType: !695, size: 64, offset: 704)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !860, file: !861, line: 68, baseType: !876, size: 64, offset: 768)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !861, line: 36, flags: DIFlagFwdDecl)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !860, file: !861, line: 70, baseType: !859, size: 64, offset: 832)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !860, file: !861, line: 72, baseType: !57, size: 32, offset: 896)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !860, file: !861, line: 73, baseType: !57, size: 32, offset: 928)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !860, file: !861, line: 74, baseType: !882, size: 64, offset: 960)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !149, line: 152, baseType: !179)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !860, file: !861, line: 77, baseType: !884, size: 16, offset: 1024)
!884 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !860, file: !861, line: 78, baseType: !886, size: 8, offset: 1040)
!886 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !860, file: !861, line: 79, baseType: !888, size: 8, offset: 1048)
!888 = !DICompositeType(tag: DW_TAG_array_type, baseType: !696, size: 8, elements: !889)
!889 = !{!890}
!890 = !DISubrange(count: 1)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !860, file: !861, line: 81, baseType: !892, size: 64, offset: 1088)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !861, line: 43, baseType: null)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !860, file: !861, line: 89, baseType: !895, size: 64, offset: 1152)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !149, line: 153, baseType: !179)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !860, file: !861, line: 91, baseType: !897, size: 64, offset: 1216)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !861, line: 37, flags: DIFlagFwdDecl)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !860, file: !861, line: 92, baseType: !900, size: 64, offset: 1280)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !861, line: 38, flags: DIFlagFwdDecl)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !860, file: !861, line: 93, baseType: !859, size: 64, offset: 1344)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !860, file: !861, line: 94, baseType: !164, size: 64, offset: 1408)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !860, file: !861, line: 95, baseType: !701, size: 64, offset: 1472)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !860, file: !861, line: 96, baseType: !57, size: 32, offset: 1536)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !860, file: !861, line: 98, baseType: !907, size: 160, offset: 1568)
!907 = !DICompositeType(tag: DW_TAG_array_type, baseType: !696, size: 160, elements: !908)
!908 = !{!909}
!909 = !DISubrange(count: 20)
!910 = !DISubprogram(name: "raise", scope: !120, file: !120, line: 123, type: !911, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!911 = !DISubroutineType(types: !912)
!912 = !{!57, !57}
!913 = !DISubprogram(name: "get_quoting_style", scope: !83, file: !83, line: 281, type: !914, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!914 = !DISubroutineType(types: !915)
!915 = !{!82, !916}
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !918)
!918 = !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !83, line: 270, flags: DIFlagFwdDecl)
!919 = !DISubprogram(name: "hash_get_n_entries", scope: !760, file: !760, line: 74, type: !920, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!920 = !DISubroutineType(types: !921)
!921 = !{!215, !922}
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !764)
!924 = !DISubprogram(name: "hash_free", scope: !760, file: !760, line: 96, type: !925, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!925 = !DISubroutineType(types: !926)
!926 = !{null, !763}
!927 = !DISubprogram(name: "dcgettext", scope: !746, file: !746, line: 51, type: !928, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!928 = !DISubroutineType(types: !929)
!929 = !{!695, !698, !698, !57}
!930 = !DISubprogram(name: "fputs_unlocked", scope: !856, file: !856, line: 662, type: !931, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!931 = !DISubroutineType(types: !932)
!932 = !{!57, !698, !859}
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !934, line: 102, baseType: !935)
!934 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !149, line: 73, baseType: !215)
!936 = !DISubprogram(name: "free", scope: !753, file: !753, line: 565, type: !784, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!937 = !DISubprogram(name: "xmalloc", scope: !787, file: !787, line: 53, type: !839, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!938 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!939 = !DISubprogram(name: "tcgetpgrp", scope: !940, file: !940, line: 838, type: !911, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!940 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!941 = !DISubprogram(name: "fwrite_unlocked", scope: !856, file: !856, line: 675, type: !942, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!942 = !DISubroutineType(types: !943)
!943 = !{!215, !778, !215, !215, !859}
!944 = !DISubprogram(name: "sigemptyset", scope: !120, file: !120, line: 196, type: !945, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!945 = !DISubroutineType(types: !946)
!946 = !{!57, !947}
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!948 = !DISubprogram(name: "sigaction", scope: !120, file: !120, line: 240, type: !949, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!949 = !DISubroutineType(types: !950)
!950 = !{!57, !57, !951, !953}
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !112)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!954 = !DISubprogram(name: "sigaddset", scope: !120, file: !120, line: 202, type: !955, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!955 = !DISubroutineType(types: !956)
!956 = !{!57, !947, !57}
!957 = !DISubprogram(name: "sigismember", scope: !120, file: !120, line: 208, type: !958, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!958 = !DISubroutineType(types: !959)
!959 = !{!57, !960, !57}
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !211)
!962 = !DISubprogram(name: "signal", scope: !120, file: !120, line: 88, type: !963, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!963 = !DISubroutineType(types: !964)
!964 = !{!121, !57, !121}
!965 = !DISubprogram(name: "set_quoting_style", scope: !83, file: !83, line: 285, type: !966, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!966 = !DISubroutineType(types: !967)
!967 = !{null, !968, !82}
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!969 = !DISubprogram(name: "isatty", scope: !940, file: !940, line: 779, type: !911, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!970 = !DISubprogram(name: "quote", scope: !971, file: !971, line: 44, type: !972, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!971 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!972 = !DISubroutineType(types: !973)
!973 = !{!698, !698}
!974 = !DISubprogram(name: "error", scope: !975, file: !975, line: 52, type: !976, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!975 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!976 = !DISubroutineType(types: !977)
!977 = !{null, !57, !57, !698, null}
!978 = !DISubprogram(name: "ioctl", scope: !979, file: !979, line: 41, type: !980, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!979 = !DIFile(filename: "/usr/include/sys/ioctl.h", directory: "")
!980 = !DISubroutineType(types: !981)
!981 = !{!57, !57, !215, null}
!982 = !DISubprogram(name: "xstrtoumax", scope: !238, file: !238, line: 48, type: !983, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!983 = !DISubroutineType(types: !984)
!984 = !{!237, !698, !694, !57, !985, !698}
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!986 = !DISubprogram(name: "getopt_long", scope: !987, file: !987, line: 66, type: !988, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!987 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!988 = !DISubroutineType(types: !989)
!989 = !{!57, !57, !990, !698, !992, !999}
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !695)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !994)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !987, line: 50, size: 256, elements: !995)
!995 = !{!996, !997, !998, !1000}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !994, file: !987, line: 52, baseType: !698, size: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !994, file: !987, line: 55, baseType: !57, size: 32, offset: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !994, file: !987, line: 56, baseType: !999, size: 64, offset: 128)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !994, file: !987, line: 57, baseType: !57, size: 32, offset: 192)
!1001 = !DISubprogram(name: "xnumtoumax", scope: !1002, file: !1002, line: 34, type: !1003, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!1002 = !DIFile(filename: "./lib/xdectoint.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!215, !698, !57, !215, !215, !698, !698, !57}
!1005 = !DISubprogram(name: "human_options", scope: !246, file: !246, line: 81, type: !1006, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!237, !698, !999, !985}
!1008 = !DISubprogram(name: "xstrtol_fatal", scope: !1009, file: !1009, line: 41, type: !1010, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !740)
!1009 = !DIFile(filename: "./lib/xstrtol-error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1010 = !DISubroutineType(types: !1011)
!1011 = !{null, !237, !57, !696, !992, !698}
!1012 = !DISubprogram(name: "version_etc", scope: !1013, file: !1013, line: 69, type: !1014, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!1013 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1014 = !DISubroutineType(types: !1015)
!1015 = !{null, !859, !698, !698, !698, null}
!1016 = !DISubprogram(name: "clone_quoting_options", scope: !83, file: !83, line: 278, type: !1017, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!968, !968}
!1019 = !DISubprogram(name: "set_char_quoting", scope: !83, file: !83, line: 294, type: !1020, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!57, !968, !696, !57}
!1022 = !DISubprogram(name: "hard_locale", scope: !1023, file: !1023, line: 26, type: !1024, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!1023 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!105, !57}
!1026 = !DISubprogram(name: "argmatch", scope: !1027, file: !1027, line: 52, type: !1028, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!1027 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!179, !698, !1030, !778, !215}
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !698)
!1032 = !DISubprogram(name: "argmatch_invalid", scope: !1027, file: !1027, line: 66, type: !1033, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!1033 = !DISubroutineType(types: !1034)
!1034 = !{null, !698, !698, !179}
!1035 = !DISubprogram(name: "nl_langinfo", scope: !276, file: !276, line: 661, type: !1036, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!695, !57}
!1038 = !DISubprogram(name: "mbsalign", scope: !662, file: !662, line: 55, type: !1039, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!215, !698, !695, !215, !985, !661, !57}
!1041 = !DISubprogram(name: "xstrdup", scope: !787, file: !787, line: 64, type: !750, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!1042 = !DISubprogram(name: "fnmatch", scope: !1043, file: !1043, line: 56, type: !1044, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!1043 = !DIFile(filename: "/usr/include/fnmatch.h", directory: "")
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!57, !698, !698, !57}
!1046 = !DISubprogram(name: "opendir", scope: !1047, file: !1047, line: 134, type: !1048, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!1047 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!1048 = !DISubroutineType(types: !1049)
!1049 = !{!1050, !698}
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64)
!1051 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !1047, line: 127, flags: DIFlagFwdDecl)
!1052 = !DISubprogram(name: "dirfd", scope: !1047, file: !1047, line: 224, type: !1053, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{!57, !1050}
!1055 = !DISubprogram(name: "closedir", scope: !1047, file: !1047, line: 149, type: !1053, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!1056 = !DISubprogram(name: "quotearg_n_style_colon", scope: !83, file: !83, line: 397, type: !1057, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!1057 = !DISubroutineType(types: !1058)
!1058 = !{!695, !57, !82, !698}
!1059 = !DISubprogram(name: "canonicalize_filename_mode", scope: !722, file: !722, line: 50, type: !1060, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!1060 = !DISubroutineType(types: !1061)
!1061 = !{!695, !698, !721}
!1062 = !DISubprogram(name: "readdir", scope: !1047, file: !1047, line: 162, type: !1063, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{!1065, !1050}
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64)
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !1067, line: 22, size: 2240, elements: !1068)
!1067 = !DIFile(filename: "/usr/include/bits/dirent.h", directory: "")
!1068 = !{!1069, !1071, !1072, !1073, !1074}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !1066, file: !1067, line: 25, baseType: !1070, size: 64)
!1070 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !149, line: 148, baseType: !215)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !1066, file: !1067, line: 26, baseType: !882, size: 64, offset: 64)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !1066, file: !1067, line: 31, baseType: !884, size: 16, offset: 128)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !1066, file: !1067, line: 32, baseType: !938, size: 8, offset: 144)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !1066, file: !1067, line: 33, baseType: !1075, size: 2048, offset: 152)
!1075 = !DICompositeType(tag: DW_TAG_array_type, baseType: !696, size: 2048, elements: !1076)
!1076 = !{!1077}
!1077 = !DISubrange(count: 256)
!1078 = !DISubprogram(name: "syscall", scope: !940, file: !940, line: 1056, type: !1079, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!1079 = !DISubroutineType(types: !1080)
!1080 = !{!179, !179, null}
!1081 = !DISubprogram(name: "human_readable", scope: !246, file: !246, line: 79, type: !1082, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!1082 = !DISubroutineType(types: !1083)
!1083 = !{!695, !215, !695, !57, !215, !215}
!1084 = !DISubprogram(name: "quotearg_style", scope: !83, file: !83, line: 377, type: !1085, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!1085 = !DISubroutineType(types: !1086)
!1086 = !{!695, !82, !698}
!1087 = !DISubprogram(name: "statx", scope: !1088, file: !1088, line: 56, type: !1089, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!1088 = !DIFile(filename: "/usr/include/bits/statx-generic.h", directory: "")
!1089 = !DISubroutineType(types: !1090)
!1090 = !{!57, !57, !698, !57, !6, !1091}
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "statx", file: !1093, line: 99, size: 2048, elements: !1094)
!1093 = !DIFile(filename: "/usr/include/linux/stat.h", directory: "")
!1094 = !{!1095, !1098, !1099, !1102, !1103, !1104, !1105, !1107, !1109, !1110, !1111, !1112, !1113, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "stx_mask", scope: !1092, file: !1093, line: 101, baseType: !1096, size: 32)
!1096 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !1097, line: 27, baseType: !6)
!1097 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "")
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "stx_blksize", scope: !1092, file: !1093, line: 102, baseType: !1096, size: 32, offset: 32)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "stx_attributes", scope: !1092, file: !1093, line: 103, baseType: !1100, size: 64, offset: 64)
!1100 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !1097, line: 31, baseType: !1101)
!1101 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "stx_nlink", scope: !1092, file: !1093, line: 105, baseType: !1096, size: 32, offset: 128)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "stx_uid", scope: !1092, file: !1093, line: 106, baseType: !1096, size: 32, offset: 160)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "stx_gid", scope: !1092, file: !1093, line: 107, baseType: !1096, size: 32, offset: 192)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "stx_mode", scope: !1092, file: !1093, line: 108, baseType: !1106, size: 16, offset: 224)
!1106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !1097, line: 24, baseType: !884)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "__spare0", scope: !1092, file: !1093, line: 109, baseType: !1108, size: 16, offset: 240)
!1108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1106, size: 16, elements: !889)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "stx_ino", scope: !1092, file: !1093, line: 111, baseType: !1100, size: 64, offset: 256)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "stx_size", scope: !1092, file: !1093, line: 112, baseType: !1100, size: 64, offset: 320)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "stx_blocks", scope: !1092, file: !1093, line: 113, baseType: !1100, size: 64, offset: 384)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "stx_attributes_mask", scope: !1092, file: !1093, line: 114, baseType: !1100, size: 64, offset: 448)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "stx_atime", scope: !1092, file: !1093, line: 116, baseType: !1114, size: 128, offset: 512)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "statx_timestamp", file: !1093, line: 56, size: 128, elements: !1115)
!1115 = !{!1116, !1119, !1120}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1114, file: !1093, line: 57, baseType: !1117, size: 64)
!1117 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !1097, line: 30, baseType: !1118)
!1118 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1114, file: !1093, line: 58, baseType: !1096, size: 32, offset: 64)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "__reserved", scope: !1114, file: !1093, line: 59, baseType: !1121, size: 32, offset: 96)
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !1097, line: 26, baseType: !57)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "stx_btime", scope: !1092, file: !1093, line: 117, baseType: !1114, size: 128, offset: 640)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "stx_ctime", scope: !1092, file: !1093, line: 118, baseType: !1114, size: 128, offset: 768)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "stx_mtime", scope: !1092, file: !1093, line: 119, baseType: !1114, size: 128, offset: 896)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "stx_rdev_major", scope: !1092, file: !1093, line: 121, baseType: !1096, size: 32, offset: 1024)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "stx_rdev_minor", scope: !1092, file: !1093, line: 122, baseType: !1096, size: 32, offset: 1056)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "stx_dev_major", scope: !1092, file: !1093, line: 123, baseType: !1096, size: 32, offset: 1088)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "stx_dev_minor", scope: !1092, file: !1093, line: 124, baseType: !1096, size: 32, offset: 1120)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "__spare2", scope: !1092, file: !1093, line: 126, baseType: !1130, size: 896, offset: 1152)
!1130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1100, size: 896, elements: !1131)
!1131 = !{!1132}
!1132 = !DISubrange(count: 14)
!1133 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !149, line: 145, baseType: !215)
!1134 = !DISubprogram(name: "hash_insert", scope: !760, file: !760, line: 100, type: !853, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!1135 = !DISubprogram(name: "_obstack_newchunk", scope: !789, file: !789, line: 213, type: !1136, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!1136 = !DISubroutineType(types: !1137)
!1137 = !{null, !792, !215}
!1138 = !DISubprogram(name: "quotearg_buffer", scope: !83, file: !83, line: 326, type: !1139, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!1139 = !DISubroutineType(types: !1140)
!1140 = !{!215, !695, !215, !698, !215, !916}
!1141 = !DISubprogram(name: "rpl_mbrtowc", scope: !1142, file: !1142, line: 717, type: !1143, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !740)
!1142 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1143 = !DISubroutineType(types: !1144)
!1144 = !{!215, !999, !698, !215, !1145}
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64)
!1146 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1147, line: 13, size: 64, elements: !1148)
!1147 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!1148 = !{!1149, !1150}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1146, file: !1147, line: 15, baseType: !57, size: 32)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1146, file: !1147, line: 20, baseType: !1151, size: 32, offset: 32)
!1151 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1146, file: !1147, line: 16, size: 32, elements: !1152)
!1152 = !{!1153, !1154}
