source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon.12 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct._obstack_chunk = type { i8*, %struct._obstack_chunk*, [0 x i8] }
%struct.infomap = type { i8*, i8* }
%struct.obstack = type { i64, %struct._obstack_chunk*, i8*, i8*, i8*, %union.anon, i64, %union.anon.0, %union.anon.1, i8*, i8 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%union.anon = type { i64 }
%union.anon.0 = type { i8* (i64)* }
%union.anon.1 = type { void (i8*)* }
%union.anon.12 = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [30 x i8] c"Usage: %s [OPTION]... [FILE]\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 80, type: !361, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !241, globals: !344, nameTableKind: None)
!3 = !DIFile(filename: "src/dircolors.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !11, !212, !226}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Shell_syntax", file: !3, line: 42, baseType: !6, size: 32, elements: !7)
!6 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!7 = !{!8, !9, !10}
!8 = !DIEnumerator(name: "SHELL_SYNTAX_BOURNE", value: 0, isUnsigned: true)
!9 = !DIEnumerator(name: "SHELL_SYNTAX_C", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "SHELL_SYNTAX_UNKNOWN", value: 2, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !12, file: !3, line: 250, baseType: !6, size: 32, elements: !207)
!12 = distinct !DISubprogram(name: "dc_parse_stream", scope: !3, file: !3, line: 239, type: !13, scopeLine: 240, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !81)
!13 = !DISubroutineType(types: !14)
!14 = !{!15, !16, !79}
!15 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !18, line: 7, baseType: !19)
!18 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "")
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !20, line: 49, size: 1728, elements: !21)
!20 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!21 = !{!22, !24, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !40, !42, !43, !44, !48, !50, !52, !56, !59, !61, !64, !67, !68, !70, !74, !75}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !19, file: !20, line: 51, baseType: !23, size: 32)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !19, file: !20, line: 54, baseType: !25, size: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !19, file: !20, line: 55, baseType: !25, size: 64, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !19, file: !20, line: 56, baseType: !25, size: 64, offset: 192)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !19, file: !20, line: 57, baseType: !25, size: 64, offset: 256)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !19, file: !20, line: 58, baseType: !25, size: 64, offset: 320)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !19, file: !20, line: 59, baseType: !25, size: 64, offset: 384)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !19, file: !20, line: 60, baseType: !25, size: 64, offset: 448)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !19, file: !20, line: 61, baseType: !25, size: 64, offset: 512)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !19, file: !20, line: 64, baseType: !25, size: 64, offset: 576)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !19, file: !20, line: 65, baseType: !25, size: 64, offset: 640)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !19, file: !20, line: 66, baseType: !25, size: 64, offset: 704)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !19, file: !20, line: 68, baseType: !38, size: 64, offset: 768)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !20, line: 36, flags: DIFlagFwdDecl)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !19, file: !20, line: 70, baseType: !41, size: 64, offset: 832)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !19, file: !20, line: 72, baseType: !23, size: 32, offset: 896)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !19, file: !20, line: 73, baseType: !23, size: 32, offset: 928)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !19, file: !20, line: 74, baseType: !45, size: 64, offset: 960)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !46, line: 152, baseType: !47)
!46 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!47 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !19, file: !20, line: 77, baseType: !49, size: 16, offset: 1024)
!49 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !19, file: !20, line: 78, baseType: !51, size: 8, offset: 1040)
!51 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !19, file: !20, line: 79, baseType: !53, size: 8, offset: 1048)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 8, elements: !54)
!54 = !{!55}
!55 = !DISubrange(count: 1)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !19, file: !20, line: 81, baseType: !57, size: 64, offset: 1088)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !20, line: 43, baseType: null)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !19, file: !20, line: 89, baseType: !60, size: 64, offset: 1152)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !46, line: 153, baseType: !47)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !19, file: !20, line: 91, baseType: !62, size: 64, offset: 1216)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !20, line: 37, flags: DIFlagFwdDecl)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !19, file: !20, line: 92, baseType: !65, size: 64, offset: 1280)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !20, line: 38, flags: DIFlagFwdDecl)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !19, file: !20, line: 93, baseType: !41, size: 64, offset: 1344)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !19, file: !20, line: 94, baseType: !69, size: 64, offset: 1408)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !19, file: !20, line: 95, baseType: !71, size: 64, offset: 1472)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !72, line: 46, baseType: !73)
!72 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!73 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !19, file: !20, line: 96, baseType: !23, size: 32, offset: 1536)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !19, file: !20, line: 98, baseType: !76, size: 160, offset: 1568)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 160, elements: !77)
!77 = !{!78}
!78 = !DISubrange(count: 20)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!81 = !{!82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !94, !95, !96, !154, !159, !161, !164, !166, !169, !173, !176, !178, !181, !184, !189, !192, !194, !197, !199, !202, !204}
!82 = !DILocalVariable(name: "fp", arg: 1, scope: !12, file: !3, line: 239, type: !16)
!83 = !DILocalVariable(name: "filename", arg: 2, scope: !12, file: !3, line: 239, type: !79)
!84 = !DILocalVariable(name: "line_number", scope: !12, file: !3, line: 241, type: !71)
!85 = !DILocalVariable(name: "next_G_line", scope: !12, file: !3, line: 242, type: !79)
!86 = !DILocalVariable(name: "input_line", scope: !12, file: !3, line: 243, type: !25)
!87 = !DILocalVariable(name: "input_line_size", scope: !12, file: !3, line: 244, type: !71)
!88 = !DILocalVariable(name: "line", scope: !12, file: !3, line: 245, type: !79)
!89 = !DILocalVariable(name: "term", scope: !12, file: !3, line: 246, type: !79)
!90 = !DILocalVariable(name: "ok", scope: !12, file: !3, line: 247, type: !15)
!91 = !DILocalVariable(name: "state", scope: !12, file: !3, line: 250, type: !11)
!92 = !DILocalVariable(name: "keywd", scope: !93, file: !3, line: 259, type: !25)
!93 = distinct !DILexicalBlock(scope: !12, file: !3, line: 258, column: 5)
!94 = !DILocalVariable(name: "arg", scope: !93, file: !3, line: 259, type: !25)
!95 = !DILocalVariable(name: "unrecognized", scope: !93, file: !3, line: 260, type: !15)
!96 = !DILocalVariable(name: "__o", scope: !97, file: !3, line: 312, type: !104)
!97 = distinct !DILexicalBlock(scope: !98, file: !3, line: 312, column: 19)
!98 = distinct !DILexicalBlock(scope: !99, file: !3, line: 311, column: 17)
!99 = distinct !DILexicalBlock(scope: !100, file: !3, line: 310, column: 19)
!100 = distinct !DILexicalBlock(scope: !101, file: !3, line: 309, column: 13)
!101 = distinct !DILexicalBlock(scope: !102, file: !3, line: 308, column: 15)
!102 = distinct !DILexicalBlock(scope: !103, file: !3, line: 304, column: 9)
!103 = distinct !DILexicalBlock(scope: !93, file: !3, line: 296, column: 11)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !106, line: 174, size: 704, elements: !107)
!106 = !DIFile(filename: "./lib/obstack.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!107 = !{!108, !109, !119, !120, !121, !122, !127, !128, !139, !150, !151, !152, !153}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !105, file: !106, line: 176, baseType: !71, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !105, file: !106, line: 177, baseType: !110, size: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !106, line: 167, size: 128, elements: !112)
!112 = !{!113, !114, !115}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !111, file: !106, line: 169, baseType: !25, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !111, file: !106, line: 170, baseType: !110, size: 64, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !111, file: !106, line: 171, baseType: !116, offset: 128)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, elements: !117)
!117 = !{!118}
!118 = !DISubrange(count: -1)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !105, file: !106, line: 178, baseType: !25, size: 64, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !105, file: !106, line: 179, baseType: !25, size: 64, offset: 192)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !105, file: !106, line: 180, baseType: !25, size: 64, offset: 256)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !105, file: !106, line: 185, baseType: !123, size: 64, offset: 320)
!123 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !105, file: !106, line: 181, size: 64, elements: !124)
!124 = !{!125, !126}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !123, file: !106, line: 183, baseType: !71, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !123, file: !106, line: 184, baseType: !69, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !105, file: !106, line: 186, baseType: !71, size: 64, offset: 384)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !105, file: !106, line: 193, baseType: !129, size: 64, offset: 448)
!129 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !105, file: !106, line: 189, size: 64, elements: !130)
!130 = !{!131, !135}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !129, file: !106, line: 191, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!69, !71}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !129, file: !106, line: 192, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!69, !69, !71}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !105, file: !106, line: 198, baseType: !140, size: 64, offset: 512)
!140 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !105, file: !106, line: 194, size: 64, elements: !141)
!141 = !{!142, !146}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !140, file: !106, line: 196, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{null, !69}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !140, file: !106, line: 197, baseType: !147, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{null, !69, !69}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !105, file: !106, line: 200, baseType: !69, size: 64, offset: 576)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !105, file: !106, line: 201, baseType: !6, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !105, file: !106, line: 202, baseType: !6, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !105, file: !106, line: 206, baseType: !6, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!154 = !DILocalVariable(name: "__o1", scope: !155, file: !3, line: 312, type: !157)
!155 = distinct !DILexicalBlock(scope: !156, file: !3, line: 312, column: 19)
!156 = distinct !DILexicalBlock(scope: !97, file: !3, line: 312, column: 19)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !105)
!159 = !DILocalVariable(name: "__o", scope: !160, file: !3, line: 314, type: !104)
!160 = distinct !DILexicalBlock(scope: !98, file: !3, line: 314, column: 19)
!161 = !DILocalVariable(name: "__o1", scope: !162, file: !3, line: 314, type: !157)
!162 = distinct !DILexicalBlock(scope: !163, file: !3, line: 314, column: 19)
!163 = distinct !DILexicalBlock(scope: !160, file: !3, line: 314, column: 19)
!164 = !DILocalVariable(name: "__o", scope: !165, file: !3, line: 316, type: !104)
!165 = distinct !DILexicalBlock(scope: !98, file: !3, line: 316, column: 19)
!166 = !DILocalVariable(name: "__o1", scope: !167, file: !3, line: 316, type: !157)
!167 = distinct !DILexicalBlock(scope: !168, file: !3, line: 316, column: 19)
!168 = distinct !DILexicalBlock(scope: !165, file: !3, line: 316, column: 19)
!169 = !DILocalVariable(name: "__o", scope: !170, file: !3, line: 321, type: !104)
!170 = distinct !DILexicalBlock(scope: !171, file: !3, line: 321, column: 19)
!171 = distinct !DILexicalBlock(scope: !172, file: !3, line: 319, column: 17)
!172 = distinct !DILexicalBlock(scope: !99, file: !3, line: 318, column: 24)
!173 = !DILocalVariable(name: "__o1", scope: !174, file: !3, line: 321, type: !157)
!174 = distinct !DILexicalBlock(scope: !175, file: !3, line: 321, column: 19)
!175 = distinct !DILexicalBlock(scope: !170, file: !3, line: 321, column: 19)
!176 = !DILocalVariable(name: "__o", scope: !177, file: !3, line: 323, type: !104)
!177 = distinct !DILexicalBlock(scope: !171, file: !3, line: 323, column: 19)
!178 = !DILocalVariable(name: "__o1", scope: !179, file: !3, line: 323, type: !157)
!179 = distinct !DILexicalBlock(scope: !180, file: !3, line: 323, column: 19)
!180 = distinct !DILexicalBlock(scope: !177, file: !3, line: 323, column: 19)
!181 = !DILocalVariable(name: "i", scope: !182, file: !3, line: 333, type: !23)
!182 = distinct !DILexicalBlock(scope: !183, file: !3, line: 332, column: 17)
!183 = distinct !DILexicalBlock(scope: !172, file: !3, line: 325, column: 24)
!184 = !DILocalVariable(name: "__o", scope: !185, file: !3, line: 341, type: !104)
!185 = distinct !DILexicalBlock(scope: !186, file: !3, line: 341, column: 23)
!186 = distinct !DILexicalBlock(scope: !187, file: !3, line: 341, column: 23)
!187 = distinct !DILexicalBlock(scope: !188, file: !3, line: 340, column: 21)
!188 = distinct !DILexicalBlock(scope: !182, file: !3, line: 339, column: 23)
!189 = !DILocalVariable(name: "__o1", scope: !190, file: !3, line: 341, type: !157)
!190 = distinct !DILexicalBlock(scope: !191, file: !3, line: 341, column: 23)
!191 = distinct !DILexicalBlock(scope: !185, file: !3, line: 341, column: 23)
!192 = !DILocalVariable(name: "__o", scope: !193, file: !3, line: 341, type: !104)
!193 = distinct !DILexicalBlock(scope: !186, file: !3, line: 341, column: 23)
!194 = !DILocalVariable(name: "__o1", scope: !195, file: !3, line: 341, type: !157)
!195 = distinct !DILexicalBlock(scope: !196, file: !3, line: 341, column: 23)
!196 = distinct !DILexicalBlock(scope: !193, file: !3, line: 341, column: 23)
!197 = !DILocalVariable(name: "__o", scope: !198, file: !3, line: 342, type: !104)
!198 = distinct !DILexicalBlock(scope: !187, file: !3, line: 342, column: 23)
!199 = !DILocalVariable(name: "__o1", scope: !200, file: !3, line: 342, type: !157)
!200 = distinct !DILexicalBlock(scope: !201, file: !3, line: 342, column: 23)
!201 = distinct !DILexicalBlock(scope: !198, file: !3, line: 342, column: 23)
!202 = !DILocalVariable(name: "__o", scope: !203, file: !3, line: 344, type: !104)
!203 = distinct !DILexicalBlock(scope: !187, file: !3, line: 344, column: 23)
!204 = !DILocalVariable(name: "__o1", scope: !205, file: !3, line: 344, type: !157)
!205 = distinct !DILexicalBlock(scope: !206, file: !3, line: 344, column: 23)
!206 = distinct !DILexicalBlock(scope: !203, file: !3, line: 344, column: 23)
!207 = !{!208, !209, !210, !211}
!208 = !DIEnumerator(name: "ST_TERMNO", value: 0, isUnsigned: true)
!209 = !DIEnumerator(name: "ST_TERMYES", value: 1, isUnsigned: true)
!210 = !DIEnumerator(name: "ST_TERMSURE", value: 2, isUnsigned: true)
!211 = !DIEnumerator(name: "ST_GLOBAL", value: 3, isUnsigned: true)
!212 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !213, line: 32, baseType: !6, size: 32, elements: !214)
!213 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!214 = !{!215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225}
!215 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!216 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!217 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!218 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!219 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!220 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!221 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!222 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!223 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!224 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!225 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!226 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !227, line: 46, baseType: !6, size: 32, elements: !228)
!227 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!228 = !{!229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240}
!229 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!230 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!231 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!232 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!233 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!234 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!235 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!236 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!237 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!238 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!239 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!240 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!241 = !{!242, !247, !251, !255, !259, !262, !265, !272, !25, !69, !287, !291, !295, !299, !302, !71, !79, !308, !313, !314, !316, !317, !73, !320, !324, !328, !23, !49, !331, !335, !339, !343}
!242 = !DISubprogram(name: "dcgettext", scope: !243, file: !243, line: 51, type: !244, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !246)
!243 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!244 = !DISubroutineType(types: !245)
!245 = !{!25, !79, !79, !23}
!246 = !{}
!247 = !DISubprogram(name: "fputs_unlocked", scope: !248, file: !248, line: 662, type: !249, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !246)
!248 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!249 = !DISubroutineType(types: !250)
!250 = !{!23, !79, !41}
!251 = !DISubprogram(name: "set_program_name", scope: !252, file: !252, line: 37, type: !253, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !246)
!252 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!253 = !DISubroutineType(types: !254)
!254 = !{null, !79}
!255 = !DISubprogram(name: "setlocale", scope: !256, file: !256, line: 122, type: !257, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !246)
!256 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!257 = !DISubroutineType(types: !258)
!258 = !{!25, !23, !79}
!259 = !DISubprogram(name: "bindtextdomain", scope: !243, file: !243, line: 86, type: !260, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !246)
!260 = !DISubroutineType(types: !261)
!261 = !{!25, !79, !79}
!262 = !DISubprogram(name: "textdomain", scope: !243, file: !243, line: 82, type: !263, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !246)
!263 = !DISubroutineType(types: !264)
!264 = !{!25, !79}
!265 = !DISubprogram(name: "atexit", scope: !266, file: !266, line: 595, type: !267, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !246)
!266 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!267 = !DISubroutineType(types: !268)
!268 = !{!23, !269}
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{null}
!272 = !DISubprogram(name: "getopt_long", scope: !273, file: !273, line: 66, type: !274, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !246)
!273 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!274 = !DISubroutineType(types: !275)
!275 = !{!23, !23, !276, !79, !278, !285}
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !280)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !273, line: 50, size: 256, elements: !281)
!281 = !{!282, !283, !284, !286}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !280, file: !273, line: 52, baseType: !79, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !280, file: !273, line: 55, baseType: !23, size: 32, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !280, file: !273, line: 56, baseType: !285, size: 64, offset: 128)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !280, file: !273, line: 57, baseType: !23, size: 32, offset: 192)
!287 = !DISubprogram(name: "version_etc", scope: !288, file: !288, line: 69, type: !289, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !246)
!288 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!289 = !DISubroutineType(types: !290)
!290 = !{null, !41, !79, !79, !79, null}
!291 = !DISubprogram(name: "error", scope: !292, file: !292, line: 52, type: !293, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !246)
!292 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!293 = !DISubroutineType(types: !294)
!294 = !{null, !23, !23, !79, null}
!295 = !DISubprogram(name: "quote", scope: !296, file: !296, line: 44, type: !297, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !246)
!296 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!297 = !DISubroutineType(types: !298)
!298 = !{!79, !79}
!299 = !DISubprogram(name: "puts", scope: !248, file: !248, line: 632, type: !300, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !246)
!300 = !DISubroutineType(types: !301)
!301 = !{!23, !79}
!302 = !DISubprogram(name: "_obstack_begin", scope: !106, file: !106, line: 215, type: !303, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !246)
!303 = !DISubroutineType(types: !304)
!304 = !{!23, !104, !73, !73, !305, !143}
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DISubroutineType(types: !307)
!307 = !{!69, !73}
!308 = !DISubprogram(name: "fwrite_unlocked", scope: !248, file: !248, line: 675, type: !309, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !246)
!309 = !DISubroutineType(types: !310)
!310 = !{!73, !311, !73, !73, !41}
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!313 = !DISubprogram(name: "getenv", scope: !266, file: !266, line: 634, type: !263, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !246)
!314 = !DISubprogram(name: "last_component", scope: !315, file: !315, line: 46, type: !263, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !246)
!315 = !DIFile(filename: "./lib/dirname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!316 = !DISubprogram(name: "free", scope: !266, file: !266, line: 565, type: !144, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !246)
!317 = !DISubprogram(name: "quotearg_n_style_colon", scope: !213, file: !213, line: 397, type: !318, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !246)
!318 = !DISubroutineType(types: !319)
!319 = !{!25, !23, !212, !79}
!320 = !DISubprogram(name: "c_strcasecmp", scope: !321, file: !321, line: 42, type: !322, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !246)
!321 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!322 = !DISubroutineType(types: !323)
!323 = !{!23, !79, !79}
!324 = !DISubprogram(name: "fnmatch", scope: !325, file: !325, line: 56, type: !326, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !246)
!325 = !DIFile(filename: "/usr/include/fnmatch.h", directory: "")
!326 = !DISubroutineType(types: !327)
!327 = !{!23, !79, !79, !23}
!328 = !DISubprogram(name: "_obstack_newchunk", scope: !106, file: !106, line: 213, type: !329, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !246)
!329 = !DISubroutineType(types: !330)
!330 = !{null, !104, !73}
!331 = !DISubprogram(name: "xstrndup", scope: !332, file: !332, line: 23, type: !333, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !246)
!332 = !DIFile(filename: "./lib/xstrndup.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!333 = !DISubroutineType(types: !334)
!334 = !{!25, !79, !73}
!335 = !DISubprogram(name: "freopen_safer", scope: !336, file: !336, line: 27, type: !337, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !246)
!336 = !DIFile(filename: "./lib/stdio-safer.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!337 = !DISubroutineType(types: !338)
!338 = !{!41, !79, !79, !41}
!339 = !DISubprogram(name: "rpl_fclose", scope: !340, file: !340, line: 672, type: !341, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !246)
!340 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!341 = !DISubroutineType(types: !342)
!342 = !{!23, !41}
!343 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!344 = !{!345, !0, !347, !353, !359}
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(name: "lsc_obstack", scope: !2, file: !3, line: 60, type: !105, isLocal: true, isDefinition: true)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(name: "G_line", scope: !2, file: !349, line: 1, type: !350, isLocal: true, isDefinition: true)
!349 = !DIFile(filename: "src/dircolors.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 34432, elements: !351)
!351 = !{!352}
!352 = !DISubrange(count: 4304)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(name: "slack_codes", scope: !2, file: !3, line: 62, type: !355, isLocal: true, isDefinition: true)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !356, size: 2432, elements: !357)
!356 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !79)
!357 = !{!358}
!358 = !DISubrange(count: 38)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(name: "ls_codes", scope: !2, file: !3, line: 72, type: !355, isLocal: true, isDefinition: true)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !279, size: 2048, elements: !362)
!362 = !{!363}
!363 = !DISubrange(count: 8)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(name: "Version", scope: !366, file: !367, line: 2, type: !79, isDefinition: true)
!366 = distinct !DICompileUnit(language: DW_LANG_C99, file: !367, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !246, globals: !368, nameTableKind: None)
!367 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!368 = !{!364}
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(name: "file_name", scope: !371, file: !372, line: 46, type: !79, isLocal: true, isDefinition: true)
!371 = distinct !DICompileUnit(language: DW_LANG_C99, file: !372, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !246, retainedTypes: !373, globals: !411, nameTableKind: None)
!372 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!373 = !{!374, !242, !410, !291}
!374 = !DISubprogram(name: "close_stream", scope: !375, file: !375, line: 2, type: !376, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !246)
!375 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!376 = !DISubroutineType(types: !377)
!377 = !{!23, !378}
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !20, line: 49, size: 1728, elements: !380)
!380 = !{!381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !379, file: !20, line: 51, baseType: !23, size: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !379, file: !20, line: 54, baseType: !25, size: 64, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !379, file: !20, line: 55, baseType: !25, size: 64, offset: 128)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !379, file: !20, line: 56, baseType: !25, size: 64, offset: 192)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !379, file: !20, line: 57, baseType: !25, size: 64, offset: 256)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !379, file: !20, line: 58, baseType: !25, size: 64, offset: 320)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !379, file: !20, line: 59, baseType: !25, size: 64, offset: 384)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !379, file: !20, line: 60, baseType: !25, size: 64, offset: 448)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !379, file: !20, line: 61, baseType: !25, size: 64, offset: 512)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !379, file: !20, line: 64, baseType: !25, size: 64, offset: 576)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !379, file: !20, line: 65, baseType: !25, size: 64, offset: 640)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !379, file: !20, line: 66, baseType: !25, size: 64, offset: 704)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !379, file: !20, line: 68, baseType: !38, size: 64, offset: 768)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !379, file: !20, line: 70, baseType: !378, size: 64, offset: 832)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !379, file: !20, line: 72, baseType: !23, size: 32, offset: 896)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !379, file: !20, line: 73, baseType: !23, size: 32, offset: 928)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !379, file: !20, line: 74, baseType: !45, size: 64, offset: 960)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !379, file: !20, line: 77, baseType: !49, size: 16, offset: 1024)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !379, file: !20, line: 78, baseType: !51, size: 8, offset: 1040)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !379, file: !20, line: 79, baseType: !53, size: 8, offset: 1048)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !379, file: !20, line: 81, baseType: !57, size: 64, offset: 1088)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !379, file: !20, line: 89, baseType: !60, size: 64, offset: 1152)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !379, file: !20, line: 91, baseType: !62, size: 64, offset: 1216)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !379, file: !20, line: 92, baseType: !65, size: 64, offset: 1280)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !379, file: !20, line: 93, baseType: !378, size: 64, offset: 1344)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !379, file: !20, line: 94, baseType: !69, size: 64, offset: 1408)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !379, file: !20, line: 95, baseType: !71, size: 64, offset: 1472)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !379, file: !20, line: 96, baseType: !23, size: 32, offset: 1536)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !379, file: !20, line: 98, baseType: !76, size: 160, offset: 1568)
!410 = !DISubprogram(name: "quotearg_colon", scope: !213, file: !213, line: 391, type: !263, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !246)
!411 = !{!369, !412}
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !371, file: !372, line: 56, type: !15, isLocal: true, isDefinition: true)
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(name: "exit_failure", scope: !416, file: !417, line: 24, type: !419, isDefinition: true)
!416 = distinct !DICompileUnit(language: DW_LANG_C99, file: !417, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !246, globals: !418, nameTableKind: None)
!417 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!418 = !{!414}
!419 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !23)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(name: "program_name", scope: !422, file: !423, line: 33, type: !79, isDefinition: true)
!422 = distinct !DICompileUnit(language: DW_LANG_C99, file: !423, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !246, retainedTypes: !424, globals: !460, nameTableKind: None)
!423 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!424 = !{!69, !425, !25}
!425 = !DISubprogram(name: "fputs", scope: !248, file: !248, line: 626, type: !426, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !246)
!426 = !DISubroutineType(types: !427)
!427 = !{!23, !79, !428}
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !20, line: 49, size: 1728, elements: !430)
!430 = !{!431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !429, file: !20, line: 51, baseType: !23, size: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !429, file: !20, line: 54, baseType: !25, size: 64, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !429, file: !20, line: 55, baseType: !25, size: 64, offset: 128)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !429, file: !20, line: 56, baseType: !25, size: 64, offset: 192)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !429, file: !20, line: 57, baseType: !25, size: 64, offset: 256)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !429, file: !20, line: 58, baseType: !25, size: 64, offset: 320)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !429, file: !20, line: 59, baseType: !25, size: 64, offset: 384)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !429, file: !20, line: 60, baseType: !25, size: 64, offset: 448)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !429, file: !20, line: 61, baseType: !25, size: 64, offset: 512)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !429, file: !20, line: 64, baseType: !25, size: 64, offset: 576)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !429, file: !20, line: 65, baseType: !25, size: 64, offset: 640)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !429, file: !20, line: 66, baseType: !25, size: 64, offset: 704)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !429, file: !20, line: 68, baseType: !38, size: 64, offset: 768)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !429, file: !20, line: 70, baseType: !428, size: 64, offset: 832)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !429, file: !20, line: 72, baseType: !23, size: 32, offset: 896)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !429, file: !20, line: 73, baseType: !23, size: 32, offset: 928)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !429, file: !20, line: 74, baseType: !45, size: 64, offset: 960)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !429, file: !20, line: 77, baseType: !49, size: 16, offset: 1024)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !429, file: !20, line: 78, baseType: !51, size: 8, offset: 1040)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !429, file: !20, line: 79, baseType: !53, size: 8, offset: 1048)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !429, file: !20, line: 81, baseType: !57, size: 64, offset: 1088)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !429, file: !20, line: 89, baseType: !60, size: 64, offset: 1152)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !429, file: !20, line: 91, baseType: !62, size: 64, offset: 1216)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !429, file: !20, line: 92, baseType: !65, size: 64, offset: 1280)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !429, file: !20, line: 93, baseType: !428, size: 64, offset: 1344)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !429, file: !20, line: 94, baseType: !69, size: 64, offset: 1408)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !429, file: !20, line: 95, baseType: !71, size: 64, offset: 1472)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !429, file: !20, line: 96, baseType: !23, size: 32, offset: 1536)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !429, file: !20, line: 98, baseType: !76, size: 160, offset: 1568)
!460 = !{!420}
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !463, file: !464, line: 85, type: !556, isDefinition: true)
!463 = distinct !DICompileUnit(language: DW_LANG_C99, file: !464, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !465, retainedTypes: !471, globals: !529, nameTableKind: None)
!464 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!465 = !{!212, !466, !226}
!466 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !213, line: 242, baseType: !6, size: 32, elements: !467)
!467 = !{!468, !469, !470}
!468 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!469 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!470 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!471 = !{!472, !476, !316, !490, !23, !49, !493, !71, !510, !514, !242, !520, !320, !25, !524, !525, !526}
!472 = !DISubprogram(name: "xmemdup", scope: !473, file: !473, line: 62, type: !474, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !246)
!473 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!474 = !DISubroutineType(types: !475)
!475 = !{!69, !311, !73}
!476 = !DISubprogram(name: "quotearg_alloc_mem", scope: !213, file: !213, line: 342, type: !477, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !246)
!477 = !DISubroutineType(types: !478)
!478 = !{!25, !79, !73, !479, !480}
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !482)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !464, line: 65, size: 448, elements: !483)
!483 = !{!484, !485, !486, !488, !489}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !482, file: !464, line: 68, baseType: !212, size: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !482, file: !464, line: 71, baseType: !23, size: 32, offset: 32)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !482, file: !464, line: 75, baseType: !487, size: 256, offset: 64)
!487 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !362)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !482, file: !464, line: 78, baseType: !79, size: 64, offset: 320)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !482, file: !464, line: 81, baseType: !79, size: 64, offset: 384)
!490 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !213, file: !213, line: 408, type: !491, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !246)
!491 = !DISubroutineType(types: !492)
!492 = !{!25, !23, !79, !79, !79, !73}
!493 = !DISubprogram(name: "rpl_mbrtowc", scope: !494, file: !494, line: 717, type: !495, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !246)
!494 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!495 = !DISubroutineType(types: !496)
!496 = !{!73, !285, !79, !73, !497}
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !499, line: 13, size: 64, elements: !500)
!499 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!500 = !{!501, !502}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !498, file: !499, line: 15, baseType: !23, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !498, file: !499, line: 20, baseType: !503, size: 32, offset: 32)
!503 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !498, file: !499, line: 16, size: 32, elements: !504)
!504 = !{!505, !506}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !503, file: !499, line: 18, baseType: !6, size: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !503, file: !499, line: 19, baseType: !507, size: 32)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 32, elements: !508)
!508 = !{!509}
!509 = !DISubrange(count: 4)
!510 = !DISubprogram(name: "iswprint", scope: !511, file: !511, line: 120, type: !512, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !246)
!511 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!512 = !DISubroutineType(types: !513)
!513 = !{!23, !6}
!514 = !DISubprogram(name: "mbsinit", scope: !515, file: !515, line: 292, type: !516, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !246)
!515 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!516 = !DISubroutineType(types: !517)
!517 = !{!23, !518}
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !498)
!520 = !DISubprogram(name: "locale_charset", scope: !521, file: !521, line: 35, type: !522, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !246)
!521 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!522 = !DISubroutineType(types: !523)
!523 = !{!79}
!524 = !DISubprogram(name: "xmalloc", scope: !473, file: !473, line: 53, type: !306, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !246)
!525 = !DISubprogram(name: "xalloc_die", scope: !473, file: !473, line: 51, type: !270, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !246)
!526 = !DISubprogram(name: "xrealloc", scope: !473, file: !473, line: 59, type: !527, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !246)
!527 = !DISubroutineType(types: !528)
!528 = !{!69, !69, !73}
!529 = !{!461, !530, !536, !538, !540, !545, !552, !554}
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !463, file: !464, line: 101, type: !532, isDefinition: true)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !533, size: 320, elements: !534)
!533 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !212)
!534 = !{!535}
!535 = !DISubrange(count: 10)
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !463, file: !464, line: 1052, type: !482, isDefinition: true)
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !463, file: !464, line: 116, type: !482, isLocal: true, isDefinition: true)
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(name: "slot0", scope: !463, file: !464, line: 842, type: !542, isLocal: true, isDefinition: true)
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 2048, elements: !543)
!543 = !{!544}
!544 = !DISubrange(count: 256)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(name: "slotvec", scope: !463, file: !464, line: 845, type: !547, isLocal: true, isDefinition: true)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !464, line: 834, size: 128, elements: !549)
!549 = !{!550, !551}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !548, file: !464, line: 836, baseType: !71, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !548, file: !464, line: 837, baseType: !25, size: 64, offset: 64)
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(name: "nslots", scope: !463, file: !464, line: 843, type: !23, isLocal: true, isDefinition: true)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(name: "slotvec0", scope: !463, file: !464, line: 844, type: !548, isLocal: true, isDefinition: true)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !356, size: 704, elements: !557)
!557 = !{!558}
!558 = !DISubrange(count: 11)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !561, file: !562, line: 26, type: !564, isDefinition: true)
!561 = distinct !DICompileUnit(language: DW_LANG_C99, file: !562, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !246, globals: !563, nameTableKind: None)
!562 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!563 = !{!559}
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 376, elements: !565)
!565 = !{!566}
!566 = !DISubrange(count: 47)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(name: "obstack_alloc_failed_handler", scope: !569, file: !570, line: 351, type: !269, isDefinition: true)
!569 = distinct !DICompileUnit(language: DW_LANG_C99, file: !570, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !246, retainedTypes: !571, globals: !572, nameTableKind: None)
!570 = !DIFile(filename: "lib/obstack.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!571 = !{!25, !69, !242}
!572 = !{!567}
!573 = distinct !DICompileUnit(language: DW_LANG_C99, file: !574, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !246, retainedTypes: !575, nameTableKind: None)
!574 = !DIFile(filename: "lib/c-strcasecmp.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!575 = !{!576}
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !343)
!578 = distinct !DICompileUnit(language: DW_LANG_C99, file: !579, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !246, retainedTypes: !580, nameTableKind: None)
!579 = !DIFile(filename: "lib/basename-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!580 = !{!25}
!581 = distinct !DICompileUnit(language: DW_LANG_C99, file: !582, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !246, retainedTypes: !583, nameTableKind: None)
!582 = !DIFile(filename: "lib/freopen-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!583 = !{!584, !619, !623, !626, !629}
!584 = !DISubprogram(name: "fileno", scope: !248, file: !248, line: 786, type: !585, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !246)
!585 = !DISubroutineType(types: !586)
!586 = !{!23, !587}
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !20, line: 49, size: 1728, elements: !589)
!589 = !{!590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !588, file: !20, line: 51, baseType: !23, size: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !588, file: !20, line: 54, baseType: !25, size: 64, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !588, file: !20, line: 55, baseType: !25, size: 64, offset: 128)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !588, file: !20, line: 56, baseType: !25, size: 64, offset: 192)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !588, file: !20, line: 57, baseType: !25, size: 64, offset: 256)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !588, file: !20, line: 58, baseType: !25, size: 64, offset: 320)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !588, file: !20, line: 59, baseType: !25, size: 64, offset: 384)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !588, file: !20, line: 60, baseType: !25, size: 64, offset: 448)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !588, file: !20, line: 61, baseType: !25, size: 64, offset: 512)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !588, file: !20, line: 64, baseType: !25, size: 64, offset: 576)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !588, file: !20, line: 65, baseType: !25, size: 64, offset: 640)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !588, file: !20, line: 66, baseType: !25, size: 64, offset: 704)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !588, file: !20, line: 68, baseType: !38, size: 64, offset: 768)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !588, file: !20, line: 70, baseType: !587, size: 64, offset: 832)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !588, file: !20, line: 72, baseType: !23, size: 32, offset: 896)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !588, file: !20, line: 73, baseType: !23, size: 32, offset: 928)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !588, file: !20, line: 74, baseType: !45, size: 64, offset: 960)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !588, file: !20, line: 77, baseType: !49, size: 16, offset: 1024)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !588, file: !20, line: 78, baseType: !51, size: 8, offset: 1040)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !588, file: !20, line: 79, baseType: !53, size: 8, offset: 1048)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !588, file: !20, line: 81, baseType: !57, size: 64, offset: 1088)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !588, file: !20, line: 89, baseType: !60, size: 64, offset: 1152)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !588, file: !20, line: 91, baseType: !62, size: 64, offset: 1216)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !588, file: !20, line: 92, baseType: !65, size: 64, offset: 1280)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !588, file: !20, line: 93, baseType: !587, size: 64, offset: 1344)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !588, file: !20, line: 94, baseType: !69, size: 64, offset: 1408)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !588, file: !20, line: 95, baseType: !71, size: 64, offset: 1472)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !588, file: !20, line: 96, baseType: !23, size: 32, offset: 1536)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !588, file: !20, line: 98, baseType: !76, size: 160, offset: 1568)
!619 = !DISubprogram(name: "dup2", scope: !620, file: !620, line: 534, type: !621, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !246)
!620 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!621 = !DISubroutineType(types: !622)
!622 = !{!23, !23, !23}
!623 = !DISubprogram(name: "freopen", scope: !248, file: !248, line: 252, type: !624, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !246)
!624 = !DISubroutineType(types: !625)
!625 = !{!587, !79, !79, !587}
!626 = !DISubprogram(name: "close", scope: !620, file: !620, line: 353, type: !627, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !246)
!627 = !DISubroutineType(types: !628)
!628 = !{!23, !23}
!629 = !DISubprogram(name: "open", scope: !630, file: !630, line: 196, type: !631, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !246)
!630 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
!631 = !DISubroutineType(types: !632)
!632 = !{!23, !79, !23, null}
!633 = distinct !DICompileUnit(language: DW_LANG_C99, file: !634, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !635, retainedTypes: !639, nameTableKind: None)
!634 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!635 = !{!636}
!636 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !634, line: 40, baseType: !6, size: 32, elements: !637)
!637 = !{!638}
!638 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!639 = !{!242, !640, !69}
!640 = !DISubprogram(name: "fputs_unlocked", scope: !248, file: !248, line: 662, type: !641, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !246)
!641 = !DISubroutineType(types: !642)
!642 = !{!23, !79, !643}
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !20, line: 49, size: 1728, elements: !645)
!645 = !{!646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !644, file: !20, line: 51, baseType: !23, size: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !644, file: !20, line: 54, baseType: !25, size: 64, offset: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !644, file: !20, line: 55, baseType: !25, size: 64, offset: 128)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !644, file: !20, line: 56, baseType: !25, size: 64, offset: 192)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !644, file: !20, line: 57, baseType: !25, size: 64, offset: 256)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !644, file: !20, line: 58, baseType: !25, size: 64, offset: 320)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !644, file: !20, line: 59, baseType: !25, size: 64, offset: 384)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !644, file: !20, line: 60, baseType: !25, size: 64, offset: 448)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !644, file: !20, line: 61, baseType: !25, size: 64, offset: 512)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !644, file: !20, line: 64, baseType: !25, size: 64, offset: 576)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !644, file: !20, line: 65, baseType: !25, size: 64, offset: 640)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !644, file: !20, line: 66, baseType: !25, size: 64, offset: 704)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !644, file: !20, line: 68, baseType: !38, size: 64, offset: 768)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !644, file: !20, line: 70, baseType: !643, size: 64, offset: 832)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !644, file: !20, line: 72, baseType: !23, size: 32, offset: 896)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !644, file: !20, line: 73, baseType: !23, size: 32, offset: 928)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !644, file: !20, line: 74, baseType: !45, size: 64, offset: 960)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !644, file: !20, line: 77, baseType: !49, size: 16, offset: 1024)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !644, file: !20, line: 78, baseType: !51, size: 8, offset: 1040)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !644, file: !20, line: 79, baseType: !53, size: 8, offset: 1048)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !644, file: !20, line: 81, baseType: !57, size: 64, offset: 1088)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !644, file: !20, line: 89, baseType: !60, size: 64, offset: 1152)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !644, file: !20, line: 91, baseType: !62, size: 64, offset: 1216)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !644, file: !20, line: 92, baseType: !65, size: 64, offset: 1280)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !644, file: !20, line: 93, baseType: !643, size: 64, offset: 1344)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !644, file: !20, line: 94, baseType: !69, size: 64, offset: 1408)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !644, file: !20, line: 95, baseType: !71, size: 64, offset: 1472)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !644, file: !20, line: 96, baseType: !23, size: 32, offset: 1536)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !644, file: !20, line: 98, baseType: !76, size: 160, offset: 1568)
!675 = distinct !DICompileUnit(language: DW_LANG_C99, file: !676, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !677, retainedTypes: !690, nameTableKind: None)
!676 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!677 = !{!678}
!678 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !679, file: !473, line: 186, baseType: !6, size: 32, elements: !688)
!679 = distinct !DISubprogram(name: "x2nrealloc", scope: !473, file: !473, line: 174, type: !680, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !675, retainedNodes: !683)
!680 = !DISubroutineType(types: !681)
!681 = !{!69, !69, !682, !71}
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!683 = !{!684, !685, !686, !687}
!684 = !DILocalVariable(name: "p", arg: 1, scope: !679, file: !473, line: 174, type: !69)
!685 = !DILocalVariable(name: "pn", arg: 2, scope: !679, file: !473, line: 174, type: !682)
!686 = !DILocalVariable(name: "s", arg: 3, scope: !679, file: !473, line: 174, type: !71)
!687 = !DILocalVariable(name: "n", scope: !679, file: !473, line: 176, type: !71)
!688 = !{!689}
!689 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!690 = !{!71, !525, !524, !526, !25, !316, !69, !691, !694}
!691 = !DISubprogram(name: "xcalloc", scope: !473, file: !473, line: 57, type: !692, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !246)
!692 = !DISubroutineType(types: !693)
!693 = !{!69, !73, !73}
!694 = !DISubprogram(name: "rpl_calloc", scope: !695, file: !695, line: 688, type: !692, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !246)
!695 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!696 = distinct !DICompileUnit(language: DW_LANG_C99, file: !697, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !246, retainedTypes: !698, nameTableKind: None)
!697 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!698 = !{!242, !291}
!699 = distinct !DICompileUnit(language: DW_LANG_C99, file: !700, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !246, retainedTypes: !701, nameTableKind: None)
!700 = !DIFile(filename: "lib/xstrndup.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!701 = !{!525}
!702 = distinct !DICompileUnit(language: DW_LANG_C99, file: !703, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !246, retainedTypes: !704, nameTableKind: None)
!703 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!704 = !{!69}
!705 = distinct !DICompileUnit(language: DW_LANG_C99, file: !706, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !246, retainedTypes: !707, nameTableKind: None)
!706 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!707 = !{!708, !743, !744, !747}
!708 = !DISubprogram(name: "fileno", scope: !248, file: !248, line: 786, type: !709, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !246)
!709 = !DISubroutineType(types: !710)
!710 = !{!23, !711}
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !20, line: 49, size: 1728, elements: !713)
!713 = !{!714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !712, file: !20, line: 51, baseType: !23, size: 32)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !712, file: !20, line: 54, baseType: !25, size: 64, offset: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !712, file: !20, line: 55, baseType: !25, size: 64, offset: 128)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !712, file: !20, line: 56, baseType: !25, size: 64, offset: 192)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !712, file: !20, line: 57, baseType: !25, size: 64, offset: 256)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !712, file: !20, line: 58, baseType: !25, size: 64, offset: 320)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !712, file: !20, line: 59, baseType: !25, size: 64, offset: 384)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !712, file: !20, line: 60, baseType: !25, size: 64, offset: 448)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !712, file: !20, line: 61, baseType: !25, size: 64, offset: 512)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !712, file: !20, line: 64, baseType: !25, size: 64, offset: 576)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !712, file: !20, line: 65, baseType: !25, size: 64, offset: 640)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !712, file: !20, line: 66, baseType: !25, size: 64, offset: 704)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !712, file: !20, line: 68, baseType: !38, size: 64, offset: 768)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !712, file: !20, line: 70, baseType: !711, size: 64, offset: 832)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !712, file: !20, line: 72, baseType: !23, size: 32, offset: 896)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !712, file: !20, line: 73, baseType: !23, size: 32, offset: 928)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !712, file: !20, line: 74, baseType: !45, size: 64, offset: 960)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !712, file: !20, line: 77, baseType: !49, size: 16, offset: 1024)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !712, file: !20, line: 78, baseType: !51, size: 8, offset: 1040)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !712, file: !20, line: 79, baseType: !53, size: 8, offset: 1048)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !712, file: !20, line: 81, baseType: !57, size: 64, offset: 1088)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !712, file: !20, line: 89, baseType: !60, size: 64, offset: 1152)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !712, file: !20, line: 91, baseType: !62, size: 64, offset: 1216)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !712, file: !20, line: 92, baseType: !65, size: 64, offset: 1280)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !712, file: !20, line: 93, baseType: !711, size: 64, offset: 1344)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !712, file: !20, line: 94, baseType: !69, size: 64, offset: 1408)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !712, file: !20, line: 95, baseType: !71, size: 64, offset: 1472)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !712, file: !20, line: 96, baseType: !23, size: 32, offset: 1536)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !712, file: !20, line: 98, baseType: !76, size: 160, offset: 1568)
!743 = !DISubprogram(name: "fclose", scope: !248, file: !248, line: 213, type: !709, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !246)
!744 = !DISubprogram(name: "lseek", scope: !620, file: !620, line: 334, type: !745, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !246)
!745 = !DISubroutineType(types: !746)
!746 = !{!47, !23, !47, !23}
!747 = !DISubprogram(name: "rpl_fflush", scope: !340, file: !340, line: 718, type: !709, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !246)
!748 = distinct !DICompileUnit(language: DW_LANG_C99, file: !749, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !246, retainedTypes: !750, nameTableKind: None)
!749 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!750 = !{!69, !751, !786}
!751 = !DISubprogram(name: "fflush", scope: !248, file: !248, line: 218, type: !752, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !246)
!752 = !DISubroutineType(types: !753)
!753 = !{!23, !754}
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !20, line: 49, size: 1728, elements: !756)
!756 = !{!757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !755, file: !20, line: 51, baseType: !23, size: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !755, file: !20, line: 54, baseType: !25, size: 64, offset: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !755, file: !20, line: 55, baseType: !25, size: 64, offset: 128)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !755, file: !20, line: 56, baseType: !25, size: 64, offset: 192)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !755, file: !20, line: 57, baseType: !25, size: 64, offset: 256)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !755, file: !20, line: 58, baseType: !25, size: 64, offset: 320)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !755, file: !20, line: 59, baseType: !25, size: 64, offset: 384)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !755, file: !20, line: 60, baseType: !25, size: 64, offset: 448)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !755, file: !20, line: 61, baseType: !25, size: 64, offset: 512)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !755, file: !20, line: 64, baseType: !25, size: 64, offset: 576)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !755, file: !20, line: 65, baseType: !25, size: 64, offset: 640)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !755, file: !20, line: 66, baseType: !25, size: 64, offset: 704)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !755, file: !20, line: 68, baseType: !38, size: 64, offset: 768)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !755, file: !20, line: 70, baseType: !754, size: 64, offset: 832)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !755, file: !20, line: 72, baseType: !23, size: 32, offset: 896)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !755, file: !20, line: 73, baseType: !23, size: 32, offset: 928)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !755, file: !20, line: 74, baseType: !45, size: 64, offset: 960)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !755, file: !20, line: 77, baseType: !49, size: 16, offset: 1024)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !755, file: !20, line: 78, baseType: !51, size: 8, offset: 1040)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !755, file: !20, line: 79, baseType: !53, size: 8, offset: 1048)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !755, file: !20, line: 81, baseType: !57, size: 64, offset: 1088)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !755, file: !20, line: 89, baseType: !60, size: 64, offset: 1152)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !755, file: !20, line: 91, baseType: !62, size: 64, offset: 1216)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !755, file: !20, line: 92, baseType: !65, size: 64, offset: 1280)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !755, file: !20, line: 93, baseType: !754, size: 64, offset: 1344)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !755, file: !20, line: 94, baseType: !69, size: 64, offset: 1408)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !755, file: !20, line: 95, baseType: !71, size: 64, offset: 1472)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !755, file: !20, line: 96, baseType: !23, size: 32, offset: 1536)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !755, file: !20, line: 98, baseType: !76, size: 160, offset: 1568)
!786 = !DISubprogram(name: "rpl_fseeko", scope: !340, file: !340, line: 1034, type: !787, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !246)
!787 = !DISubroutineType(types: !788)
!788 = !{!23, !754, !47, !23}
!789 = distinct !DICompileUnit(language: DW_LANG_C99, file: !790, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !246, retainedTypes: !791, nameTableKind: None)
!790 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!791 = !{!69, !792, !744, !827}
!792 = !DISubprogram(name: "fileno", scope: !248, file: !248, line: 786, type: !793, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !246)
!793 = !DISubroutineType(types: !794)
!794 = !{!23, !795}
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !20, line: 49, size: 1728, elements: !797)
!797 = !{!798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !796, file: !20, line: 51, baseType: !23, size: 32)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !796, file: !20, line: 54, baseType: !25, size: 64, offset: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !796, file: !20, line: 55, baseType: !25, size: 64, offset: 128)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !796, file: !20, line: 56, baseType: !25, size: 64, offset: 192)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !796, file: !20, line: 57, baseType: !25, size: 64, offset: 256)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !796, file: !20, line: 58, baseType: !25, size: 64, offset: 320)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !796, file: !20, line: 59, baseType: !25, size: 64, offset: 384)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !796, file: !20, line: 60, baseType: !25, size: 64, offset: 448)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !796, file: !20, line: 61, baseType: !25, size: 64, offset: 512)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !796, file: !20, line: 64, baseType: !25, size: 64, offset: 576)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !796, file: !20, line: 65, baseType: !25, size: 64, offset: 640)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !796, file: !20, line: 66, baseType: !25, size: 64, offset: 704)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !796, file: !20, line: 68, baseType: !38, size: 64, offset: 768)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !796, file: !20, line: 70, baseType: !795, size: 64, offset: 832)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !796, file: !20, line: 72, baseType: !23, size: 32, offset: 896)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !796, file: !20, line: 73, baseType: !23, size: 32, offset: 928)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !796, file: !20, line: 74, baseType: !45, size: 64, offset: 960)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !796, file: !20, line: 77, baseType: !49, size: 16, offset: 1024)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !796, file: !20, line: 78, baseType: !51, size: 8, offset: 1040)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !796, file: !20, line: 79, baseType: !53, size: 8, offset: 1048)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !796, file: !20, line: 81, baseType: !57, size: 64, offset: 1088)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !796, file: !20, line: 89, baseType: !60, size: 64, offset: 1152)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !796, file: !20, line: 91, baseType: !62, size: 64, offset: 1216)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !796, file: !20, line: 92, baseType: !65, size: 64, offset: 1280)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !796, file: !20, line: 93, baseType: !795, size: 64, offset: 1344)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !796, file: !20, line: 94, baseType: !69, size: 64, offset: 1408)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !796, file: !20, line: 95, baseType: !71, size: 64, offset: 1472)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !796, file: !20, line: 96, baseType: !23, size: 32, offset: 1536)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !796, file: !20, line: 98, baseType: !76, size: 160, offset: 1568)
!827 = !DISubprogram(name: "fseeko", scope: !248, file: !248, line: 707, type: !828, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !246)
!828 = !DISubroutineType(types: !829)
!829 = !{!23, !795, !47, !23}
!830 = distinct !DICompileUnit(language: DW_LANG_C99, file: !831, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !246, retainedTypes: !832, nameTableKind: None)
!831 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!832 = !{!833, !71, !845}
!833 = !DISubprogram(name: "mbrtowc", scope: !515, file: !515, line: 296, type: !834, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !246)
!834 = !DISubroutineType(types: !835)
!835 = !{!73, !285, !79, !73, !836}
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !499, line: 13, size: 64, elements: !838)
!838 = !{!839, !840}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !837, file: !499, line: 15, baseType: !23, size: 32)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !837, file: !499, line: 20, baseType: !841, size: 32, offset: 32)
!841 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !837, file: !499, line: 16, size: 32, elements: !842)
!842 = !{!843, !844}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !841, file: !499, line: 18, baseType: !6, size: 32)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !841, file: !499, line: 19, baseType: !507, size: 32)
!845 = !DISubprogram(name: "hard_locale", scope: !846, file: !846, line: 26, type: !847, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !246)
!846 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!847 = !DISubroutineType(types: !848)
!848 = !{!15, !23}
!849 = distinct !DICompileUnit(language: DW_LANG_C99, file: !850, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !246, retainedTypes: !851, nameTableKind: None)
!850 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!851 = !{!852}
!852 = !DISubprogram(name: "rpl_fclose", scope: !340, file: !340, line: 672, type: !853, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !246)
!853 = !DISubroutineType(types: !854)
!854 = !{!23, !855}
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !20, line: 49, size: 1728, elements: !857)
!857 = !{!858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !856, file: !20, line: 51, baseType: !23, size: 32)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !856, file: !20, line: 54, baseType: !25, size: 64, offset: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !856, file: !20, line: 55, baseType: !25, size: 64, offset: 128)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !856, file: !20, line: 56, baseType: !25, size: 64, offset: 192)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !856, file: !20, line: 57, baseType: !25, size: 64, offset: 256)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !856, file: !20, line: 58, baseType: !25, size: 64, offset: 320)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !856, file: !20, line: 59, baseType: !25, size: 64, offset: 384)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !856, file: !20, line: 60, baseType: !25, size: 64, offset: 448)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !856, file: !20, line: 61, baseType: !25, size: 64, offset: 512)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !856, file: !20, line: 64, baseType: !25, size: 64, offset: 576)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !856, file: !20, line: 65, baseType: !25, size: 64, offset: 640)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !856, file: !20, line: 66, baseType: !25, size: 64, offset: 704)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !856, file: !20, line: 68, baseType: !38, size: 64, offset: 768)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !856, file: !20, line: 70, baseType: !855, size: 64, offset: 832)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !856, file: !20, line: 72, baseType: !23, size: 32, offset: 896)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !856, file: !20, line: 73, baseType: !23, size: 32, offset: 928)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !856, file: !20, line: 74, baseType: !45, size: 64, offset: 960)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !856, file: !20, line: 77, baseType: !49, size: 16, offset: 1024)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !856, file: !20, line: 78, baseType: !51, size: 8, offset: 1040)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !856, file: !20, line: 79, baseType: !53, size: 8, offset: 1048)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !856, file: !20, line: 81, baseType: !57, size: 64, offset: 1088)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !856, file: !20, line: 89, baseType: !60, size: 64, offset: 1152)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !856, file: !20, line: 91, baseType: !62, size: 64, offset: 1216)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !856, file: !20, line: 92, baseType: !65, size: 64, offset: 1280)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !856, file: !20, line: 93, baseType: !855, size: 64, offset: 1344)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !856, file: !20, line: 94, baseType: !69, size: 64, offset: 1408)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !856, file: !20, line: 95, baseType: !71, size: 64, offset: 1472)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !856, file: !20, line: 96, baseType: !23, size: 32, offset: 1536)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !856, file: !20, line: 98, baseType: !76, size: 160, offset: 1568)
!887 = distinct !DICompileUnit(language: DW_LANG_C99, file: !888, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !246, retainedTypes: !889, nameTableKind: None)
!888 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!889 = !{!890}
!890 = !DISubprogram(name: "setlocale_null_r", scope: !891, file: !891, line: 64, type: !892, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !246)
!891 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!892 = !DISubroutineType(types: !893)
!893 = !{!23, !23, !25, !73}
!894 = distinct !DICompileUnit(language: DW_LANG_C99, file: !895, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !896, retainedTypes: !1283, nameTableKind: None)
!895 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!896 = !{!897}
!897 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !898, line: 41, baseType: !6, size: 32, elements: !899)
!898 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!899 = !{!900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282}
!900 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!901 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!902 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!903 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!904 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!905 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!906 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!907 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!908 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!909 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!910 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!911 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!912 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!913 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!914 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!915 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!916 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!917 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!918 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!919 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!920 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!921 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!922 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!923 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!924 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!925 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!926 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!927 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!928 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!929 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!930 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!931 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!932 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!933 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!934 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!935 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!936 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!937 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!938 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!939 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!940 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!941 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!942 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!943 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
