source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon.12 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct._obstack_chunk = type { i8*, %struct._obstack_chunk*, [0 x i8] }
%struct.infomap = type { i8*, i8* }
%struct.obstack = type { i64, %struct._obstack_chunk*, i8*, i8*, i8*, %union.anon, i64, %union.anon.0, %union.anon.1, i8*, i8 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%union.anon = type { i64 }
%union.anon.0 = type { i8* (i64)* }
%union.anon.1 = type { void (i8*)* }
%union.anon.12 = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [30 x i8] c"Usage: %s [OPTION]... [FILE]\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 80, type: !260, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !241, globals: !243, nameTableKind: None)
!3 = !DIFile(filename: "src/dircolors.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !11, !212, !226}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Shell_syntax", file: !3, line: 42, baseType: !6, size: 32, elements: !7)
!6 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!7 = !{!8, !9, !10}
!8 = !DIEnumerator(name: "SHELL_SYNTAX_BOURNE", value: 0, isUnsigned: true)
!9 = !DIEnumerator(name: "SHELL_SYNTAX_C", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "SHELL_SYNTAX_UNKNOWN", value: 2, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !12, file: !3, line: 250, baseType: !6, size: 32, elements: !207)
!12 = distinct !DISubprogram(name: "dc_parse_stream", scope: !3, file: !3, line: 239, type: !13, scopeLine: 240, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !81)
!13 = !DISubroutineType(types: !14)
!14 = !{!15, !16, !79}
!15 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !18, line: 7, baseType: !19)
!18 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "")
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !20, line: 49, size: 1728, elements: !21)
!20 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!21 = !{!22, !24, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !40, !42, !43, !44, !48, !50, !52, !56, !59, !61, !64, !67, !68, !70, !74, !75}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !19, file: !20, line: 51, baseType: !23, size: 32)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !19, file: !20, line: 54, baseType: !25, size: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !19, file: !20, line: 55, baseType: !25, size: 64, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !19, file: !20, line: 56, baseType: !25, size: 64, offset: 192)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !19, file: !20, line: 57, baseType: !25, size: 64, offset: 256)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !19, file: !20, line: 58, baseType: !25, size: 64, offset: 320)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !19, file: !20, line: 59, baseType: !25, size: 64, offset: 384)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !19, file: !20, line: 60, baseType: !25, size: 64, offset: 448)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !19, file: !20, line: 61, baseType: !25, size: 64, offset: 512)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !19, file: !20, line: 64, baseType: !25, size: 64, offset: 576)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !19, file: !20, line: 65, baseType: !25, size: 64, offset: 640)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !19, file: !20, line: 66, baseType: !25, size: 64, offset: 704)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !19, file: !20, line: 68, baseType: !38, size: 64, offset: 768)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !20, line: 36, flags: DIFlagFwdDecl)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !19, file: !20, line: 70, baseType: !41, size: 64, offset: 832)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !19, file: !20, line: 72, baseType: !23, size: 32, offset: 896)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !19, file: !20, line: 73, baseType: !23, size: 32, offset: 928)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !19, file: !20, line: 74, baseType: !45, size: 64, offset: 960)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !46, line: 152, baseType: !47)
!46 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!47 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !19, file: !20, line: 77, baseType: !49, size: 16, offset: 1024)
!49 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !19, file: !20, line: 78, baseType: !51, size: 8, offset: 1040)
!51 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !19, file: !20, line: 79, baseType: !53, size: 8, offset: 1048)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 8, elements: !54)
!54 = !{!55}
!55 = !DISubrange(count: 1)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !19, file: !20, line: 81, baseType: !57, size: 64, offset: 1088)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !20, line: 43, baseType: null)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !19, file: !20, line: 89, baseType: !60, size: 64, offset: 1152)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !46, line: 153, baseType: !47)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !19, file: !20, line: 91, baseType: !62, size: 64, offset: 1216)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !20, line: 37, flags: DIFlagFwdDecl)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !19, file: !20, line: 92, baseType: !65, size: 64, offset: 1280)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !20, line: 38, flags: DIFlagFwdDecl)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !19, file: !20, line: 93, baseType: !41, size: 64, offset: 1344)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !19, file: !20, line: 94, baseType: !69, size: 64, offset: 1408)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !19, file: !20, line: 95, baseType: !71, size: 64, offset: 1472)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !72, line: 46, baseType: !73)
!72 = !DIFile(filename: "/usr/lib/clang/12.0.1/include/stddef.h", directory: "")
!73 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !19, file: !20, line: 96, baseType: !23, size: 32, offset: 1536)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !19, file: !20, line: 98, baseType: !76, size: 160, offset: 1568)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 160, elements: !77)
!77 = !{!78}
!78 = !DISubrange(count: 20)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!81 = !{!82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !94, !95, !96, !154, !159, !161, !164, !166, !169, !173, !176, !178, !181, !184, !189, !192, !194, !197, !199, !202, !204}
!82 = !DILocalVariable(name: "fp", arg: 1, scope: !12, file: !3, line: 239, type: !16)
!83 = !DILocalVariable(name: "filename", arg: 2, scope: !12, file: !3, line: 239, type: !79)
!84 = !DILocalVariable(name: "line_number", scope: !12, file: !3, line: 241, type: !71)
!85 = !DILocalVariable(name: "next_G_line", scope: !12, file: !3, line: 242, type: !79)
!86 = !DILocalVariable(name: "input_line", scope: !12, file: !3, line: 243, type: !25)
!87 = !DILocalVariable(name: "input_line_size", scope: !12, file: !3, line: 244, type: !71)
!88 = !DILocalVariable(name: "line", scope: !12, file: !3, line: 245, type: !79)
!89 = !DILocalVariable(name: "term", scope: !12, file: !3, line: 246, type: !79)
!90 = !DILocalVariable(name: "ok", scope: !12, file: !3, line: 247, type: !15)
!91 = !DILocalVariable(name: "state", scope: !12, file: !3, line: 250, type: !11)
!92 = !DILocalVariable(name: "keywd", scope: !93, file: !3, line: 259, type: !25)
!93 = distinct !DILexicalBlock(scope: !12, file: !3, line: 258, column: 5)
!94 = !DILocalVariable(name: "arg", scope: !93, file: !3, line: 259, type: !25)
!95 = !DILocalVariable(name: "unrecognized", scope: !93, file: !3, line: 260, type: !15)
!96 = !DILocalVariable(name: "__o", scope: !97, file: !3, line: 312, type: !104)
!97 = distinct !DILexicalBlock(scope: !98, file: !3, line: 312, column: 19)
!98 = distinct !DILexicalBlock(scope: !99, file: !3, line: 311, column: 17)
!99 = distinct !DILexicalBlock(scope: !100, file: !3, line: 310, column: 19)
!100 = distinct !DILexicalBlock(scope: !101, file: !3, line: 309, column: 13)
!101 = distinct !DILexicalBlock(scope: !102, file: !3, line: 308, column: 15)
!102 = distinct !DILexicalBlock(scope: !103, file: !3, line: 304, column: 9)
!103 = distinct !DILexicalBlock(scope: !93, file: !3, line: 296, column: 11)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !106, line: 174, size: 704, elements: !107)
!106 = !DIFile(filename: "./lib/obstack.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!107 = !{!108, !109, !119, !120, !121, !122, !127, !128, !139, !150, !151, !152, !153}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !105, file: !106, line: 176, baseType: !71, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !105, file: !106, line: 177, baseType: !110, size: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !106, line: 167, size: 128, elements: !112)
!112 = !{!113, !114, !115}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !111, file: !106, line: 169, baseType: !25, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !111, file: !106, line: 170, baseType: !110, size: 64, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !111, file: !106, line: 171, baseType: !116, offset: 128)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, elements: !117)
!117 = !{!118}
!118 = !DISubrange(count: -1)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !105, file: !106, line: 178, baseType: !25, size: 64, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !105, file: !106, line: 179, baseType: !25, size: 64, offset: 192)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !105, file: !106, line: 180, baseType: !25, size: 64, offset: 256)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !105, file: !106, line: 185, baseType: !123, size: 64, offset: 320)
!123 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !105, file: !106, line: 181, size: 64, elements: !124)
!124 = !{!125, !126}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !123, file: !106, line: 183, baseType: !71, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !123, file: !106, line: 184, baseType: !69, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !105, file: !106, line: 186, baseType: !71, size: 64, offset: 384)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !105, file: !106, line: 193, baseType: !129, size: 64, offset: 448)
!129 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !105, file: !106, line: 189, size: 64, elements: !130)
!130 = !{!131, !135}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !129, file: !106, line: 191, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!69, !71}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !129, file: !106, line: 192, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!69, !69, !71}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !105, file: !106, line: 198, baseType: !140, size: 64, offset: 512)
!140 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !105, file: !106, line: 194, size: 64, elements: !141)
!141 = !{!142, !146}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !140, file: !106, line: 196, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{null, !69}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !140, file: !106, line: 197, baseType: !147, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{null, !69, !69}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !105, file: !106, line: 200, baseType: !69, size: 64, offset: 576)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !105, file: !106, line: 201, baseType: !6, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !105, file: !106, line: 202, baseType: !6, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !105, file: !106, line: 206, baseType: !6, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!154 = !DILocalVariable(name: "__o1", scope: !155, file: !3, line: 312, type: !157)
!155 = distinct !DILexicalBlock(scope: !156, file: !3, line: 312, column: 19)
!156 = distinct !DILexicalBlock(scope: !97, file: !3, line: 312, column: 19)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !105)
!159 = !DILocalVariable(name: "__o", scope: !160, file: !3, line: 314, type: !104)
!160 = distinct !DILexicalBlock(scope: !98, file: !3, line: 314, column: 19)
!161 = !DILocalVariable(name: "__o1", scope: !162, file: !3, line: 314, type: !157)
!162 = distinct !DILexicalBlock(scope: !163, file: !3, line: 314, column: 19)
!163 = distinct !DILexicalBlock(scope: !160, file: !3, line: 314, column: 19)
!164 = !DILocalVariable(name: "__o", scope: !165, file: !3, line: 316, type: !104)
!165 = distinct !DILexicalBlock(scope: !98, file: !3, line: 316, column: 19)
!166 = !DILocalVariable(name: "__o1", scope: !167, file: !3, line: 316, type: !157)
!167 = distinct !DILexicalBlock(scope: !168, file: !3, line: 316, column: 19)
!168 = distinct !DILexicalBlock(scope: !165, file: !3, line: 316, column: 19)
!169 = !DILocalVariable(name: "__o", scope: !170, file: !3, line: 321, type: !104)
!170 = distinct !DILexicalBlock(scope: !171, file: !3, line: 321, column: 19)
!171 = distinct !DILexicalBlock(scope: !172, file: !3, line: 319, column: 17)
!172 = distinct !DILexicalBlock(scope: !99, file: !3, line: 318, column: 24)
!173 = !DILocalVariable(name: "__o1", scope: !174, file: !3, line: 321, type: !157)
!174 = distinct !DILexicalBlock(scope: !175, file: !3, line: 321, column: 19)
!175 = distinct !DILexicalBlock(scope: !170, file: !3, line: 321, column: 19)
!176 = !DILocalVariable(name: "__o", scope: !177, file: !3, line: 323, type: !104)
!177 = distinct !DILexicalBlock(scope: !171, file: !3, line: 323, column: 19)
!178 = !DILocalVariable(name: "__o1", scope: !179, file: !3, line: 323, type: !157)
!179 = distinct !DILexicalBlock(scope: !180, file: !3, line: 323, column: 19)
!180 = distinct !DILexicalBlock(scope: !177, file: !3, line: 323, column: 19)
!181 = !DILocalVariable(name: "i", scope: !182, file: !3, line: 333, type: !23)
!182 = distinct !DILexicalBlock(scope: !183, file: !3, line: 332, column: 17)
!183 = distinct !DILexicalBlock(scope: !172, file: !3, line: 325, column: 24)
!184 = !DILocalVariable(name: "__o", scope: !185, file: !3, line: 341, type: !104)
!185 = distinct !DILexicalBlock(scope: !186, file: !3, line: 341, column: 23)
!186 = distinct !DILexicalBlock(scope: !187, file: !3, line: 341, column: 23)
!187 = distinct !DILexicalBlock(scope: !188, file: !3, line: 340, column: 21)
!188 = distinct !DILexicalBlock(scope: !182, file: !3, line: 339, column: 23)
!189 = !DILocalVariable(name: "__o1", scope: !190, file: !3, line: 341, type: !157)
!190 = distinct !DILexicalBlock(scope: !191, file: !3, line: 341, column: 23)
!191 = distinct !DILexicalBlock(scope: !185, file: !3, line: 341, column: 23)
!192 = !DILocalVariable(name: "__o", scope: !193, file: !3, line: 341, type: !104)
!193 = distinct !DILexicalBlock(scope: !186, file: !3, line: 341, column: 23)
!194 = !DILocalVariable(name: "__o1", scope: !195, file: !3, line: 341, type: !157)
!195 = distinct !DILexicalBlock(scope: !196, file: !3, line: 341, column: 23)
!196 = distinct !DILexicalBlock(scope: !193, file: !3, line: 341, column: 23)
!197 = !DILocalVariable(name: "__o", scope: !198, file: !3, line: 342, type: !104)
!198 = distinct !DILexicalBlock(scope: !187, file: !3, line: 342, column: 23)
!199 = !DILocalVariable(name: "__o1", scope: !200, file: !3, line: 342, type: !157)
!200 = distinct !DILexicalBlock(scope: !201, file: !3, line: 342, column: 23)
!201 = distinct !DILexicalBlock(scope: !198, file: !3, line: 342, column: 23)
!202 = !DILocalVariable(name: "__o", scope: !203, file: !3, line: 344, type: !104)
!203 = distinct !DILexicalBlock(scope: !187, file: !3, line: 344, column: 23)
!204 = !DILocalVariable(name: "__o1", scope: !205, file: !3, line: 344, type: !157)
!205 = distinct !DILexicalBlock(scope: !206, file: !3, line: 344, column: 23)
!206 = distinct !DILexicalBlock(scope: !203, file: !3, line: 344, column: 23)
!207 = !{!208, !209, !210, !211}
!208 = !DIEnumerator(name: "ST_TERMNO", value: 0, isUnsigned: true)
!209 = !DIEnumerator(name: "ST_TERMYES", value: 1, isUnsigned: true)
!210 = !DIEnumerator(name: "ST_TERMSURE", value: 2, isUnsigned: true)
!211 = !DIEnumerator(name: "ST_GLOBAL", value: 3, isUnsigned: true)
!212 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !213, line: 32, baseType: !6, size: 32, elements: !214)
!213 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!214 = !{!215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225}
!215 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!216 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!217 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!218 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!219 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!220 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!221 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!222 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!223 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!224 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!225 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!226 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !227, line: 46, baseType: !6, size: 32, elements: !228)
!227 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!228 = !{!229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240}
!229 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!230 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!231 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!232 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!233 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!234 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!235 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!236 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!237 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!238 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!239 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!240 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!241 = !{!25, !69, !71, !79, !73, !23, !49, !242}
!242 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!243 = !{!244, !0, !246, !252, !258}
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(name: "lsc_obstack", scope: !2, file: !3, line: 60, type: !105, isLocal: true, isDefinition: true)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(name: "G_line", scope: !2, file: !248, line: 1, type: !249, isLocal: true, isDefinition: true)
!248 = !DIFile(filename: "src/dircolors.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 34432, elements: !250)
!250 = !{!251}
!251 = !DISubrange(count: 4304)
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(name: "slack_codes", scope: !2, file: !3, line: 62, type: !254, isLocal: true, isDefinition: true)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !255, size: 2432, elements: !256)
!255 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !79)
!256 = !{!257}
!257 = !DISubrange(count: 38)
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(name: "ls_codes", scope: !2, file: !3, line: 72, type: !254, isLocal: true, isDefinition: true)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 2048, elements: !270)
!261 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !262)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !263, line: 50, size: 256, elements: !264)
!263 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!264 = !{!265, !266, !267, !269}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !262, file: !263, line: 52, baseType: !79, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !262, file: !263, line: 55, baseType: !23, size: 32, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !262, file: !263, line: 56, baseType: !268, size: 64, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !262, file: !263, line: 57, baseType: !23, size: 32, offset: 192)
!270 = !{!271}
!271 = !DISubrange(count: 8)
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(name: "Version", scope: !274, file: !275, line: 2, type: !79, isDefinition: true)
!274 = distinct !DICompileUnit(language: DW_LANG_C99, file: !275, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !276, globals: !277, nameTableKind: None)
!275 = !DIFile(filename: "src/version.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!276 = !{}
!277 = !{!272}
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(name: "file_name", scope: !280, file: !281, line: 46, type: !79, isLocal: true, isDefinition: true)
!280 = distinct !DICompileUnit(language: DW_LANG_C99, file: !281, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !276, globals: !282, nameTableKind: None)
!281 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!282 = !{!278, !283}
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !280, file: !281, line: 56, type: !15, isLocal: true, isDefinition: true)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(name: "exit_failure", scope: !287, file: !288, line: 24, type: !290, isDefinition: true)
!287 = distinct !DICompileUnit(language: DW_LANG_C99, file: !288, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !276, globals: !289, nameTableKind: None)
!288 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!289 = !{!285}
!290 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !23)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "program_name", scope: !293, file: !294, line: 33, type: !79, isDefinition: true)
!293 = distinct !DICompileUnit(language: DW_LANG_C99, file: !294, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !276, retainedTypes: !295, globals: !296, nameTableKind: None)
!294 = !DIFile(filename: "lib/progname.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!295 = !{!69, !25}
!296 = !{!291}
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !299, file: !300, line: 85, type: !343, isDefinition: true)
!299 = distinct !DICompileUnit(language: DW_LANG_C99, file: !300, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !301, retainedTypes: !307, globals: !308, nameTableKind: None)
!300 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!301 = !{!212, !302, !226}
!302 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !213, line: 242, baseType: !6, size: 32, elements: !303)
!303 = !{!304, !305, !306}
!304 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!305 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!306 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!307 = !{!23, !49, !71, !25}
!308 = !{!297, !309, !315, !325, !327, !332, !339, !341}
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !299, file: !300, line: 101, type: !311, isDefinition: true)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !312, size: 320, elements: !313)
!312 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !212)
!313 = !{!314}
!314 = !DISubrange(count: 10)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !299, file: !300, line: 1052, type: !317, isDefinition: true)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !300, line: 65, size: 448, elements: !318)
!318 = !{!319, !320, !321, !323, !324}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !317, file: !300, line: 68, baseType: !212, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !317, file: !300, line: 71, baseType: !23, size: 32, offset: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !317, file: !300, line: 75, baseType: !322, size: 256, offset: 64)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !270)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !317, file: !300, line: 78, baseType: !79, size: 64, offset: 320)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !317, file: !300, line: 81, baseType: !79, size: 64, offset: 384)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !299, file: !300, line: 116, type: !317, isLocal: true, isDefinition: true)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "slot0", scope: !299, file: !300, line: 842, type: !329, isLocal: true, isDefinition: true)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 2048, elements: !330)
!330 = !{!331}
!331 = !DISubrange(count: 256)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(name: "slotvec", scope: !299, file: !300, line: 845, type: !334, isLocal: true, isDefinition: true)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !300, line: 834, size: 128, elements: !336)
!336 = !{!337, !338}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !335, file: !300, line: 836, baseType: !71, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !335, file: !300, line: 837, baseType: !25, size: 64, offset: 64)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "nslots", scope: !299, file: !300, line: 843, type: !23, isLocal: true, isDefinition: true)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "slotvec0", scope: !299, file: !300, line: 844, type: !335, isLocal: true, isDefinition: true)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !255, size: 704, elements: !344)
!344 = !{!345}
!345 = !DISubrange(count: 11)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !348, file: !349, line: 26, type: !351, isDefinition: true)
!348 = distinct !DICompileUnit(language: DW_LANG_C99, file: !349, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !276, globals: !350, nameTableKind: None)
!349 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!350 = !{!346}
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 376, elements: !352)
!352 = !{!353}
!353 = !DISubrange(count: 47)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "obstack_alloc_failed_handler", scope: !356, file: !357, line: 351, type: !360, isDefinition: true)
!356 = distinct !DICompileUnit(language: DW_LANG_C99, file: !357, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !276, retainedTypes: !358, globals: !359, nameTableKind: None)
!357 = !DIFile(filename: "lib/obstack.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!358 = !{!25, !69}
!359 = !{!354}
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DISubroutineType(types: !362)
!362 = !{null}
!363 = distinct !DICompileUnit(language: DW_LANG_C99, file: !364, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !276, retainedTypes: !365, nameTableKind: None)
!364 = !DIFile(filename: "lib/c-strcasecmp.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!365 = !{!366}
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !242)
!368 = distinct !DICompileUnit(language: DW_LANG_C99, file: !369, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !276, retainedTypes: !370, nameTableKind: None)
!369 = !DIFile(filename: "lib/basename-lgpl.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!370 = !{!25}
!371 = distinct !DICompileUnit(language: DW_LANG_C99, file: !372, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !276, nameTableKind: None)
!372 = !DIFile(filename: "lib/freopen-safer.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!373 = distinct !DICompileUnit(language: DW_LANG_C99, file: !374, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !375, retainedTypes: !379, nameTableKind: None)
!374 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!375 = !{!376}
!376 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !374, line: 40, baseType: !6, size: 32, elements: !377)
!377 = !{!378}
!378 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!379 = !{!69}
!380 = distinct !DICompileUnit(language: DW_LANG_C99, file: !381, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !382, retainedTypes: !396, nameTableKind: None)
!381 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!382 = !{!383}
!383 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !385, file: !384, line: 186, baseType: !6, size: 32, elements: !394)
!384 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!385 = distinct !DISubprogram(name: "x2nrealloc", scope: !384, file: !384, line: 174, type: !386, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !380, retainedNodes: !389)
!386 = !DISubroutineType(types: !387)
!387 = !{!69, !69, !388, !71}
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!389 = !{!390, !391, !392, !393}
!390 = !DILocalVariable(name: "p", arg: 1, scope: !385, file: !384, line: 174, type: !69)
!391 = !DILocalVariable(name: "pn", arg: 2, scope: !385, file: !384, line: 174, type: !388)
!392 = !DILocalVariable(name: "s", arg: 3, scope: !385, file: !384, line: 174, type: !71)
!393 = !DILocalVariable(name: "n", scope: !385, file: !384, line: 176, type: !71)
!394 = !{!395}
!395 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!396 = !{!71, !25, !69}
!397 = distinct !DICompileUnit(language: DW_LANG_C99, file: !398, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !276, nameTableKind: None)
!398 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!399 = distinct !DICompileUnit(language: DW_LANG_C99, file: !400, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !276, nameTableKind: None)
!400 = !DIFile(filename: "lib/xstrndup.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!401 = distinct !DICompileUnit(language: DW_LANG_C99, file: !402, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !276, retainedTypes: !379, nameTableKind: None)
!402 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!403 = distinct !DICompileUnit(language: DW_LANG_C99, file: !404, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !276, nameTableKind: None)
!404 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!405 = distinct !DICompileUnit(language: DW_LANG_C99, file: !406, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !276, retainedTypes: !379, nameTableKind: None)
!406 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!407 = distinct !DICompileUnit(language: DW_LANG_C99, file: !408, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !276, retainedTypes: !379, nameTableKind: None)
!408 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!409 = distinct !DICompileUnit(language: DW_LANG_C99, file: !410, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !276, retainedTypes: !411, nameTableKind: None)
!410 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!411 = !{!71}
!412 = distinct !DICompileUnit(language: DW_LANG_C99, file: !413, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !276, nameTableKind: None)
!413 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!414 = distinct !DICompileUnit(language: DW_LANG_C99, file: !415, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !276, nameTableKind: None)
!415 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!416 = distinct !DICompileUnit(language: DW_LANG_C99, file: !417, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !418, retainedTypes: !379, nameTableKind: None)
!417 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!418 = !{!419}
!419 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !420, line: 41, baseType: !6, size: 32, elements: !421)
!420 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!421 = !{!422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804}
!422 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!423 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!424 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!425 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!426 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!427 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!428 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!429 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!430 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!431 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!432 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!433 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!434 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!435 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!436 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!437 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!438 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!439 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!440 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!441 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!442 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!443 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!444 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!445 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!446 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!447 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!448 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!449 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!450 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!451 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!452 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!453 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!454 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!455 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!456 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!457 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!458 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!459 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!460 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!461 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!462 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!463 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!464 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!465 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!466 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!467 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!468 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!469 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!470 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!471 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!472 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!473 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!474 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!475 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!476 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!477 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!478 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!479 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!480 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!481 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!482 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!483 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!484 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!485 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!486 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!487 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!488 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!489 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!490 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!491 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!492 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!493 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!494 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!495 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!496 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!497 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!498 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!499 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!500 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!501 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!502 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!503 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!504 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!505 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!506 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!507 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!508 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!509 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!510 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!511 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!512 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!513 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!514 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!515 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!516 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!517 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!518 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!519 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!520 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!521 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!522 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!523 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!524 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!525 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!526 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!527 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!528 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!529 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!530 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!531 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!532 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!533 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!534 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!535 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!536 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!537 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!538 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!539 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!540 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!541 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!542 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!543 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!544 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!545 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!546 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!547 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!548 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!549 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!550 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!551 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!552 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!553 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!554 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!555 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!556 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!557 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!558 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!559 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!560 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!561 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!562 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!563 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!564 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!565 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!566 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!567 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!568 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!569 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!570 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!571 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!572 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!573 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!574 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!575 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!576 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!577 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!578 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!579 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!580 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!581 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!582 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!583 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!584 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!585 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!586 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!587 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!588 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!589 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!590 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!591 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!592 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!593 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!594 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!595 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!596 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!597 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!598 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!599 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!600 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!601 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!602 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!603 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!604 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!605 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!606 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!607 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!608 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!609 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!610 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!611 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!612 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!613 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!614 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!615 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!616 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!617 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!618 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!619 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!620 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!621 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!622 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!623 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!624 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!625 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!626 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!627 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!628 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!629 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!630 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!631 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!632 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!633 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!634 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!635 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!636 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!637 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!661 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!662 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!663 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!664 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!665 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!666 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!667 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!668 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!669 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!670 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!671 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!672 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!673 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!674 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!675 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!676 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!677 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!678 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!679 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!680 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!681 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!682 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!683 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!684 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!685 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!686 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!687 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!688 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!689 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!690 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!691 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!692 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!693 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!694 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!695 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!696 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!697 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!698 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!699 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!700 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!701 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!702 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!703 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!704 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!705 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!706 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!707 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!708 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!709 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!710 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!711 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!712 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!713 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!714 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!715 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!716 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!717 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!719 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!720 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!721 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!722 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!723 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!724 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!725 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!726 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!727 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!728 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!729 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!730 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!731 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!732 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!733 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!734 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!735 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!736 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!737 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!738 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!739 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!740 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!741 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!742 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!743 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!744 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!745 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!746 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!747 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!748 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!749 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!750 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!751 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!752 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!753 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!754 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!755 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!756 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!757 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!758 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!759 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!760 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!761 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!762 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!763 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!764 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!765 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!766 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!767 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!768 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!769 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!770 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!771 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!772 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!773 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!774 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!779 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!780 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!781 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!782 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!783 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!784 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!785 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!786 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!787 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!788 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!789 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!790 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!791 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!793 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!794 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!795 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!796 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!797 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!798 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!799 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!800 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!801 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!802 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!803 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!804 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!805 = distinct !DICompileUnit(language: DW_LANG_C99, file: !806, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !276, retainedTypes: !379, nameTableKind: None)
!806 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!807 = !{!"clang version 12.0.1"}
!808 = !{i32 7, !"Dwarf Version", i32 4}
!809 = !{i32 2, !"Debug Info Version", i32 3}
!810 = !{i32 1, !"wchar_size", i32 4}
!811 = !{i32 7, !"PIC Level", i32 2}
!812 = !{i32 7, !"PIE Level", i32 2}
!813 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 93, type: !814, scopeLine: 94, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !816)
!814 = !DISubroutineType(types: !815)
!815 = !{null, !23}
!816 = !{!817}
!817 = !DILocalVariable(name: "status", arg: 1, scope: !813, file: !3, line: 93, type: !23)
!818 = !DILocation(scope: !813)
!819 = !DILocation(line: 95, column: 14, scope: !820)
!820 = distinct !DILexicalBlock(scope: !813, file: !3, line: 95, column: 7)
!821 = !DILocation(line: 95, column: 7, scope: !813)
!822 = !DILocation(line: 96, column: 5, scope: !823)
!823 = distinct !DILexicalBlock(scope: !820, file: !3, line: 96, column: 5)
!824 = !{!825, !825, i64 0}
!825 = !{!"any pointer", !826, i64 0}
!826 = !{!"omnipotent char", !827, i64 0}
!827 = !{!"Simple C/C++ TBAA"}
!828 = !DILocation(line: 99, column: 7, scope: !829)
!829 = distinct !DILexicalBlock(scope: !820, file: !3, line: 98, column: 5)
!830 = !DILocation(line: 100, column: 7, scope: !829)
!831 = !DILocation(line: 108, column: 7, scope: !829)
!832 = !DILocation(line: 109, column: 7, scope: !829)
!833 = !DILocation(line: 110, column: 7, scope: !829)
!834 = !DILocalVariable(name: "program", arg: 1, scope: !835, file: !836, line: 634, type: !79)
!835 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !836, file: !836, line: 634, type: !837, scopeLine: 635, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !839)
!836 = !DIFile(filename: "src/system.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!837 = !DISubroutineType(types: !838)
!838 = !{null, !79}
!839 = !{!834, !840, !849, !850, !852}
!840 = !DILocalVariable(name: "infomap", scope: !835, file: !836, line: 636, type: !841)
!841 = !DICompositeType(tag: DW_TAG_array_type, baseType: !842, size: 896, elements: !847)
!842 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !843)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !835, file: !836, line: 636, size: 128, elements: !844)
!844 = !{!845, !846}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !843, file: !836, line: 636, baseType: !79, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !843, file: !836, line: 636, baseType: !79, size: 64, offset: 64)
!847 = !{!848}
!848 = !DISubrange(count: 7)
!849 = !DILocalVariable(name: "node", scope: !835, file: !836, line: 646, type: !79)
!850 = !DILocalVariable(name: "map_prog", scope: !835, file: !836, line: 647, type: !851)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!852 = !DILocalVariable(name: "lc_messages", scope: !835, file: !836, line: 659, type: !79)
!853 = !DILocation(scope: !835, inlinedAt: !854)
!854 = distinct !DILocation(line: 116, column: 7, scope: !829)
!855 = !DILocation(line: 636, column: 3, scope: !835, inlinedAt: !854)
!856 = !DILocation(line: 636, column: 67, scope: !835, inlinedAt: !854)
!857 = !DILocation(line: 647, column: 36, scope: !835, inlinedAt: !854)
!858 = !DILocation(line: 649, column: 3, scope: !835, inlinedAt: !854)
!859 = !DILocation(line: 649, column: 33, scope: !835, inlinedAt: !854)
!860 = !DILocation(line: 650, column: 13, scope: !835, inlinedAt: !854)
!861 = !DILocation(line: 649, column: 20, scope: !835, inlinedAt: !854)
!862 = !{!863, !825, i64 0}
!863 = !{!"infomap", !825, i64 0, !825, i64 8}
!864 = !DILocation(line: 649, column: 10, scope: !835, inlinedAt: !854)
!865 = !DILocation(line: 649, column: 28, scope: !835, inlinedAt: !854)
!866 = distinct !{!866, !858, !860, !867}
!867 = !{!"llvm.loop.mustprogress"}
!868 = !DILocation(line: 652, column: 17, scope: !869, inlinedAt: !854)
!869 = distinct !DILexicalBlock(scope: !835, file: !836, line: 652, column: 7)
!870 = !{!863, !825, i64 8}
!871 = !DILocation(line: 652, column: 7, scope: !869, inlinedAt: !854)
!872 = !DILocation(line: 652, column: 7, scope: !835, inlinedAt: !854)
!873 = !DILocation(line: 655, column: 3, scope: !835, inlinedAt: !854)
!874 = !DILocation(line: 659, column: 29, scope: !835, inlinedAt: !854)
!875 = !DILocation(line: 660, column: 7, scope: !876, inlinedAt: !854)
!876 = distinct !DILexicalBlock(scope: !835, file: !836, line: 660, column: 7)
!877 = !DILocation(line: 660, column: 19, scope: !876, inlinedAt: !854)
!878 = !DILocation(line: 660, column: 22, scope: !876, inlinedAt: !854)
!879 = !DILocation(line: 660, column: 7, scope: !835, inlinedAt: !854)
!880 = !DILocation(line: 666, column: 7, scope: !881, inlinedAt: !854)
!881 = distinct !DILexicalBlock(scope: !876, file: !836, line: 661, column: 5)
!882 = !DILocation(line: 668, column: 5, scope: !881, inlinedAt: !854)
!883 = !DILocation(line: 669, column: 3, scope: !835, inlinedAt: !854)
!884 = !DILocation(line: 671, column: 3, scope: !835, inlinedAt: !854)
!885 = !DILocation(line: 673, column: 1, scope: !835, inlinedAt: !854)
!886 = !DILocation(line: 119, column: 3, scope: !813)
!887 = !DISubprogram(name: "dcgettext", scope: !888, file: !888, line: 51, type: !889, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !276)
!888 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!889 = !DISubroutineType(types: !890)
!890 = !{!25, !79, !79, !23}
!891 = !DISubprogram(name: "fputs_unlocked", scope: !892, file: !892, line: 667, type: !893, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !276)
!892 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!893 = !DISubroutineType(types: !894)
!894 = !{!23, !79, !41}
!895 = !DISubprogram(name: "setlocale", scope: !896, file: !896, line: 122, type: !897, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !276)
!896 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!897 = !DISubroutineType(types: !898)
!898 = !{!25, !23, !79}
!899 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 396, type: !900, scopeLine: 397, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !903)
!900 = !DISubroutineType(types: !901)
!901 = !{!23, !23, !902}
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!903 = !{!904, !905, !906, !907, !908, !909, !910, !913, !917, !919, !920, !922, !923, !924, !925, !927, !928}
!904 = !DILocalVariable(name: "argc", arg: 1, scope: !899, file: !3, line: 396, type: !23)
!905 = !DILocalVariable(name: "argv", arg: 2, scope: !899, file: !3, line: 396, type: !902)
!906 = !DILocalVariable(name: "ok", scope: !899, file: !3, line: 398, type: !15)
!907 = !DILocalVariable(name: "optc", scope: !899, file: !3, line: 399, type: !23)
!908 = !DILocalVariable(name: "syntax", scope: !899, file: !3, line: 400, type: !5)
!909 = !DILocalVariable(name: "print_database", scope: !899, file: !3, line: 401, type: !15)
!910 = !DILocalVariable(name: "p", scope: !911, file: !3, line: 459, type: !79)
!911 = distinct !DILexicalBlock(scope: !912, file: !3, line: 458, column: 5)
!912 = distinct !DILexicalBlock(scope: !899, file: !3, line: 457, column: 7)
!913 = !DILocalVariable(name: "len", scope: !914, file: !3, line: 487, type: !71)
!914 = distinct !DILexicalBlock(scope: !915, file: !3, line: 486, column: 9)
!915 = distinct !DILexicalBlock(scope: !916, file: !3, line: 485, column: 11)
!916 = distinct !DILexicalBlock(scope: !912, file: !3, line: 467, column: 5)
!917 = !DILocalVariable(name: "__o", scope: !918, file: !3, line: 487, type: !157)
!918 = distinct !DILexicalBlock(scope: !914, file: !3, line: 487, column: 24)
!919 = !DILocalVariable(name: "s", scope: !914, file: !3, line: 488, type: !25)
!920 = !DILocalVariable(name: "__o1", scope: !921, file: !3, line: 488, type: !104)
!921 = distinct !DILexicalBlock(scope: !914, file: !3, line: 488, column: 21)
!922 = !DILocalVariable(name: "__value", scope: !921, file: !3, line: 488, type: !69)
!923 = !DILocalVariable(name: "prefix", scope: !914, file: !3, line: 489, type: !79)
!924 = !DILocalVariable(name: "suffix", scope: !914, file: !3, line: 490, type: !79)
!925 = !DILocalVariable(name: "__ptr", scope: !926, file: !3, line: 503, type: !79)
!926 = distinct !DILexicalBlock(scope: !914, file: !3, line: 503, column: 11)
!927 = !DILocalVariable(name: "__stream", scope: !926, file: !3, line: 503, type: !16)
!928 = !DILocalVariable(name: "__cnt", scope: !926, file: !3, line: 503, type: !71)
!929 = !DILocation(scope: !899)
!930 = !DILocation(line: 404, column: 21, scope: !899)
!931 = !DILocation(line: 404, column: 3, scope: !899)
!932 = !DILocation(line: 405, column: 3, scope: !899)
!933 = !DILocation(line: 406, column: 3, scope: !899)
!934 = !DILocation(line: 407, column: 3, scope: !899)
!935 = !DILocation(line: 409, column: 3, scope: !899)
!936 = !DILocation(line: 411, column: 3, scope: !899)
!937 = !DILocation(line: 400, column: 21, scope: !899)
!938 = !DILocation(line: 411, column: 18, scope: !899)
!939 = distinct !{!939, !936, !940, !867}
!940 = !DILocation(line: 432, column: 7, scope: !899)
!941 = !DILocation(line: 420, column: 9, scope: !942)
!942 = distinct !DILexicalBlock(scope: !899, file: !3, line: 413, column: 7)
!943 = !DILocation(line: 426, column: 7, scope: !942)
!944 = !DILocation(line: 428, column: 7, scope: !942)
!945 = !DILocation(line: 431, column: 9, scope: !942)
!946 = !DILocation(line: 434, column: 11, scope: !899)
!947 = !{!948, !948, i64 0}
!948 = !{!"int", !826, i64 0}
!949 = !DILocation(line: 434, column: 8, scope: !899)
!950 = !DILocation(line: 435, column: 8, scope: !899)
!951 = !DILocation(line: 439, column: 22, scope: !952)
!952 = distinct !DILexicalBlock(scope: !899, file: !3, line: 439, column: 7)
!953 = !DILocation(line: 442, column: 14, scope: !954)
!954 = distinct !DILexicalBlock(scope: !952, file: !3, line: 440, column: 5)
!955 = !DILocation(line: 441, column: 7, scope: !954)
!956 = !DILocation(line: 444, column: 7, scope: !954)
!957 = !DILocation(line: 447, column: 8, scope: !958)
!958 = distinct !DILexicalBlock(scope: !899, file: !3, line: 447, column: 7)
!959 = !DILocation(line: 447, column: 25, scope: !958)
!960 = !DILocation(line: 447, column: 7, scope: !899)
!961 = !DILocation(line: 449, column: 20, scope: !962)
!962 = distinct !DILexicalBlock(scope: !958, file: !3, line: 448, column: 5)
!963 = !DILocation(line: 449, column: 50, scope: !962)
!964 = !DILocation(line: 449, column: 43, scope: !962)
!965 = !DILocation(line: 449, column: 7, scope: !962)
!966 = !DILocation(line: 450, column: 11, scope: !962)
!967 = !DILocation(line: 451, column: 9, scope: !968)
!968 = distinct !DILexicalBlock(scope: !962, file: !3, line: 450, column: 11)
!969 = !DILocation(line: 454, column: 7, scope: !962)
!970 = !DILocation(line: 457, column: 7, scope: !899)
!971 = !DILocation(scope: !911)
!972 = !DILocation(line: 462, column: 11, scope: !973)
!973 = distinct !DILexicalBlock(scope: !911, file: !3, line: 461, column: 9)
!974 = !DILocation(line: 463, column: 16, scope: !973)
!975 = !DILocation(line: 463, column: 27, scope: !973)
!976 = !DILocation(line: 463, column: 13, scope: !973)
!977 = !DILocation(line: 460, column: 16, scope: !911)
!978 = !DILocation(line: 460, column: 25, scope: !911)
!979 = !DILocation(line: 460, column: 7, scope: !911)
!980 = distinct !{!980, !979, !981, !867}
!981 = !DILocation(line: 464, column: 9, scope: !911)
!982 = !DILocation(line: 469, column: 18, scope: !983)
!983 = distinct !DILexicalBlock(scope: !916, file: !3, line: 469, column: 11)
!984 = !DILocation(line: 469, column: 11, scope: !916)
!985 = !DILocation(line: 130, column: 11, scope: !986, inlinedAt: !991)
!986 = distinct !DISubprogram(name: "guess_shell_syntax", scope: !3, file: !3, line: 126, type: !987, scopeLine: 127, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !989)
!987 = !DISubroutineType(types: !988)
!988 = !{!5}
!989 = !{!990}
!990 = !DILocalVariable(name: "shell", scope: !986, file: !3, line: 128, type: !25)
!991 = distinct !DILocation(line: 471, column: 20, scope: !992)
!992 = distinct !DILexicalBlock(scope: !983, file: !3, line: 470, column: 9)
!993 = !DILocation(scope: !986, inlinedAt: !991)
!994 = !DILocation(line: 131, column: 13, scope: !995, inlinedAt: !991)
!995 = distinct !DILexicalBlock(scope: !986, file: !3, line: 131, column: 7)
!996 = !DILocation(line: 131, column: 21, scope: !995, inlinedAt: !991)
!997 = !DILocation(line: 131, column: 24, scope: !995, inlinedAt: !991)
!998 = !{!826, !826, i64 0}
!999 = !DILocation(line: 131, column: 31, scope: !995, inlinedAt: !991)
!1000 = !DILocation(line: 131, column: 7, scope: !986, inlinedAt: !991)
!1001 = !DILocation(line: 134, column: 11, scope: !986, inlinedAt: !991)
!1002 = !DILocation(line: 136, column: 7, scope: !1003, inlinedAt: !991)
!1003 = distinct !DILexicalBlock(scope: !986, file: !3, line: 136, column: 7)
!1004 = !DILocation(line: 136, column: 28, scope: !1003, inlinedAt: !991)
!1005 = !DILocation(line: 136, column: 31, scope: !1003, inlinedAt: !991)
!1006 = !DILocation(line: 136, column: 7, scope: !986, inlinedAt: !991)
!1007 = !DILocation(line: 474, column: 15, scope: !1008)
!1008 = distinct !DILexicalBlock(scope: !1009, file: !3, line: 473, column: 13)
!1009 = distinct !DILexicalBlock(scope: !992, file: !3, line: 472, column: 15)
!1010 = !DILocation(line: 479, column: 7, scope: !916)
!1011 = !DILocation(line: 480, column: 16, scope: !1012)
!1012 = distinct !DILexicalBlock(scope: !916, file: !3, line: 480, column: 11)
!1013 = !DILocation(line: 480, column: 11, scope: !916)
!1014 = !DILocation(line: 481, column: 14, scope: !1012)
!1015 = !DILocation(line: 485, column: 11, scope: !916)
!1016 = !DILocation(line: 483, column: 29, scope: !1012)
!1017 = !DILocalVariable(name: "filename", arg: 1, scope: !1018, file: !3, line: 374, type: !79)
!1018 = distinct !DISubprogram(name: "dc_parse_file", scope: !3, file: !3, line: 374, type: !1019, scopeLine: 375, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1021)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!15, !79}
!1021 = !{!1017, !1022}
!1022 = !DILocalVariable(name: "ok", scope: !1018, file: !3, line: 376, type: !15)
!1023 = !DILocation(scope: !1018, inlinedAt: !1024)
!1024 = distinct !DILocation(line: 483, column: 14, scope: !1012)
!1025 = !DILocation(line: 378, column: 9, scope: !1026, inlinedAt: !1024)
!1026 = distinct !DILexicalBlock(scope: !1018, file: !3, line: 378, column: 7)
!1027 = !DILocation(line: 378, column: 31, scope: !1026, inlinedAt: !1024)
!1028 = !DILocation(line: 378, column: 58, scope: !1026, inlinedAt: !1024)
!1029 = !DILocation(line: 378, column: 34, scope: !1026, inlinedAt: !1024)
!1030 = !DILocation(line: 378, column: 65, scope: !1026, inlinedAt: !1024)
!1031 = !DILocation(line: 378, column: 7, scope: !1018, inlinedAt: !1024)
!1032 = !DILocation(line: 380, column: 17, scope: !1033, inlinedAt: !1024)
!1033 = distinct !DILexicalBlock(scope: !1026, file: !3, line: 379, column: 5)
!1034 = !DILocation(line: 380, column: 30, scope: !1033, inlinedAt: !1024)
!1035 = !DILocation(line: 380, column: 7, scope: !1033, inlinedAt: !1024)
!1036 = !DILocation(line: 381, column: 7, scope: !1033, inlinedAt: !1024)
!1037 = !DILocation(line: 384, column: 25, scope: !1018, inlinedAt: !1024)
!1038 = !DILocation(line: 384, column: 8, scope: !1018, inlinedAt: !1024)
!1039 = !DILocation(line: 386, column: 15, scope: !1040, inlinedAt: !1024)
!1040 = distinct !DILexicalBlock(scope: !1018, file: !3, line: 386, column: 7)
!1041 = !DILocation(line: 386, column: 7, scope: !1040, inlinedAt: !1024)
!1042 = !DILocation(line: 386, column: 22, scope: !1040, inlinedAt: !1024)
!1043 = !DILocation(line: 386, column: 7, scope: !1018, inlinedAt: !1024)
!1044 = !DILocation(line: 388, column: 17, scope: !1045, inlinedAt: !1024)
!1045 = distinct !DILexicalBlock(scope: !1040, file: !3, line: 387, column: 5)
!1046 = !DILocation(line: 388, column: 30, scope: !1045, inlinedAt: !1024)
!1047 = !DILocation(line: 388, column: 7, scope: !1045, inlinedAt: !1024)
!1048 = !DILocation(line: 389, column: 7, scope: !1045, inlinedAt: !1024)
!1049 = !DILocation(scope: !918)
!1050 = !DILocation(line: 487, column: 24, scope: !918)
!1051 = !{!1052, !825, i64 24}
!1052 = !{!"obstack", !1053, i64 0, !825, i64 8, !825, i64 16, !825, i64 24, !825, i64 32, !826, i64 40, !1053, i64 48, !826, i64 56, !826, i64 64, !825, i64 72, !948, i64 80, !948, i64 80, !948, i64 80}
!1053 = !{!"long", !826, i64 0}
!1054 = !{!1052, !825, i64 16}
!1055 = !DILocation(scope: !914)
!1056 = !DILocation(scope: !921)
!1057 = !DILocation(line: 488, column: 21, scope: !1058)
!1058 = distinct !DILexicalBlock(scope: !921, file: !3, line: 488, column: 21)
!1059 = !DILocation(line: 488, column: 21, scope: !921)
!1060 = !{!1052, !1053, i64 48}
!1061 = !DILocation(line: 488, column: 21, scope: !1062)
!1062 = distinct !DILexicalBlock(scope: !921, file: !3, line: 488, column: 21)
!1063 = !{!1052, !825, i64 8}
!1064 = !{!1052, !825, i64 32}
!1065 = !DILocation(line: 492, column: 22, scope: !1066)
!1066 = distinct !DILexicalBlock(scope: !914, file: !3, line: 492, column: 15)
!1067 = !DILocation(line: 492, column: 15, scope: !914)
!1068 = !DILocation(line: 502, column: 11, scope: !914)
!1069 = !DILocation(line: 503, column: 11, scope: !914)
!1070 = !DILocation(line: 504, column: 11, scope: !914)
!1071 = !DILocation(line: 505, column: 9, scope: !914)
!1072 = !DILocation(line: 509, column: 1, scope: !899)
!1073 = !DISubprogram(name: "bindtextdomain", scope: !888, file: !888, line: 86, type: !1074, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !276)
!1074 = !DISubroutineType(types: !1075)
!1075 = !{!25, !79, !79}
!1076 = !DISubprogram(name: "textdomain", scope: !888, file: !888, line: 82, type: !1077, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !276)
!1077 = !DISubroutineType(types: !1078)
!1078 = !{!25, !79}
!1079 = !DISubprogram(name: "atexit", scope: !1080, file: !1080, line: 595, type: !1081, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !276)
!1080 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!1081 = !DISubroutineType(types: !1082)
!1082 = !{!23, !360}
!1083 = !DISubprogram(name: "getopt_long", scope: !263, file: !263, line: 66, type: !1084, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !276)
!1084 = !DISubroutineType(types: !1085)
!1085 = !{!23, !23, !1086, !79, !1088, !268}
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64)
!1087 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!1089 = !DISubprogram(name: "error", scope: !1090, file: !1090, line: 52, type: !1091, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !276)
!1090 = !DIFile(filename: "./lib/error.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1091 = !DISubroutineType(types: !1092)
!1092 = !{null, !23, !23, !79, null}
!1093 = !DISubprogram(name: "puts", scope: !892, file: !892, line: 637, type: !1094, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !276)
!1094 = !DISubroutineType(types: !1095)
!1095 = !{!23, !79}
!1096 = !DISubprogram(name: "getenv", scope: !1080, file: !1080, line: 634, type: !1077, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !276)
!1097 = !DILocation(scope: !12)
!1098 = !DILocation(line: 243, column: 3, scope: !12)
!1099 = !DILocation(line: 243, column: 9, scope: !12)
!1100 = !DILocation(line: 244, column: 3, scope: !12)
!1101 = !DILocation(line: 244, column: 10, scope: !12)
!1102 = !{!1053, !1053, i64 0}
!1103 = !DILocation(line: 253, column: 10, scope: !12)
!1104 = !DILocation(line: 254, column: 12, scope: !1105)
!1105 = distinct !DILexicalBlock(scope: !12, file: !3, line: 254, column: 7)
!1106 = !DILocation(line: 254, column: 20, scope: !1105)
!1107 = !DILocation(line: 254, column: 23, scope: !1105)
!1108 = !DILocation(line: 254, column: 29, scope: !1105)
!1109 = !DILocation(line: 254, column: 7, scope: !12)
!1110 = !DILocation(line: 255, column: 5, scope: !1105)
!1111 = !DILocation(line: 257, column: 3, scope: !12)
!1112 = !DILocation(line: 264, column: 11, scope: !93)
!1113 = !DILocation(line: 242, column: 15, scope: !12)
!1114 = !DILocation(line: 262, column: 7, scope: !93)
!1115 = !DILocalVariable(name: "__lineptr", arg: 1, scope: !1116, file: !1117, line: 118, type: !902)
!1116 = distinct !DISubprogram(name: "getline", scope: !1117, file: !1117, line: 118, type: !1118, scopeLine: 119, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1121)
!1117 = !DIFile(filename: "/usr/include/bits/stdio.h", directory: "")
!1118 = !DISubroutineType(types: !1119)
!1119 = !{!1120, !902, !388, !16}
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !46, line: 194, baseType: !47)
!1121 = !{!1115, !1122, !1123}
!1122 = !DILocalVariable(name: "__n", arg: 2, scope: !1116, file: !1117, line: 118, type: !388)
!1123 = !DILocalVariable(name: "__stream", arg: 3, scope: !1116, file: !1117, line: 118, type: !16)
!1124 = !DILocation(scope: !1116, inlinedAt: !1125)
!1125 = distinct !DILocation(line: 266, column: 15, scope: !1126)
!1126 = distinct !DILexicalBlock(scope: !1127, file: !3, line: 266, column: 15)
!1127 = distinct !DILexicalBlock(scope: !1128, file: !3, line: 265, column: 9)
!1128 = distinct !DILexicalBlock(scope: !93, file: !3, line: 264, column: 11)
!1129 = !DILocation(line: 120, column: 10, scope: !1116, inlinedAt: !1125)
!1130 = !DILocation(line: 266, column: 59, scope: !1126)
!1131 = !DILocation(scope: !1127)
!1132 = !DILocation(line: 266, column: 15, scope: !1127)
!1133 = !DILocation(line: 268, column: 15, scope: !1134)
!1134 = distinct !DILexicalBlock(scope: !1126, file: !3, line: 267, column: 13)
!1135 = !DILocation(line: 269, column: 15, scope: !1134)
!1136 = !DILocation(line: 275, column: 27, scope: !1137)
!1137 = distinct !DILexicalBlock(scope: !1138, file: !3, line: 275, column: 15)
!1138 = distinct !DILexicalBlock(scope: !1128, file: !3, line: 274, column: 9)
!1139 = !DILocation(line: 275, column: 15, scope: !1138)
!1140 = !DILocation(line: 278, column: 26, scope: !1138)
!1141 = !DILocation(line: 278, column: 47, scope: !1138)
!1142 = !DILocation(line: 278, column: 23, scope: !1138)
!1143 = !DILocation(scope: !1128)
!1144 = !DILocalVariable(name: "line", arg: 1, scope: !1145, file: !3, line: 143, type: !79)
!1145 = distinct !DISubprogram(name: "parse_line", scope: !3, file: !3, line: 143, type: !1146, scopeLine: 144, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1148)
!1146 = !DISubroutineType(types: !1147)
!1147 = !{null, !79, !902, !902}
!1148 = !{!1144, !1149, !1150, !1151, !1152, !1153}
!1149 = !DILocalVariable(name: "keyword", arg: 2, scope: !1145, file: !3, line: 143, type: !902)
!1150 = !DILocalVariable(name: "arg", arg: 3, scope: !1145, file: !3, line: 143, type: !902)
!1151 = !DILocalVariable(name: "p", scope: !1145, file: !3, line: 145, type: !79)
!1152 = !DILocalVariable(name: "keyword_start", scope: !1145, file: !3, line: 146, type: !79)
!1153 = !DILocalVariable(name: "arg_start", scope: !1145, file: !3, line: 147, type: !79)
!1154 = !DILocation(scope: !1145, inlinedAt: !1155)
!1155 = distinct !DILocation(line: 281, column: 7, scope: !93)
!1156 = !DILocation(line: 152, column: 8, scope: !1157, inlinedAt: !1155)
!1157 = distinct !DILexicalBlock(scope: !1145, file: !3, line: 152, column: 3)
!1158 = !DILocation(scope: !1157, inlinedAt: !1155)
!1159 = !DILocation(line: 152, column: 18, scope: !1160, inlinedAt: !1155)
!1160 = distinct !DILexicalBlock(scope: !1157, file: !3, line: 152, column: 3)
!1161 = !{!1162, !1162, i64 0}
!1162 = !{!"short", !826, i64 0}
!1163 = !DILocation(line: 152, column: 3, scope: !1157, inlinedAt: !1155)
!1164 = !DILocation(line: 152, column: 43, scope: !1160, inlinedAt: !1155)
!1165 = distinct !{!1165, !1163, !1166, !867}
!1166 = !DILocation(line: 153, column: 5, scope: !1157, inlinedAt: !1155)
!1167 = !DILocation(line: 156, column: 18, scope: !1168, inlinedAt: !1155)
!1168 = distinct !DILexicalBlock(scope: !1145, file: !3, line: 156, column: 7)
!1169 = distinct !{!1169, !1111, !1170}
!1170 = !DILocation(line: 368, column: 5, scope: !12)
!1171 = !DILocation(line: 163, column: 7, scope: !1172, inlinedAt: !1155)
!1172 = distinct !DILexicalBlock(scope: !1145, file: !3, line: 162, column: 5)
!1173 = !DILocation(line: 161, column: 11, scope: !1145, inlinedAt: !1155)
!1174 = !DILocation(line: 161, column: 35, scope: !1145, inlinedAt: !1155)
!1175 = distinct !{!1175, !1176, !1177, !867}
!1176 = !DILocation(line: 161, column: 3, scope: !1145, inlinedAt: !1155)
!1177 = !DILocation(line: 164, column: 5, scope: !1145, inlinedAt: !1155)
!1178 = !DILocation(line: 166, column: 41, scope: !1145, inlinedAt: !1155)
!1179 = !DILocation(line: 166, column: 14, scope: !1145, inlinedAt: !1155)
!1180 = !DILocation(line: 167, column: 7, scope: !1181, inlinedAt: !1155)
!1181 = distinct !DILexicalBlock(scope: !1145, file: !3, line: 167, column: 7)
!1182 = !DILocation(line: 167, column: 11, scope: !1181, inlinedAt: !1155)
!1183 = !DILocation(line: 167, column: 7, scope: !1145, inlinedAt: !1155)
!1184 = !DILocation(line: 170, column: 3, scope: !1145, inlinedAt: !1155)
