source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [28 x i8] c"Usage: %s [OPTION] NAME...\0A\00", align 1
@.str.2 = private unnamed_addr constant [152 x i8] c"Output each NAME with its last non-slash component and trailing slashes\0Aremoved; if NAME contains no /'s, output '.' (meaning the current directory).\0A\0A\00", align 1
@stdout = external local_unnamed_addr global %struct._IO_FILE*, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 35, type: !156, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !130, nameTableKind: None)
!3 = !DIFile(filename: "src/dirname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{}
!5 = !{!6, !15, !76, !80, !84, !87, !90, !97, !10, !66, !112, !116, !120, !68, !12, !124, !129}
!6 = !DISubprogram(name: "dcgettext", scope: !7, file: !7, line: 51, type: !8, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!7 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!8 = !DISubroutineType(types: !9)
!9 = !{!10, !12, !12, !14}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!14 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!15 = !DISubprogram(name: "fputs_unlocked", scope: !16, file: !16, line: 662, type: !17, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!16 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!17 = !DISubroutineType(types: !18)
!18 = !{!14, !12, !19}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !22)
!21 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!22 = !{!23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !38, !39, !40, !41, !45, !47, !49, !53, !56, !58, !61, !64, !65, !67, !71, !72}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !20, file: !21, line: 51, baseType: !14, size: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !20, file: !21, line: 54, baseType: !10, size: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !20, file: !21, line: 55, baseType: !10, size: 64, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !20, file: !21, line: 56, baseType: !10, size: 64, offset: 192)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !20, file: !21, line: 57, baseType: !10, size: 64, offset: 256)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !20, file: !21, line: 58, baseType: !10, size: 64, offset: 320)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !20, file: !21, line: 59, baseType: !10, size: 64, offset: 384)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !20, file: !21, line: 60, baseType: !10, size: 64, offset: 448)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !20, file: !21, line: 61, baseType: !10, size: 64, offset: 512)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !20, file: !21, line: 64, baseType: !10, size: 64, offset: 576)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !20, file: !21, line: 65, baseType: !10, size: 64, offset: 640)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !20, file: !21, line: 66, baseType: !10, size: 64, offset: 704)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !20, file: !21, line: 68, baseType: !36, size: 64, offset: 768)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !21, line: 36, flags: DIFlagFwdDecl)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !20, file: !21, line: 70, baseType: !19, size: 64, offset: 832)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !20, file: !21, line: 72, baseType: !14, size: 32, offset: 896)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !20, file: !21, line: 73, baseType: !14, size: 32, offset: 928)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !20, file: !21, line: 74, baseType: !42, size: 64, offset: 960)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !43, line: 152, baseType: !44)
!43 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!44 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !20, file: !21, line: 77, baseType: !46, size: 16, offset: 1024)
!46 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !20, file: !21, line: 78, baseType: !48, size: 8, offset: 1040)
!48 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !20, file: !21, line: 79, baseType: !50, size: 8, offset: 1048)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 8, elements: !51)
!51 = !{!52}
!52 = !DISubrange(count: 1)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !20, file: !21, line: 81, baseType: !54, size: 64, offset: 1088)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !21, line: 43, baseType: null)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !20, file: !21, line: 89, baseType: !57, size: 64, offset: 1152)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !43, line: 153, baseType: !44)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !20, file: !21, line: 91, baseType: !59, size: 64, offset: 1216)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !21, line: 37, flags: DIFlagFwdDecl)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !20, file: !21, line: 92, baseType: !62, size: 64, offset: 1280)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !21, line: 38, flags: DIFlagFwdDecl)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !20, file: !21, line: 93, baseType: !19, size: 64, offset: 1344)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !20, file: !21, line: 94, baseType: !66, size: 64, offset: 1408)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !20, file: !21, line: 95, baseType: !68, size: 64, offset: 1472)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !69, line: 46, baseType: !70)
!69 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!70 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !20, file: !21, line: 96, baseType: !14, size: 32, offset: 1536)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !20, file: !21, line: 98, baseType: !73, size: 160, offset: 1568)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 160, elements: !74)
!74 = !{!75}
!75 = !DISubrange(count: 20)
!76 = !DISubprogram(name: "set_program_name", scope: !77, file: !77, line: 37, type: !78, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!77 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!78 = !DISubroutineType(types: !79)
!79 = !{null, !12}
!80 = !DISubprogram(name: "setlocale", scope: !81, file: !81, line: 122, type: !82, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!81 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!82 = !DISubroutineType(types: !83)
!83 = !{!10, !14, !12}
!84 = !DISubprogram(name: "bindtextdomain", scope: !7, file: !7, line: 86, type: !85, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!85 = !DISubroutineType(types: !86)
!86 = !{!10, !12, !12}
!87 = !DISubprogram(name: "textdomain", scope: !7, file: !7, line: 82, type: !88, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!88 = !DISubroutineType(types: !89)
!89 = !{!10, !12}
!90 = !DISubprogram(name: "atexit", scope: !91, file: !91, line: 595, type: !92, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!91 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!92 = !DISubroutineType(types: !93)
!93 = !{!14, !94}
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DISubroutineType(types: !96)
!96 = !{null}
!97 = !DISubprogram(name: "getopt_long", scope: !98, file: !98, line: 66, type: !99, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!98 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!99 = !DISubroutineType(types: !100)
!100 = !{!14, !14, !101, !12, !103, !110}
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !105)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !98, line: 50, size: 256, elements: !106)
!106 = !{!107, !108, !109, !111}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !105, file: !98, line: 52, baseType: !12, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !105, file: !98, line: 55, baseType: !14, size: 32, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !105, file: !98, line: 56, baseType: !110, size: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !105, file: !98, line: 57, baseType: !14, size: 32, offset: 192)
!112 = !DISubprogram(name: "version_etc", scope: !113, file: !113, line: 69, type: !114, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!113 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!114 = !DISubroutineType(types: !115)
!115 = !{null, !19, !12, !12, !12, null}
!116 = !DISubprogram(name: "error", scope: !117, file: !117, line: 52, type: !118, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!117 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!118 = !DISubroutineType(types: !119)
!119 = !{null, !14, !14, !12, null}
!120 = !DISubprogram(name: "dir_len", scope: !121, file: !121, line: 45, type: !122, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!121 = !DIFile(filename: "./lib/dirname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!122 = !DISubroutineType(types: !123)
!123 = !{!70, !12}
!124 = !DISubprogram(name: "fwrite_unlocked", scope: !16, file: !16, line: 675, type: !125, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!125 = !DISubroutineType(types: !126)
!126 = !{!70, !127, !70, !70, !19}
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!129 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!130 = !{!131, !0}
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "dot", scope: !133, file: !3, line: 80, type: !13, isLocal: true, isDefinition: true)
!133 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 78, type: !134, scopeLine: 79, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !137)
!134 = !DISubroutineType(types: !135)
!135 = !{!14, !14, !136}
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!137 = !{!138, !139, !140, !142, !143, !144, !146, !151, !155}
!138 = !DILocalVariable(name: "argc", arg: 1, scope: !133, file: !3, line: 78, type: !14)
!139 = !DILocalVariable(name: "argv", arg: 2, scope: !133, file: !3, line: 78, type: !136)
!140 = !DILocalVariable(name: "use_nuls", scope: !133, file: !3, line: 81, type: !141)
!141 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!142 = !DILocalVariable(name: "result", scope: !133, file: !3, line: 82, type: !12)
!143 = !DILocalVariable(name: "len", scope: !133, file: !3, line: 83, type: !68)
!144 = !DILocalVariable(name: "c", scope: !145, file: !3, line: 95, type: !14)
!145 = distinct !DILexicalBlock(scope: !133, file: !3, line: 94, column: 5)
!146 = !DILocalVariable(name: "__ptr", scope: !147, file: !3, line: 131, type: !12)
!147 = distinct !DILexicalBlock(scope: !148, file: !3, line: 131, column: 7)
!148 = distinct !DILexicalBlock(scope: !149, file: !3, line: 121, column: 5)
!149 = distinct !DILexicalBlock(scope: !150, file: !3, line: 120, column: 3)
!150 = distinct !DILexicalBlock(scope: !133, file: !3, line: 120, column: 3)
!151 = !DILocalVariable(name: "__stream", scope: !147, file: !3, line: 131, type: !152)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !154, line: 7, baseType: !20)
!154 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "")
!155 = !DILocalVariable(name: "__cnt", scope: !147, file: !3, line: 131, type: !68)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 1024, elements: !157)
!157 = !{!158}
!158 = !DISubrange(count: 4)
!159 = !DIGlobalVariableExpression(var: !160, expr: !DIExpression())
!160 = distinct !DIGlobalVariable(name: "Version", scope: !161, file: !162, line: 2, type: !12, isDefinition: true)
!161 = distinct !DICompileUnit(language: DW_LANG_C99, file: !162, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, globals: !163, nameTableKind: None)
!162 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!163 = !{!159}
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(name: "file_name", scope: !166, file: !167, line: 46, type: !12, isLocal: true, isDefinition: true)
!166 = distinct !DICompileUnit(language: DW_LANG_C99, file: !167, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !168, globals: !207, nameTableKind: None)
!167 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!168 = !{!169, !6, !205, !116}
!169 = !DISubprogram(name: "close_stream", scope: !170, file: !170, line: 2, type: !171, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!170 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!171 = !DISubroutineType(types: !172)
!172 = !{!14, !173}
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !175)
!175 = !{!176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !174, file: !21, line: 51, baseType: !14, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !174, file: !21, line: 54, baseType: !10, size: 64, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !174, file: !21, line: 55, baseType: !10, size: 64, offset: 128)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !174, file: !21, line: 56, baseType: !10, size: 64, offset: 192)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !174, file: !21, line: 57, baseType: !10, size: 64, offset: 256)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !174, file: !21, line: 58, baseType: !10, size: 64, offset: 320)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !174, file: !21, line: 59, baseType: !10, size: 64, offset: 384)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !174, file: !21, line: 60, baseType: !10, size: 64, offset: 448)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !174, file: !21, line: 61, baseType: !10, size: 64, offset: 512)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !174, file: !21, line: 64, baseType: !10, size: 64, offset: 576)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !174, file: !21, line: 65, baseType: !10, size: 64, offset: 640)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !174, file: !21, line: 66, baseType: !10, size: 64, offset: 704)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !174, file: !21, line: 68, baseType: !36, size: 64, offset: 768)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !174, file: !21, line: 70, baseType: !173, size: 64, offset: 832)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !174, file: !21, line: 72, baseType: !14, size: 32, offset: 896)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !174, file: !21, line: 73, baseType: !14, size: 32, offset: 928)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !174, file: !21, line: 74, baseType: !42, size: 64, offset: 960)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !174, file: !21, line: 77, baseType: !46, size: 16, offset: 1024)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !174, file: !21, line: 78, baseType: !48, size: 8, offset: 1040)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !174, file: !21, line: 79, baseType: !50, size: 8, offset: 1048)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !174, file: !21, line: 81, baseType: !54, size: 64, offset: 1088)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !174, file: !21, line: 89, baseType: !57, size: 64, offset: 1152)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !174, file: !21, line: 91, baseType: !59, size: 64, offset: 1216)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !174, file: !21, line: 92, baseType: !62, size: 64, offset: 1280)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !174, file: !21, line: 93, baseType: !173, size: 64, offset: 1344)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !174, file: !21, line: 94, baseType: !66, size: 64, offset: 1408)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !174, file: !21, line: 95, baseType: !68, size: 64, offset: 1472)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !174, file: !21, line: 96, baseType: !14, size: 32, offset: 1536)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !174, file: !21, line: 98, baseType: !73, size: 160, offset: 1568)
!205 = !DISubprogram(name: "quotearg_colon", scope: !206, file: !206, line: 391, type: !88, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!206 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!207 = !{!164, !208}
!208 = !DIGlobalVariableExpression(var: !209, expr: !DIExpression())
!209 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !166, file: !167, line: 56, type: !141, isLocal: true, isDefinition: true)
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(name: "exit_failure", scope: !212, file: !213, line: 24, type: !215, isDefinition: true)
!212 = distinct !DICompileUnit(language: DW_LANG_C99, file: !213, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, globals: !214, nameTableKind: None)
!213 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!214 = !{!210}
!215 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !14)
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "program_name", scope: !218, file: !219, line: 33, type: !12, isDefinition: true)
!218 = distinct !DICompileUnit(language: DW_LANG_C99, file: !219, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !220, globals: !256, nameTableKind: None)
!219 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!220 = !{!66, !221, !10}
!221 = !DISubprogram(name: "fputs", scope: !16, file: !16, line: 626, type: !222, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!222 = !DISubroutineType(types: !223)
!223 = !{!14, !12, !224}
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !226)
!226 = !{!227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !225, file: !21, line: 51, baseType: !14, size: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !225, file: !21, line: 54, baseType: !10, size: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !225, file: !21, line: 55, baseType: !10, size: 64, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !225, file: !21, line: 56, baseType: !10, size: 64, offset: 192)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !225, file: !21, line: 57, baseType: !10, size: 64, offset: 256)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !225, file: !21, line: 58, baseType: !10, size: 64, offset: 320)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !225, file: !21, line: 59, baseType: !10, size: 64, offset: 384)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !225, file: !21, line: 60, baseType: !10, size: 64, offset: 448)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !225, file: !21, line: 61, baseType: !10, size: 64, offset: 512)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !225, file: !21, line: 64, baseType: !10, size: 64, offset: 576)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !225, file: !21, line: 65, baseType: !10, size: 64, offset: 640)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !225, file: !21, line: 66, baseType: !10, size: 64, offset: 704)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !225, file: !21, line: 68, baseType: !36, size: 64, offset: 768)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !225, file: !21, line: 70, baseType: !224, size: 64, offset: 832)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !225, file: !21, line: 72, baseType: !14, size: 32, offset: 896)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !225, file: !21, line: 73, baseType: !14, size: 32, offset: 928)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !225, file: !21, line: 74, baseType: !42, size: 64, offset: 960)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !225, file: !21, line: 77, baseType: !46, size: 16, offset: 1024)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !225, file: !21, line: 78, baseType: !48, size: 8, offset: 1040)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !225, file: !21, line: 79, baseType: !50, size: 8, offset: 1048)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !225, file: !21, line: 81, baseType: !54, size: 64, offset: 1088)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !225, file: !21, line: 89, baseType: !57, size: 64, offset: 1152)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !225, file: !21, line: 91, baseType: !59, size: 64, offset: 1216)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !225, file: !21, line: 92, baseType: !62, size: 64, offset: 1280)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !225, file: !21, line: 93, baseType: !224, size: 64, offset: 1344)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !225, file: !21, line: 94, baseType: !66, size: 64, offset: 1408)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !225, file: !21, line: 95, baseType: !68, size: 64, offset: 1472)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !225, file: !21, line: 96, baseType: !14, size: 32, offset: 1536)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !225, file: !21, line: 98, baseType: !73, size: 160, offset: 1568)
!256 = !{!216}
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !259, file: !260, line: 85, type: !390, isDefinition: true)
!259 = distinct !DICompileUnit(language: DW_LANG_C99, file: !260, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !261, retainedTypes: !296, globals: !363, nameTableKind: None)
!260 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!261 = !{!262, !276, !281}
!262 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !206, line: 32, baseType: !263, size: 32, elements: !264)
!263 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!264 = !{!265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275}
!265 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!266 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!267 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!268 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!269 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!270 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!271 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!272 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!273 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!274 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!275 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!276 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !206, line: 242, baseType: !263, size: 32, elements: !277)
!277 = !{!278, !279, !280}
!278 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!279 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!280 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!281 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !282, line: 46, baseType: !263, size: 32, elements: !283)
!282 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!283 = !{!284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295}
!284 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!285 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!286 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!287 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!288 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!289 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!290 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!291 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!292 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!293 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!294 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!295 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!296 = !{!297, !301, !317, !320, !14, !46, !323, !68, !338, !342, !6, !348, !352, !10, !356, !359, !360}
!297 = !DISubprogram(name: "xmemdup", scope: !298, file: !298, line: 62, type: !299, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!298 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!299 = !DISubroutineType(types: !300)
!300 = !{!66, !127, !70}
!301 = !DISubprogram(name: "quotearg_alloc_mem", scope: !206, file: !206, line: 342, type: !302, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!302 = !DISubroutineType(types: !303)
!303 = !{!10, !12, !70, !304, !305}
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !307)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !260, line: 65, size: 448, elements: !308)
!308 = !{!309, !310, !311, !315, !316}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !307, file: !260, line: 68, baseType: !262, size: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !307, file: !260, line: 71, baseType: !14, size: 32, offset: 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !307, file: !260, line: 75, baseType: !312, size: 256, offset: 64)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 256, elements: !313)
!313 = !{!314}
!314 = !DISubrange(count: 8)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !307, file: !260, line: 78, baseType: !12, size: 64, offset: 320)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !307, file: !260, line: 81, baseType: !12, size: 64, offset: 384)
!317 = !DISubprogram(name: "free", scope: !91, file: !91, line: 565, type: !318, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!318 = !DISubroutineType(types: !319)
!319 = !{null, !66}
!320 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !206, file: !206, line: 408, type: !321, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!321 = !DISubroutineType(types: !322)
!322 = !{!10, !14, !12, !12, !12, !70}
!323 = !DISubprogram(name: "rpl_mbrtowc", scope: !324, file: !324, line: 717, type: !325, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!324 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!325 = !DISubroutineType(types: !326)
!326 = !{!70, !110, !12, !70, !327}
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !329, line: 13, size: 64, elements: !330)
!329 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!330 = !{!331, !332}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !328, file: !329, line: 15, baseType: !14, size: 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !328, file: !329, line: 20, baseType: !333, size: 32, offset: 32)
!333 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !328, file: !329, line: 16, size: 32, elements: !334)
!334 = !{!335, !336}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !333, file: !329, line: 18, baseType: !263, size: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !333, file: !329, line: 19, baseType: !337, size: 32)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 32, elements: !157)
!338 = !DISubprogram(name: "iswprint", scope: !339, file: !339, line: 120, type: !340, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!339 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!340 = !DISubroutineType(types: !341)
!341 = !{!14, !263}
!342 = !DISubprogram(name: "mbsinit", scope: !343, file: !343, line: 292, type: !344, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!343 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!344 = !DISubroutineType(types: !345)
!345 = !{!14, !346}
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !328)
!348 = !DISubprogram(name: "locale_charset", scope: !349, file: !349, line: 35, type: !350, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!349 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!350 = !DISubroutineType(types: !351)
!351 = !{!12}
!352 = !DISubprogram(name: "c_strcasecmp", scope: !353, file: !353, line: 42, type: !354, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!353 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!354 = !DISubroutineType(types: !355)
!355 = !{!14, !12, !12}
!356 = !DISubprogram(name: "xmalloc", scope: !298, file: !298, line: 53, type: !357, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!357 = !DISubroutineType(types: !358)
!358 = !{!66, !70}
!359 = !DISubprogram(name: "xalloc_die", scope: !298, file: !298, line: 51, type: !95, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !4)
!360 = !DISubprogram(name: "xrealloc", scope: !298, file: !298, line: 59, type: !361, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!361 = !DISubroutineType(types: !362)
!362 = !{!66, !66, !70}
!363 = !{!257, !364, !370, !372, !374, !379, !386, !388}
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !259, file: !260, line: 101, type: !366, isDefinition: true)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 320, elements: !368)
!367 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !262)
!368 = !{!369}
!369 = !DISubrange(count: 10)
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !259, file: !260, line: 1052, type: !307, isDefinition: true)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !259, file: !260, line: 116, type: !307, isLocal: true, isDefinition: true)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(name: "slot0", scope: !259, file: !260, line: 842, type: !376, isLocal: true, isDefinition: true)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 2048, elements: !377)
!377 = !{!378}
!378 = !DISubrange(count: 256)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(name: "slotvec", scope: !259, file: !260, line: 845, type: !381, isLocal: true, isDefinition: true)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !260, line: 834, size: 128, elements: !383)
!383 = !{!384, !385}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !382, file: !260, line: 836, baseType: !68, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !382, file: !260, line: 837, baseType: !10, size: 64, offset: 64)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "nslots", scope: !259, file: !260, line: 843, type: !14, isLocal: true, isDefinition: true)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(name: "slotvec0", scope: !259, file: !260, line: 844, type: !382, isLocal: true, isDefinition: true)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !391, size: 704, elements: !392)
!391 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!392 = !{!393}
!393 = !DISubrange(count: 11)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !396, file: !397, line: 26, type: !399, isDefinition: true)
!396 = distinct !DICompileUnit(language: DW_LANG_C99, file: !397, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, globals: !398, nameTableKind: None)
!397 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!398 = !{!394}
!399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 376, elements: !400)
!400 = !{!401}
!401 = !DISubrange(count: 47)
!402 = distinct !DICompileUnit(language: DW_LANG_C99, file: !403, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !404, nameTableKind: None)
!403 = !DIFile(filename: "lib/dirname-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!404 = !{!405}
!405 = !DISubprogram(name: "last_component", scope: !121, file: !121, line: 46, type: !88, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!406 = distinct !DICompileUnit(language: DW_LANG_C99, file: !407, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !408, nameTableKind: None)
!407 = !DIFile(filename: "lib/basename-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!408 = !{!10}
!409 = distinct !DICompileUnit(language: DW_LANG_C99, file: !410, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !411, retainedTypes: !415, nameTableKind: None)
!410 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!411 = !{!412}
!412 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !410, line: 40, baseType: !263, size: 32, elements: !413)
!413 = !{!414}
!414 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!415 = !{!6, !416, !66}
!416 = !DISubprogram(name: "fputs_unlocked", scope: !16, file: !16, line: 662, type: !417, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!417 = !DISubroutineType(types: !418)
!418 = !{!14, !12, !419}
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !421)
!421 = !{!422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !420, file: !21, line: 51, baseType: !14, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !420, file: !21, line: 54, baseType: !10, size: 64, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !420, file: !21, line: 55, baseType: !10, size: 64, offset: 128)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !420, file: !21, line: 56, baseType: !10, size: 64, offset: 192)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !420, file: !21, line: 57, baseType: !10, size: 64, offset: 256)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !420, file: !21, line: 58, baseType: !10, size: 64, offset: 320)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !420, file: !21, line: 59, baseType: !10, size: 64, offset: 384)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !420, file: !21, line: 60, baseType: !10, size: 64, offset: 448)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !420, file: !21, line: 61, baseType: !10, size: 64, offset: 512)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !420, file: !21, line: 64, baseType: !10, size: 64, offset: 576)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !420, file: !21, line: 65, baseType: !10, size: 64, offset: 640)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !420, file: !21, line: 66, baseType: !10, size: 64, offset: 704)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !420, file: !21, line: 68, baseType: !36, size: 64, offset: 768)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !420, file: !21, line: 70, baseType: !419, size: 64, offset: 832)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !420, file: !21, line: 72, baseType: !14, size: 32, offset: 896)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !420, file: !21, line: 73, baseType: !14, size: 32, offset: 928)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !420, file: !21, line: 74, baseType: !42, size: 64, offset: 960)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !420, file: !21, line: 77, baseType: !46, size: 16, offset: 1024)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !420, file: !21, line: 78, baseType: !48, size: 8, offset: 1040)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !420, file: !21, line: 79, baseType: !50, size: 8, offset: 1048)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !420, file: !21, line: 81, baseType: !54, size: 64, offset: 1088)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !420, file: !21, line: 89, baseType: !57, size: 64, offset: 1152)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !420, file: !21, line: 91, baseType: !59, size: 64, offset: 1216)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !420, file: !21, line: 92, baseType: !62, size: 64, offset: 1280)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !420, file: !21, line: 93, baseType: !419, size: 64, offset: 1344)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !420, file: !21, line: 94, baseType: !66, size: 64, offset: 1408)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !420, file: !21, line: 95, baseType: !68, size: 64, offset: 1472)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !420, file: !21, line: 96, baseType: !14, size: 32, offset: 1536)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !420, file: !21, line: 98, baseType: !73, size: 160, offset: 1568)
!451 = distinct !DICompileUnit(language: DW_LANG_C99, file: !452, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !453, retainedTypes: !466, nameTableKind: None)
!452 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!453 = !{!454}
!454 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !455, file: !298, line: 186, baseType: !263, size: 32, elements: !464)
!455 = distinct !DISubprogram(name: "x2nrealloc", scope: !298, file: !298, line: 174, type: !456, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !451, retainedNodes: !459)
!456 = !DISubroutineType(types: !457)
!457 = !{!66, !66, !458, !68}
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!459 = !{!460, !461, !462, !463}
!460 = !DILocalVariable(name: "p", arg: 1, scope: !455, file: !298, line: 174, type: !66)
!461 = !DILocalVariable(name: "pn", arg: 2, scope: !455, file: !298, line: 174, type: !458)
!462 = !DILocalVariable(name: "s", arg: 3, scope: !455, file: !298, line: 174, type: !68)
!463 = !DILocalVariable(name: "n", scope: !455, file: !298, line: 176, type: !68)
!464 = !{!465}
!465 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!466 = !{!68, !359, !356, !360, !10, !317, !66, !467, !470}
!467 = !DISubprogram(name: "xcalloc", scope: !298, file: !298, line: 57, type: !468, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!468 = !DISubroutineType(types: !469)
!469 = !{!66, !70, !70}
!470 = !DISubprogram(name: "rpl_calloc", scope: !471, file: !471, line: 688, type: !468, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!471 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!472 = distinct !DICompileUnit(language: DW_LANG_C99, file: !473, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !474, nameTableKind: None)
!473 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!474 = !{!6, !116}
!475 = distinct !DICompileUnit(language: DW_LANG_C99, file: !476, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !477, nameTableKind: None)
!476 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!477 = !{!66}
!478 = distinct !DICompileUnit(language: DW_LANG_C99, file: !479, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !480, nameTableKind: None)
!479 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!480 = !{!481, !68, !493}
!481 = !DISubprogram(name: "mbrtowc", scope: !343, file: !343, line: 296, type: !482, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!482 = !DISubroutineType(types: !483)
!483 = !{!70, !110, !12, !70, !484}
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !329, line: 13, size: 64, elements: !486)
!486 = !{!487, !488}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !485, file: !329, line: 15, baseType: !14, size: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !485, file: !329, line: 20, baseType: !489, size: 32, offset: 32)
!489 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !485, file: !329, line: 16, size: 32, elements: !490)
!490 = !{!491, !492}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !489, file: !329, line: 18, baseType: !263, size: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !489, file: !329, line: 19, baseType: !337, size: 32)
!493 = !DISubprogram(name: "hard_locale", scope: !494, file: !494, line: 26, type: !495, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!494 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!495 = !DISubroutineType(types: !496)
!496 = !{!141, !14}
!497 = distinct !DICompileUnit(language: DW_LANG_C99, file: !498, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !499, nameTableKind: None)
!498 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!499 = !{!500}
!500 = !DISubprogram(name: "rpl_fclose", scope: !501, file: !501, line: 672, type: !502, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!501 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!502 = !DISubroutineType(types: !503)
!503 = !{!14, !504}
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !506)
!506 = !{!507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !505, file: !21, line: 51, baseType: !14, size: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !505, file: !21, line: 54, baseType: !10, size: 64, offset: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !505, file: !21, line: 55, baseType: !10, size: 64, offset: 128)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !505, file: !21, line: 56, baseType: !10, size: 64, offset: 192)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !505, file: !21, line: 57, baseType: !10, size: 64, offset: 256)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !505, file: !21, line: 58, baseType: !10, size: 64, offset: 320)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !505, file: !21, line: 59, baseType: !10, size: 64, offset: 384)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !505, file: !21, line: 60, baseType: !10, size: 64, offset: 448)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !505, file: !21, line: 61, baseType: !10, size: 64, offset: 512)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !505, file: !21, line: 64, baseType: !10, size: 64, offset: 576)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !505, file: !21, line: 65, baseType: !10, size: 64, offset: 640)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !505, file: !21, line: 66, baseType: !10, size: 64, offset: 704)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !505, file: !21, line: 68, baseType: !36, size: 64, offset: 768)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !505, file: !21, line: 70, baseType: !504, size: 64, offset: 832)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !505, file: !21, line: 72, baseType: !14, size: 32, offset: 896)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !505, file: !21, line: 73, baseType: !14, size: 32, offset: 928)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !505, file: !21, line: 74, baseType: !42, size: 64, offset: 960)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !505, file: !21, line: 77, baseType: !46, size: 16, offset: 1024)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !505, file: !21, line: 78, baseType: !48, size: 8, offset: 1040)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !505, file: !21, line: 79, baseType: !50, size: 8, offset: 1048)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !505, file: !21, line: 81, baseType: !54, size: 64, offset: 1088)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !505, file: !21, line: 89, baseType: !57, size: 64, offset: 1152)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !505, file: !21, line: 91, baseType: !59, size: 64, offset: 1216)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !505, file: !21, line: 92, baseType: !62, size: 64, offset: 1280)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !505, file: !21, line: 93, baseType: !504, size: 64, offset: 1344)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !505, file: !21, line: 94, baseType: !66, size: 64, offset: 1408)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !505, file: !21, line: 95, baseType: !68, size: 64, offset: 1472)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !505, file: !21, line: 96, baseType: !14, size: 32, offset: 1536)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !505, file: !21, line: 98, baseType: !73, size: 160, offset: 1568)
!536 = distinct !DICompileUnit(language: DW_LANG_C99, file: !537, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !538, nameTableKind: None)
!537 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!538 = !{!539}
!539 = !DISubprogram(name: "setlocale_null_r", scope: !540, file: !540, line: 64, type: !541, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!540 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!541 = !DISubroutineType(types: !542)
!542 = !{!14, !14, !10, !70}
!543 = distinct !DICompileUnit(language: DW_LANG_C99, file: !544, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !545, retainedTypes: !932, nameTableKind: None)
!544 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!545 = !{!546}
!546 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !547, line: 41, baseType: !263, size: 32, elements: !548)
!547 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!548 = !{!549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931}
!549 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!550 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!551 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!552 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!553 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!554 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!555 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!556 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!557 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!558 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!559 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!560 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!561 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!562 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!563 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!564 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!565 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!566 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!567 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!568 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!569 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!570 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!571 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!572 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!573 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!574 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!575 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!576 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!577 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!578 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!579 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!580 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!581 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!582 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!583 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!584 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!585 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!586 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!587 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!588 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!589 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!590 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!591 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!592 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!593 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!594 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!595 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!596 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!597 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!598 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!599 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!600 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!601 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!602 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!603 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!604 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!605 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!606 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!607 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!608 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!609 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!610 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!611 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!612 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!613 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!614 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!615 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!616 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!617 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!618 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!619 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!620 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!621 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!622 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!623 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!624 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!625 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!626 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!627 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!628 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!629 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!630 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!631 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!632 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!633 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!634 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!635 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!636 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!637 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!657 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!660 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!661 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!662 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!663 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!664 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!665 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!666 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!667 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!668 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!669 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!670 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!671 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!672 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!673 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!674 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!675 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!676 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!677 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!678 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!679 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!680 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!681 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!682 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!683 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!684 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!685 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!686 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!687 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!688 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!689 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!690 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!691 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!692 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!693 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!694 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!695 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!696 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!697 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!698 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!699 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!700 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!701 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!702 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!703 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!704 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!705 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!706 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!707 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!708 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!709 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!710 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!711 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!712 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!713 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!714 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!715 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!716 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!717 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!719 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!720 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!721 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!722 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!723 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!724 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!725 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!726 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!727 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!728 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!729 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!730 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!731 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!732 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!733 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!734 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!735 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!736 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!737 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!738 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!739 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!740 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!741 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!742 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!743 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!744 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!745 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!746 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!747 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!748 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!749 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!750 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!751 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!752 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!753 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!754 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!755 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!756 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!757 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!758 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!759 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!760 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!761 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!762 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!763 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!764 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!765 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!766 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!767 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!768 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!769 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!770 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!771 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!772 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!773 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!774 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!779 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!780 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!781 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!782 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!783 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!784 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!785 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!786 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!787 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!788 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!789 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!790 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!791 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!793 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!794 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!795 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!796 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!797 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!798 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!799 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!800 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!801 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!802 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!803 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!804 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!805 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!806 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!807 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!808 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!809 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!810 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!812 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!813 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!814 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!815 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!816 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!817 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!818 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!819 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!820 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!821 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!822 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!823 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!824 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!825 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!826 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!827 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!828 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!829 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!830 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!831 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!832 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!833 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!834 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!835 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!836 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!837 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!838 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!839 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!840 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!841 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!842 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!843 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!844 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!845 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!846 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!847 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!864 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!865 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!866 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!867 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!868 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!873 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!874 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!875 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!876 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!884 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!885 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!886 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!887 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!894 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!895 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!896 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!898 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!899 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!900 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!901 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!902 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!903 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!904 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!905 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!906 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!907 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!908 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!909 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!910 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!911 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!912 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!913 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!914 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!915 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!916 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!917 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!918 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!919 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!920 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!921 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!922 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!923 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!924 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!925 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!926 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!927 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!928 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!929 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!930 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!931 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!932 = !{!933, !66}
!933 = !DISubprogram(name: "nl_langinfo", scope: !547, file: !547, line: 661, type: !934, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!934 = !DISubroutineType(types: !935)
!935 = !{!10, !14}
!936 = distinct !DICompileUnit(language: DW_LANG_C99, file: !937, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !938, nameTableKind: None)
!937 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!938 = !{!66, !80}
!939 = distinct !DICompileUnit(language: DW_LANG_C99, file: !940, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !941, nameTableKind: None)
!940 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!941 = !{!942, !977, !978, !982}
!942 = !DISubprogram(name: "fileno", scope: !16, file: !16, line: 786, type: !943, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!943 = !DISubroutineType(types: !944)
!944 = !{!14, !945}
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !947)
!947 = !{!948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !946, file: !21, line: 51, baseType: !14, size: 32)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !946, file: !21, line: 54, baseType: !10, size: 64, offset: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !946, file: !21, line: 55, baseType: !10, size: 64, offset: 128)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !946, file: !21, line: 56, baseType: !10, size: 64, offset: 192)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !946, file: !21, line: 57, baseType: !10, size: 64, offset: 256)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !946, file: !21, line: 58, baseType: !10, size: 64, offset: 320)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !946, file: !21, line: 59, baseType: !10, size: 64, offset: 384)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !946, file: !21, line: 60, baseType: !10, size: 64, offset: 448)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !946, file: !21, line: 61, baseType: !10, size: 64, offset: 512)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !946, file: !21, line: 64, baseType: !10, size: 64, offset: 576)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !946, file: !21, line: 65, baseType: !10, size: 64, offset: 640)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !946, file: !21, line: 66, baseType: !10, size: 64, offset: 704)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !946, file: !21, line: 68, baseType: !36, size: 64, offset: 768)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !946, file: !21, line: 70, baseType: !945, size: 64, offset: 832)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !946, file: !21, line: 72, baseType: !14, size: 32, offset: 896)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !946, file: !21, line: 73, baseType: !14, size: 32, offset: 928)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !946, file: !21, line: 74, baseType: !42, size: 64, offset: 960)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !946, file: !21, line: 77, baseType: !46, size: 16, offset: 1024)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !946, file: !21, line: 78, baseType: !48, size: 8, offset: 1040)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !946, file: !21, line: 79, baseType: !50, size: 8, offset: 1048)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !946, file: !21, line: 81, baseType: !54, size: 64, offset: 1088)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !946, file: !21, line: 89, baseType: !57, size: 64, offset: 1152)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !946, file: !21, line: 91, baseType: !59, size: 64, offset: 1216)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !946, file: !21, line: 92, baseType: !62, size: 64, offset: 1280)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !946, file: !21, line: 93, baseType: !945, size: 64, offset: 1344)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !946, file: !21, line: 94, baseType: !66, size: 64, offset: 1408)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !946, file: !21, line: 95, baseType: !68, size: 64, offset: 1472)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !946, file: !21, line: 96, baseType: !14, size: 32, offset: 1536)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !946, file: !21, line: 98, baseType: !73, size: 160, offset: 1568)
!977 = !DISubprogram(name: "fclose", scope: !16, file: !16, line: 213, type: !943, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!978 = !DISubprogram(name: "lseek", scope: !979, file: !979, line: 334, type: !980, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!979 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!980 = !DISubroutineType(types: !981)
!981 = !{!44, !14, !44, !14}
!982 = !DISubprogram(name: "rpl_fflush", scope: !501, file: !501, line: 718, type: !943, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!983 = distinct !DICompileUnit(language: DW_LANG_C99, file: !984, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !985, nameTableKind: None)
!984 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!985 = !{!66, !986, !1021}
!986 = !DISubprogram(name: "fflush", scope: !16, file: !16, line: 218, type: !987, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!987 = !DISubroutineType(types: !988)
!988 = !{!14, !989}
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !991)
!991 = !{!992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !990, file: !21, line: 51, baseType: !14, size: 32)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !990, file: !21, line: 54, baseType: !10, size: 64, offset: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !990, file: !21, line: 55, baseType: !10, size: 64, offset: 128)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !990, file: !21, line: 56, baseType: !10, size: 64, offset: 192)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !990, file: !21, line: 57, baseType: !10, size: 64, offset: 256)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !990, file: !21, line: 58, baseType: !10, size: 64, offset: 320)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !990, file: !21, line: 59, baseType: !10, size: 64, offset: 384)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !990, file: !21, line: 60, baseType: !10, size: 64, offset: 448)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !990, file: !21, line: 61, baseType: !10, size: 64, offset: 512)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !990, file: !21, line: 64, baseType: !10, size: 64, offset: 576)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !990, file: !21, line: 65, baseType: !10, size: 64, offset: 640)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !990, file: !21, line: 66, baseType: !10, size: 64, offset: 704)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !990, file: !21, line: 68, baseType: !36, size: 64, offset: 768)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !990, file: !21, line: 70, baseType: !989, size: 64, offset: 832)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !990, file: !21, line: 72, baseType: !14, size: 32, offset: 896)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !990, file: !21, line: 73, baseType: !14, size: 32, offset: 928)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !990, file: !21, line: 74, baseType: !42, size: 64, offset: 960)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !990, file: !21, line: 77, baseType: !46, size: 16, offset: 1024)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !990, file: !21, line: 78, baseType: !48, size: 8, offset: 1040)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !990, file: !21, line: 79, baseType: !50, size: 8, offset: 1048)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !990, file: !21, line: 81, baseType: !54, size: 64, offset: 1088)
