source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.Active_dir = type { i64, i64, %struct._ftsent* }
%struct.FTS = type { %struct._ftsent*, %struct._ftsent*, %struct._ftsent**, i64, i8*, i32, i32, i64, i64, i32 (%struct._ftsent**, %struct._ftsent**)*, i32, %struct.hash_table*, %union.anon, %struct.I_ring }
%struct.I_ring = type { [4 x i32], i32, i32, i32, i8 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__dirstream = type opaque
%struct.__fsid_t = type { [2 x i32] }
%struct.__mbstate_t = type { i32, %union.anon.1 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct._ftsent = type { %struct._ftsent*, %struct._ftsent*, %struct._ftsent*, %struct.__dirstream*, i64, i8*, i8*, i8*, i32, i32, i64, %struct.FTS*, i64, i64, i64, i16, i16, i16, [1 x %struct.stat], [0 x i8] }
%struct.argv_iterator = type { %struct._IO_FILE*, i64, i8*, i64, i8**, i8** }
%struct.cycle_check_state = type { %struct.timespec, i64, i32 }
%struct.di_ent = type { i64, %struct.hash_table* }
%struct.di_set = type { %struct.hash_table*, %struct.ino_map*, %struct.di_ent* }

!101 = !DILocalVariable(name: "opt_summarize_only", scope: !83, file: !3, line: 737, type: !96)
!102 = !DILocalVariable(name: "oi", scope: !103, file: !3, line: 757, type: !86)
!103 = distinct !DILexicalBlock(scope: !83, file: !3, line: 756, column: 5)
!104 = !DILocalVariable(name: "c", scope: !103, file: !3, line: 758, type: !86)
!105 = !DILocalVariable(name: "tmp_ulong", scope: !106, file: !3, line: 810, type: !72)
!106 = distinct !DILexicalBlock(scope: !107, file: !3, line: 809, column: 11)
!107 = distinct !DILexicalBlock(scope: !103, file: !3, line: 764, column: 9)
!108 = !DILocalVariable(name: "e", scope: !109, file: !3, line: 841, type: !19)
!109 = distinct !DILexicalBlock(scope: !107, file: !3, line: 840, column: 11)
!110 = !DILocalVariable(name: "e", scope: !111, file: !3, line: 859, type: !19)
!111 = distinct !DILexicalBlock(scope: !107, file: !3, line: 858, column: 11)
!112 = !DILocalVariable(name: "d", scope: !113, file: !3, line: 943, type: !72)
!113 = distinct !DILexicalBlock(scope: !114, file: !3, line: 942, column: 5)
!114 = distinct !DILexicalBlock(scope: !83, file: !3, line: 941, column: 7)
!115 = !DILocalVariable(name: "p", scope: !116, file: !3, line: 975, type: !66)
!116 = distinct !DILexicalBlock(scope: !117, file: !3, line: 972, column: 13)
!117 = distinct !DILexicalBlock(scope: !118, file: !3, line: 971, column: 20)
!118 = distinct !DILexicalBlock(scope: !119, file: !3, line: 969, column: 15)
!119 = distinct !DILexicalBlock(scope: !120, file: !3, line: 965, column: 9)
!120 = distinct !DILexicalBlock(scope: !121, file: !3, line: 964, column: 11)
!121 = distinct !DILexicalBlock(scope: !122, file: !3, line: 963, column: 5)
!122 = distinct !DILexicalBlock(scope: !83, file: !3, line: 962, column: 7)
!123 = !DILocalVariable(name: "ai", scope: !83, file: !3, line: 1011, type: !124)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "argv_iterator", file: !47, line: 23, flags: DIFlagFwdDecl)
!126 = !DILocalVariable(name: "files", scope: !127, file: !3, line: 1036, type: !87)
!127 = distinct !DILexicalBlock(scope: !128, file: !3, line: 1035, column: 5)
!128 = distinct !DILexicalBlock(scope: !83, file: !3, line: 1012, column: 7)
!129 = !DILocalVariable(name: "skip_file", scope: !130, file: !3, line: 1063, type: !96)
!130 = distinct !DILexicalBlock(scope: !83, file: !3, line: 1062, column: 5)
!131 = !DILocalVariable(name: "ai_err", scope: !130, file: !3, line: 1064, type: !46)
!132 = !DILocalVariable(name: "file_name", scope: !130, file: !3, line: 1065, type: !66)
!133 = !DILocalVariable(name: "file_number", scope: !134, file: !3, line: 1110, type: !72)
!134 = distinct !DILexicalBlock(scope: !135, file: !3, line: 1106, column: 13)
!135 = distinct !DILexicalBlock(scope: !136, file: !3, line: 1103, column: 15)
!136 = distinct !DILexicalBlock(scope: !137, file: !3, line: 1098, column: 9)
!137 = distinct !DILexicalBlock(scope: !130, file: !3, line: 1097, column: 11)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 56, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 7)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(name: "prefix_len", scope: !83, file: !3, line: 983, type: !143, isLocal: true, isDefinition: true)
!143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !73)
!144 = !DIGlobalVariableExpression(var: !145, expr: !DIExpression())
!145 = distinct !DIGlobalVariable(name: "temp_argv", scope: !83, file: !3, line: 1059, type: !92, isLocal: true, isDefinition: true)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(name: "di_files", scope: !2, file: !3, line: 66, type: !148, isLocal: true, isDefinition: true)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "di_set", file: !150, line: 13, flags: DIFlagFwdDecl)
!150 = !DIFile(filename: "./lib/di-set.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!151 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression())
!152 = distinct !DIGlobalVariable(name: "di_mnt", scope: !2, file: !3, line: 69, type: !148, isLocal: true, isDefinition: true)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "hash_all", scope: !2, file: !3, line: 140, type: !96, isLocal: true, isDefinition: true)
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(name: "human_output_opts", scope: !2, file: !3, line: 161, type: !86, isLocal: true, isDefinition: true)
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!158 = distinct !DIGlobalVariable(name: "localtz", scope: !2, file: !3, line: 187, type: !159, isLocal: true, isDefinition: true)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !160, line: 742, baseType: !161)
!160 = !DIFile(filename: "./lib/time.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !160, line: 742, flags: DIFlagFwdDecl)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "output_block_size", scope: !2, file: !3, line: 190, type: !68, isLocal: true, isDefinition: true)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "tot_dui", scope: !2, file: !3, line: 196, type: !167, isLocal: true, isDefinition: true)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "duinfo", file: !3, line: 76, size: 256, elements: !168)
!168 = !{!169, !170, !171}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !167, file: !3, line: 79, baseType: !68, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "inodes", scope: !167, file: !3, line: 82, baseType: !68, size: 64, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "tmax", scope: !167, file: !3, line: 86, baseType: !172, size: 128, offset: 128)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !173, line: 9, size: 128, elements: !174)
!173 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!174 = !{!175, !176}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !172, file: !173, line: 11, baseType: !77, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !172, file: !173, line: 12, baseType: !177, size: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !71, line: 194, baseType: !78)
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 216, type: !180, isLocal: true, isDefinition: true)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 6656, elements: !190)
!181 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !182)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !183, line: 50, size: 256, elements: !184)
!183 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!184 = !{!185, !186, !187, !189}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !182, file: !183, line: 52, baseType: !63, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !182, file: !183, line: 55, baseType: !86, size: 32, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !182, file: !183, line: 56, baseType: !188, size: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !182, file: !183, line: 57, baseType: !86, size: 32, offset: 192)
!190 = !{!191}
!191 = !DISubrange(count: 26)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(name: "opt_nul_terminate_output", scope: !2, file: !3, line: 143, type: !96, isLocal: true, isDefinition: true)
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(name: "opt_all", scope: !2, file: !3, line: 130, type: !96, isLocal: true, isDefinition: true)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "apparent_size", scope: !2, file: !3, line: 134, type: !96, isLocal: true, isDefinition: true)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(name: "print_grand_total", scope: !2, file: !3, line: 146, type: !96, isLocal: true, isDefinition: true)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(name: "max_depth", scope: !2, file: !3, line: 154, type: !73, isLocal: true, isDefinition: true)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(name: "opt_count_all", scope: !2, file: !3, line: 137, type: !96, isLocal: true, isDefinition: true)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(name: "opt_threshold", scope: !2, file: !3, line: 158, type: !206, isLocal: true, isDefinition: true)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !69, line: 101, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !71, line: 71, baseType: !78)
!208 = !DIGlobalVariableExpression(var: !209, expr: !DIExpression())
!209 = distinct !DIGlobalVariable(name: "opt_separate_dirs", scope: !2, file: !3, line: 149, type: !96, isLocal: true, isDefinition: true)
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(name: "opt_inodes", scope: !2, file: !3, line: 164, type: !96, isLocal: true, isDefinition: true)
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(name: "opt_time", scope: !2, file: !3, line: 167, type: !96, isLocal: true, isDefinition: true)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(name: "time_types", scope: !2, file: !3, line: 251, type: !216, isLocal: true, isDefinition: true)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 160, elements: !218)
!217 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!218 = !{!219}
!219 = !DISubrange(count: 5)
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(name: "time_args", scope: !2, file: !3, line: 247, type: !222, isLocal: true, isDefinition: true)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 384, elements: !224)
!223 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!224 = !{!225}
!225 = !DISubrange(count: 6)
!226 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!227 = distinct !DIGlobalVariable(name: "time_type", scope: !2, file: !3, line: 178, type: !41, isLocal: true, isDefinition: true)
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(name: "time_style", scope: !2, file: !3, line: 181, type: !63, isLocal: true, isDefinition: true)
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(name: "time_format", scope: !2, file: !3, line: 184, type: !63, isLocal: true, isDefinition: true)
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(name: "time_style_types", scope: !2, file: !3, line: 271, type: !234, isLocal: true, isDefinition: true)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !235, size: 96, elements: !236)
!235 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !53)
!236 = !{!237}
!237 = !DISubrange(count: 3)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(name: "time_style_args", scope: !2, file: !3, line: 267, type: !240, isLocal: true, isDefinition: true)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 256, elements: !241)
!241 = !{!242}
!242 = !DISubrange(count: 4)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(name: "prev_level", scope: !2, file: !3, line: 73, type: !73, isLocal: true, isDefinition: true)
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(name: "n_alloc", scope: !247, file: !3, line: 494, type: !73, isLocal: true, isDefinition: true)
!247 = distinct !DISubprogram(name: "process_file", scope: !3, file: !3, line: 488, type: !248, isLocal: true, isDefinition: true, scopeLine: 489, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !362)
!248 = !DISubroutineType(types: !249)
!249 = !{!96, !250, !360}
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !252, line: 199, baseType: !253)
!252 = !DIFile(filename: "./lib/fts_.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !252, line: 80, size: 1024, elements: !254)
!254 = !{!255, !321, !322, !324, !326, !327, !328, !329, !330, !331, !338, !339, !342, !349}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !253, file: !252, line: 81, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !252, line: 201, size: 2112, elements: !258)
!258 = !{!259, !260, !261, !262, !267, !268, !269, !270, !271, !272, !273, !274, !275, !277, !278, !282, !284, !285, !286, !317}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !257, file: !252, line: 202, baseType: !256, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !257, file: !252, line: 203, baseType: !256, size: 64, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !257, file: !252, line: 204, baseType: !256, size: 64, offset: 128)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !257, file: !252, line: 205, baseType: !263, size: 64, offset: 192)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !265, line: 127, baseType: !266)
!265 = !DIFile(filename: "/usr/include/dirent.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!266 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !265, line: 127, flags: DIFlagFwdDecl)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !257, file: !252, line: 208, baseType: !78, size: 64, offset: 256)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !257, file: !252, line: 209, baseType: !67, size: 64, offset: 320)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !257, file: !252, line: 210, baseType: !66, size: 64, offset: 384)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !257, file: !252, line: 211, baseType: !66, size: 64, offset: 448)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !257, file: !252, line: 212, baseType: !86, size: 32, offset: 512)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !257, file: !252, line: 213, baseType: !86, size: 32, offset: 544)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !257, file: !252, line: 214, baseType: !73, size: 64, offset: 576)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !257, file: !252, line: 216, baseType: !250, size: 64, offset: 640)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !257, file: !252, line: 220, baseType: !276, size: 64, offset: 704)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !74, line: 51, baseType: !78)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !257, file: !252, line: 222, baseType: !73, size: 64, offset: 768)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "fts_n_dirs_remaining", scope: !257, file: !252, line: 227, baseType: !279, size: 64, offset: 832)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !280, line: 74, baseType: !281)
!280 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !71, line: 149, baseType: !72)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !257, file: !252, line: 243, baseType: !283, size: 16, offset: 896)
!283 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !257, file: !252, line: 247, baseType: !283, size: 16, offset: 912)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !257, file: !252, line: 253, baseType: !283, size: 16, offset: 928)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !257, file: !252, line: 255, baseType: !287, size: 1152, offset: 960)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !288, size: 1152, elements: !315)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !289, line: 46, size: 1152, elements: !290)
!289 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!290 = !{!291, !293, !295, !296, !298, !300, !302, !303, !304, !306, !308, !310, !311, !312, !313}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !288, file: !289, line: 48, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !71, line: 143, baseType: !72)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !288, file: !289, line: 53, baseType: !294, size: 64, offset: 64)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !71, line: 146, baseType: !72)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !288, file: !289, line: 61, baseType: !281, size: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !288, file: !289, line: 62, baseType: !297, size: 32, offset: 192)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !71, line: 148, baseType: !7)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !288, file: !289, line: 64, baseType: !299, size: 32, offset: 224)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !71, line: 144, baseType: !7)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !288, file: !289, line: 65, baseType: !301, size: 32, offset: 256)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !71, line: 145, baseType: !7)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !288, file: !289, line: 67, baseType: !86, size: 32, offset: 288)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !288, file: !289, line: 69, baseType: !292, size: 64, offset: 320)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !288, file: !289, line: 74, baseType: !305, size: 64, offset: 384)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !71, line: 150, baseType: !78)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !288, file: !289, line: 78, baseType: !307, size: 64, offset: 448)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !71, line: 172, baseType: !78)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !288, file: !289, line: 80, baseType: !309, size: 64, offset: 512)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !71, line: 177, baseType: !78)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !288, file: !289, line: 91, baseType: !172, size: 128, offset: 576)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !288, file: !289, line: 92, baseType: !172, size: 128, offset: 704)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !288, file: !289, line: 93, baseType: !172, size: 128, offset: 832)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !288, file: !289, line: 106, baseType: !314, size: 192, offset: 960)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !177, size: 192, elements: !236)
!315 = !{!316}
!316 = !DISubrange(count: 1)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "fts_name", scope: !257, file: !252, line: 256, baseType: !318, offset: 2112)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: -1)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "fts_child", scope: !253, file: !252, line: 82, baseType: !256, size: 64, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "fts_array", scope: !253, file: !252, line: 83, baseType: !323, size: 64, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !253, file: !252, line: 84, baseType: !325, size: 64, offset: 192)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !280, line: 59, baseType: !292)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !253, file: !252, line: 85, baseType: !66, size: 64, offset: 256)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "fts_rfd", scope: !253, file: !252, line: 86, baseType: !86, size: 32, offset: 320)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cwd_fd", scope: !253, file: !252, line: 87, baseType: !86, size: 32, offset: 352)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !253, file: !252, line: 89, baseType: !73, size: 64, offset: 384)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "fts_nitems", scope: !253, file: !252, line: 90, baseType: !73, size: 64, offset: 448)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "fts_compar", scope: !253, file: !252, line: 91, baseType: !332, size: 64, offset: 512)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!86, !335, !335}
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !257)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "fts_options", scope: !253, file: !252, line: 162, baseType: !86, size: 32, offset: 576)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "fts_leaf_optimization_works_ht", scope: !253, file: !252, line: 171, baseType: !340, size: 64, offset: 640)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !252, line: 171, flags: DIFlagFwdDecl)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !253, file: !252, line: 193, baseType: !343, size: 64, offset: 704)
!343 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !253, file: !252, line: 173, size: 64, elements: !344)
!344 = !{!345, !346}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !343, file: !252, line: 186, baseType: !340, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !343, file: !252, line: 192, baseType: !347, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DICompositeType(tag: DW_TAG_structure_type, name: "cycle_check_state", file: !252, line: 192, flags: DIFlagFwdDecl)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fd_ring", scope: !253, file: !252, line: 198, baseType: !350, size: 256, offset: 768)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "I_ring", file: !351, line: 39, baseType: !352)
!351 = !DIFile(filename: "./lib/i-ring.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "I_ring", file: !351, line: 31, size: 256, elements: !353)
!353 = !{!354, !356, !357, !358, !359}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "ir_data", scope: !352, file: !351, line: 33, baseType: !355, size: 128)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 128, elements: !241)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "ir_default_val", scope: !352, file: !351, line: 34, baseType: !86, size: 32, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "ir_front", scope: !352, file: !351, line: 35, baseType: !7, size: 32, offset: 160)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "ir_back", scope: !352, file: !351, line: 36, baseType: !7, size: 32, offset: 192)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "ir_empty", scope: !352, file: !351, line: 37, baseType: !96, size: 8, offset: 224)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTSENT", file: !252, line: 257, baseType: !257)
!362 = !{!363, !364, !365, !366, !367, !368, !369, !370, !373, !374, !378, !385, !390, !397}
!363 = !DILocalVariable(name: "fts", arg: 1, scope: !247, file: !3, line: 488, type: !250)
!364 = !DILocalVariable(name: "ent", arg: 2, scope: !247, file: !3, line: 488, type: !360)
!365 = !DILocalVariable(name: "ok", scope: !247, file: !3, line: 490, type: !96)
!366 = !DILocalVariable(name: "dui", scope: !247, file: !3, line: 491, type: !167)
!367 = !DILocalVariable(name: "dui_to_print", scope: !247, file: !3, line: 492, type: !167)
!368 = !DILocalVariable(name: "level", scope: !247, file: !3, line: 493, type: !73)
!369 = !DILocalVariable(name: "file", scope: !247, file: !3, line: 505, type: !63)
!370 = !DILocalVariable(name: "sb", scope: !247, file: !3, line: 506, type: !371)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !288)
!373 = !DILocalVariable(name: "info", scope: !247, file: !3, line: 507, type: !86)
!374 = !DILocalVariable(name: "excluded", scope: !375, file: !3, line: 517, type: !96)
!375 = distinct !DILexicalBlock(scope: !376, file: !3, line: 516, column: 5)
!376 = distinct !DILexicalBlock(scope: !377, file: !3, line: 515, column: 12)
!377 = distinct !DILexicalBlock(scope: !247, file: !3, line: 509, column: 7)
!378 = !DILocalVariable(name: "e", scope: !379, file: !3, line: 525, type: !383)
!379 = distinct !DILexicalBlock(scope: !380, file: !3, line: 523, column: 13)
!380 = distinct !DILexicalBlock(scope: !381, file: !3, line: 522, column: 15)
!381 = distinct !DILexicalBlock(scope: !382, file: !3, line: 519, column: 9)
!382 = distinct !DILexicalBlock(scope: !375, file: !3, line: 518, column: 11)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !361)
!385 = !DILocalVariable(name: "e", scope: !386, file: !3, line: 558, type: !383)
!386 = distinct !DILexicalBlock(scope: !387, file: !3, line: 556, column: 13)
!387 = distinct !DILexicalBlock(scope: !388, file: !3, line: 555, column: 15)
!388 = distinct !DILexicalBlock(scope: !389, file: !3, line: 551, column: 9)
!389 = distinct !DILexicalBlock(scope: !375, file: !3, line: 547, column: 11)
!390 = !DILocalVariable(name: "i", scope: !391, file: !3, line: 623, type: !73)
!391 = distinct !DILexicalBlock(scope: !392, file: !3, line: 623, column: 11)
!392 = distinct !DILexicalBlock(scope: !393, file: !3, line: 611, column: 9)
!393 = distinct !DILexicalBlock(scope: !394, file: !3, line: 610, column: 16)
!394 = distinct !DILexicalBlock(scope: !395, file: !3, line: 606, column: 11)
!395 = distinct !DILexicalBlock(scope: !396, file: !3, line: 605, column: 5)
!396 = distinct !DILexicalBlock(scope: !247, file: !3, line: 599, column: 7)
!397 = !DILocalVariable(name: "v", scope: !398, file: !3, line: 662, type: !68)
!398 = distinct !DILexicalBlock(scope: !399, file: !3, line: 660, column: 5)
!399 = distinct !DILexicalBlock(scope: !247, file: !3, line: 657, column: 7)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(name: "dulvl", scope: !247, file: !3, line: 503, type: !402, isLocal: true, isDefinition: true)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dulevel", file: !3, line: 120, size: 512, elements: !404)
!404 = !{!405, !406}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "ent", scope: !403, file: !3, line: 123, baseType: !167, size: 256)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "subdir", scope: !403, file: !3, line: 126, baseType: !167, size: 256, offset: 256)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "exclude", file: !409, line: 47, flags: DIFlagFwdDecl)
!409 = !DIFile(filename: "./lib/exclude.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!410 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!411 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!412 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!413 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!414 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!415 = !DIGlobalVariableExpression(var: !209, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!416 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!417 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(name: "Version", scope: !420, file: !421, line: 2, type: !63, isDefinition: true)
!420 = distinct !DICompileUnit(language: DW_LANG_C99, file: !421, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !422, globals: !423)
!421 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!422 = !{}
!423 = !{!418}
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !426, file: !431, line: 69, type: !432, isDefinition: true)
!426 = distinct !DICompileUnit(language: DW_LANG_C99, file: !427, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !428, retainedTypes: !429, globals: !430)
!427 = !DIFile(filename: "./lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!428 = !{!27}
!429 = !{!67, !79}
!430 = !{!424}
!431 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !433, line: 55, baseType: !434)
!433 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DISubroutineType(types: !436)
!436 = !{null}
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(name: "file_name", scope: !439, file: !444, line: 46, type: !63, isLocal: true, isDefinition: true)
!439 = distinct !DICompileUnit(language: DW_LANG_C99, file: !440, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !422, globals: !441)
!440 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!441 = !{!437, !442}
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !439, file: !444, line: 56, type: !96, isLocal: true, isDefinition: true)
!444 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(name: "exit_failure", scope: !447, file: !450, line: 24, type: !451, isDefinition: true)
!447 = distinct !DICompileUnit(language: DW_LANG_C99, file: !448, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !422, globals: !449)
!448 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!449 = !{!445}
!450 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!451 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !86)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(name: "default_tuning", scope: !454, file: !458, line: 130, type: !459, isLocal: true, isDefinition: true)
!454 = distinct !DICompileUnit(language: DW_LANG_C99, file: !455, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !422, retainedTypes: !456, globals: !457)
!455 = !DIFile(filename: "./lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!456 = !{!72, !67, !73}
!457 = !{!452}
!458 = !DIFile(filename: "lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!459 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !460)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !461, line: 65, baseType: !462)
!461 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !461, line: 53, size: 160, elements: !463)
!463 = !{!464, !466, !467, !468, !469}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !462, file: !461, line: 58, baseType: !465, size: 32)
!465 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !462, file: !461, line: 59, baseType: !465, size: 32, offset: 32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !462, file: !461, line: 60, baseType: !465, size: 32, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !462, file: !461, line: 61, baseType: !465, size: 32, offset: 96)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !462, file: !461, line: 62, baseType: !96, size: 8, offset: 128)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(name: "power_letter", scope: !472, file: !479, line: 36, type: !485, isLocal: true, isDefinition: true)
!472 = distinct !DICompileUnit(language: DW_LANG_C99, file: !473, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !474, retainedTypes: !475, globals: !476)
!473 = !DIFile(filename: "./lib/human.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!474 = !{!5, !19}
!475 = !{!63}
!476 = !{!470, !477, !481}
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(name: "block_size_args", scope: !472, file: !479, line: 398, type: !480, isLocal: true, isDefinition: true)
!479 = !DIFile(filename: "lib/human.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 192, elements: !236)
!481 = !DIGlobalVariableExpression(var: !482, expr: !DIExpression())
!482 = distinct !DIGlobalVariable(name: "block_size_opts", scope: !472, file: !479, line: 399, type: !483, isLocal: true, isDefinition: true)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !484, size: 64, elements: !93)
!484 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !86)
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 72, elements: !486)
!486 = !{!487}
!487 = !DISubrange(count: 9)
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(name: "program_name", scope: !490, file: !494, line: 33, type: !63, isDefinition: true)
!490 = distinct !DICompileUnit(language: DW_LANG_C99, file: !491, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !422, retainedTypes: !492, globals: !493)
!491 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!492 = !{!67, !66}
!493 = !{!488}
!494 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !497, file: !524, line: 85, type: !559, isDefinition: true)
!497 = distinct !DICompileUnit(language: DW_LANG_C99, file: !498, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !499, retainedTypes: !520, globals: !521)
!498 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!499 = !{!27, !500, !505}
!500 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !28, line: 242, baseType: !7, size: 32, elements: !501)
!501 = !{!502, !503, !504}
!502 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!503 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!504 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!505 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !506, line: 46, baseType: !7, size: 32, elements: !507)
!506 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!507 = !{!508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519}
!508 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!509 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!510 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!511 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!512 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!513 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!514 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!515 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!516 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!517 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!518 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!519 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!520 = !{!86, !283, !73, !66}
!521 = !{!495, !522, !529, !541, !543, !548, !555, !557}
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !497, file: !524, line: 101, type: !525, isDefinition: true)
!524 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !526, size: 320, elements: !527)
!526 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!527 = !{!528}
!528 = !DISubrange(count: 10)
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !497, file: !524, line: 1052, type: !531, isDefinition: true)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !524, line: 65, size: 448, elements: !532)
!532 = !{!533, !534, !535, !539, !540}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !531, file: !524, line: 68, baseType: !27, size: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !531, file: !524, line: 71, baseType: !86, size: 32, offset: 32)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !531, file: !524, line: 75, baseType: !536, size: 256, offset: 64)
!536 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !537)
!537 = !{!538}
!538 = !DISubrange(count: 8)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !531, file: !524, line: 78, baseType: !63, size: 64, offset: 320)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !531, file: !524, line: 81, baseType: !63, size: 64, offset: 384)
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !497, file: !524, line: 116, type: !531, isLocal: true, isDefinition: true)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(name: "slot0", scope: !497, file: !524, line: 842, type: !545, isLocal: true, isDefinition: true)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 2048, elements: !546)
!546 = !{!547}
!547 = !DISubrange(count: 256)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(name: "slotvec", scope: !497, file: !524, line: 845, type: !550, isLocal: true, isDefinition: true)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !524, line: 834, size: 128, elements: !552)
!552 = !{!553, !554}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !551, file: !524, line: 836, baseType: !73, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !551, file: !524, line: 837, baseType: !66, size: 64, offset: 64)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(name: "nslots", scope: !497, file: !524, line: 843, type: !86, isLocal: true, isDefinition: true)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(name: "slotvec0", scope: !497, file: !524, line: 844, type: !551, isLocal: true, isDefinition: true)
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 704, elements: !560)
!560 = !{!561}
!561 = !DISubrange(count: 11)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !564, file: !567, line: 26, type: !568, isDefinition: true)
!564 = distinct !DICompileUnit(language: DW_LANG_C99, file: !565, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !422, globals: !566)
!565 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!566 = !{!562}
!567 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 376, elements: !569)
!569 = !{!570}
!570 = !DISubrange(count: 47)
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(name: "is_basic_table", scope: !573, file: !577, line: 28, type: !578, isDefinition: true)
!573 = distinct !DICompileUnit(language: DW_LANG_C99, file: !574, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !422, retainedTypes: !575, globals: !576)
!574 = !DIFile(filename: "./lib/mbchar.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!575 = !{!79}
!576 = !{!571}
!577 = !DIFile(filename: "lib/mbchar.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !579, size: 256, elements: !537)
!579 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!580 = !DIGlobalVariableExpression(var: !581, expr: !DIExpression())
!581 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !582, file: !583, line: 339, type: !86, isLocal: true, isDefinition: true)
!582 = distinct !DISubprogram(name: "rpl_fcntl", scope: !583, file: !583, line: 276, type: !584, isDefinition: true, scopeLine: 277, flags: DIFlagPrototyped, isOptimized: true, unit: !586, retainedNodes: !589)
!583 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!584 = !DISubroutineType(types: !585)
!585 = !{!86, !86, !86, null}
!586 = distinct !DICompileUnit(language: DW_LANG_C99, file: !587, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !422, globals: !588)
!587 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!588 = !{!580}
!589 = !{!590, !591, !592, !603, !604, !607, !610, !613}
!590 = !DILocalVariable(name: "fd", arg: 1, scope: !582, file: !583, line: 276, type: !86)
!591 = !DILocalVariable(name: "action", arg: 2, scope: !582, file: !583, line: 276, type: !86)
!592 = !DILocalVariable(name: "arg", scope: !582, file: !583, line: 278, type: !593)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !594, line: 30, baseType: !595)
!594 = !DIFile(filename: "/usr/lib/clang/7.0.0/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !587, line: 278, baseType: !596)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !597, size: 192, elements: !315)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !587, line: 278, size: 192, elements: !598)
!598 = !{!599, !600, !601, !602}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !597, file: !587, line: 278, baseType: !7, size: 32)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !597, file: !587, line: 278, baseType: !7, size: 32, offset: 32)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !597, file: !587, line: 278, baseType: !67, size: 64, offset: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !597, file: !587, line: 278, baseType: !67, size: 64, offset: 128)
!603 = !DILocalVariable(name: "result", scope: !582, file: !583, line: 279, type: !86)
!604 = !DILocalVariable(name: "target", scope: !605, file: !583, line: 326, type: !86)
!605 = distinct !DILexicalBlock(scope: !606, file: !583, line: 325, column: 7)
!606 = distinct !DILexicalBlock(scope: !582, file: !583, line: 282, column: 5)
!607 = !DILocalVariable(name: "flags", scope: !608, file: !583, line: 363, type: !86)
!608 = distinct !DILexicalBlock(scope: !609, file: !583, line: 362, column: 11)
!609 = distinct !DILexicalBlock(scope: !605, file: !583, line: 361, column: 13)
!610 = !DILocalVariable(name: "saved_errno", scope: !611, file: !583, line: 366, type: !86)
!611 = distinct !DILexicalBlock(scope: !612, file: !583, line: 365, column: 15)
!612 = distinct !DILexicalBlock(scope: !608, file: !583, line: 364, column: 17)
!613 = !DILocalVariable(name: "p", scope: !614, file: !583, line: 408, type: !67)
!614 = distinct !DILexicalBlock(scope: !606, file: !583, line: 406, column: 7)
!615 = distinct !DICompileUnit(language: DW_LANG_C99, file: !616, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !617, retainedTypes: !618)
!616 = !DIFile(filename: "./lib/argv-iter.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!617 = !{!46}
!618 = !{!67}
!619 = distinct !DICompileUnit(language: DW_LANG_C99, file: !620, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !621, retainedTypes: !658)
!620 = !DIFile(filename: "./lib/di-set.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!621 = !{!622, !647}
!622 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !624, file: !623, line: 118, baseType: !7, size: 32, elements: !645)
!623 = !DIFile(filename: "lib/di-set.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!624 = distinct !DISubprogram(name: "di_set_alloc", scope: !623, file: !623, line: 113, type: !625, isDefinition: true, scopeLine: 114, flags: DIFlagPrototyped, isOptimized: true, unit: !619, retainedNodes: !643)
!625 = !DISubroutineType(types: !626)
!626 = !{!627}
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "di_set", file: !623, line: 59, size: 192, elements: !629)
!629 = !{!630, !633, !637}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "dev_map", scope: !628, file: !623, line: 62, baseType: !631, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !461, line: 67, flags: DIFlagFwdDecl)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "ino_map", scope: !628, file: !623, line: 67, baseType: !634, size: 64, offset: 64)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DICompositeType(tag: DW_TAG_structure_type, name: "ino_map", file: !636, line: 15, flags: DIFlagFwdDecl)
!636 = !DIFile(filename: "./lib/ino-map.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!637 = !DIDerivedType(tag: DW_TAG_member, name: "probe", scope: !628, file: !623, line: 71, baseType: !638, size: 64, offset: 128)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "di_ent", file: !623, line: 52, size: 128, elements: !640)
!640 = !{!641, !642}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !639, file: !623, line: 54, baseType: !325, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "ino_set", scope: !639, file: !623, line: 55, baseType: !631, size: 64, offset: 64)
!643 = !{!644}
!644 = !DILocalVariable(name: "dis", scope: !624, file: !623, line: 115, type: !627)
!645 = !{!646}
!646 = !DIEnumerator(name: "INITIAL_DEV_MAP_SIZE", value: 11, isUnsigned: true)
!647 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !648, file: !623, line: 185, baseType: !7, size: 32, elements: !656)
!648 = distinct !DISubprogram(name: "map_device", scope: !623, file: !623, line: 154, type: !649, isLocal: true, isDefinition: true, scopeLine: 155, flags: DIFlagPrototyped, isOptimized: true, unit: !619, retainedNodes: !651)
!649 = !DISubroutineType(types: !650)
!650 = !{!631, !627, !325}
!651 = !{!652, !653, !654, !655}
!652 = !DILocalVariable(name: "dis", arg: 1, scope: !648, file: !623, line: 154, type: !627)
!653 = !DILocalVariable(name: "dev", arg: 2, scope: !648, file: !623, line: 154, type: !325)
!654 = !DILocalVariable(name: "ent", scope: !648, file: !623, line: 157, type: !638)
!655 = !DILocalVariable(name: "probe", scope: !648, file: !623, line: 158, type: !638)
!656 = !{!657}
!657 = !DIEnumerator(name: "INITIAL_INO_SET_SIZE", value: 1021, isUnsigned: true)
!658 = !{!73, !659, !661}
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashint", file: !623, line: 33, baseType: !73)
!662 = distinct !DICompileUnit(language: DW_LANG_C99, file: !663, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !664, retainedTypes: !683)
!663 = !DIFile(filename: "./lib/exclude.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!664 = !{!665, !505, !670}
!665 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "exclude_type", file: !666, line: 95, baseType: !7, size: 32, elements: !667)
!666 = !DIFile(filename: "lib/exclude.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!667 = !{!668, !669}
!668 = !DIEnumerator(name: "exclude_hash", value: 0, isUnsigned: true)
!669 = !DIEnumerator(name: "exclude_pattern", value: 1, isUnsigned: true)
!670 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !672, file: !671, line: 186, baseType: !7, size: 32, elements: !681)
!671 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!672 = distinct !DISubprogram(name: "x2nrealloc", scope: !671, file: !671, line: 174, type: !673, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: true, unit: !662, retainedNodes: !676)
!673 = !DISubroutineType(types: !674)
!674 = !{!67, !67, !675, !73}
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!676 = !{!677, !678, !679, !680}
!677 = !DILocalVariable(name: "p", arg: 1, scope: !672, file: !671, line: 174, type: !67)
!678 = !DILocalVariable(name: "pn", arg: 2, scope: !672, file: !671, line: 174, type: !675)
!679 = !DILocalVariable(name: "s", arg: 3, scope: !672, file: !671, line: 174, type: !73)
!680 = !DILocalVariable(name: "n", scope: !672, file: !671, line: 176, type: !73)
!681 = !{!682}
!682 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!683 = !{!66, !86, !79, !283, !73, !684}
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!685 = distinct !DICompileUnit(language: DW_LANG_C99, file: !686, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !422, retainedTypes: !687)
!686 = !DIFile(filename: "./lib/fprintftime.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!687 = !{!73, !63, !7, !86, !79}
!688 = distinct !DICompileUnit(language: DW_LANG_C99, file: !689, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !422)
!689 = !DIFile(filename: "./lib/freopen-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!690 = distinct !DICompileUnit(language: DW_LANG_C99, file: !691, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !692, retainedTypes: !715)
!691 = !DIFile(filename: "./lib/ino-map.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!692 = !{!693}
!693 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !695, file: !694, line: 89, baseType: !7, size: 32, elements: !713)
!694 = !DIFile(filename: "lib/ino-map.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!695 = distinct !DISubprogram(name: "ino_map_alloc", scope: !694, file: !694, line: 83, type: !696, isDefinition: true, scopeLine: 84, flags: DIFlagPrototyped, isOptimized: true, unit: !690, retainedNodes: !710)
!696 = !DISubroutineType(types: !697)
!697 = !{!698, !73}
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ino_map", file: !694, line: 38, size: 192, elements: !700)
!700 = !{!701, !702, !703}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !699, file: !694, line: 42, baseType: !631, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "next_mapped_ino", scope: !699, file: !694, line: 45, baseType: !73, size: 64, offset: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "probe", scope: !699, file: !694, line: 49, baseType: !704, size: 64, offset: 128)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ino_map_ent", file: !694, line: 31, size: 128, elements: !706)
!706 = !{!707, !709}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !705, file: !694, line: 33, baseType: !708, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !280, line: 47, baseType: !294)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "mapped_ino", scope: !705, file: !694, line: 34, baseType: !73, size: 64, offset: 64)
!710 = !{!711, !712}
!711 = !DILocalVariable(name: "next_mapped_ino", arg: 1, scope: !695, file: !694, line: 83, type: !73)
!712 = !DILocalVariable(name: "im", scope: !695, file: !694, line: 85, type: !698)
!713 = !{!714}
!714 = !DIEnumerator(name: "INITIAL_INO_MAP_TABLE_SIZE", value: 1021, isUnsigned: true)
!715 = !{!73}
!716 = distinct !DICompileUnit(language: DW_LANG_C99, file: !717, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !422, retainedTypes: !718)
!717 = !DIFile(filename: "./lib/imaxtostr.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!718 = !{!206}
!719 = distinct !DICompileUnit(language: DW_LANG_C99, file: !720, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !721, retainedTypes: !722)
!720 = !DIFile(filename: "./lib/mbscasecmp.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!721 = !{!505}
!722 = !{!86, !723, !283, !73, !79}
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !79)
!725 = distinct !DICompileUnit(language: DW_LANG_C99, file: !726, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !422, retainedTypes: !727)
!726 = !DIFile(filename: "./lib/mbuiter.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!727 = !{!73, !79}
!728 = distinct !DICompileUnit(language: DW_LANG_C99, file: !729, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !422, retainedTypes: !730)
!729 = !DIFile(filename: "./lib/strnlen1.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!730 = !{!63, !67}
!731 = distinct !DICompileUnit(language: DW_LANG_C99, file: !732, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !733, retainedTypes: !618)
!732 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!733 = !{!734}
!734 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !735, line: 41, baseType: !7, size: 32, elements: !736)
!735 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!736 = !{!737}
!737 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2018, isUnsigned: true)
!738 = distinct !DICompileUnit(language: DW_LANG_C99, file: !739, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !740, retainedTypes: !748)
!739 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!740 = !{!741}
!741 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !742, file: !671, line: 186, baseType: !7, size: 32, elements: !681)
!742 = distinct !DISubprogram(name: "x2nrealloc", scope: !671, file: !671, line: 174, type: !673, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: true, unit: !738, retainedNodes: !743)
!743 = !{!744, !745, !746, !747}
!744 = !DILocalVariable(name: "p", arg: 1, scope: !742, file: !671, line: 174, type: !67)
!745 = !DILocalVariable(name: "pn", arg: 2, scope: !742, file: !671, line: 174, type: !675)
!746 = !DILocalVariable(name: "s", arg: 3, scope: !742, file: !671, line: 174, type: !73)
!747 = !DILocalVariable(name: "n", scope: !742, file: !671, line: 176, type: !73)
!748 = !{!73, !66, !67}
!749 = distinct !DICompileUnit(language: DW_LANG_C99, file: !750, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !422)
!750 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!751 = distinct !DICompileUnit(language: DW_LANG_C99, file: !752, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !422, retainedTypes: !618)
!752 = !DIFile(filename: "./lib/xfts.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!753 = distinct !DICompileUnit(language: DW_LANG_C99, file: !754, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !755)
!754 = !DIFile(filename: "./lib/xstrtoimax.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!755 = !{!19}
!756 = distinct !DICompileUnit(language: DW_LANG_C99, file: !757, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !758, retainedTypes: !759)
!757 = !DIFile(filename: "./lib/xstrtoul.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!758 = !{!19, !505}
!759 = !{!86, !283}
!760 = distinct !DICompileUnit(language: DW_LANG_C99, file: !761, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !755)
!761 = !DIFile(filename: "./lib/xstrtol-error.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!762 = distinct !DICompileUnit(language: DW_LANG_C99, file: !763, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !758, retainedTypes: !759)
!763 = !DIFile(filename: "./lib/xstrtoumax.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!764 = distinct !DICompileUnit(language: DW_LANG_C99, file: !765, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !422, retainedTypes: !618)
!765 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!766 = distinct !DICompileUnit(language: DW_LANG_C99, file: !767, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !422)
!767 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!768 = distinct !DICompileUnit(language: DW_LANG_C99, file: !769, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !422, retainedTypes: !618)
!769 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!770 = distinct !DICompileUnit(language: DW_LANG_C99, file: !771, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !422, retainedTypes: !618)
!771 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!772 = distinct !DICompileUnit(language: DW_LANG_C99, file: !773, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !774, retainedTypes: !908)
!773 = !DIFile(filename: "./lib/fts.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!774 = !{!775, !780, !785, !888, !891, !894, !905}
!775 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Fts_stat", file: !776, line: 155, baseType: !7, size: 32, elements: !777)
!776 = !DIFile(filename: "lib/fts.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!777 = !{!778, !779}
!778 = !DIEnumerator(name: "FTS_NO_STAT_REQUIRED", value: 1, isUnsigned: true)
!779 = !DIEnumerator(name: "FTS_STAT_REQUIRED", value: 2, isUnsigned: true)
!780 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "leaf_optimization", file: !776, line: 669, baseType: !7, size: 32, elements: !781)
!781 = !{!782, !783, !784}
!782 = !DIEnumerator(name: "NO_LEAF_OPTIMIZATION", value: 0, isUnsigned: true)
!783 = !DIEnumerator(name: "OK_LEAF_OPTIMIZATION", value: 1, isUnsigned: true)
!784 = !DIEnumerator(name: "NOSTAT_LEAF_OPTIMIZATION", value: 2, isUnsigned: true)
!785 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !787, file: !786, line: 54, baseType: !7, size: 32, elements: !886)
!786 = !DIFile(filename: "./lib/fts-cycle.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!787 = distinct !DISubprogram(name: "setup_dir", scope: !786, file: !786, line: 50, type: !788, isLocal: true, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: true, unit: !772, retainedNodes: !884)
!788 = !DISubroutineType(types: !789)
!789 = !{!96, !790}
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !252, line: 199, baseType: !792)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !252, line: 80, size: 1024, elements: !793)
!793 = !{!794, !840, !841, !843, !844, !845, !846, !847, !848, !849, !856, !857, !858, !875}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !792, file: !252, line: 81, baseType: !795, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !252, line: 201, size: 2112, elements: !797)
!797 = !{!798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !839}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !796, file: !252, line: 202, baseType: !795, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !796, file: !252, line: 203, baseType: !795, size: 64, offset: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !796, file: !252, line: 204, baseType: !795, size: 64, offset: 128)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !796, file: !252, line: 205, baseType: !263, size: 64, offset: 192)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !796, file: !252, line: 208, baseType: !78, size: 64, offset: 256)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !796, file: !252, line: 209, baseType: !67, size: 64, offset: 320)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !796, file: !252, line: 210, baseType: !66, size: 64, offset: 384)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !796, file: !252, line: 211, baseType: !66, size: 64, offset: 448)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !796, file: !252, line: 212, baseType: !86, size: 32, offset: 512)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !796, file: !252, line: 213, baseType: !86, size: 32, offset: 544)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !796, file: !252, line: 214, baseType: !73, size: 64, offset: 576)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !796, file: !252, line: 216, baseType: !790, size: 64, offset: 640)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !796, file: !252, line: 220, baseType: !276, size: 64, offset: 704)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !796, file: !252, line: 222, baseType: !73, size: 64, offset: 768)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "fts_n_dirs_remaining", scope: !796, file: !252, line: 227, baseType: !279, size: 64, offset: 832)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !796, file: !252, line: 243, baseType: !283, size: 16, offset: 896)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !796, file: !252, line: 247, baseType: !283, size: 16, offset: 912)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !796, file: !252, line: 253, baseType: !283, size: 16, offset: 928)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !796, file: !252, line: 255, baseType: !817, size: 1152, offset: 960)
!817 = !DICompositeType(tag: DW_TAG_array_type, baseType: !818, size: 1152, elements: !315)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !289, line: 46, size: 1152, elements: !819)
!819 = !{!820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !836, !837, !838}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !818, file: !289, line: 48, baseType: !292, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !818, file: !289, line: 53, baseType: !294, size: 64, offset: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !818, file: !289, line: 61, baseType: !281, size: 64, offset: 128)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !818, file: !289, line: 62, baseType: !297, size: 32, offset: 192)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !818, file: !289, line: 64, baseType: !299, size: 32, offset: 224)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !818, file: !289, line: 65, baseType: !301, size: 32, offset: 256)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !818, file: !289, line: 67, baseType: !86, size: 32, offset: 288)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !818, file: !289, line: 69, baseType: !292, size: 64, offset: 320)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !818, file: !289, line: 74, baseType: !305, size: 64, offset: 384)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !818, file: !289, line: 78, baseType: !307, size: 64, offset: 448)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !818, file: !289, line: 80, baseType: !309, size: 64, offset: 512)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !818, file: !289, line: 91, baseType: !832, size: 128, offset: 576)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !173, line: 9, size: 128, elements: !833)
!833 = !{!834, !835}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !832, file: !173, line: 11, baseType: !77, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !832, file: !173, line: 12, baseType: !177, size: 64, offset: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !818, file: !289, line: 92, baseType: !832, size: 128, offset: 704)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !818, file: !289, line: 93, baseType: !832, size: 128, offset: 832)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !818, file: !289, line: 106, baseType: !314, size: 192, offset: 960)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "fts_name", scope: !796, file: !252, line: 256, baseType: !318, offset: 2112)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "fts_child", scope: !792, file: !252, line: 82, baseType: !795, size: 64, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "fts_array", scope: !792, file: !252, line: 83, baseType: !842, size: 64, offset: 128)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !792, file: !252, line: 84, baseType: !325, size: 64, offset: 192)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !792, file: !252, line: 85, baseType: !66, size: 64, offset: 256)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "fts_rfd", scope: !792, file: !252, line: 86, baseType: !86, size: 32, offset: 320)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cwd_fd", scope: !792, file: !252, line: 87, baseType: !86, size: 32, offset: 352)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !792, file: !252, line: 89, baseType: !73, size: 64, offset: 384)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "fts_nitems", scope: !792, file: !252, line: 90, baseType: !73, size: 64, offset: 448)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "fts_compar", scope: !792, file: !252, line: 91, baseType: !850, size: 64, offset: 512)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DISubroutineType(types: !852)
!852 = !{!86, !853, !853}
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !796)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "fts_options", scope: !792, file: !252, line: 162, baseType: !86, size: 32, offset: 576)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "fts_leaf_optimization_works_ht", scope: !792, file: !252, line: 171, baseType: !340, size: 64, offset: 640)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !792, file: !252, line: 193, baseType: !859, size: 64, offset: 704)
!859 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !792, file: !252, line: 173, size: 64, elements: !860)
!860 = !{!861, !862}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !859, file: !252, line: 186, baseType: !340, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !859, file: !252, line: 192, baseType: !863, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cycle_check_state", file: !865, line: 28, size: 256, elements: !866)
!865 = !DIFile(filename: "./lib/cycle-check.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!866 = !{!867, !873, !874}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "dev_ino", scope: !864, file: !865, line: 30, baseType: !868, size: 128)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !869, line: 7, size: 128, elements: !870)
!869 = !DIFile(filename: "./lib/dev-ino.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!870 = !{!871, !872}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !868, file: !869, line: 9, baseType: !708, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !868, file: !869, line: 10, baseType: !325, size: 64, offset: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "chdir_counter", scope: !864, file: !865, line: 31, baseType: !68, size: 64, offset: 128)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !864, file: !865, line: 32, baseType: !86, size: 32, offset: 192)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fd_ring", scope: !792, file: !252, line: 198, baseType: !876, size: 256, offset: 768)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "I_ring", file: !351, line: 39, baseType: !877)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "I_ring", file: !351, line: 31, size: 256, elements: !878)
!878 = !{!879, !880, !881, !882, !883}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "ir_data", scope: !877, file: !351, line: 33, baseType: !355, size: 128)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "ir_default_val", scope: !877, file: !351, line: 34, baseType: !86, size: 32, offset: 128)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "ir_front", scope: !877, file: !351, line: 35, baseType: !7, size: 32, offset: 160)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "ir_back", scope: !877, file: !351, line: 36, baseType: !7, size: 32, offset: 192)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "ir_empty", scope: !877, file: !351, line: 37, baseType: !96, size: 8, offset: 224)
!884 = !{!885}
!885 = !DILocalVariable(name: "fts", arg: 1, scope: !787, file: !786, line: 50, type: !790)
!886 = !{!887}
!887 = !DIEnumerator(name: "HT_INITIAL_SIZE", value: 31, isUnsigned: true)
!888 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !776, line: 712, baseType: !7, size: 32, elements: !889)
!889 = !{!890}
!890 = !DIEnumerator(name: "DEV_TYPE_HT_INITIAL_SIZE", value: 13, isUnsigned: true)
!891 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !776, line: 666, baseType: !7, size: 32, elements: !892)
!892 = !{!893}
!893 = !DIEnumerator(name: "MIN_DIR_NLINK", value: 2, isUnsigned: true)
!894 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !265, line: 97, baseType: !7, size: 32, elements: !895)
!895 = !{!896, !897, !898, !899, !900, !901, !902, !903, !904}
!896 = !DIEnumerator(name: "DT_UNKNOWN", value: 0, isUnsigned: true)
!897 = !DIEnumerator(name: "DT_FIFO", value: 1, isUnsigned: true)
!898 = !DIEnumerator(name: "DT_CHR", value: 2, isUnsigned: true)
!899 = !DIEnumerator(name: "DT_DIR", value: 4, isUnsigned: true)
!900 = !DIEnumerator(name: "DT_BLK", value: 6, isUnsigned: true)
!901 = !DIEnumerator(name: "DT_REG", value: 8, isUnsigned: true)
!902 = !DIEnumerator(name: "DT_LNK", value: 10, isUnsigned: true)
!903 = !DIEnumerator(name: "DT_SOCK", value: 12, isUnsigned: true)
!904 = !DIEnumerator(name: "DT_WHT", value: 14, isUnsigned: true)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !776, line: 150, baseType: !7, size: 32, elements: !906)
!906 = !{!907}
!907 = !DIEnumerator(name: "_FTS_INODE_SORT_DIR_ENTRIES_THRESHOLD", value: 10000, isUnsigned: true)
!908 = !{!67, !279, !68, !66, !78, !909, !912}
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DISubroutineType(types: !911)
!911 = !{!86, !659, !659}
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !915)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTSENT", file: !252, line: 257, baseType: !796)
!916 = distinct !DICompileUnit(language: DW_LANG_C99, file: !917, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !422, retainedTypes: !715)
!917 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!918 = distinct !DICompileUnit(language: DW_LANG_C99, file: !919, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !422, retainedTypes: !920)
!919 = !DIFile(filename: "./lib/mountlist.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!920 = !{!67, !292}
!921 = distinct !DICompileUnit(language: DW_LANG_C99, file: !922, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !923, retainedTypes: !928, globals: !929)
!922 = !DIFile(filename: "./lib/time_rz.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!923 = !{!924}
!924 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !925, line: 50, baseType: !7, size: 32, elements: !926)
!925 = !DIFile(filename: "lib/time_rz.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!926 = !{!927}
!927 = !DIEnumerator(name: "ABBR_SIZE_MIN", value: 119, isUnsigned: true)
!928 = !{!66, !73}
!929 = !{!930}
!930 = !DIGlobalVariableExpression(var: !931, expr: !DIExpression())
!931 = distinct !DIGlobalVariable(name: "local_tz", scope: !921, file: !925, line: 55, type: !932, isLocal: true, isDefinition: true)
!932 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !933)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !160, line: 742, baseType: !934)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !936, line: 21, size: 128, elements: !937)
!936 = !DIFile(filename: "./lib/time-internal.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!937 = !{!938, !939, !940}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !935, file: !936, line: 25, baseType: !934, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "tz_is_set", scope: !935, file: !936, line: 36, baseType: !65, size: 8, offset: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "abbrs", scope: !935, file: !936, line: 48, baseType: !318, offset: 72)
!941 = distinct !DICompileUnit(language: DW_LANG_C99, file: !942, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !422)
!942 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!943 = distinct !DICompileUnit(language: DW_LANG_C99, file: !944, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !422)
!944 = !DIFile(filename: "./lib/cycle-check.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!945 = distinct !DICompileUnit(language: DW_LANG_C99, file: !946, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !422)
!946 = !DIFile(filename: "./lib/open-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!947 = distinct !DICompileUnit(language: DW_LANG_C99, file: !948, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !422)
!948 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!949 = distinct !DICompileUnit(language: DW_LANG_C99, file: !950, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !951)
!950 = !DIFile(filename: "./lib/i-ring.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!951 = !{!952}
!952 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !351, line: 20, baseType: !7, size: 32, elements: !953)
!953 = !{!954}
!954 = !DIEnumerator(name: "I_RING_SIZE", value: 4, isUnsigned: true)
!955 = distinct !DICompileUnit(language: DW_LANG_C99, file: !956, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !957, retainedTypes: !618)
!956 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!957 = !{!958}
!958 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !959, line: 41, baseType: !7, size: 32, elements: !960)
!959 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!960 = !{!961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343}
!961 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!962 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!963 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!964 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!965 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!966 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!967 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!968 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!969 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!970 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!971 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!972 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!973 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!974 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!975 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!976 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!977 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!978 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!979 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!980 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!981 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!982 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!983 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!984 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!985 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!986 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!987 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!988 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!989 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!990 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!991 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!992 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!993 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!994 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!995 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!996 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!997 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!998 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!999 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!1000 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!1001 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!1002 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!1003 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!1004 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!1005 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!1006 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!1007 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!1008 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!1009 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!1010 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!1011 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!1012 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!1013 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!1014 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!1015 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!1016 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!1017 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!1018 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!1019 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!1020 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!1021 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!1022 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!1023 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!1024 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!1025 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!1026 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!1027 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!1028 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!1029 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!1030 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!1031 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!1032 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!1033 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!1034 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!1035 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!1036 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!1037 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!1038 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!1039 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!1040 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!1041 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!1042 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!1043 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!1044 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!1045 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!1046 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!1047 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!1048 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!1049 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!1050 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!1051 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!1052 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!1053 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!1054 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!1055 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!1056 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!1057 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!1058 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!1059 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!1060 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!1061 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!1062 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!1063 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!1064 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!1065 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!1066 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!1067 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!1068 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!1069 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!1070 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!1071 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!1072 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!1073 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!1074 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!1075 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!1076 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!1077 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!1078 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!1079 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!1080 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!1081 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!1082 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!1083 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!1084 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!1085 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!1086 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!1087 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!1088 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!1089 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!1090 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!1091 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!1092 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!1093 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!1094 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!1095 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!1096 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!1097 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!1098 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!1099 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!1100 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!1101 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!1102 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!1103 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!1104 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
