; ModuleID = 'coreutils-8.32/src/env.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.__sigset_t = type { [16 x i64] }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.numname = type { i32, [8 x i8] }
%struct.sigaction = type { %union.anon, %struct.__sigset_t, i32, void ()* }
%union.anon = type { void (i32)* }
%struct.__mbstate_t = type { i32, %union.anon.8 }
%union.anon.8 = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [62 x i8] c"Usage: %s [OPTION]... [-] [NAME=VALUE]... [COMMAND [ARG]...]\0A\00", align 1

!12 = !DIEnumerator(name: "EXIT_ENOENT", value: 127, isUnsigned: true)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !14, line: 32, baseType: !7, size: 32, elements: !15)
!14 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!15 = !{!16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26}
!16 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!17 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!20 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!21 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!22 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!23 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!24 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!25 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!26 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "SIGNAL_MODE", file: !3, line: 55, baseType: !7, size: 32, elements: !28)
!28 = !{!29, !30, !31, !32, !33}
!29 = !DIEnumerator(name: "UNCHANGED", value: 0, isUnsigned: true)
!30 = !DIEnumerator(name: "DEFAULT", value: 1, isUnsigned: true)
!31 = !DIEnumerator(name: "DEFAULT_NOERR", value: 2, isUnsigned: true)
!32 = !DIEnumerator(name: "IGNORE", value: 3, isUnsigned: true)
!33 = !DIEnumerator(name: "IGNORE_NOERR", value: 4, isUnsigned: true)
!34 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !36, file: !35, line: 186, baseType: !7, size: 32, elements: !49)
!35 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!36 = distinct !DISubprogram(name: "x2nrealloc", scope: !35, file: !35, line: 174, type: !37, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !44)
!37 = !DISubroutineType(types: !38)
!38 = !{!39, !39, !40, !41}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !42, line: 46, baseType: !43)
!42 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!43 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!44 = !{!45, !46, !47, !48}
!45 = !DILocalVariable(name: "p", arg: 1, scope: !36, file: !35, line: 174, type: !39)
!46 = !DILocalVariable(name: "pn", arg: 2, scope: !36, file: !35, line: 174, type: !40)
!47 = !DILocalVariable(name: "s", arg: 3, scope: !36, file: !35, line: 174, type: !41)
!48 = !DILocalVariable(name: "n", scope: !36, file: !35, line: 176, type: !41)
!49 = !{!50}
!50 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !52, line: 46, baseType: !7, size: 32, elements: !53)
!52 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!53 = !{!54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65}
!54 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!55 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!56 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!57 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!58 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!59 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!60 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!61 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!62 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!63 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!64 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!65 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!66 = !{!67, !77, !134, !138, !142, !145, !148, !155, !170, !71, !39, !174, !178, !181, !185, !188, !192, !195, !41, !198, !199, !202, !206, !207, !211, !214, !226, !227, !230, !75, !108, !231, !232, !233, !245, !335, !340}
!67 = !DISubprogram(name: "dcgettext", scope: !68, file: !68, line: 51, type: !69, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !76)
!68 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!69 = !DISubroutineType(types: !70)
!70 = !{!71, !73, !73, !75}
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!75 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!76 = !{}
!77 = !DISubprogram(name: "fputs_unlocked", scope: !78, file: !78, line: 662, type: !79, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !76)
!78 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!79 = !DISubroutineType(types: !80)
!80 = !{!75, !73, !81}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !83, line: 49, size: 1728, elements: !84)
!83 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!84 = !{!85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !100, !101, !102, !103, !107, !109, !111, !115, !118, !120, !123, !126, !127, !128, !129, !130}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !82, file: !83, line: 51, baseType: !75, size: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !82, file: !83, line: 54, baseType: !71, size: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !82, file: !83, line: 55, baseType: !71, size: 64, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !82, file: !83, line: 56, baseType: !71, size: 64, offset: 192)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !82, file: !83, line: 57, baseType: !71, size: 64, offset: 256)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !82, file: !83, line: 58, baseType: !71, size: 64, offset: 320)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !82, file: !83, line: 59, baseType: !71, size: 64, offset: 384)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !82, file: !83, line: 60, baseType: !71, size: 64, offset: 448)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !82, file: !83, line: 61, baseType: !71, size: 64, offset: 512)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !82, file: !83, line: 64, baseType: !71, size: 64, offset: 576)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !82, file: !83, line: 65, baseType: !71, size: 64, offset: 640)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !82, file: !83, line: 66, baseType: !71, size: 64, offset: 704)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !82, file: !83, line: 68, baseType: !98, size: 64, offset: 768)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !83, line: 36, flags: DIFlagFwdDecl)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !82, file: !83, line: 70, baseType: !81, size: 64, offset: 832)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !82, file: !83, line: 72, baseType: !75, size: 32, offset: 896)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !82, file: !83, line: 73, baseType: !75, size: 32, offset: 928)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !82, file: !83, line: 74, baseType: !104, size: 64, offset: 960)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !105, line: 152, baseType: !106)
!105 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!106 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !82, file: !83, line: 77, baseType: !108, size: 16, offset: 1024)
!108 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !82, file: !83, line: 78, baseType: !110, size: 8, offset: 1040)
!110 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !82, file: !83, line: 79, baseType: !112, size: 8, offset: 1048)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 8, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 1)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !82, file: !83, line: 81, baseType: !116, size: 64, offset: 1088)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !83, line: 43, baseType: null)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !82, file: !83, line: 89, baseType: !119, size: 64, offset: 1152)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !105, line: 153, baseType: !106)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !82, file: !83, line: 91, baseType: !121, size: 64, offset: 1216)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !83, line: 37, flags: DIFlagFwdDecl)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !82, file: !83, line: 92, baseType: !124, size: 64, offset: 1280)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !83, line: 38, flags: DIFlagFwdDecl)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !82, file: !83, line: 93, baseType: !81, size: 64, offset: 1344)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !82, file: !83, line: 94, baseType: !39, size: 64, offset: 1408)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !82, file: !83, line: 95, baseType: !41, size: 64, offset: 1472)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !82, file: !83, line: 96, baseType: !75, size: 32, offset: 1536)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !82, file: !83, line: 98, baseType: !131, size: 160, offset: 1568)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 160, elements: !132)
!132 = !{!133}
!133 = !DISubrange(count: 20)
!134 = !DISubprogram(name: "set_program_name", scope: !135, file: !135, line: 37, type: !136, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !76)
!135 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!136 = !DISubroutineType(types: !137)
!137 = !{null, !73}
!138 = !DISubprogram(name: "setlocale", scope: !139, file: !139, line: 122, type: !140, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !76)
!139 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!140 = !DISubroutineType(types: !141)
!141 = !{!71, !75, !73}
!142 = !DISubprogram(name: "bindtextdomain", scope: !68, file: !68, line: 86, type: !143, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !76)
!143 = !DISubroutineType(types: !144)
!144 = !{!71, !73, !73}
!145 = !DISubprogram(name: "textdomain", scope: !68, file: !68, line: 82, type: !146, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !76)
!146 = !DISubroutineType(types: !147)
!147 = !{!71, !73}
!148 = !DISubprogram(name: "atexit", scope: !149, file: !149, line: 595, type: !150, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !76)
!149 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!150 = !DISubroutineType(types: !151)
!151 = !{!75, !152}
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{null}
!155 = !DISubprogram(name: "getopt_long", scope: !156, file: !156, line: 66, type: !157, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !76)
!156 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!157 = !DISubroutineType(types: !158)
!158 = !{!75, !75, !159, !73, !161, !168}
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !71)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !163)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !156, line: 50, size: 256, elements: !164)
!164 = !{!165, !166, !167, !169}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !163, file: !156, line: 52, baseType: !73, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !163, file: !156, line: 55, baseType: !75, size: 32, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !163, file: !156, line: 56, baseType: !168, size: 64, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !163, file: !156, line: 57, baseType: !75, size: 32, offset: 192)
!170 = !DISubprogram(name: "error", scope: !171, file: !171, line: 52, type: !172, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !76)
!171 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!172 = !DISubroutineType(types: !173)
!173 = !{null, !75, !75, !73, null}
!174 = !DISubprogram(name: "version_etc", scope: !175, file: !175, line: 69, type: !176, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !76)
!175 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!176 = !DISubroutineType(types: !177)
!177 = !{null, !81, !73, !73, !73, null}
!178 = !DISubprogram(name: "putenv", scope: !149, file: !149, line: 647, type: !179, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !76)
!179 = !DISubroutineType(types: !180)
!180 = !{!75, !71}
!181 = !DISubprogram(name: "quote", scope: !182, file: !182, line: 44, type: !183, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !76)
!182 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!183 = !DISubroutineType(types: !184)
!184 = !{!73, !73}
!185 = !DISubprogram(name: "quotearg_style", scope: !14, file: !14, line: 377, type: !186, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !76)
!186 = !DISubroutineType(types: !187)
!187 = !{!71, !13, !73}
!188 = !DISubprogram(name: "chdir", scope: !189, file: !189, line: 497, type: !190, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !76)
!189 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!190 = !DISubroutineType(types: !191)
!191 = !{!75, !73}
!192 = !DISubprogram(name: "execvp", scope: !189, file: !189, line: 578, type: !193, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !76)
!193 = !DISubroutineType(types: !194)
!194 = !{!75, !73, !159}
!195 = !DISubprogram(name: "xmalloc", scope: !35, file: !35, line: 53, type: !196, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !76)
!196 = !DISubroutineType(types: !197)
!197 = !{!39, !43}
!198 = !DISubprogram(name: "xalloc_die", scope: !35, file: !35, line: 51, type: !153, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !76)
!199 = !DISubprogram(name: "xrealloc", scope: !35, file: !35, line: 59, type: !200, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !76)
!200 = !DISubroutineType(types: !201)
!201 = !{!39, !39, !43}
!202 = !DISubprogram(name: "sig2str", scope: !203, file: !203, line: 34, type: !204, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !76)
!203 = !DIFile(filename: "./lib/sig2str.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!204 = !DISubroutineType(types: !205)
!205 = !{!75, !75, !71}
!206 = !DISubprogram(name: "xstrdup", scope: !35, file: !35, line: 64, type: !146, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !76)
!207 = !DISubprogram(name: "operand2sig", scope: !208, file: !208, line: 18, type: !209, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !76)
!208 = !DIFile(filename: "src/operand2sig.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!209 = !DISubroutineType(types: !210)
!210 = !{!75, !73, !71}
!211 = !DISubprogram(name: "free", scope: !149, file: !149, line: 565, type: !212, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !76)
!212 = !DISubroutineType(types: !213)
!213 = !{null, !39}
!214 = !DISubprogram(name: "sigfillset", scope: !215, file: !215, line: 199, type: !216, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !76)
!215 = !DIFile(filename: "/usr/include/signal.h", directory: "")
!216 = !DISubroutineType(types: !217)
!217 = !{!75, !218}
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !220, line: 5, size: 1024, elements: !221)
!220 = !DIFile(filename: "/usr/include/bits/types/__sigset_t.h", directory: "")
!221 = !{!222}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !219, file: !220, line: 7, baseType: !223, size: 1024)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 1024, elements: !224)
!224 = !{!225}
!225 = !DISubrange(count: 16)
!226 = !DISubprogram(name: "sigemptyset", scope: !215, file: !215, line: 196, type: !216, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !76)
!227 = !DISubprogram(name: "sigaddset", scope: !215, file: !215, line: 202, type: !228, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !76)
!228 = !DISubroutineType(types: !229)
!229 = !{!75, !218, !75}
!230 = !DISubprogram(name: "sigdelset", scope: !215, file: !215, line: 205, type: !228, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !76)
!231 = !DISubprogram(name: "getenv", scope: !149, file: !149, line: 634, type: !146, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !76)
!232 = !DISubprogram(name: "unsetenv", scope: !149, file: !149, line: 657, type: !190, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !76)
!233 = !DISubprogram(name: "sigaction", scope: !215, file: !215, line: 240, type: !234, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !76)
!234 = !DISubroutineType(types: !235)
!235 = !{!75, !75, !236, !334}
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !238)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !239, line: 27, size: 1216, elements: !240)
!239 = !DIFile(filename: "/usr/include/bits/sigaction.h", directory: "")
!240 = !{!241, !330, !332, !333}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !238, file: !239, line: 38, baseType: !242, size: 64)
!242 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !238, file: !239, line: 31, size: 64, elements: !243)
!243 = !{!244, !249}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !242, file: !239, line: 34, baseType: !245, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !215, line: 72, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{null, !75}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !242, file: !239, line: 36, baseType: !250, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DISubroutineType(types: !252)
!252 = !{null, !75, !253, !39}
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !255, line: 124, baseType: !256)
!255 = !DIFile(filename: "/usr/include/bits/types/siginfo_t.h", directory: "")
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !255, line: 36, size: 1024, elements: !257)
!257 = !{!258, !259, !260, !261, !262}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !256, file: !255, line: 38, baseType: !75, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !256, file: !255, line: 40, baseType: !75, size: 32, offset: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !256, file: !255, line: 42, baseType: !75, size: 32, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !256, file: !255, line: 48, baseType: !75, size: 32, offset: 96)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !256, file: !255, line: 123, baseType: !263, size: 896, offset: 128)
!263 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !256, file: !255, line: 51, size: 896, elements: !264)
!264 = !{!265, !269, !276, !288, !294, !303, !319, !324}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !263, file: !255, line: 53, baseType: !266, size: 896)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 896, elements: !267)
!267 = !{!268}
!268 = !DISubrange(count: 28)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !263, file: !255, line: 60, baseType: !270, size: 64)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !263, file: !255, line: 56, size: 64, elements: !271)
!271 = !{!272, !274}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !270, file: !255, line: 58, baseType: !273, size: 32)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !105, line: 154, baseType: !75)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !270, file: !255, line: 59, baseType: !275, size: 32, offset: 32)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !105, line: 146, baseType: !7)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !263, file: !255, line: 68, baseType: !277, size: 128)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !263, file: !255, line: 63, size: 128, elements: !278)
!278 = !{!279, !280, !281}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !277, file: !255, line: 65, baseType: !75, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !277, file: !255, line: 66, baseType: !75, size: 32, offset: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !277, file: !255, line: 67, baseType: !282, size: 64, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigval_t", file: !283, line: 30, baseType: !284)
!283 = !DIFile(filename: "/usr/include/bits/types/__sigval_t.h", directory: "")
!284 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !283, line: 24, size: 64, elements: !285)
!285 = !{!286, !287}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !284, file: !283, line: 26, baseType: !75, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !284, file: !283, line: 27, baseType: !39, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !263, file: !255, line: 76, baseType: !289, size: 128)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !263, file: !255, line: 71, size: 128, elements: !290)
!290 = !{!291, !292, !293}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !289, file: !255, line: 73, baseType: !273, size: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !289, file: !255, line: 74, baseType: !275, size: 32, offset: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !289, file: !255, line: 75, baseType: !282, size: 64, offset: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !263, file: !255, line: 86, baseType: !295, size: 256)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !263, file: !255, line: 79, size: 256, elements: !296)
!296 = !{!297, !298, !299, !300, !302}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !295, file: !255, line: 81, baseType: !273, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !295, file: !255, line: 82, baseType: !275, size: 32, offset: 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !295, file: !255, line: 83, baseType: !75, size: 32, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !295, file: !255, line: 84, baseType: !301, size: 64, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !105, line: 156, baseType: !106)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !295, file: !255, line: 85, baseType: !301, size: 64, offset: 192)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !263, file: !255, line: 105, baseType: !304, size: 256)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !263, file: !255, line: 89, size: 256, elements: !305)
!305 = !{!306, !307, !309}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !304, file: !255, line: 91, baseType: !39, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_lsb", scope: !304, file: !255, line: 93, baseType: !308, size: 16, offset: 64)
!308 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_bounds", scope: !304, file: !255, line: 104, baseType: !310, size: 128, offset: 128)
!310 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !304, file: !255, line: 94, size: 128, elements: !311)
!311 = !{!312, !317}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_bnd", scope: !310, file: !255, line: 101, baseType: !313, size: 128)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !310, file: !255, line: 97, size: 128, elements: !314)
!314 = !{!315, !316}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_lower", scope: !313, file: !255, line: 99, baseType: !39, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_upper", scope: !313, file: !255, line: 100, baseType: !39, size: 64, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_pkey", scope: !310, file: !255, line: 103, baseType: !318, size: 32)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !105, line: 42, baseType: !7)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !263, file: !255, line: 112, baseType: !320, size: 128)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !263, file: !255, line: 108, size: 128, elements: !321)
!321 = !{!322, !323}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !320, file: !255, line: 110, baseType: !106, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "si_fd", scope: !320, file: !255, line: 111, baseType: !75, size: 32, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !263, file: !255, line: 121, baseType: !325, size: 128)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !263, file: !255, line: 116, size: 128, elements: !326)
!326 = !{!327, !328, !329}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !325, file: !255, line: 118, baseType: !39, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !325, file: !255, line: 119, baseType: !75, size: 32, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !325, file: !255, line: 120, baseType: !7, size: 32, offset: 96)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !238, file: !239, line: 46, baseType: !331, size: 1024, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !220, line: 8, baseType: !219)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !238, file: !239, line: 49, baseType: !75, size: 32, offset: 1088)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !238, file: !239, line: 52, baseType: !152, size: 64, offset: 1152)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!335 = !DISubprogram(name: "sigprocmask", scope: !215, file: !215, line: 229, type: !336, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !76)
!336 = !DISubroutineType(types: !337)
!337 = !{!75, !75, !338, !218}
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !219)
!340 = !DISubprogram(name: "sigismember", scope: !215, file: !215, line: 208, type: !341, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !76)
!341 = !DISubroutineType(types: !342)
!342 = !{!75, !338, !75}
!343 = !{!344, !369, !371, !373, !0, !375, !380, !383, !385, !387, !390, !394, !396, !398}
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "dummy_environ", scope: !346, file: !3, line: 877, type: !368, isLocal: true, isDefinition: true)
!346 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 798, type: !347, scopeLine: 799, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !350)
!347 = !DISubroutineType(types: !348)
!348 = !{!75, !75, !349}
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!350 = !{!351, !352, !353, !354, !356, !357, !358, !359, !360, !363, !367}
!351 = !DILocalVariable(name: "argc", arg: 1, scope: !346, file: !3, line: 798, type: !75)
!352 = !DILocalVariable(name: "argv", arg: 2, scope: !346, file: !3, line: 798, type: !349)
!353 = !DILocalVariable(name: "optc", scope: !346, file: !3, line: 800, type: !75)
!354 = !DILocalVariable(name: "ignore_environment", scope: !346, file: !3, line: 801, type: !355)
!355 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!356 = !DILocalVariable(name: "opt_nul_terminate_output", scope: !346, file: !3, line: 802, type: !355)
!357 = !DILocalVariable(name: "newdir", scope: !346, file: !3, line: 803, type: !73)
!358 = !DILocalVariable(name: "eq", scope: !346, file: !3, line: 883, type: !71)
!359 = !DILocalVariable(name: "program_specified", scope: !346, file: !3, line: 897, type: !355)
!360 = !DILocalVariable(name: "e", scope: !361, file: !3, line: 914, type: !159)
!361 = distinct !DILexicalBlock(scope: !362, file: !3, line: 912, column: 5)
!362 = distinct !DILexicalBlock(scope: !346, file: !3, line: 911, column: 7)
!363 = !DILocalVariable(name: "i", scope: !364, file: !3, line: 939, type: !75)
!364 = distinct !DILexicalBlock(scope: !365, file: !3, line: 939, column: 7)
!365 = distinct !DILexicalBlock(scope: !366, file: !3, line: 937, column: 5)
!366 = distinct !DILexicalBlock(scope: !346, file: !3, line: 936, column: 7)
!367 = !DILocalVariable(name: "exit_status", scope: !346, file: !3, line: 945, type: !75)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 64, elements: !113)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(name: "dev_debug", scope: !2, file: !3, line: 48, type: !355, isLocal: true, isDefinition: true)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(name: "sig_mask_changed", scope: !2, file: !3, line: 71, type: !355, isLocal: true, isDefinition: true)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "report_signal_handling", scope: !2, file: !3, line: 74, type: !355, isLocal: true, isDefinition: true)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(name: "shortopts", scope: !2, file: !3, line: 76, type: !377, isLocal: true, isDefinition: true)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 104, elements: !378)
!378 = !{!379}
!379 = !DISubrange(count: 13)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 88, type: !382, isLocal: true, isDefinition: true)
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !162, size: 3328, elements: !378)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(name: "usvars_used", scope: !2, file: !3, line: 45, type: !41, isLocal: true, isDefinition: true)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "usvars_alloc", scope: !2, file: !3, line: 44, type: !41, isLocal: true, isDefinition: true)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "usvars", scope: !2, file: !3, line: 43, type: !389, isLocal: true, isDefinition: true)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(name: "block_signals", scope: !2, file: !3, line: 65, type: !392, isLocal: true, isDefinition: true)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !393, line: 7, baseType: !331)
!393 = !DIFile(filename: "/usr/include/bits/types/sigset_t.h", directory: "")
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(name: "unblock_signals", scope: !2, file: !3, line: 68, type: !392, isLocal: true, isDefinition: true)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(name: "vnlen", scope: !2, file: !3, line: 52, type: !41, isLocal: true, isDefinition: true)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "varname", scope: !2, file: !3, line: 51, type: !71, isLocal: true, isDefinition: true)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!401 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!402 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!403 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(name: "Version", scope: !406, file: !407, line: 2, type: !73, isLocal: false, isDefinition: true)
!406 = distinct !DICompileUnit(language: DW_LANG_C99, file: !407, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !76, globals: !408, splitDebugInlining: false, nameTableKind: None)
!407 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!408 = !{!404}
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(name: "file_name", scope: !411, file: !412, line: 46, type: !73, isLocal: true, isDefinition: true)
!411 = distinct !DICompileUnit(language: DW_LANG_C99, file: !412, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !76, retainedTypes: !413, globals: !451, splitDebugInlining: false, nameTableKind: None)
!412 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!413 = !{!414, !67, !450, !170}
!414 = !DISubprogram(name: "close_stream", scope: !415, file: !415, line: 2, type: !416, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !76)
!415 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!416 = !DISubroutineType(types: !417)
!417 = !{!75, !418}
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !83, line: 49, size: 1728, elements: !420)
!420 = !{!421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !419, file: !83, line: 51, baseType: !75, size: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !419, file: !83, line: 54, baseType: !71, size: 64, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !419, file: !83, line: 55, baseType: !71, size: 64, offset: 128)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !419, file: !83, line: 56, baseType: !71, size: 64, offset: 192)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !419, file: !83, line: 57, baseType: !71, size: 64, offset: 256)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !419, file: !83, line: 58, baseType: !71, size: 64, offset: 320)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !419, file: !83, line: 59, baseType: !71, size: 64, offset: 384)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !419, file: !83, line: 60, baseType: !71, size: 64, offset: 448)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !419, file: !83, line: 61, baseType: !71, size: 64, offset: 512)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !419, file: !83, line: 64, baseType: !71, size: 64, offset: 576)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !419, file: !83, line: 65, baseType: !71, size: 64, offset: 640)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !419, file: !83, line: 66, baseType: !71, size: 64, offset: 704)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !419, file: !83, line: 68, baseType: !98, size: 64, offset: 768)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !419, file: !83, line: 70, baseType: !418, size: 64, offset: 832)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !419, file: !83, line: 72, baseType: !75, size: 32, offset: 896)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !419, file: !83, line: 73, baseType: !75, size: 32, offset: 928)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !419, file: !83, line: 74, baseType: !104, size: 64, offset: 960)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !419, file: !83, line: 77, baseType: !108, size: 16, offset: 1024)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !419, file: !83, line: 78, baseType: !110, size: 8, offset: 1040)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !419, file: !83, line: 79, baseType: !112, size: 8, offset: 1048)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !419, file: !83, line: 81, baseType: !116, size: 64, offset: 1088)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !419, file: !83, line: 89, baseType: !119, size: 64, offset: 1152)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !419, file: !83, line: 91, baseType: !121, size: 64, offset: 1216)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !419, file: !83, line: 92, baseType: !124, size: 64, offset: 1280)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !419, file: !83, line: 93, baseType: !418, size: 64, offset: 1344)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !419, file: !83, line: 94, baseType: !39, size: 64, offset: 1408)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !419, file: !83, line: 95, baseType: !41, size: 64, offset: 1472)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !419, file: !83, line: 96, baseType: !75, size: 32, offset: 1536)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !419, file: !83, line: 98, baseType: !131, size: 160, offset: 1568)
!450 = !DISubprogram(name: "quotearg_colon", scope: !14, file: !14, line: 391, type: !146, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !76)
!451 = !{!409, !452}
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !411, file: !412, line: 56, type: !355, isLocal: true, isDefinition: true)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(name: "exit_failure", scope: !456, file: !457, line: 24, type: !459, isLocal: false, isDefinition: true)
!456 = distinct !DICompileUnit(language: DW_LANG_C99, file: !457, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !76, globals: !458, splitDebugInlining: false, nameTableKind: None)
!457 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!458 = !{!454}
!459 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !75)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(name: "program_name", scope: !462, file: !463, line: 33, type: !73, isLocal: false, isDefinition: true)
!462 = distinct !DICompileUnit(language: DW_LANG_C99, file: !463, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !76, retainedTypes: !464, globals: !500, splitDebugInlining: false, nameTableKind: None)
!463 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!464 = !{!39, !465, !71}
!465 = !DISubprogram(name: "fputs", scope: !78, file: !78, line: 626, type: !466, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !76)
!466 = !DISubroutineType(types: !467)
!467 = !{!75, !73, !468}
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !83, line: 49, size: 1728, elements: !470)
!470 = !{!471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !469, file: !83, line: 51, baseType: !75, size: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !469, file: !83, line: 54, baseType: !71, size: 64, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !469, file: !83, line: 55, baseType: !71, size: 64, offset: 128)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !469, file: !83, line: 56, baseType: !71, size: 64, offset: 192)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !469, file: !83, line: 57, baseType: !71, size: 64, offset: 256)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !469, file: !83, line: 58, baseType: !71, size: 64, offset: 320)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !469, file: !83, line: 59, baseType: !71, size: 64, offset: 384)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !469, file: !83, line: 60, baseType: !71, size: 64, offset: 448)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !469, file: !83, line: 61, baseType: !71, size: 64, offset: 512)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !469, file: !83, line: 64, baseType: !71, size: 64, offset: 576)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !469, file: !83, line: 65, baseType: !71, size: 64, offset: 640)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !469, file: !83, line: 66, baseType: !71, size: 64, offset: 704)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !469, file: !83, line: 68, baseType: !98, size: 64, offset: 768)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !469, file: !83, line: 70, baseType: !468, size: 64, offset: 832)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !469, file: !83, line: 72, baseType: !75, size: 32, offset: 896)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !469, file: !83, line: 73, baseType: !75, size: 32, offset: 928)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !469, file: !83, line: 74, baseType: !104, size: 64, offset: 960)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !469, file: !83, line: 77, baseType: !108, size: 16, offset: 1024)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !469, file: !83, line: 78, baseType: !110, size: 8, offset: 1040)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !469, file: !83, line: 79, baseType: !112, size: 8, offset: 1048)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !469, file: !83, line: 81, baseType: !116, size: 64, offset: 1088)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !469, file: !83, line: 89, baseType: !119, size: 64, offset: 1152)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !469, file: !83, line: 91, baseType: !121, size: 64, offset: 1216)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !469, file: !83, line: 92, baseType: !124, size: 64, offset: 1280)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !469, file: !83, line: 93, baseType: !468, size: 64, offset: 1344)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !469, file: !83, line: 94, baseType: !39, size: 64, offset: 1408)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !469, file: !83, line: 95, baseType: !41, size: 64, offset: 1472)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !469, file: !83, line: 96, baseType: !75, size: 32, offset: 1536)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !469, file: !83, line: 98, baseType: !131, size: 160, offset: 1568)
!500 = !{!460}
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !503, file: !504, line: 85, type: !598, isLocal: false, isDefinition: true)
!503 = distinct !DICompileUnit(language: DW_LANG_C99, file: !504, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !505, retainedTypes: !511, globals: !571, splitDebugInlining: false, nameTableKind: None)
!504 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!505 = !{!13, !506, !51}
!506 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !14, line: 242, baseType: !7, size: 32, elements: !507)
!507 = !{!508, !509, !510}
!508 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!509 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!510 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!511 = !{!512, !517, !211, !533, !75, !108, !536, !41, !553, !557, !67, !563, !567, !71, !195, !198, !199}
!512 = !DISubprogram(name: "xmemdup", scope: !35, file: !35, line: 62, type: !513, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !76)
!513 = !DISubroutineType(types: !514)
!514 = !{!39, !515, !43}
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!517 = !DISubprogram(name: "quotearg_alloc_mem", scope: !14, file: !14, line: 342, type: !518, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !76)
!518 = !DISubroutineType(types: !519)
!519 = !{!71, !73, !43, !520, !521}
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !523)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !504, line: 65, size: 448, elements: !524)
!524 = !{!525, !526, !527, !531, !532}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !523, file: !504, line: 68, baseType: !13, size: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !523, file: !504, line: 71, baseType: !75, size: 32, offset: 32)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !523, file: !504, line: 75, baseType: !528, size: 256, offset: 64)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !529)
!529 = !{!530}
!530 = !DISubrange(count: 8)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !523, file: !504, line: 78, baseType: !73, size: 64, offset: 320)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !523, file: !504, line: 81, baseType: !73, size: 64, offset: 384)
!533 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !14, file: !14, line: 408, type: !534, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !76)
!534 = !DISubroutineType(types: !535)
!535 = !{!71, !75, !73, !73, !73, !43}
!536 = !DISubprogram(name: "rpl_mbrtowc", scope: !537, file: !537, line: 717, type: !538, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !76)
!537 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!538 = !DISubroutineType(types: !539)
!539 = !{!43, !168, !73, !43, !540}
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !542, line: 13, size: 64, elements: !543)
!542 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!543 = !{!544, !545}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !541, file: !542, line: 15, baseType: !75, size: 32)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !541, file: !542, line: 20, baseType: !546, size: 32, offset: 32)
!546 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !541, file: !542, line: 16, size: 32, elements: !547)
!547 = !{!548, !549}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !546, file: !542, line: 18, baseType: !7, size: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !546, file: !542, line: 19, baseType: !550, size: 32)
!550 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !551)
!551 = !{!552}
!552 = !DISubrange(count: 4)
!553 = !DISubprogram(name: "iswprint", scope: !554, file: !554, line: 120, type: !555, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !76)
!554 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!555 = !DISubroutineType(types: !556)
!556 = !{!75, !7}
!557 = !DISubprogram(name: "mbsinit", scope: !558, file: !558, line: 292, type: !559, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !76)
!558 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!559 = !DISubroutineType(types: !560)
!560 = !{!75, !561}
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !541)
!563 = !DISubprogram(name: "locale_charset", scope: !564, file: !564, line: 35, type: !565, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !76)
!564 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!565 = !DISubroutineType(types: !566)
!566 = !{!73}
!567 = !DISubprogram(name: "c_strcasecmp", scope: !568, file: !568, line: 42, type: !569, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !76)
!568 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!569 = !DISubroutineType(types: !570)
!570 = !{!75, !73, !73}
!571 = !{!501, !572, !578, !580, !582, !587, !594, !596}
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !503, file: !504, line: 101, type: !574, isLocal: false, isDefinition: true)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !575, size: 320, elements: !576)
!575 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!576 = !{!577}
!577 = !DISubrange(count: 10)
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !503, file: !504, line: 1052, type: !523, isLocal: false, isDefinition: true)
!580 = !DIGlobalVariableExpression(var: !581, expr: !DIExpression())
!581 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !503, file: !504, line: 116, type: !523, isLocal: true, isDefinition: true)
!582 = !DIGlobalVariableExpression(var: !583, expr: !DIExpression())
!583 = distinct !DIGlobalVariable(name: "slot0", scope: !503, file: !504, line: 842, type: !584, isLocal: true, isDefinition: true)
!584 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 2048, elements: !585)
!585 = !{!586}
!586 = !DISubrange(count: 256)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(name: "slotvec", scope: !503, file: !504, line: 845, type: !589, isLocal: true, isDefinition: true)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !504, line: 834, size: 128, elements: !591)
!591 = !{!592, !593}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !590, file: !504, line: 836, baseType: !41, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !590, file: !504, line: 837, baseType: !71, size: 64, offset: 64)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(name: "nslots", scope: !503, file: !504, line: 843, type: !75, isLocal: true, isDefinition: true)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(name: "slotvec0", scope: !503, file: !504, line: 844, type: !590, isLocal: true, isDefinition: true)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !599, size: 704, elements: !600)
!599 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !73)
!600 = !{!601}
!601 = !DISubrange(count: 11)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !604, file: !605, line: 26, type: !607, isLocal: false, isDefinition: true)
!604 = distinct !DICompileUnit(language: DW_LANG_C99, file: !605, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !76, globals: !606, splitDebugInlining: false, nameTableKind: None)
!605 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!606 = !{!602}
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 376, elements: !608)
!608 = !{!609}
!609 = !DISubrange(count: 47)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(name: "numname_table", scope: !612, file: !613, line: 41, type: !616, isLocal: true, isDefinition: true)
!612 = distinct !DICompileUnit(language: DW_LANG_C99, file: !613, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !76, retainedTypes: !614, globals: !615, splitDebugInlining: false, nameTableKind: None)
!613 = !DIFile(filename: "lib/sig2str.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!614 = !{!7}
!615 = !{!610}
!616 = !DICompositeType(tag: DW_TAG_array_type, baseType: !617, size: 3360, elements: !622)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "numname", file: !613, line: 41, size: 96, elements: !618)
!618 = !{!619, !620}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !617, file: !613, line: 41, baseType: !75, size: 32)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !617, file: !613, line: 41, baseType: !621, size: 64, offset: 32)
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 64, elements: !529)
!622 = !{!623}
!623 = !DISubrange(count: 35)
!624 = distinct !DICompileUnit(language: DW_LANG_C99, file: !625, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !76, retainedTypes: !626, splitDebugInlining: false, nameTableKind: None)
!625 = !DIFile(filename: "src/operand2sig.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!626 = !{!7, !206, !627, !211, !202, !67, !181, !170}
!627 = !DISubprogram(name: "str2sig", scope: !203, file: !203, line: 35, type: !628, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !76)
!628 = !DISubroutineType(types: !629)
!629 = !{!75, !73, !168}
!630 = distinct !DICompileUnit(language: DW_LANG_C99, file: !631, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !76, splitDebugInlining: false, nameTableKind: None)
!631 = !DIFile(filename: "lib/c-ctype.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!632 = distinct !DICompileUnit(language: DW_LANG_C99, file: !633, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !634, retainedTypes: !638, splitDebugInlining: false, nameTableKind: None)
!633 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!634 = !{!635}
!635 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !633, line: 40, baseType: !7, size: 32, elements: !636)
!636 = !{!637}
!637 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!638 = !{!67, !639, !39}
!639 = !DISubprogram(name: "fputs_unlocked", scope: !78, file: !78, line: 662, type: !640, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !76)
!640 = !DISubroutineType(types: !641)
!641 = !{!75, !73, !642}
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !83, line: 49, size: 1728, elements: !644)
!644 = !{!645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !643, file: !83, line: 51, baseType: !75, size: 32)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !643, file: !83, line: 54, baseType: !71, size: 64, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !643, file: !83, line: 55, baseType: !71, size: 64, offset: 128)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !643, file: !83, line: 56, baseType: !71, size: 64, offset: 192)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !643, file: !83, line: 57, baseType: !71, size: 64, offset: 256)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !643, file: !83, line: 58, baseType: !71, size: 64, offset: 320)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !643, file: !83, line: 59, baseType: !71, size: 64, offset: 384)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !643, file: !83, line: 60, baseType: !71, size: 64, offset: 448)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !643, file: !83, line: 61, baseType: !71, size: 64, offset: 512)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !643, file: !83, line: 64, baseType: !71, size: 64, offset: 576)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !643, file: !83, line: 65, baseType: !71, size: 64, offset: 640)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !643, file: !83, line: 66, baseType: !71, size: 64, offset: 704)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !643, file: !83, line: 68, baseType: !98, size: 64, offset: 768)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !643, file: !83, line: 70, baseType: !642, size: 64, offset: 832)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !643, file: !83, line: 72, baseType: !75, size: 32, offset: 896)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !643, file: !83, line: 73, baseType: !75, size: 32, offset: 928)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !643, file: !83, line: 74, baseType: !104, size: 64, offset: 960)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !643, file: !83, line: 77, baseType: !108, size: 16, offset: 1024)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !643, file: !83, line: 78, baseType: !110, size: 8, offset: 1040)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !643, file: !83, line: 79, baseType: !112, size: 8, offset: 1048)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !643, file: !83, line: 81, baseType: !116, size: 64, offset: 1088)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !643, file: !83, line: 89, baseType: !119, size: 64, offset: 1152)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !643, file: !83, line: 91, baseType: !121, size: 64, offset: 1216)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !643, file: !83, line: 92, baseType: !124, size: 64, offset: 1280)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !643, file: !83, line: 93, baseType: !642, size: 64, offset: 1344)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !643, file: !83, line: 94, baseType: !39, size: 64, offset: 1408)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !643, file: !83, line: 95, baseType: !41, size: 64, offset: 1472)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !643, file: !83, line: 96, baseType: !75, size: 32, offset: 1536)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !643, file: !83, line: 98, baseType: !131, size: 160, offset: 1568)
!674 = distinct !DICompileUnit(language: DW_LANG_C99, file: !675, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !676, retainedTypes: !684, splitDebugInlining: false, nameTableKind: None)
!675 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!676 = !{!677}
!677 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !678, file: !35, line: 186, baseType: !7, size: 32, elements: !49)
!678 = distinct !DISubprogram(name: "x2nrealloc", scope: !35, file: !35, line: 174, type: !37, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !674, retainedNodes: !679)
!679 = !{!680, !681, !682, !683}
!680 = !DILocalVariable(name: "p", arg: 1, scope: !678, file: !35, line: 174, type: !39)
!681 = !DILocalVariable(name: "pn", arg: 2, scope: !678, file: !35, line: 174, type: !40)
!682 = !DILocalVariable(name: "s", arg: 3, scope: !678, file: !35, line: 174, type: !41)
!683 = !DILocalVariable(name: "n", scope: !678, file: !35, line: 176, type: !41)
!684 = !{!41, !198, !195, !199, !71, !211, !39, !685, !688}
!685 = !DISubprogram(name: "xcalloc", scope: !35, file: !35, line: 57, type: !686, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !76)
!686 = !DISubroutineType(types: !687)
!687 = !{!39, !43, !43}
!688 = !DISubprogram(name: "rpl_calloc", scope: !689, file: !689, line: 688, type: !686, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !76)
!689 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!690 = distinct !DICompileUnit(language: DW_LANG_C99, file: !691, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !76, retainedTypes: !692, splitDebugInlining: false, nameTableKind: None)
!691 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!692 = !{!67, !170}
!693 = distinct !DICompileUnit(language: DW_LANG_C99, file: !694, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !76, retainedTypes: !695, splitDebugInlining: false, nameTableKind: None)
!694 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!695 = !{!39}
!696 = distinct !DICompileUnit(language: DW_LANG_C99, file: !697, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !76, retainedTypes: !698, splitDebugInlining: false, nameTableKind: None)
!697 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!698 = !{!699, !41, !711}
!699 = !DISubprogram(name: "mbrtowc", scope: !558, file: !558, line: 296, type: !700, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !76)
!700 = !DISubroutineType(types: !701)
!701 = !{!43, !168, !73, !43, !702}
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !542, line: 13, size: 64, elements: !704)
!704 = !{!705, !706}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !703, file: !542, line: 15, baseType: !75, size: 32)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !703, file: !542, line: 20, baseType: !707, size: 32, offset: 32)
!707 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !703, file: !542, line: 16, size: 32, elements: !708)
!708 = !{!709, !710}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !707, file: !542, line: 18, baseType: !7, size: 32)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !707, file: !542, line: 19, baseType: !550, size: 32)
!711 = !DISubprogram(name: "hard_locale", scope: !712, file: !712, line: 26, type: !713, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !76)
!712 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!713 = !DISubroutineType(types: !714)
!714 = !{!355, !75}
!715 = distinct !DICompileUnit(language: DW_LANG_C99, file: !716, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !76, retainedTypes: !717, splitDebugInlining: false, nameTableKind: None)
!716 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!717 = !{!718}
!718 = !DISubprogram(name: "rpl_fclose", scope: !719, file: !719, line: 672, type: !720, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !76)
!719 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!720 = !DISubroutineType(types: !721)
!721 = !{!75, !722}
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !83, line: 49, size: 1728, elements: !724)
!724 = !{!725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !723, file: !83, line: 51, baseType: !75, size: 32)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !723, file: !83, line: 54, baseType: !71, size: 64, offset: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !723, file: !83, line: 55, baseType: !71, size: 64, offset: 128)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !723, file: !83, line: 56, baseType: !71, size: 64, offset: 192)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !723, file: !83, line: 57, baseType: !71, size: 64, offset: 256)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !723, file: !83, line: 58, baseType: !71, size: 64, offset: 320)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !723, file: !83, line: 59, baseType: !71, size: 64, offset: 384)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !723, file: !83, line: 60, baseType: !71, size: 64, offset: 448)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !723, file: !83, line: 61, baseType: !71, size: 64, offset: 512)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !723, file: !83, line: 64, baseType: !71, size: 64, offset: 576)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !723, file: !83, line: 65, baseType: !71, size: 64, offset: 640)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !723, file: !83, line: 66, baseType: !71, size: 64, offset: 704)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !723, file: !83, line: 68, baseType: !98, size: 64, offset: 768)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !723, file: !83, line: 70, baseType: !722, size: 64, offset: 832)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !723, file: !83, line: 72, baseType: !75, size: 32, offset: 896)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !723, file: !83, line: 73, baseType: !75, size: 32, offset: 928)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !723, file: !83, line: 74, baseType: !104, size: 64, offset: 960)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !723, file: !83, line: 77, baseType: !108, size: 16, offset: 1024)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !723, file: !83, line: 78, baseType: !110, size: 8, offset: 1040)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !723, file: !83, line: 79, baseType: !112, size: 8, offset: 1048)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !723, file: !83, line: 81, baseType: !116, size: 64, offset: 1088)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !723, file: !83, line: 89, baseType: !119, size: 64, offset: 1152)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !723, file: !83, line: 91, baseType: !121, size: 64, offset: 1216)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !723, file: !83, line: 92, baseType: !124, size: 64, offset: 1280)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !723, file: !83, line: 93, baseType: !722, size: 64, offset: 1344)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !723, file: !83, line: 94, baseType: !39, size: 64, offset: 1408)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !723, file: !83, line: 95, baseType: !41, size: 64, offset: 1472)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !723, file: !83, line: 96, baseType: !75, size: 32, offset: 1536)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !723, file: !83, line: 98, baseType: !131, size: 160, offset: 1568)
!754 = distinct !DICompileUnit(language: DW_LANG_C99, file: !755, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !76, retainedTypes: !756, splitDebugInlining: false, nameTableKind: None)
!755 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!756 = !{!757}
!757 = !DISubprogram(name: "setlocale_null_r", scope: !758, file: !758, line: 64, type: !759, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !76)
!758 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!759 = !DISubroutineType(types: !760)
!760 = !{!75, !75, !71, !43}
!761 = distinct !DICompileUnit(language: DW_LANG_C99, file: !762, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !763, retainedTypes: !1150, splitDebugInlining: false, nameTableKind: None)
!762 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!763 = !{!764}
!764 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !765, line: 41, baseType: !7, size: 32, elements: !766)
!765 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!766 = !{!767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149}
!767 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!768 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!769 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!770 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!771 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!772 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!773 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!774 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!775 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!776 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!777 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!778 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!779 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!780 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!781 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!782 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!783 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!784 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!785 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!786 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!787 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!788 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!789 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!790 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!791 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!792 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!793 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!794 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!795 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!796 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!797 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!798 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!799 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!800 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!801 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!802 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!803 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!804 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!805 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!806 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!807 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!808 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!809 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!810 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!811 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!812 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!813 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!814 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!815 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!816 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!817 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!818 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!819 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!820 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!821 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!822 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!823 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!824 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!825 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!826 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!827 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!828 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!829 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!830 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!831 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!832 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!833 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!834 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!835 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!836 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!837 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!838 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!839 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!840 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!841 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!842 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!843 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!844 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!845 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!846 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!847 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!875 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!878 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!879 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!880 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!881 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!882 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!883 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!884 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!885 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!886 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!887 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!888 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!889 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!894 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!895 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!896 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!898 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!899 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!900 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!901 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!902 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!903 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!904 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!905 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!906 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!907 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!908 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!909 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!910 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!911 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!912 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!913 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!914 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!915 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!916 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!917 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!918 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!919 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!920 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!921 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!922 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!923 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!924 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!925 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!926 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!927 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!928 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!929 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!930 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!931 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!932 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!933 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!934 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!935 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!936 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!937 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!938 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!939 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!940 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!941 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!942 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!943 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!944 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!945 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!946 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!947 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!948 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!949 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!950 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!951 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!952 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!953 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!954 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!955 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!956 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!957 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!958 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!959 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!960 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!961 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!962 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!963 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!964 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!965 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!966 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!967 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!968 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!969 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!970 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!971 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!972 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!973 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!974 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!975 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!976 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!977 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!978 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!979 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!980 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!981 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!982 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!983 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!984 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!985 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!986 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!987 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!988 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!989 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!990 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!991 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!992 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!993 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!994 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!995 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!996 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!997 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!998 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!999 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!1000 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!1001 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!1002 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!1003 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!1004 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!1005 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!1006 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!1007 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!1008 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!1009 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!1010 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!1011 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!1012 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!1013 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!1014 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!1015 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!1016 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!1017 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!1018 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!1019 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!1020 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!1021 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!1022 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!1023 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!1024 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!1025 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!1026 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!1027 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!1028 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!1029 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!1030 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!1031 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!1032 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!1033 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!1034 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
