; ModuleID = 'coreutils-8.32/src/env.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.__sigset_t = type { [16 x i64] }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.numname = type { i32, [8 x i8] }
%struct.sigaction = type { %union.anon, %struct.__sigset_t, i32, void ()* }
%union.anon = type { void (i32)* }
%struct.__mbstate_t = type { i32, %union.anon.8 }
%union.anon.8 = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [62 x i8] c"Usage: %s [OPTION]... [-] [NAME=VALUE]... [COMMAND [ARG]...]\0A\00", align 1

!48 = !DILocalVariable(name: "n", scope: !36, file: !35, line: 176, type: !41)
!49 = !{!50}
!50 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !52, line: 46, baseType: !7, size: 32, elements: !53)
!52 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!53 = !{!54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65}
!54 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!55 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!56 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!57 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!58 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!59 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!60 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!61 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!62 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!63 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!64 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!65 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!66 = !{!67, !39, !41, !69, !70, !71}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!69 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!70 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !72, line: 72, baseType: !73)
!72 = !DIFile(filename: "/usr/include/signal.h", directory: "")
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DISubroutineType(types: !75)
!75 = !{null, !69}
!76 = !{!77, !108, !110, !112, !0, !114, !119, !131, !133, !135, !138, !150, !152, !154}
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "dummy_environ", scope: !79, file: !3, line: 877, type: !105, isLocal: true, isDefinition: true)
!79 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 798, type: !80, scopeLine: 799, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !83)
!80 = !DISubroutineType(types: !81)
!81 = !{!69, !69, !82}
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!83 = !{!84, !85, !86, !87, !89, !90, !93, !94, !95, !100, !104}
!84 = !DILocalVariable(name: "argc", arg: 1, scope: !79, file: !3, line: 798, type: !69)
!85 = !DILocalVariable(name: "argv", arg: 2, scope: !79, file: !3, line: 798, type: !82)
!86 = !DILocalVariable(name: "optc", scope: !79, file: !3, line: 800, type: !69)
!87 = !DILocalVariable(name: "ignore_environment", scope: !79, file: !3, line: 801, type: !88)
!88 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!89 = !DILocalVariable(name: "opt_nul_terminate_output", scope: !79, file: !3, line: 802, type: !88)
!90 = !DILocalVariable(name: "newdir", scope: !79, file: !3, line: 803, type: !91)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!93 = !DILocalVariable(name: "eq", scope: !79, file: !3, line: 883, type: !67)
!94 = !DILocalVariable(name: "program_specified", scope: !79, file: !3, line: 897, type: !88)
!95 = !DILocalVariable(name: "e", scope: !96, file: !3, line: 914, type: !98)
!96 = distinct !DILexicalBlock(scope: !97, file: !3, line: 912, column: 5)
!97 = distinct !DILexicalBlock(scope: !79, file: !3, line: 911, column: 7)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !67)
!100 = !DILocalVariable(name: "i", scope: !101, file: !3, line: 939, type: !69)
!101 = distinct !DILexicalBlock(scope: !102, file: !3, line: 939, column: 7)
!102 = distinct !DILexicalBlock(scope: !103, file: !3, line: 937, column: 5)
!103 = distinct !DILexicalBlock(scope: !79, file: !3, line: 936, column: 7)
!104 = !DILocalVariable(name: "exit_status", scope: !79, file: !3, line: 945, type: !69)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 64, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 1)
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(name: "dev_debug", scope: !2, file: !3, line: 48, type: !88, isLocal: true, isDefinition: true)
!110 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression())
!111 = distinct !DIGlobalVariable(name: "sig_mask_changed", scope: !2, file: !3, line: 71, type: !88, isLocal: true, isDefinition: true)
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(name: "report_signal_handling", scope: !2, file: !3, line: 74, type: !88, isLocal: true, isDefinition: true)
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(name: "shortopts", scope: !2, file: !3, line: 76, type: !116, isLocal: true, isDefinition: true)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 104, elements: !117)
!117 = !{!118}
!118 = !DISubrange(count: 13)
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 88, type: !121, isLocal: true, isDefinition: true)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 3328, elements: !117)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !124, line: 50, size: 256, elements: !125)
!124 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!125 = !{!126, !127, !128, !130}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !123, file: !124, line: 52, baseType: !91, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !123, file: !124, line: 55, baseType: !69, size: 32, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !123, file: !124, line: 56, baseType: !129, size: 64, offset: 128)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !123, file: !124, line: 57, baseType: !69, size: 32, offset: 192)
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "usvars_used", scope: !2, file: !3, line: 45, type: !41, isLocal: true, isDefinition: true)
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(name: "usvars_alloc", scope: !2, file: !3, line: 44, type: !41, isLocal: true, isDefinition: true)
!135 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression())
!136 = distinct !DIGlobalVariable(name: "usvars", scope: !2, file: !3, line: 43, type: !137, isLocal: true, isDefinition: true)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "block_signals", scope: !2, file: !3, line: 65, type: !140, isLocal: true, isDefinition: true)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !141, line: 7, baseType: !142)
!141 = !DIFile(filename: "/usr/include/bits/types/sigset_t.h", directory: "")
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !143, line: 8, baseType: !144)
!143 = !DIFile(filename: "/usr/include/bits/types/__sigset_t.h", directory: "")
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !143, line: 5, size: 1024, elements: !145)
!145 = !{!146}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !144, file: !143, line: 7, baseType: !147, size: 1024)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 1024, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 16)
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(name: "unblock_signals", scope: !2, file: !3, line: 68, type: !140, isLocal: true, isDefinition: true)
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(name: "vnlen", scope: !2, file: !3, line: 52, type: !41, isLocal: true, isDefinition: true)
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(name: "varname", scope: !2, file: !3, line: 51, type: !67, isLocal: true, isDefinition: true)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!157 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!158 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!159 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "Version", scope: !162, file: !163, line: 2, type: !91, isLocal: false, isDefinition: true)
!162 = distinct !DICompileUnit(language: DW_LANG_C99, file: !163, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !164, globals: !165, splitDebugInlining: false, nameTableKind: None)
!163 = !DIFile(filename: "src/version.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!164 = !{}
!165 = !{!160}
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "file_name", scope: !168, file: !169, line: 46, type: !91, isLocal: true, isDefinition: true)
!168 = distinct !DICompileUnit(language: DW_LANG_C99, file: !169, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !164, globals: !170, splitDebugInlining: false, nameTableKind: None)
!169 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!170 = !{!166, !171}
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !168, file: !169, line: 56, type: !88, isLocal: true, isDefinition: true)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(name: "exit_failure", scope: !175, file: !176, line: 24, type: !178, isLocal: false, isDefinition: true)
!175 = distinct !DICompileUnit(language: DW_LANG_C99, file: !176, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !164, globals: !177, splitDebugInlining: false, nameTableKind: None)
!176 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!177 = !{!173}
!178 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !69)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(name: "program_name", scope: !181, file: !182, line: 33, type: !91, isLocal: false, isDefinition: true)
!181 = distinct !DICompileUnit(language: DW_LANG_C99, file: !182, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !164, retainedTypes: !183, globals: !184, splitDebugInlining: false, nameTableKind: None)
!182 = !DIFile(filename: "lib/progname.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!183 = !{!39, !67}
!184 = !{!179}
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !187, file: !188, line: 85, type: !233, isLocal: false, isDefinition: true)
!187 = distinct !DICompileUnit(language: DW_LANG_C99, file: !188, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !189, retainedTypes: !195, globals: !196, splitDebugInlining: false, nameTableKind: None)
!188 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!189 = !{!13, !190, !51}
!190 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !14, line: 242, baseType: !7, size: 32, elements: !191)
!191 = !{!192, !193, !194}
!192 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!193 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!194 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!195 = !{!69, !70, !41, !67}
!196 = !{!185, !197, !203, !215, !217, !222, !229, !231}
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !187, file: !188, line: 101, type: !199, isLocal: false, isDefinition: true)
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 320, elements: !201)
!200 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!201 = !{!202}
!202 = !DISubrange(count: 10)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !187, file: !188, line: 1052, type: !205, isLocal: false, isDefinition: true)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !188, line: 65, size: 448, elements: !206)
!206 = !{!207, !208, !209, !213, !214}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !205, file: !188, line: 68, baseType: !13, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !205, file: !188, line: 71, baseType: !69, size: 32, offset: 32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !205, file: !188, line: 75, baseType: !210, size: 256, offset: 64)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !211)
!211 = !{!212}
!212 = !DISubrange(count: 8)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !205, file: !188, line: 78, baseType: !91, size: 64, offset: 320)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !205, file: !188, line: 81, baseType: !91, size: 64, offset: 384)
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !187, file: !188, line: 116, type: !205, isLocal: true, isDefinition: true)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(name: "slot0", scope: !187, file: !188, line: 842, type: !219, isLocal: true, isDefinition: true)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 2048, elements: !220)
!220 = !{!221}
!221 = !DISubrange(count: 256)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(name: "slotvec", scope: !187, file: !188, line: 845, type: !224, isLocal: true, isDefinition: true)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !188, line: 834, size: 128, elements: !226)
!226 = !{!227, !228}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !225, file: !188, line: 836, baseType: !41, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !225, file: !188, line: 837, baseType: !67, size: 64, offset: 64)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(name: "nslots", scope: !187, file: !188, line: 843, type: !69, isLocal: true, isDefinition: true)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(name: "slotvec0", scope: !187, file: !188, line: 844, type: !225, isLocal: true, isDefinition: true)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 704, elements: !235)
!234 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!235 = !{!236}
!236 = !DISubrange(count: 11)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !239, file: !240, line: 26, type: !242, isLocal: false, isDefinition: true)
!239 = distinct !DICompileUnit(language: DW_LANG_C99, file: !240, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !164, globals: !241, splitDebugInlining: false, nameTableKind: None)
!240 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!241 = !{!237}
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 376, elements: !243)
!243 = !{!244}
!244 = !DISubrange(count: 47)
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(name: "numname_table", scope: !247, file: !248, line: 41, type: !251, isLocal: true, isDefinition: true)
!247 = distinct !DICompileUnit(language: DW_LANG_C99, file: !248, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !164, retainedTypes: !249, globals: !250, splitDebugInlining: false, nameTableKind: None)
!248 = !DIFile(filename: "lib/sig2str.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!249 = !{!7}
!250 = !{!245}
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !252, size: 3360, elements: !257)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "numname", file: !248, line: 41, size: 96, elements: !253)
!253 = !{!254, !255}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !252, file: !248, line: 41, baseType: !69, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !252, file: !248, line: 41, baseType: !256, size: 64, offset: 32)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 64, elements: !211)
!257 = !{!258}
!258 = !DISubrange(count: 35)
!259 = distinct !DICompileUnit(language: DW_LANG_C99, file: !260, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !164, retainedTypes: !249, splitDebugInlining: false, nameTableKind: None)
!260 = !DIFile(filename: "src/operand2sig.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!261 = distinct !DICompileUnit(language: DW_LANG_C99, file: !262, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !164, splitDebugInlining: false, nameTableKind: None)
!262 = !DIFile(filename: "lib/c-ctype.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!263 = distinct !DICompileUnit(language: DW_LANG_C99, file: !264, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !265, retainedTypes: !269, splitDebugInlining: false, nameTableKind: None)
!264 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!265 = !{!266}
!266 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !264, line: 40, baseType: !7, size: 32, elements: !267)
!267 = !{!268}
!268 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!269 = !{!39}
!270 = distinct !DICompileUnit(language: DW_LANG_C99, file: !271, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !272, retainedTypes: !280, splitDebugInlining: false, nameTableKind: None)
!271 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!272 = !{!273}
!273 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !274, file: !35, line: 186, baseType: !7, size: 32, elements: !49)
!274 = distinct !DISubprogram(name: "x2nrealloc", scope: !35, file: !35, line: 174, type: !37, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !270, retainedNodes: !275)
!275 = !{!276, !277, !278, !279}
!276 = !DILocalVariable(name: "p", arg: 1, scope: !274, file: !35, line: 174, type: !39)
!277 = !DILocalVariable(name: "pn", arg: 2, scope: !274, file: !35, line: 174, type: !40)
!278 = !DILocalVariable(name: "s", arg: 3, scope: !274, file: !35, line: 174, type: !41)
!279 = !DILocalVariable(name: "n", scope: !274, file: !35, line: 176, type: !41)
!280 = !{!41, !67, !39}
!281 = distinct !DICompileUnit(language: DW_LANG_C99, file: !282, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !164, splitDebugInlining: false, nameTableKind: None)
!282 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!283 = distinct !DICompileUnit(language: DW_LANG_C99, file: !284, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !164, retainedTypes: !269, splitDebugInlining: false, nameTableKind: None)
!284 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!285 = distinct !DICompileUnit(language: DW_LANG_C99, file: !286, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !164, retainedTypes: !287, splitDebugInlining: false, nameTableKind: None)
!286 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!287 = !{!41}
!288 = distinct !DICompileUnit(language: DW_LANG_C99, file: !289, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !164, splitDebugInlining: false, nameTableKind: None)
!289 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!290 = distinct !DICompileUnit(language: DW_LANG_C99, file: !291, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !164, splitDebugInlining: false, nameTableKind: None)
!291 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!292 = distinct !DICompileUnit(language: DW_LANG_C99, file: !293, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !294, retainedTypes: !269, splitDebugInlining: false, nameTableKind: None)
!293 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!294 = !{!295}
!295 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !296, line: 41, baseType: !7, size: 32, elements: !297)
!296 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!297 = !{!298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680}
!298 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!299 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!300 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!301 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!302 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!303 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!304 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!305 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!306 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!307 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!308 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!309 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!310 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!311 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!312 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!313 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!314 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!315 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!316 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!317 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!318 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!319 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!320 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!321 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!322 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!323 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!324 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!325 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!326 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!327 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!328 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!329 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!330 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!331 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!332 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!333 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!334 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!335 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!336 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!337 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!338 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!339 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!340 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!341 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!342 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!343 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!344 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!345 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!346 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!347 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!348 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!349 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!350 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!351 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!352 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!353 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!354 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!355 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!356 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!357 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!358 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!359 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!360 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!361 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!362 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!363 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!364 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!365 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!366 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!367 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!368 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!369 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!370 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!371 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!372 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!373 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!374 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!375 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!376 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!377 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!378 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!379 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!380 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!381 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!382 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!383 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!384 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!385 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!386 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!387 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!388 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!389 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!390 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!391 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!392 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!393 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!394 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!395 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!396 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!397 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!398 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!399 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!400 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!401 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!402 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!403 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!404 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!405 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!406 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!407 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!408 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!409 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!410 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!411 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!412 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!413 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!414 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!415 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!416 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!417 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!418 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!419 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!420 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!421 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!422 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!423 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!424 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!425 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!426 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!427 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!428 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!429 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!430 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!431 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!432 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!433 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!434 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!435 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!436 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!437 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!438 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!439 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!440 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!441 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!442 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!443 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!444 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!445 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!446 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!447 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!448 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!449 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!450 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!451 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!452 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!453 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!454 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!455 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!456 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!457 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!458 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!459 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!460 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!461 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!462 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!463 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!464 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!465 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!466 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!467 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!468 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!469 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!470 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!471 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!472 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!473 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!474 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!475 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!476 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!477 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!478 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!479 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!480 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!481 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!482 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!483 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!484 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!485 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!486 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!487 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!488 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!489 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!490 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!491 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!492 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!493 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!494 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!495 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!496 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!497 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!498 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!499 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!500 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!501 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!502 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!503 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!504 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!505 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!506 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!507 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!508 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!509 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!510 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!511 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!512 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!513 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!514 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!515 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!516 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!517 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!518 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!519 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!520 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!521 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!522 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!523 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!524 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!525 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!526 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!527 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!528 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!529 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!530 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!531 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!532 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!533 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!534 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!535 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!536 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!537 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!538 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!539 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!540 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!541 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!542 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!543 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!544 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!545 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!546 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!547 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!548 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!549 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!550 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!551 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!552 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!553 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!554 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!555 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!556 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!557 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!558 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!559 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!560 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!561 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!562 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!563 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!564 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!565 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!566 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!567 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!568 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!569 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!570 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!571 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!572 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!573 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!574 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!575 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!576 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!577 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!578 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!579 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!580 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!581 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!582 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!583 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!584 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!585 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!586 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!587 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!588 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!589 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!590 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!591 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!592 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!593 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!594 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!595 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!596 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!597 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!598 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!599 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!600 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!601 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!602 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!603 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!604 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!605 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!606 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!607 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!608 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!609 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!610 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!611 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!612 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!613 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!614 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!615 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!616 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!617 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!618 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!619 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!620 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!621 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!622 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!623 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!624 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!625 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!626 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!627 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!628 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!629 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!630 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!631 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!632 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!633 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!634 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!635 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!636 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!637 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!661 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!662 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!663 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!664 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!665 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!666 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!667 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!668 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!669 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!670 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!671 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!672 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!673 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!674 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!675 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!676 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!677 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!678 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!679 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!680 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!681 = distinct !DICompileUnit(language: DW_LANG_C99, file: !682, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !164, retainedTypes: !269, splitDebugInlining: false, nameTableKind: None)
!682 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!683 = distinct !DICompileUnit(language: DW_LANG_C99, file: !684, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !164, splitDebugInlining: false, nameTableKind: None)
!684 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!685 = distinct !DICompileUnit(language: DW_LANG_C99, file: !686, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !164, retainedTypes: !269, splitDebugInlining: false, nameTableKind: None)
!686 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!687 = distinct !DICompileUnit(language: DW_LANG_C99, file: !688, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !164, retainedTypes: !269, splitDebugInlining: false, nameTableKind: None)
!688 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!689 = !{!"clang version 12.0.1"}
!690 = !{i32 7, !"Dwarf Version", i32 4}
!691 = !{i32 2, !"Debug Info Version", i32 3}
!692 = !{i32 1, !"wchar_size", i32 4}
!693 = !{i32 7, !"PIC Level", i32 2}
!694 = !{i32 7, !"PIE Level", i32 2}
!695 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 106, type: !74, scopeLine: 107, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !696)
!696 = !{!697}
!697 = !DILocalVariable(name: "status", arg: 1, scope: !695, file: !3, line: 106, type: !69)
!698 = !DILocation(line: 0, scope: !695)
!699 = !DILocation(line: 108, column: 14, scope: !700)
!700 = distinct !DILexicalBlock(scope: !695, file: !3, line: 108, column: 7)
!701 = !DILocation(line: 108, column: 7, scope: !695)
!702 = !DILocation(line: 109, column: 5, scope: !703)
!703 = distinct !DILexicalBlock(scope: !700, file: !3, line: 109, column: 5)
!704 = !{!705, !705, i64 0}
!705 = !{!"any pointer", !706, i64 0}
!706 = !{!"omnipotent char", !707, i64 0}
!707 = !{!"Simple C/C++ TBAA"}
!708 = !DILocation(line: 112, column: 7, scope: !709)
!709 = distinct !DILexicalBlock(scope: !700, file: !3, line: 111, column: 5)
!710 = !DILocation(line: 115, column: 7, scope: !709)
!711 = !DILocation(line: 590, column: 3, scope: !712, inlinedAt: !715)
!712 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !6, file: !6, line: 588, type: !713, scopeLine: 589, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !164)
!713 = !DISubroutineType(types: !714)
!714 = !{null}
!715 = distinct !DILocation(line: 119, column: 7, scope: !709)
!716 = !DILocation(line: 121, column: 7, scope: !709)
!717 = !DILocation(line: 126, column: 7, scope: !709)
!718 = !DILocation(line: 129, column: 7, scope: !709)
!719 = !DILocation(line: 133, column: 7, scope: !709)
!720 = !DILocation(line: 136, column: 7, scope: !709)
!721 = !DILocation(line: 139, column: 7, scope: !709)
!722 = !DILocation(line: 142, column: 7, scope: !709)
!723 = !DILocation(line: 145, column: 7, scope: !709)
!724 = !DILocation(line: 148, column: 7, scope: !709)
!725 = !DILocation(line: 149, column: 7, scope: !709)
!726 = !DILocation(line: 150, column: 7, scope: !709)
!727 = !DILocation(line: 154, column: 7, scope: !709)
!728 = !DILocalVariable(name: "program", arg: 1, scope: !729, file: !6, line: 634, type: !91)
!729 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !6, file: !6, line: 634, type: !730, scopeLine: 635, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !732)
!730 = !DISubroutineType(types: !731)
!731 = !{null, !91}
!732 = !{!728, !733, !742, !743, !745}
!733 = !DILocalVariable(name: "infomap", scope: !729, file: !6, line: 636, type: !734)
!734 = !DICompositeType(tag: DW_TAG_array_type, baseType: !735, size: 896, elements: !740)
!735 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !736)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !729, file: !6, line: 636, size: 128, elements: !737)
!737 = !{!738, !739}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !736, file: !6, line: 636, baseType: !91, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !736, file: !6, line: 636, baseType: !91, size: 64, offset: 64)
!740 = !{!741}
!741 = !DISubrange(count: 7)
!742 = !DILocalVariable(name: "node", scope: !729, file: !6, line: 646, type: !91)
!743 = !DILocalVariable(name: "map_prog", scope: !729, file: !6, line: 647, type: !744)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!745 = !DILocalVariable(name: "lc_messages", scope: !729, file: !6, line: 659, type: !91)
!746 = !DILocation(line: 0, scope: !729, inlinedAt: !747)
!747 = distinct !DILocation(line: 160, column: 7, scope: !709)
!748 = !DILocation(line: 636, column: 3, scope: !729, inlinedAt: !747)
!749 = !DILocation(line: 636, column: 67, scope: !729, inlinedAt: !747)
!750 = !DILocation(line: 647, column: 36, scope: !729, inlinedAt: !747)
!751 = !DILocation(line: 649, column: 3, scope: !729, inlinedAt: !747)
!752 = !DILocation(line: 649, column: 33, scope: !729, inlinedAt: !747)
!753 = !DILocation(line: 650, column: 13, scope: !729, inlinedAt: !747)
!754 = !DILocation(line: 649, column: 20, scope: !729, inlinedAt: !747)
!755 = !{!756, !705, i64 0}
!756 = !{!"infomap", !705, i64 0, !705, i64 8}
!757 = !DILocation(line: 649, column: 10, scope: !729, inlinedAt: !747)
!758 = !DILocation(line: 649, column: 28, scope: !729, inlinedAt: !747)
!759 = distinct !{!759, !751, !753, !760}
!760 = !{!"llvm.loop.mustprogress"}
!761 = !DILocation(line: 652, column: 17, scope: !762, inlinedAt: !747)
!762 = distinct !DILexicalBlock(scope: !729, file: !6, line: 652, column: 7)
!763 = !{!756, !705, i64 8}
!764 = !DILocation(line: 652, column: 7, scope: !762, inlinedAt: !747)
!765 = !DILocation(line: 652, column: 7, scope: !729, inlinedAt: !747)
!766 = !DILocation(line: 655, column: 3, scope: !729, inlinedAt: !747)
!767 = !DILocation(line: 659, column: 29, scope: !729, inlinedAt: !747)
!768 = !DILocation(line: 660, column: 7, scope: !769, inlinedAt: !747)
!769 = distinct !DILexicalBlock(scope: !729, file: !6, line: 660, column: 7)
!770 = !DILocation(line: 660, column: 19, scope: !769, inlinedAt: !747)
!771 = !DILocation(line: 660, column: 22, scope: !769, inlinedAt: !747)
!772 = !DILocation(line: 660, column: 7, scope: !729, inlinedAt: !747)
!773 = !DILocation(line: 666, column: 7, scope: !774, inlinedAt: !747)
!774 = distinct !DILexicalBlock(scope: !769, file: !6, line: 661, column: 5)
!775 = !DILocation(line: 668, column: 5, scope: !774, inlinedAt: !747)
!776 = !DILocation(line: 669, column: 3, scope: !729, inlinedAt: !747)
!777 = !DILocation(line: 671, column: 3, scope: !729, inlinedAt: !747)
!778 = !DILocation(line: 673, column: 1, scope: !729, inlinedAt: !747)
!779 = !DILocation(line: 162, column: 3, scope: !695)
!780 = !DISubprogram(name: "dcgettext", scope: !781, file: !781, line: 51, type: !782, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !164)
!781 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!782 = !DISubroutineType(types: !783)
!783 = !{!67, !91, !91, !69}
!784 = !DISubprogram(name: "fputs_unlocked", scope: !785, file: !785, line: 667, type: !786, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !164)
!785 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!786 = !DISubroutineType(types: !787)
!787 = !{!69, !91, !788}
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !790, line: 49, size: 1728, elements: !791)
!790 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!791 = !{!792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !807, !808, !809, !810, !814, !815, !817, !819, !822, !824, !827, !830, !831, !832, !833, !834}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !789, file: !790, line: 51, baseType: !69, size: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !789, file: !790, line: 54, baseType: !67, size: 64, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !789, file: !790, line: 55, baseType: !67, size: 64, offset: 128)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !789, file: !790, line: 56, baseType: !67, size: 64, offset: 192)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !789, file: !790, line: 57, baseType: !67, size: 64, offset: 256)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !789, file: !790, line: 58, baseType: !67, size: 64, offset: 320)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !789, file: !790, line: 59, baseType: !67, size: 64, offset: 384)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !789, file: !790, line: 60, baseType: !67, size: 64, offset: 448)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !789, file: !790, line: 61, baseType: !67, size: 64, offset: 512)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !789, file: !790, line: 64, baseType: !67, size: 64, offset: 576)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !789, file: !790, line: 65, baseType: !67, size: 64, offset: 640)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !789, file: !790, line: 66, baseType: !67, size: 64, offset: 704)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !789, file: !790, line: 68, baseType: !805, size: 64, offset: 768)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !790, line: 36, flags: DIFlagFwdDecl)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !789, file: !790, line: 70, baseType: !788, size: 64, offset: 832)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !789, file: !790, line: 72, baseType: !69, size: 32, offset: 896)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !789, file: !790, line: 73, baseType: !69, size: 32, offset: 928)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !789, file: !790, line: 74, baseType: !811, size: 64, offset: 960)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !812, line: 152, baseType: !813)
!812 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!813 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !789, file: !790, line: 77, baseType: !70, size: 16, offset: 1024)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !789, file: !790, line: 78, baseType: !816, size: 8, offset: 1040)
!816 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !789, file: !790, line: 79, baseType: !818, size: 8, offset: 1048)
!818 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 8, elements: !106)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !789, file: !790, line: 81, baseType: !820, size: 64, offset: 1088)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !790, line: 43, baseType: null)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !789, file: !790, line: 89, baseType: !823, size: 64, offset: 1152)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !812, line: 153, baseType: !813)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !789, file: !790, line: 91, baseType: !825, size: 64, offset: 1216)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !790, line: 37, flags: DIFlagFwdDecl)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !789, file: !790, line: 92, baseType: !828, size: 64, offset: 1280)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !790, line: 38, flags: DIFlagFwdDecl)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !789, file: !790, line: 93, baseType: !788, size: 64, offset: 1344)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !789, file: !790, line: 94, baseType: !39, size: 64, offset: 1408)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !789, file: !790, line: 95, baseType: !41, size: 64, offset: 1472)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !789, file: !790, line: 96, baseType: !69, size: 32, offset: 1536)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !789, file: !790, line: 98, baseType: !835, size: 160, offset: 1568)
!835 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 160, elements: !836)
!836 = !{!837}
!837 = !DISubrange(count: 20)
!838 = !DISubprogram(name: "setlocale", scope: !839, file: !839, line: 122, type: !840, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !164)
!839 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!840 = !DISubroutineType(types: !841)
!841 = !{!67, !69, !91}
!842 = !DILocalVariable(name: "signame", scope: !843, file: !3, line: 746, type: !853)
!843 = distinct !DILexicalBlock(scope: !844, file: !3, line: 745, column: 9)
!844 = distinct !DILexicalBlock(scope: !845, file: !3, line: 744, column: 11)
!845 = distinct !DILexicalBlock(scope: !846, file: !3, line: 728, column: 5)
!846 = distinct !DILexicalBlock(scope: !847, file: !3, line: 727, column: 3)
!847 = distinct !DILexicalBlock(scope: !848, file: !3, line: 727, column: 3)
!848 = distinct !DISubprogram(name: "set_signal_proc_mask", scope: !3, file: !3, line: 716, type: !713, scopeLine: 717, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !849)
!849 = !{!850, !851, !852, !842}
!850 = !DILocalVariable(name: "set", scope: !848, file: !3, line: 719, type: !140)
!851 = !DILocalVariable(name: "debug_act", scope: !848, file: !3, line: 720, type: !91)
!852 = !DILocalVariable(name: "i", scope: !847, file: !3, line: 727, type: !69)
!853 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 152, elements: !854)
!854 = !{!855}
!855 = !DISubrange(count: 19)
!856 = !DILocation(line: 746, column: 16, scope: !843, inlinedAt: !857)
!857 = distinct !DILocation(line: 922, column: 5, scope: !858)
!858 = distinct !DILexicalBlock(scope: !79, file: !3, line: 921, column: 7)
!859 = !DILocalVariable(name: "signame", scope: !860, file: !3, line: 658, type: !853)
!860 = distinct !DILexicalBlock(scope: !861, file: !3, line: 657, column: 9)
!861 = distinct !DILexicalBlock(scope: !862, file: !3, line: 656, column: 11)
!862 = distinct !DILexicalBlock(scope: !863, file: !3, line: 629, column: 5)
!863 = distinct !DILexicalBlock(scope: !864, file: !3, line: 628, column: 3)
!864 = distinct !DILexicalBlock(scope: !865, file: !3, line: 628, column: 3)
!865 = distinct !DISubprogram(name: "reset_signal_handlers", scope: !3, file: !3, line: 626, type: !713, scopeLine: 627, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !866)
!866 = !{!867, !868, !961, !962, !963, !859}
!867 = !DILocalVariable(name: "i", scope: !864, file: !3, line: 628, type: !69)
!868 = !DILocalVariable(name: "act", scope: !862, file: !3, line: 630, type: !869)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !870, line: 27, size: 1216, elements: !871)
!870 = !DIFile(filename: "/usr/include/bits/sigaction.h", directory: "")
!871 = !{!872, !957, !958, !959}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !869, file: !870, line: 38, baseType: !873, size: 64)
!873 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !869, file: !870, line: 31, size: 64, elements: !874)
!874 = !{!875, !876}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !873, file: !870, line: 34, baseType: !71, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !873, file: !870, line: 36, baseType: !877, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = !DISubroutineType(types: !879)
!879 = !{null, !69, !880, !39}
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !882, line: 124, baseType: !883)
!882 = !DIFile(filename: "/usr/include/bits/types/siginfo_t.h", directory: "")
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !882, line: 36, size: 1024, elements: !884)
!884 = !{!885, !886, !887, !888, !889}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !883, file: !882, line: 38, baseType: !69, size: 32)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !883, file: !882, line: 40, baseType: !69, size: 32, offset: 32)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !883, file: !882, line: 42, baseType: !69, size: 32, offset: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !883, file: !882, line: 48, baseType: !69, size: 32, offset: 96)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !883, file: !882, line: 123, baseType: !890, size: 896, offset: 128)
!890 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !883, file: !882, line: 51, size: 896, elements: !891)
!891 = !{!892, !896, !903, !915, !921, !930, !946, !951}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !890, file: !882, line: 53, baseType: !893, size: 896)
!893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 896, elements: !894)
!894 = !{!895}
!895 = !DISubrange(count: 28)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !890, file: !882, line: 60, baseType: !897, size: 64)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !890, file: !882, line: 56, size: 64, elements: !898)
!898 = !{!899, !901}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !897, file: !882, line: 58, baseType: !900, size: 32)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !812, line: 154, baseType: !69)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !897, file: !882, line: 59, baseType: !902, size: 32, offset: 32)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !812, line: 146, baseType: !7)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !890, file: !882, line: 68, baseType: !904, size: 128)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !890, file: !882, line: 63, size: 128, elements: !905)
!905 = !{!906, !907, !908}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !904, file: !882, line: 65, baseType: !69, size: 32)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !904, file: !882, line: 66, baseType: !69, size: 32, offset: 32)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !904, file: !882, line: 67, baseType: !909, size: 64, offset: 64)
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigval_t", file: !910, line: 30, baseType: !911)
!910 = !DIFile(filename: "/usr/include/bits/types/__sigval_t.h", directory: "")
!911 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !910, line: 24, size: 64, elements: !912)
!912 = !{!913, !914}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !911, file: !910, line: 26, baseType: !69, size: 32)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !911, file: !910, line: 27, baseType: !39, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !890, file: !882, line: 76, baseType: !916, size: 128)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !890, file: !882, line: 71, size: 128, elements: !917)
!917 = !{!918, !919, !920}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !916, file: !882, line: 73, baseType: !900, size: 32)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !916, file: !882, line: 74, baseType: !902, size: 32, offset: 32)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !916, file: !882, line: 75, baseType: !909, size: 64, offset: 64)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !890, file: !882, line: 86, baseType: !922, size: 256)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !890, file: !882, line: 79, size: 256, elements: !923)
!923 = !{!924, !925, !926, !927, !929}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !922, file: !882, line: 81, baseType: !900, size: 32)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !922, file: !882, line: 82, baseType: !902, size: 32, offset: 32)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !922, file: !882, line: 83, baseType: !69, size: 32, offset: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !922, file: !882, line: 84, baseType: !928, size: 64, offset: 128)
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !812, line: 156, baseType: !813)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !922, file: !882, line: 85, baseType: !928, size: 64, offset: 192)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !890, file: !882, line: 105, baseType: !931, size: 256)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !890, file: !882, line: 89, size: 256, elements: !932)
!932 = !{!933, !934, !936}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !931, file: !882, line: 91, baseType: !39, size: 64)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_lsb", scope: !931, file: !882, line: 93, baseType: !935, size: 16, offset: 64)
!935 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "_bounds", scope: !931, file: !882, line: 104, baseType: !937, size: 128, offset: 128)
!937 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !931, file: !882, line: 94, size: 128, elements: !938)
!938 = !{!939, !944}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_bnd", scope: !937, file: !882, line: 101, baseType: !940, size: 128)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !937, file: !882, line: 97, size: 128, elements: !941)
!941 = !{!942, !943}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "_lower", scope: !940, file: !882, line: 99, baseType: !39, size: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "_upper", scope: !940, file: !882, line: 100, baseType: !39, size: 64, offset: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "_pkey", scope: !937, file: !882, line: 103, baseType: !945, size: 32)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !812, line: 42, baseType: !7)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !890, file: !882, line: 112, baseType: !947, size: 128)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !890, file: !882, line: 108, size: 128, elements: !948)
!948 = !{!949, !950}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !947, file: !882, line: 110, baseType: !813, size: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "si_fd", scope: !947, file: !882, line: 111, baseType: !69, size: 32, offset: 64)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !890, file: !882, line: 121, baseType: !952, size: 128)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !890, file: !882, line: 116, size: 128, elements: !953)
!953 = !{!954, !955, !956}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !952, file: !882, line: 118, baseType: !39, size: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !952, file: !882, line: 119, baseType: !69, size: 32, offset: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !952, file: !882, line: 120, baseType: !7, size: 32, offset: 96)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !869, file: !870, line: 46, baseType: !142, size: 1024, offset: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !869, file: !870, line: 49, baseType: !69, size: 32, offset: 1088)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !869, file: !870, line: 52, baseType: !960, size: 64, offset: 1152)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!961 = !DILocalVariable(name: "ignore_errors", scope: !862, file: !3, line: 635, type: !88)
!962 = !DILocalVariable(name: "set_to_default", scope: !862, file: !3, line: 638, type: !88)
!963 = !DILocalVariable(name: "sig_err", scope: !862, file: !3, line: 641, type: !69)
!964 = !DILocation(line: 658, column: 16, scope: !860, inlinedAt: !965)
!965 = distinct !DILocation(line: 920, column: 3, scope: !79)
!966 = !DILocation(line: 0, scope: !79)
!967 = !DILocation(line: 806, column: 21, scope: !79)
!968 = !DILocation(line: 806, column: 3, scope: !79)
!969 = !DILocation(line: 807, column: 3, scope: !79)
!970 = !DILocation(line: 808, column: 3, scope: !79)
!971 = !DILocation(line: 809, column: 3, scope: !79)
!972 = !DILocalVariable(name: "status", arg: 1, scope: !973, file: !6, line: 99, type: !69)
!973 = distinct !DISubprogram(name: "initialize_exit_failure", scope: !6, file: !6, line: 99, type: !74, scopeLine: 100, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !974)
!974 = !{!972}
!975 = !DILocation(line: 0, scope: !973, inlinedAt: !976)
!976 = distinct !DILocation(line: 811, column: 3, scope: !79)
!977 = !DILocation(line: 102, column: 18, scope: !978, inlinedAt: !976)
!978 = distinct !DILexicalBlock(scope: !973, file: !6, line: 101, column: 7)
!979 = !{!980, !980, i64 0}
!980 = !{!"int", !706, i64 0}
!981 = !DILocation(line: 812, column: 3, scope: !79)
!982 = !DILocation(line: 789, column: 13, scope: !983, inlinedAt: !987)
!983 = distinct !DISubprogram(name: "initialize_signals", scope: !3, file: !3, line: 787, type: !713, scopeLine: 788, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !984)
!984 = !{!985}
!985 = !DILocalVariable(name: "i", scope: !986, file: !3, line: 791, type: !69)
!986 = distinct !DILexicalBlock(scope: !983, file: !3, line: 791, column: 3)
!987 = distinct !DILocation(line: 814, column: 3, scope: !79)
!988 = !DILocation(line: 789, column: 11, scope: !983, inlinedAt: !987)
!989 = !DILocation(line: 0, scope: !986, inlinedAt: !987)
!990 = !DILocation(line: 792, column: 16, scope: !991, inlinedAt: !987)
!991 = distinct !DILexicalBlock(scope: !986, file: !3, line: 791, column: 3)
!992 = !DILocation(line: 816, column: 3, scope: !79)
!993 = !DILocation(line: 803, column: 15, scope: !79)
!994 = !DILocation(line: 802, column: 8, scope: !79)
!995 = !DILocation(line: 801, column: 8, scope: !79)
!996 = !DILocation(line: 816, column: 18, scope: !79)
!997 = !DILocation(line: 824, column: 29, scope: !998)
!998 = distinct !DILexicalBlock(scope: !999, file: !3, line: 819, column: 9)
!999 = distinct !DILexicalBlock(scope: !79, file: !3, line: 817, column: 5)
!1000 = !DILocalVariable(name: "var", arg: 1, scope: !1001, file: !3, line: 166, type: !91)
!1001 = distinct !DISubprogram(name: "append_unset_var", scope: !3, file: !3, line: 166, type: !730, scopeLine: 167, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1002)
!1002 = !{!1000}
!1003 = !DILocation(line: 0, scope: !1001, inlinedAt: !1004)
!1004 = distinct !DILocation(line: 824, column: 11, scope: !998)
!1005 = !DILocation(line: 168, column: 7, scope: !1006, inlinedAt: !1004)
!1006 = distinct !DILexicalBlock(scope: !1001, file: !3, line: 168, column: 7)
!1007 = !{!1008, !1008, i64 0}
!1008 = !{!"long", !706, i64 0}
!1009 = !DILocation(line: 168, column: 22, scope: !1006, inlinedAt: !1004)
!1010 = !DILocation(line: 168, column: 19, scope: !1006, inlinedAt: !1004)
!1011 = !DILocation(line: 168, column: 7, scope: !1001, inlinedAt: !1004)
!1012 = !DILocation(line: 170, column: 3, scope: !1001, inlinedAt: !1004)
!1013 = !DILocation(line: 169, column: 26, scope: !1006, inlinedAt: !1004)
!1014 = !DILocation(line: 0, scope: !36, inlinedAt: !1015)
!1015 = distinct !DILocation(line: 169, column: 14, scope: !1006, inlinedAt: !1004)
!1016 = !DILocation(line: 178, column: 9, scope: !1017, inlinedAt: !1015)
!1017 = distinct !DILexicalBlock(scope: !36, file: !35, line: 178, column: 7)
!1018 = !DILocation(line: 178, column: 7, scope: !36, inlinedAt: !1015)
!1019 = !DILocation(line: 180, column: 13, scope: !1020, inlinedAt: !1015)
!1020 = distinct !DILexicalBlock(scope: !1021, file: !35, line: 180, column: 11)
!1021 = distinct !DILexicalBlock(scope: !1017, file: !35, line: 179, column: 5)
!1022 = !DILocation(line: 180, column: 11, scope: !1021, inlinedAt: !1015)
!1023 = !DILocation(line: 191, column: 11, scope: !1024, inlinedAt: !1015)
!1024 = distinct !DILexicalBlock(scope: !1021, file: !35, line: 191, column: 11)
!1025 = !DILocation(line: 191, column: 11, scope: !1021, inlinedAt: !1015)
!1026 = !DILocation(line: 192, column: 9, scope: !1024, inlinedAt: !1015)
!1027 = !DILocation(line: 201, column: 11, scope: !1028, inlinedAt: !1015)
!1028 = distinct !DILexicalBlock(scope: !1029, file: !35, line: 200, column: 11)
!1029 = distinct !DILexicalBlock(scope: !1017, file: !35, line: 195, column: 5)
!1030 = !DILocation(line: 200, column: 11, scope: !1029, inlinedAt: !1015)
!1031 = !DILocation(line: 202, column: 9, scope: !1028, inlinedAt: !1015)
!1032 = !DILocation(line: 203, column: 14, scope: !1029, inlinedAt: !1015)
!1033 = !DILocation(line: 203, column: 18, scope: !1029, inlinedAt: !1015)
!1034 = !DILocation(line: 203, column: 9, scope: !1029, inlinedAt: !1015)
!1035 = !DILocation(line: 206, column: 7, scope: !36, inlinedAt: !1015)
!1036 = !DILocation(line: 207, column: 25, scope: !36, inlinedAt: !1015)
!1037 = !DILocation(line: 207, column: 10, scope: !36, inlinedAt: !1015)
!1038 = !DILocation(line: 169, column: 12, scope: !1006, inlinedAt: !1004)
!1039 = !DILocation(line: 169, column: 5, scope: !1006, inlinedAt: !1004)
!1040 = !DILocation(line: 170, column: 21, scope: !1001, inlinedAt: !1004)
!1041 = !DILocation(line: 170, column: 25, scope: !1001, inlinedAt: !1004)
!1042 = !DILocation(line: 825, column: 11, scope: !998)
!1043 = !DILocation(line: 827, column: 21, scope: !998)
!1044 = !DILocation(line: 828, column: 11, scope: !998)
!1045 = !DILocation(line: 831, column: 11, scope: !998)
!1046 = !DILocation(line: 833, column: 39, scope: !998)
!1047 = !DILocation(line: 833, column: 11, scope: !998)
!1048 = !DILocation(line: 834, column: 38, scope: !998)
!1049 = !DILocation(line: 834, column: 11, scope: !998)
!1050 = !DILocation(line: 835, column: 11, scope: !998)
!1051 = !DILocation(line: 837, column: 39, scope: !998)
!1052 = !DILocation(line: 837, column: 11, scope: !998)
!1053 = !DILocation(line: 838, column: 11, scope: !998)
!1054 = !DILocation(line: 840, column: 38, scope: !998)
!1055 = !DILocation(line: 840, column: 11, scope: !998)
!1056 = !DILocation(line: 841, column: 11, scope: !998)
!1057 = !DILocation(line: 843, column: 34, scope: !998)
!1058 = !DILocation(line: 844, column: 11, scope: !998)
!1059 = !DILocation(line: 846, column: 20, scope: !998)
!1060 = !DILocation(line: 847, column: 11, scope: !998)
!1061 = !DILocation(line: 849, column: 31, scope: !998)
!1062 = !DILocalVariable(name: "str", arg: 1, scope: !1063, file: !3, line: 536, type: !91)
!1063 = distinct !DISubprogram(name: "parse_split_string", scope: !3, file: !3, line: 536, type: !1064, scopeLine: 538, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1067)
!1064 = !DISubroutineType(types: !1065)
!1065 = !{null, !91, !129, !129, !1066}
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!1067 = !{!1062, !1068, !1069, !1070, !1071, !1072, !1073, !1074}
!1068 = !DILocalVariable(name: "orig_optind", arg: 2, scope: !1063, file: !3, line: 536, type: !129)
!1069 = !DILocalVariable(name: "orig_argc", arg: 3, scope: !1063, file: !3, line: 537, type: !129)
!1070 = !DILocalVariable(name: "orig_argv", arg: 4, scope: !1063, file: !3, line: 537, type: !1066)
!1071 = !DILocalVariable(name: "i", scope: !1063, file: !3, line: 539, type: !69)
!1072 = !DILocalVariable(name: "newargc", scope: !1063, file: !3, line: 539, type: !69)
!1073 = !DILocalVariable(name: "newargv", scope: !1063, file: !3, line: 540, type: !82)
!1074 = !DILocalVariable(name: "nextargv", scope: !1063, file: !3, line: 540, type: !82)
!1075 = !DILocation(line: 0, scope: !1063, inlinedAt: !1076)
!1076 = distinct !DILocation(line: 849, column: 11, scope: !998)
!1077 = !DILocation(line: 543, column: 3, scope: !1063, inlinedAt: !1076)
!1078 = !DILocation(line: 543, column: 10, scope: !1063, inlinedAt: !1076)
!1079 = !{!706, !706, i64 0}
!1080 = !{!1081, !1081, i64 0}
!1081 = !{!"short", !706, i64 0}
!1082 = !DILocation(line: 544, column: 8, scope: !1063, inlinedAt: !1076)
!1083 = distinct !{!1083, !1077, !1082, !760}
!1084 = !DILocation(line: 545, column: 12, scope: !1085, inlinedAt: !1076)
!1085 = distinct !DILexicalBlock(scope: !1063, file: !3, line: 545, column: 7)
!1086 = !DILocation(line: 545, column: 7, scope: !1063, inlinedAt: !1076)
!1087 = !DILocation(line: 548, column: 43, scope: !1063, inlinedAt: !1076)
!1088 = !DILocalVariable(name: "str", arg: 1, scope: !1089, file: !3, line: 373, type: !91)
!1089 = distinct !DISubprogram(name: "build_argv", scope: !3, file: !3, line: 373, type: !1090, scopeLine: 374, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1092)
!1090 = !DISubroutineType(types: !1091)
!1091 = !{!82, !91, !69}
!1092 = !{!1088, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1104, !1107, !1108}
!1093 = !DILocalVariable(name: "extra_argc", arg: 2, scope: !1089, file: !3, line: 373, type: !69)
!1094 = !DILocalVariable(name: "dq", scope: !1089, file: !3, line: 375, type: !88)
!1095 = !DILocalVariable(name: "sq", scope: !1089, file: !3, line: 375, type: !88)
!1096 = !DILocalVariable(name: "sep", scope: !1089, file: !3, line: 375, type: !88)
!1097 = !DILocalVariable(name: "dest", scope: !1089, file: !3, line: 376, type: !67)
!1098 = !DILocalVariable(name: "newargv", scope: !1089, file: !3, line: 378, type: !82)
!1099 = !DILocalVariable(name: "nextargv", scope: !1089, file: !3, line: 378, type: !82)
!1100 = !DILocalVariable(name: "newargc", scope: !1089, file: !3, line: 379, type: !69)
!1101 = !DILocalVariable(name: "buflen", scope: !1089, file: !3, line: 380, type: !41)
!1102 = !DILocalVariable(name: "newc", scope: !1103, file: !3, line: 416, type: !68)
!1103 = distinct !DILexicalBlock(scope: !1089, file: !3, line: 415, column: 5)
!1104 = !DILocalVariable(name: "n", scope: !1105, file: !3, line: 487, type: !67)
!1105 = distinct !DILexicalBlock(scope: !1106, file: !3, line: 486, column: 11)
!1106 = distinct !DILexicalBlock(scope: !1103, file: !3, line: 419, column: 9)
!1107 = !DILocalVariable(name: "v", scope: !1105, file: !3, line: 488, type: !67)
!1108 = !DILabel(scope: !1089, name: "eos", file: !3, line: 509)
!1109 = !DILocation(line: 0, scope: !1089, inlinedAt: !1110)
!1110 = distinct !DILocation(line: 548, column: 13, scope: !1063, inlinedAt: !1076)
!1111 = !DILocalVariable(name: "bufsize", arg: 2, scope: !1112, file: !3, line: 272, type: !40)
!1112 = distinct !DISubprogram(name: "validate_split_str", scope: !3, file: !3, line: 272, type: !1113, scopeLine: 274, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1115)
!1113 = !DISubroutineType(types: !1114)
!1114 = !{null, !91, !40, !129}
!1115 = !{!1116, !1111, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124}
!1116 = !DILocalVariable(name: "str", arg: 1, scope: !1112, file: !3, line: 272, type: !91)
!1117 = !DILocalVariable(name: "maxargc", arg: 3, scope: !1112, file: !3, line: 273, type: !129)
!1118 = !DILocalVariable(name: "dq", scope: !1112, file: !3, line: 275, type: !88)
!1119 = !DILocalVariable(name: "sq", scope: !1112, file: !3, line: 275, type: !88)
!1120 = !DILocalVariable(name: "sp", scope: !1112, file: !3, line: 275, type: !88)
!1121 = !DILocalVariable(name: "pch", scope: !1112, file: !3, line: 276, type: !91)
!1122 = !DILocalVariable(name: "buflen", scope: !1112, file: !3, line: 277, type: !41)
!1123 = !DILocalVariable(name: "cnt", scope: !1112, file: !3, line: 278, type: !69)
!1124 = !DILocalVariable(name: "next", scope: !1125, file: !3, line: 287, type: !92)
!1125 = distinct !DILexicalBlock(scope: !1112, file: !3, line: 286, column: 5)
!1126 = !DILocation(line: 0, scope: !1112, inlinedAt: !1127)
!1127 = distinct !DILocation(line: 397, column: 3, scope: !1089, inlinedAt: !1110)
!1128 = !DILocation(line: 283, column: 12, scope: !1112, inlinedAt: !1127)
!1129 = !DILocation(line: 283, column: 24, scope: !1112, inlinedAt: !1127)
!1130 = !DILocation(line: 285, column: 3, scope: !1112, inlinedAt: !1127)
!1131 = !DILocation(line: 289, column: 11, scope: !1132, inlinedAt: !1127)
!1132 = distinct !DILexicalBlock(scope: !1125, file: !3, line: 289, column: 11)
!1133 = !DILocation(line: 287, column: 30, scope: !1125, inlinedAt: !1127)
!1134 = !DILocation(line: 287, column: 25, scope: !1125, inlinedAt: !1127)
!1135 = !DILocation(line: 0, scope: !1125, inlinedAt: !1127)
!1136 = !DILocation(line: 289, column: 26, scope: !1132, inlinedAt: !1127)
!1137 = !DILocation(line: 300, column: 15, scope: !1125, inlinedAt: !1127)
!1138 = !DILocation(line: 300, column: 7, scope: !1125, inlinedAt: !1127)
!1139 = !DILocation(line: 303, column: 11, scope: !1140, inlinedAt: !1127)
!1140 = distinct !DILexicalBlock(scope: !1141, file: !3, line: 303, column: 11)
!1141 = distinct !DILexicalBlock(scope: !1142, file: !3, line: 303, column: 11)
!1142 = distinct !DILexicalBlock(scope: !1125, file: !3, line: 301, column: 9)
!1143 = !DILocation(line: 304, column: 14, scope: !1142, inlinedAt: !1127)
!1144 = !DILocation(line: 305, column: 11, scope: !1142, inlinedAt: !1127)
!1145 = !DILocation(line: 308, column: 11, scope: !1146, inlinedAt: !1127)
!1146 = distinct !DILexicalBlock(scope: !1147, file: !3, line: 308, column: 11)
!1147 = distinct !DILexicalBlock(scope: !1142, file: !3, line: 308, column: 11)
!1148 = !DILocation(line: 309, column: 14, scope: !1142, inlinedAt: !1127)
!1149 = !DILocation(line: 310, column: 11, scope: !1142, inlinedAt: !1127)
!1150 = !DILocation(line: 313, column: 15, scope: !1151, inlinedAt: !1127)
!1151 = distinct !DILexicalBlock(scope: !1142, file: !3, line: 313, column: 15)
!1152 = !DILocation(line: 313, column: 18, scope: !1151, inlinedAt: !1127)
!1153 = !DILocation(line: 314, column: 13, scope: !1151, inlinedAt: !1127)
!1154 = !DILocation(line: 317, column: 15, scope: !1142, inlinedAt: !1127)
!1155 = !DILocation(line: 318, column: 13, scope: !1156, inlinedAt: !1127)
!1156 = distinct !DILexicalBlock(scope: !1142, file: !3, line: 317, column: 15)
!1157 = !DILocation(line: 317, column: 15, scope: !1156, inlinedAt: !1127)
!1158 = !DILocation(line: 322, column: 13, scope: !1159, inlinedAt: !1127)
!1159 = distinct !DILexicalBlock(scope: !1142, file: !3, line: 321, column: 15)
!1160 = !DILocation(line: 324, column: 20, scope: !1161, inlinedAt: !1127)
!1161 = distinct !DILexicalBlock(scope: !1142, file: !3, line: 324, column: 15)
!1162 = !DILocation(line: 324, column: 15, scope: !1142, inlinedAt: !1127)
!1163 = !DILocation(line: 328, column: 11, scope: !1142, inlinedAt: !1127)
!1164 = !DILocation(line: 332, column: 15, scope: !1142, inlinedAt: !1127)
!1165 = !DILocation(line: 335, column: 23, scope: !1166, inlinedAt: !1127)
!1166 = distinct !DILexicalBlock(scope: !1142, file: !3, line: 335, column: 15)
!1167 = !DILocation(line: 335, column: 21, scope: !1166, inlinedAt: !1127)
!1168 = !DILocation(line: 335, column: 15, scope: !1142, inlinedAt: !1127)
!1169 = !DILocation(line: 336, column: 13, scope: !1166, inlinedAt: !1127)
!1170 = !DILocation(line: 339, column: 22, scope: !1171, inlinedAt: !1127)
!1171 = distinct !DILexicalBlock(scope: !1142, file: !3, line: 339, column: 15)
!1172 = !DILocation(line: 339, column: 20, scope: !1171, inlinedAt: !1127)
!1173 = !DILocation(line: 339, column: 15, scope: !1142, inlinedAt: !1127)
!1174 = !DILocation(line: 340, column: 23, scope: !1171, inlinedAt: !1127)
