source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [FILE]...\0A\00", align 1
@.str.2 = private unnamed_addr constant [66 x i8] c"Convert tabs in each FILE to spaces, writing to standard output.\0A\00", align 1
@stdout = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str.12 = private unnamed_addr constant [56 x i8] c"\0AWith no FILE, or when FILE is -, read standard input.\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "shortopts", scope: !2, file: !3, line: 51, type: !163, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !21, globals: !157, nameTableKind: None)
!3 = !DIFile(filename: "src/expand.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 46, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!9 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!10 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!14 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!15 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !32, !93, !97, !101, !105, !108, !111, !116, !131, !26, !83, !132, !136, !137, !141, !142, !145, !151, !30, !63, !155, !156}
!22 = !DISubprogram(name: "dcgettext", scope: !23, file: !23, line: 51, type: !24, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!23 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!24 = !DISubroutineType(types: !25)
!25 = !{!26, !28, !28, !30}
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!30 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!31 = !{}
!32 = !DISubprogram(name: "fputs_unlocked", scope: !33, file: !33, line: 662, type: !34, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!33 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!34 = !DISubroutineType(types: !35)
!35 = !{!30, !28, !36}
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !38, line: 49, size: 1728, elements: !39)
!38 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!39 = !{!40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !55, !56, !57, !58, !62, !64, !66, !70, !73, !75, !78, !81, !82, !84, !88, !89}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !37, file: !38, line: 51, baseType: !30, size: 32)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !37, file: !38, line: 54, baseType: !26, size: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !37, file: !38, line: 55, baseType: !26, size: 64, offset: 128)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !37, file: !38, line: 56, baseType: !26, size: 64, offset: 192)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !37, file: !38, line: 57, baseType: !26, size: 64, offset: 256)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !37, file: !38, line: 58, baseType: !26, size: 64, offset: 320)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !37, file: !38, line: 59, baseType: !26, size: 64, offset: 384)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !37, file: !38, line: 60, baseType: !26, size: 64, offset: 448)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !37, file: !38, line: 61, baseType: !26, size: 64, offset: 512)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !37, file: !38, line: 64, baseType: !26, size: 64, offset: 576)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !37, file: !38, line: 65, baseType: !26, size: 64, offset: 640)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !37, file: !38, line: 66, baseType: !26, size: 64, offset: 704)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !37, file: !38, line: 68, baseType: !53, size: 64, offset: 768)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !38, line: 36, flags: DIFlagFwdDecl)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !37, file: !38, line: 70, baseType: !36, size: 64, offset: 832)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !37, file: !38, line: 72, baseType: !30, size: 32, offset: 896)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !37, file: !38, line: 73, baseType: !30, size: 32, offset: 928)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !37, file: !38, line: 74, baseType: !59, size: 64, offset: 960)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !60, line: 152, baseType: !61)
!60 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!61 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !37, file: !38, line: 77, baseType: !63, size: 16, offset: 1024)
!63 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !37, file: !38, line: 78, baseType: !65, size: 8, offset: 1040)
!65 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !37, file: !38, line: 79, baseType: !67, size: 8, offset: 1048)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 8, elements: !68)
!68 = !{!69}
!69 = !DISubrange(count: 1)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !37, file: !38, line: 81, baseType: !71, size: 64, offset: 1088)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !38, line: 43, baseType: null)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !37, file: !38, line: 89, baseType: !74, size: 64, offset: 1152)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !60, line: 153, baseType: !61)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !37, file: !38, line: 91, baseType: !76, size: 64, offset: 1216)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !38, line: 37, flags: DIFlagFwdDecl)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !37, file: !38, line: 92, baseType: !79, size: 64, offset: 1280)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !38, line: 38, flags: DIFlagFwdDecl)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !37, file: !38, line: 93, baseType: !36, size: 64, offset: 1344)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !37, file: !38, line: 94, baseType: !83, size: 64, offset: 1408)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !37, file: !38, line: 95, baseType: !85, size: 64, offset: 1472)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !86, line: 46, baseType: !87)
!86 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!87 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !37, file: !38, line: 96, baseType: !30, size: 32, offset: 1536)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !37, file: !38, line: 98, baseType: !90, size: 160, offset: 1568)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 160, elements: !91)
!91 = !{!92}
!92 = !DISubrange(count: 20)
!93 = !DISubprogram(name: "emit_tab_list_info", scope: !94, file: !94, line: 76, type: !95, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!94 = !DIFile(filename: "src/expand-common.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!95 = !DISubroutineType(types: !96)
!96 = !{null}
!97 = !DISubprogram(name: "set_program_name", scope: !98, file: !98, line: 37, type: !99, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!98 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!99 = !DISubroutineType(types: !100)
!100 = !{null, !28}
!101 = !DISubprogram(name: "setlocale", scope: !102, file: !102, line: 122, type: !103, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!102 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!103 = !DISubroutineType(types: !104)
!104 = !{!26, !30, !28}
!105 = !DISubprogram(name: "bindtextdomain", scope: !23, file: !23, line: 86, type: !106, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!106 = !DISubroutineType(types: !107)
!107 = !{!26, !28, !28}
!108 = !DISubprogram(name: "textdomain", scope: !23, file: !23, line: 82, type: !109, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!109 = !DISubroutineType(types: !110)
!110 = !{!26, !28}
!111 = !DISubprogram(name: "atexit", scope: !112, file: !112, line: 595, type: !113, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!112 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!113 = !DISubroutineType(types: !114)
!114 = !{!30, !115}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!116 = !DISubprogram(name: "getopt_long", scope: !117, file: !117, line: 66, type: !118, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!117 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!118 = !DISubroutineType(types: !119)
!119 = !{!30, !30, !120, !28, !122, !129}
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !124)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !117, line: 50, size: 256, elements: !125)
!125 = !{!126, !127, !128, !130}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !124, file: !117, line: 52, baseType: !28, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !124, file: !117, line: 55, baseType: !30, size: 32, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !124, file: !117, line: 56, baseType: !129, size: 64, offset: 128)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !124, file: !117, line: 57, baseType: !30, size: 32, offset: 192)
!131 = !DISubprogram(name: "parse_tab_stops", scope: !94, file: !94, line: 44, type: !99, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!132 = !DISubprogram(name: "version_etc", scope: !133, file: !133, line: 69, type: !134, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!133 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!134 = !DISubroutineType(types: !135)
!135 = !{null, !36, !28, !28, !28, null}
!136 = !DISubprogram(name: "finalize_tab_stops", scope: !94, file: !94, line: 54, type: !95, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!137 = !DISubprogram(name: "set_file_list", scope: !94, file: !94, line: 61, type: !138, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!138 = !DISubroutineType(types: !139)
!139 = !{null, !140}
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!141 = !DISubprogram(name: "cleanup_file_list_stdin", scope: !94, file: !94, line: 72, type: !95, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!142 = !DISubprogram(name: "next_file", scope: !94, file: !94, line: 68, type: !143, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!143 = !DISubroutineType(types: !144)
!144 = !{!36, !36}
!145 = !DISubprogram(name: "get_next_tab_column", scope: !94, file: !94, line: 48, type: !146, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!146 = !DISubroutineType(types: !147)
!147 = !{!87, !87, !148, !149}
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!151 = !DISubprogram(name: "error", scope: !152, file: !152, line: 52, type: !153, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!152 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!153 = !DISubroutineType(types: !154)
!154 = !{null, !30, !30, !28, null}
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!157 = !{!0, !158}
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 53, type: !160, isLocal: true, isDefinition: true)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 1280, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 5)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 272, elements: !164)
!164 = !{!165}
!165 = !DISubrange(count: 34)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "convert_entire_line", scope: !168, file: !169, line: 33, type: !150, isDefinition: true)
!168 = distinct !DICompileUnit(language: DW_LANG_C99, file: !169, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !170, retainedTypes: !207, globals: !275, nameTableKind: None)
!169 = !DIFile(filename: "src/expand-common.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!170 = !{!5, !171, !185, !194}
!171 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !172, line: 32, baseType: !7, size: 32, elements: !173)
!172 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!173 = !{!174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184}
!174 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!175 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!176 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!177 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!178 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!179 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!180 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!181 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!182 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!183 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!184 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!185 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !186, line: 45, baseType: !7, size: 32, elements: !187)
!186 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!187 = !{!188, !189, !190, !191, !192, !193}
!188 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0, isUnsigned: true)
!189 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2, isUnsigned: true)
!190 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5, isUnsigned: true)
!191 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4, isUnsigned: true)
!192 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3, isUnsigned: true)
!193 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1, isUnsigned: true)
!194 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !196, file: !195, line: 186, baseType: !7, size: 32, elements: !205)
!195 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!196 = distinct !DISubprogram(name: "x2nrealloc", scope: !195, file: !195, line: 174, type: !197, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !168, retainedNodes: !200)
!197 = !DISubroutineType(types: !198)
!198 = !{!83, !83, !199, !85}
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!200 = !{!201, !202, !203, !204}
!201 = !DILocalVariable(name: "p", arg: 1, scope: !196, file: !195, line: 174, type: !83)
!202 = !DILocalVariable(name: "pn", arg: 2, scope: !196, file: !195, line: 174, type: !199)
!203 = !DILocalVariable(name: "s", arg: 3, scope: !196, file: !195, line: 174, type: !85)
!204 = !DILocalVariable(name: "n", scope: !196, file: !195, line: 176, type: !85)
!205 = !{!206}
!206 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!207 = !{!22, !151, !30, !63, !208, !7, !212, !83, !213, !216, !220, !223, !226, !261, !265, !268, !85, !271, !272}
!208 = !DISubprogram(name: "quote", scope: !209, file: !209, line: 44, type: !210, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!209 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!210 = !DISubroutineType(types: !211)
!211 = !{!28, !28}
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !214, line: 102, baseType: !215)
!214 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !60, line: 73, baseType: !87)
!216 = !DISubprogram(name: "xstrndup", scope: !217, file: !217, line: 23, type: !218, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!217 = !DIFile(filename: "./lib/xstrndup.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!218 = !DISubroutineType(types: !219)
!219 = !{!26, !28, !87}
!220 = !DISubprogram(name: "free", scope: !112, file: !112, line: 565, type: !221, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!221 = !DISubroutineType(types: !222)
!222 = !{null, !83}
!223 = !DISubprogram(name: "quotearg_n_style_colon", scope: !172, file: !172, line: 397, type: !224, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!224 = !DISubroutineType(types: !225)
!225 = !{!26, !30, !171, !28}
!226 = !DISubprogram(name: "clearerr_unlocked", scope: !33, file: !33, line: 765, type: !227, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!227 = !DISubroutineType(types: !228)
!228 = !{null, !229}
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !38, line: 49, size: 1728, elements: !231)
!231 = !{!232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !230, file: !38, line: 51, baseType: !30, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !230, file: !38, line: 54, baseType: !26, size: 64, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !230, file: !38, line: 55, baseType: !26, size: 64, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !230, file: !38, line: 56, baseType: !26, size: 64, offset: 192)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !230, file: !38, line: 57, baseType: !26, size: 64, offset: 256)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !230, file: !38, line: 58, baseType: !26, size: 64, offset: 320)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !230, file: !38, line: 59, baseType: !26, size: 64, offset: 384)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !230, file: !38, line: 60, baseType: !26, size: 64, offset: 448)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !230, file: !38, line: 61, baseType: !26, size: 64, offset: 512)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !230, file: !38, line: 64, baseType: !26, size: 64, offset: 576)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !230, file: !38, line: 65, baseType: !26, size: 64, offset: 640)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !230, file: !38, line: 66, baseType: !26, size: 64, offset: 704)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !230, file: !38, line: 68, baseType: !53, size: 64, offset: 768)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !230, file: !38, line: 70, baseType: !229, size: 64, offset: 832)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !230, file: !38, line: 72, baseType: !30, size: 32, offset: 896)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !230, file: !38, line: 73, baseType: !30, size: 32, offset: 928)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !230, file: !38, line: 74, baseType: !59, size: 64, offset: 960)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !230, file: !38, line: 77, baseType: !63, size: 16, offset: 1024)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !230, file: !38, line: 78, baseType: !65, size: 8, offset: 1040)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !230, file: !38, line: 79, baseType: !67, size: 8, offset: 1048)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !230, file: !38, line: 81, baseType: !71, size: 64, offset: 1088)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !230, file: !38, line: 89, baseType: !74, size: 64, offset: 1152)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !230, file: !38, line: 91, baseType: !76, size: 64, offset: 1216)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !230, file: !38, line: 92, baseType: !79, size: 64, offset: 1280)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !230, file: !38, line: 93, baseType: !229, size: 64, offset: 1344)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !230, file: !38, line: 94, baseType: !83, size: 64, offset: 1408)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !230, file: !38, line: 95, baseType: !85, size: 64, offset: 1472)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !230, file: !38, line: 96, baseType: !30, size: 32, offset: 1536)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !230, file: !38, line: 98, baseType: !90, size: 160, offset: 1568)
!261 = !DISubprogram(name: "rpl_fclose", scope: !262, file: !262, line: 672, type: !263, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!262 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!263 = !DISubroutineType(types: !264)
!264 = !{!30, !229}
!265 = !DISubprogram(name: "fadvise", scope: !186, file: !186, line: 72, type: !266, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!266 = !DISubroutineType(types: !267)
!267 = !{null, !229, !185}
!268 = !DISubprogram(name: "fputs_unlocked", scope: !33, file: !33, line: 662, type: !269, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!269 = !DISubroutineType(types: !270)
!270 = !{!30, !28, !229}
!271 = !DISubprogram(name: "xalloc_die", scope: !195, file: !195, line: 51, type: !95, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !31)
!272 = !DISubprogram(name: "xrealloc", scope: !195, file: !195, line: 59, type: !273, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!273 = !DISubroutineType(types: !274)
!274 = !{!83, !83, !87}
!275 = !{!166, !276, !278, !289, !291, !293, !295, !297, !299, !301, !303, !305, !310}
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(name: "exit_status", scope: !168, file: !169, line: 72, type: !30, isDefinition: true)
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(name: "prev_file", scope: !280, file: !169, line: 336, type: !26, isLocal: true, isDefinition: true)
!280 = distinct !DISubprogram(name: "next_file", scope: !169, file: !169, line: 334, type: !281, scopeLine: 335, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !168, retainedNodes: !286)
!281 = !DISubroutineType(types: !282)
!282 = !{!283, !283}
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !285, line: 7, baseType: !230)
!285 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "")
!286 = !{!287, !288}
!287 = !DILocalVariable(name: "fp", arg: 1, scope: !280, file: !169, line: 334, type: !283)
!288 = !DILocalVariable(name: "file", scope: !280, file: !169, line: 337, type: !26)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(name: "max_column_width", scope: !168, file: !169, line: 45, type: !85, isDefinition: true)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "first_free_tab", scope: !168, file: !169, line: 57, type: !85, isLocal: true, isDefinition: true)
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(name: "tab_list", scope: !168, file: !169, line: 50, type: !212, isLocal: true, isDefinition: true)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "n_tabs_allocated", scope: !168, file: !169, line: 53, type: !85, isLocal: true, isDefinition: true)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(name: "extend_size", scope: !168, file: !169, line: 39, type: !213, isLocal: true, isDefinition: true)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(name: "increment_size", scope: !168, file: !169, line: 42, type: !213, isLocal: true, isDefinition: true)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(name: "tab_size", scope: !168, file: !169, line: 36, type: !213, isLocal: true, isDefinition: true)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !168, file: !169, line: 69, type: !150, isLocal: true, isDefinition: true)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(name: "stdin_argv", scope: !168, file: !169, line: 63, type: !307, isLocal: true, isDefinition: true)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 128, elements: !308)
!308 = !{!309}
!309 = !DISubrange(count: 2)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(name: "file_list", scope: !168, file: !169, line: 60, type: !140, isLocal: true, isDefinition: true)
!312 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(name: "Version", scope: !315, file: !316, line: 2, type: !28, isDefinition: true)
!315 = distinct !DICompileUnit(language: DW_LANG_C99, file: !316, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !31, globals: !317, nameTableKind: None)
!316 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!317 = !{!313}
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "file_name", scope: !320, file: !321, line: 46, type: !28, isLocal: true, isDefinition: true)
!320 = distinct !DICompileUnit(language: DW_LANG_C99, file: !321, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !31, retainedTypes: !322, globals: !360, nameTableKind: None)
!321 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!322 = !{!323, !22, !359, !151}
!323 = !DISubprogram(name: "close_stream", scope: !324, file: !324, line: 2, type: !325, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!324 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!325 = !DISubroutineType(types: !326)
!326 = !{!30, !327}
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !38, line: 49, size: 1728, elements: !329)
!329 = !{!330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !328, file: !38, line: 51, baseType: !30, size: 32)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !328, file: !38, line: 54, baseType: !26, size: 64, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !328, file: !38, line: 55, baseType: !26, size: 64, offset: 128)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !328, file: !38, line: 56, baseType: !26, size: 64, offset: 192)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !328, file: !38, line: 57, baseType: !26, size: 64, offset: 256)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !328, file: !38, line: 58, baseType: !26, size: 64, offset: 320)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !328, file: !38, line: 59, baseType: !26, size: 64, offset: 384)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !328, file: !38, line: 60, baseType: !26, size: 64, offset: 448)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !328, file: !38, line: 61, baseType: !26, size: 64, offset: 512)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !328, file: !38, line: 64, baseType: !26, size: 64, offset: 576)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !328, file: !38, line: 65, baseType: !26, size: 64, offset: 640)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !328, file: !38, line: 66, baseType: !26, size: 64, offset: 704)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !328, file: !38, line: 68, baseType: !53, size: 64, offset: 768)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !328, file: !38, line: 70, baseType: !327, size: 64, offset: 832)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !328, file: !38, line: 72, baseType: !30, size: 32, offset: 896)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !328, file: !38, line: 73, baseType: !30, size: 32, offset: 928)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !328, file: !38, line: 74, baseType: !59, size: 64, offset: 960)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !328, file: !38, line: 77, baseType: !63, size: 16, offset: 1024)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !328, file: !38, line: 78, baseType: !65, size: 8, offset: 1040)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !328, file: !38, line: 79, baseType: !67, size: 8, offset: 1048)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !328, file: !38, line: 81, baseType: !71, size: 64, offset: 1088)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !328, file: !38, line: 89, baseType: !74, size: 64, offset: 1152)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !328, file: !38, line: 91, baseType: !76, size: 64, offset: 1216)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !328, file: !38, line: 92, baseType: !79, size: 64, offset: 1280)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !328, file: !38, line: 93, baseType: !327, size: 64, offset: 1344)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !328, file: !38, line: 94, baseType: !83, size: 64, offset: 1408)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !328, file: !38, line: 95, baseType: !85, size: 64, offset: 1472)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !328, file: !38, line: 96, baseType: !30, size: 32, offset: 1536)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !328, file: !38, line: 98, baseType: !90, size: 160, offset: 1568)
!359 = !DISubprogram(name: "quotearg_colon", scope: !172, file: !172, line: 391, type: !109, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!360 = !{!318, !361}
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !320, file: !321, line: 56, type: !150, isLocal: true, isDefinition: true)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "exit_failure", scope: !365, file: !366, line: 24, type: !368, isDefinition: true)
!365 = distinct !DICompileUnit(language: DW_LANG_C99, file: !366, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !31, globals: !367, nameTableKind: None)
!366 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!367 = !{!363}
!368 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !30)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(name: "program_name", scope: !371, file: !372, line: 33, type: !28, isDefinition: true)
!371 = distinct !DICompileUnit(language: DW_LANG_C99, file: !372, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !31, retainedTypes: !373, globals: !409, nameTableKind: None)
!372 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!373 = !{!83, !374, !26}
!374 = !DISubprogram(name: "fputs", scope: !33, file: !33, line: 626, type: !375, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!375 = !DISubroutineType(types: !376)
!376 = !{!30, !28, !377}
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !38, line: 49, size: 1728, elements: !379)
!379 = !{!380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !378, file: !38, line: 51, baseType: !30, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !378, file: !38, line: 54, baseType: !26, size: 64, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !378, file: !38, line: 55, baseType: !26, size: 64, offset: 128)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !378, file: !38, line: 56, baseType: !26, size: 64, offset: 192)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !378, file: !38, line: 57, baseType: !26, size: 64, offset: 256)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !378, file: !38, line: 58, baseType: !26, size: 64, offset: 320)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !378, file: !38, line: 59, baseType: !26, size: 64, offset: 384)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !378, file: !38, line: 60, baseType: !26, size: 64, offset: 448)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !378, file: !38, line: 61, baseType: !26, size: 64, offset: 512)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !378, file: !38, line: 64, baseType: !26, size: 64, offset: 576)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !378, file: !38, line: 65, baseType: !26, size: 64, offset: 640)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !378, file: !38, line: 66, baseType: !26, size: 64, offset: 704)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !378, file: !38, line: 68, baseType: !53, size: 64, offset: 768)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !378, file: !38, line: 70, baseType: !377, size: 64, offset: 832)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !378, file: !38, line: 72, baseType: !30, size: 32, offset: 896)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !378, file: !38, line: 73, baseType: !30, size: 32, offset: 928)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !378, file: !38, line: 74, baseType: !59, size: 64, offset: 960)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !378, file: !38, line: 77, baseType: !63, size: 16, offset: 1024)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !378, file: !38, line: 78, baseType: !65, size: 8, offset: 1040)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !378, file: !38, line: 79, baseType: !67, size: 8, offset: 1048)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !378, file: !38, line: 81, baseType: !71, size: 64, offset: 1088)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !378, file: !38, line: 89, baseType: !74, size: 64, offset: 1152)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !378, file: !38, line: 91, baseType: !76, size: 64, offset: 1216)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !378, file: !38, line: 92, baseType: !79, size: 64, offset: 1280)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !378, file: !38, line: 93, baseType: !377, size: 64, offset: 1344)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !378, file: !38, line: 94, baseType: !83, size: 64, offset: 1408)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !378, file: !38, line: 95, baseType: !85, size: 64, offset: 1472)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !378, file: !38, line: 96, baseType: !30, size: 32, offset: 1536)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !378, file: !38, line: 98, baseType: !90, size: 160, offset: 1568)
!409 = !{!369}
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !412, file: !413, line: 85, type: !509, isDefinition: true)
!412 = distinct !DICompileUnit(language: DW_LANG_C99, file: !413, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !414, retainedTypes: !420, globals: !482, nameTableKind: None)
!413 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!414 = !{!171, !415, !5}
!415 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !172, line: 242, baseType: !7, size: 32, elements: !416)
!416 = !{!417, !418, !419}
!417 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!418 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!419 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!420 = !{!421, !426, !220, !441, !30, !63, !444, !85, !461, !465, !22, !471, !475, !26, !479, !271, !272}
!421 = !DISubprogram(name: "xmemdup", scope: !195, file: !195, line: 62, type: !422, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!422 = !DISubroutineType(types: !423)
!423 = !{!83, !424, !87}
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!426 = !DISubprogram(name: "quotearg_alloc_mem", scope: !172, file: !172, line: 342, type: !427, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!427 = !DISubroutineType(types: !428)
!428 = !{!26, !28, !87, !148, !429}
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !431)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !413, line: 65, size: 448, elements: !432)
!432 = !{!433, !434, !435, !439, !440}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !431, file: !413, line: 68, baseType: !171, size: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !431, file: !413, line: 71, baseType: !30, size: 32, offset: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !431, file: !413, line: 75, baseType: !436, size: 256, offset: 64)
!436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !437)
!437 = !{!438}
!438 = !DISubrange(count: 8)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !431, file: !413, line: 78, baseType: !28, size: 64, offset: 320)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !431, file: !413, line: 81, baseType: !28, size: 64, offset: 384)
!441 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !172, file: !172, line: 408, type: !442, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!442 = !DISubroutineType(types: !443)
!443 = !{!26, !30, !28, !28, !28, !87}
!444 = !DISubprogram(name: "rpl_mbrtowc", scope: !445, file: !445, line: 717, type: !446, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!445 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!446 = !DISubroutineType(types: !447)
!447 = !{!87, !129, !28, !87, !448}
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !450, line: 13, size: 64, elements: !451)
!450 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!451 = !{!452, !453}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !449, file: !450, line: 15, baseType: !30, size: 32)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !449, file: !450, line: 20, baseType: !454, size: 32, offset: 32)
!454 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !449, file: !450, line: 16, size: 32, elements: !455)
!455 = !{!456, !457}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !454, file: !450, line: 18, baseType: !7, size: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !454, file: !450, line: 19, baseType: !458, size: 32)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 32, elements: !459)
!459 = !{!460}
!460 = !DISubrange(count: 4)
!461 = !DISubprogram(name: "iswprint", scope: !462, file: !462, line: 120, type: !463, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!462 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!463 = !DISubroutineType(types: !464)
!464 = !{!30, !7}
!465 = !DISubprogram(name: "mbsinit", scope: !466, file: !466, line: 292, type: !467, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!466 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!467 = !DISubroutineType(types: !468)
!468 = !{!30, !469}
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !449)
!471 = !DISubprogram(name: "locale_charset", scope: !472, file: !472, line: 35, type: !473, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!472 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!473 = !DISubroutineType(types: !474)
!474 = !{!28}
!475 = !DISubprogram(name: "c_strcasecmp", scope: !476, file: !476, line: 42, type: !477, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!476 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!477 = !DISubroutineType(types: !478)
!478 = !{!30, !28, !28}
!479 = !DISubprogram(name: "xmalloc", scope: !195, file: !195, line: 53, type: !480, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!480 = !DISubroutineType(types: !481)
!481 = !{!83, !87}
!482 = !{!410, !483, !489, !491, !493, !498, !505, !507}
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !412, file: !413, line: 101, type: !485, isDefinition: true)
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !486, size: 320, elements: !487)
!486 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !171)
!487 = !{!488}
!488 = !DISubrange(count: 10)
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !412, file: !413, line: 1052, type: !431, isDefinition: true)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !412, file: !413, line: 116, type: !431, isLocal: true, isDefinition: true)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(name: "slot0", scope: !412, file: !413, line: 842, type: !495, isLocal: true, isDefinition: true)
!495 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 2048, elements: !496)
!496 = !{!497}
!497 = !DISubrange(count: 256)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(name: "slotvec", scope: !412, file: !413, line: 845, type: !500, isLocal: true, isDefinition: true)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !413, line: 834, size: 128, elements: !502)
!502 = !{!503, !504}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !501, file: !413, line: 836, baseType: !85, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !501, file: !413, line: 837, baseType: !26, size: 64, offset: 64)
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(name: "nslots", scope: !412, file: !413, line: 843, type: !30, isLocal: true, isDefinition: true)
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(name: "slotvec0", scope: !412, file: !413, line: 844, type: !501, isLocal: true, isDefinition: true)
!509 = !DICompositeType(tag: DW_TAG_array_type, baseType: !510, size: 704, elements: !511)
!510 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!511 = !{!512}
!512 = !DISubrange(count: 11)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !515, file: !516, line: 26, type: !518, isDefinition: true)
!515 = distinct !DICompileUnit(language: DW_LANG_C99, file: !516, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !31, globals: !517, nameTableKind: None)
!516 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!517 = !{!513}
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 376, elements: !519)
!519 = !{!520}
!520 = !DISubrange(count: 47)
!521 = distinct !DICompileUnit(language: DW_LANG_C99, file: !522, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !523, retainedTypes: !524, nameTableKind: None)
!522 = !DIFile(filename: "lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!523 = !{!185}
!524 = !{!525, !529}
!525 = !DISubprogram(name: "posix_fadvise", scope: !526, file: !526, line: 288, type: !527, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!526 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
!527 = !DISubroutineType(types: !528)
!528 = !{!30, !30, !61, !61, !30}
!529 = !DISubprogram(name: "fileno", scope: !33, file: !33, line: 786, type: !530, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!530 = !DISubroutineType(types: !531)
!531 = !{!30, !532}
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !38, line: 49, size: 1728, elements: !534)
!534 = !{!535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !533, file: !38, line: 51, baseType: !30, size: 32)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !533, file: !38, line: 54, baseType: !26, size: 64, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !533, file: !38, line: 55, baseType: !26, size: 64, offset: 128)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !533, file: !38, line: 56, baseType: !26, size: 64, offset: 192)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !533, file: !38, line: 57, baseType: !26, size: 64, offset: 256)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !533, file: !38, line: 58, baseType: !26, size: 64, offset: 320)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !533, file: !38, line: 59, baseType: !26, size: 64, offset: 384)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !533, file: !38, line: 60, baseType: !26, size: 64, offset: 448)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !533, file: !38, line: 61, baseType: !26, size: 64, offset: 512)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !533, file: !38, line: 64, baseType: !26, size: 64, offset: 576)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !533, file: !38, line: 65, baseType: !26, size: 64, offset: 640)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !533, file: !38, line: 66, baseType: !26, size: 64, offset: 704)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !533, file: !38, line: 68, baseType: !53, size: 64, offset: 768)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !533, file: !38, line: 70, baseType: !532, size: 64, offset: 832)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !533, file: !38, line: 72, baseType: !30, size: 32, offset: 896)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !533, file: !38, line: 73, baseType: !30, size: 32, offset: 928)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !533, file: !38, line: 74, baseType: !59, size: 64, offset: 960)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !533, file: !38, line: 77, baseType: !63, size: 16, offset: 1024)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !533, file: !38, line: 78, baseType: !65, size: 8, offset: 1040)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !533, file: !38, line: 79, baseType: !67, size: 8, offset: 1048)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !533, file: !38, line: 81, baseType: !71, size: 64, offset: 1088)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !533, file: !38, line: 89, baseType: !74, size: 64, offset: 1152)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !533, file: !38, line: 91, baseType: !76, size: 64, offset: 1216)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !533, file: !38, line: 92, baseType: !79, size: 64, offset: 1280)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !533, file: !38, line: 93, baseType: !532, size: 64, offset: 1344)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !533, file: !38, line: 94, baseType: !83, size: 64, offset: 1408)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !533, file: !38, line: 95, baseType: !85, size: 64, offset: 1472)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !533, file: !38, line: 96, baseType: !30, size: 32, offset: 1536)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !533, file: !38, line: 98, baseType: !90, size: 160, offset: 1568)
!564 = distinct !DICompileUnit(language: DW_LANG_C99, file: !565, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !566, retainedTypes: !570, nameTableKind: None)
!565 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!566 = !{!567}
!567 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !565, line: 40, baseType: !7, size: 32, elements: !568)
!568 = !{!569}
!569 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!570 = !{!22, !571, !83}
!571 = !DISubprogram(name: "fputs_unlocked", scope: !33, file: !33, line: 662, type: !572, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!572 = !DISubroutineType(types: !573)
!573 = !{!30, !28, !574}
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !38, line: 49, size: 1728, elements: !576)
!576 = !{!577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !575, file: !38, line: 51, baseType: !30, size: 32)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !575, file: !38, line: 54, baseType: !26, size: 64, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !575, file: !38, line: 55, baseType: !26, size: 64, offset: 128)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !575, file: !38, line: 56, baseType: !26, size: 64, offset: 192)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !575, file: !38, line: 57, baseType: !26, size: 64, offset: 256)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !575, file: !38, line: 58, baseType: !26, size: 64, offset: 320)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !575, file: !38, line: 59, baseType: !26, size: 64, offset: 384)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !575, file: !38, line: 60, baseType: !26, size: 64, offset: 448)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !575, file: !38, line: 61, baseType: !26, size: 64, offset: 512)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !575, file: !38, line: 64, baseType: !26, size: 64, offset: 576)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !575, file: !38, line: 65, baseType: !26, size: 64, offset: 640)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !575, file: !38, line: 66, baseType: !26, size: 64, offset: 704)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !575, file: !38, line: 68, baseType: !53, size: 64, offset: 768)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !575, file: !38, line: 70, baseType: !574, size: 64, offset: 832)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !575, file: !38, line: 72, baseType: !30, size: 32, offset: 896)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !575, file: !38, line: 73, baseType: !30, size: 32, offset: 928)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !575, file: !38, line: 74, baseType: !59, size: 64, offset: 960)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !575, file: !38, line: 77, baseType: !63, size: 16, offset: 1024)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !575, file: !38, line: 78, baseType: !65, size: 8, offset: 1040)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !575, file: !38, line: 79, baseType: !67, size: 8, offset: 1048)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !575, file: !38, line: 81, baseType: !71, size: 64, offset: 1088)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !575, file: !38, line: 89, baseType: !74, size: 64, offset: 1152)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !575, file: !38, line: 91, baseType: !76, size: 64, offset: 1216)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !575, file: !38, line: 92, baseType: !79, size: 64, offset: 1280)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !575, file: !38, line: 93, baseType: !574, size: 64, offset: 1344)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !575, file: !38, line: 94, baseType: !83, size: 64, offset: 1408)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !575, file: !38, line: 95, baseType: !85, size: 64, offset: 1472)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !575, file: !38, line: 96, baseType: !30, size: 32, offset: 1536)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !575, file: !38, line: 98, baseType: !90, size: 160, offset: 1568)
!606 = distinct !DICompileUnit(language: DW_LANG_C99, file: !607, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !608, retainedTypes: !616, nameTableKind: None)
!607 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!608 = !{!609}
!609 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !610, file: !195, line: 186, baseType: !7, size: 32, elements: !205)
!610 = distinct !DISubprogram(name: "x2nrealloc", scope: !195, file: !195, line: 174, type: !197, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !606, retainedNodes: !611)
!611 = !{!612, !613, !614, !615}
!612 = !DILocalVariable(name: "p", arg: 1, scope: !610, file: !195, line: 174, type: !83)
!613 = !DILocalVariable(name: "pn", arg: 2, scope: !610, file: !195, line: 174, type: !199)
!614 = !DILocalVariable(name: "s", arg: 3, scope: !610, file: !195, line: 174, type: !85)
!615 = !DILocalVariable(name: "n", scope: !610, file: !195, line: 176, type: !85)
!616 = !{!85, !271, !479, !272, !26, !220, !83, !617, !620}
!617 = !DISubprogram(name: "xcalloc", scope: !195, file: !195, line: 57, type: !618, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!618 = !DISubroutineType(types: !619)
!619 = !{!83, !87, !87}
!620 = !DISubprogram(name: "rpl_calloc", scope: !621, file: !621, line: 688, type: !618, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!621 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!622 = distinct !DICompileUnit(language: DW_LANG_C99, file: !623, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !31, retainedTypes: !624, nameTableKind: None)
!623 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!624 = !{!22, !151}
!625 = distinct !DICompileUnit(language: DW_LANG_C99, file: !626, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !31, retainedTypes: !627, nameTableKind: None)
!626 = !DIFile(filename: "lib/xstrndup.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!627 = !{!271}
!628 = distinct !DICompileUnit(language: DW_LANG_C99, file: !629, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !31, retainedTypes: !630, nameTableKind: None)
!629 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!630 = !{!83}
!631 = distinct !DICompileUnit(language: DW_LANG_C99, file: !632, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !31, retainedTypes: !633, nameTableKind: None)
!632 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!633 = !{!634, !669, !670, !674}
!634 = !DISubprogram(name: "fileno", scope: !33, file: !33, line: 786, type: !635, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!635 = !DISubroutineType(types: !636)
!636 = !{!30, !637}
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !38, line: 49, size: 1728, elements: !639)
!639 = !{!640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !638, file: !38, line: 51, baseType: !30, size: 32)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !638, file: !38, line: 54, baseType: !26, size: 64, offset: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !638, file: !38, line: 55, baseType: !26, size: 64, offset: 128)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !638, file: !38, line: 56, baseType: !26, size: 64, offset: 192)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !638, file: !38, line: 57, baseType: !26, size: 64, offset: 256)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !638, file: !38, line: 58, baseType: !26, size: 64, offset: 320)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !638, file: !38, line: 59, baseType: !26, size: 64, offset: 384)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !638, file: !38, line: 60, baseType: !26, size: 64, offset: 448)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !638, file: !38, line: 61, baseType: !26, size: 64, offset: 512)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !638, file: !38, line: 64, baseType: !26, size: 64, offset: 576)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !638, file: !38, line: 65, baseType: !26, size: 64, offset: 640)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !638, file: !38, line: 66, baseType: !26, size: 64, offset: 704)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !638, file: !38, line: 68, baseType: !53, size: 64, offset: 768)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !638, file: !38, line: 70, baseType: !637, size: 64, offset: 832)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !638, file: !38, line: 72, baseType: !30, size: 32, offset: 896)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !638, file: !38, line: 73, baseType: !30, size: 32, offset: 928)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !638, file: !38, line: 74, baseType: !59, size: 64, offset: 960)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !638, file: !38, line: 77, baseType: !63, size: 16, offset: 1024)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !638, file: !38, line: 78, baseType: !65, size: 8, offset: 1040)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !638, file: !38, line: 79, baseType: !67, size: 8, offset: 1048)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !638, file: !38, line: 81, baseType: !71, size: 64, offset: 1088)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !638, file: !38, line: 89, baseType: !74, size: 64, offset: 1152)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !638, file: !38, line: 91, baseType: !76, size: 64, offset: 1216)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !638, file: !38, line: 92, baseType: !79, size: 64, offset: 1280)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !638, file: !38, line: 93, baseType: !637, size: 64, offset: 1344)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !638, file: !38, line: 94, baseType: !83, size: 64, offset: 1408)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !638, file: !38, line: 95, baseType: !85, size: 64, offset: 1472)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !638, file: !38, line: 96, baseType: !30, size: 32, offset: 1536)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !638, file: !38, line: 98, baseType: !90, size: 160, offset: 1568)
!669 = !DISubprogram(name: "fclose", scope: !33, file: !33, line: 213, type: !635, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!670 = !DISubprogram(name: "lseek", scope: !671, file: !671, line: 334, type: !672, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!671 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!672 = !DISubroutineType(types: !673)
!673 = !{!61, !30, !61, !30}
!674 = !DISubprogram(name: "rpl_fflush", scope: !262, file: !262, line: 718, type: !635, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!675 = distinct !DICompileUnit(language: DW_LANG_C99, file: !676, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !31, retainedTypes: !677, nameTableKind: None)
!676 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!677 = !{!83, !678, !713}
!678 = !DISubprogram(name: "fflush", scope: !33, file: !33, line: 218, type: !679, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!679 = !DISubroutineType(types: !680)
!680 = !{!30, !681}
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !38, line: 49, size: 1728, elements: !683)
!683 = !{!684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !682, file: !38, line: 51, baseType: !30, size: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !682, file: !38, line: 54, baseType: !26, size: 64, offset: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !682, file: !38, line: 55, baseType: !26, size: 64, offset: 128)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !682, file: !38, line: 56, baseType: !26, size: 64, offset: 192)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !682, file: !38, line: 57, baseType: !26, size: 64, offset: 256)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !682, file: !38, line: 58, baseType: !26, size: 64, offset: 320)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !682, file: !38, line: 59, baseType: !26, size: 64, offset: 384)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !682, file: !38, line: 60, baseType: !26, size: 64, offset: 448)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !682, file: !38, line: 61, baseType: !26, size: 64, offset: 512)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !682, file: !38, line: 64, baseType: !26, size: 64, offset: 576)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !682, file: !38, line: 65, baseType: !26, size: 64, offset: 640)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !682, file: !38, line: 66, baseType: !26, size: 64, offset: 704)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !682, file: !38, line: 68, baseType: !53, size: 64, offset: 768)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !682, file: !38, line: 70, baseType: !681, size: 64, offset: 832)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !682, file: !38, line: 72, baseType: !30, size: 32, offset: 896)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !682, file: !38, line: 73, baseType: !30, size: 32, offset: 928)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !682, file: !38, line: 74, baseType: !59, size: 64, offset: 960)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !682, file: !38, line: 77, baseType: !63, size: 16, offset: 1024)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !682, file: !38, line: 78, baseType: !65, size: 8, offset: 1040)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !682, file: !38, line: 79, baseType: !67, size: 8, offset: 1048)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !682, file: !38, line: 81, baseType: !71, size: 64, offset: 1088)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !682, file: !38, line: 89, baseType: !74, size: 64, offset: 1152)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !682, file: !38, line: 91, baseType: !76, size: 64, offset: 1216)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !682, file: !38, line: 92, baseType: !79, size: 64, offset: 1280)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !682, file: !38, line: 93, baseType: !681, size: 64, offset: 1344)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !682, file: !38, line: 94, baseType: !83, size: 64, offset: 1408)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !682, file: !38, line: 95, baseType: !85, size: 64, offset: 1472)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !682, file: !38, line: 96, baseType: !30, size: 32, offset: 1536)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !682, file: !38, line: 98, baseType: !90, size: 160, offset: 1568)
!713 = !DISubprogram(name: "rpl_fseeko", scope: !262, file: !262, line: 1034, type: !714, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!714 = !DISubroutineType(types: !715)
!715 = !{!30, !681, !61, !30}
!716 = distinct !DICompileUnit(language: DW_LANG_C99, file: !717, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !31, retainedTypes: !718, nameTableKind: None)
!717 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!718 = !{!83, !719, !670, !754}
!719 = !DISubprogram(name: "fileno", scope: !33, file: !33, line: 786, type: !720, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!720 = !DISubroutineType(types: !721)
!721 = !{!30, !722}
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !38, line: 49, size: 1728, elements: !724)
!724 = !{!725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !723, file: !38, line: 51, baseType: !30, size: 32)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !723, file: !38, line: 54, baseType: !26, size: 64, offset: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !723, file: !38, line: 55, baseType: !26, size: 64, offset: 128)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !723, file: !38, line: 56, baseType: !26, size: 64, offset: 192)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !723, file: !38, line: 57, baseType: !26, size: 64, offset: 256)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !723, file: !38, line: 58, baseType: !26, size: 64, offset: 320)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !723, file: !38, line: 59, baseType: !26, size: 64, offset: 384)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !723, file: !38, line: 60, baseType: !26, size: 64, offset: 448)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !723, file: !38, line: 61, baseType: !26, size: 64, offset: 512)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !723, file: !38, line: 64, baseType: !26, size: 64, offset: 576)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !723, file: !38, line: 65, baseType: !26, size: 64, offset: 640)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !723, file: !38, line: 66, baseType: !26, size: 64, offset: 704)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !723, file: !38, line: 68, baseType: !53, size: 64, offset: 768)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !723, file: !38, line: 70, baseType: !722, size: 64, offset: 832)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !723, file: !38, line: 72, baseType: !30, size: 32, offset: 896)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !723, file: !38, line: 73, baseType: !30, size: 32, offset: 928)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !723, file: !38, line: 74, baseType: !59, size: 64, offset: 960)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !723, file: !38, line: 77, baseType: !63, size: 16, offset: 1024)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !723, file: !38, line: 78, baseType: !65, size: 8, offset: 1040)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !723, file: !38, line: 79, baseType: !67, size: 8, offset: 1048)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !723, file: !38, line: 81, baseType: !71, size: 64, offset: 1088)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !723, file: !38, line: 89, baseType: !74, size: 64, offset: 1152)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !723, file: !38, line: 91, baseType: !76, size: 64, offset: 1216)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !723, file: !38, line: 92, baseType: !79, size: 64, offset: 1280)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !723, file: !38, line: 93, baseType: !722, size: 64, offset: 1344)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !723, file: !38, line: 94, baseType: !83, size: 64, offset: 1408)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !723, file: !38, line: 95, baseType: !85, size: 64, offset: 1472)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !723, file: !38, line: 96, baseType: !30, size: 32, offset: 1536)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !723, file: !38, line: 98, baseType: !90, size: 160, offset: 1568)
!754 = !DISubprogram(name: "fseeko", scope: !33, file: !33, line: 707, type: !755, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!755 = !DISubroutineType(types: !756)
!756 = !{!30, !722, !61, !30}
!757 = distinct !DICompileUnit(language: DW_LANG_C99, file: !758, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !31, retainedTypes: !759, nameTableKind: None)
!758 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!759 = !{!760, !85, !772}
!760 = !DISubprogram(name: "mbrtowc", scope: !466, file: !466, line: 296, type: !761, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!761 = !DISubroutineType(types: !762)
!762 = !{!87, !129, !28, !87, !763}
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !450, line: 13, size: 64, elements: !765)
!765 = !{!766, !767}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !764, file: !450, line: 15, baseType: !30, size: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !764, file: !450, line: 20, baseType: !768, size: 32, offset: 32)
!768 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !764, file: !450, line: 16, size: 32, elements: !769)
!769 = !{!770, !771}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !768, file: !450, line: 18, baseType: !7, size: 32)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !768, file: !450, line: 19, baseType: !458, size: 32)
!772 = !DISubprogram(name: "hard_locale", scope: !773, file: !773, line: 26, type: !774, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!773 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!774 = !DISubroutineType(types: !775)
!775 = !{!150, !30}
!776 = distinct !DICompileUnit(language: DW_LANG_C99, file: !777, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !31, retainedTypes: !778, nameTableKind: None)
!777 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!778 = !{!779}
!779 = !DISubprogram(name: "rpl_fclose", scope: !262, file: !262, line: 672, type: !780, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!780 = !DISubroutineType(types: !781)
!781 = !{!30, !782}
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !38, line: 49, size: 1728, elements: !784)
!784 = !{!785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !783, file: !38, line: 51, baseType: !30, size: 32)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !783, file: !38, line: 54, baseType: !26, size: 64, offset: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !783, file: !38, line: 55, baseType: !26, size: 64, offset: 128)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !783, file: !38, line: 56, baseType: !26, size: 64, offset: 192)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !783, file: !38, line: 57, baseType: !26, size: 64, offset: 256)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !783, file: !38, line: 58, baseType: !26, size: 64, offset: 320)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !783, file: !38, line: 59, baseType: !26, size: 64, offset: 384)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !783, file: !38, line: 60, baseType: !26, size: 64, offset: 448)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !783, file: !38, line: 61, baseType: !26, size: 64, offset: 512)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !783, file: !38, line: 64, baseType: !26, size: 64, offset: 576)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !783, file: !38, line: 65, baseType: !26, size: 64, offset: 640)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !783, file: !38, line: 66, baseType: !26, size: 64, offset: 704)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !783, file: !38, line: 68, baseType: !53, size: 64, offset: 768)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !783, file: !38, line: 70, baseType: !782, size: 64, offset: 832)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !783, file: !38, line: 72, baseType: !30, size: 32, offset: 896)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !783, file: !38, line: 73, baseType: !30, size: 32, offset: 928)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !783, file: !38, line: 74, baseType: !59, size: 64, offset: 960)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !783, file: !38, line: 77, baseType: !63, size: 16, offset: 1024)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !783, file: !38, line: 78, baseType: !65, size: 8, offset: 1040)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !783, file: !38, line: 79, baseType: !67, size: 8, offset: 1048)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !783, file: !38, line: 81, baseType: !71, size: 64, offset: 1088)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !783, file: !38, line: 89, baseType: !74, size: 64, offset: 1152)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !783, file: !38, line: 91, baseType: !76, size: 64, offset: 1216)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !783, file: !38, line: 92, baseType: !79, size: 64, offset: 1280)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !783, file: !38, line: 93, baseType: !782, size: 64, offset: 1344)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !783, file: !38, line: 94, baseType: !83, size: 64, offset: 1408)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !783, file: !38, line: 95, baseType: !85, size: 64, offset: 1472)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !783, file: !38, line: 96, baseType: !30, size: 32, offset: 1536)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !783, file: !38, line: 98, baseType: !90, size: 160, offset: 1568)
!814 = distinct !DICompileUnit(language: DW_LANG_C99, file: !815, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !31, retainedTypes: !816, nameTableKind: None)
!815 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!816 = !{!817}
!817 = !DISubprogram(name: "setlocale_null_r", scope: !818, file: !818, line: 64, type: !819, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !31)
!818 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!819 = !DISubroutineType(types: !820)
!820 = !{!30, !30, !26, !87}
!821 = distinct !DICompileUnit(language: DW_LANG_C99, file: !822, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !823, retainedTypes: !1210, nameTableKind: None)
!822 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!823 = !{!824}
!824 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !825, line: 41, baseType: !7, size: 32, elements: !826)
!825 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!826 = !{!827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209}
!827 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!828 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!829 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!830 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!831 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!832 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!833 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!834 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!835 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!836 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!837 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!838 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!839 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!840 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!841 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!842 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!843 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!844 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!845 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!846 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!847 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!848 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!849 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!850 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!851 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!852 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!853 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!854 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!855 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!856 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!857 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!858 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!859 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!860 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!861 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!862 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!863 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!864 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!865 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!866 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!867 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!868 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!869 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!870 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!871 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!872 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!873 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!874 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!875 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!876 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!884 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!885 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!886 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!887 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!894 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!895 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!896 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!898 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!899 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!900 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!901 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!902 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!903 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!904 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!905 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!906 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!907 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!908 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!909 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!910 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!911 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!912 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!913 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!914 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!915 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!916 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!917 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!918 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!919 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!920 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!921 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!922 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!923 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!924 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!925 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!926 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!927 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!928 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!929 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!930 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!931 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!932 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!933 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
