source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [FILE]...\0A\00", align 1
@.str.2 = private unnamed_addr constant [66 x i8] c"Convert tabs in each FILE to spaces, writing to standard output.\0A\00", align 1
@stdout = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str.12 = private unnamed_addr constant [56 x i8] c"\0AWith no FILE, or when FILE is -, read standard input.\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "shortopts", scope: !2, file: !3, line: 51, type: !46, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !21, globals: !29)
!3 = !DIFile(filename: "src/expand.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 46, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!9 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!10 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!14 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!15 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !24, !25, !26, !27, !28}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!25 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!26 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!29 = !{!0, !30}
!30 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression())
!31 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 53, type: !32, isLocal: true, isDefinition: true)
!32 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 1280, elements: !44)
!33 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !35, line: 50, size: 256, elements: !36)
!35 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!36 = !{!37, !40, !41, !43}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !34, file: !35, line: 52, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !34, file: !35, line: 55, baseType: !25, size: 32, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !34, file: !35, line: 56, baseType: !42, size: 64, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !34, file: !35, line: 57, baseType: !25, size: 32, offset: 192)
!44 = !{!45}
!45 = !DISubrange(count: 5)
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 272, elements: !47)
!47 = !{!48}
!48 = !DISubrange(count: 34)
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(name: "convert_entire_line", scope: !51, file: !52, line: 33, type: !180, isDefinition: true)
!51 = distinct !DICompileUnit(language: DW_LANG_C99, file: !52, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !53, retainedTypes: !93, globals: !99)
!52 = !DIFile(filename: "src/expand-common.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!53 = !{!5, !54, !68, !77}
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !55, line: 32, baseType: !7, size: 32, elements: !56)
!55 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!56 = !{!57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67}
!57 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!58 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!59 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!60 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!61 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!62 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!63 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!64 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!65 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!66 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!67 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !69, line: 45, baseType: !7, size: 32, elements: !70)
!69 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!70 = !{!71, !72, !73, !74, !75, !76}
!71 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0, isUnsigned: true)
!72 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2, isUnsigned: true)
!73 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5, isUnsigned: true)
!74 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4, isUnsigned: true)
!75 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3, isUnsigned: true)
!76 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1, isUnsigned: true)
!77 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !79, file: !78, line: 186, baseType: !7, size: 32, elements: !91)
!78 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!79 = distinct !DISubprogram(name: "x2nrealloc", scope: !78, file: !78, line: 174, type: !80, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: true, unit: !51, retainedNodes: !86)
!80 = !DISubroutineType(types: !81)
!81 = !{!24, !24, !82, !83}
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !84, line: 62, baseType: !85)
!84 = !DIFile(filename: "/usr/lib/clang/7.0.0/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!85 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!86 = !{!87, !88, !89, !90}
!87 = !DILocalVariable(name: "p", arg: 1, scope: !79, file: !78, line: 174, type: !24)
!88 = !DILocalVariable(name: "pn", arg: 2, scope: !79, file: !78, line: 174, type: !82)
!89 = !DILocalVariable(name: "s", arg: 3, scope: !79, file: !78, line: 174, type: !83)
!90 = !DILocalVariable(name: "n", scope: !79, file: !78, line: 176, type: !83)
!91 = !{!92}
!92 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!93 = !{!25, !26, !7, !94, !24, !95, !83}
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !96, line: 102, baseType: !97)
!96 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !98, line: 72, baseType: !85)
!98 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!99 = !{!49, !100, !102, !164, !166, !168, !170, !172, !174, !176, !178, !181, !186}
!100 = !DIGlobalVariableExpression(var: !101, expr: !DIExpression())
!101 = distinct !DIGlobalVariable(name: "exit_status", scope: !51, file: !52, line: 72, type: !25, isDefinition: true)
!102 = !DIGlobalVariableExpression(var: !103, expr: !DIExpression())
!103 = distinct !DIGlobalVariable(name: "prev_file", scope: !104, file: !52, line: 336, type: !22, isLocal: true, isDefinition: true)
!104 = distinct !DISubprogram(name: "next_file", scope: !52, file: !52, line: 334, type: !105, isDefinition: true, scopeLine: 335, flags: DIFlagPrototyped, isOptimized: true, unit: !51, retainedNodes: !161)
!105 = !DISubroutineType(types: !106)
!106 = !{!107, !107}
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !109, line: 7, baseType: !110)
!109 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !111, line: 49, size: 1728, elements: !112)
!111 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!112 = !{!113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !128, !130, !131, !132, !135, !136, !138, !142, !145, !147, !150, !153, !154, !155, !156, !157}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !110, file: !111, line: 51, baseType: !25, size: 32)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !110, file: !111, line: 54, baseType: !22, size: 64, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !110, file: !111, line: 55, baseType: !22, size: 64, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !110, file: !111, line: 56, baseType: !22, size: 64, offset: 192)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !110, file: !111, line: 57, baseType: !22, size: 64, offset: 256)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !110, file: !111, line: 58, baseType: !22, size: 64, offset: 320)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !110, file: !111, line: 59, baseType: !22, size: 64, offset: 384)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !110, file: !111, line: 60, baseType: !22, size: 64, offset: 448)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !110, file: !111, line: 61, baseType: !22, size: 64, offset: 512)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !110, file: !111, line: 64, baseType: !22, size: 64, offset: 576)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !110, file: !111, line: 65, baseType: !22, size: 64, offset: 640)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !110, file: !111, line: 66, baseType: !22, size: 64, offset: 704)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !110, file: !111, line: 68, baseType: !126, size: 64, offset: 768)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !111, line: 36, flags: DIFlagFwdDecl)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !110, file: !111, line: 70, baseType: !129, size: 64, offset: 832)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !110, file: !111, line: 72, baseType: !25, size: 32, offset: 896)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !110, file: !111, line: 73, baseType: !25, size: 32, offset: 928)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !110, file: !111, line: 74, baseType: !133, size: 64, offset: 960)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !98, line: 150, baseType: !134)
!134 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !110, file: !111, line: 77, baseType: !26, size: 16, offset: 1024)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !110, file: !111, line: 78, baseType: !137, size: 8, offset: 1040)
!137 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !110, file: !111, line: 79, baseType: !139, size: 8, offset: 1048)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 8, elements: !140)
!140 = !{!141}
!141 = !DISubrange(count: 1)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !110, file: !111, line: 81, baseType: !143, size: 64, offset: 1088)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !111, line: 43, baseType: null)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !110, file: !111, line: 89, baseType: !146, size: 64, offset: 1152)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !98, line: 151, baseType: !134)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !110, file: !111, line: 91, baseType: !148, size: 64, offset: 1216)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !111, line: 37, flags: DIFlagFwdDecl)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !110, file: !111, line: 92, baseType: !151, size: 64, offset: 1280)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !111, line: 38, flags: DIFlagFwdDecl)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !110, file: !111, line: 93, baseType: !129, size: 64, offset: 1344)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !110, file: !111, line: 94, baseType: !24, size: 64, offset: 1408)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !110, file: !111, line: 95, baseType: !83, size: 64, offset: 1472)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !110, file: !111, line: 96, baseType: !25, size: 32, offset: 1536)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !110, file: !111, line: 98, baseType: !158, size: 160, offset: 1568)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 160, elements: !159)
!159 = !{!160}
!160 = !DISubrange(count: 20)
!161 = !{!162, !163}
!162 = !DILocalVariable(name: "fp", arg: 1, scope: !104, file: !52, line: 334, type: !107)
!163 = !DILocalVariable(name: "file", scope: !104, file: !52, line: 337, type: !22)
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(name: "max_column_width", scope: !51, file: !52, line: 45, type: !83, isDefinition: true)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "first_free_tab", scope: !51, file: !52, line: 57, type: !83, isLocal: true, isDefinition: true)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "tab_list", scope: !51, file: !52, line: 50, type: !94, isLocal: true, isDefinition: true)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "n_tabs_allocated", scope: !51, file: !52, line: 53, type: !83, isLocal: true, isDefinition: true)
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(name: "extend_size", scope: !51, file: !52, line: 39, type: !95, isLocal: true, isDefinition: true)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(name: "increment_size", scope: !51, file: !52, line: 42, type: !95, isLocal: true, isDefinition: true)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(name: "tab_size", scope: !51, file: !52, line: 36, type: !95, isLocal: true, isDefinition: true)
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !51, file: !52, line: 69, type: !180, isLocal: true, isDefinition: true)
!180 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "stdin_argv", scope: !51, file: !52, line: 63, type: !183, isLocal: true, isDefinition: true)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 128, elements: !184)
!184 = !{!185}
!185 = !DISubrange(count: 2)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "file_list", scope: !51, file: !52, line: 60, type: !188, isLocal: true, isDefinition: true)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!189 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(name: "Version", scope: !192, file: !193, line: 2, type: !38, isDefinition: true)
!192 = distinct !DICompileUnit(language: DW_LANG_C99, file: !193, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !194, globals: !195)
!193 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!194 = !{}
!195 = !{!190}
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "file_name", scope: !198, file: !203, line: 46, type: !38, isLocal: true, isDefinition: true)
!198 = distinct !DICompileUnit(language: DW_LANG_C99, file: !199, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !194, globals: !200)
!199 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!200 = !{!196, !201}
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !198, file: !203, line: 56, type: !180, isLocal: true, isDefinition: true)
!203 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(name: "exit_failure", scope: !206, file: !209, line: 24, type: !210, isDefinition: true)
!206 = distinct !DICompileUnit(language: DW_LANG_C99, file: !207, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !194, globals: !208)
!207 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!208 = !{!204}
!209 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!210 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !25)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "program_name", scope: !213, file: !217, line: 33, type: !38, isDefinition: true)
!213 = distinct !DICompileUnit(language: DW_LANG_C99, file: !214, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !194, retainedTypes: !215, globals: !216)
!214 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!215 = !{!24, !22}
!216 = !{!211}
!217 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !220, file: !232, line: 85, type: !267, isDefinition: true)
!220 = distinct !DICompileUnit(language: DW_LANG_C99, file: !221, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !222, retainedTypes: !228, globals: !229)
!221 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!222 = !{!54, !223, !5}
!223 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !55, line: 242, baseType: !7, size: 32, elements: !224)
!224 = !{!225, !226, !227}
!225 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!226 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!227 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!228 = !{!25, !26, !83, !22}
!229 = !{!218, !230, !237, !249, !251, !256, !263, !265}
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !220, file: !232, line: 101, type: !233, isDefinition: true)
!232 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 320, elements: !235)
!234 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!235 = !{!236}
!236 = !DISubrange(count: 10)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !220, file: !232, line: 1052, type: !239, isDefinition: true)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !232, line: 65, size: 448, elements: !240)
!240 = !{!241, !242, !243, !247, !248}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !239, file: !232, line: 68, baseType: !54, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !239, file: !232, line: 71, baseType: !25, size: 32, offset: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !239, file: !232, line: 75, baseType: !244, size: 256, offset: 64)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !245)
!245 = !{!246}
!246 = !DISubrange(count: 8)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !239, file: !232, line: 78, baseType: !38, size: 64, offset: 320)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !239, file: !232, line: 81, baseType: !38, size: 64, offset: 384)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !220, file: !232, line: 116, type: !239, isLocal: true, isDefinition: true)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(name: "slot0", scope: !220, file: !232, line: 842, type: !253, isLocal: true, isDefinition: true)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 2048, elements: !254)
!254 = !{!255}
!255 = !DISubrange(count: 256)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(name: "slotvec", scope: !220, file: !232, line: 845, type: !258, isLocal: true, isDefinition: true)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !232, line: 834, size: 128, elements: !260)
!260 = !{!261, !262}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !259, file: !232, line: 836, baseType: !83, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !259, file: !232, line: 837, baseType: !22, size: 64, offset: 64)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(name: "nslots", scope: !220, file: !232, line: 843, type: !25, isLocal: true, isDefinition: true)
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(name: "slotvec0", scope: !220, file: !232, line: 844, type: !259, isLocal: true, isDefinition: true)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !268, size: 704, elements: !269)
!268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!269 = !{!270}
!270 = !DISubrange(count: 11)
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !273, file: !276, line: 26, type: !277, isDefinition: true)
!273 = distinct !DICompileUnit(language: DW_LANG_C99, file: !274, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !194, globals: !275)
!274 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!275 = !{!271}
!276 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 376, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 47)
!280 = distinct !DICompileUnit(language: DW_LANG_C99, file: !281, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !282)
!281 = !DIFile(filename: "./lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!282 = !{!68}
!283 = distinct !DICompileUnit(language: DW_LANG_C99, file: !284, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !285, retainedTypes: !290)
!284 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!285 = !{!286}
!286 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !287, line: 41, baseType: !7, size: 32, elements: !288)
!287 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!288 = !{!289}
!289 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2018, isUnsigned: true)
!290 = !{!24}
!291 = distinct !DICompileUnit(language: DW_LANG_C99, file: !292, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !293, retainedTypes: !301)
!292 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!293 = !{!294}
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !295, file: !78, line: 186, baseType: !7, size: 32, elements: !91)
!295 = distinct !DISubprogram(name: "x2nrealloc", scope: !78, file: !78, line: 174, type: !80, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: true, unit: !291, retainedNodes: !296)
!296 = !{!297, !298, !299, !300}
!297 = !DILocalVariable(name: "p", arg: 1, scope: !295, file: !78, line: 174, type: !24)
!298 = !DILocalVariable(name: "pn", arg: 2, scope: !295, file: !78, line: 174, type: !82)
!299 = !DILocalVariable(name: "s", arg: 3, scope: !295, file: !78, line: 174, type: !83)
!300 = !DILocalVariable(name: "n", scope: !295, file: !78, line: 176, type: !83)
!301 = !{!83, !22, !24}
!302 = distinct !DICompileUnit(language: DW_LANG_C99, file: !303, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !194)
!303 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!304 = distinct !DICompileUnit(language: DW_LANG_C99, file: !305, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !194)
!305 = !DIFile(filename: "./lib/xstrndup.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!306 = distinct !DICompileUnit(language: DW_LANG_C99, file: !307, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !194, retainedTypes: !290)
!307 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!308 = distinct !DICompileUnit(language: DW_LANG_C99, file: !309, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !194)
!309 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!310 = distinct !DICompileUnit(language: DW_LANG_C99, file: !311, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !194, retainedTypes: !290)
!311 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!312 = distinct !DICompileUnit(language: DW_LANG_C99, file: !313, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !194, retainedTypes: !290)
!313 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!314 = distinct !DICompileUnit(language: DW_LANG_C99, file: !315, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !194, retainedTypes: !316)
!315 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!316 = !{!83}
!317 = distinct !DICompileUnit(language: DW_LANG_C99, file: !318, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !194)
!318 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!319 = distinct !DICompileUnit(language: DW_LANG_C99, file: !320, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !194)
!320 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!321 = distinct !DICompileUnit(language: DW_LANG_C99, file: !322, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !323, retainedTypes: !290)
!322 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!323 = !{!324}
!324 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !325, line: 41, baseType: !7, size: 32, elements: !326)
!325 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!326 = !{!327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709}
!327 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!328 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!329 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!330 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!331 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!332 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!333 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!334 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!335 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!336 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!337 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!338 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!339 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!340 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!341 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!342 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!343 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!344 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!345 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!346 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!347 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!348 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!349 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!350 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!351 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!352 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!353 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!354 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!355 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!356 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!357 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!358 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!359 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!360 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!361 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!362 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!363 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!364 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!365 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!366 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!367 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!368 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!369 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!370 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!371 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!372 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!373 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!374 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!375 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!376 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!377 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!378 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!379 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!380 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!381 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!382 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!383 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!384 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!385 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!386 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!387 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!388 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!389 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!390 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!391 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!392 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!393 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!394 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!395 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!396 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!397 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!398 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!399 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!400 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!401 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!402 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!403 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!404 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!405 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!406 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!407 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!408 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!409 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!410 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!411 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!412 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!413 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!414 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!415 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!416 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!417 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!418 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!419 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!420 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!421 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!422 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!423 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!424 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!425 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!426 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!427 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!428 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!429 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!430 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!431 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!432 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!433 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!434 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!435 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!436 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!437 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!438 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!439 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!440 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!441 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!442 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!443 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!444 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!445 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!446 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!447 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!448 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!449 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!450 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!451 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!452 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!453 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!454 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!455 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!456 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!457 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!458 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!459 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!460 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!461 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!462 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!463 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!464 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!465 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!466 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!467 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!468 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!469 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!470 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!471 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!472 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!473 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!474 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!475 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!476 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!477 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!478 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!479 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!480 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!481 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!482 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!483 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!484 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!485 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!486 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!487 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!488 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!489 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!490 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!491 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!492 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!493 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!494 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!495 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!496 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!497 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!498 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!499 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!500 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!501 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!502 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!503 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!504 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!505 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!506 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!507 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!508 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!509 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!510 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!511 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!512 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!513 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!514 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!515 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!516 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!517 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!518 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!519 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!520 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!521 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!522 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!523 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!524 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!525 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!526 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!527 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!528 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!529 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!530 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!531 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!532 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!533 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!534 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!535 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!536 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!537 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!538 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!539 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!540 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!541 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!542 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!543 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!544 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!545 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!546 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!547 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!548 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!549 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!550 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!551 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!552 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!553 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!554 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!555 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!556 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!557 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!558 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!559 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!560 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!561 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!562 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!563 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!564 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!565 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!566 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!567 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!568 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!569 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!570 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!571 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!572 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!573 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!574 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!575 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!576 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!577 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!578 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!579 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!580 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!581 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!582 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!583 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!584 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!585 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!586 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!587 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!588 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!589 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!590 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!591 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!592 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!593 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!594 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!595 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!596 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!597 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!598 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!599 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!600 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!601 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!602 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!603 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!604 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!605 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!606 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!607 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!608 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!609 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!610 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!611 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!612 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!613 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!614 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!615 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!616 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!617 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!618 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!619 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!620 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!621 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!622 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!623 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!624 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!625 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!626 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!627 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!628 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!629 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!630 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!631 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!632 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!633 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!634 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!635 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!636 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!637 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!642 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!643 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!644 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!645 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!646 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!651 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!652 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!653 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!654 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!661 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!662 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!663 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!664 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!665 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!666 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!667 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!668 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!669 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!670 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!671 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!672 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!673 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!674 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!675 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!676 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!677 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!678 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!679 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!680 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!681 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!682 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!683 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!684 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!685 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!686 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!687 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!688 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!689 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!690 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!691 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!692 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!693 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!694 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!695 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!696 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!697 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!698 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!699 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!700 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!701 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!702 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!703 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!704 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!705 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!706 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!707 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!708 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!709 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!710 = !{!"clang version 7.0.0 (tags/RELEASE_700/final)"}
!711 = !{i32 2, !"Dwarf Version", i32 4}
!712 = !{i32 2, !"Debug Info Version", i32 3}
!713 = !{i32 1, !"wchar_size", i32 4}
!714 = !{i32 7, !"PIC Level", i32 2}
!715 = !{i32 7, !"PIE Level", i32 2}
!716 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 63, type: !717, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, retainedNodes: !719)
!717 = !DISubroutineType(types: !718)
!718 = !{null, !25}
!719 = !{!720}
!720 = !DILocalVariable(name: "status", arg: 1, scope: !716, file: !3, line: 63, type: !25)
!721 = !DILocalVariable(name: "infomap", scope: !722, file: !723, line: 632, type: !737)
!722 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !723, file: !723, line: 630, type: !724, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !726)
!723 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!724 = !DISubroutineType(types: !725)
!725 = !{null, !38}
!726 = !{!727, !721, !728, !729, !736}
!727 = !DILocalVariable(name: "program", arg: 1, scope: !722, file: !723, line: 630, type: !38)
!728 = !DILocalVariable(name: "node", scope: !722, file: !723, line: 642, type: !38)
!729 = !DILocalVariable(name: "map_prog", scope: !722, file: !723, line: 643, type: !730)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !732)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !722, file: !723, line: 632, size: 128, elements: !733)
!733 = !{!734, !735}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !732, file: !723, line: 632, baseType: !38, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !732, file: !723, line: 632, baseType: !38, size: 64, offset: 64)
!736 = !DILocalVariable(name: "lc_messages", scope: !722, file: !723, line: 655, type: !38)
!737 = !DICompositeType(tag: DW_TAG_array_type, baseType: !731, size: 896, elements: !738)
!738 = !{!739}
!739 = !DISubrange(count: 7)
!740 = !DILocation(line: 632, column: 67, scope: !722, inlinedAt: !741)
!741 = distinct !DILocation(line: 87, column: 7, scope: !742)
!742 = distinct !DILexicalBlock(scope: !743, file: !3, line: 68, column: 5)
!743 = distinct !DILexicalBlock(scope: !716, file: !3, line: 65, column: 7)
!744 = !DILocation(line: 63, column: 12, scope: !716)
!745 = !DILocation(line: 65, column: 14, scope: !743)
!746 = !DILocation(line: 65, column: 7, scope: !716)
!747 = !DILocation(line: 66, column: 5, scope: !748)
!748 = distinct !DILexicalBlock(scope: !743, file: !3, line: 66, column: 5)
!749 = !{!750, !750, i64 0}
!750 = !{!"any pointer", !751, i64 0}
!751 = !{!"omnipotent char", !752, i64 0}
!752 = !{!"Simple C/C++ TBAA"}
!753 = !DILocation(line: 69, column: 7, scope: !742)
!754 = !DILocation(line: 73, column: 7, scope: !742)
!755 = !DILocation(line: 580, column: 3, scope: !756, inlinedAt: !759)
!756 = distinct !DISubprogram(name: "emit_stdin_note", scope: !723, file: !723, line: 578, type: !757, isLocal: true, isDefinition: true, scopeLine: 579, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !194)
!757 = !DISubroutineType(types: !758)
!758 = !{null}
!759 = distinct !DILocation(line: 77, column: 7, scope: !742)
!760 = !DILocation(line: 587, column: 3, scope: !761, inlinedAt: !762)
!761 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !723, file: !723, line: 585, type: !757, isLocal: true, isDefinition: true, scopeLine: 586, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !194)
!762 = distinct !DILocation(line: 78, column: 7, scope: !742)
!763 = !DILocation(line: 80, column: 7, scope: !742)
!764 = !DILocation(line: 84, column: 7, scope: !742)
!765 = !DILocation(line: 85, column: 7, scope: !742)
!766 = !DILocation(line: 86, column: 7, scope: !742)
!767 = !DILocation(line: 632, column: 3, scope: !722, inlinedAt: !741)
!768 = !DILocation(line: 643, column: 36, scope: !722, inlinedAt: !741)
!769 = !DILocation(line: 643, column: 25, scope: !722, inlinedAt: !741)
!770 = !DILocation(line: 645, column: 33, scope: !722, inlinedAt: !741)
!771 = !DILocation(line: 645, column: 3, scope: !722, inlinedAt: !741)
!772 = !DILocation(line: 646, column: 13, scope: !722, inlinedAt: !741)
!773 = !DILocation(line: 645, column: 20, scope: !722, inlinedAt: !741)
!774 = !{!775, !750, i64 0}
!775 = !{!"infomap", !750, i64 0, !750, i64 8}
!776 = !DILocation(line: 645, column: 10, scope: !722, inlinedAt: !741)
!777 = !DILocation(line: 645, column: 28, scope: !722, inlinedAt: !741)
!778 = distinct !{!778, !779, !780}
!779 = !DILocation(line: 645, column: 3, scope: !722)
!780 = !DILocation(line: 646, column: 13, scope: !722)
!781 = !DILocation(line: 648, column: 17, scope: !782, inlinedAt: !741)
!782 = distinct !DILexicalBlock(scope: !722, file: !723, line: 648, column: 7)
!783 = !{!775, !750, i64 8}
!784 = !DILocation(line: 648, column: 7, scope: !782, inlinedAt: !741)
!785 = !DILocation(line: 648, column: 7, scope: !722, inlinedAt: !741)
!786 = !DILocation(line: 642, column: 15, scope: !722, inlinedAt: !741)
!787 = !DILocation(line: 651, column: 3, scope: !722, inlinedAt: !741)
!788 = !DILocation(line: 655, column: 29, scope: !722, inlinedAt: !741)
!789 = !DILocation(line: 655, column: 15, scope: !722, inlinedAt: !741)
!790 = !DILocation(line: 656, column: 7, scope: !791, inlinedAt: !741)
!791 = distinct !DILexicalBlock(scope: !722, file: !723, line: 656, column: 7)
!792 = !DILocation(line: 656, column: 19, scope: !791, inlinedAt: !741)
!793 = !DILocation(line: 656, column: 22, scope: !791, inlinedAt: !741)
!794 = !DILocation(line: 656, column: 7, scope: !722, inlinedAt: !741)
!795 = !DILocation(line: 662, column: 7, scope: !796, inlinedAt: !741)
!796 = distinct !DILexicalBlock(scope: !791, file: !723, line: 657, column: 5)
!797 = !DILocation(line: 664, column: 5, scope: !796, inlinedAt: !741)
!798 = !DILocation(line: 665, column: 3, scope: !722, inlinedAt: !741)
!799 = !DILocation(line: 667, column: 3, scope: !722, inlinedAt: !741)
!800 = !DILocation(line: 669, column: 1, scope: !722, inlinedAt: !741)
!801 = !DILocation(line: 89, column: 3, scope: !716)
!802 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 182, type: !803, isDefinition: true, scopeLine: 183, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !805)
!803 = !DISubroutineType(types: !804)
!804 = !{!25, !25, !188}
!805 = !{!806, !807, !808, !809}
!806 = !DILocalVariable(name: "argc", arg: 1, scope: !802, file: !3, line: 182, type: !25)
!807 = !DILocalVariable(name: "argv", arg: 2, scope: !802, file: !3, line: 182, type: !188)
!808 = !DILocalVariable(name: "c", scope: !802, file: !3, line: 184, type: !25)
!809 = !DILocalVariable(name: "tab_stop", scope: !810, file: !3, line: 213, type: !814)
!810 = distinct !DILexicalBlock(scope: !811, file: !3, line: 212, column: 13)
!811 = distinct !DILexicalBlock(scope: !812, file: !3, line: 209, column: 15)
!812 = distinct !DILexicalBlock(scope: !813, file: !3, line: 198, column: 9)
!813 = distinct !DILexicalBlock(scope: !802, file: !3, line: 196, column: 5)
!814 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 16, elements: !184)
!815 = !DILocation(line: 182, column: 11, scope: !802)
!816 = !DILocation(line: 182, column: 24, scope: !802)
!817 = !DILocation(line: 187, column: 21, scope: !802)
!818 = !DILocation(line: 187, column: 3, scope: !802)
!819 = !DILocation(line: 188, column: 3, scope: !802)
!820 = !DILocation(line: 189, column: 3, scope: !802)
!821 = !DILocation(line: 190, column: 3, scope: !802)
!822 = !DILocation(line: 192, column: 3, scope: !802)
!823 = !DILocation(line: 193, column: 23, scope: !802)
!824 = !{!825, !825, i64 0}
!825 = !{!"_Bool", !751, i64 0}
!826 = !DILocation(line: 195, column: 3, scope: !802)
!827 = !DILocation(line: 195, column: 15, scope: !802)
!828 = !DILocation(line: 184, column: 7, scope: !802)
!829 = !DILocation(line: 200, column: 31, scope: !812)
!830 = !DILocation(line: 201, column: 11, scope: !812)
!831 = !DILocation(line: 204, column: 28, scope: !812)
!832 = !DILocation(line: 204, column: 11, scope: !812)
!833 = !DILocation(line: 205, column: 11, scope: !812)
!834 = !DILocation(line: 209, column: 15, scope: !811)
!835 = !DILocation(line: 209, column: 15, scope: !812)
!836 = !DILocation(line: 210, column: 37, scope: !811)
!837 = !DILocation(line: 210, column: 13, scope: !811)
!838 = distinct !{!838, !826, !839}
!839 = !DILocation(line: 227, column: 5, scope: !802)
!840 = !DILocation(line: 213, column: 15, scope: !810)
!841 = !DILocation(line: 213, column: 20, scope: !810)
!842 = !DILocation(line: 214, column: 29, scope: !810)
!843 = !DILocation(line: 214, column: 27, scope: !810)
!844 = !{!751, !751, i64 0}
!845 = !DILocation(line: 215, column: 27, scope: !810)
!846 = !DILocation(line: 216, column: 15, scope: !810)
!847 = !DILocation(line: 217, column: 13, scope: !811)
!848 = !DILocation(line: 220, column: 9, scope: !812)
!849 = !DILocation(line: 222, column: 9, scope: !812)
!850 = !DILocation(line: 225, column: 11, scope: !812)
!851 = !DILocation(line: 229, column: 3, scope: !802)
!852 = !DILocation(line: 231, column: 20, scope: !802)
!853 = !{!854, !854, i64 0}
!854 = !{!"int", !751, i64 0}
!855 = !DILocation(line: 231, column: 27, scope: !802)
!856 = !DILocation(line: 231, column: 38, scope: !802)
!857 = !DILocation(line: 231, column: 19, scope: !802)
!858 = !DILocation(line: 231, column: 3, scope: !802)
!859 = !DILocation(line: 100, column: 14, scope: !860, inlinedAt: !909)
!860 = distinct !DISubprogram(name: "expand", scope: !3, file: !3, line: 97, type: !757, isLocal: true, isDefinition: true, scopeLine: 98, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !861)
!861 = !{!862, !897, !899, !900, !901, !902, !908}
!862 = !DILocalVariable(name: "fp", scope: !860, file: !3, line: 100, type: !863)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !109, line: 7, baseType: !865)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !111, line: 49, size: 1728, elements: !866)
!866 = !{!867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !865, file: !111, line: 51, baseType: !25, size: 32)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !865, file: !111, line: 54, baseType: !22, size: 64, offset: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !865, file: !111, line: 55, baseType: !22, size: 64, offset: 128)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !865, file: !111, line: 56, baseType: !22, size: 64, offset: 192)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !865, file: !111, line: 57, baseType: !22, size: 64, offset: 256)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !865, file: !111, line: 58, baseType: !22, size: 64, offset: 320)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !865, file: !111, line: 59, baseType: !22, size: 64, offset: 384)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !865, file: !111, line: 60, baseType: !22, size: 64, offset: 448)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !865, file: !111, line: 61, baseType: !22, size: 64, offset: 512)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !865, file: !111, line: 64, baseType: !22, size: 64, offset: 576)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !865, file: !111, line: 65, baseType: !22, size: 64, offset: 640)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !865, file: !111, line: 66, baseType: !22, size: 64, offset: 704)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !865, file: !111, line: 68, baseType: !126, size: 64, offset: 768)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !865, file: !111, line: 70, baseType: !881, size: 64, offset: 832)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !865, file: !111, line: 72, baseType: !25, size: 32, offset: 896)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !865, file: !111, line: 73, baseType: !25, size: 32, offset: 928)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !865, file: !111, line: 74, baseType: !133, size: 64, offset: 960)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !865, file: !111, line: 77, baseType: !26, size: 16, offset: 1024)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !865, file: !111, line: 78, baseType: !137, size: 8, offset: 1040)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !865, file: !111, line: 79, baseType: !139, size: 8, offset: 1048)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !865, file: !111, line: 81, baseType: !143, size: 64, offset: 1088)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !865, file: !111, line: 89, baseType: !146, size: 64, offset: 1152)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !865, file: !111, line: 91, baseType: !148, size: 64, offset: 1216)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !865, file: !111, line: 92, baseType: !151, size: 64, offset: 1280)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !865, file: !111, line: 93, baseType: !881, size: 64, offset: 1344)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !865, file: !111, line: 94, baseType: !24, size: 64, offset: 1408)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !865, file: !111, line: 95, baseType: !83, size: 64, offset: 1472)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !865, file: !111, line: 96, baseType: !25, size: 32, offset: 1536)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !865, file: !111, line: 98, baseType: !158, size: 160, offset: 1568)
!897 = !DILocalVariable(name: "c", scope: !898, file: !3, line: 108, type: !25)
!898 = distinct !DILexicalBlock(scope: !860, file: !3, line: 106, column: 5)
!899 = !DILocalVariable(name: "convert", scope: !898, file: !3, line: 111, type: !180)
!900 = !DILocalVariable(name: "column", scope: !898, file: !3, line: 118, type: !95)
!901 = !DILocalVariable(name: "tab_index", scope: !898, file: !3, line: 121, type: !83)
!902 = !DILocalVariable(name: "next_tab_column", scope: !903, file: !3, line: 136, type: !95)
!903 = distinct !DILexicalBlock(scope: !904, file: !3, line: 134, column: 17)
!904 = distinct !DILexicalBlock(scope: !905, file: !3, line: 133, column: 19)
!905 = distinct !DILexicalBlock(scope: !906, file: !3, line: 132, column: 13)
!906 = distinct !DILexicalBlock(scope: !907, file: !3, line: 131, column: 15)
!907 = distinct !DILexicalBlock(scope: !898, file: !3, line: 127, column: 9)
!908 = !DILocalVariable(name: "last_tab", scope: !903, file: !3, line: 137, type: !180)
!909 = distinct !DILocation(line: 233, column: 3, scope: !802)
!910 = !DILocation(line: 100, column: 9, scope: !860, inlinedAt: !909)
!911 = !DILocation(line: 102, column: 8, scope: !912, inlinedAt: !909)
!912 = distinct !DILexicalBlock(scope: !860, file: !3, line: 102, column: 7)
!913 = !DILocation(line: 102, column: 7, scope: !860, inlinedAt: !909)
!914 = !DILocation(line: 121, column: 7, scope: !898, inlinedAt: !909)
!915 = !DILocation(scope: !907, inlinedAt: !909)
!916 = !DILocation(line: 111, column: 12, scope: !898, inlinedAt: !909)
!917 = !DILocation(line: 118, column: 17, scope: !898, inlinedAt: !909)
!918 = !DILocation(line: 121, column: 14, scope: !898, inlinedAt: !909)
!919 = !{!920, !920, i64 0}
!920 = !{!"long", !751, i64 0}
!921 = !DILocation(line: 126, column: 7, scope: !898, inlinedAt: !909)
!922 = !DILocation(scope: !905, inlinedAt: !909)
!923 = !DILocation(scope: !903, inlinedAt: !909)
!924 = !DILocation(line: 128, column: 11, scope: !907, inlinedAt: !909)
!925 = !DILocalVariable(name: "__fp", arg: 1, scope: !926, file: !927, line: 66, type: !863)
!926 = distinct !DISubprogram(name: "getc_unlocked", scope: !927, file: !927, line: 66, type: !928, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !930)
!927 = !DIFile(filename: "/usr/include/bits/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!928 = !DISubroutineType(types: !929)
!929 = !{!25, !863}
!930 = !{!925}
!931 = !DILocation(line: 66, column: 22, scope: !926, inlinedAt: !932)
!932 = distinct !DILocation(line: 128, column: 23, scope: !907, inlinedAt: !909)
!933 = !DILocation(line: 68, column: 10, scope: !926, inlinedAt: !932)
!934 = !{!935, !750, i64 8}
!935 = !{!"_IO_FILE", !854, i64 0, !750, i64 8, !750, i64 16, !750, i64 24, !750, i64 32, !750, i64 40, !750, i64 48, !750, i64 56, !750, i64 64, !750, i64 72, !750, i64 80, !750, i64 88, !750, i64 96, !750, i64 104, !854, i64 112, !854, i64 116, !920, i64 120, !936, i64 128, !751, i64 130, !751, i64 131, !750, i64 136, !920, i64 144, !750, i64 152, !750, i64 160, !750, i64 168, !750, i64 176, !920, i64 184, !854, i64 192, !751, i64 196}
!936 = !{!"short", !751, i64 0}
!937 = !{!935, !750, i64 16}
!938 = !{!"branch_weights", i32 2000, i32 1}
!939 = !DILocation(line: 108, column: 11, scope: !898, inlinedAt: !909)
!940 = !DILocation(line: 128, column: 38, scope: !907, inlinedAt: !909)
!941 = !DILocation(line: 128, column: 34, scope: !907, inlinedAt: !909)
!942 = !DILocation(line: 128, column: 47, scope: !907, inlinedAt: !909)
!943 = distinct !{!943, !944, !945}
!944 = !DILocation(line: 128, column: 11, scope: !907)
!945 = !DILocation(line: 129, column: 13, scope: !907)
!946 = !DILocation(scope: !860, inlinedAt: !909)
!947 = !DILocation(line: 131, column: 15, scope: !906, inlinedAt: !909)
!948 = !DILocation(line: 131, column: 15, scope: !907, inlinedAt: !909)
!949 = !DILocation(line: 133, column: 19, scope: !905, inlinedAt: !909)
!950 = !DILocation(line: 137, column: 24, scope: !903, inlinedAt: !909)
!951 = !DILocation(line: 137, column: 19, scope: !903, inlinedAt: !909)
!952 = !DILocation(line: 139, column: 37, scope: !903, inlinedAt: !909)
!953 = !DILocation(line: 136, column: 29, scope: !903, inlinedAt: !909)
!954 = !DILocation(line: 142, column: 23, scope: !955, inlinedAt: !909)
!955 = distinct !DILexicalBlock(scope: !903, file: !3, line: 142, column: 23)
!956 = !{i8 0, i8 2}
!957 = !DILocation(line: 143, column: 46, scope: !955, inlinedAt: !909)
!958 = !DILocation(line: 142, column: 23, scope: !903, inlinedAt: !909)
!959 = !DILocation(line: 145, column: 39, scope: !960, inlinedAt: !909)
!960 = distinct !DILexicalBlock(scope: !903, file: !3, line: 145, column: 23)
!961 = !DILocation(line: 145, column: 23, scope: !903, inlinedAt: !909)
!962 = !DILocation(line: 146, column: 21, scope: !960, inlinedAt: !909)
!963 = !DILocation(line: 148, column: 26, scope: !903, inlinedAt: !909)
!964 = !DILocation(line: 148, column: 35, scope: !903, inlinedAt: !909)
!965 = !DILocation(line: 148, column: 19, scope: !903, inlinedAt: !909)
!966 = !DILocalVariable(name: "__c", arg: 1, scope: !967, file: !927, line: 108, type: !25)
!967 = distinct !DISubprogram(name: "putchar_unlocked", scope: !927, file: !927, line: 108, type: !968, isDefinition: true, scopeLine: 109, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !970)
!968 = !DISubroutineType(types: !969)
!969 = !{!25, !25}
!970 = !{!966}
!971 = !DILocation(line: 108, column: 23, scope: !967, inlinedAt: !972)
!972 = distinct !DILocation(line: 149, column: 25, scope: !973, inlinedAt: !909)
!973 = distinct !DILexicalBlock(scope: !903, file: !3, line: 149, column: 25)
!974 = !DILocation(line: 110, column: 10, scope: !967, inlinedAt: !972)
!975 = !{!935, !750, i64 40}
!976 = !{!935, !750, i64 48}
!977 = !DILocation(line: 149, column: 39, scope: !973, inlinedAt: !909)
!978 = !DILocation(line: 149, column: 25, scope: !903, inlinedAt: !909)
!979 = distinct !{!979, !980, !981}
!980 = !DILocation(line: 148, column: 19, scope: !903)
!981 = !DILocation(line: 150, column: 23, scope: !903)
!982 = !DILocation(line: 150, column: 23, scope: !973, inlinedAt: !909)
!983 = !DILocation(line: 153, column: 17, scope: !904, inlinedAt: !909)
!984 = !DILocation(line: 153, column: 17, scope: !903, inlinedAt: !909)
!985 = !DILocation(line: 158, column: 30, scope: !986, inlinedAt: !909)
!986 = distinct !DILexicalBlock(scope: !987, file: !3, line: 155, column: 17)
!987 = distinct !DILexicalBlock(scope: !904, file: !3, line: 154, column: 24)
!988 = !DILocation(line: 158, column: 29, scope: !986, inlinedAt: !909)
!989 = !DILocation(line: 158, column: 26, scope: !986, inlinedAt: !909)
!990 = !DILocation(line: 159, column: 34, scope: !986, inlinedAt: !909)
!991 = !DILocation(line: 159, column: 33, scope: !986, inlinedAt: !909)
!992 = !DILocation(line: 159, column: 32, scope: !986, inlinedAt: !909)
!993 = !DILocation(line: 159, column: 29, scope: !986, inlinedAt: !909)
!994 = !DILocation(line: 160, column: 17, scope: !986, inlinedAt: !909)
!995 = !DILocation(line: 163, column: 25, scope: !996, inlinedAt: !909)
!996 = distinct !DILexicalBlock(scope: !987, file: !3, line: 162, column: 17)
!997 = !DILocation(line: 164, column: 24, scope: !998, inlinedAt: !909)
!998 = distinct !DILexicalBlock(scope: !996, file: !3, line: 164, column: 23)
!999 = !DILocation(line: 164, column: 23, scope: !996, inlinedAt: !909)
!1000 = !DILocation(line: 165, column: 21, scope: !998, inlinedAt: !909)
!1001 = !DILocation(scope: !996, inlinedAt: !909)
!1002 = !DILocation(line: 168, column: 26, scope: !905, inlinedAt: !909)
!1003 = !DILocation(line: 168, column: 46, scope: !905, inlinedAt: !909)
!1004 = !DILocation(line: 168, column: 52, scope: !905, inlinedAt: !909)
!1005 = !{!936, !936, i64 0}
!1006 = !DILocation(line: 168, column: 50, scope: !905, inlinedAt: !909)
!1007 = !DILocation(line: 168, column: 23, scope: !905, inlinedAt: !909)
!1008 = !DILocation(line: 169, column: 13, scope: !905, inlinedAt: !909)
!1009 = !DILocation(scope: !898, inlinedAt: !909)
!1010 = !DILocation(line: 171, column: 17, scope: !1011, inlinedAt: !909)
!1011 = distinct !DILexicalBlock(scope: !907, file: !3, line: 171, column: 15)
!1012 = !DILocation(line: 171, column: 15, scope: !907, inlinedAt: !909)
!1013 = !DILocation(line: 108, column: 23, scope: !967, inlinedAt: !1014)
!1014 = distinct !DILocation(line: 174, column: 15, scope: !1015, inlinedAt: !909)
!1015 = distinct !DILexicalBlock(scope: !907, file: !3, line: 174, column: 15)
!1016 = !DILocation(line: 110, column: 10, scope: !967, inlinedAt: !1014)
!1017 = !DILocation(line: 174, column: 15, scope: !907, inlinedAt: !909)
!1018 = !DILocation(line: 174, column: 27, scope: !1015, inlinedAt: !909)
!1019 = !DILocation(line: 175, column: 13, scope: !1015, inlinedAt: !909)
!1020 = !DILocation(line: 177, column: 16, scope: !898, inlinedAt: !909)
!1021 = !DILocation(line: 176, column: 9, scope: !907, inlinedAt: !909)
!1022 = distinct !{!1022, !1023, !1024}
!1023 = !DILocation(line: 126, column: 7, scope: !898)
!1024 = !DILocation(line: 177, column: 23, scope: !898)
!1025 = !DILocation(line: 178, column: 5, scope: !860, inlinedAt: !909)
!1026 = !DILocation(line: 235, column: 3, scope: !802)
!1027 = !DILocation(line: 237, column: 10, scope: !802)
!1028 = !DILocation(line: 237, column: 3, scope: !802)
!1029 = distinct !DISubprogram(name: "add_tab_stop", scope: !52, file: !52, line: 78, type: !1030, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: true, unit: !51, retainedNodes: !1032)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{null, !95}
!1032 = !{!1033, !1034, !1035}
!1033 = !DILocalVariable(name: "tabval", arg: 1, scope: !1029, file: !52, line: 78, type: !95)
!1034 = !DILocalVariable(name: "prev_column", scope: !1029, file: !52, line: 80, type: !95)
!1035 = !DILocalVariable(name: "column_width", scope: !1029, file: !52, line: 81, type: !95)
!1036 = !DILocation(line: 78, column: 25, scope: !1029)
!1037 = !DILocation(line: 80, column: 27, scope: !1029)
!1038 = !DILocation(line: 80, column: 44, scope: !1029)
!1039 = !DILocation(line: 80, column: 68, scope: !1029)
!1040 = !DILocation(line: 80, column: 13, scope: !1029)
!1041 = !DILocation(line: 81, column: 28, scope: !1029)
!1042 = !DILocation(line: 81, column: 13, scope: !1029)
!1043 = !DILocation(line: 83, column: 25, scope: !1044)
!1044 = distinct !DILexicalBlock(scope: !1029, file: !52, line: 83, column: 7)
!1045 = !DILocation(line: 83, column: 22, scope: !1044)
!1046 = !DILocation(line: 83, column: 7, scope: !1029)
!1047 = !DILocation(line: 85, column: 3, scope: !1029)
!1048 = !DILocation(line: 84, column: 16, scope: !1044)
!1049 = !DILocation(line: 174, column: 19, scope: !79, inlinedAt: !1050)
!1050 = distinct !DILocation(line: 84, column: 16, scope: !1044)
!1051 = !DILocation(line: 174, column: 30, scope: !79, inlinedAt: !1050)
!1052 = !DILocation(line: 174, column: 41, scope: !79, inlinedAt: !1050)
!1053 = !DILocation(line: 176, column: 10, scope: !79, inlinedAt: !1050)
!1054 = !DILocation(line: 178, column: 9, scope: !1055, inlinedAt: !1050)
!1055 = distinct !DILexicalBlock(scope: !79, file: !78, line: 178, column: 7)
!1056 = !DILocation(line: 178, column: 7, scope: !79, inlinedAt: !1050)
!1057 = !DILocation(line: 180, column: 11, scope: !1058, inlinedAt: !1050)
!1058 = distinct !DILexicalBlock(scope: !1055, file: !78, line: 179, column: 5)
!1059 = !DILocation(line: 191, column: 11, scope: !1060, inlinedAt: !1050)
!1060 = distinct !DILexicalBlock(scope: !1058, file: !78, line: 191, column: 11)
!1061 = !DILocation(line: 191, column: 11, scope: !1058, inlinedAt: !1050)
!1062 = !DILocation(line: 192, column: 9, scope: !1060, inlinedAt: !1050)
!1063 = !DILocation(line: 201, column: 11, scope: !1064, inlinedAt: !1050)
!1064 = distinct !DILexicalBlock(scope: !1065, file: !78, line: 200, column: 11)
!1065 = distinct !DILexicalBlock(scope: !1055, file: !78, line: 195, column: 5)
!1066 = !DILocation(line: 200, column: 11, scope: !1065, inlinedAt: !1050)
!1067 = !DILocation(line: 202, column: 9, scope: !1064, inlinedAt: !1050)
!1068 = !DILocation(line: 203, column: 14, scope: !1065, inlinedAt: !1050)
!1069 = !DILocation(line: 203, column: 18, scope: !1065, inlinedAt: !1050)
!1070 = !DILocation(line: 203, column: 9, scope: !1065, inlinedAt: !1050)
!1071 = !DILocation(scope: !79, inlinedAt: !1050)
!1072 = !DILocation(line: 206, column: 7, scope: !79, inlinedAt: !1050)
!1073 = !DILocation(line: 207, column: 25, scope: !79, inlinedAt: !1050)
!1074 = !DILocation(line: 207, column: 10, scope: !79, inlinedAt: !1050)
!1075 = !DILocation(line: 84, column: 14, scope: !1044)
!1076 = !DILocation(line: 84, column: 5, scope: !1044)
!1077 = !DILocation(line: 85, column: 26, scope: !1029)
!1078 = !DILocation(line: 85, column: 30, scope: !1029)
!1079 = !DILocation(line: 87, column: 7, scope: !1080)
!1080 = distinct !DILexicalBlock(scope: !1029, file: !52, line: 87, column: 7)
!1081 = !DILocation(line: 87, column: 24, scope: !1080)
!1082 = !DILocation(line: 87, column: 7, scope: !1029)
!1083 = !DILocation(line: 91, column: 24, scope: !1084)
!1084 = distinct !DILexicalBlock(scope: !1080, file: !52, line: 88, column: 5)
!1085 = !DILocation(line: 92, column: 5, scope: !1084)
!1086 = !DILocation(line: 93, column: 1, scope: !1029)
!1087 = distinct !DISubprogram(name: "parse_tab_stops", scope: !52, file: !52, line: 132, type: !724, isDefinition: true, scopeLine: 133, flags: DIFlagPrototyped, isOptimized: true, unit: !51, retainedNodes: !1088)
!1088 = !{!1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1107}
!1089 = !DILocalVariable(name: "stops", arg: 1, scope: !1087, file: !52, line: 132, type: !38)
!1090 = !DILocalVariable(name: "have_tabval", scope: !1087, file: !52, line: 134, type: !180)
!1091 = !DILocalVariable(name: "tabval", scope: !1087, file: !52, line: 135, type: !95)
!1092 = !DILocalVariable(name: "extend_tabval", scope: !1087, file: !52, line: 136, type: !180)
!1093 = !DILocalVariable(name: "increment_tabval", scope: !1087, file: !52, line: 137, type: !180)
!1094 = !DILocalVariable(name: "num_start", scope: !1087, file: !52, line: 138, type: !38)
!1095 = !DILocalVariable(name: "ok", scope: !1087, file: !52, line: 139, type: !180)
!1096 = !DILocalVariable(name: "len", scope: !1097, file: !52, line: 202, type: !83)
!1097 = distinct !DILexicalBlock(scope: !1098, file: !52, line: 201, column: 13)
!1098 = distinct !DILexicalBlock(scope: !1099, file: !52, line: 200, column: 15)
!1099 = distinct !DILexicalBlock(scope: !1100, file: !52, line: 191, column: 9)
!1100 = distinct !DILexicalBlock(scope: !1101, file: !52, line: 190, column: 16)
!1101 = distinct !DILexicalBlock(scope: !1102, file: !52, line: 179, column: 16)
!1102 = distinct !DILexicalBlock(scope: !1103, file: !52, line: 168, column: 16)
!1103 = distinct !DILexicalBlock(scope: !1104, file: !52, line: 143, column: 11)
!1104 = distinct !DILexicalBlock(scope: !1105, file: !52, line: 142, column: 5)
!1105 = distinct !DILexicalBlock(scope: !1106, file: !52, line: 141, column: 3)
!1106 = distinct !DILexicalBlock(scope: !1087, file: !52, line: 141, column: 3)
!1107 = !DILocalVariable(name: "bad_num", scope: !1097, file: !52, line: 203, type: !22)
!1108 = !DILocation(line: 132, column: 30, scope: !1087)
!1109 = !DILocation(line: 134, column: 8, scope: !1087)
!1110 = !DILocation(line: 135, column: 13, scope: !1087)
!1111 = !DILocation(line: 136, column: 8, scope: !1087)
!1112 = !DILocation(line: 137, column: 8, scope: !1087)
!1113 = !DILocation(line: 138, column: 15, scope: !1087)
!1114 = !DILocation(line: 139, column: 8, scope: !1087)
!1115 = !DILocation(line: 141, column: 3, scope: !1087)
!1116 = !DILocation(scope: !1117)
!1117 = distinct !DILexicalBlock(scope: !1103, file: !52, line: 144, column: 9)
!1118 = !DILocation(line: 141, column: 10, scope: !1105)
!1119 = !DILocation(line: 141, column: 3, scope: !1106)
!1120 = !DILocation(line: 143, column: 28, scope: !1103)
!1121 = !DILocation(line: 143, column: 11, scope: !1104)
!1122 = !DILocation(line: 145, column: 15, scope: !1123)
!1123 = distinct !DILexicalBlock(scope: !1117, file: !52, line: 145, column: 15)
!1124 = !DILocation(line: 145, column: 15, scope: !1117)
!1125 = !DILocation(line: 147, column: 19, scope: !1126)
!1126 = distinct !DILexicalBlock(scope: !1127, file: !52, line: 147, column: 19)
!1127 = distinct !DILexicalBlock(scope: !1123, file: !52, line: 146, column: 13)
!1128 = !DILocation(line: 147, column: 19, scope: !1127)
!1129 = !DILocalVariable(name: "tabval", arg: 1, scope: !1130, file: !52, line: 96, type: !95)
!1130 = distinct !DISubprogram(name: "set_extend_size", scope: !52, file: !52, line: 96, type: !1131, isLocal: true, isDefinition: true, scopeLine: 97, flags: DIFlagPrototyped, isOptimized: true, unit: !51, retainedNodes: !1133)
!1131 = !DISubroutineType(types: !1132)
!1132 = !{!180, !95}
!1133 = !{!1129, !1134}
!1134 = !DILocalVariable(name: "ok", scope: !1130, file: !52, line: 98, type: !180)
!1135 = !DILocation(line: 96, column: 28, scope: !1130, inlinedAt: !1136)
!1136 = distinct !DILocation(line: 149, column: 25, scope: !1137)
!1137 = distinct !DILexicalBlock(scope: !1138, file: !52, line: 149, column: 23)
!1138 = distinct !DILexicalBlock(scope: !1126, file: !52, line: 148, column: 17)
!1139 = !DILocation(line: 98, column: 8, scope: !1130, inlinedAt: !1136)
!1140 = !DILocation(line: 100, column: 7, scope: !1141, inlinedAt: !1136)
!1141 = distinct !DILexicalBlock(scope: !1130, file: !52, line: 100, column: 7)
!1142 = !DILocation(line: 100, column: 7, scope: !1130, inlinedAt: !1136)
!1143 = !DILocation(line: 107, column: 15, scope: !1130, inlinedAt: !1136)
!1144 = !DILocation(line: 149, column: 23, scope: !1138)
!1145 = !DILocation(line: 103, column: 14, scope: !1146, inlinedAt: !1136)
!1146 = distinct !DILexicalBlock(scope: !1141, file: !52, line: 101, column: 5)
!1147 = !DILocation(line: 102, column: 7, scope: !1146, inlinedAt: !1136)
!1148 = !DILocation(line: 155, column: 24, scope: !1149)
!1149 = distinct !DILexicalBlock(scope: !1126, file: !52, line: 155, column: 24)
!1150 = !DILocation(line: 155, column: 24, scope: !1126)
!1151 = !DILocalVariable(name: "tabval", arg: 1, scope: !1152, file: !52, line: 113, type: !95)
!1152 = distinct !DISubprogram(name: "set_increment_size", scope: !52, file: !52, line: 113, type: !1131, isLocal: true, isDefinition: true, scopeLine: 114, flags: DIFlagPrototyped, isOptimized: true, unit: !51, retainedNodes: !1153)
!1153 = !{!1151, !1154}
!1154 = !DILocalVariable(name: "ok", scope: !1152, file: !52, line: 115, type: !180)
!1155 = !DILocation(line: 113, column: 31, scope: !1152, inlinedAt: !1156)
!1156 = distinct !DILocation(line: 157, column: 25, scope: !1157)
!1157 = distinct !DILexicalBlock(scope: !1158, file: !52, line: 157, column: 23)
!1158 = distinct !DILexicalBlock(scope: !1149, file: !52, line: 156, column: 17)
!1159 = !DILocation(line: 115, column: 8, scope: !1152, inlinedAt: !1156)
!1160 = !DILocation(line: 117, column: 7, scope: !1161, inlinedAt: !1156)
!1161 = distinct !DILexicalBlock(scope: !1152, file: !52, line: 117, column: 7)
!1162 = !DILocation(line: 117, column: 7, scope: !1152, inlinedAt: !1156)
