source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon.0 }
%struct.__mpz_struct = type { i32, i32, i64* }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.bin_tree_storage_t = type { %struct.bin_tree_storage_t*, [15 x %struct.bin_tree_t] }
%struct.bin_tree_t = type { %struct.bin_tree_t*, %struct.bin_tree_t*, %struct.bin_tree_t*, %struct.bin_tree_t*, %struct.bin_tree_t*, %struct.re_token_t, i64 }
%struct.bracket_elem_t = type { i32, %union.anon.1 }
%struct.infomap = type { i8*, i8* }
%struct.mbchar = type { i8*, i64, i8, i32, [24 x i8] }
%struct.mbuiter_multi = type { i8, %struct.__mbstate_t, i8, %struct.mbchar }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.re_backref_cache_entry = type { i64, i64, i64, i64, i64, i8 }
%struct.re_charset_t = type { i32*, i32*, i32*, i64*, i8, i64, i64, i64, i64, i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "args", scope: !2, file: !3, line: 189, type: !190, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !99, globals: !297, nameTableKind: None)
!3 = !DIFile(filename: "src/expr.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !10, !14, !28, !78, !88}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "valtype", file: !3, line: 169, baseType: !6, size: 32, elements: !7)
!6 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!7 = !{!8, !9}
!8 = !DIEnumerator(name: "integer", value: 0, isUnsigned: true)
!9 = !DIEnumerator(name: "string", value: 1, isUnsigned: true)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 156, baseType: !6, size: 32, elements: !11)
!11 = !{!12, !13}
!12 = !DIEnumerator(name: "EXPR_INVALID", value: 2, isUnsigned: true)
!13 = !DIEnumerator(name: "EXPR_FAILURE", value: 3, isUnsigned: true)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !15, line: 32, baseType: !6, size: 32, elements: !16)
!15 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27}
!17 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!18 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!19 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!20 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!21 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!22 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!23 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!24 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!25 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!26 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!27 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !29, file: !3, line: 989, baseType: !6, size: 32, elements: !71)
!29 = distinct !DISubprogram(name: "eval2", scope: !3, file: !3, line: 978, type: !30, scopeLine: 979, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !61)
!30 = !DISubroutineType(types: !31)
!31 = !{!32, !60}
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "VALUE", file: !3, line: 186, baseType: !34)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "valinfo", file: !3, line: 177, size: 192, elements: !35)
!35 = !{!36, !38}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !34, file: !3, line: 179, baseType: !37, size: 32)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "TYPE", file: !3, line: 174, baseType: !5)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !34, file: !3, line: 184, baseType: !39, size: 128, offset: 64)
!39 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !34, file: !3, line: 180, size: 128, elements: !40)
!40 = !{!41, !57}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !39, file: !3, line: 182, baseType: !42, size: 128)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpz_t", file: !43, line: 164, baseType: !44)
!43 = !DIFile(filename: "/usr/include/gmp.h", directory: "")
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 128, elements: !55)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mpz_struct", file: !43, line: 158, baseType: !46)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !43, line: 150, size: 128, elements: !47)
!47 = !{!48, !50, !51}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_mp_alloc", scope: !46, file: !43, line: 152, baseType: !49, size: 32)
!49 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_mp_size", scope: !46, file: !43, line: 154, baseType: !49, size: 32, offset: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_mp_d", scope: !46, file: !43, line: 157, baseType: !52, size: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_limb_t", file: !43, line: 141, baseType: !54)
!54 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!55 = !{!56}
!56 = !DISubrange(count: 1)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !39, file: !3, line: 183, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!60 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!61 = !{!62, !63, !64, !66, !67, !68}
!62 = !DILocalVariable(name: "evaluate", arg: 1, scope: !29, file: !3, line: 978, type: !60)
!63 = !DILocalVariable(name: "l", scope: !29, file: !3, line: 980, type: !32)
!64 = !DILocalVariable(name: "r", scope: !65, file: !3, line: 988, type: !32)
!65 = distinct !DILexicalBlock(scope: !29, file: !3, line: 987, column: 5)
!66 = !DILocalVariable(name: "fxn", scope: !65, file: !3, line: 992, type: !28)
!67 = !DILocalVariable(name: "val", scope: !65, file: !3, line: 993, type: !60)
!68 = !DILocalVariable(name: "cmp", scope: !69, file: !3, line: 1013, type: !49)
!69 = distinct !DILexicalBlock(scope: !70, file: !3, line: 1012, column: 9)
!70 = distinct !DILexicalBlock(scope: !65, file: !3, line: 1011, column: 11)
!71 = !{!72, !73, !74, !75, !76, !77}
!72 = !DIEnumerator(name: "less_than", value: 0, isUnsigned: true)
!73 = !DIEnumerator(name: "less_equal", value: 1, isUnsigned: true)
!74 = !DIEnumerator(name: "equal", value: 2, isUnsigned: true)
!75 = !DIEnumerator(name: "not_equal", value: 3, isUnsigned: true)
!76 = !DIEnumerator(name: "greater_equal", value: 4, isUnsigned: true)
!77 = !DIEnumerator(name: "greater_than", value: 5, isUnsigned: true)
!78 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !79, file: !3, line: 950, baseType: !6, size: 32, elements: !85)
!79 = distinct !DISubprogram(name: "eval3", scope: !3, file: !3, line: 946, type: !30, scopeLine: 947, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !80)
!80 = !{!81, !82, !83, !84}
!81 = !DILocalVariable(name: "evaluate", arg: 1, scope: !79, file: !3, line: 946, type: !60)
!82 = !DILocalVariable(name: "l", scope: !79, file: !3, line: 948, type: !32)
!83 = !DILocalVariable(name: "r", scope: !79, file: !3, line: 949, type: !32)
!84 = !DILocalVariable(name: "fxn", scope: !79, file: !3, line: 950, type: !78)
!85 = !{!86, !87}
!86 = !DIEnumerator(name: "plus", value: 0, isUnsigned: true)
!87 = !DIEnumerator(name: "minus", value: 1, isUnsigned: true)
!88 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !89, file: !3, line: 911, baseType: !6, size: 32, elements: !95)
!89 = distinct !DISubprogram(name: "eval4", scope: !3, file: !3, line: 907, type: !30, scopeLine: 908, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !90)
!90 = !{!91, !92, !93, !94}
!91 = !DILocalVariable(name: "evaluate", arg: 1, scope: !89, file: !3, line: 907, type: !60)
!92 = !DILocalVariable(name: "l", scope: !89, file: !3, line: 909, type: !32)
!93 = !DILocalVariable(name: "r", scope: !89, file: !3, line: 910, type: !32)
!94 = !DILocalVariable(name: "fxn", scope: !89, file: !3, line: 911, type: !88)
!95 = !{!96, !97, !98}
!96 = !DIEnumerator(name: "multiply", value: 0, isUnsigned: true)
!97 = !DIEnumerator(name: "divide", value: 1, isUnsigned: true)
!98 = !DIEnumerator(name: "mod", value: 2, isUnsigned: true)
!99 = !{!100, !107, !165, !169, !173, !176, !179, !104, !156, !186, !194, !198, !201, !202, !205, !209, !211, !215, !218, !222, !223, !226, !244, !248, !158, !54, !254, !280, !294, !6}
!100 = !DISubprogram(name: "dcgettext", scope: !101, file: !101, line: 51, type: !102, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !106)
!101 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!102 = !DISubroutineType(types: !103)
!103 = !{!58, !104, !104, !49}
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !59)
!106 = !{}
!107 = !DISubprogram(name: "fputs_unlocked", scope: !108, file: !108, line: 662, type: !109, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !106)
!108 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!109 = !DISubroutineType(types: !110)
!110 = !{!49, !104, !111}
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !113, line: 49, size: 1728, elements: !114)
!113 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!114 = !{!115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !130, !131, !132, !133, !137, !139, !141, !143, !146, !148, !151, !154, !155, !157, !160, !161}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !112, file: !113, line: 51, baseType: !49, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !112, file: !113, line: 54, baseType: !58, size: 64, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !112, file: !113, line: 55, baseType: !58, size: 64, offset: 128)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !112, file: !113, line: 56, baseType: !58, size: 64, offset: 192)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !112, file: !113, line: 57, baseType: !58, size: 64, offset: 256)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !112, file: !113, line: 58, baseType: !58, size: 64, offset: 320)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !112, file: !113, line: 59, baseType: !58, size: 64, offset: 384)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !112, file: !113, line: 60, baseType: !58, size: 64, offset: 448)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !112, file: !113, line: 61, baseType: !58, size: 64, offset: 512)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !112, file: !113, line: 64, baseType: !58, size: 64, offset: 576)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !112, file: !113, line: 65, baseType: !58, size: 64, offset: 640)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !112, file: !113, line: 66, baseType: !58, size: 64, offset: 704)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !112, file: !113, line: 68, baseType: !128, size: 64, offset: 768)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !113, line: 36, flags: DIFlagFwdDecl)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !112, file: !113, line: 70, baseType: !111, size: 64, offset: 832)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !112, file: !113, line: 72, baseType: !49, size: 32, offset: 896)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !112, file: !113, line: 73, baseType: !49, size: 32, offset: 928)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !112, file: !113, line: 74, baseType: !134, size: 64, offset: 960)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !135, line: 152, baseType: !136)
!135 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!136 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !112, file: !113, line: 77, baseType: !138, size: 16, offset: 1024)
!138 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !112, file: !113, line: 78, baseType: !140, size: 8, offset: 1040)
!140 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !112, file: !113, line: 79, baseType: !142, size: 8, offset: 1048)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 8, elements: !55)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !112, file: !113, line: 81, baseType: !144, size: 64, offset: 1088)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !113, line: 43, baseType: null)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !112, file: !113, line: 89, baseType: !147, size: 64, offset: 1152)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !135, line: 153, baseType: !136)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !112, file: !113, line: 91, baseType: !149, size: 64, offset: 1216)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !113, line: 37, flags: DIFlagFwdDecl)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !112, file: !113, line: 92, baseType: !152, size: 64, offset: 1280)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !113, line: 38, flags: DIFlagFwdDecl)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !112, file: !113, line: 93, baseType: !111, size: 64, offset: 1344)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !112, file: !113, line: 94, baseType: !156, size: 64, offset: 1408)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !112, file: !113, line: 95, baseType: !158, size: 64, offset: 1472)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !159, line: 46, baseType: !54)
!159 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !112, file: !113, line: 96, baseType: !49, size: 32, offset: 1536)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !112, file: !113, line: 98, baseType: !162, size: 160, offset: 1568)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 160, elements: !163)
!163 = !{!164}
!164 = !DISubrange(count: 20)
!165 = !DISubprogram(name: "set_program_name", scope: !166, file: !166, line: 37, type: !167, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !106)
!166 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!167 = !DISubroutineType(types: !168)
!168 = !{null, !104}
!169 = !DISubprogram(name: "setlocale", scope: !170, file: !170, line: 122, type: !171, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !106)
!170 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!171 = !DISubroutineType(types: !172)
!172 = !{!58, !49, !104}
!173 = !DISubprogram(name: "bindtextdomain", scope: !101, file: !101, line: 86, type: !174, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !106)
!174 = !DISubroutineType(types: !175)
!175 = !{!58, !104, !104}
!176 = !DISubprogram(name: "textdomain", scope: !101, file: !101, line: 82, type: !177, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !106)
!177 = !DISubroutineType(types: !178)
!178 = !{!58, !104}
!179 = !DISubprogram(name: "atexit", scope: !180, file: !180, line: 595, type: !181, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !106)
!180 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!181 = !DISubroutineType(types: !182)
!182 = !{!49, !183}
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{null}
!186 = !DISubprogram(name: "parse_long_options", scope: !187, file: !187, line: 25, type: !188, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !106)
!187 = !DIFile(filename: "./lib/long-options.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!188 = !DISubroutineType(types: !189)
!189 = !{null, !49, !190, !104, !104, !104, !191, null}
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{null, !49}
!194 = !DISubprogram(name: "error", scope: !195, file: !195, line: 52, type: !196, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !106)
!195 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!196 = !DISubroutineType(types: !197)
!197 = !{null, !49, !49, !104, null}
!198 = !DISubprogram(name: "quotearg_n_style", scope: !15, file: !15, line: 368, type: !199, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !106)
!199 = !DISubroutineType(types: !200)
!200 = !{!58, !49, !14, !104}
!201 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!202 = !DISubprogram(name: "puts", scope: !108, file: !108, line: 632, type: !203, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !106)
!203 = !DISubroutineType(types: !204)
!204 = !{!49, !104}
!205 = !DISubprogram(name: "strintcmp", scope: !206, file: !206, line: 1, type: !207, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !106)
!206 = !DIFile(filename: "./lib/strnumcmp.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!207 = !DISubroutineType(types: !208)
!208 = !{!49, !104, !104}
!209 = !DISubprogram(name: "strcoll", scope: !210, file: !210, line: 144, type: !207, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !106)
!210 = !DIFile(filename: "/usr/include/string.h", directory: "")
!211 = !DISubprogram(name: "mbslen", scope: !212, file: !212, line: 1241, type: !213, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !106)
!212 = !DIFile(filename: "./lib/string.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!213 = !DISubroutineType(types: !214)
!214 = !{!54, !104}
!215 = !DISubprogram(name: "free", scope: !180, file: !180, line: 565, type: !216, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !106)
!216 = !DISubroutineType(types: !217)
!217 = !{null, !156}
!218 = !DISubprogram(name: "xmalloc", scope: !219, file: !219, line: 53, type: !220, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !106)
!219 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!220 = !DISubroutineType(types: !221)
!221 = !{!156, !54}
!222 = !DISubprogram(name: "xstrdup", scope: !219, file: !219, line: 64, type: !177, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !106)
!223 = !DISubprogram(name: "mbschr", scope: !212, file: !212, line: 1271, type: !224, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !106)
!224 = !DISubroutineType(types: !225)
!225 = !{!58, !104, !49}
!226 = !DISubprogram(name: "mbsinit", scope: !227, file: !227, line: 292, type: !228, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !106)
!227 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!228 = !DISubroutineType(types: !229)
!229 = !{!49, !230}
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !232)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !233, line: 13, size: 64, elements: !234)
!233 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!234 = !{!235, !236}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !232, file: !233, line: 15, baseType: !49, size: 32)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !232, file: !233, line: 20, baseType: !237, size: 32, offset: 32)
!237 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !232, file: !233, line: 16, size: 32, elements: !238)
!238 = !{!239, !240}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !237, file: !233, line: 18, baseType: !6, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !237, file: !233, line: 19, baseType: !241, size: 32)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 32, elements: !242)
!242 = !{!243}
!243 = !DISubrange(count: 4)
!244 = !DISubprogram(name: "strnlen1", scope: !245, file: !245, line: 31, type: !246, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !106)
!245 = !DIFile(filename: "./lib/strnlen1.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!246 = !DISubroutineType(types: !247)
!247 = !{!54, !104, !54}
!248 = !DISubprogram(name: "rpl_mbrtowc", scope: !249, file: !249, line: 717, type: !250, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !106)
!249 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!250 = !DISubroutineType(types: !251)
!251 = !{!54, !252, !104, !54, !253}
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!254 = !DISubprogram(name: "rpl_re_compile_pattern", scope: !255, file: !255, line: 538, type: !256, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !106)
!255 = !DIFile(filename: "./lib/regex.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!256 = !DISubroutineType(types: !257)
!257 = !{!104, !104, !54, !258}
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_pattern_buffer", file: !255, line: 413, size: 512, elements: !260)
!260 = !{!261, !264, !266, !267, !269, !270, !272, !273, !274, !275, !276, !277, !278, !279}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !259, file: !255, line: 417, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DICompositeType(tag: DW_TAG_structure_type, name: "re_dfa_t", file: !255, line: 417, flags: DIFlagFwdDecl)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !259, file: !255, line: 420, baseType: !265, size: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "__re_long_size_t", file: !255, line: 49, baseType: !158)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !259, file: !255, line: 423, baseType: !265, size: 64, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "syntax", scope: !259, file: !255, line: 426, baseType: !268, size: 64, offset: 192)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_syntax_t", file: !255, line: 72, baseType: !54)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap", scope: !259, file: !255, line: 431, baseType: !58, size: 64, offset: 256)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "translate", scope: !259, file: !255, line: 437, baseType: !271, size: 64, offset: 320)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "re_nsub", scope: !259, file: !255, line: 440, baseType: !158, size: 64, offset: 384)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_null", scope: !259, file: !255, line: 446, baseType: !6, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "regs_allocated", scope: !259, file: !255, line: 457, baseType: !6, size: 2, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap_accurate", scope: !259, file: !255, line: 461, baseType: !6, size: 1, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "no_sub", scope: !259, file: !255, line: 465, baseType: !6, size: 1, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "not_bol", scope: !259, file: !255, line: 469, baseType: !6, size: 1, offset: 453, flags: DIFlagBitField, extraData: i64 448)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "not_eol", scope: !259, file: !255, line: 472, baseType: !6, size: 1, offset: 454, flags: DIFlagBitField, extraData: i64 448)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "newline_anchor", scope: !259, file: !255, line: 475, baseType: !6, size: 1, offset: 455, flags: DIFlagBitField, extraData: i64 448)
!280 = !DISubprogram(name: "rpl_re_match", scope: !255, file: !255, line: 571, type: !281, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !106)
!281 = !DISubroutineType(types: !282)
!282 = !{!136, !258, !104, !136, !136, !283}
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_registers", file: !255, line: 497, size: 192, elements: !285)
!285 = !{!286, !288, !293}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "num_regs", scope: !284, file: !255, line: 499, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "__re_size_t", file: !255, line: 45, baseType: !158)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !284, file: !255, line: 500, baseType: !289, size: 64, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "regoff_t", file: !255, line: 486, baseType: !291)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !108, line: 77, baseType: !292)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !135, line: 193, baseType: !136)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !284, file: !255, line: 501, baseType: !289, size: 64, offset: 128)
!294 = !DISubprogram(name: "rpl_regfree", scope: !255, file: !255, line: 651, type: !295, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !106)
!295 = !DISubroutineType(types: !296)
!296 = !{null, !258}
!297 = !{!0}
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "file_name", scope: !300, file: !301, line: 46, type: !104, isLocal: true, isDefinition: true)
!300 = distinct !DICompileUnit(language: DW_LANG_C99, file: !301, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !106, retainedTypes: !302, globals: !340, nameTableKind: None)
!301 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!302 = !{!303, !100, !339, !194}
!303 = !DISubprogram(name: "close_stream", scope: !304, file: !304, line: 2, type: !305, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !106)
!304 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!305 = !DISubroutineType(types: !306)
!306 = !{!49, !307}
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !113, line: 49, size: 1728, elements: !309)
!309 = !{!310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !308, file: !113, line: 51, baseType: !49, size: 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !308, file: !113, line: 54, baseType: !58, size: 64, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !308, file: !113, line: 55, baseType: !58, size: 64, offset: 128)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !308, file: !113, line: 56, baseType: !58, size: 64, offset: 192)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !308, file: !113, line: 57, baseType: !58, size: 64, offset: 256)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !308, file: !113, line: 58, baseType: !58, size: 64, offset: 320)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !308, file: !113, line: 59, baseType: !58, size: 64, offset: 384)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !308, file: !113, line: 60, baseType: !58, size: 64, offset: 448)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !308, file: !113, line: 61, baseType: !58, size: 64, offset: 512)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !308, file: !113, line: 64, baseType: !58, size: 64, offset: 576)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !308, file: !113, line: 65, baseType: !58, size: 64, offset: 640)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !308, file: !113, line: 66, baseType: !58, size: 64, offset: 704)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !308, file: !113, line: 68, baseType: !128, size: 64, offset: 768)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !308, file: !113, line: 70, baseType: !307, size: 64, offset: 832)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !308, file: !113, line: 72, baseType: !49, size: 32, offset: 896)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !308, file: !113, line: 73, baseType: !49, size: 32, offset: 928)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !308, file: !113, line: 74, baseType: !134, size: 64, offset: 960)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !308, file: !113, line: 77, baseType: !138, size: 16, offset: 1024)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !308, file: !113, line: 78, baseType: !140, size: 8, offset: 1040)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !308, file: !113, line: 79, baseType: !142, size: 8, offset: 1048)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !308, file: !113, line: 81, baseType: !144, size: 64, offset: 1088)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !308, file: !113, line: 89, baseType: !147, size: 64, offset: 1152)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !308, file: !113, line: 91, baseType: !149, size: 64, offset: 1216)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !308, file: !113, line: 92, baseType: !152, size: 64, offset: 1280)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !308, file: !113, line: 93, baseType: !307, size: 64, offset: 1344)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !308, file: !113, line: 94, baseType: !156, size: 64, offset: 1408)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !308, file: !113, line: 95, baseType: !158, size: 64, offset: 1472)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !308, file: !113, line: 96, baseType: !49, size: 32, offset: 1536)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !308, file: !113, line: 98, baseType: !162, size: 160, offset: 1568)
!339 = !DISubprogram(name: "quotearg_colon", scope: !15, file: !15, line: 391, type: !177, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !106)
!340 = !{!298, !341}
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !300, file: !301, line: 56, type: !60, isLocal: true, isDefinition: true)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "exit_failure", scope: !345, file: !346, line: 24, type: !348, isDefinition: true)
!345 = distinct !DICompileUnit(language: DW_LANG_C99, file: !346, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !106, globals: !347, nameTableKind: None)
!346 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!347 = !{!343}
!348 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !49)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(name: "long_options", scope: !351, file: !352, line: 34, type: !412, isLocal: true, isDefinition: true)
!351 = distinct !DICompileUnit(language: DW_LANG_C99, file: !352, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !106, retainedTypes: !353, globals: !411, nameTableKind: None)
!352 = !DIFile(filename: "lib/long-options.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!353 = !{!354, !368}
!354 = !DISubprogram(name: "getopt_long", scope: !355, file: !355, line: 66, type: !356, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !106)
!355 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!356 = !DISubroutineType(types: !357)
!357 = !{!49, !49, !358, !104, !360, !252}
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !362)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !355, line: 50, size: 256, elements: !363)
!363 = !{!364, !365, !366, !367}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !362, file: !355, line: 52, baseType: !104, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !362, file: !355, line: 55, baseType: !49, size: 32, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !362, file: !355, line: 56, baseType: !252, size: 64, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !362, file: !355, line: 57, baseType: !49, size: 32, offset: 192)
!368 = !DISubprogram(name: "version_etc_va", scope: !369, file: !369, line: 63, type: !370, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !106)
!369 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!370 = !DISubroutineType(types: !371)
!371 = !{null, !372, !104, !104, !104, !404}
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !113, line: 49, size: 1728, elements: !374)
!374 = !{!375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !373, file: !113, line: 51, baseType: !49, size: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !373, file: !113, line: 54, baseType: !58, size: 64, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !373, file: !113, line: 55, baseType: !58, size: 64, offset: 128)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !373, file: !113, line: 56, baseType: !58, size: 64, offset: 192)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !373, file: !113, line: 57, baseType: !58, size: 64, offset: 256)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !373, file: !113, line: 58, baseType: !58, size: 64, offset: 320)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !373, file: !113, line: 59, baseType: !58, size: 64, offset: 384)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !373, file: !113, line: 60, baseType: !58, size: 64, offset: 448)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !373, file: !113, line: 61, baseType: !58, size: 64, offset: 512)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !373, file: !113, line: 64, baseType: !58, size: 64, offset: 576)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !373, file: !113, line: 65, baseType: !58, size: 64, offset: 640)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !373, file: !113, line: 66, baseType: !58, size: 64, offset: 704)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !373, file: !113, line: 68, baseType: !128, size: 64, offset: 768)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !373, file: !113, line: 70, baseType: !372, size: 64, offset: 832)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !373, file: !113, line: 72, baseType: !49, size: 32, offset: 896)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !373, file: !113, line: 73, baseType: !49, size: 32, offset: 928)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !373, file: !113, line: 74, baseType: !134, size: 64, offset: 960)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !373, file: !113, line: 77, baseType: !138, size: 16, offset: 1024)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !373, file: !113, line: 78, baseType: !140, size: 8, offset: 1040)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !373, file: !113, line: 79, baseType: !142, size: 8, offset: 1048)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !373, file: !113, line: 81, baseType: !144, size: 64, offset: 1088)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !373, file: !113, line: 89, baseType: !147, size: 64, offset: 1152)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !373, file: !113, line: 91, baseType: !149, size: 64, offset: 1216)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !373, file: !113, line: 92, baseType: !152, size: 64, offset: 1280)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !373, file: !113, line: 93, baseType: !372, size: 64, offset: 1344)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !373, file: !113, line: 94, baseType: !156, size: 64, offset: 1408)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !373, file: !113, line: 95, baseType: !158, size: 64, offset: 1472)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !373, file: !113, line: 96, baseType: !49, size: 32, offset: 1536)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !373, file: !113, line: 98, baseType: !162, size: 160, offset: 1568)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !352, line: 72, size: 192, elements: !406)
!406 = !{!407, !408, !409, !410}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !405, file: !352, line: 72, baseType: !6, size: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !405, file: !352, line: 72, baseType: !6, size: 32, offset: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !405, file: !352, line: 72, baseType: !156, size: 64, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !405, file: !352, line: 72, baseType: !156, size: 64, offset: 128)
!411 = !{!349}
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !361, size: 768, elements: !413)
!413 = !{!414}
!414 = !DISubrange(count: 3)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(name: "program_name", scope: !417, file: !418, line: 33, type: !104, isDefinition: true)
!417 = distinct !DICompileUnit(language: DW_LANG_C99, file: !418, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !106, retainedTypes: !419, globals: !455, nameTableKind: None)
!418 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!419 = !{!156, !420, !58}
!420 = !DISubprogram(name: "fputs", scope: !108, file: !108, line: 626, type: !421, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !106)
!421 = !DISubroutineType(types: !422)
!422 = !{!49, !104, !423}
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !113, line: 49, size: 1728, elements: !425)
!425 = !{!426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !424, file: !113, line: 51, baseType: !49, size: 32)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !424, file: !113, line: 54, baseType: !58, size: 64, offset: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !424, file: !113, line: 55, baseType: !58, size: 64, offset: 128)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !424, file: !113, line: 56, baseType: !58, size: 64, offset: 192)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !424, file: !113, line: 57, baseType: !58, size: 64, offset: 256)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !424, file: !113, line: 58, baseType: !58, size: 64, offset: 320)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !424, file: !113, line: 59, baseType: !58, size: 64, offset: 384)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !424, file: !113, line: 60, baseType: !58, size: 64, offset: 448)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !424, file: !113, line: 61, baseType: !58, size: 64, offset: 512)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !424, file: !113, line: 64, baseType: !58, size: 64, offset: 576)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !424, file: !113, line: 65, baseType: !58, size: 64, offset: 640)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !424, file: !113, line: 66, baseType: !58, size: 64, offset: 704)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !424, file: !113, line: 68, baseType: !128, size: 64, offset: 768)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !424, file: !113, line: 70, baseType: !423, size: 64, offset: 832)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !424, file: !113, line: 72, baseType: !49, size: 32, offset: 896)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !424, file: !113, line: 73, baseType: !49, size: 32, offset: 928)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !424, file: !113, line: 74, baseType: !134, size: 64, offset: 960)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !424, file: !113, line: 77, baseType: !138, size: 16, offset: 1024)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !424, file: !113, line: 78, baseType: !140, size: 8, offset: 1040)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !424, file: !113, line: 79, baseType: !142, size: 8, offset: 1048)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !424, file: !113, line: 81, baseType: !144, size: 64, offset: 1088)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !424, file: !113, line: 89, baseType: !147, size: 64, offset: 1152)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !424, file: !113, line: 91, baseType: !149, size: 64, offset: 1216)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !424, file: !113, line: 92, baseType: !152, size: 64, offset: 1280)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !424, file: !113, line: 93, baseType: !423, size: 64, offset: 1344)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !424, file: !113, line: 94, baseType: !156, size: 64, offset: 1408)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !424, file: !113, line: 95, baseType: !158, size: 64, offset: 1472)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !424, file: !113, line: 96, baseType: !49, size: 32, offset: 1536)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !424, file: !113, line: 98, baseType: !162, size: 160, offset: 1568)
!455 = !{!415}
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !458, file: !459, line: 85, type: !564, isDefinition: true)
!458 = distinct !DICompileUnit(language: DW_LANG_C99, file: !459, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !460, retainedTypes: !481, globals: !537, nameTableKind: None)
!459 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!460 = !{!14, !461, !466}
!461 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !15, line: 242, baseType: !6, size: 32, elements: !462)
!462 = !{!463, !464, !465}
!463 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!464 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!465 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!466 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !467, line: 46, baseType: !6, size: 32, elements: !468)
!467 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!468 = !{!469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480}
!469 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!470 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!471 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!472 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!473 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!474 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!475 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!476 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!477 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!478 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!479 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!480 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!481 = !{!482, !487, !215, !503, !49, !138, !506, !158, !518, !522, !100, !527, !531, !58, !218, !533, !534}
!482 = !DISubprogram(name: "xmemdup", scope: !219, file: !219, line: 62, type: !483, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !106)
!483 = !DISubroutineType(types: !484)
!484 = !{!156, !485, !54}
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!487 = !DISubprogram(name: "quotearg_alloc_mem", scope: !15, file: !15, line: 342, type: !488, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !106)
!488 = !DISubroutineType(types: !489)
!489 = !{!58, !104, !54, !490, !491}
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !493)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !459, line: 65, size: 448, elements: !494)
!494 = !{!495, !496, !497, !501, !502}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !493, file: !459, line: 68, baseType: !14, size: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !493, file: !459, line: 71, baseType: !49, size: 32, offset: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !493, file: !459, line: 75, baseType: !498, size: 256, offset: 64)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !499)
!499 = !{!500}
!500 = !DISubrange(count: 8)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !493, file: !459, line: 78, baseType: !104, size: 64, offset: 320)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !493, file: !459, line: 81, baseType: !104, size: 64, offset: 384)
!503 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !15, file: !15, line: 408, type: !504, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !106)
!504 = !DISubroutineType(types: !505)
!505 = !{!58, !49, !104, !104, !104, !54}
!506 = !DISubprogram(name: "rpl_mbrtowc", scope: !249, file: !249, line: 717, type: !507, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !106)
!507 = !DISubroutineType(types: !508)
!508 = !{!54, !252, !104, !54, !509}
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !233, line: 13, size: 64, elements: !511)
!511 = !{!512, !513}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !510, file: !233, line: 15, baseType: !49, size: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !510, file: !233, line: 20, baseType: !514, size: 32, offset: 32)
!514 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !510, file: !233, line: 16, size: 32, elements: !515)
!515 = !{!516, !517}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !514, file: !233, line: 18, baseType: !6, size: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !514, file: !233, line: 19, baseType: !241, size: 32)
!518 = !DISubprogram(name: "iswprint", scope: !519, file: !519, line: 120, type: !520, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !106)
!519 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!520 = !DISubroutineType(types: !521)
!521 = !{!49, !6}
!522 = !DISubprogram(name: "mbsinit", scope: !227, file: !227, line: 292, type: !523, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !106)
!523 = !DISubroutineType(types: !524)
!524 = !{!49, !525}
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !510)
!527 = !DISubprogram(name: "locale_charset", scope: !528, file: !528, line: 35, type: !529, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !106)
!528 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!529 = !DISubroutineType(types: !530)
!530 = !{!104}
!531 = !DISubprogram(name: "c_strcasecmp", scope: !532, file: !532, line: 42, type: !207, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !106)
!532 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!533 = !DISubprogram(name: "xalloc_die", scope: !219, file: !219, line: 51, type: !184, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !106)
!534 = !DISubprogram(name: "xrealloc", scope: !219, file: !219, line: 59, type: !535, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !106)
!535 = !DISubroutineType(types: !536)
!536 = !{!156, !156, !54}
!537 = !{!456, !538, !544, !546, !548, !553, !560, !562}
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !458, file: !459, line: 101, type: !540, isDefinition: true)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !541, size: 320, elements: !542)
!541 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!542 = !{!543}
!543 = !DISubrange(count: 10)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !458, file: !459, line: 1052, type: !493, isDefinition: true)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !458, file: !459, line: 116, type: !493, isLocal: true, isDefinition: true)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(name: "slot0", scope: !458, file: !459, line: 842, type: !550, isLocal: true, isDefinition: true)
!550 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 2048, elements: !551)
!551 = !{!552}
!552 = !DISubrange(count: 256)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(name: "slotvec", scope: !458, file: !459, line: 845, type: !555, isLocal: true, isDefinition: true)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !459, line: 834, size: 128, elements: !557)
!557 = !{!558, !559}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !556, file: !459, line: 836, baseType: !158, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !556, file: !459, line: 837, baseType: !58, size: 64, offset: 64)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(name: "nslots", scope: !458, file: !459, line: 843, type: !49, isLocal: true, isDefinition: true)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(name: "slotvec0", scope: !458, file: !459, line: 844, type: !556, isLocal: true, isDefinition: true)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 704, elements: !566)
!565 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !104)
!566 = !{!567}
!567 = !DISubrange(count: 11)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !570, file: !571, line: 26, type: !573, isDefinition: true)
!570 = distinct !DICompileUnit(language: DW_LANG_C99, file: !571, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !106, globals: !572, nameTableKind: None)
!571 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!572 = !{!568}
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 376, elements: !574)
!574 = !{!575}
!575 = !DISubrange(count: 47)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(name: "rpl_re_syntax_options", scope: !578, file: !1341, line: 243, type: !268, isDefinition: true)
!578 = distinct !DICompileUnit(language: DW_LANG_C99, file: !579, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !580, retainedTypes: !1043, globals: !1338, nameTableKind: None)
!579 = !DIFile(filename: "lib/regex.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!580 = !{!581, !594, !630, !650, !466, !1036}
!581 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !582, line: 206, baseType: !6, size: 32, elements: !583)
!582 = !DIFile(filename: "./lib/regex_internal.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!583 = !{!584, !585, !586, !587, !588, !589, !590, !591, !592, !593}
!584 = !DIEnumerator(name: "INSIDE_WORD", value: 5, isUnsigned: true)
!585 = !DIEnumerator(name: "WORD_FIRST", value: 6, isUnsigned: true)
!586 = !DIEnumerator(name: "WORD_LAST", value: 9, isUnsigned: true)
!587 = !DIEnumerator(name: "INSIDE_NOTWORD", value: 10, isUnsigned: true)
!588 = !DIEnumerator(name: "LINE_FIRST", value: 16, isUnsigned: true)
!589 = !DIEnumerator(name: "LINE_LAST", value: 32, isUnsigned: true)
!590 = !DIEnumerator(name: "BUF_FIRST", value: 64, isUnsigned: true)
!591 = !DIEnumerator(name: "BUF_LAST", value: 128, isUnsigned: true)
!592 = !DIEnumerator(name: "WORD_DELIM", value: 256, isUnsigned: true)
!593 = !DIEnumerator(name: "NOT_WORD_DELIM", value: 512, isUnsigned: true)
!594 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !582, line: 227, baseType: !6, size: 32, elements: !595)
!595 = !{!596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629}
!596 = !DIEnumerator(name: "NON_TYPE", value: 0, isUnsigned: true)
!597 = !DIEnumerator(name: "CHARACTER", value: 1, isUnsigned: true)
!598 = !DIEnumerator(name: "END_OF_RE", value: 2, isUnsigned: true)
!599 = !DIEnumerator(name: "SIMPLE_BRACKET", value: 3, isUnsigned: true)
!600 = !DIEnumerator(name: "OP_BACK_REF", value: 4, isUnsigned: true)
!601 = !DIEnumerator(name: "OP_PERIOD", value: 5, isUnsigned: true)
!602 = !DIEnumerator(name: "COMPLEX_BRACKET", value: 6, isUnsigned: true)
!603 = !DIEnumerator(name: "OP_UTF8_PERIOD", value: 7, isUnsigned: true)
!604 = !DIEnumerator(name: "OP_OPEN_SUBEXP", value: 8, isUnsigned: true)
!605 = !DIEnumerator(name: "OP_CLOSE_SUBEXP", value: 9, isUnsigned: true)
!606 = !DIEnumerator(name: "OP_ALT", value: 10, isUnsigned: true)
!607 = !DIEnumerator(name: "OP_DUP_ASTERISK", value: 11, isUnsigned: true)
!608 = !DIEnumerator(name: "ANCHOR", value: 12, isUnsigned: true)
!609 = !DIEnumerator(name: "CONCAT", value: 16, isUnsigned: true)
!610 = !DIEnumerator(name: "SUBEXP", value: 17, isUnsigned: true)
!611 = !DIEnumerator(name: "OP_DUP_PLUS", value: 18, isUnsigned: true)
!612 = !DIEnumerator(name: "OP_DUP_QUESTION", value: 19, isUnsigned: true)
!613 = !DIEnumerator(name: "OP_OPEN_BRACKET", value: 20, isUnsigned: true)
!614 = !DIEnumerator(name: "OP_CLOSE_BRACKET", value: 21, isUnsigned: true)
!615 = !DIEnumerator(name: "OP_CHARSET_RANGE", value: 22, isUnsigned: true)
!616 = !DIEnumerator(name: "OP_OPEN_DUP_NUM", value: 23, isUnsigned: true)
!617 = !DIEnumerator(name: "OP_CLOSE_DUP_NUM", value: 24, isUnsigned: true)
!618 = !DIEnumerator(name: "OP_NON_MATCH_LIST", value: 25, isUnsigned: true)
!619 = !DIEnumerator(name: "OP_OPEN_COLL_ELEM", value: 26, isUnsigned: true)
!620 = !DIEnumerator(name: "OP_CLOSE_COLL_ELEM", value: 27, isUnsigned: true)
!621 = !DIEnumerator(name: "OP_OPEN_EQUIV_CLASS", value: 28, isUnsigned: true)
!622 = !DIEnumerator(name: "OP_CLOSE_EQUIV_CLASS", value: 29, isUnsigned: true)
!623 = !DIEnumerator(name: "OP_OPEN_CHAR_CLASS", value: 30, isUnsigned: true)
!624 = !DIEnumerator(name: "OP_CLOSE_CHAR_CLASS", value: 31, isUnsigned: true)
!625 = !DIEnumerator(name: "OP_WORD", value: 32, isUnsigned: true)
!626 = !DIEnumerator(name: "OP_NOTWORD", value: 33, isUnsigned: true)
!627 = !DIEnumerator(name: "OP_SPACE", value: 34, isUnsigned: true)
!628 = !DIEnumerator(name: "OP_NOTSPACE", value: 35, isUnsigned: true)
!629 = !DIEnumerator(name: "BACK_SLASH", value: 36, isUnsigned: true)
!630 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !255, line: 346, baseType: !49, size: 32, elements: !631)
!631 = !{!632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649}
!632 = !DIEnumerator(name: "_REG_ENOSYS", value: -1)
!633 = !DIEnumerator(name: "_REG_NOERROR", value: 0)
!634 = !DIEnumerator(name: "_REG_NOMATCH", value: 1)
!635 = !DIEnumerator(name: "_REG_BADPAT", value: 2)
!636 = !DIEnumerator(name: "_REG_ECOLLATE", value: 3)
!637 = !DIEnumerator(name: "_REG_ECTYPE", value: 4)
!638 = !DIEnumerator(name: "_REG_EESCAPE", value: 5)
!639 = !DIEnumerator(name: "_REG_ESUBREG", value: 6)
!640 = !DIEnumerator(name: "_REG_EBRACK", value: 7)
!641 = !DIEnumerator(name: "_REG_EPAREN", value: 8)
!642 = !DIEnumerator(name: "_REG_EBRACE", value: 9)
!643 = !DIEnumerator(name: "_REG_BADBR", value: 10)
!644 = !DIEnumerator(name: "_REG_ERANGE", value: 11)
!645 = !DIEnumerator(name: "_REG_ESPACE", value: 12)
!646 = !DIEnumerator(name: "_REG_BADRPT", value: 13)
!647 = !DIEnumerator(name: "_REG_EEND", value: 14)
!648 = !DIEnumerator(name: "_REG_ESIZE", value: 15)
!649 = !DIEnumerator(name: "_REG_ERPAREN", value: 16)
!650 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !651, line: 41, baseType: !6, size: 32, elements: !652)
!651 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!652 = !{!653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035}
!653 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!654 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!655 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!656 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!657 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!658 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!659 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!660 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!661 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!662 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!663 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!664 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!665 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!666 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!667 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!668 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!669 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!670 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!671 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!672 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!673 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!674 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!675 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!676 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!677 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!678 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!679 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!680 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!681 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!682 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!683 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!684 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!685 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!686 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!687 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!688 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!689 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!690 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!691 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!692 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!693 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!694 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!695 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!696 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!697 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!698 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!699 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!700 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!701 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!702 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!703 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!704 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!705 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!706 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!707 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!708 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!709 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!710 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!711 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!712 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!713 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!714 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!715 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!716 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!717 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!719 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!720 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!721 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!722 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!723 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!724 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!725 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!726 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!727 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!728 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!729 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!730 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!731 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!732 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!733 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!734 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!735 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!736 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!737 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!738 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!739 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!740 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!741 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!742 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!743 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!744 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!745 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!746 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!747 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!748 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!749 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!750 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!751 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!752 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!753 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!754 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!755 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!756 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!757 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!758 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!759 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!760 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!761 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!762 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!763 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!764 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!765 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!766 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!767 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!768 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!769 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!770 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!771 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!772 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!773 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!774 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!775 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!779 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!780 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!781 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!782 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!783 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!784 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!785 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!786 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!787 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!788 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!789 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!790 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!791 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!793 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!794 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!795 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!796 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!797 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!798 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!799 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!800 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!801 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!802 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!803 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!804 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!805 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!806 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!807 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!808 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!809 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!810 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!812 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!813 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!814 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!815 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!816 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!817 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!818 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!819 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!820 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!821 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!822 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!823 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!824 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!825 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!826 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!827 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!828 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!829 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!830 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!831 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!832 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!833 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!834 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!835 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!836 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!837 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!838 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!839 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!840 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!841 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!842 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!843 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!844 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!845 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!846 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!847 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!848 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!884 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!885 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!886 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!887 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!894 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!895 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!896 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!898 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!899 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!900 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!901 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!902 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!903 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!904 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!905 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!906 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!907 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!908 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!909 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!910 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!911 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!912 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!913 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!914 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!915 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!916 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!917 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!918 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!919 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!920 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!921 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!922 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!923 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!924 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!925 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!926 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!927 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!928 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!929 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!930 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!931 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!932 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!933 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!934 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!935 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!936 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!937 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!938 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!939 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!940 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!941 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!942 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!943 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!944 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!945 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!946 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!947 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!948 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!949 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!950 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!951 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!952 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!953 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!954 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!955 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!956 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!957 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!958 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!959 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!960 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!961 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!962 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!963 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!964 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!965 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!966 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!967 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!968 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!969 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!970 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!971 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!972 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!973 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!974 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!975 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!976 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!977 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!978 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!979 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!980 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!981 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!982 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!983 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!984 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!985 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!986 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!987 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!988 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!989 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!990 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!991 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!992 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!993 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!994 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!995 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!996 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!997 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!998 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!999 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!1000 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!1001 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!1002 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!1003 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!1004 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!1005 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!1006 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!1007 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!1008 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!1009 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!1010 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!1011 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!1012 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!1013 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!1014 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!1015 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!1016 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!1017 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!1018 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!1019 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!1020 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!1021 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!1022 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!1023 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!1024 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!1025 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!1026 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!1027 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!1028 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!1029 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!1030 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!1031 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!1032 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!1033 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!1034 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!1035 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!1036 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !582, line: 699, baseType: !6, size: 32, elements: !1037)
!1037 = !{!1038, !1039, !1040, !1041, !1042}
!1038 = !DIEnumerator(name: "SB_CHAR", value: 0, isUnsigned: true)
!1039 = !DIEnumerator(name: "MB_CHAR", value: 1, isUnsigned: true)
!1040 = !DIEnumerator(name: "EQUIV_CLASS", value: 2, isUnsigned: true)
!1041 = !DIEnumerator(name: "COLL_SYM", value: 3, isUnsigned: true)
!1042 = !DIEnumerator(name: "CHAR_CLASS", value: 4, isUnsigned: true)
!1043 = !{!54, !49, !100, !58, !156, !215, !104, !1044, !1056, !158, !1059, !271, !1060, !1065, !1198, !1202, !1074, !1205, !1207, !1113, !1210, !1083, !1215, !1216, !138, !1208, !1170, !1077, !1082, !1087, !1217, !1218, !1116, !1220, !1133, !1132, !1239, !1245, !201, !287, !1246, !1255, !1281, !1273, !1284, !1331}
!1044 = !DISubprogram(name: "rpl_mbrtowc", scope: !249, file: !249, line: 717, type: !1045, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !106)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{!54, !252, !104, !54, !1047}
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !233, line: 13, size: 64, elements: !1049)
!1049 = !{!1050, !1051}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1048, file: !233, line: 15, baseType: !49, size: 32)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1048, file: !233, line: 20, baseType: !1052, size: 32, offset: 32)
!1052 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1048, file: !233, line: 16, size: 32, elements: !1053)
!1053 = !{!1054, !1055}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1052, file: !233, line: 18, baseType: !6, size: 32)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1052, file: !233, line: 19, baseType: !241, size: 32)
!1056 = !DISubprogram(name: "towlower", scope: !519, file: !519, line: 166, type: !1057, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !106)
!1057 = !DISubroutineType(types: !1058)
!1058 = !{!6, !6}
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitset_word_t", file: !582, line: 182, baseType: !54)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "re_dfa_t", file: !582, line: 416, baseType: !1062)
