source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon.0 }
%struct.__mpz_struct = type { i32, i32, i64* }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.bin_tree_storage_t = type { %struct.bin_tree_storage_t*, [15 x %struct.bin_tree_t] }
%struct.bin_tree_t = type { %struct.bin_tree_t*, %struct.bin_tree_t*, %struct.bin_tree_t*, %struct.bin_tree_t*, %struct.bin_tree_t*, %struct.re_token_t, i64 }
%struct.bracket_elem_t = type { i32, %union.anon.1 }
%struct.infomap = type { i8*, i8* }
%struct.mbchar = type { i8*, i64, i8, i32, [24 x i8] }
%struct.mbuiter_multi = type { i8, %struct.__mbstate_t, i8, %struct.mbchar }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.re_backref_cache_entry = type { i64, i64, i64, i64, i64, i8 }
%struct.re_charset_t = type { i32*, i32*, i32*, i64*, i8, i64, i64, i64, i64, i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "args", scope: !2, file: !3, line: 189, type: !107, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !99, globals: !106, nameTableKind: None)
!3 = !DIFile(filename: "src/expr.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !10, !14, !28, !78, !88}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "valtype", file: !3, line: 169, baseType: !6, size: 32, elements: !7)
!6 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!7 = !{!8, !9}
!8 = !DIEnumerator(name: "integer", value: 0, isUnsigned: true)
!9 = !DIEnumerator(name: "string", value: 1, isUnsigned: true)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 156, baseType: !6, size: 32, elements: !11)
!11 = !{!12, !13}
!12 = !DIEnumerator(name: "EXPR_INVALID", value: 2, isUnsigned: true)
!13 = !DIEnumerator(name: "EXPR_FAILURE", value: 3, isUnsigned: true)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !15, line: 32, baseType: !6, size: 32, elements: !16)
!15 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27}
!17 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!18 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!19 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!20 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!21 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!22 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!23 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!24 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!25 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!26 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!27 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !29, file: !3, line: 989, baseType: !6, size: 32, elements: !71)
!29 = distinct !DISubprogram(name: "eval2", scope: !3, file: !3, line: 978, type: !30, scopeLine: 979, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !61)
!30 = !DISubroutineType(types: !31)
!31 = !{!32, !60}
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "VALUE", file: !3, line: 186, baseType: !34)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "valinfo", file: !3, line: 177, size: 192, elements: !35)
!35 = !{!36, !38}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !34, file: !3, line: 179, baseType: !37, size: 32)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "TYPE", file: !3, line: 174, baseType: !5)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !34, file: !3, line: 184, baseType: !39, size: 128, offset: 64)
!39 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !34, file: !3, line: 180, size: 128, elements: !40)
!40 = !{!41, !57}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !39, file: !3, line: 182, baseType: !42, size: 128)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpz_t", file: !43, line: 164, baseType: !44)
!43 = !DIFile(filename: "/usr/include/gmp.h", directory: "")
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 128, elements: !55)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mpz_struct", file: !43, line: 158, baseType: !46)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !43, line: 150, size: 128, elements: !47)
!47 = !{!48, !50, !51}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_mp_alloc", scope: !46, file: !43, line: 152, baseType: !49, size: 32)
!49 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_mp_size", scope: !46, file: !43, line: 154, baseType: !49, size: 32, offset: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_mp_d", scope: !46, file: !43, line: 157, baseType: !52, size: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_limb_t", file: !43, line: 141, baseType: !54)
!54 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!55 = !{!56}
!56 = !DISubrange(count: 1)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !39, file: !3, line: 183, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!60 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!61 = !{!62, !63, !64, !66, !67, !68}
!62 = !DILocalVariable(name: "evaluate", arg: 1, scope: !29, file: !3, line: 978, type: !60)
!63 = !DILocalVariable(name: "l", scope: !29, file: !3, line: 980, type: !32)
!64 = !DILocalVariable(name: "r", scope: !65, file: !3, line: 988, type: !32)
!65 = distinct !DILexicalBlock(scope: !29, file: !3, line: 987, column: 5)
!66 = !DILocalVariable(name: "fxn", scope: !65, file: !3, line: 992, type: !28)
!67 = !DILocalVariable(name: "val", scope: !65, file: !3, line: 993, type: !60)
!68 = !DILocalVariable(name: "cmp", scope: !69, file: !3, line: 1013, type: !49)
!69 = distinct !DILexicalBlock(scope: !70, file: !3, line: 1012, column: 9)
!70 = distinct !DILexicalBlock(scope: !65, file: !3, line: 1011, column: 11)
!71 = !{!72, !73, !74, !75, !76, !77}
!72 = !DIEnumerator(name: "less_than", value: 0, isUnsigned: true)
!73 = !DIEnumerator(name: "less_equal", value: 1, isUnsigned: true)
!74 = !DIEnumerator(name: "equal", value: 2, isUnsigned: true)
!75 = !DIEnumerator(name: "not_equal", value: 3, isUnsigned: true)
!76 = !DIEnumerator(name: "greater_equal", value: 4, isUnsigned: true)
!77 = !DIEnumerator(name: "greater_than", value: 5, isUnsigned: true)
!78 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !79, file: !3, line: 950, baseType: !6, size: 32, elements: !85)
!79 = distinct !DISubprogram(name: "eval3", scope: !3, file: !3, line: 946, type: !30, scopeLine: 947, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !80)
!80 = !{!81, !82, !83, !84}
!81 = !DILocalVariable(name: "evaluate", arg: 1, scope: !79, file: !3, line: 946, type: !60)
!82 = !DILocalVariable(name: "l", scope: !79, file: !3, line: 948, type: !32)
!83 = !DILocalVariable(name: "r", scope: !79, file: !3, line: 949, type: !32)
!84 = !DILocalVariable(name: "fxn", scope: !79, file: !3, line: 950, type: !78)
!85 = !{!86, !87}
!86 = !DIEnumerator(name: "plus", value: 0, isUnsigned: true)
!87 = !DIEnumerator(name: "minus", value: 1, isUnsigned: true)
!88 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !89, file: !3, line: 911, baseType: !6, size: 32, elements: !95)
!89 = distinct !DISubprogram(name: "eval4", scope: !3, file: !3, line: 907, type: !30, scopeLine: 908, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !90)
!90 = !{!91, !92, !93, !94}
!91 = !DILocalVariable(name: "evaluate", arg: 1, scope: !89, file: !3, line: 907, type: !60)
!92 = !DILocalVariable(name: "l", scope: !89, file: !3, line: 909, type: !32)
!93 = !DILocalVariable(name: "r", scope: !89, file: !3, line: 910, type: !32)
!94 = !DILocalVariable(name: "fxn", scope: !89, file: !3, line: 911, type: !88)
!95 = !{!96, !97, !98}
!96 = !DIEnumerator(name: "multiply", value: 0, isUnsigned: true)
!97 = !DIEnumerator(name: "divide", value: 1, isUnsigned: true)
!98 = !DIEnumerator(name: "mod", value: 2, isUnsigned: true)
!99 = !{!100, !102, !103, !104, !54, !6}
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !59)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!103 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !105, line: 46, baseType: !54)
!105 = !DIFile(filename: "/usr/lib/clang/12.0.1/include/stddef.h", directory: "")
!106 = !{!0}
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(name: "file_name", scope: !110, file: !111, line: 46, type: !100, isLocal: true, isDefinition: true)
!110 = distinct !DICompileUnit(language: DW_LANG_C99, file: !111, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !112, globals: !113, nameTableKind: None)
!111 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!112 = !{}
!113 = !{!108, !114}
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !110, file: !111, line: 56, type: !60, isLocal: true, isDefinition: true)
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(name: "exit_failure", scope: !118, file: !119, line: 24, type: !121, isDefinition: true)
!118 = distinct !DICompileUnit(language: DW_LANG_C99, file: !119, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !112, globals: !120, nameTableKind: None)
!119 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!120 = !{!116}
!121 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !49)
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(name: "long_options", scope: !124, file: !125, line: 34, type: !127, isLocal: true, isDefinition: true)
!124 = distinct !DICompileUnit(language: DW_LANG_C99, file: !125, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !112, globals: !126, nameTableKind: None)
!125 = !DIFile(filename: "lib/long-options.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!126 = !{!122}
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 768, elements: !137)
!128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !129)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !130, line: 50, size: 256, elements: !131)
!130 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!131 = !{!132, !133, !134, !136}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !129, file: !130, line: 52, baseType: !100, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !129, file: !130, line: 55, baseType: !49, size: 32, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !129, file: !130, line: 56, baseType: !135, size: 64, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !129, file: !130, line: 57, baseType: !49, size: 32, offset: 192)
!137 = !{!138}
!138 = !DISubrange(count: 3)
!139 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression())
!140 = distinct !DIGlobalVariable(name: "program_name", scope: !141, file: !142, line: 33, type: !100, isDefinition: true)
!141 = distinct !DICompileUnit(language: DW_LANG_C99, file: !142, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !112, retainedTypes: !143, globals: !144, nameTableKind: None)
!142 = !DIFile(filename: "lib/progname.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!143 = !{!102, !58}
!144 = !{!139}
!145 = !DIGlobalVariableExpression(var: !146, expr: !DIExpression())
!146 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !147, file: !148, line: 85, type: !209, isDefinition: true)
!147 = distinct !DICompileUnit(language: DW_LANG_C99, file: !148, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !149, retainedTypes: !170, globals: !172, nameTableKind: None)
!148 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!149 = !{!14, !150, !155}
!150 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !15, line: 242, baseType: !6, size: 32, elements: !151)
!151 = !{!152, !153, !154}
!152 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!153 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!154 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!155 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !156, line: 46, baseType: !6, size: 32, elements: !157)
!156 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!157 = !{!158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169}
!158 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!159 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!160 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!161 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!162 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!163 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!164 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!165 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!166 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!167 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!168 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!169 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!170 = !{!49, !171, !104, !58}
!171 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!172 = !{!145, !173, !179, !191, !193, !198, !205, !207}
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !147, file: !148, line: 101, type: !175, isDefinition: true)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 320, elements: !177)
!176 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!177 = !{!178}
!178 = !DISubrange(count: 10)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !147, file: !148, line: 1052, type: !181, isDefinition: true)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !148, line: 65, size: 448, elements: !182)
!182 = !{!183, !184, !185, !189, !190}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !181, file: !148, line: 68, baseType: !14, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !181, file: !148, line: 71, baseType: !49, size: 32, offset: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !181, file: !148, line: 75, baseType: !186, size: 256, offset: 64)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !187)
!187 = !{!188}
!188 = !DISubrange(count: 8)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !181, file: !148, line: 78, baseType: !100, size: 64, offset: 320)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !181, file: !148, line: 81, baseType: !100, size: 64, offset: 384)
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !147, file: !148, line: 116, type: !181, isLocal: true, isDefinition: true)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(name: "slot0", scope: !147, file: !148, line: 842, type: !195, isLocal: true, isDefinition: true)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 2048, elements: !196)
!196 = !{!197}
!197 = !DISubrange(count: 256)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(name: "slotvec", scope: !147, file: !148, line: 845, type: !200, isLocal: true, isDefinition: true)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !148, line: 834, size: 128, elements: !202)
!202 = !{!203, !204}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !201, file: !148, line: 836, baseType: !104, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !201, file: !148, line: 837, baseType: !58, size: 64, offset: 64)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(name: "nslots", scope: !147, file: !148, line: 843, type: !49, isLocal: true, isDefinition: true)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "slotvec0", scope: !147, file: !148, line: 844, type: !201, isLocal: true, isDefinition: true)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 704, elements: !211)
!210 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !100)
!211 = !{!212}
!212 = !DISubrange(count: 11)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !215, file: !216, line: 26, type: !218, isDefinition: true)
!215 = distinct !DICompileUnit(language: DW_LANG_C99, file: !216, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !112, globals: !217, nameTableKind: None)
!216 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!217 = !{!213}
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 376, elements: !219)
!219 = !{!220}
!220 = !DISubrange(count: 47)
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(name: "rpl_re_syntax_options", scope: !223, file: !964, line: 243, type: !836, isDefinition: true)
!223 = distinct !DICompileUnit(language: DW_LANG_C99, file: !224, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !225, retainedTypes: !689, globals: !961, nameTableKind: None)
!224 = !DIFile(filename: "lib/regex.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!225 = !{!226, !239, !275, !296, !155, !682}
!226 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !227, line: 206, baseType: !6, size: 32, elements: !228)
!227 = !DIFile(filename: "./lib/regex_internal.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!228 = !{!229, !230, !231, !232, !233, !234, !235, !236, !237, !238}
!229 = !DIEnumerator(name: "INSIDE_WORD", value: 5, isUnsigned: true)
!230 = !DIEnumerator(name: "WORD_FIRST", value: 6, isUnsigned: true)
!231 = !DIEnumerator(name: "WORD_LAST", value: 9, isUnsigned: true)
!232 = !DIEnumerator(name: "INSIDE_NOTWORD", value: 10, isUnsigned: true)
!233 = !DIEnumerator(name: "LINE_FIRST", value: 16, isUnsigned: true)
!234 = !DIEnumerator(name: "LINE_LAST", value: 32, isUnsigned: true)
!235 = !DIEnumerator(name: "BUF_FIRST", value: 64, isUnsigned: true)
!236 = !DIEnumerator(name: "BUF_LAST", value: 128, isUnsigned: true)
!237 = !DIEnumerator(name: "WORD_DELIM", value: 256, isUnsigned: true)
!238 = !DIEnumerator(name: "NOT_WORD_DELIM", value: 512, isUnsigned: true)
!239 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !227, line: 227, baseType: !6, size: 32, elements: !240)
!240 = !{!241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274}
!241 = !DIEnumerator(name: "NON_TYPE", value: 0, isUnsigned: true)
!242 = !DIEnumerator(name: "CHARACTER", value: 1, isUnsigned: true)
!243 = !DIEnumerator(name: "END_OF_RE", value: 2, isUnsigned: true)
!244 = !DIEnumerator(name: "SIMPLE_BRACKET", value: 3, isUnsigned: true)
!245 = !DIEnumerator(name: "OP_BACK_REF", value: 4, isUnsigned: true)
!246 = !DIEnumerator(name: "OP_PERIOD", value: 5, isUnsigned: true)
!247 = !DIEnumerator(name: "COMPLEX_BRACKET", value: 6, isUnsigned: true)
!248 = !DIEnumerator(name: "OP_UTF8_PERIOD", value: 7, isUnsigned: true)
!249 = !DIEnumerator(name: "OP_OPEN_SUBEXP", value: 8, isUnsigned: true)
!250 = !DIEnumerator(name: "OP_CLOSE_SUBEXP", value: 9, isUnsigned: true)
!251 = !DIEnumerator(name: "OP_ALT", value: 10, isUnsigned: true)
!252 = !DIEnumerator(name: "OP_DUP_ASTERISK", value: 11, isUnsigned: true)
!253 = !DIEnumerator(name: "ANCHOR", value: 12, isUnsigned: true)
!254 = !DIEnumerator(name: "CONCAT", value: 16, isUnsigned: true)
!255 = !DIEnumerator(name: "SUBEXP", value: 17, isUnsigned: true)
!256 = !DIEnumerator(name: "OP_DUP_PLUS", value: 18, isUnsigned: true)
!257 = !DIEnumerator(name: "OP_DUP_QUESTION", value: 19, isUnsigned: true)
!258 = !DIEnumerator(name: "OP_OPEN_BRACKET", value: 20, isUnsigned: true)
!259 = !DIEnumerator(name: "OP_CLOSE_BRACKET", value: 21, isUnsigned: true)
!260 = !DIEnumerator(name: "OP_CHARSET_RANGE", value: 22, isUnsigned: true)
!261 = !DIEnumerator(name: "OP_OPEN_DUP_NUM", value: 23, isUnsigned: true)
!262 = !DIEnumerator(name: "OP_CLOSE_DUP_NUM", value: 24, isUnsigned: true)
!263 = !DIEnumerator(name: "OP_NON_MATCH_LIST", value: 25, isUnsigned: true)
!264 = !DIEnumerator(name: "OP_OPEN_COLL_ELEM", value: 26, isUnsigned: true)
!265 = !DIEnumerator(name: "OP_CLOSE_COLL_ELEM", value: 27, isUnsigned: true)
!266 = !DIEnumerator(name: "OP_OPEN_EQUIV_CLASS", value: 28, isUnsigned: true)
!267 = !DIEnumerator(name: "OP_CLOSE_EQUIV_CLASS", value: 29, isUnsigned: true)
!268 = !DIEnumerator(name: "OP_OPEN_CHAR_CLASS", value: 30, isUnsigned: true)
!269 = !DIEnumerator(name: "OP_CLOSE_CHAR_CLASS", value: 31, isUnsigned: true)
!270 = !DIEnumerator(name: "OP_WORD", value: 32, isUnsigned: true)
!271 = !DIEnumerator(name: "OP_NOTWORD", value: 33, isUnsigned: true)
!272 = !DIEnumerator(name: "OP_SPACE", value: 34, isUnsigned: true)
!273 = !DIEnumerator(name: "OP_NOTSPACE", value: 35, isUnsigned: true)
!274 = !DIEnumerator(name: "BACK_SLASH", value: 36, isUnsigned: true)
!275 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !276, line: 346, baseType: !49, size: 32, elements: !277)
!276 = !DIFile(filename: "./lib/regex.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!277 = !{!278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295}
!278 = !DIEnumerator(name: "_REG_ENOSYS", value: -1)
!279 = !DIEnumerator(name: "_REG_NOERROR", value: 0)
!280 = !DIEnumerator(name: "_REG_NOMATCH", value: 1)
!281 = !DIEnumerator(name: "_REG_BADPAT", value: 2)
!282 = !DIEnumerator(name: "_REG_ECOLLATE", value: 3)
!283 = !DIEnumerator(name: "_REG_ECTYPE", value: 4)
!284 = !DIEnumerator(name: "_REG_EESCAPE", value: 5)
!285 = !DIEnumerator(name: "_REG_ESUBREG", value: 6)
!286 = !DIEnumerator(name: "_REG_EBRACK", value: 7)
!287 = !DIEnumerator(name: "_REG_EPAREN", value: 8)
!288 = !DIEnumerator(name: "_REG_EBRACE", value: 9)
!289 = !DIEnumerator(name: "_REG_BADBR", value: 10)
!290 = !DIEnumerator(name: "_REG_ERANGE", value: 11)
!291 = !DIEnumerator(name: "_REG_ESPACE", value: 12)
!292 = !DIEnumerator(name: "_REG_BADRPT", value: 13)
!293 = !DIEnumerator(name: "_REG_EEND", value: 14)
!294 = !DIEnumerator(name: "_REG_ESIZE", value: 15)
!295 = !DIEnumerator(name: "_REG_ERPAREN", value: 16)
!296 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !297, line: 41, baseType: !6, size: 32, elements: !298)
!297 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!298 = !{!299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681}
!299 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!300 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!301 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!302 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!303 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!304 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!305 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!306 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!307 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!308 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!309 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!310 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!311 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!312 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!313 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!314 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!315 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!316 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!317 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!318 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!319 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!320 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!321 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!322 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!323 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!324 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!325 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!326 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!327 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!328 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!329 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!330 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!331 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!332 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!333 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!334 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!335 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!336 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!337 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!338 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!339 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!340 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!341 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!342 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!343 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!344 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!345 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!346 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!347 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!348 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!349 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!350 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!351 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!352 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!353 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!354 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!355 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!356 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!357 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!358 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!359 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!360 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!361 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!362 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!363 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!364 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!365 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!366 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!367 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!368 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!369 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!370 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!371 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!372 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!373 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!374 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!375 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!376 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!377 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!378 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!379 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!380 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!381 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!382 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!383 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!384 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!385 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!386 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!387 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!388 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!389 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!390 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!391 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!392 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!393 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!394 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!395 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!396 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!397 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!398 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!399 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!400 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!401 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!402 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!403 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!404 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!405 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!406 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!407 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!408 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!409 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!410 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!411 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!412 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!413 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!414 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!415 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!416 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!417 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!418 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!419 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!420 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!421 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!422 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!423 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!424 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!425 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!426 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!427 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!428 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!429 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!430 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!431 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!432 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!433 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!434 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!435 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!436 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!437 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!438 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!439 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!440 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!441 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!442 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!443 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!444 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!445 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!446 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!447 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!448 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!449 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!450 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!451 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!452 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!453 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!454 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!455 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!456 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!457 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!458 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!459 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!460 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!461 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!462 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!463 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!464 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!465 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!466 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!467 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!468 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!469 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!470 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!471 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!472 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!473 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!474 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!475 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!476 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!477 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!478 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!479 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!480 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!481 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!482 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!483 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!484 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!485 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!486 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!487 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!488 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!489 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!490 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!491 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!492 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!493 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!494 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!495 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!496 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!497 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!498 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!499 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!500 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!501 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!502 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!503 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!504 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!505 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!506 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!507 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!508 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!509 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!510 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!511 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!512 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!513 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!514 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!515 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!516 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!517 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!518 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!519 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!520 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!521 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!522 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!523 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!524 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!525 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!526 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!527 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!528 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!529 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!530 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!531 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!532 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!533 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!534 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!535 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!536 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!537 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!538 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!539 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!540 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!541 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!542 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!543 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!544 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!545 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!546 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!547 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!548 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!549 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!550 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!551 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!552 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!553 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!554 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!555 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!556 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!557 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!558 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!559 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!560 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!561 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!562 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!563 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!564 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!565 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!566 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!567 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!568 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!569 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!570 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!571 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!572 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!573 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!574 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!575 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!576 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!577 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!578 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!579 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!580 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!581 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!582 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!583 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!584 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!585 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!586 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!587 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!588 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!589 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!590 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!591 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!592 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!593 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!594 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!595 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!596 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!597 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!598 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!599 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!600 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!601 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!602 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!603 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!604 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!605 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!606 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!607 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!608 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!609 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!610 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!611 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!612 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!613 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!614 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!615 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!616 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!617 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!618 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!619 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!620 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!621 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!622 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!623 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!624 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!625 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!626 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!627 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!628 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!629 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!630 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!631 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!632 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!633 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!634 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!635 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!636 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!637 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!661 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!662 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!663 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!664 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!665 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!666 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!667 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!668 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!669 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!670 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!671 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!672 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!673 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!674 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!675 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!676 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!677 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!678 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!679 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!680 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!681 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!682 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !227, line: 699, baseType: !6, size: 32, elements: !683)
!683 = !{!684, !685, !686, !687, !688}
!684 = !DIEnumerator(name: "SB_CHAR", value: 0, isUnsigned: true)
!685 = !DIEnumerator(name: "MB_CHAR", value: 1, isUnsigned: true)
!686 = !DIEnumerator(name: "EQUIV_CLASS", value: 2, isUnsigned: true)
!687 = !DIEnumerator(name: "COLL_SYM", value: 3, isUnsigned: true)
!688 = !DIEnumerator(name: "CHAR_CLASS", value: 4, isUnsigned: true)
!689 = !{!54, !49, !58, !102, !100, !104, !690, !691, !692, !697, !706, !838, !840, !749, !715, !171, !841, !807, !709, !714, !719, !843, !752, !845, !769, !768, !865, !871, !103, !775, !872, !881, !899, !907, !954}
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitset_word_t", file: !227, line: 182, baseType: !54)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "re_dfa_t", file: !227, line: 416, baseType: !694)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_dfa_t", file: !227, line: 645, size: 1856, elements: !695)
!695 = !{!696, !746, !747, !748, !750, !751, !759, !760, !761, !789, !790, !791, !792, !793, !806, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !835, !837}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !694, file: !227, line: 647, baseType: !697, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "re_token_t", file: !227, line: 353, baseType: !699)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !227, line: 326, size: 128, elements: !700)
!700 = !{!701, !738, !740, !741, !742, !743, !744, !745}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "opr", scope: !699, file: !227, line: 337, baseType: !702, size: 64)
!702 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !699, file: !227, line: 328, size: 64, elements: !703)
!703 = !{!704, !705, !708, !735, !736}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !702, file: !227, line: 330, baseType: !103, size: 8)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "sbcset", scope: !702, file: !227, line: 331, baseType: !706, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "re_bitset_ptr_t", file: !227, line: 192, baseType: !707)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "mbcset", scope: !702, file: !227, line: 333, baseType: !709, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "re_charset_t", file: !227, line: 323, baseType: !711)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !227, line: 279, size: 640, elements: !712)
!712 = !{!713, !716, !717, !718, !722, !723, !731, !732, !733, !734}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "mbchars", scope: !711, file: !227, line: 282, baseType: !714, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !105, line: 74, baseType: !49)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "range_starts", scope: !711, file: !227, line: 299, baseType: !714, size: 64, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "range_ends", scope: !711, file: !227, line: 300, baseType: !714, size: 64, offset: 128)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "char_classes", scope: !711, file: !227, line: 304, baseType: !719, size: 64, offset: 192)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "wctype_t", file: !721, line: 38, baseType: !54)
!721 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!722 = !DIDerivedType(tag: DW_TAG_member, name: "non_match", scope: !711, file: !227, line: 307, baseType: !6, size: 1, offset: 256, flags: DIFlagBitField, extraData: i64 256)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "nmbchars", scope: !711, file: !227, line: 310, baseType: !724, size: 64, offset: 320)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "Idx", file: !227, line: 170, baseType: !725)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "regoff_t", file: !276, line: 486, baseType: !726)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !727, line: 108, baseType: !728)
!727 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !729, line: 194, baseType: !730)
!729 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!730 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "ncoll_syms", scope: !711, file: !227, line: 313, baseType: !724, size: 64, offset: 384)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "nequiv_classes", scope: !711, file: !227, line: 316, baseType: !724, size: 64, offset: 448)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "nranges", scope: !711, file: !227, line: 319, baseType: !724, size: 64, offset: 512)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "nchar_classes", scope: !711, file: !227, line: 322, baseType: !724, size: 64, offset: 576)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !702, file: !227, line: 335, baseType: !724, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_type", scope: !702, file: !227, line: 336, baseType: !737, size: 32)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "re_context_type", file: !227, line: 218, baseType: !226)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !699, file: !227, line: 339, baseType: !739, size: 8, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "re_token_type_t", file: !227, line: 276, baseType: !239)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "constraint", scope: !699, file: !227, line: 343, baseType: !6, size: 10, offset: 72, flags: DIFlagBitField, extraData: i64 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "duplicated", scope: !699, file: !227, line: 344, baseType: !6, size: 1, offset: 82, flags: DIFlagBitField, extraData: i64 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "opt_subexp", scope: !699, file: !227, line: 345, baseType: !6, size: 1, offset: 83, flags: DIFlagBitField, extraData: i64 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "accept_mb", scope: !699, file: !227, line: 347, baseType: !6, size: 1, offset: 84, flags: DIFlagBitField, extraData: i64 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "mb_partial", scope: !699, file: !227, line: 350, baseType: !6, size: 1, offset: 85, flags: DIFlagBitField, extraData: i64 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "word_char", scope: !699, file: !227, line: 352, baseType: !6, size: 1, offset: 86, flags: DIFlagBitField, extraData: i64 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "nodes_alloc", scope: !694, file: !227, line: 648, baseType: !104, size: 64, offset: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "nodes_len", scope: !694, file: !227, line: 649, baseType: !104, size: 64, offset: 128)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "nexts", scope: !694, file: !227, line: 650, baseType: !749, size: 64, offset: 192)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "org_indices", scope: !694, file: !227, line: 651, baseType: !749, size: 64, offset: 256)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "edests", scope: !694, file: !227, line: 652, baseType: !752, size: 64, offset: 320)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "re_node_set", file: !227, line: 225, baseType: !754)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !227, line: 220, size: 192, elements: !755)
!755 = !{!756, !757, !758}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !754, file: !227, line: 222, baseType: !724, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "nelem", scope: !754, file: !227, line: 223, baseType: !724, size: 64, offset: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "elems", scope: !754, file: !227, line: 224, baseType: !749, size: 64, offset: 128)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "eclosures", scope: !694, file: !227, line: 653, baseType: !752, size: 64, offset: 384)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "inveclosures", scope: !694, file: !227, line: 654, baseType: !752, size: 64, offset: 448)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "state_table", scope: !694, file: !227, line: 655, baseType: !762, size: 64, offset: 512)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_state_table_entry", file: !227, line: 549, size: 192, elements: !764)
!764 = !{!765, !766, !767}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !763, file: !227, line: 551, baseType: !724, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !763, file: !227, line: 552, baseType: !724, size: 64, offset: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !763, file: !227, line: 553, baseType: !768, size: 64, offset: 128)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "re_dfastate_t", file: !227, line: 547, baseType: !771)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_dfastate_t", file: !227, line: 529, size: 896, elements: !772)
!772 = !{!773, !776, !777, !778, !779, !780, !783, !784, !785, !786, !787, !788}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !771, file: !227, line: 531, baseType: !774, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "re_hashval_t", file: !227, line: 178, baseType: !775)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "__re_size_t", file: !276, line: 45, baseType: !104)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !771, file: !227, line: 532, baseType: !753, size: 192, offset: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "non_eps_nodes", scope: !771, file: !227, line: 533, baseType: !753, size: 192, offset: 256)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "inveclosure", scope: !771, file: !227, line: 534, baseType: !753, size: 192, offset: 448)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "entrance_nodes", scope: !771, file: !227, line: 535, baseType: !752, size: 64, offset: 640)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "trtable", scope: !771, file: !227, line: 536, baseType: !781, size: 64, offset: 704)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "word_trtable", scope: !771, file: !227, line: 536, baseType: !781, size: 64, offset: 768)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !771, file: !227, line: 537, baseType: !6, size: 4, offset: 832, flags: DIFlagBitField, extraData: i64 832)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "halt", scope: !771, file: !227, line: 538, baseType: !6, size: 1, offset: 836, flags: DIFlagBitField, extraData: i64 832)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "accept_mb", scope: !771, file: !227, line: 542, baseType: !6, size: 1, offset: 837, flags: DIFlagBitField, extraData: i64 832)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "has_backref", scope: !771, file: !227, line: 544, baseType: !6, size: 1, offset: 838, flags: DIFlagBitField, extraData: i64 832)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "has_constraint", scope: !771, file: !227, line: 545, baseType: !6, size: 1, offset: 839, flags: DIFlagBitField, extraData: i64 832)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !694, file: !227, line: 656, baseType: !769, size: 64, offset: 576)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "init_state_word", scope: !694, file: !227, line: 657, baseType: !769, size: 64, offset: 640)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "init_state_nl", scope: !694, file: !227, line: 658, baseType: !769, size: 64, offset: 704)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "init_state_begbuf", scope: !694, file: !227, line: 659, baseType: !769, size: 64, offset: 768)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "str_tree", scope: !694, file: !227, line: 660, baseType: !794, size: 64, offset: 832)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "bin_tree_t", file: !227, line: 489, baseType: !796)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_tree_t", file: !227, line: 475, size: 512, elements: !797)
!797 = !{!798, !800, !801, !802, !803, !804, !805}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !796, file: !227, line: 477, baseType: !799, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !796, file: !227, line: 478, baseType: !799, size: 64, offset: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !796, file: !227, line: 479, baseType: !799, size: 64, offset: 128)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !796, file: !227, line: 480, baseType: !799, size: 64, offset: 192)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !796, file: !227, line: 481, baseType: !799, size: 64, offset: 256)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !796, file: !227, line: 483, baseType: !698, size: 128, offset: 320)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "node_idx", scope: !796, file: !227, line: 487, baseType: !724, size: 64, offset: 448)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "str_tree_storage", scope: !694, file: !227, line: 661, baseType: !807, size: 64, offset: 896)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "bin_tree_storage_t", file: !227, line: 499, baseType: !809)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_tree_storage_t", file: !227, line: 494, size: 7744, elements: !810)
!810 = !{!811, !813}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !809, file: !227, line: 496, baseType: !812, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !809, file: !227, line: 497, baseType: !814, size: 7680, offset: 64)
!814 = !DICompositeType(tag: DW_TAG_array_type, baseType: !795, size: 7680, elements: !815)
!815 = !{!816}
!816 = !DISubrange(count: 15)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "sb_char", scope: !694, file: !227, line: 662, baseType: !706, size: 64, offset: 960)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "str_tree_storage_idx", scope: !694, file: !227, line: 663, baseType: !49, size: 32, offset: 1024)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "state_hash_mask", scope: !694, file: !227, line: 666, baseType: !774, size: 64, offset: 1088)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "init_node", scope: !694, file: !227, line: 667, baseType: !724, size: 64, offset: 1152)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "nbackref", scope: !694, file: !227, line: 668, baseType: !724, size: 64, offset: 1216)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "used_bkref_map", scope: !694, file: !227, line: 671, baseType: !690, size: 64, offset: 1280)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "completed_bkref_map", scope: !694, file: !227, line: 672, baseType: !690, size: 64, offset: 1344)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "has_plural_match", scope: !694, file: !227, line: 674, baseType: !6, size: 1, offset: 1408, flags: DIFlagBitField, extraData: i64 1408)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "has_mb_node", scope: !694, file: !227, line: 678, baseType: !6, size: 1, offset: 1409, flags: DIFlagBitField, extraData: i64 1408)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "is_utf8", scope: !694, file: !227, line: 679, baseType: !6, size: 1, offset: 1410, flags: DIFlagBitField, extraData: i64 1408)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "map_notascii", scope: !694, file: !227, line: 680, baseType: !6, size: 1, offset: 1411, flags: DIFlagBitField, extraData: i64 1408)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "word_ops_used", scope: !694, file: !227, line: 681, baseType: !6, size: 1, offset: 1412, flags: DIFlagBitField, extraData: i64 1408)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cur_max", scope: !694, file: !227, line: 682, baseType: !49, size: 32, offset: 1440)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "word_char", scope: !694, file: !227, line: 683, baseType: !831, size: 256, offset: 1472)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitset_t", file: !227, line: 191, baseType: !832)
!832 = !DICompositeType(tag: DW_TAG_array_type, baseType: !690, size: 256, elements: !833)
!833 = !{!834}
!834 = !DISubrange(count: 4)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "syntax", scope: !694, file: !227, line: 684, baseType: !836, size: 64, offset: 1728)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_syntax_t", file: !276, line: 72, baseType: !54)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "subexp_map", scope: !694, file: !227, line: 685, baseType: !749, size: 64, offset: 1792)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !842, line: 20, baseType: !6)
!842 = !DIFile(filename: "/usr/include/bits/types/wint_t.h", directory: "")
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !844, line: 90, baseType: !54)
!844 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "regex_t", file: !276, line: 478, baseType: !847)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_pattern_buffer", file: !276, line: 413, size: 512, elements: !848)
!848 = !{!849, !851, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !847, file: !276, line: 417, baseType: !850, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !847, file: !276, line: 420, baseType: !852, size: 64, offset: 64)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "__re_long_size_t", file: !276, line: 49, baseType: !104)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !847, file: !276, line: 423, baseType: !852, size: 64, offset: 128)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "syntax", scope: !847, file: !276, line: 426, baseType: !836, size: 64, offset: 192)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap", scope: !847, file: !276, line: 431, baseType: !58, size: 64, offset: 256)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "translate", scope: !847, file: !276, line: 437, baseType: !691, size: 64, offset: 320)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "re_nsub", scope: !847, file: !276, line: 440, baseType: !104, size: 64, offset: 384)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_null", scope: !847, file: !276, line: 446, baseType: !6, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "regs_allocated", scope: !847, file: !276, line: 457, baseType: !6, size: 2, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap_accurate", scope: !847, file: !276, line: 461, baseType: !6, size: 1, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "no_sub", scope: !847, file: !276, line: 465, baseType: !6, size: 1, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "not_bol", scope: !847, file: !276, line: 469, baseType: !6, size: 1, offset: 453, flags: DIFlagBitField, extraData: i64 448)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "not_eol", scope: !847, file: !276, line: 472, baseType: !6, size: 1, offset: 454, flags: DIFlagBitField, extraData: i64 448)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "newline_anchor", scope: !847, file: !276, line: 475, baseType: !6, size: 1, offset: 455, flags: DIFlagBitField, extraData: i64 448)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "regmatch_t", file: !276, line: 521, baseType: !867)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !276, line: 517, size: 128, elements: !868)
!868 = !{!869, !870}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "rm_so", scope: !867, file: !276, line: 519, baseType: !725, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "rm_eo", scope: !867, file: !276, line: 520, baseType: !725, size: 64, offset: 64)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_backref_cache_entry", file: !227, line: 588, size: 384, elements: !874)
!874 = !{!875, !876, !877, !878, !879, !880}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !873, file: !227, line: 590, baseType: !724, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "str_idx", scope: !873, file: !227, line: 591, baseType: !724, size: 64, offset: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "subexp_from", scope: !873, file: !227, line: 592, baseType: !724, size: 64, offset: 128)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "subexp_to", scope: !873, file: !227, line: 593, baseType: !724, size: 64, offset: 192)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "eps_reachable_subexps_map", scope: !873, file: !227, line: 594, baseType: !690, size: 64, offset: 256)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "more", scope: !873, file: !227, line: 595, baseType: !59, size: 8, offset: 320)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "re_sub_match_top_t", file: !227, line: 586, baseType: !884)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !227, line: 578, size: 384, elements: !885)
!885 = !{!886, !887, !888, !896, !897, !898}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "str_idx", scope: !884, file: !227, line: 580, baseType: !724, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !884, file: !227, line: 581, baseType: !724, size: 64, offset: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !884, file: !227, line: 582, baseType: !889, size: 64, offset: 128)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "state_array_t", file: !227, line: 563, baseType: !891)
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !227, line: 558, size: 192, elements: !892)
!892 = !{!893, !894, !895}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "next_idx", scope: !891, file: !227, line: 560, baseType: !724, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !891, file: !227, line: 561, baseType: !724, size: 64, offset: 64)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !891, file: !227, line: 562, baseType: !768, size: 64, offset: 128)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "alasts", scope: !884, file: !227, line: 583, baseType: !724, size: 64, offset: 192)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "nlasts", scope: !884, file: !227, line: 584, baseType: !724, size: 64, offset: 256)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "lasts", scope: !884, file: !227, line: 585, baseType: !899, size: 64, offset: 320)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "re_sub_match_last_t", file: !227, line: 572, baseType: !902)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !227, line: 567, size: 320, elements: !903)
!903 = !{!904, !905, !906}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !902, file: !227, line: 569, baseType: !724, size: 64)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "str_idx", scope: !902, file: !227, line: 570, baseType: !724, size: 64, offset: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !902, file: !227, line: 571, baseType: !890, size: 192, offset: 128)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dests_alloc", scope: !910, file: !909, line: 3271, size: 114688, elements: !949)
!909 = !DIFile(filename: "./lib/regexec.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!910 = distinct !DISubprogram(name: "build_trtable", scope: !909, file: !909, line: 3255, type: !911, scopeLine: 3256, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !223, retainedNodes: !915)
!911 = !DISubroutineType(types: !912)
!912 = !{!60, !913, !769}
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !693)
!915 = !{!916, !917, !918, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !937, !938, !939, !940, !944}
!916 = !DILocalVariable(name: "dfa", arg: 1, scope: !910, file: !909, line: 3255, type: !913)
!917 = !DILocalVariable(name: "state", arg: 2, scope: !910, file: !909, line: 3255, type: !769)
!918 = !DILocalVariable(name: "err", scope: !910, file: !909, line: 3257, type: !919)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_errcode_t", file: !276, line: 371, baseType: !275)
!920 = !DILocalVariable(name: "i", scope: !910, file: !909, line: 3258, type: !724)
!921 = !DILocalVariable(name: "j", scope: !910, file: !909, line: 3258, type: !724)
!922 = !DILocalVariable(name: "ch", scope: !910, file: !909, line: 3259, type: !49)
!923 = !DILocalVariable(name: "need_word_trtable", scope: !910, file: !909, line: 3260, type: !60)
!924 = !DILocalVariable(name: "elem", scope: !910, file: !909, line: 3261, type: !690)
!925 = !DILocalVariable(name: "mask", scope: !910, file: !909, line: 3261, type: !690)
!926 = !DILocalVariable(name: "dests_node_malloced", scope: !910, file: !909, line: 3262, type: !60)
!927 = !DILocalVariable(name: "dest_states_malloced", scope: !910, file: !909, line: 3263, type: !60)
!928 = !DILocalVariable(name: "ndests", scope: !910, file: !909, line: 3264, type: !724)
!929 = !DILocalVariable(name: "trtable", scope: !910, file: !909, line: 3265, type: !768)
!930 = !DILocalVariable(name: "dest_states", scope: !910, file: !909, line: 3266, type: !768)
!931 = !DILocalVariable(name: "dest_states_word", scope: !910, file: !909, line: 3266, type: !768)
!932 = !DILocalVariable(name: "dest_states_nl", scope: !910, file: !909, line: 3266, type: !768)
!933 = !DILocalVariable(name: "follows", scope: !910, file: !909, line: 3267, type: !753)
!934 = !DILocalVariable(name: "dests_node", scope: !910, file: !909, line: 3267, type: !752)
!935 = !DILocalVariable(name: "dests_ch", scope: !910, file: !909, line: 3268, type: !936)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!937 = !DILocalVariable(name: "acceptable", scope: !910, file: !909, line: 3269, type: !831)
!938 = !DILocalVariable(name: "dests_alloc", scope: !910, file: !909, line: 3275, type: !907)
!939 = !DILocalVariable(name: "ndests_max", scope: !910, file: !909, line: 3320, type: !104)
!940 = !DILocalVariable(name: "next_node", scope: !941, file: !909, line: 3354, type: !724)
!941 = distinct !DILexicalBlock(scope: !942, file: !909, line: 3353, column: 5)
!942 = distinct !DILexicalBlock(scope: !943, file: !909, line: 3352, column: 3)
!943 = distinct !DILexicalBlock(scope: !910, file: !909, line: 3352, column: 3)
!944 = !DILabel(scope: !945, name: "out_free", file: !909, line: 3335)
!945 = distinct !DILexicalBlock(scope: !946, file: !909, line: 3334, column: 2)
!946 = distinct !DILexicalBlock(scope: !947, file: !909, line: 3333, column: 11)
!947 = distinct !DILexicalBlock(scope: !948, file: !909, line: 3331, column: 5)
!948 = distinct !DILexicalBlock(scope: !910, file: !909, line: 3326, column: 7)
!949 = !{!950, !952}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "dests_node", scope: !908, file: !909, line: 3273, baseType: !951, size: 49152)
!951 = !DICompositeType(tag: DW_TAG_array_type, baseType: !753, size: 49152, elements: !196)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "dests_ch", scope: !908, file: !909, line: 3274, baseType: !953, size: 65536, offset: 49152)
!953 = !DICompositeType(tag: DW_TAG_array_type, baseType: !831, size: 65536, elements: !196)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_fail_stack_ent_t", file: !227, line: 630, size: 384, elements: !956)
!956 = !{!957, !958, !959, !960}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "idx", scope: !955, file: !227, line: 632, baseType: !724, size: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !955, file: !227, line: 633, baseType: !724, size: 64, offset: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "regs", scope: !955, file: !227, line: 634, baseType: !865, size: 64, offset: 128)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "eps_via_nodes", scope: !955, file: !227, line: 635, baseType: !753, size: 192, offset: 192)
!961 = !{!221, !962, !968, !974}
!962 = !DIGlobalVariableExpression(var: !963, expr: !DIExpression())
!963 = distinct !DIGlobalVariable(name: "__re_error_msgid", scope: !223, file: !964, line: 132, type: !965, isLocal: true, isDefinition: true)
!964 = !DIFile(filename: "./lib/regcomp.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!965 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 3056, elements: !966)
!966 = !{!967}
!967 = !DISubrange(count: 382)
!968 = !DIGlobalVariableExpression(var: !969, expr: !DIExpression())
!969 = distinct !DIGlobalVariable(name: "__re_error_msgid_idx", scope: !223, file: !964, line: 186, type: !970, isLocal: true, isDefinition: true)
!970 = !DICompositeType(tag: DW_TAG_array_type, baseType: !971, size: 1088, elements: !972)
!971 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !104)
!972 = !{!973}
!973 = !DISubrange(count: 17)
!974 = !DIGlobalVariableExpression(var: !975, expr: !DIExpression())
!975 = distinct !DIGlobalVariable(name: "utf8_sb_map", scope: !223, file: !964, line: 558, type: !976, isLocal: true, isDefinition: true)
!976 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !831)
!977 = !DIGlobalVariableExpression(var: !978, expr: !DIExpression())
!978 = distinct !DIGlobalVariable(name: "is_basic_table", scope: !979, file: !980, line: 28, type: !983, isDefinition: true)
!979 = distinct !DICompileUnit(language: DW_LANG_C99, file: !980, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !112, retainedTypes: !981, globals: !982, nameTableKind: None)
!980 = !DIFile(filename: "lib/mbchar.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!981 = !{!103}
!982 = !{!977}
!983 = !DICompositeType(tag: DW_TAG_array_type, baseType: !984, size: 256, elements: !187)
!984 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!985 = distinct !DICompileUnit(language: DW_LANG_C99, file: !986, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !112, retainedTypes: !987, nameTableKind: None)
!986 = !DIFile(filename: "lib/mbschr.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!987 = !{!103, !58, !104}
!988 = distinct !DICompileUnit(language: DW_LANG_C99, file: !989, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !112, retainedTypes: !990, nameTableKind: None)
!989 = !DIFile(filename: "lib/mbslen.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!990 = !{!104, !103}
!991 = distinct !DICompileUnit(language: DW_LANG_C99, file: !992, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !112, retainedTypes: !990, nameTableKind: None)
!992 = !DIFile(filename: "lib/mbuiter.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!993 = distinct !DICompileUnit(language: DW_LANG_C99, file: !994, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !112, retainedTypes: !995, nameTableKind: None)
!994 = !DIFile(filename: "lib/strnlen1.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!995 = !{!100, !102}
!996 = distinct !DICompileUnit(language: DW_LANG_C99, file: !997, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !112, retainedTypes: !998, nameTableKind: None)
!997 = !DIFile(filename: "lib/strintcmp.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!998 = !{!6}
!999 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1000, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !1001, retainedTypes: !1005, nameTableKind: None)
!1000 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1001 = !{!1002}
!1002 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1000, line: 40, baseType: !6, size: 32, elements: !1003)
!1003 = !{!1004}
!1004 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!1005 = !{!102}
!1006 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1007, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !1008, retainedTypes: !1022, nameTableKind: None)
!1007 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1008 = !{!1009}
!1009 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1011, file: !1010, line: 186, baseType: !6, size: 32, elements: !1020)
!1010 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1011 = distinct !DISubprogram(name: "x2nrealloc", scope: !1010, file: !1010, line: 174, type: !1012, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1006, retainedNodes: !1015)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!102, !102, !1014, !104}
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!1015 = !{!1016, !1017, !1018, !1019}
!1016 = !DILocalVariable(name: "p", arg: 1, scope: !1011, file: !1010, line: 174, type: !102)
!1017 = !DILocalVariable(name: "pn", arg: 2, scope: !1011, file: !1010, line: 174, type: !1014)
!1018 = !DILocalVariable(name: "s", arg: 3, scope: !1011, file: !1010, line: 174, type: !104)
!1019 = !DILocalVariable(name: "n", scope: !1011, file: !1010, line: 176, type: !104)
!1020 = !{!1021}
!1021 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!1022 = !{!104, !58, !102}
!1023 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1024, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !112, nameTableKind: None)
!1024 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1025 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1026, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !112, retainedTypes: !1005, nameTableKind: None)
!1026 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1027 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1028, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !112, retainedTypes: !1029, nameTableKind: None)
!1028 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1029 = !{!104}
!1030 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1031, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !112, nameTableKind: None)
!1031 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1032 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1033, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !112, nameTableKind: None)
!1033 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1034 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1035, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !1036, retainedTypes: !1005, nameTableKind: None)
!1035 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1036 = !{!296}
!1037 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1038, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !112, retainedTypes: !1005, nameTableKind: None)
!1038 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1039 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1040, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !112, nameTableKind: None)
!1040 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1041 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1042, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !112, retainedTypes: !1005, nameTableKind: None)
!1042 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1043 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1044, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !112, retainedTypes: !1005, nameTableKind: None)
!1044 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1045 = !{!"clang version 12.0.1"}
!1046 = !{i32 7, !"Dwarf Version", i32 4}
!1047 = !{i32 2, !"Debug Info Version", i32 3}
!1048 = !{i32 1, !"wchar_size", i32 4}
!1049 = !{i32 7, !"PIC Level", i32 2}
!1050 = !{i32 7, !"PIE Level", i32 2}
!1051 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 339, type: !1052, scopeLine: 340, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1054)
!1052 = !DISubroutineType(types: !1053)
!1053 = !{null, !49}
!1054 = !{!1055}
!1055 = !DILocalVariable(name: "status", arg: 1, scope: !1051, file: !3, line: 339, type: !49)
!1056 = !DILocation(scope: !1051)
!1057 = !DILocation(line: 341, column: 14, scope: !1058)
!1058 = distinct !DILexicalBlock(scope: !1051, file: !3, line: 341, column: 7)
!1059 = !DILocation(line: 341, column: 7, scope: !1051)
!1060 = !DILocation(line: 342, column: 5, scope: !1061)
!1061 = distinct !DILexicalBlock(scope: !1058, file: !3, line: 342, column: 5)
