; ModuleID = 'coreutils-8.32/src/factor.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.primes_dtab = type { i64, i64 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.tokenbuffer = type { i64, i8* }
%struct.factors = type { [2 x i64], [26 x i64], [26 x i8], i8 }
%struct.__mpz_struct = type { i32, i32, i64* }
%struct.mp_factors = type { [1 x %struct.__mpz_struct]*, i64*, i64 }
%struct.mbuiter_multi = type { i8, %struct.__mbstate_t, i8, %struct.mbchar }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.mbchar = type { i8*, i64, i8, i32, [24 x i8] }
%struct.mbiter_multi = type { i8*, i8, %struct.__mbstate_t, i8, %struct.mbchar }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%union.anon.40 = type { i32, [4092 x i8] }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 64))
!1 = distinct !DIGlobalVariable(name: "lbuf", scope: !2, file: !3, line: 2360, type: !233, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !14, globals: !185, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/factor.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !6, line: 25, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "LONGINT_OK", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "LONGINT_INVALID", value: 4, isUnsigned: true)
!14 = !{!15, !25, !86, !90, !94, !97, !100, !107, !122, !19, !76, !126, !130, !134, !140, !144, !153, !78, !156, !159, !163, !7, !166, !169, !171, !175, !179, !54, !181, !184}
!15 = !DISubprogram(name: "dcgettext", scope: !16, file: !16, line: 51, type: !17, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !24)
!16 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!17 = !DISubroutineType(types: !18)
!18 = !{!19, !21, !21, !23}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !{}
!25 = !DISubprogram(name: "fputs_unlocked", scope: !26, file: !26, line: 662, type: !27, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !24)
!26 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!27 = !DISubroutineType(types: !28)
!28 = !{!23, !21, !29}
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !31, line: 49, size: 1728, elements: !32)
!31 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!32 = !{!33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !48, !49, !50, !51, !55, !57, !59, !63, !66, !68, !71, !74, !75, !77, !81, !82}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !30, file: !31, line: 51, baseType: !23, size: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !30, file: !31, line: 54, baseType: !19, size: 64, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !30, file: !31, line: 55, baseType: !19, size: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !30, file: !31, line: 56, baseType: !19, size: 64, offset: 192)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !30, file: !31, line: 57, baseType: !19, size: 64, offset: 256)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !30, file: !31, line: 58, baseType: !19, size: 64, offset: 320)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !30, file: !31, line: 59, baseType: !19, size: 64, offset: 384)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !30, file: !31, line: 60, baseType: !19, size: 64, offset: 448)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !30, file: !31, line: 61, baseType: !19, size: 64, offset: 512)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !30, file: !31, line: 64, baseType: !19, size: 64, offset: 576)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !30, file: !31, line: 65, baseType: !19, size: 64, offset: 640)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !30, file: !31, line: 66, baseType: !19, size: 64, offset: 704)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !30, file: !31, line: 68, baseType: !46, size: 64, offset: 768)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !31, line: 36, flags: DIFlagFwdDecl)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !30, file: !31, line: 70, baseType: !29, size: 64, offset: 832)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !30, file: !31, line: 72, baseType: !23, size: 32, offset: 896)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !30, file: !31, line: 73, baseType: !23, size: 32, offset: 928)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !30, file: !31, line: 74, baseType: !52, size: 64, offset: 960)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !53, line: 152, baseType: !54)
!53 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!54 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !30, file: !31, line: 77, baseType: !56, size: 16, offset: 1024)
!56 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !30, file: !31, line: 78, baseType: !58, size: 8, offset: 1040)
!58 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !30, file: !31, line: 79, baseType: !60, size: 8, offset: 1048)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 8, elements: !61)
!61 = !{!62}
!62 = !DISubrange(count: 1)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !30, file: !31, line: 81, baseType: !64, size: 64, offset: 1088)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !31, line: 43, baseType: null)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !30, file: !31, line: 89, baseType: !67, size: 64, offset: 1152)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !53, line: 153, baseType: !54)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !30, file: !31, line: 91, baseType: !69, size: 64, offset: 1216)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !31, line: 37, flags: DIFlagFwdDecl)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !30, file: !31, line: 92, baseType: !72, size: 64, offset: 1280)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !31, line: 38, flags: DIFlagFwdDecl)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !30, file: !31, line: 93, baseType: !29, size: 64, offset: 1344)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !30, file: !31, line: 94, baseType: !76, size: 64, offset: 1408)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !30, file: !31, line: 95, baseType: !78, size: 64, offset: 1472)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !79, line: 46, baseType: !80)
!79 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!80 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !30, file: !31, line: 96, baseType: !23, size: 32, offset: 1536)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !30, file: !31, line: 98, baseType: !83, size: 160, offset: 1568)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 160, elements: !84)
!84 = !{!85}
!85 = !DISubrange(count: 20)
!86 = !DISubprogram(name: "set_program_name", scope: !87, file: !87, line: 37, type: !88, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !24)
!87 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!88 = !DISubroutineType(types: !89)
!89 = !{null, !21}
!90 = !DISubprogram(name: "setlocale", scope: !91, file: !91, line: 122, type: !92, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !24)
!91 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!92 = !DISubroutineType(types: !93)
!93 = !{!19, !23, !21}
!94 = !DISubprogram(name: "bindtextdomain", scope: !16, file: !16, line: 86, type: !95, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !24)
!95 = !DISubroutineType(types: !96)
!96 = !{!19, !21, !21}
!97 = !DISubprogram(name: "textdomain", scope: !16, file: !16, line: 82, type: !98, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !24)
!98 = !DISubroutineType(types: !99)
!99 = !{!19, !21}
!100 = !DISubprogram(name: "atexit", scope: !101, file: !101, line: 595, type: !102, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !24)
!101 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!102 = !DISubroutineType(types: !103)
!103 = !{!23, !104}
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{null}
!107 = !DISubprogram(name: "getopt_long", scope: !108, file: !108, line: 66, type: !109, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !24)
!108 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!109 = !DISubroutineType(types: !110)
!110 = !{!23, !23, !111, !21, !113, !120}
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !115)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !108, line: 50, size: 256, elements: !116)
!116 = !{!117, !118, !119, !121}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !115, file: !108, line: 52, baseType: !21, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !115, file: !108, line: 55, baseType: !23, size: 32, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !115, file: !108, line: 56, baseType: !120, size: 64, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !115, file: !108, line: 57, baseType: !23, size: 32, offset: 192)
!122 = !DISubprogram(name: "proper_name_utf8", scope: !123, file: !123, line: 98, type: !124, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !24)
!123 = !DIFile(filename: "./lib/propername.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!124 = !DISubroutineType(types: !125)
!125 = !{!21, !21, !21}
!126 = !DISubprogram(name: "version_etc", scope: !127, file: !127, line: 69, type: !128, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !24)
!127 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!128 = !DISubroutineType(types: !129)
!129 = !{null, !29, !21, !21, !21, null}
!130 = !DISubprogram(name: "xmalloc", scope: !131, file: !131, line: 53, type: !132, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !24)
!131 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!132 = !DISubroutineType(types: !133)
!133 = !{!76, !80}
!134 = !DISubprogram(name: "full_write", scope: !135, file: !135, line: 29, type: !136, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !24)
!135 = !DIFile(filename: "./lib/full-write.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!136 = !DISubroutineType(types: !137)
!137 = !{!80, !23, !138, !80}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!140 = !DISubprogram(name: "error", scope: !141, file: !141, line: 52, type: !142, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !24)
!141 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!142 = !DISubroutineType(types: !143)
!143 = !{null, !23, !23, !21, null}
!144 = !DISubprogram(name: "init_tokenbuffer", scope: !145, file: !145, line: 33, type: !146, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !24)
!145 = !DIFile(filename: "./lib/readtokens.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!146 = !DISubroutineType(types: !147)
!147 = !{null, !148}
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tokenbuffer", file: !145, line: 26, size: 128, elements: !150)
!150 = !{!151, !152}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !149, file: !145, line: 28, baseType: !78, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !149, file: !145, line: 29, baseType: !19, size: 64, offset: 64)
!153 = !DISubprogram(name: "readtoken", scope: !145, file: !145, line: 36, type: !154, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !24)
!154 = !DISubroutineType(types: !155)
!155 = !{!80, !29, !21, !80, !148}
!156 = !DISubprogram(name: "free", scope: !101, file: !101, line: 565, type: !157, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !24)
!157 = !DISubroutineType(types: !158)
!158 = !{null, !76}
!159 = !DISubprogram(name: "quote", scope: !160, file: !160, line: 44, type: !161, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !24)
!160 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!161 = !DISubroutineType(types: !162)
!162 = !{!21, !21}
!163 = !DISubprogram(name: "fflush_unlocked", scope: !26, file: !26, line: 227, type: !164, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !24)
!164 = !DISubroutineType(types: !165)
!165 = !{!23, !29}
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !167, line: 102, baseType: !168)
!167 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !53, line: 73, baseType: !80)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "UDItype", file: !3, line: 174, baseType: !170)
!170 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!171 = !DISubprogram(name: "umaxtostr", scope: !172, file: !172, line: 46, type: !173, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !24)
!172 = !DIFile(filename: "./lib/inttostr.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!173 = !DISubroutineType(types: !174)
!174 = !{!19, !80, !19}
!175 = !DISubprogram(name: "isatty", scope: !176, file: !176, line: 779, type: !177, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !24)
!176 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!177 = !DISubroutineType(types: !178)
!178 = !{!23, !23}
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !167, line: 101, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !53, line: 72, baseType: !54)
!181 = !DISubprogram(name: "xrealloc", scope: !131, file: !131, line: 59, type: !182, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !24)
!182 = !DISubroutineType(types: !183)
!183 = !{!76, !76, !80}
!184 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!185 = !{!186, !187, !192, !195, !210, !220, !224, !226, !231}
!186 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 233, type: !189, isLocal: true, isDefinition: true)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 1024, elements: !190)
!190 = !{!191}
!191 = !DISubrange(count: 4)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(name: "dev_debug", scope: !2, file: !3, line: 707, type: !194, isLocal: true, isDefinition: true)
!194 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "line_buffered", scope: !197, file: !3, line: 2404, type: !23, isLocal: true, isDefinition: true)
!197 = distinct !DISubprogram(name: "lbuf_putc", scope: !3, file: !3, line: 2395, type: !198, scopeLine: 2396, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !200)
!198 = !DISubroutineType(types: !199)
!199 = !{null, !20}
!200 = !{!201, !202, !205, !209}
!201 = !DILocalVariable(name: "c", arg: 1, scope: !197, file: !3, line: 2395, type: !20)
!202 = !DILocalVariable(name: "buffered", scope: !203, file: !3, line: 2401, type: !78)
!203 = distinct !DILexicalBlock(scope: !204, file: !3, line: 2400, column: 5)
!204 = distinct !DILexicalBlock(scope: !197, file: !3, line: 2399, column: 7)
!205 = !DILocalVariable(name: "tend", scope: !206, file: !3, line: 2413, type: !21)
!206 = distinct !DILexicalBlock(scope: !207, file: !3, line: 2410, column: 9)
!207 = distinct !DILexicalBlock(scope: !208, file: !3, line: 2409, column: 16)
!208 = distinct !DILexicalBlock(scope: !203, file: !3, line: 2407, column: 11)
!209 = !DILocalVariable(name: "tlend", scope: !206, file: !3, line: 2417, type: !19)
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(name: "primes_dtab", scope: !2, file: !3, line: 695, type: !212, isLocal: true, isDefinition: true)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !213, size: 86400, elements: !218)
!213 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !214)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "primes_dtab", file: !3, line: 689, size: 128, elements: !215)
!215 = !{!216, !217}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "binv", scope: !214, file: !3, line: 691, baseType: !166, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "lim", scope: !214, file: !3, line: 691, baseType: !166, size: 64, offset: 64)
!218 = !{!219}
!219 = !DISubrange(count: 675)
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(name: "primes_diff", scope: !2, file: !3, line: 673, type: !222, isLocal: true, isDefinition: true)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 5400, elements: !218)
!223 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !184)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(name: "primes_diff8", scope: !2, file: !3, line: 683, type: !222, isLocal: true, isDefinition: true)
!226 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!227 = distinct !DIGlobalVariable(name: "binvert_table", scope: !2, file: !3, line: 878, type: !228, isLocal: true, isDefinition: true)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 1024, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 128)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(name: "flag_prove_primality", scope: !2, file: !3, line: 710, type: !194, isLocal: true, isDefinition: true)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lbuf_", file: !3, line: 2356, size: 128, elements: !234)
!234 = !{!235, !236}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !233, file: !3, line: 2358, baseType: !19, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !233, file: !3, line: 2359, baseType: !19, size: 64, offset: 64)
!237 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression(DW_OP_LLVM_fragment, 64, 64))
!238 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(name: "Version", scope: !241, file: !242, line: 2, type: !21, isLocal: false, isDefinition: true)
!241 = distinct !DICompileUnit(language: DW_LANG_C99, file: !242, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !24, globals: !243, splitDebugInlining: false, nameTableKind: None)
!242 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!243 = !{!239}
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(name: "file_name", scope: !246, file: !247, line: 46, type: !21, isLocal: true, isDefinition: true)
!246 = distinct !DICompileUnit(language: DW_LANG_C99, file: !247, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !24, retainedTypes: !248, globals: !287, splitDebugInlining: false, nameTableKind: None)
!247 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!248 = !{!249, !15, !285, !140}
!249 = !DISubprogram(name: "close_stream", scope: !250, file: !250, line: 2, type: !251, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !24)
!250 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!251 = !DISubroutineType(types: !252)
!252 = !{!23, !253}
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !31, line: 49, size: 1728, elements: !255)
!255 = !{!256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !254, file: !31, line: 51, baseType: !23, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !254, file: !31, line: 54, baseType: !19, size: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !254, file: !31, line: 55, baseType: !19, size: 64, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !254, file: !31, line: 56, baseType: !19, size: 64, offset: 192)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !254, file: !31, line: 57, baseType: !19, size: 64, offset: 256)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !254, file: !31, line: 58, baseType: !19, size: 64, offset: 320)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !254, file: !31, line: 59, baseType: !19, size: 64, offset: 384)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !254, file: !31, line: 60, baseType: !19, size: 64, offset: 448)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !254, file: !31, line: 61, baseType: !19, size: 64, offset: 512)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !254, file: !31, line: 64, baseType: !19, size: 64, offset: 576)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !254, file: !31, line: 65, baseType: !19, size: 64, offset: 640)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !254, file: !31, line: 66, baseType: !19, size: 64, offset: 704)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !254, file: !31, line: 68, baseType: !46, size: 64, offset: 768)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !254, file: !31, line: 70, baseType: !253, size: 64, offset: 832)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !254, file: !31, line: 72, baseType: !23, size: 32, offset: 896)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !254, file: !31, line: 73, baseType: !23, size: 32, offset: 928)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !254, file: !31, line: 74, baseType: !52, size: 64, offset: 960)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !254, file: !31, line: 77, baseType: !56, size: 16, offset: 1024)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !254, file: !31, line: 78, baseType: !58, size: 8, offset: 1040)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !254, file: !31, line: 79, baseType: !60, size: 8, offset: 1048)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !254, file: !31, line: 81, baseType: !64, size: 64, offset: 1088)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !254, file: !31, line: 89, baseType: !67, size: 64, offset: 1152)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !254, file: !31, line: 91, baseType: !69, size: 64, offset: 1216)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !254, file: !31, line: 92, baseType: !72, size: 64, offset: 1280)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !254, file: !31, line: 93, baseType: !253, size: 64, offset: 1344)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !254, file: !31, line: 94, baseType: !76, size: 64, offset: 1408)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !254, file: !31, line: 95, baseType: !78, size: 64, offset: 1472)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !254, file: !31, line: 96, baseType: !23, size: 32, offset: 1536)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !254, file: !31, line: 98, baseType: !83, size: 160, offset: 1568)
!285 = !DISubprogram(name: "quotearg_colon", scope: !286, file: !286, line: 391, type: !98, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !24)
!286 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!287 = !{!244, !288}
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !246, file: !247, line: 56, type: !194, isLocal: true, isDefinition: true)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "exit_failure", scope: !292, file: !293, line: 24, type: !295, isLocal: false, isDefinition: true)
!292 = distinct !DICompileUnit(language: DW_LANG_C99, file: !293, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !24, globals: !294, splitDebugInlining: false, nameTableKind: None)
!293 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!294 = !{!290}
!295 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !23)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "program_name", scope: !298, file: !299, line: 33, type: !21, isLocal: false, isDefinition: true)
!298 = distinct !DICompileUnit(language: DW_LANG_C99, file: !299, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !24, retainedTypes: !300, globals: !336, splitDebugInlining: false, nameTableKind: None)
!299 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!300 = !{!76, !301, !19}
!301 = !DISubprogram(name: "fputs", scope: !26, file: !26, line: 626, type: !302, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !24)
!302 = !DISubroutineType(types: !303)
!303 = !{!23, !21, !304}
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !31, line: 49, size: 1728, elements: !306)
!306 = !{!307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !305, file: !31, line: 51, baseType: !23, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !305, file: !31, line: 54, baseType: !19, size: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !305, file: !31, line: 55, baseType: !19, size: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !305, file: !31, line: 56, baseType: !19, size: 64, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !305, file: !31, line: 57, baseType: !19, size: 64, offset: 256)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !305, file: !31, line: 58, baseType: !19, size: 64, offset: 320)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !305, file: !31, line: 59, baseType: !19, size: 64, offset: 384)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !305, file: !31, line: 60, baseType: !19, size: 64, offset: 448)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !305, file: !31, line: 61, baseType: !19, size: 64, offset: 512)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !305, file: !31, line: 64, baseType: !19, size: 64, offset: 576)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !305, file: !31, line: 65, baseType: !19, size: 64, offset: 640)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !305, file: !31, line: 66, baseType: !19, size: 64, offset: 704)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !305, file: !31, line: 68, baseType: !46, size: 64, offset: 768)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !305, file: !31, line: 70, baseType: !304, size: 64, offset: 832)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !305, file: !31, line: 72, baseType: !23, size: 32, offset: 896)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !305, file: !31, line: 73, baseType: !23, size: 32, offset: 928)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !305, file: !31, line: 74, baseType: !52, size: 64, offset: 960)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !305, file: !31, line: 77, baseType: !56, size: 16, offset: 1024)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !305, file: !31, line: 78, baseType: !58, size: 8, offset: 1040)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !305, file: !31, line: 79, baseType: !60, size: 8, offset: 1048)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !305, file: !31, line: 81, baseType: !64, size: 64, offset: 1088)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !305, file: !31, line: 89, baseType: !67, size: 64, offset: 1152)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !305, file: !31, line: 91, baseType: !69, size: 64, offset: 1216)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !305, file: !31, line: 92, baseType: !72, size: 64, offset: 1280)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !305, file: !31, line: 93, baseType: !304, size: 64, offset: 1344)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !305, file: !31, line: 94, baseType: !76, size: 64, offset: 1408)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !305, file: !31, line: 95, baseType: !78, size: 64, offset: 1472)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !305, file: !31, line: 96, baseType: !23, size: 32, offset: 1536)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !305, file: !31, line: 98, baseType: !83, size: 160, offset: 1568)
!336 = !{!296}
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !339, file: !340, line: 85, type: !459, isLocal: false, isDefinition: true)
!339 = distinct !DICompileUnit(language: DW_LANG_C99, file: !340, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !341, retainedTypes: !375, globals: !432, splitDebugInlining: false, nameTableKind: None)
!340 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!341 = !{!342, !355, !360}
!342 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !286, line: 32, baseType: !7, size: 32, elements: !343)
!343 = !{!344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354}
!344 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!345 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!346 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!347 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!348 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!349 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!350 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!351 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!352 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!353 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!354 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!355 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !286, line: 242, baseType: !7, size: 32, elements: !356)
!356 = !{!357, !358, !359}
!357 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!358 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!359 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!360 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !361, line: 46, baseType: !7, size: 32, elements: !362)
!361 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!362 = !{!363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374}
!363 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!364 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!365 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!366 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!367 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!368 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!369 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!370 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!371 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!372 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!373 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!374 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!375 = !{!376, !379, !156, !395, !23, !56, !398, !78, !413, !417, !15, !423, !427, !19, !130, !431, !181}
!376 = !DISubprogram(name: "xmemdup", scope: !131, file: !131, line: 62, type: !377, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !24)
!377 = !DISubroutineType(types: !378)
!378 = !{!76, !138, !80}
!379 = !DISubprogram(name: "quotearg_alloc_mem", scope: !286, file: !286, line: 342, type: !380, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !24)
!380 = !DISubroutineType(types: !381)
!381 = !{!19, !21, !80, !382, !383}
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !385)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !340, line: 65, size: 448, elements: !386)
!386 = !{!387, !388, !389, !393, !394}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !385, file: !340, line: 68, baseType: !342, size: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !385, file: !340, line: 71, baseType: !23, size: 32, offset: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !385, file: !340, line: 75, baseType: !390, size: 256, offset: 64)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !391)
!391 = !{!392}
!392 = !DISubrange(count: 8)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !385, file: !340, line: 78, baseType: !21, size: 64, offset: 320)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !385, file: !340, line: 81, baseType: !21, size: 64, offset: 384)
!395 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !286, file: !286, line: 408, type: !396, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !24)
!396 = !DISubroutineType(types: !397)
!397 = !{!19, !23, !21, !21, !21, !80}
!398 = !DISubprogram(name: "rpl_mbrtowc", scope: !399, file: !399, line: 717, type: !400, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !24)
!399 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!400 = !DISubroutineType(types: !401)
!401 = !{!80, !120, !21, !80, !402}
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !404, line: 13, size: 64, elements: !405)
!404 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!405 = !{!406, !407}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !403, file: !404, line: 15, baseType: !23, size: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !403, file: !404, line: 20, baseType: !408, size: 32, offset: 32)
!408 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !403, file: !404, line: 16, size: 32, elements: !409)
!409 = !{!410, !411}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !408, file: !404, line: 18, baseType: !7, size: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !408, file: !404, line: 19, baseType: !412, size: 32)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 32, elements: !190)
!413 = !DISubprogram(name: "iswprint", scope: !414, file: !414, line: 120, type: !415, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !24)
!414 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!415 = !DISubroutineType(types: !416)
!416 = !{!23, !7}
!417 = !DISubprogram(name: "mbsinit", scope: !418, file: !418, line: 292, type: !419, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !24)
!418 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!419 = !DISubroutineType(types: !420)
!420 = !{!23, !421}
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !403)
!423 = !DISubprogram(name: "locale_charset", scope: !424, file: !424, line: 35, type: !425, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !24)
!424 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!425 = !DISubroutineType(types: !426)
!426 = !{!21}
!427 = !DISubprogram(name: "c_strcasecmp", scope: !428, file: !428, line: 42, type: !429, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !24)
!428 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!429 = !DISubroutineType(types: !430)
!430 = !{!23, !21, !21}
!431 = !DISubprogram(name: "xalloc_die", scope: !131, file: !131, line: 51, type: !105, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !24)
!432 = !{!337, !433, !439, !441, !443, !448, !455, !457}
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !339, file: !340, line: 101, type: !435, isLocal: false, isDefinition: true)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !436, size: 320, elements: !437)
!436 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !342)
!437 = !{!438}
!438 = !DISubrange(count: 10)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !339, file: !340, line: 1052, type: !385, isLocal: false, isDefinition: true)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !339, file: !340, line: 116, type: !385, isLocal: true, isDefinition: true)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(name: "slot0", scope: !339, file: !340, line: 842, type: !445, isLocal: true, isDefinition: true)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 2048, elements: !446)
!446 = !{!447}
!447 = !DISubrange(count: 256)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "slotvec", scope: !339, file: !340, line: 845, type: !450, isLocal: true, isDefinition: true)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !340, line: 834, size: 128, elements: !452)
!452 = !{!453, !454}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !451, file: !340, line: 836, baseType: !78, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !451, file: !340, line: 837, baseType: !19, size: 64, offset: 64)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(name: "nslots", scope: !339, file: !340, line: 843, type: !23, isLocal: true, isDefinition: true)
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(name: "slotvec0", scope: !339, file: !340, line: 844, type: !451, isLocal: true, isDefinition: true)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 704, elements: !461)
!460 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!461 = !{!462}
!462 = !DISubrange(count: 11)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !465, file: !466, line: 26, type: !468, isLocal: false, isDefinition: true)
!465 = distinct !DICompileUnit(language: DW_LANG_C99, file: !466, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !24, globals: !467, splitDebugInlining: false, nameTableKind: None)
!466 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!467 = !{!463}
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 376, elements: !469)
!469 = !{!470}
!470 = !DISubrange(count: 47)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(name: "is_basic_table", scope: !473, file: !474, line: 28, type: !479, isLocal: false, isDefinition: true)
!473 = distinct !DICompileUnit(language: DW_LANG_C99, file: !474, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !24, retainedTypes: !475, globals: !478, splitDebugInlining: false, nameTableKind: None)
!474 = !DIFile(filename: "lib/mbchar.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!475 = !{!476, !477, !184}
!476 = !DISubprogram(name: "wcwidth", scope: !418, file: !418, line: 367, type: !177, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !24)
!477 = !DISubprogram(name: "iswcntrl", scope: !414, file: !414, line: 104, type: !415, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !24)
!478 = !{!471}
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !480, size: 256, elements: !391)
!480 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!481 = distinct !DICompileUnit(language: DW_LANG_C99, file: !482, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !24, retainedTypes: !483, splitDebugInlining: false, nameTableKind: None)
!482 = !DIFile(filename: "lib/full-write.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!483 = !{!21, !484, !78}
!484 = !DISubprogram(name: "safe_write", scope: !485, file: !485, line: 37, type: !136, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !24)
!485 = !DIFile(filename: "./lib/safe-write.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!486 = distinct !DICompileUnit(language: DW_LANG_C99, file: !487, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !24, retainedTypes: !488, splitDebugInlining: false, nameTableKind: None)
!487 = !DIFile(filename: "lib/umaxtostr.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!488 = !{!166}
!489 = distinct !DICompileUnit(language: DW_LANG_C99, file: !490, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !491, retainedTypes: !492, splitDebugInlining: false, nameTableKind: None)
!490 = !DIFile(filename: "lib/propername.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!491 = !{!360}
!492 = !{!15, !19, !130, !423, !427, !493, !156, !76, !497, !501, !503, !23, !184, !56, !504, !517, !521, !78}
!493 = !DISubprogram(name: "xstr_iconv", scope: !494, file: !494, line: 69, type: !495, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !24)
!494 = !DIFile(filename: "./lib/xstriconv.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!495 = !DISubroutineType(types: !496)
!496 = !{!19, !21, !21, !21}
!497 = !DISubprogram(name: "trim2", scope: !498, file: !498, line: 33, type: !499, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !24)
!498 = !DIFile(filename: "./lib/trim.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!499 = !DISubroutineType(types: !500)
!500 = !{!19, !21, !23}
!501 = !DISubprogram(name: "mbsstr", scope: !502, file: !502, line: 1306, type: !95, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !24)
!502 = !DIFile(filename: "./lib/string.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!503 = !DISubprogram(name: "iswalnum", scope: !414, file: !414, line: 95, type: !415, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !24)
!504 = !DISubprogram(name: "mbsinit", scope: !418, file: !418, line: 292, type: !505, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !24)
!505 = !DISubroutineType(types: !506)
!506 = !{!23, !507}
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !509)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !404, line: 13, size: 64, elements: !510)
!510 = !{!511, !512}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !509, file: !404, line: 15, baseType: !23, size: 32)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !509, file: !404, line: 20, baseType: !513, size: 32, offset: 32)
!513 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !509, file: !404, line: 16, size: 32, elements: !514)
!514 = !{!515, !516}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !513, file: !404, line: 18, baseType: !7, size: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !513, file: !404, line: 19, baseType: !412, size: 32)
!517 = !DISubprogram(name: "strnlen1", scope: !518, file: !518, line: 31, type: !519, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !24)
!518 = !DIFile(filename: "./lib/strnlen1.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!519 = !DISubroutineType(types: !520)
!520 = !{!80, !21, !80}
!521 = !DISubprogram(name: "rpl_mbrtowc", scope: !399, file: !399, line: 717, type: !522, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !24)
!522 = !DISubroutineType(types: !523)
!523 = !{!80, !120, !21, !80, !524}
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!525 = distinct !DICompileUnit(language: DW_LANG_C99, file: !526, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !527, retainedTypes: !543, splitDebugInlining: false, nameTableKind: None)
!526 = !DIFile(filename: "lib/readtokens.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!527 = !{!528, !531}
!528 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !526, line: 51, baseType: !7, size: 32, elements: !529)
!529 = !{!530}
!530 = !DIEnumerator(name: "bits_per_word", value: 64, isUnsigned: true)
!531 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !532, file: !131, line: 186, baseType: !7, size: 32, elements: !541)
!532 = distinct !DISubprogram(name: "x2nrealloc", scope: !131, file: !131, line: 174, type: !533, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !525, retainedNodes: !536)
!533 = !DISubroutineType(types: !534)
!534 = !{!76, !76, !535, !78}
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!536 = !{!537, !538, !539, !540}
!537 = !DILocalVariable(name: "p", arg: 1, scope: !532, file: !131, line: 174, type: !76)
!538 = !DILocalVariable(name: "pn", arg: 2, scope: !532, file: !131, line: 174, type: !535)
!539 = !DILocalVariable(name: "s", arg: 3, scope: !532, file: !131, line: 174, type: !78)
!540 = !DILocalVariable(name: "n", scope: !532, file: !131, line: 176, type: !78)
!541 = !{!542}
!542 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!543 = !{!78, !156, !76, !544, !431, !181, !130}
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!545 = distinct !DICompileUnit(language: DW_LANG_C99, file: !546, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !547, retainedTypes: !552, splitDebugInlining: false, nameTableKind: None)
!546 = !DIFile(filename: "lib/safe-write.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!547 = !{!548}
!548 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !549, line: 40, baseType: !7, size: 32, elements: !550)
!549 = !DIFile(filename: "./lib/sys-limits.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!550 = !{!551}
!551 = !DIEnumerator(name: "SYS_BUFSIZE_MAX", value: 2146435072, isUnsigned: true)
!552 = !{!553}
!553 = !DISubprogram(name: "write", scope: !176, file: !176, line: 366, type: !554, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !24)
!554 = !DISubroutineType(types: !555)
!555 = !{!54, !23, !138, !80}
!556 = distinct !DICompileUnit(language: DW_LANG_C99, file: !557, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !491, retainedTypes: !558, splitDebugInlining: false, nameTableKind: None)
!557 = !DIFile(filename: "lib/trim.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!558 = !{!431, !559, !19, !23, !184, !56, !560, !573, !78}
!559 = !DISubprogram(name: "iswspace", scope: !414, file: !414, line: 130, type: !415, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !24)
!560 = !DISubprogram(name: "mbsinit", scope: !418, file: !418, line: 292, type: !561, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !24)
!561 = !DISubroutineType(types: !562)
!562 = !{!23, !563}
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !565)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !404, line: 13, size: 64, elements: !566)
!566 = !{!567, !568}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !565, file: !404, line: 15, baseType: !23, size: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !565, file: !404, line: 20, baseType: !569, size: 32, offset: 32)
!569 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !565, file: !404, line: 16, size: 32, elements: !570)
!570 = !{!571, !572}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !569, file: !404, line: 18, baseType: !7, size: 32)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !569, file: !404, line: 19, baseType: !412, size: 32)
!573 = !DISubprogram(name: "rpl_mbrtowc", scope: !399, file: !399, line: 717, type: !574, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !24)
!574 = !DISubroutineType(types: !575)
!575 = !{!80, !120, !21, !80, !576}
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!577 = distinct !DICompileUnit(language: DW_LANG_C99, file: !578, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !579, retainedTypes: !583, splitDebugInlining: false, nameTableKind: None)
!578 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!579 = !{!580}
!580 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !578, line: 40, baseType: !7, size: 32, elements: !581)
!581 = !{!582}
!582 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!583 = !{!15, !584, !76}
!584 = !DISubprogram(name: "fputs_unlocked", scope: !26, file: !26, line: 662, type: !585, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !24)
!585 = !DISubroutineType(types: !586)
!586 = !{!23, !21, !587}
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !31, line: 49, size: 1728, elements: !589)
!589 = !{!590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !588, file: !31, line: 51, baseType: !23, size: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !588, file: !31, line: 54, baseType: !19, size: 64, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !588, file: !31, line: 55, baseType: !19, size: 64, offset: 128)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !588, file: !31, line: 56, baseType: !19, size: 64, offset: 192)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !588, file: !31, line: 57, baseType: !19, size: 64, offset: 256)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !588, file: !31, line: 58, baseType: !19, size: 64, offset: 320)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !588, file: !31, line: 59, baseType: !19, size: 64, offset: 384)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !588, file: !31, line: 60, baseType: !19, size: 64, offset: 448)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !588, file: !31, line: 61, baseType: !19, size: 64, offset: 512)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !588, file: !31, line: 64, baseType: !19, size: 64, offset: 576)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !588, file: !31, line: 65, baseType: !19, size: 64, offset: 640)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !588, file: !31, line: 66, baseType: !19, size: 64, offset: 704)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !588, file: !31, line: 68, baseType: !46, size: 64, offset: 768)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !588, file: !31, line: 70, baseType: !587, size: 64, offset: 832)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !588, file: !31, line: 72, baseType: !23, size: 32, offset: 896)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !588, file: !31, line: 73, baseType: !23, size: 32, offset: 928)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !588, file: !31, line: 74, baseType: !52, size: 64, offset: 960)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !588, file: !31, line: 77, baseType: !56, size: 16, offset: 1024)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !588, file: !31, line: 78, baseType: !58, size: 8, offset: 1040)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !588, file: !31, line: 79, baseType: !60, size: 8, offset: 1048)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !588, file: !31, line: 81, baseType: !64, size: 64, offset: 1088)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !588, file: !31, line: 89, baseType: !67, size: 64, offset: 1152)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !588, file: !31, line: 91, baseType: !69, size: 64, offset: 1216)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !588, file: !31, line: 92, baseType: !72, size: 64, offset: 1280)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !588, file: !31, line: 93, baseType: !587, size: 64, offset: 1344)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !588, file: !31, line: 94, baseType: !76, size: 64, offset: 1408)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !588, file: !31, line: 95, baseType: !78, size: 64, offset: 1472)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !588, file: !31, line: 96, baseType: !23, size: 32, offset: 1536)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !588, file: !31, line: 98, baseType: !83, size: 160, offset: 1568)
!619 = distinct !DICompileUnit(language: DW_LANG_C99, file: !620, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !621, retainedTypes: !629, splitDebugInlining: false, nameTableKind: None)
!620 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!621 = !{!622}
!622 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !623, file: !131, line: 186, baseType: !7, size: 32, elements: !541)
!623 = distinct !DISubprogram(name: "x2nrealloc", scope: !131, file: !131, line: 174, type: !533, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !619, retainedNodes: !624)
!624 = !{!625, !626, !627, !628}
!625 = !DILocalVariable(name: "p", arg: 1, scope: !623, file: !131, line: 174, type: !76)
!626 = !DILocalVariable(name: "pn", arg: 2, scope: !623, file: !131, line: 174, type: !535)
!627 = !DILocalVariable(name: "s", arg: 3, scope: !623, file: !131, line: 174, type: !78)
!628 = !DILocalVariable(name: "n", scope: !623, file: !131, line: 176, type: !78)
!629 = !{!78, !431, !130, !181, !19, !156, !76, !630, !633}
!630 = !DISubprogram(name: "xcalloc", scope: !131, file: !131, line: 57, type: !631, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !24)
!631 = !DISubroutineType(types: !632)
!632 = !{!76, !80, !80}
!633 = !DISubprogram(name: "rpl_calloc", scope: !634, file: !634, line: 688, type: !631, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !24)
!634 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!635 = distinct !DICompileUnit(language: DW_LANG_C99, file: !636, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !24, retainedTypes: !637, splitDebugInlining: false, nameTableKind: None)
!636 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!637 = !{!15, !140}
!638 = distinct !DICompileUnit(language: DW_LANG_C99, file: !639, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !24, retainedTypes: !640, splitDebugInlining: false, nameTableKind: None)
!639 = !DIFile(filename: "lib/xstriconv.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!640 = !{!641, !431, !646, !76, !649}
!641 = !DISubprogram(name: "mem_cd_iconv", scope: !642, file: !642, line: 44, type: !643, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !24)
!642 = !DIFile(filename: "./lib/striconv.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!643 = !DISubroutineType(types: !644)
!644 = !{!23, !21, !80, !76, !645, !382}
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!646 = !DISubprogram(name: "str_cd_iconv", scope: !642, file: !642, line: 55, type: !647, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !24)
!647 = !DISubroutineType(types: !648)
!648 = !{!19, !21, !76}
!649 = !DISubprogram(name: "str_iconv", scope: !642, file: !642, line: 66, type: !495, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !24)
!650 = distinct !DICompileUnit(language: DW_LANG_C99, file: !651, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !24, retainedTypes: !652, splitDebugInlining: false, nameTableKind: None)
!651 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!652 = !{!76}
!653 = distinct !DICompileUnit(language: DW_LANG_C99, file: !654, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !24, retainedTypes: !655, splitDebugInlining: false, nameTableKind: None)
!654 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!655 = !{!656, !78, !668}
!656 = !DISubprogram(name: "mbrtowc", scope: !418, file: !418, line: 296, type: !657, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !24)
!657 = !DISubroutineType(types: !658)
!658 = !{!80, !120, !21, !80, !659}
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !404, line: 13, size: 64, elements: !661)
!661 = !{!662, !663}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !660, file: !404, line: 15, baseType: !23, size: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !660, file: !404, line: 20, baseType: !664, size: 32, offset: 32)
!664 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !660, file: !404, line: 16, size: 32, elements: !665)
!665 = !{!666, !667}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !664, file: !404, line: 18, baseType: !7, size: 32)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !664, file: !404, line: 19, baseType: !412, size: 32)
!668 = !DISubprogram(name: "hard_locale", scope: !669, file: !669, line: 26, type: !670, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !24)
!669 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!670 = !DISubroutineType(types: !671)
!671 = !{!194, !23}
!672 = distinct !DICompileUnit(language: DW_LANG_C99, file: !673, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !24, retainedTypes: !674, splitDebugInlining: false, nameTableKind: None)
!673 = !DIFile(filename: "lib/c-strcasecmp.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!674 = !{!675}
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!676 = distinct !DICompileUnit(language: DW_LANG_C99, file: !677, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !24, retainedTypes: !678, splitDebugInlining: false, nameTableKind: None)
!677 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!678 = !{!679}
!679 = !DISubprogram(name: "rpl_fclose", scope: !680, file: !680, line: 672, type: !681, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !24)
!680 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!681 = !DISubroutineType(types: !682)
!682 = !{!23, !683}
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !31, line: 49, size: 1728, elements: !685)
!685 = !{!686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !684, file: !31, line: 51, baseType: !23, size: 32)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !684, file: !31, line: 54, baseType: !19, size: 64, offset: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !684, file: !31, line: 55, baseType: !19, size: 64, offset: 128)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !684, file: !31, line: 56, baseType: !19, size: 64, offset: 192)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !684, file: !31, line: 57, baseType: !19, size: 64, offset: 256)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !684, file: !31, line: 58, baseType: !19, size: 64, offset: 320)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !684, file: !31, line: 59, baseType: !19, size: 64, offset: 384)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !684, file: !31, line: 60, baseType: !19, size: 64, offset: 448)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !684, file: !31, line: 61, baseType: !19, size: 64, offset: 512)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !684, file: !31, line: 64, baseType: !19, size: 64, offset: 576)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !684, file: !31, line: 65, baseType: !19, size: 64, offset: 640)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !684, file: !31, line: 66, baseType: !19, size: 64, offset: 704)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !684, file: !31, line: 68, baseType: !46, size: 64, offset: 768)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !684, file: !31, line: 70, baseType: !683, size: 64, offset: 832)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !684, file: !31, line: 72, baseType: !23, size: 32, offset: 896)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !684, file: !31, line: 73, baseType: !23, size: 32, offset: 928)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !684, file: !31, line: 74, baseType: !52, size: 64, offset: 960)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !684, file: !31, line: 77, baseType: !56, size: 16, offset: 1024)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !684, file: !31, line: 78, baseType: !58, size: 8, offset: 1040)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !684, file: !31, line: 79, baseType: !60, size: 8, offset: 1048)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !684, file: !31, line: 81, baseType: !64, size: 64, offset: 1088)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !684, file: !31, line: 89, baseType: !67, size: 64, offset: 1152)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !684, file: !31, line: 91, baseType: !69, size: 64, offset: 1216)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !684, file: !31, line: 92, baseType: !72, size: 64, offset: 1280)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !684, file: !31, line: 93, baseType: !683, size: 64, offset: 1344)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !684, file: !31, line: 94, baseType: !76, size: 64, offset: 1408)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !684, file: !31, line: 95, baseType: !78, size: 64, offset: 1472)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !684, file: !31, line: 96, baseType: !23, size: 32, offset: 1536)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !684, file: !31, line: 98, baseType: !83, size: 160, offset: 1568)
!715 = distinct !DICompileUnit(language: DW_LANG_C99, file: !716, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !24, retainedTypes: !717, splitDebugInlining: false, nameTableKind: None)
!716 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!717 = !{!718}
!718 = !DISubprogram(name: "setlocale_null_r", scope: !719, file: !719, line: 64, type: !720, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !24)
!719 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!720 = !DISubroutineType(types: !721)
!721 = !{!23, !23, !19, !80}
!722 = distinct !DICompileUnit(language: DW_LANG_C99, file: !723, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !724, retainedTypes: !1111, splitDebugInlining: false, nameTableKind: None)
!723 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!724 = !{!725}
!725 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !726, line: 41, baseType: !7, size: 32, elements: !727)
!726 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!727 = !{!728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110}
!728 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!729 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!730 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!731 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!732 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!733 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!734 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!735 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!736 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!737 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!738 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!739 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!740 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!741 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!742 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!743 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!744 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!745 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!746 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!747 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!748 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!749 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!750 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!751 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!752 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!753 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!754 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!755 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!756 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!757 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!758 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!759 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!760 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!761 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!762 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!763 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!764 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!765 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!766 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!767 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!768 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!769 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!770 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!771 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!772 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!773 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!774 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!775 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!776 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!777 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!779 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!780 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!781 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!782 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!783 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!784 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!785 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!786 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!787 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!788 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!789 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!790 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!791 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!793 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!794 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!795 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!796 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!797 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!798 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!799 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!800 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!801 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!802 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!803 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!804 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!805 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!806 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!807 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!808 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!809 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!810 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!812 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!813 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!814 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!815 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!816 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!817 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!818 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!819 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!820 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!821 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!822 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!823 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!824 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!825 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!826 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!827 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!828 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!829 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!830 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!831 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!832 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!833 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!834 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!835 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!836 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!837 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!838 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!839 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!840 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!841 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!842 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!843 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!844 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!845 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!846 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!847 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!848 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!849 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!850 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!884 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!885 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!886 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!887 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!894 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!895 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!896 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!898 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!899 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!900 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!901 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!902 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!903 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!904 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!905 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!906 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!907 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!908 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!909 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!910 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!911 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!912 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!913 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!914 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!915 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!916 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!917 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!918 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!919 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!920 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!921 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!922 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!923 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!924 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!925 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!926 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!927 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!928 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!929 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!930 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!931 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!932 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!933 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!934 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!935 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!936 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!937 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!938 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!939 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!940 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!941 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!942 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!943 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!944 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!945 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!946 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!947 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!948 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!949 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!950 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!951 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!952 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!953 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!954 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!955 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!956 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!957 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!958 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!959 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!960 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!961 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!962 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!963 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!964 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!965 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!966 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!967 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!968 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!969 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!970 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!971 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!972 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!973 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!974 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!975 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!976 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!977 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!978 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!979 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!980 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!981 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!982 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!983 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!984 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!985 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!986 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!987 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!988 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!989 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!990 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!991 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!992 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!993 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!994 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!995 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!996 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!997 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!998 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!999 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!1000 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!1001 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!1002 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!1003 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!1004 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!1005 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!1006 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!1007 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!1008 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!1009 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!1010 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!1011 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!1012 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!1013 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!1014 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!1015 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!1016 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!1017 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!1018 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!1019 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!1020 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!1021 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!1022 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
