source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.infomap = type { i8*, i8* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%union.anon = type { i32 }

@.str = private unnamed_addr constant [61 x i8] c"Usage: %s [ignored command line arguments]\0A  or:  %s OPTION\0A\00", align 1
@.str.2 = private unnamed_addr constant [44 x i8] c"Exit with a status code indicating failure.\00", align 1
@.str.1 = private unnamed_addr constant [5 x i8] c"%s\0A\0A\00", align 1
@.str.3 = private unnamed_addr constant [45 x i8] c"      --help     display this help and exit\0A\00", align 1
@stdout = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str.4 = private unnamed_addr constant [54 x i8] c"      --version  output version information and exit\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "Version", scope: !2, file: !3, line: 2, type: !6, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, globals: !5, nameTableKind: None)
!3 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{}
!5 = !{!0}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "file_name", scope: !11, file: !12, line: 46, type: !6, isLocal: true, isDefinition: true)
!11 = distinct !DICompileUnit(language: DW_LANG_C99, file: !12, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !13, globals: !89, nameTableKind: None)
!12 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!13 = !{!14, !77, !81, !85}
!14 = !DISubprogram(name: "close_stream", scope: !15, file: !15, line: 2, type: !16, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!15 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!16 = !DISubroutineType(types: !17)
!17 = !{!18, !19}
!18 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !22)
!21 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!22 = !{!23, !24, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !39, !40, !41, !42, !46, !48, !50, !54, !57, !59, !62, !65, !66, !68, !72, !73}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !20, file: !21, line: 51, baseType: !18, size: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !20, file: !21, line: 54, baseType: !25, size: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !20, file: !21, line: 55, baseType: !25, size: 64, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !20, file: !21, line: 56, baseType: !25, size: 64, offset: 192)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !20, file: !21, line: 57, baseType: !25, size: 64, offset: 256)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !20, file: !21, line: 58, baseType: !25, size: 64, offset: 320)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !20, file: !21, line: 59, baseType: !25, size: 64, offset: 384)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !20, file: !21, line: 60, baseType: !25, size: 64, offset: 448)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !20, file: !21, line: 61, baseType: !25, size: 64, offset: 512)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !20, file: !21, line: 64, baseType: !25, size: 64, offset: 576)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !20, file: !21, line: 65, baseType: !25, size: 64, offset: 640)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !20, file: !21, line: 66, baseType: !25, size: 64, offset: 704)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !20, file: !21, line: 68, baseType: !37, size: 64, offset: 768)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !21, line: 36, flags: DIFlagFwdDecl)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !20, file: !21, line: 70, baseType: !19, size: 64, offset: 832)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !20, file: !21, line: 72, baseType: !18, size: 32, offset: 896)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !20, file: !21, line: 73, baseType: !18, size: 32, offset: 928)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !20, file: !21, line: 74, baseType: !43, size: 64, offset: 960)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !44, line: 152, baseType: !45)
!44 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!45 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !20, file: !21, line: 77, baseType: !47, size: 16, offset: 1024)
!47 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !20, file: !21, line: 78, baseType: !49, size: 8, offset: 1040)
!49 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !20, file: !21, line: 79, baseType: !51, size: 8, offset: 1048)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 8, elements: !52)
!52 = !{!53}
!53 = !DISubrange(count: 1)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !20, file: !21, line: 81, baseType: !55, size: 64, offset: 1088)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !21, line: 43, baseType: null)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !20, file: !21, line: 89, baseType: !58, size: 64, offset: 1152)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !44, line: 153, baseType: !45)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !20, file: !21, line: 91, baseType: !60, size: 64, offset: 1216)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !21, line: 37, flags: DIFlagFwdDecl)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !20, file: !21, line: 92, baseType: !63, size: 64, offset: 1280)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !21, line: 38, flags: DIFlagFwdDecl)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !20, file: !21, line: 93, baseType: !19, size: 64, offset: 1344)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !20, file: !21, line: 94, baseType: !67, size: 64, offset: 1408)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !20, file: !21, line: 95, baseType: !69, size: 64, offset: 1472)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !70, line: 46, baseType: !71)
!70 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!71 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !20, file: !21, line: 96, baseType: !18, size: 32, offset: 1536)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !20, file: !21, line: 98, baseType: !74, size: 160, offset: 1568)
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 160, elements: !75)
!75 = !{!76}
!76 = !DISubrange(count: 20)
!77 = !DISubprogram(name: "dcgettext", scope: !78, file: !78, line: 51, type: !79, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!78 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!79 = !DISubroutineType(types: !80)
!80 = !{!25, !6, !6, !18}
!81 = !DISubprogram(name: "quotearg_colon", scope: !82, file: !82, line: 391, type: !83, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!82 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!83 = !DISubroutineType(types: !84)
!84 = !{!25, !6}
!85 = !DISubprogram(name: "error", scope: !86, file: !86, line: 52, type: !87, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!86 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!87 = !DISubroutineType(types: !88)
!88 = !{null, !18, !18, !6, null}
!89 = !{!9, !90}
!90 = !DIGlobalVariableExpression(var: !91, expr: !DIExpression())
!91 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !11, file: !12, line: 56, type: !92, isLocal: true, isDefinition: true)
!92 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!93 = !DIGlobalVariableExpression(var: !94, expr: !DIExpression())
!94 = distinct !DIGlobalVariable(name: "exit_failure", scope: !95, file: !96, line: 24, type: !98, isDefinition: true)
!95 = distinct !DICompileUnit(language: DW_LANG_C99, file: !96, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, globals: !97, nameTableKind: None)
!96 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!97 = !{!93}
!98 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !18)
!99 = !DIGlobalVariableExpression(var: !100, expr: !DIExpression())
!100 = distinct !DIGlobalVariable(name: "program_name", scope: !101, file: !102, line: 33, type: !6, isDefinition: true)
!101 = distinct !DICompileUnit(language: DW_LANG_C99, file: !102, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !103, globals: !140, nameTableKind: None)
!102 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!103 = !{!67, !104, !25}
!104 = !DISubprogram(name: "fputs", scope: !105, file: !105, line: 626, type: !106, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!105 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!106 = !DISubroutineType(types: !107)
!107 = !{!18, !6, !108}
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !110)
!110 = !{!111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !109, file: !21, line: 51, baseType: !18, size: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !109, file: !21, line: 54, baseType: !25, size: 64, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !109, file: !21, line: 55, baseType: !25, size: 64, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !109, file: !21, line: 56, baseType: !25, size: 64, offset: 192)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !109, file: !21, line: 57, baseType: !25, size: 64, offset: 256)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !109, file: !21, line: 58, baseType: !25, size: 64, offset: 320)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !109, file: !21, line: 59, baseType: !25, size: 64, offset: 384)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !109, file: !21, line: 60, baseType: !25, size: 64, offset: 448)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !109, file: !21, line: 61, baseType: !25, size: 64, offset: 512)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !109, file: !21, line: 64, baseType: !25, size: 64, offset: 576)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !109, file: !21, line: 65, baseType: !25, size: 64, offset: 640)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !109, file: !21, line: 66, baseType: !25, size: 64, offset: 704)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !109, file: !21, line: 68, baseType: !37, size: 64, offset: 768)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !109, file: !21, line: 70, baseType: !108, size: 64, offset: 832)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !109, file: !21, line: 72, baseType: !18, size: 32, offset: 896)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !109, file: !21, line: 73, baseType: !18, size: 32, offset: 928)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !109, file: !21, line: 74, baseType: !43, size: 64, offset: 960)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !109, file: !21, line: 77, baseType: !47, size: 16, offset: 1024)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !109, file: !21, line: 78, baseType: !49, size: 8, offset: 1040)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !109, file: !21, line: 79, baseType: !51, size: 8, offset: 1048)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !109, file: !21, line: 81, baseType: !55, size: 64, offset: 1088)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !109, file: !21, line: 89, baseType: !58, size: 64, offset: 1152)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !109, file: !21, line: 91, baseType: !60, size: 64, offset: 1216)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !109, file: !21, line: 92, baseType: !63, size: 64, offset: 1280)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !109, file: !21, line: 93, baseType: !108, size: 64, offset: 1344)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !109, file: !21, line: 94, baseType: !67, size: 64, offset: 1408)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !109, file: !21, line: 95, baseType: !69, size: 64, offset: 1472)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !109, file: !21, line: 96, baseType: !18, size: 32, offset: 1536)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !109, file: !21, line: 98, baseType: !74, size: 160, offset: 1568)
!140 = !{!99}
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !143, file: !144, line: 85, type: !282, isDefinition: true)
!143 = distinct !DICompileUnit(language: DW_LANG_C99, file: !144, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !145, retainedTypes: !180, globals: !255, nameTableKind: None)
!144 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!145 = !{!146, !160, !165}
!146 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !82, line: 32, baseType: !147, size: 32, elements: !148)
!147 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!148 = !{!149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159}
!149 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!150 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!151 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!152 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!153 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!154 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!155 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!156 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!157 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!158 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!159 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!160 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !82, line: 242, baseType: !147, size: 32, elements: !161)
!161 = !{!162, !163, !164}
!162 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!163 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!164 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!165 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !166, line: 46, baseType: !147, size: 32, elements: !167)
!166 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!167 = !{!168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179}
!168 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!169 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!170 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!171 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!172 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!173 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!174 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!175 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!176 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!177 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!178 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!179 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!180 = !{!181, !187, !203, !207, !18, !47, !210, !69, !228, !232, !77, !238, !242, !25, !246, !249, !252}
!181 = !DISubprogram(name: "xmemdup", scope: !182, file: !182, line: 62, type: !183, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!182 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!183 = !DISubroutineType(types: !184)
!184 = !{!67, !185, !71}
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!187 = !DISubprogram(name: "quotearg_alloc_mem", scope: !82, file: !82, line: 342, type: !188, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!188 = !DISubroutineType(types: !189)
!189 = !{!25, !6, !71, !190, !191}
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !193)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !144, line: 65, size: 448, elements: !194)
!194 = !{!195, !196, !197, !201, !202}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !193, file: !144, line: 68, baseType: !146, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !193, file: !144, line: 71, baseType: !18, size: 32, offset: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !193, file: !144, line: 75, baseType: !198, size: 256, offset: 64)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 256, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 8)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !193, file: !144, line: 78, baseType: !6, size: 64, offset: 320)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !193, file: !144, line: 81, baseType: !6, size: 64, offset: 384)
!203 = !DISubprogram(name: "free", scope: !204, file: !204, line: 565, type: !205, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!204 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!205 = !DISubroutineType(types: !206)
!206 = !{null, !67}
!207 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !82, file: !82, line: 408, type: !208, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!208 = !DISubroutineType(types: !209)
!209 = !{!25, !18, !6, !6, !6, !71}
!210 = !DISubprogram(name: "rpl_mbrtowc", scope: !211, file: !211, line: 717, type: !212, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!211 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!212 = !DISubroutineType(types: !213)
!213 = !{!71, !214, !6, !71, !215}
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !217, line: 13, size: 64, elements: !218)
!217 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!218 = !{!219, !220}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !216, file: !217, line: 15, baseType: !18, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !216, file: !217, line: 20, baseType: !221, size: 32, offset: 32)
!221 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !216, file: !217, line: 16, size: 32, elements: !222)
!222 = !{!223, !224}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !221, file: !217, line: 18, baseType: !147, size: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !221, file: !217, line: 19, baseType: !225, size: 32)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 32, elements: !226)
!226 = !{!227}
!227 = !DISubrange(count: 4)
!228 = !DISubprogram(name: "iswprint", scope: !229, file: !229, line: 120, type: !230, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!229 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!230 = !DISubroutineType(types: !231)
!231 = !{!18, !147}
!232 = !DISubprogram(name: "mbsinit", scope: !233, file: !233, line: 292, type: !234, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!233 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!234 = !DISubroutineType(types: !235)
!235 = !{!18, !236}
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !216)
!238 = !DISubprogram(name: "locale_charset", scope: !239, file: !239, line: 35, type: !240, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!239 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!240 = !DISubroutineType(types: !241)
!241 = !{!6}
!242 = !DISubprogram(name: "c_strcasecmp", scope: !243, file: !243, line: 42, type: !244, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!243 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!244 = !DISubroutineType(types: !245)
!245 = !{!18, !6, !6}
!246 = !DISubprogram(name: "xmalloc", scope: !182, file: !182, line: 53, type: !247, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!247 = !DISubroutineType(types: !248)
!248 = !{!67, !71}
!249 = !DISubprogram(name: "xalloc_die", scope: !182, file: !182, line: 51, type: !250, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !4)
!250 = !DISubroutineType(types: !251)
!251 = !{null}
!252 = !DISubprogram(name: "xrealloc", scope: !182, file: !182, line: 59, type: !253, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!253 = !DISubroutineType(types: !254)
!254 = !{!67, !67, !71}
!255 = !{!141, !256, !262, !264, !266, !271, !278, !280}
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !143, file: !144, line: 101, type: !258, isDefinition: true)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 320, elements: !260)
!259 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !146)
!260 = !{!261}
!261 = !DISubrange(count: 10)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !143, file: !144, line: 1052, type: !193, isDefinition: true)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !143, file: !144, line: 116, type: !193, isLocal: true, isDefinition: true)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "slot0", scope: !143, file: !144, line: 842, type: !268, isLocal: true, isDefinition: true)
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, elements: !269)
!269 = !{!270}
!270 = !DISubrange(count: 256)
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(name: "slotvec", scope: !143, file: !144, line: 845, type: !273, isLocal: true, isDefinition: true)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !144, line: 834, size: 128, elements: !275)
!275 = !{!276, !277}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !274, file: !144, line: 836, baseType: !69, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !274, file: !144, line: 837, baseType: !25, size: 64, offset: 64)
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(name: "nslots", scope: !143, file: !144, line: 843, type: !18, isLocal: true, isDefinition: true)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "slotvec0", scope: !143, file: !144, line: 844, type: !274, isLocal: true, isDefinition: true)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !283, size: 704, elements: !284)
!283 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!284 = !{!285}
!285 = !DISubrange(count: 11)
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !288, file: !289, line: 26, type: !291, isDefinition: true)
!288 = distinct !DICompileUnit(language: DW_LANG_C99, file: !289, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, globals: !290, nameTableKind: None)
!289 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!290 = !{!286}
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 376, elements: !292)
!292 = !{!293}
!293 = !DISubrange(count: 47)
!294 = distinct !DICompileUnit(language: DW_LANG_C99, file: !295, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !296, nameTableKind: None)
!295 = !DIFile(filename: "src/false.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!296 = !{!77, !297, !332, !336, !340, !343, !344, !25, !67, !348}
!297 = !DISubprogram(name: "fputs_unlocked", scope: !105, file: !105, line: 662, type: !298, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!298 = !DISubroutineType(types: !299)
!299 = !{!18, !6, !300}
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !302)
!302 = !{!303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !301, file: !21, line: 51, baseType: !18, size: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !301, file: !21, line: 54, baseType: !25, size: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !301, file: !21, line: 55, baseType: !25, size: 64, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !301, file: !21, line: 56, baseType: !25, size: 64, offset: 192)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !301, file: !21, line: 57, baseType: !25, size: 64, offset: 256)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !301, file: !21, line: 58, baseType: !25, size: 64, offset: 320)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !301, file: !21, line: 59, baseType: !25, size: 64, offset: 384)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !301, file: !21, line: 60, baseType: !25, size: 64, offset: 448)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !301, file: !21, line: 61, baseType: !25, size: 64, offset: 512)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !301, file: !21, line: 64, baseType: !25, size: 64, offset: 576)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !301, file: !21, line: 65, baseType: !25, size: 64, offset: 640)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !301, file: !21, line: 66, baseType: !25, size: 64, offset: 704)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !301, file: !21, line: 68, baseType: !37, size: 64, offset: 768)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !301, file: !21, line: 70, baseType: !300, size: 64, offset: 832)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !301, file: !21, line: 72, baseType: !18, size: 32, offset: 896)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !301, file: !21, line: 73, baseType: !18, size: 32, offset: 928)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !301, file: !21, line: 74, baseType: !43, size: 64, offset: 960)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !301, file: !21, line: 77, baseType: !47, size: 16, offset: 1024)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !301, file: !21, line: 78, baseType: !49, size: 8, offset: 1040)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !301, file: !21, line: 79, baseType: !51, size: 8, offset: 1048)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !301, file: !21, line: 81, baseType: !55, size: 64, offset: 1088)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !301, file: !21, line: 89, baseType: !58, size: 64, offset: 1152)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !301, file: !21, line: 91, baseType: !60, size: 64, offset: 1216)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !301, file: !21, line: 92, baseType: !63, size: 64, offset: 1280)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !301, file: !21, line: 93, baseType: !300, size: 64, offset: 1344)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !301, file: !21, line: 94, baseType: !67, size: 64, offset: 1408)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !301, file: !21, line: 95, baseType: !69, size: 64, offset: 1472)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !301, file: !21, line: 96, baseType: !18, size: 32, offset: 1536)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !301, file: !21, line: 98, baseType: !74, size: 160, offset: 1568)
!332 = !DISubprogram(name: "set_program_name", scope: !333, file: !333, line: 37, type: !334, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!333 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!334 = !DISubroutineType(types: !335)
!335 = !{null, !6}
!336 = !DISubprogram(name: "setlocale", scope: !337, file: !337, line: 122, type: !338, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!337 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!338 = !DISubroutineType(types: !339)
!339 = !{!25, !18, !6}
!340 = !DISubprogram(name: "bindtextdomain", scope: !78, file: !78, line: 86, type: !341, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!341 = !DISubroutineType(types: !342)
!342 = !{!25, !6, !6}
!343 = !DISubprogram(name: "textdomain", scope: !78, file: !78, line: 82, type: !83, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!344 = !DISubprogram(name: "atexit", scope: !204, file: !204, line: 595, type: !345, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!345 = !DISubroutineType(types: !346)
!346 = !{!18, !347}
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!348 = !DISubprogram(name: "version_etc", scope: !349, file: !349, line: 69, type: !350, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!349 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!350 = !DISubroutineType(types: !351)
!351 = !{null, !300, !6, !6, !6, null}
!352 = distinct !DICompileUnit(language: DW_LANG_C99, file: !353, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !354, retainedTypes: !358, nameTableKind: None)
!353 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!354 = !{!355}
!355 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !353, line: 40, baseType: !147, size: 32, elements: !356)
!356 = !{!357}
!357 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!358 = !{!77, !359, !67}
!359 = !DISubprogram(name: "fputs_unlocked", scope: !105, file: !105, line: 662, type: !360, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!360 = !DISubroutineType(types: !361)
!361 = !{!18, !6, !362}
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !364)
!364 = !{!365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !363, file: !21, line: 51, baseType: !18, size: 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !363, file: !21, line: 54, baseType: !25, size: 64, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !363, file: !21, line: 55, baseType: !25, size: 64, offset: 128)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !363, file: !21, line: 56, baseType: !25, size: 64, offset: 192)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !363, file: !21, line: 57, baseType: !25, size: 64, offset: 256)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !363, file: !21, line: 58, baseType: !25, size: 64, offset: 320)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !363, file: !21, line: 59, baseType: !25, size: 64, offset: 384)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !363, file: !21, line: 60, baseType: !25, size: 64, offset: 448)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !363, file: !21, line: 61, baseType: !25, size: 64, offset: 512)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !363, file: !21, line: 64, baseType: !25, size: 64, offset: 576)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !363, file: !21, line: 65, baseType: !25, size: 64, offset: 640)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !363, file: !21, line: 66, baseType: !25, size: 64, offset: 704)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !363, file: !21, line: 68, baseType: !37, size: 64, offset: 768)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !363, file: !21, line: 70, baseType: !362, size: 64, offset: 832)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !363, file: !21, line: 72, baseType: !18, size: 32, offset: 896)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !363, file: !21, line: 73, baseType: !18, size: 32, offset: 928)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !363, file: !21, line: 74, baseType: !43, size: 64, offset: 960)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !363, file: !21, line: 77, baseType: !47, size: 16, offset: 1024)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !363, file: !21, line: 78, baseType: !49, size: 8, offset: 1040)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !363, file: !21, line: 79, baseType: !51, size: 8, offset: 1048)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !363, file: !21, line: 81, baseType: !55, size: 64, offset: 1088)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !363, file: !21, line: 89, baseType: !58, size: 64, offset: 1152)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !363, file: !21, line: 91, baseType: !60, size: 64, offset: 1216)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !363, file: !21, line: 92, baseType: !63, size: 64, offset: 1280)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !363, file: !21, line: 93, baseType: !362, size: 64, offset: 1344)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !363, file: !21, line: 94, baseType: !67, size: 64, offset: 1408)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !363, file: !21, line: 95, baseType: !69, size: 64, offset: 1472)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !363, file: !21, line: 96, baseType: !18, size: 32, offset: 1536)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !363, file: !21, line: 98, baseType: !74, size: 160, offset: 1568)
!394 = distinct !DICompileUnit(language: DW_LANG_C99, file: !395, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !396, retainedTypes: !409, nameTableKind: None)
!395 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!396 = !{!397}
!397 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !398, file: !182, line: 186, baseType: !147, size: 32, elements: !407)
!398 = distinct !DISubprogram(name: "x2nrealloc", scope: !182, file: !182, line: 174, type: !399, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !394, retainedNodes: !402)
!399 = !DISubroutineType(types: !400)
!400 = !{!67, !67, !401, !69}
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!402 = !{!403, !404, !405, !406}
!403 = !DILocalVariable(name: "p", arg: 1, scope: !398, file: !182, line: 174, type: !67)
!404 = !DILocalVariable(name: "pn", arg: 2, scope: !398, file: !182, line: 174, type: !401)
!405 = !DILocalVariable(name: "s", arg: 3, scope: !398, file: !182, line: 174, type: !69)
!406 = !DILocalVariable(name: "n", scope: !398, file: !182, line: 176, type: !69)
!407 = !{!408}
!408 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!409 = !{!69, !249, !246, !252, !25, !203, !67, !410, !413}
!410 = !DISubprogram(name: "xcalloc", scope: !182, file: !182, line: 57, type: !411, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!411 = !DISubroutineType(types: !412)
!412 = !{!67, !71, !71}
!413 = !DISubprogram(name: "rpl_calloc", scope: !414, file: !414, line: 688, type: !411, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!414 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!415 = distinct !DICompileUnit(language: DW_LANG_C99, file: !416, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !417, nameTableKind: None)
!416 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!417 = !{!77, !85}
!418 = distinct !DICompileUnit(language: DW_LANG_C99, file: !419, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !420, nameTableKind: None)
!419 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!420 = !{!67}
!421 = distinct !DICompileUnit(language: DW_LANG_C99, file: !422, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !423, nameTableKind: None)
!422 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!423 = !{!424, !69, !436}
!424 = !DISubprogram(name: "mbrtowc", scope: !233, file: !233, line: 296, type: !425, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!425 = !DISubroutineType(types: !426)
!426 = !{!71, !214, !6, !71, !427}
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !217, line: 13, size: 64, elements: !429)
!429 = !{!430, !431}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !428, file: !217, line: 15, baseType: !18, size: 32)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !428, file: !217, line: 20, baseType: !432, size: 32, offset: 32)
!432 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !428, file: !217, line: 16, size: 32, elements: !433)
!433 = !{!434, !435}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !432, file: !217, line: 18, baseType: !147, size: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !432, file: !217, line: 19, baseType: !225, size: 32)
!436 = !DISubprogram(name: "hard_locale", scope: !437, file: !437, line: 26, type: !438, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!437 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!438 = !DISubroutineType(types: !439)
!439 = !{!92, !18}
!440 = distinct !DICompileUnit(language: DW_LANG_C99, file: !441, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !442, nameTableKind: None)
!441 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!442 = !{!443}
!443 = !DISubprogram(name: "rpl_fclose", scope: !444, file: !444, line: 672, type: !445, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!444 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!445 = !DISubroutineType(types: !446)
!446 = !{!18, !447}
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !449)
!449 = !{!450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !448, file: !21, line: 51, baseType: !18, size: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !448, file: !21, line: 54, baseType: !25, size: 64, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !448, file: !21, line: 55, baseType: !25, size: 64, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !448, file: !21, line: 56, baseType: !25, size: 64, offset: 192)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !448, file: !21, line: 57, baseType: !25, size: 64, offset: 256)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !448, file: !21, line: 58, baseType: !25, size: 64, offset: 320)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !448, file: !21, line: 59, baseType: !25, size: 64, offset: 384)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !448, file: !21, line: 60, baseType: !25, size: 64, offset: 448)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !448, file: !21, line: 61, baseType: !25, size: 64, offset: 512)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !448, file: !21, line: 64, baseType: !25, size: 64, offset: 576)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !448, file: !21, line: 65, baseType: !25, size: 64, offset: 640)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !448, file: !21, line: 66, baseType: !25, size: 64, offset: 704)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !448, file: !21, line: 68, baseType: !37, size: 64, offset: 768)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !448, file: !21, line: 70, baseType: !447, size: 64, offset: 832)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !448, file: !21, line: 72, baseType: !18, size: 32, offset: 896)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !448, file: !21, line: 73, baseType: !18, size: 32, offset: 928)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !448, file: !21, line: 74, baseType: !43, size: 64, offset: 960)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !448, file: !21, line: 77, baseType: !47, size: 16, offset: 1024)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !448, file: !21, line: 78, baseType: !49, size: 8, offset: 1040)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !448, file: !21, line: 79, baseType: !51, size: 8, offset: 1048)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !448, file: !21, line: 81, baseType: !55, size: 64, offset: 1088)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !448, file: !21, line: 89, baseType: !58, size: 64, offset: 1152)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !448, file: !21, line: 91, baseType: !60, size: 64, offset: 1216)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !448, file: !21, line: 92, baseType: !63, size: 64, offset: 1280)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !448, file: !21, line: 93, baseType: !447, size: 64, offset: 1344)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !448, file: !21, line: 94, baseType: !67, size: 64, offset: 1408)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !448, file: !21, line: 95, baseType: !69, size: 64, offset: 1472)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !448, file: !21, line: 96, baseType: !18, size: 32, offset: 1536)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !448, file: !21, line: 98, baseType: !74, size: 160, offset: 1568)
!479 = distinct !DICompileUnit(language: DW_LANG_C99, file: !480, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !481, nameTableKind: None)
!480 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!481 = !{!482}
!482 = !DISubprogram(name: "setlocale_null_r", scope: !483, file: !483, line: 64, type: !484, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!483 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!484 = !DISubroutineType(types: !485)
!485 = !{!18, !18, !25, !71}
!486 = distinct !DICompileUnit(language: DW_LANG_C99, file: !487, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !488, retainedTypes: !875, nameTableKind: None)
!487 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!488 = !{!489}
!489 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !490, line: 41, baseType: !147, size: 32, elements: !491)
!490 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!491 = !{!492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874}
!492 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!493 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!494 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!495 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!496 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!497 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!498 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!499 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!500 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!501 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!502 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!503 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!504 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!505 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!506 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!507 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!508 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!509 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!510 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!511 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!512 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!513 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!514 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!515 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!516 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!517 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!518 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!519 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!520 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!521 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!522 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!523 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!524 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!525 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!526 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!527 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!528 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!529 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!530 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!531 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!532 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!533 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!534 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!535 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!536 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!537 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!538 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!539 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!540 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!541 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!542 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!543 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!544 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!545 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!546 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!547 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!548 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!549 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!550 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!551 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!552 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!553 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!554 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!555 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!556 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!557 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!558 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!559 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!560 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!561 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!562 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!563 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!564 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!565 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!566 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!567 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!568 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!569 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!570 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!571 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!572 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!573 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!574 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!575 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!576 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!577 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!578 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!579 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!580 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!581 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!582 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!583 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!584 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!585 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!586 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!587 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!588 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!589 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!590 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!591 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!592 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!593 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!594 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!595 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!596 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!597 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!598 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!599 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!600 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!601 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!602 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!603 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!604 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!605 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!606 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!607 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!608 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!609 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!610 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!611 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!612 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!613 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!614 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!615 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!616 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!617 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!618 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!619 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!620 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!621 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!622 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!623 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!624 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!625 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!626 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!627 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!628 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!629 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!630 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!631 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!632 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!633 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!634 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!635 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!636 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!637 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!661 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!662 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!663 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!664 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!665 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!666 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!667 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!668 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!669 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!670 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!671 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!672 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!673 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!674 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!675 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!676 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!677 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!678 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!679 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!680 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!681 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!682 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!683 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!684 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!685 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!686 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!687 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!688 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!689 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!690 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!691 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!692 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!693 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!694 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!695 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!696 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!697 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!698 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!699 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!700 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!701 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!702 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!703 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!704 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!705 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!706 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!707 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!708 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!709 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!710 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!711 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!712 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!713 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!714 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!715 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!716 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!717 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!719 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!720 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!721 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!722 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!723 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!724 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!725 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!726 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!727 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!728 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!729 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!730 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!731 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!732 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!733 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!734 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!735 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!736 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!737 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!738 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!739 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!740 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!741 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!742 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!743 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!744 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!745 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!746 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!747 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!748 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!749 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!750 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!751 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!752 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!753 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!754 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!755 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!756 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!757 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!758 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!759 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!760 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!761 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!762 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!763 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!764 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!765 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!766 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!767 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!768 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!769 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!770 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!771 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!772 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!773 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!774 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!776 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!777 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!778 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!779 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!780 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!781 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!782 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!783 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!784 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!785 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!786 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!787 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!788 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!789 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!790 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!791 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!793 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!794 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!795 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!796 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!797 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!798 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!799 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!800 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!801 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!802 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!803 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!804 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!805 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!806 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!807 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!808 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!809 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!810 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!811 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!812 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!813 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!814 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!815 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!816 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!817 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!818 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!819 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!820 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!821 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!822 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!823 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!824 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!825 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!826 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!827 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!828 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!829 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!830 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!831 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!832 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!833 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!834 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!835 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!836 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!837 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!838 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!839 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!840 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!841 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!842 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!843 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!844 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!845 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!846 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!847 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!875 = !{!876, !67}
!876 = !DISubprogram(name: "nl_langinfo", scope: !490, file: !490, line: 661, type: !877, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!877 = !DISubroutineType(types: !878)
!878 = !{!25, !18}
!879 = distinct !DICompileUnit(language: DW_LANG_C99, file: !880, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !881, nameTableKind: None)
!880 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!881 = !{!67, !336}
!882 = distinct !DICompileUnit(language: DW_LANG_C99, file: !883, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !884, nameTableKind: None)
!883 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!884 = !{!885, !920, !921, !925}
!885 = !DISubprogram(name: "fileno", scope: !105, file: !105, line: 786, type: !886, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!886 = !DISubroutineType(types: !887)
!887 = !{!18, !888}
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !890)
!890 = !{!891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !889, file: !21, line: 51, baseType: !18, size: 32)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !889, file: !21, line: 54, baseType: !25, size: 64, offset: 64)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !889, file: !21, line: 55, baseType: !25, size: 64, offset: 128)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !889, file: !21, line: 56, baseType: !25, size: 64, offset: 192)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !889, file: !21, line: 57, baseType: !25, size: 64, offset: 256)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !889, file: !21, line: 58, baseType: !25, size: 64, offset: 320)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !889, file: !21, line: 59, baseType: !25, size: 64, offset: 384)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !889, file: !21, line: 60, baseType: !25, size: 64, offset: 448)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !889, file: !21, line: 61, baseType: !25, size: 64, offset: 512)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !889, file: !21, line: 64, baseType: !25, size: 64, offset: 576)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !889, file: !21, line: 65, baseType: !25, size: 64, offset: 640)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !889, file: !21, line: 66, baseType: !25, size: 64, offset: 704)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !889, file: !21, line: 68, baseType: !37, size: 64, offset: 768)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !889, file: !21, line: 70, baseType: !888, size: 64, offset: 832)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !889, file: !21, line: 72, baseType: !18, size: 32, offset: 896)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !889, file: !21, line: 73, baseType: !18, size: 32, offset: 928)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !889, file: !21, line: 74, baseType: !43, size: 64, offset: 960)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !889, file: !21, line: 77, baseType: !47, size: 16, offset: 1024)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !889, file: !21, line: 78, baseType: !49, size: 8, offset: 1040)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !889, file: !21, line: 79, baseType: !51, size: 8, offset: 1048)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !889, file: !21, line: 81, baseType: !55, size: 64, offset: 1088)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !889, file: !21, line: 89, baseType: !58, size: 64, offset: 1152)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !889, file: !21, line: 91, baseType: !60, size: 64, offset: 1216)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !889, file: !21, line: 92, baseType: !63, size: 64, offset: 1280)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !889, file: !21, line: 93, baseType: !888, size: 64, offset: 1344)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !889, file: !21, line: 94, baseType: !67, size: 64, offset: 1408)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !889, file: !21, line: 95, baseType: !69, size: 64, offset: 1472)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !889, file: !21, line: 96, baseType: !18, size: 32, offset: 1536)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !889, file: !21, line: 98, baseType: !74, size: 160, offset: 1568)
!920 = !DISubprogram(name: "fclose", scope: !105, file: !105, line: 213, type: !886, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!921 = !DISubprogram(name: "lseek", scope: !922, file: !922, line: 334, type: !923, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!922 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!923 = !DISubroutineType(types: !924)
!924 = !{!45, !18, !45, !18}
!925 = !DISubprogram(name: "rpl_fflush", scope: !444, file: !444, line: 718, type: !886, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!926 = distinct !DICompileUnit(language: DW_LANG_C99, file: !927, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !928, nameTableKind: None)
!927 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!928 = !{!67, !929, !964}
!929 = !DISubprogram(name: "fflush", scope: !105, file: !105, line: 218, type: !930, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!930 = !DISubroutineType(types: !931)
!931 = !{!18, !932}
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !934)
!934 = !{!935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !933, file: !21, line: 51, baseType: !18, size: 32)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !933, file: !21, line: 54, baseType: !25, size: 64, offset: 64)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !933, file: !21, line: 55, baseType: !25, size: 64, offset: 128)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !933, file: !21, line: 56, baseType: !25, size: 64, offset: 192)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !933, file: !21, line: 57, baseType: !25, size: 64, offset: 256)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !933, file: !21, line: 58, baseType: !25, size: 64, offset: 320)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !933, file: !21, line: 59, baseType: !25, size: 64, offset: 384)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !933, file: !21, line: 60, baseType: !25, size: 64, offset: 448)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !933, file: !21, line: 61, baseType: !25, size: 64, offset: 512)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !933, file: !21, line: 64, baseType: !25, size: 64, offset: 576)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !933, file: !21, line: 65, baseType: !25, size: 64, offset: 640)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !933, file: !21, line: 66, baseType: !25, size: 64, offset: 704)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !933, file: !21, line: 68, baseType: !37, size: 64, offset: 768)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !933, file: !21, line: 70, baseType: !932, size: 64, offset: 832)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !933, file: !21, line: 72, baseType: !18, size: 32, offset: 896)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !933, file: !21, line: 73, baseType: !18, size: 32, offset: 928)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !933, file: !21, line: 74, baseType: !43, size: 64, offset: 960)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !933, file: !21, line: 77, baseType: !47, size: 16, offset: 1024)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !933, file: !21, line: 78, baseType: !49, size: 8, offset: 1040)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !933, file: !21, line: 79, baseType: !51, size: 8, offset: 1048)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !933, file: !21, line: 81, baseType: !55, size: 64, offset: 1088)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !933, file: !21, line: 89, baseType: !58, size: 64, offset: 1152)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !933, file: !21, line: 91, baseType: !60, size: 64, offset: 1216)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !933, file: !21, line: 92, baseType: !63, size: 64, offset: 1280)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !933, file: !21, line: 93, baseType: !932, size: 64, offset: 1344)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !933, file: !21, line: 94, baseType: !67, size: 64, offset: 1408)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !933, file: !21, line: 95, baseType: !69, size: 64, offset: 1472)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !933, file: !21, line: 96, baseType: !18, size: 32, offset: 1536)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !933, file: !21, line: 98, baseType: !74, size: 160, offset: 1568)
!964 = !DISubprogram(name: "rpl_fseeko", scope: !444, file: !444, line: 1034, type: !965, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!965 = !DISubroutineType(types: !966)
!966 = !{!18, !932, !45, !18}
!967 = distinct !DICompileUnit(language: DW_LANG_C99, file: !968, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !969, nameTableKind: None)
!968 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!969 = !{!67, !970, !921, !1005}
!970 = !DISubprogram(name: "fileno", scope: !105, file: !105, line: 786, type: !971, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!971 = !DISubroutineType(types: !972)
!972 = !{!18, !973}
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !975)
!975 = !{!976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !974, file: !21, line: 51, baseType: !18, size: 32)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !974, file: !21, line: 54, baseType: !25, size: 64, offset: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !974, file: !21, line: 55, baseType: !25, size: 64, offset: 128)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !974, file: !21, line: 56, baseType: !25, size: 64, offset: 192)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !974, file: !21, line: 57, baseType: !25, size: 64, offset: 256)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !974, file: !21, line: 58, baseType: !25, size: 64, offset: 320)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !974, file: !21, line: 59, baseType: !25, size: 64, offset: 384)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !974, file: !21, line: 60, baseType: !25, size: 64, offset: 448)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !974, file: !21, line: 61, baseType: !25, size: 64, offset: 512)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !974, file: !21, line: 64, baseType: !25, size: 64, offset: 576)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !974, file: !21, line: 65, baseType: !25, size: 64, offset: 640)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !974, file: !21, line: 66, baseType: !25, size: 64, offset: 704)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !974, file: !21, line: 68, baseType: !37, size: 64, offset: 768)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !974, file: !21, line: 70, baseType: !973, size: 64, offset: 832)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !974, file: !21, line: 72, baseType: !18, size: 32, offset: 896)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !974, file: !21, line: 73, baseType: !18, size: 32, offset: 928)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !974, file: !21, line: 74, baseType: !43, size: 64, offset: 960)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !974, file: !21, line: 77, baseType: !47, size: 16, offset: 1024)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !974, file: !21, line: 78, baseType: !49, size: 8, offset: 1040)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !974, file: !21, line: 79, baseType: !51, size: 8, offset: 1048)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !974, file: !21, line: 81, baseType: !55, size: 64, offset: 1088)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !974, file: !21, line: 89, baseType: !58, size: 64, offset: 1152)
