source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.Word = type { i8*, i32, i32, i8, i32, i64, %struct.Word* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [42 x i8] c"Usage: %s [-WIDTH] [OPTION]... [FILE]...\0A\00", align 1
@.str.2 = private unnamed_addr constant [129 x i8] c"Reformat each paragraph in the FILE(s), writing to standard output.\0AThe option -WIDTH is an abbreviated form of --width=DIGITS.\0A\00", align 1
@stdout = external local_unnamed_addr global %struct._IO_FILE*, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1 = distinct !DIGlobalVariable(name: "uniform", scope: !2, file: !3, line: 183, type: !188, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !44, globals: !185, nameTableKind: None)
!3 = !DIFile(filename: "src/fmt.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !20, !29}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!9 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 45, baseType: !7, size: 32, elements: !22)
!21 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!22 = !{!23, !24, !25, !26, !27, !28}
!23 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0, isUnsigned: true)
!24 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2, isUnsigned: true)
!25 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5, isUnsigned: true)
!26 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4, isUnsigned: true)
!27 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3, isUnsigned: true)
!28 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !30, line: 46, baseType: !7, size: 32, elements: !31)
!30 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!31 = !{!32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43}
!32 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!33 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!34 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!35 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!36 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!37 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!38 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!39 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!40 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!41 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!42 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!43 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!44 = !{!45, !55, !116, !120, !124, !127, !130, !7, !137, !152, !49, !106, !156, !160, !164, !168, !171, !174, !177, !178, !53, !86, !108, !51, !179, !184}
!45 = !DISubprogram(name: "dcgettext", scope: !46, file: !46, line: 51, type: !47, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!46 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!47 = !DISubroutineType(types: !48)
!48 = !{!49, !51, !51, !53}
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!53 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!54 = !{}
!55 = !DISubprogram(name: "fputs_unlocked", scope: !56, file: !56, line: 662, type: !57, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!56 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!57 = !DISubroutineType(types: !58)
!58 = !{!53, !51, !59}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !61, line: 49, size: 1728, elements: !62)
!61 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!62 = !{!63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !78, !79, !80, !81, !85, !87, !89, !93, !96, !98, !101, !104, !105, !107, !111, !112}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !60, file: !61, line: 51, baseType: !53, size: 32)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !60, file: !61, line: 54, baseType: !49, size: 64, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !60, file: !61, line: 55, baseType: !49, size: 64, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !60, file: !61, line: 56, baseType: !49, size: 64, offset: 192)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !60, file: !61, line: 57, baseType: !49, size: 64, offset: 256)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !60, file: !61, line: 58, baseType: !49, size: 64, offset: 320)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !60, file: !61, line: 59, baseType: !49, size: 64, offset: 384)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !60, file: !61, line: 60, baseType: !49, size: 64, offset: 448)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !60, file: !61, line: 61, baseType: !49, size: 64, offset: 512)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !60, file: !61, line: 64, baseType: !49, size: 64, offset: 576)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !60, file: !61, line: 65, baseType: !49, size: 64, offset: 640)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !60, file: !61, line: 66, baseType: !49, size: 64, offset: 704)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !60, file: !61, line: 68, baseType: !76, size: 64, offset: 768)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !61, line: 36, flags: DIFlagFwdDecl)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !60, file: !61, line: 70, baseType: !59, size: 64, offset: 832)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !60, file: !61, line: 72, baseType: !53, size: 32, offset: 896)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !60, file: !61, line: 73, baseType: !53, size: 32, offset: 928)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !60, file: !61, line: 74, baseType: !82, size: 64, offset: 960)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !83, line: 152, baseType: !84)
!83 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!84 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !60, file: !61, line: 77, baseType: !86, size: 16, offset: 1024)
!86 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !60, file: !61, line: 78, baseType: !88, size: 8, offset: 1040)
!88 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !60, file: !61, line: 79, baseType: !90, size: 8, offset: 1048)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 8, elements: !91)
!91 = !{!92}
!92 = !DISubrange(count: 1)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !60, file: !61, line: 81, baseType: !94, size: 64, offset: 1088)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !61, line: 43, baseType: null)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !60, file: !61, line: 89, baseType: !97, size: 64, offset: 1152)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !83, line: 153, baseType: !84)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !60, file: !61, line: 91, baseType: !99, size: 64, offset: 1216)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !61, line: 37, flags: DIFlagFwdDecl)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !60, file: !61, line: 92, baseType: !102, size: 64, offset: 1280)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !61, line: 38, flags: DIFlagFwdDecl)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !60, file: !61, line: 93, baseType: !59, size: 64, offset: 1344)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !60, file: !61, line: 94, baseType: !106, size: 64, offset: 1408)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !60, file: !61, line: 95, baseType: !108, size: 64, offset: 1472)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !109, line: 46, baseType: !110)
!109 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!110 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !60, file: !61, line: 96, baseType: !53, size: 32, offset: 1536)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !60, file: !61, line: 98, baseType: !113, size: 160, offset: 1568)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 160, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 20)
!116 = !DISubprogram(name: "set_program_name", scope: !117, file: !117, line: 37, type: !118, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!117 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!118 = !DISubroutineType(types: !119)
!119 = !{null, !51}
!120 = !DISubprogram(name: "setlocale", scope: !121, file: !121, line: 122, type: !122, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!121 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!122 = !DISubroutineType(types: !123)
!123 = !{!49, !53, !51}
!124 = !DISubprogram(name: "bindtextdomain", scope: !46, file: !46, line: 86, type: !125, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!125 = !DISubroutineType(types: !126)
!126 = !{!49, !51, !51}
!127 = !DISubprogram(name: "textdomain", scope: !46, file: !46, line: 82, type: !128, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!128 = !DISubroutineType(types: !129)
!129 = !{!49, !51}
!130 = !DISubprogram(name: "atexit", scope: !131, file: !131, line: 595, type: !132, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!131 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!132 = !DISubroutineType(types: !133)
!133 = !{!53, !134}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{null}
!137 = !DISubprogram(name: "getopt_long", scope: !138, file: !138, line: 66, type: !139, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!138 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!139 = !DISubroutineType(types: !140)
!140 = !{!53, !53, !141, !51, !143, !150}
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !145)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !138, line: 50, size: 256, elements: !146)
!146 = !{!147, !148, !149, !151}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !145, file: !138, line: 52, baseType: !51, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !145, file: !138, line: 55, baseType: !53, size: 32, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !145, file: !138, line: 56, baseType: !150, size: 64, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !145, file: !138, line: 57, baseType: !53, size: 32, offset: 192)
!152 = !DISubprogram(name: "error", scope: !153, file: !153, line: 52, type: !154, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!153 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!154 = !DISubroutineType(types: !155)
!155 = !{null, !53, !53, !51, null}
!156 = !DISubprogram(name: "version_etc", scope: !157, file: !157, line: 69, type: !158, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!157 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!158 = !DISubroutineType(types: !159)
!159 = !{null, !59, !51, !51, !51, null}
!160 = !DISubprogram(name: "xdectoumax", scope: !161, file: !161, line: 31, type: !162, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!161 = !DIFile(filename: "./lib/xdectoint.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!162 = !DISubroutineType(types: !163)
!163 = !{!110, !51, !110, !110, !51, !51, !53}
!164 = !DISubprogram(name: "rpl_fclose", scope: !165, file: !165, line: 672, type: !166, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!165 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!166 = !DISubroutineType(types: !167)
!167 = !{!53, !59}
!168 = !DISubprogram(name: "quotearg_n_style_colon", scope: !6, file: !6, line: 397, type: !169, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!169 = !DISubroutineType(types: !170)
!170 = !{!49, !53, !5, !51}
!171 = !DISubprogram(name: "quotearg_style", scope: !6, file: !6, line: 377, type: !172, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!172 = !DISubroutineType(types: !173)
!173 = !{!49, !5, !51}
!174 = !DISubprogram(name: "fadvise", scope: !21, file: !21, line: 72, type: !175, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!175 = !DISubroutineType(types: !176)
!176 = !{null, !59, !20}
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!179 = !DISubprogram(name: "fwrite_unlocked", scope: !56, file: !56, line: 675, type: !180, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!180 = !DISubroutineType(types: !181)
!181 = !{!110, !182, !110, !110, !59}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "COST", file: !3, line: 64, baseType: !84)
!185 = !{!186, !189, !191, !193, !194, !196, !198, !200, !202, !204, !206, !211, !213, !215, !217, !219, !221, !223, !225, !227, !229, !234, !236, !255}
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "crown", scope: !2, file: !3, line: 174, type: !188, isLocal: true, isDefinition: true)
!188 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(name: "tagged", scope: !2, file: !3, line: 177, type: !188, isLocal: true, isDefinition: true)
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(name: "split", scope: !2, file: !3, line: 180, type: !188, isLocal: true, isDefinition: true)
!193 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(name: "prefix", scope: !2, file: !3, line: 186, type: !51, isLocal: true, isDefinition: true)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "max_width", scope: !2, file: !3, line: 190, type: !53, isLocal: true, isDefinition: true)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(name: "prefix_full_length", scope: !2, file: !3, line: 195, type: !53, isLocal: true, isDefinition: true)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(name: "prefix_lead_space", scope: !2, file: !3, line: 198, type: !53, isLocal: true, isDefinition: true)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(name: "prefix_length", scope: !2, file: !3, line: 201, type: !53, isLocal: true, isDefinition: true)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(name: "goal_width", scope: !2, file: !3, line: 204, type: !53, isLocal: true, isDefinition: true)
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 302, type: !208, isLocal: true, isDefinition: true)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 2560, elements: !209)
!209 = !{!210}
!210 = !DISubrange(count: 10)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "tabs", scope: !2, file: !3, line: 232, type: !188, isLocal: true, isDefinition: true)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(name: "other_indent", scope: !2, file: !3, line: 241, type: !53, isLocal: true, isDefinition: true)
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(name: "in_column", scope: !2, file: !3, line: 209, type: !53, isLocal: true, isDefinition: true)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(name: "next_prefix_indent", scope: !2, file: !3, line: 255, type: !53, isLocal: true, isDefinition: true)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(name: "next_char", scope: !2, file: !3, line: 251, type: !53, isLocal: true, isDefinition: true)
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(name: "last_line_length", scope: !2, file: !3, line: 260, type: !53, isLocal: true, isDefinition: true)
!223 = !DIGlobalVariableExpression(var: !224, expr: !DIExpression())
!224 = distinct !DIGlobalVariable(name: "out_column", scope: !2, file: !3, line: 212, type: !53, isLocal: true, isDefinition: true)
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression())
!226 = distinct !DIGlobalVariable(name: "prefix_indent", scope: !2, file: !3, line: 235, type: !53, isLocal: true, isDefinition: true)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(name: "first_indent", scope: !2, file: !3, line: 238, type: !53, isLocal: true, isDefinition: true)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(name: "parabuf", scope: !2, file: !3, line: 216, type: !231, isLocal: true, isDefinition: true)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 40000, elements: !232)
!232 = !{!233}
!233 = !DISubrange(count: 5000)
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(name: "wptr", scope: !2, file: !3, line: 219, type: !49, isLocal: true, isDefinition: true)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(name: "unused_word_type", scope: !2, file: !3, line: 223, type: !238, isLocal: true, isDefinition: true)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 320000, elements: !253)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "WORD", file: !3, line: 129, baseType: !240)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Word", file: !3, line: 131, size: 320, elements: !241)
!241 = !{!242, !243, !244, !245, !246, !247, !248, !249, !250, !251}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !240, file: !3, line: 136, baseType: !51, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !240, file: !3, line: 137, baseType: !53, size: 32, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !240, file: !3, line: 138, baseType: !53, size: 32, offset: 96)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "paren", scope: !240, file: !3, line: 139, baseType: !7, size: 1, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !240, file: !3, line: 140, baseType: !7, size: 1, offset: 129, flags: DIFlagBitField, extraData: i64 128)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "punct", scope: !240, file: !3, line: 141, baseType: !7, size: 1, offset: 130, flags: DIFlagBitField, extraData: i64 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !240, file: !3, line: 142, baseType: !7, size: 1, offset: 131, flags: DIFlagBitField, extraData: i64 128)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "line_length", scope: !240, file: !3, line: 146, baseType: !53, size: 32, offset: 160)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "best_cost", scope: !240, file: !3, line: 147, baseType: !184, size: 64, offset: 192)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "next_break", scope: !240, file: !3, line: 148, baseType: !252, size: 64, offset: 256)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!253 = !{!254}
!254 = !DISubrange(count: 1000)
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "word_limit", scope: !2, file: !3, line: 228, type: !252, isLocal: true, isDefinition: true)
!257 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!258 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!259 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!260 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(name: "Version", scope: !263, file: !264, line: 2, type: !51, isDefinition: true)
!263 = distinct !DICompileUnit(language: DW_LANG_C99, file: !264, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !54, globals: !265, nameTableKind: None)
!264 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!265 = !{!261}
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "file_name", scope: !268, file: !269, line: 46, type: !51, isLocal: true, isDefinition: true)
!268 = distinct !DICompileUnit(language: DW_LANG_C99, file: !269, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !54, retainedTypes: !270, globals: !308, nameTableKind: None)
!269 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!270 = !{!271, !45, !307, !152}
!271 = !DISubprogram(name: "close_stream", scope: !272, file: !272, line: 2, type: !273, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!272 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!273 = !DISubroutineType(types: !274)
!274 = !{!53, !275}
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !61, line: 49, size: 1728, elements: !277)
!277 = !{!278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !276, file: !61, line: 51, baseType: !53, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !276, file: !61, line: 54, baseType: !49, size: 64, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !276, file: !61, line: 55, baseType: !49, size: 64, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !276, file: !61, line: 56, baseType: !49, size: 64, offset: 192)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !276, file: !61, line: 57, baseType: !49, size: 64, offset: 256)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !276, file: !61, line: 58, baseType: !49, size: 64, offset: 320)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !276, file: !61, line: 59, baseType: !49, size: 64, offset: 384)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !276, file: !61, line: 60, baseType: !49, size: 64, offset: 448)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !276, file: !61, line: 61, baseType: !49, size: 64, offset: 512)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !276, file: !61, line: 64, baseType: !49, size: 64, offset: 576)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !276, file: !61, line: 65, baseType: !49, size: 64, offset: 640)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !276, file: !61, line: 66, baseType: !49, size: 64, offset: 704)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !276, file: !61, line: 68, baseType: !76, size: 64, offset: 768)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !276, file: !61, line: 70, baseType: !275, size: 64, offset: 832)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !276, file: !61, line: 72, baseType: !53, size: 32, offset: 896)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !276, file: !61, line: 73, baseType: !53, size: 32, offset: 928)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !276, file: !61, line: 74, baseType: !82, size: 64, offset: 960)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !276, file: !61, line: 77, baseType: !86, size: 16, offset: 1024)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !276, file: !61, line: 78, baseType: !88, size: 8, offset: 1040)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !276, file: !61, line: 79, baseType: !90, size: 8, offset: 1048)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !276, file: !61, line: 81, baseType: !94, size: 64, offset: 1088)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !276, file: !61, line: 89, baseType: !97, size: 64, offset: 1152)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !276, file: !61, line: 91, baseType: !99, size: 64, offset: 1216)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !276, file: !61, line: 92, baseType: !102, size: 64, offset: 1280)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !276, file: !61, line: 93, baseType: !275, size: 64, offset: 1344)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !276, file: !61, line: 94, baseType: !106, size: 64, offset: 1408)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !276, file: !61, line: 95, baseType: !108, size: 64, offset: 1472)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !276, file: !61, line: 96, baseType: !53, size: 32, offset: 1536)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !276, file: !61, line: 98, baseType: !113, size: 160, offset: 1568)
!307 = !DISubprogram(name: "quotearg_colon", scope: !6, file: !6, line: 391, type: !128, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!308 = !{!266, !309}
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !268, file: !269, line: 56, type: !188, isLocal: true, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(name: "exit_failure", scope: !313, file: !314, line: 24, type: !316, isDefinition: true)
!313 = distinct !DICompileUnit(language: DW_LANG_C99, file: !314, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !54, globals: !315, nameTableKind: None)
!314 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!315 = !{!311}
!316 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !53)
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(name: "program_name", scope: !319, file: !320, line: 33, type: !51, isDefinition: true)
!319 = distinct !DICompileUnit(language: DW_LANG_C99, file: !320, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !54, retainedTypes: !321, globals: !357, nameTableKind: None)
!320 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!321 = !{!106, !322, !49}
!322 = !DISubprogram(name: "fputs", scope: !56, file: !56, line: 626, type: !323, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!323 = !DISubroutineType(types: !324)
!324 = !{!53, !51, !325}
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !61, line: 49, size: 1728, elements: !327)
!327 = !{!328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !326, file: !61, line: 51, baseType: !53, size: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !326, file: !61, line: 54, baseType: !49, size: 64, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !326, file: !61, line: 55, baseType: !49, size: 64, offset: 128)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !326, file: !61, line: 56, baseType: !49, size: 64, offset: 192)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !326, file: !61, line: 57, baseType: !49, size: 64, offset: 256)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !326, file: !61, line: 58, baseType: !49, size: 64, offset: 320)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !326, file: !61, line: 59, baseType: !49, size: 64, offset: 384)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !326, file: !61, line: 60, baseType: !49, size: 64, offset: 448)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !326, file: !61, line: 61, baseType: !49, size: 64, offset: 512)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !326, file: !61, line: 64, baseType: !49, size: 64, offset: 576)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !326, file: !61, line: 65, baseType: !49, size: 64, offset: 640)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !326, file: !61, line: 66, baseType: !49, size: 64, offset: 704)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !326, file: !61, line: 68, baseType: !76, size: 64, offset: 768)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !326, file: !61, line: 70, baseType: !325, size: 64, offset: 832)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !326, file: !61, line: 72, baseType: !53, size: 32, offset: 896)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !326, file: !61, line: 73, baseType: !53, size: 32, offset: 928)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !326, file: !61, line: 74, baseType: !82, size: 64, offset: 960)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !326, file: !61, line: 77, baseType: !86, size: 16, offset: 1024)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !326, file: !61, line: 78, baseType: !88, size: 8, offset: 1040)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !326, file: !61, line: 79, baseType: !90, size: 8, offset: 1048)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !326, file: !61, line: 81, baseType: !94, size: 64, offset: 1088)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !326, file: !61, line: 89, baseType: !97, size: 64, offset: 1152)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !326, file: !61, line: 91, baseType: !99, size: 64, offset: 1216)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !326, file: !61, line: 92, baseType: !102, size: 64, offset: 1280)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !326, file: !61, line: 93, baseType: !325, size: 64, offset: 1344)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !326, file: !61, line: 94, baseType: !106, size: 64, offset: 1408)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !326, file: !61, line: 95, baseType: !108, size: 64, offset: 1472)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !326, file: !61, line: 96, baseType: !53, size: 32, offset: 1536)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !326, file: !61, line: 98, baseType: !113, size: 160, offset: 1568)
!357 = !{!317}
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !360, file: !361, line: 85, type: !462, isDefinition: true)
!360 = distinct !DICompileUnit(language: DW_LANG_C99, file: !361, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !362, retainedTypes: !368, globals: !437, nameTableKind: None)
!361 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!362 = !{!5, !363, !29}
!363 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, baseType: !7, size: 32, elements: !364)
!364 = !{!365, !366, !367}
!365 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!366 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!367 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!368 = !{!369, !373, !389, !392, !53, !86, !395, !108, !412, !416, !45, !422, !426, !49, !430, !433, !434}
!369 = !DISubprogram(name: "xmemdup", scope: !370, file: !370, line: 62, type: !371, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!370 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!371 = !DISubroutineType(types: !372)
!372 = !{!106, !182, !110}
!373 = !DISubprogram(name: "quotearg_alloc_mem", scope: !6, file: !6, line: 342, type: !374, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!374 = !DISubroutineType(types: !375)
!375 = !{!49, !51, !110, !376, !377}
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !379)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !361, line: 65, size: 448, elements: !380)
!380 = !{!381, !382, !383, !387, !388}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !379, file: !361, line: 68, baseType: !5, size: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !379, file: !361, line: 71, baseType: !53, size: 32, offset: 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !379, file: !361, line: 75, baseType: !384, size: 256, offset: 64)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !385)
!385 = !{!386}
!386 = !DISubrange(count: 8)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !379, file: !361, line: 78, baseType: !51, size: 64, offset: 320)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !379, file: !361, line: 81, baseType: !51, size: 64, offset: 384)
!389 = !DISubprogram(name: "free", scope: !131, file: !131, line: 565, type: !390, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!390 = !DISubroutineType(types: !391)
!391 = !{null, !106}
!392 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !6, file: !6, line: 408, type: !393, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!393 = !DISubroutineType(types: !394)
!394 = !{!49, !53, !51, !51, !51, !110}
!395 = !DISubprogram(name: "rpl_mbrtowc", scope: !396, file: !396, line: 717, type: !397, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!396 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!397 = !DISubroutineType(types: !398)
!398 = !{!110, !150, !51, !110, !399}
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !401, line: 13, size: 64, elements: !402)
!401 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!402 = !{!403, !404}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !400, file: !401, line: 15, baseType: !53, size: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !400, file: !401, line: 20, baseType: !405, size: 32, offset: 32)
!405 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !400, file: !401, line: 16, size: 32, elements: !406)
!406 = !{!407, !408}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !405, file: !401, line: 18, baseType: !7, size: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !405, file: !401, line: 19, baseType: !409, size: 32)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 32, elements: !410)
!410 = !{!411}
!411 = !DISubrange(count: 4)
!412 = !DISubprogram(name: "iswprint", scope: !413, file: !413, line: 120, type: !414, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!413 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!414 = !DISubroutineType(types: !415)
!415 = !{!53, !7}
!416 = !DISubprogram(name: "mbsinit", scope: !417, file: !417, line: 292, type: !418, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!417 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!418 = !DISubroutineType(types: !419)
!419 = !{!53, !420}
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !400)
!422 = !DISubprogram(name: "locale_charset", scope: !423, file: !423, line: 35, type: !424, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!423 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!424 = !DISubroutineType(types: !425)
!425 = !{!51}
!426 = !DISubprogram(name: "c_strcasecmp", scope: !427, file: !427, line: 42, type: !428, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!427 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!428 = !DISubroutineType(types: !429)
!429 = !{!53, !51, !51}
!430 = !DISubprogram(name: "xmalloc", scope: !370, file: !370, line: 53, type: !431, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!431 = !DISubroutineType(types: !432)
!432 = !{!106, !110}
!433 = !DISubprogram(name: "xalloc_die", scope: !370, file: !370, line: 51, type: !135, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !54)
!434 = !DISubprogram(name: "xrealloc", scope: !370, file: !370, line: 59, type: !435, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!435 = !DISubroutineType(types: !436)
!436 = !{!106, !106, !110}
!437 = !{!358, !438, !442, !444, !446, !451, !458, !460}
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !360, file: !361, line: 101, type: !440, isDefinition: true)
!440 = !DICompositeType(tag: DW_TAG_array_type, baseType: !441, size: 320, elements: !209)
!441 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !360, file: !361, line: 1052, type: !379, isDefinition: true)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !360, file: !361, line: 116, type: !379, isLocal: true, isDefinition: true)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "slot0", scope: !360, file: !361, line: 842, type: !448, isLocal: true, isDefinition: true)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 2048, elements: !449)
!449 = !{!450}
!450 = !DISubrange(count: 256)
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(name: "slotvec", scope: !360, file: !361, line: 845, type: !453, isLocal: true, isDefinition: true)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !361, line: 834, size: 128, elements: !455)
!455 = !{!456, !457}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !454, file: !361, line: 836, baseType: !108, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !454, file: !361, line: 837, baseType: !49, size: 64, offset: 64)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(name: "nslots", scope: !360, file: !361, line: 843, type: !53, isLocal: true, isDefinition: true)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(name: "slotvec0", scope: !360, file: !361, line: 844, type: !454, isLocal: true, isDefinition: true)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !463, size: 704, elements: !464)
!463 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!464 = !{!465}
!465 = !DISubrange(count: 11)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !468, file: !469, line: 26, type: !471, isDefinition: true)
!468 = distinct !DICompileUnit(language: DW_LANG_C99, file: !469, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !54, globals: !470, nameTableKind: None)
!469 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!470 = !{!466}
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 376, elements: !472)
!472 = !{!473}
!473 = !DISubrange(count: 47)
!474 = distinct !DICompileUnit(language: DW_LANG_C99, file: !475, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !476, retainedTypes: !477, nameTableKind: None)
!475 = !DIFile(filename: "lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!476 = !{!20}
!477 = !{!478, !482}
!478 = !DISubprogram(name: "posix_fadvise", scope: !479, file: !479, line: 288, type: !480, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!479 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
!480 = !DISubroutineType(types: !481)
!481 = !{!53, !53, !84, !84, !53}
!482 = !DISubprogram(name: "fileno", scope: !56, file: !56, line: 786, type: !483, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!483 = !DISubroutineType(types: !484)
!484 = !{!53, !485}
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !61, line: 49, size: 1728, elements: !487)
!487 = !{!488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !486, file: !61, line: 51, baseType: !53, size: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !486, file: !61, line: 54, baseType: !49, size: 64, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !486, file: !61, line: 55, baseType: !49, size: 64, offset: 128)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !486, file: !61, line: 56, baseType: !49, size: 64, offset: 192)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !486, file: !61, line: 57, baseType: !49, size: 64, offset: 256)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !486, file: !61, line: 58, baseType: !49, size: 64, offset: 320)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !486, file: !61, line: 59, baseType: !49, size: 64, offset: 384)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !486, file: !61, line: 60, baseType: !49, size: 64, offset: 448)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !486, file: !61, line: 61, baseType: !49, size: 64, offset: 512)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !486, file: !61, line: 64, baseType: !49, size: 64, offset: 576)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !486, file: !61, line: 65, baseType: !49, size: 64, offset: 640)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !486, file: !61, line: 66, baseType: !49, size: 64, offset: 704)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !486, file: !61, line: 68, baseType: !76, size: 64, offset: 768)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !486, file: !61, line: 70, baseType: !485, size: 64, offset: 832)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !486, file: !61, line: 72, baseType: !53, size: 32, offset: 896)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !486, file: !61, line: 73, baseType: !53, size: 32, offset: 928)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !486, file: !61, line: 74, baseType: !82, size: 64, offset: 960)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !486, file: !61, line: 77, baseType: !86, size: 16, offset: 1024)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !486, file: !61, line: 78, baseType: !88, size: 8, offset: 1040)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !486, file: !61, line: 79, baseType: !90, size: 8, offset: 1048)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !486, file: !61, line: 81, baseType: !94, size: 64, offset: 1088)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !486, file: !61, line: 89, baseType: !97, size: 64, offset: 1152)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !486, file: !61, line: 91, baseType: !99, size: 64, offset: 1216)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !486, file: !61, line: 92, baseType: !102, size: 64, offset: 1280)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !486, file: !61, line: 93, baseType: !485, size: 64, offset: 1344)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !486, file: !61, line: 94, baseType: !106, size: 64, offset: 1408)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !486, file: !61, line: 95, baseType: !108, size: 64, offset: 1472)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !486, file: !61, line: 96, baseType: !53, size: 32, offset: 1536)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !486, file: !61, line: 98, baseType: !113, size: 160, offset: 1568)
!517 = distinct !DICompileUnit(language: DW_LANG_C99, file: !518, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !519, retainedTypes: !523, nameTableKind: None)
!518 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!519 = !{!520}
!520 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !518, line: 40, baseType: !7, size: 32, elements: !521)
!521 = !{!522}
!522 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!523 = !{!45, !524, !106}
!524 = !DISubprogram(name: "fputs_unlocked", scope: !56, file: !56, line: 662, type: !525, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!525 = !DISubroutineType(types: !526)
!526 = !{!53, !51, !527}
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !61, line: 49, size: 1728, elements: !529)
!529 = !{!530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !528, file: !61, line: 51, baseType: !53, size: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !528, file: !61, line: 54, baseType: !49, size: 64, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !528, file: !61, line: 55, baseType: !49, size: 64, offset: 128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !528, file: !61, line: 56, baseType: !49, size: 64, offset: 192)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !528, file: !61, line: 57, baseType: !49, size: 64, offset: 256)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !528, file: !61, line: 58, baseType: !49, size: 64, offset: 320)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !528, file: !61, line: 59, baseType: !49, size: 64, offset: 384)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !528, file: !61, line: 60, baseType: !49, size: 64, offset: 448)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !528, file: !61, line: 61, baseType: !49, size: 64, offset: 512)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !528, file: !61, line: 64, baseType: !49, size: 64, offset: 576)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !528, file: !61, line: 65, baseType: !49, size: 64, offset: 640)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !528, file: !61, line: 66, baseType: !49, size: 64, offset: 704)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !528, file: !61, line: 68, baseType: !76, size: 64, offset: 768)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !528, file: !61, line: 70, baseType: !527, size: 64, offset: 832)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !528, file: !61, line: 72, baseType: !53, size: 32, offset: 896)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !528, file: !61, line: 73, baseType: !53, size: 32, offset: 928)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !528, file: !61, line: 74, baseType: !82, size: 64, offset: 960)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !528, file: !61, line: 77, baseType: !86, size: 16, offset: 1024)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !528, file: !61, line: 78, baseType: !88, size: 8, offset: 1040)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !528, file: !61, line: 79, baseType: !90, size: 8, offset: 1048)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !528, file: !61, line: 81, baseType: !94, size: 64, offset: 1088)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !528, file: !61, line: 89, baseType: !97, size: 64, offset: 1152)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !528, file: !61, line: 91, baseType: !99, size: 64, offset: 1216)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !528, file: !61, line: 92, baseType: !102, size: 64, offset: 1280)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !528, file: !61, line: 93, baseType: !527, size: 64, offset: 1344)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !528, file: !61, line: 94, baseType: !106, size: 64, offset: 1408)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !528, file: !61, line: 95, baseType: !108, size: 64, offset: 1472)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !528, file: !61, line: 96, baseType: !53, size: 32, offset: 1536)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !528, file: !61, line: 98, baseType: !113, size: 160, offset: 1568)
!559 = distinct !DICompileUnit(language: DW_LANG_C99, file: !560, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !561, retainedTypes: !574, nameTableKind: None)
!560 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!561 = !{!562}
!562 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !563, file: !370, line: 186, baseType: !7, size: 32, elements: !572)
!563 = distinct !DISubprogram(name: "x2nrealloc", scope: !370, file: !370, line: 174, type: !564, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !559, retainedNodes: !567)
!564 = !DISubroutineType(types: !565)
!565 = !{!106, !106, !566, !108}
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!567 = !{!568, !569, !570, !571}
!568 = !DILocalVariable(name: "p", arg: 1, scope: !563, file: !370, line: 174, type: !106)
!569 = !DILocalVariable(name: "pn", arg: 2, scope: !563, file: !370, line: 174, type: !566)
!570 = !DILocalVariable(name: "s", arg: 3, scope: !563, file: !370, line: 174, type: !108)
!571 = !DILocalVariable(name: "n", scope: !563, file: !370, line: 176, type: !108)
!572 = !{!573}
!573 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!574 = !{!108, !433, !430, !434, !49, !389, !106, !575, !578}
!575 = !DISubprogram(name: "xcalloc", scope: !370, file: !370, line: 57, type: !576, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!576 = !DISubroutineType(types: !577)
!577 = !{!106, !110, !110}
!578 = !DISubprogram(name: "rpl_calloc", scope: !579, file: !579, line: 688, type: !576, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!579 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!580 = distinct !DICompileUnit(language: DW_LANG_C99, file: !581, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !54, retainedTypes: !582, nameTableKind: None)
!581 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!582 = !{!45, !152}
!583 = distinct !DICompileUnit(language: DW_LANG_C99, file: !584, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !585, retainedTypes: !594, nameTableKind: None)
!584 = !DIFile(filename: "lib/xdectoumax.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!585 = !{!586}
!586 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !587, line: 25, baseType: !7, size: 32, elements: !588)
!587 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!588 = !{!589, !590, !591, !592, !593}
!589 = !DIEnumerator(name: "LONGINT_OK", value: 0, isUnsigned: true)
!590 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1, isUnsigned: true)
!591 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2, isUnsigned: true)
!592 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3, isUnsigned: true)
!593 = !DIEnumerator(name: "LONGINT_INVALID", value: 4, isUnsigned: true)
!594 = !{!595, !599, !152}
!595 = !DISubprogram(name: "xstrtoumax", scope: !587, file: !587, line: 48, type: !596, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!596 = !DISubroutineType(types: !597)
!597 = !{!586, !51, !598, !53, !376, !51}
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!599 = !DISubprogram(name: "quote", scope: !600, file: !600, line: 44, type: !601, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!600 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!601 = !DISubroutineType(types: !602)
!602 = !{!51, !51}
!603 = distinct !DICompileUnit(language: DW_LANG_C99, file: !604, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !605, retainedTypes: !606, nameTableKind: None)
!604 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!605 = !{!586, !29}
!606 = !{!53, !86}
!607 = distinct !DICompileUnit(language: DW_LANG_C99, file: !608, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !54, retainedTypes: !609, nameTableKind: None)
!608 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!609 = !{!106}
!610 = distinct !DICompileUnit(language: DW_LANG_C99, file: !611, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !54, retainedTypes: !612, nameTableKind: None)
!611 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!612 = !{!613, !648, !649, !653}
!613 = !DISubprogram(name: "fileno", scope: !56, file: !56, line: 786, type: !614, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!614 = !DISubroutineType(types: !615)
!615 = !{!53, !616}
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !61, line: 49, size: 1728, elements: !618)
!618 = !{!619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !617, file: !61, line: 51, baseType: !53, size: 32)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !617, file: !61, line: 54, baseType: !49, size: 64, offset: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !617, file: !61, line: 55, baseType: !49, size: 64, offset: 128)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !617, file: !61, line: 56, baseType: !49, size: 64, offset: 192)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !617, file: !61, line: 57, baseType: !49, size: 64, offset: 256)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !617, file: !61, line: 58, baseType: !49, size: 64, offset: 320)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !617, file: !61, line: 59, baseType: !49, size: 64, offset: 384)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !617, file: !61, line: 60, baseType: !49, size: 64, offset: 448)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !617, file: !61, line: 61, baseType: !49, size: 64, offset: 512)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !617, file: !61, line: 64, baseType: !49, size: 64, offset: 576)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !617, file: !61, line: 65, baseType: !49, size: 64, offset: 640)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !617, file: !61, line: 66, baseType: !49, size: 64, offset: 704)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !617, file: !61, line: 68, baseType: !76, size: 64, offset: 768)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !617, file: !61, line: 70, baseType: !616, size: 64, offset: 832)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !617, file: !61, line: 72, baseType: !53, size: 32, offset: 896)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !617, file: !61, line: 73, baseType: !53, size: 32, offset: 928)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !617, file: !61, line: 74, baseType: !82, size: 64, offset: 960)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !617, file: !61, line: 77, baseType: !86, size: 16, offset: 1024)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !617, file: !61, line: 78, baseType: !88, size: 8, offset: 1040)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !617, file: !61, line: 79, baseType: !90, size: 8, offset: 1048)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !617, file: !61, line: 81, baseType: !94, size: 64, offset: 1088)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !617, file: !61, line: 89, baseType: !97, size: 64, offset: 1152)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !617, file: !61, line: 91, baseType: !99, size: 64, offset: 1216)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !617, file: !61, line: 92, baseType: !102, size: 64, offset: 1280)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !617, file: !61, line: 93, baseType: !616, size: 64, offset: 1344)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !617, file: !61, line: 94, baseType: !106, size: 64, offset: 1408)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !617, file: !61, line: 95, baseType: !108, size: 64, offset: 1472)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !617, file: !61, line: 96, baseType: !53, size: 32, offset: 1536)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !617, file: !61, line: 98, baseType: !113, size: 160, offset: 1568)
!648 = !DISubprogram(name: "fclose", scope: !56, file: !56, line: 213, type: !614, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!649 = !DISubprogram(name: "lseek", scope: !650, file: !650, line: 334, type: !651, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!650 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!651 = !DISubroutineType(types: !652)
!652 = !{!84, !53, !84, !53}
!653 = !DISubprogram(name: "rpl_fflush", scope: !165, file: !165, line: 718, type: !614, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!654 = distinct !DICompileUnit(language: DW_LANG_C99, file: !655, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !54, retainedTypes: !656, nameTableKind: None)
!655 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!656 = !{!106, !657, !692}
!657 = !DISubprogram(name: "fflush", scope: !56, file: !56, line: 218, type: !658, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!658 = !DISubroutineType(types: !659)
!659 = !{!53, !660}
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !61, line: 49, size: 1728, elements: !662)
!662 = !{!663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !661, file: !61, line: 51, baseType: !53, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !661, file: !61, line: 54, baseType: !49, size: 64, offset: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !661, file: !61, line: 55, baseType: !49, size: 64, offset: 128)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !661, file: !61, line: 56, baseType: !49, size: 64, offset: 192)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !661, file: !61, line: 57, baseType: !49, size: 64, offset: 256)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !661, file: !61, line: 58, baseType: !49, size: 64, offset: 320)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !661, file: !61, line: 59, baseType: !49, size: 64, offset: 384)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !661, file: !61, line: 60, baseType: !49, size: 64, offset: 448)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !661, file: !61, line: 61, baseType: !49, size: 64, offset: 512)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !661, file: !61, line: 64, baseType: !49, size: 64, offset: 576)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !661, file: !61, line: 65, baseType: !49, size: 64, offset: 640)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !661, file: !61, line: 66, baseType: !49, size: 64, offset: 704)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !661, file: !61, line: 68, baseType: !76, size: 64, offset: 768)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !661, file: !61, line: 70, baseType: !660, size: 64, offset: 832)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !661, file: !61, line: 72, baseType: !53, size: 32, offset: 896)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !661, file: !61, line: 73, baseType: !53, size: 32, offset: 928)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !661, file: !61, line: 74, baseType: !82, size: 64, offset: 960)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !661, file: !61, line: 77, baseType: !86, size: 16, offset: 1024)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !661, file: !61, line: 78, baseType: !88, size: 8, offset: 1040)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !661, file: !61, line: 79, baseType: !90, size: 8, offset: 1048)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !661, file: !61, line: 81, baseType: !94, size: 64, offset: 1088)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !661, file: !61, line: 89, baseType: !97, size: 64, offset: 1152)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !661, file: !61, line: 91, baseType: !99, size: 64, offset: 1216)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !661, file: !61, line: 92, baseType: !102, size: 64, offset: 1280)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !661, file: !61, line: 93, baseType: !660, size: 64, offset: 1344)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !661, file: !61, line: 94, baseType: !106, size: 64, offset: 1408)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !661, file: !61, line: 95, baseType: !108, size: 64, offset: 1472)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !661, file: !61, line: 96, baseType: !53, size: 32, offset: 1536)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !661, file: !61, line: 98, baseType: !113, size: 160, offset: 1568)
!692 = !DISubprogram(name: "rpl_fseeko", scope: !165, file: !165, line: 1034, type: !693, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!693 = !DISubroutineType(types: !694)
!694 = !{!53, !660, !84, !53}
!695 = distinct !DICompileUnit(language: DW_LANG_C99, file: !696, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !54, retainedTypes: !697, nameTableKind: None)
!696 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!697 = !{!106, !698, !649, !733}
!698 = !DISubprogram(name: "fileno", scope: !56, file: !56, line: 786, type: !699, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!699 = !DISubroutineType(types: !700)
!700 = !{!53, !701}
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !61, line: 49, size: 1728, elements: !703)
!703 = !{!704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !702, file: !61, line: 51, baseType: !53, size: 32)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !702, file: !61, line: 54, baseType: !49, size: 64, offset: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !702, file: !61, line: 55, baseType: !49, size: 64, offset: 128)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !702, file: !61, line: 56, baseType: !49, size: 64, offset: 192)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !702, file: !61, line: 57, baseType: !49, size: 64, offset: 256)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !702, file: !61, line: 58, baseType: !49, size: 64, offset: 320)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !702, file: !61, line: 59, baseType: !49, size: 64, offset: 384)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !702, file: !61, line: 60, baseType: !49, size: 64, offset: 448)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !702, file: !61, line: 61, baseType: !49, size: 64, offset: 512)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !702, file: !61, line: 64, baseType: !49, size: 64, offset: 576)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !702, file: !61, line: 65, baseType: !49, size: 64, offset: 640)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !702, file: !61, line: 66, baseType: !49, size: 64, offset: 704)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !702, file: !61, line: 68, baseType: !76, size: 64, offset: 768)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !702, file: !61, line: 70, baseType: !701, size: 64, offset: 832)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !702, file: !61, line: 72, baseType: !53, size: 32, offset: 896)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !702, file: !61, line: 73, baseType: !53, size: 32, offset: 928)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !702, file: !61, line: 74, baseType: !82, size: 64, offset: 960)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !702, file: !61, line: 77, baseType: !86, size: 16, offset: 1024)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !702, file: !61, line: 78, baseType: !88, size: 8, offset: 1040)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !702, file: !61, line: 79, baseType: !90, size: 8, offset: 1048)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !702, file: !61, line: 81, baseType: !94, size: 64, offset: 1088)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !702, file: !61, line: 89, baseType: !97, size: 64, offset: 1152)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !702, file: !61, line: 91, baseType: !99, size: 64, offset: 1216)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !702, file: !61, line: 92, baseType: !102, size: 64, offset: 1280)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !702, file: !61, line: 93, baseType: !701, size: 64, offset: 1344)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !702, file: !61, line: 94, baseType: !106, size: 64, offset: 1408)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !702, file: !61, line: 95, baseType: !108, size: 64, offset: 1472)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !702, file: !61, line: 96, baseType: !53, size: 32, offset: 1536)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !702, file: !61, line: 98, baseType: !113, size: 160, offset: 1568)
!733 = !DISubprogram(name: "fseeko", scope: !56, file: !56, line: 707, type: !734, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!734 = !DISubroutineType(types: !735)
!735 = !{!53, !701, !84, !53}
!736 = distinct !DICompileUnit(language: DW_LANG_C99, file: !737, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !54, retainedTypes: !738, nameTableKind: None)
!737 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!738 = !{!739, !108, !751}
!739 = !DISubprogram(name: "mbrtowc", scope: !417, file: !417, line: 296, type: !740, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!740 = !DISubroutineType(types: !741)
!741 = !{!110, !150, !51, !110, !742}
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !401, line: 13, size: 64, elements: !744)
!744 = !{!745, !746}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !743, file: !401, line: 15, baseType: !53, size: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !743, file: !401, line: 20, baseType: !747, size: 32, offset: 32)
!747 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !743, file: !401, line: 16, size: 32, elements: !748)
!748 = !{!749, !750}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !747, file: !401, line: 18, baseType: !7, size: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !747, file: !401, line: 19, baseType: !409, size: 32)
!751 = !DISubprogram(name: "hard_locale", scope: !752, file: !752, line: 26, type: !753, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!752 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!753 = !DISubroutineType(types: !754)
!754 = !{!188, !53}
!755 = distinct !DICompileUnit(language: DW_LANG_C99, file: !756, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !54, retainedTypes: !757, nameTableKind: None)
!756 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!757 = !{!758}
!758 = !DISubprogram(name: "rpl_fclose", scope: !165, file: !165, line: 672, type: !759, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!759 = !DISubroutineType(types: !760)
!760 = !{!53, !761}
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !61, line: 49, size: 1728, elements: !763)
!763 = !{!764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !762, file: !61, line: 51, baseType: !53, size: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !762, file: !61, line: 54, baseType: !49, size: 64, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !762, file: !61, line: 55, baseType: !49, size: 64, offset: 128)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !762, file: !61, line: 56, baseType: !49, size: 64, offset: 192)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !762, file: !61, line: 57, baseType: !49, size: 64, offset: 256)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !762, file: !61, line: 58, baseType: !49, size: 64, offset: 320)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !762, file: !61, line: 59, baseType: !49, size: 64, offset: 384)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !762, file: !61, line: 60, baseType: !49, size: 64, offset: 448)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !762, file: !61, line: 61, baseType: !49, size: 64, offset: 512)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !762, file: !61, line: 64, baseType: !49, size: 64, offset: 576)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !762, file: !61, line: 65, baseType: !49, size: 64, offset: 640)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !762, file: !61, line: 66, baseType: !49, size: 64, offset: 704)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !762, file: !61, line: 68, baseType: !76, size: 64, offset: 768)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !762, file: !61, line: 70, baseType: !761, size: 64, offset: 832)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !762, file: !61, line: 72, baseType: !53, size: 32, offset: 896)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !762, file: !61, line: 73, baseType: !53, size: 32, offset: 928)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !762, file: !61, line: 74, baseType: !82, size: 64, offset: 960)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !762, file: !61, line: 77, baseType: !86, size: 16, offset: 1024)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !762, file: !61, line: 78, baseType: !88, size: 8, offset: 1040)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !762, file: !61, line: 79, baseType: !90, size: 8, offset: 1048)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !762, file: !61, line: 81, baseType: !94, size: 64, offset: 1088)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !762, file: !61, line: 89, baseType: !97, size: 64, offset: 1152)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !762, file: !61, line: 91, baseType: !99, size: 64, offset: 1216)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !762, file: !61, line: 92, baseType: !102, size: 64, offset: 1280)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !762, file: !61, line: 93, baseType: !761, size: 64, offset: 1344)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !762, file: !61, line: 94, baseType: !106, size: 64, offset: 1408)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !762, file: !61, line: 95, baseType: !108, size: 64, offset: 1472)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !762, file: !61, line: 96, baseType: !53, size: 32, offset: 1536)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !762, file: !61, line: 98, baseType: !113, size: 160, offset: 1568)
!793 = distinct !DICompileUnit(language: DW_LANG_C99, file: !794, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !54, retainedTypes: !795, nameTableKind: None)
!794 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!795 = !{!796}
!796 = !DISubprogram(name: "setlocale_null_r", scope: !797, file: !797, line: 64, type: !798, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!797 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!798 = !DISubroutineType(types: !799)
!799 = !{!53, !53, !49, !110}
!800 = distinct !DICompileUnit(language: DW_LANG_C99, file: !801, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !802, retainedTypes: !1189, nameTableKind: None)
!801 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!802 = !{!803}
!803 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !804, line: 41, baseType: !7, size: 32, elements: !805)
!804 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!805 = !{!806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188}
!806 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!807 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!808 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!809 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!810 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!811 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!812 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!813 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!814 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!815 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!816 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!817 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!818 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!819 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!820 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!821 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!822 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!823 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!824 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!825 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!826 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!827 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!828 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!829 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!830 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!831 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!832 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!833 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!834 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!835 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!836 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!837 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!838 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!839 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!840 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!841 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!842 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!843 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!844 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!845 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!846 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!847 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!848 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!849 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!850 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!851 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!852 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!853 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!854 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!855 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!884 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!885 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!886 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!887 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!894 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!895 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!896 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!898 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!899 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!900 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!901 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!902 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!903 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!904 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!905 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!906 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!907 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!908 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!909 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!910 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!911 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!912 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!913 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!914 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!915 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!916 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!917 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!918 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!919 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!920 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!921 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!922 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!923 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!924 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!925 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!926 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!927 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!928 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!929 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!930 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!931 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!932 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!933 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!934 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!935 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!936 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!937 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!938 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!939 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!940 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!941 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!942 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!943 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!944 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
