source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [FILE]...\0A\00", align 1
@.str.2 = private unnamed_addr constant [60 x i8] c"Wrap input lines in each FILE, writing to standard output.\0A\00", align 1
@stdout = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str.14 = private unnamed_addr constant [56 x i8] c"\0AWith no FILE, or when FILE is -, read standard input.\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 45, type: !189, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !44, globals: !186, nameTableKind: None)
!3 = !DIFile(filename: "src/fold.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !20, !29}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!9 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 45, baseType: !7, size: 32, elements: !22)
!21 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!22 = !{!23, !24, !25, !26, !27, !28}
!23 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0, isUnsigned: true)
!24 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2, isUnsigned: true)
!25 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5, isUnsigned: true)
!26 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4, isUnsigned: true)
!27 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3, isUnsigned: true)
!28 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !30, line: 46, baseType: !7, size: 32, elements: !31)
!30 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!31 = !{!32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43}
!32 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!33 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!34 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!35 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!36 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!37 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!38 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!39 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!40 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!41 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!42 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!43 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!44 = !{!45, !55, !116, !120, !124, !127, !130, !137, !152, !49, !106, !156, !160, !164, !168, !171, !174, !108, !51, !179, !53, !86, !184, !185}
!45 = !DISubprogram(name: "dcgettext", scope: !46, file: !46, line: 51, type: !47, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!46 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!47 = !DISubroutineType(types: !48)
!48 = !{!49, !51, !51, !53}
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!53 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!54 = !{}
!55 = !DISubprogram(name: "fputs_unlocked", scope: !56, file: !56, line: 662, type: !57, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!56 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!57 = !DISubroutineType(types: !58)
!58 = !{!53, !51, !59}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !61, line: 49, size: 1728, elements: !62)
!61 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!62 = !{!63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !78, !79, !80, !81, !85, !87, !89, !93, !96, !98, !101, !104, !105, !107, !111, !112}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !60, file: !61, line: 51, baseType: !53, size: 32)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !60, file: !61, line: 54, baseType: !49, size: 64, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !60, file: !61, line: 55, baseType: !49, size: 64, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !60, file: !61, line: 56, baseType: !49, size: 64, offset: 192)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !60, file: !61, line: 57, baseType: !49, size: 64, offset: 256)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !60, file: !61, line: 58, baseType: !49, size: 64, offset: 320)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !60, file: !61, line: 59, baseType: !49, size: 64, offset: 384)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !60, file: !61, line: 60, baseType: !49, size: 64, offset: 448)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !60, file: !61, line: 61, baseType: !49, size: 64, offset: 512)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !60, file: !61, line: 64, baseType: !49, size: 64, offset: 576)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !60, file: !61, line: 65, baseType: !49, size: 64, offset: 640)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !60, file: !61, line: 66, baseType: !49, size: 64, offset: 704)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !60, file: !61, line: 68, baseType: !76, size: 64, offset: 768)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !61, line: 36, flags: DIFlagFwdDecl)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !60, file: !61, line: 70, baseType: !59, size: 64, offset: 832)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !60, file: !61, line: 72, baseType: !53, size: 32, offset: 896)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !60, file: !61, line: 73, baseType: !53, size: 32, offset: 928)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !60, file: !61, line: 74, baseType: !82, size: 64, offset: 960)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !83, line: 152, baseType: !84)
!83 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!84 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !60, file: !61, line: 77, baseType: !86, size: 16, offset: 1024)
!86 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !60, file: !61, line: 78, baseType: !88, size: 8, offset: 1040)
!88 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !60, file: !61, line: 79, baseType: !90, size: 8, offset: 1048)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 8, elements: !91)
!91 = !{!92}
!92 = !DISubrange(count: 1)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !60, file: !61, line: 81, baseType: !94, size: 64, offset: 1088)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !61, line: 43, baseType: null)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !60, file: !61, line: 89, baseType: !97, size: 64, offset: 1152)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !83, line: 153, baseType: !84)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !60, file: !61, line: 91, baseType: !99, size: 64, offset: 1216)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !61, line: 37, flags: DIFlagFwdDecl)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !60, file: !61, line: 92, baseType: !102, size: 64, offset: 1280)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !61, line: 38, flags: DIFlagFwdDecl)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !60, file: !61, line: 93, baseType: !59, size: 64, offset: 1344)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !60, file: !61, line: 94, baseType: !106, size: 64, offset: 1408)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !60, file: !61, line: 95, baseType: !108, size: 64, offset: 1472)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !109, line: 46, baseType: !110)
!109 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!110 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !60, file: !61, line: 96, baseType: !53, size: 32, offset: 1536)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !60, file: !61, line: 98, baseType: !113, size: 160, offset: 1568)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 160, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 20)
!116 = !DISubprogram(name: "set_program_name", scope: !117, file: !117, line: 37, type: !118, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!117 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!118 = !DISubroutineType(types: !119)
!119 = !{null, !51}
!120 = !DISubprogram(name: "setlocale", scope: !121, file: !121, line: 122, type: !122, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!121 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!122 = !DISubroutineType(types: !123)
!123 = !{!49, !53, !51}
!124 = !DISubprogram(name: "bindtextdomain", scope: !46, file: !46, line: 86, type: !125, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!125 = !DISubroutineType(types: !126)
!126 = !{!49, !51, !51}
!127 = !DISubprogram(name: "textdomain", scope: !46, file: !46, line: 82, type: !128, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!128 = !DISubroutineType(types: !129)
!129 = !{!49, !51}
!130 = !DISubprogram(name: "atexit", scope: !131, file: !131, line: 595, type: !132, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!131 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!132 = !DISubroutineType(types: !133)
!133 = !{!53, !134}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{null}
!137 = !DISubprogram(name: "getopt_long", scope: !138, file: !138, line: 66, type: !139, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!138 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!139 = !DISubroutineType(types: !140)
!140 = !{!53, !53, !141, !51, !143, !150}
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !145)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !138, line: 50, size: 256, elements: !146)
!146 = !{!147, !148, !149, !151}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !145, file: !138, line: 52, baseType: !51, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !145, file: !138, line: 55, baseType: !53, size: 32, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !145, file: !138, line: 56, baseType: !150, size: 64, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !145, file: !138, line: 57, baseType: !53, size: 32, offset: 192)
!152 = !DISubprogram(name: "xdectoumax", scope: !153, file: !153, line: 31, type: !154, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!153 = !DIFile(filename: "./lib/xdectoint.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!154 = !DISubroutineType(types: !155)
!155 = !{!110, !51, !110, !110, !51, !51, !53}
!156 = !DISubprogram(name: "version_etc", scope: !157, file: !157, line: 69, type: !158, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!157 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!158 = !DISubroutineType(types: !159)
!159 = !{null, !59, !51, !51, !51, null}
!160 = !DISubprogram(name: "rpl_fclose", scope: !161, file: !161, line: 672, type: !162, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!161 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!162 = !DISubroutineType(types: !163)
!163 = !{!53, !59}
!164 = !DISubprogram(name: "error", scope: !165, file: !165, line: 52, type: !166, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!165 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!166 = !DISubroutineType(types: !167)
!167 = !{null, !53, !53, !51, null}
!168 = !DISubprogram(name: "quotearg_n_style_colon", scope: !6, file: !6, line: 397, type: !169, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!169 = !DISubroutineType(types: !170)
!170 = !{!49, !53, !5, !51}
!171 = !DISubprogram(name: "fadvise", scope: !21, file: !21, line: 72, type: !172, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!172 = !DISubroutineType(types: !173)
!173 = !{null, !59, !20}
!174 = !DISubprogram(name: "x2realloc", scope: !175, file: !175, line: 61, type: !176, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!175 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!176 = !DISubroutineType(types: !177)
!177 = !{!106, !106, !178}
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!179 = !DISubprogram(name: "fwrite_unlocked", scope: !56, file: !56, line: 675, type: !180, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!180 = !DISubroutineType(types: !181)
!181 = !{!110, !182, !110, !110, !59}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!186 = !{!187, !190, !192, !193, !198, !203, !249}
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(name: "break_spaces", scope: !2, file: !3, line: 39, type: !189, isLocal: true, isDefinition: true)
!189 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(name: "count_bytes", scope: !2, file: !3, line: 42, type: !189, isLocal: true, isDefinition: true)
!192 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(name: "shortopts", scope: !2, file: !3, line: 47, type: !195, isLocal: true, isDefinition: true)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 280, elements: !196)
!196 = !{!197}
!197 = !DISubrange(count: 35)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 49, type: !200, isLocal: true, isDefinition: true)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 1536, elements: !201)
!201 = !{!202}
!202 = !DISubrange(count: 6)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(name: "line_out", scope: !205, file: !3, line: 126, type: !49, isLocal: true, isDefinition: true)
!205 = distinct !DISubprogram(name: "fold_file", scope: !3, file: !3, line: 120, type: !206, scopeLine: 121, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !208)
!206 = !DISubroutineType(types: !207)
!207 = !{!189, !51, !108}
!208 = !{!209, !210, !211, !215, !216, !217, !218, !219, !224, !225, !226, !231, !232, !235, !237, !238, !239, !241, !242, !243, !246, !247, !248}
!209 = !DILocalVariable(name: "filename", arg: 1, scope: !205, file: !3, line: 120, type: !51)
!210 = !DILocalVariable(name: "width", arg: 2, scope: !205, file: !3, line: 120, type: !108)
!211 = !DILocalVariable(name: "istream", scope: !205, file: !3, line: 122, type: !212)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !214, line: 7, baseType: !60)
!214 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "")
!215 = !DILocalVariable(name: "c", scope: !205, file: !3, line: 123, type: !53)
!216 = !DILocalVariable(name: "column", scope: !205, file: !3, line: 124, type: !108)
!217 = !DILocalVariable(name: "offset_out", scope: !205, file: !3, line: 125, type: !108)
!218 = !DILocalVariable(name: "saved_errno", scope: !205, file: !3, line: 128, type: !53)
!219 = !DILocalVariable(name: "__ptr", scope: !220, file: !3, line: 154, type: !51)
!220 = distinct !DILexicalBlock(scope: !221, file: !3, line: 154, column: 11)
!221 = distinct !DILexicalBlock(scope: !222, file: !3, line: 152, column: 9)
!222 = distinct !DILexicalBlock(scope: !223, file: !3, line: 151, column: 11)
!223 = distinct !DILexicalBlock(scope: !205, file: !3, line: 147, column: 5)
!224 = !DILocalVariable(name: "__stream", scope: !220, file: !3, line: 154, type: !212)
!225 = !DILocalVariable(name: "__cnt", scope: !220, file: !3, line: 154, type: !108)
!226 = !DILocalVariable(name: "found_blank", scope: !227, file: !3, line: 169, type: !189)
!227 = distinct !DILexicalBlock(scope: !228, file: !3, line: 168, column: 13)
!228 = distinct !DILexicalBlock(scope: !229, file: !3, line: 167, column: 15)
!229 = distinct !DILexicalBlock(scope: !230, file: !3, line: 163, column: 9)
!230 = distinct !DILexicalBlock(scope: !223, file: !3, line: 162, column: 11)
!231 = !DILocalVariable(name: "logical_end", scope: !227, file: !3, line: 170, type: !108)
!232 = !DILocalVariable(name: "i", scope: !233, file: !3, line: 185, type: !108)
!233 = distinct !DILexicalBlock(scope: !234, file: !3, line: 184, column: 17)
!234 = distinct !DILexicalBlock(scope: !227, file: !3, line: 183, column: 19)
!235 = !DILocalVariable(name: "__ptr", scope: !236, file: !3, line: 189, type: !51)
!236 = distinct !DILexicalBlock(scope: !233, file: !3, line: 189, column: 19)
!237 = !DILocalVariable(name: "__stream", scope: !236, file: !3, line: 189, type: !212)
!238 = !DILocalVariable(name: "__cnt", scope: !236, file: !3, line: 189, type: !108)
!239 = !DILocalVariable(name: "__ptr", scope: !240, file: !3, line: 210, type: !51)
!240 = distinct !DILexicalBlock(scope: !229, file: !3, line: 210, column: 11)
!241 = !DILocalVariable(name: "__stream", scope: !240, file: !3, line: 210, type: !212)
!242 = !DILocalVariable(name: "__cnt", scope: !240, file: !3, line: 210, type: !108)
!243 = !DILocalVariable(name: "__ptr", scope: !244, file: !3, line: 221, type: !51)
!244 = distinct !DILexicalBlock(scope: !245, file: !3, line: 221, column: 5)
!245 = distinct !DILexicalBlock(scope: !205, file: !3, line: 220, column: 7)
!246 = !DILocalVariable(name: "__stream", scope: !244, file: !3, line: 221, type: !212)
!247 = !DILocalVariable(name: "__cnt", scope: !244, file: !3, line: 221, type: !108)
!248 = !DILabel(scope: !223, name: "rescan", file: !3, line: 159)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(name: "allocated_out", scope: !205, file: !3, line: 127, type: !108, isLocal: true, isDefinition: true)
!251 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!252 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(name: "Version", scope: !255, file: !256, line: 2, type: !51, isDefinition: true)
!255 = distinct !DICompileUnit(language: DW_LANG_C99, file: !256, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !54, globals: !257, nameTableKind: None)
!256 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!257 = !{!253}
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(name: "file_name", scope: !260, file: !261, line: 46, type: !51, isLocal: true, isDefinition: true)
!260 = distinct !DICompileUnit(language: DW_LANG_C99, file: !261, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !54, retainedTypes: !262, globals: !300, nameTableKind: None)
!261 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!262 = !{!263, !45, !299, !164}
!263 = !DISubprogram(name: "close_stream", scope: !264, file: !264, line: 2, type: !265, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!264 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!265 = !DISubroutineType(types: !266)
!266 = !{!53, !267}
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !61, line: 49, size: 1728, elements: !269)
!269 = !{!270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !268, file: !61, line: 51, baseType: !53, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !268, file: !61, line: 54, baseType: !49, size: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !268, file: !61, line: 55, baseType: !49, size: 64, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !268, file: !61, line: 56, baseType: !49, size: 64, offset: 192)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !268, file: !61, line: 57, baseType: !49, size: 64, offset: 256)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !268, file: !61, line: 58, baseType: !49, size: 64, offset: 320)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !268, file: !61, line: 59, baseType: !49, size: 64, offset: 384)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !268, file: !61, line: 60, baseType: !49, size: 64, offset: 448)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !268, file: !61, line: 61, baseType: !49, size: 64, offset: 512)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !268, file: !61, line: 64, baseType: !49, size: 64, offset: 576)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !268, file: !61, line: 65, baseType: !49, size: 64, offset: 640)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !268, file: !61, line: 66, baseType: !49, size: 64, offset: 704)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !268, file: !61, line: 68, baseType: !76, size: 64, offset: 768)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !268, file: !61, line: 70, baseType: !267, size: 64, offset: 832)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !268, file: !61, line: 72, baseType: !53, size: 32, offset: 896)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !268, file: !61, line: 73, baseType: !53, size: 32, offset: 928)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !268, file: !61, line: 74, baseType: !82, size: 64, offset: 960)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !268, file: !61, line: 77, baseType: !86, size: 16, offset: 1024)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !268, file: !61, line: 78, baseType: !88, size: 8, offset: 1040)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !268, file: !61, line: 79, baseType: !90, size: 8, offset: 1048)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !268, file: !61, line: 81, baseType: !94, size: 64, offset: 1088)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !268, file: !61, line: 89, baseType: !97, size: 64, offset: 1152)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !268, file: !61, line: 91, baseType: !99, size: 64, offset: 1216)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !268, file: !61, line: 92, baseType: !102, size: 64, offset: 1280)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !268, file: !61, line: 93, baseType: !267, size: 64, offset: 1344)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !268, file: !61, line: 94, baseType: !106, size: 64, offset: 1408)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !268, file: !61, line: 95, baseType: !108, size: 64, offset: 1472)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !268, file: !61, line: 96, baseType: !53, size: 32, offset: 1536)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !268, file: !61, line: 98, baseType: !113, size: 160, offset: 1568)
!299 = !DISubprogram(name: "quotearg_colon", scope: !6, file: !6, line: 391, type: !128, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!300 = !{!258, !301}
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !260, file: !261, line: 56, type: !189, isLocal: true, isDefinition: true)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "exit_failure", scope: !305, file: !306, line: 24, type: !308, isDefinition: true)
!305 = distinct !DICompileUnit(language: DW_LANG_C99, file: !306, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !54, globals: !307, nameTableKind: None)
!306 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!307 = !{!303}
!308 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !53)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "program_name", scope: !311, file: !312, line: 33, type: !51, isDefinition: true)
!311 = distinct !DICompileUnit(language: DW_LANG_C99, file: !312, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !54, retainedTypes: !313, globals: !349, nameTableKind: None)
!312 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!313 = !{!106, !314, !49}
!314 = !DISubprogram(name: "fputs", scope: !56, file: !56, line: 626, type: !315, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!315 = !DISubroutineType(types: !316)
!316 = !{!53, !51, !317}
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !61, line: 49, size: 1728, elements: !319)
!319 = !{!320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !318, file: !61, line: 51, baseType: !53, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !318, file: !61, line: 54, baseType: !49, size: 64, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !318, file: !61, line: 55, baseType: !49, size: 64, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !318, file: !61, line: 56, baseType: !49, size: 64, offset: 192)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !318, file: !61, line: 57, baseType: !49, size: 64, offset: 256)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !318, file: !61, line: 58, baseType: !49, size: 64, offset: 320)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !318, file: !61, line: 59, baseType: !49, size: 64, offset: 384)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !318, file: !61, line: 60, baseType: !49, size: 64, offset: 448)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !318, file: !61, line: 61, baseType: !49, size: 64, offset: 512)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !318, file: !61, line: 64, baseType: !49, size: 64, offset: 576)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !318, file: !61, line: 65, baseType: !49, size: 64, offset: 640)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !318, file: !61, line: 66, baseType: !49, size: 64, offset: 704)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !318, file: !61, line: 68, baseType: !76, size: 64, offset: 768)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !318, file: !61, line: 70, baseType: !317, size: 64, offset: 832)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !318, file: !61, line: 72, baseType: !53, size: 32, offset: 896)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !318, file: !61, line: 73, baseType: !53, size: 32, offset: 928)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !318, file: !61, line: 74, baseType: !82, size: 64, offset: 960)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !318, file: !61, line: 77, baseType: !86, size: 16, offset: 1024)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !318, file: !61, line: 78, baseType: !88, size: 8, offset: 1040)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !318, file: !61, line: 79, baseType: !90, size: 8, offset: 1048)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !318, file: !61, line: 81, baseType: !94, size: 64, offset: 1088)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !318, file: !61, line: 89, baseType: !97, size: 64, offset: 1152)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !318, file: !61, line: 91, baseType: !99, size: 64, offset: 1216)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !318, file: !61, line: 92, baseType: !102, size: 64, offset: 1280)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !318, file: !61, line: 93, baseType: !317, size: 64, offset: 1344)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !318, file: !61, line: 94, baseType: !106, size: 64, offset: 1408)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !318, file: !61, line: 95, baseType: !108, size: 64, offset: 1472)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !318, file: !61, line: 96, baseType: !53, size: 32, offset: 1536)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !318, file: !61, line: 98, baseType: !113, size: 160, offset: 1568)
!349 = !{!309}
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !352, file: !353, line: 85, type: !454, isDefinition: true)
!352 = distinct !DICompileUnit(language: DW_LANG_C99, file: !353, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !354, retainedTypes: !360, globals: !427, nameTableKind: None)
!353 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!354 = !{!5, !355, !29}
!355 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, baseType: !7, size: 32, elements: !356)
!356 = !{!357, !358, !359}
!357 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!358 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!359 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!360 = !{!361, !364, !379, !382, !53, !86, !385, !108, !402, !406, !45, !412, !416, !49, !420, !423, !424}
!361 = !DISubprogram(name: "xmemdup", scope: !175, file: !175, line: 62, type: !362, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!362 = !DISubroutineType(types: !363)
!363 = !{!106, !182, !110}
!364 = !DISubprogram(name: "quotearg_alloc_mem", scope: !6, file: !6, line: 342, type: !365, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!365 = !DISubroutineType(types: !366)
!366 = !{!49, !51, !110, !178, !367}
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !369)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !353, line: 65, size: 448, elements: !370)
!370 = !{!371, !372, !373, !377, !378}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !369, file: !353, line: 68, baseType: !5, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !369, file: !353, line: 71, baseType: !53, size: 32, offset: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !369, file: !353, line: 75, baseType: !374, size: 256, offset: 64)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !375)
!375 = !{!376}
!376 = !DISubrange(count: 8)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !369, file: !353, line: 78, baseType: !51, size: 64, offset: 320)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !369, file: !353, line: 81, baseType: !51, size: 64, offset: 384)
!379 = !DISubprogram(name: "free", scope: !131, file: !131, line: 565, type: !380, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!380 = !DISubroutineType(types: !381)
!381 = !{null, !106}
!382 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !6, file: !6, line: 408, type: !383, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!383 = !DISubroutineType(types: !384)
!384 = !{!49, !53, !51, !51, !51, !110}
!385 = !DISubprogram(name: "rpl_mbrtowc", scope: !386, file: !386, line: 717, type: !387, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!386 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!387 = !DISubroutineType(types: !388)
!388 = !{!110, !150, !51, !110, !389}
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !391, line: 13, size: 64, elements: !392)
!391 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!392 = !{!393, !394}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !390, file: !391, line: 15, baseType: !53, size: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !390, file: !391, line: 20, baseType: !395, size: 32, offset: 32)
!395 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !390, file: !391, line: 16, size: 32, elements: !396)
!396 = !{!397, !398}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !395, file: !391, line: 18, baseType: !7, size: 32)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !395, file: !391, line: 19, baseType: !399, size: 32)
!399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 32, elements: !400)
!400 = !{!401}
!401 = !DISubrange(count: 4)
!402 = !DISubprogram(name: "iswprint", scope: !403, file: !403, line: 120, type: !404, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!403 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!404 = !DISubroutineType(types: !405)
!405 = !{!53, !7}
!406 = !DISubprogram(name: "mbsinit", scope: !407, file: !407, line: 292, type: !408, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!407 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!408 = !DISubroutineType(types: !409)
!409 = !{!53, !410}
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !390)
!412 = !DISubprogram(name: "locale_charset", scope: !413, file: !413, line: 35, type: !414, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!413 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!414 = !DISubroutineType(types: !415)
!415 = !{!51}
!416 = !DISubprogram(name: "c_strcasecmp", scope: !417, file: !417, line: 42, type: !418, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!417 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!418 = !DISubroutineType(types: !419)
!419 = !{!53, !51, !51}
!420 = !DISubprogram(name: "xmalloc", scope: !175, file: !175, line: 53, type: !421, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!421 = !DISubroutineType(types: !422)
!422 = !{!106, !110}
!423 = !DISubprogram(name: "xalloc_die", scope: !175, file: !175, line: 51, type: !135, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !54)
!424 = !DISubprogram(name: "xrealloc", scope: !175, file: !175, line: 59, type: !425, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!425 = !DISubroutineType(types: !426)
!426 = !{!106, !106, !110}
!427 = !{!350, !428, !434, !436, !438, !443, !450, !452}
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !352, file: !353, line: 101, type: !430, isDefinition: true)
!430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 320, elements: !432)
!431 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!432 = !{!433}
!433 = !DISubrange(count: 10)
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !352, file: !353, line: 1052, type: !369, isDefinition: true)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !352, file: !353, line: 116, type: !369, isLocal: true, isDefinition: true)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(name: "slot0", scope: !352, file: !353, line: 842, type: !440, isLocal: true, isDefinition: true)
!440 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 2048, elements: !441)
!441 = !{!442}
!442 = !DISubrange(count: 256)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(name: "slotvec", scope: !352, file: !353, line: 845, type: !445, isLocal: true, isDefinition: true)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !353, line: 834, size: 128, elements: !447)
!447 = !{!448, !449}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !446, file: !353, line: 836, baseType: !108, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !446, file: !353, line: 837, baseType: !49, size: 64, offset: 64)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(name: "nslots", scope: !352, file: !353, line: 843, type: !53, isLocal: true, isDefinition: true)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(name: "slotvec0", scope: !352, file: !353, line: 844, type: !446, isLocal: true, isDefinition: true)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !455, size: 704, elements: !456)
!455 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!456 = !{!457}
!457 = !DISubrange(count: 11)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !460, file: !461, line: 26, type: !463, isDefinition: true)
!460 = distinct !DICompileUnit(language: DW_LANG_C99, file: !461, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !54, globals: !462, nameTableKind: None)
!461 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!462 = !{!458}
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 376, elements: !464)
!464 = !{!465}
!465 = !DISubrange(count: 47)
!466 = distinct !DICompileUnit(language: DW_LANG_C99, file: !467, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !468, retainedTypes: !469, nameTableKind: None)
!467 = !DIFile(filename: "lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!468 = !{!20}
!469 = !{!470, !474}
!470 = !DISubprogram(name: "posix_fadvise", scope: !471, file: !471, line: 288, type: !472, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!471 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
!472 = !DISubroutineType(types: !473)
!473 = !{!53, !53, !84, !84, !53}
!474 = !DISubprogram(name: "fileno", scope: !56, file: !56, line: 786, type: !475, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!475 = !DISubroutineType(types: !476)
!476 = !{!53, !477}
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !61, line: 49, size: 1728, elements: !479)
!479 = !{!480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !478, file: !61, line: 51, baseType: !53, size: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !478, file: !61, line: 54, baseType: !49, size: 64, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !478, file: !61, line: 55, baseType: !49, size: 64, offset: 128)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !478, file: !61, line: 56, baseType: !49, size: 64, offset: 192)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !478, file: !61, line: 57, baseType: !49, size: 64, offset: 256)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !478, file: !61, line: 58, baseType: !49, size: 64, offset: 320)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !478, file: !61, line: 59, baseType: !49, size: 64, offset: 384)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !478, file: !61, line: 60, baseType: !49, size: 64, offset: 448)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !478, file: !61, line: 61, baseType: !49, size: 64, offset: 512)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !478, file: !61, line: 64, baseType: !49, size: 64, offset: 576)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !478, file: !61, line: 65, baseType: !49, size: 64, offset: 640)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !478, file: !61, line: 66, baseType: !49, size: 64, offset: 704)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !478, file: !61, line: 68, baseType: !76, size: 64, offset: 768)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !478, file: !61, line: 70, baseType: !477, size: 64, offset: 832)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !478, file: !61, line: 72, baseType: !53, size: 32, offset: 896)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !478, file: !61, line: 73, baseType: !53, size: 32, offset: 928)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !478, file: !61, line: 74, baseType: !82, size: 64, offset: 960)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !478, file: !61, line: 77, baseType: !86, size: 16, offset: 1024)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !478, file: !61, line: 78, baseType: !88, size: 8, offset: 1040)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !478, file: !61, line: 79, baseType: !90, size: 8, offset: 1048)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !478, file: !61, line: 81, baseType: !94, size: 64, offset: 1088)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !478, file: !61, line: 89, baseType: !97, size: 64, offset: 1152)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !478, file: !61, line: 91, baseType: !99, size: 64, offset: 1216)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !478, file: !61, line: 92, baseType: !102, size: 64, offset: 1280)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !478, file: !61, line: 93, baseType: !477, size: 64, offset: 1344)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !478, file: !61, line: 94, baseType: !106, size: 64, offset: 1408)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !478, file: !61, line: 95, baseType: !108, size: 64, offset: 1472)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !478, file: !61, line: 96, baseType: !53, size: 32, offset: 1536)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !478, file: !61, line: 98, baseType: !113, size: 160, offset: 1568)
!509 = distinct !DICompileUnit(language: DW_LANG_C99, file: !510, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !511, retainedTypes: !515, nameTableKind: None)
!510 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!511 = !{!512}
!512 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !510, line: 40, baseType: !7, size: 32, elements: !513)
!513 = !{!514}
!514 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!515 = !{!45, !516, !106}
!516 = !DISubprogram(name: "fputs_unlocked", scope: !56, file: !56, line: 662, type: !517, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!517 = !DISubroutineType(types: !518)
!518 = !{!53, !51, !519}
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !61, line: 49, size: 1728, elements: !521)
!521 = !{!522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !520, file: !61, line: 51, baseType: !53, size: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !520, file: !61, line: 54, baseType: !49, size: 64, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !520, file: !61, line: 55, baseType: !49, size: 64, offset: 128)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !520, file: !61, line: 56, baseType: !49, size: 64, offset: 192)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !520, file: !61, line: 57, baseType: !49, size: 64, offset: 256)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !520, file: !61, line: 58, baseType: !49, size: 64, offset: 320)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !520, file: !61, line: 59, baseType: !49, size: 64, offset: 384)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !520, file: !61, line: 60, baseType: !49, size: 64, offset: 448)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !520, file: !61, line: 61, baseType: !49, size: 64, offset: 512)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !520, file: !61, line: 64, baseType: !49, size: 64, offset: 576)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !520, file: !61, line: 65, baseType: !49, size: 64, offset: 640)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !520, file: !61, line: 66, baseType: !49, size: 64, offset: 704)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !520, file: !61, line: 68, baseType: !76, size: 64, offset: 768)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !520, file: !61, line: 70, baseType: !519, size: 64, offset: 832)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !520, file: !61, line: 72, baseType: !53, size: 32, offset: 896)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !520, file: !61, line: 73, baseType: !53, size: 32, offset: 928)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !520, file: !61, line: 74, baseType: !82, size: 64, offset: 960)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !520, file: !61, line: 77, baseType: !86, size: 16, offset: 1024)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !520, file: !61, line: 78, baseType: !88, size: 8, offset: 1040)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !520, file: !61, line: 79, baseType: !90, size: 8, offset: 1048)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !520, file: !61, line: 81, baseType: !94, size: 64, offset: 1088)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !520, file: !61, line: 89, baseType: !97, size: 64, offset: 1152)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !520, file: !61, line: 91, baseType: !99, size: 64, offset: 1216)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !520, file: !61, line: 92, baseType: !102, size: 64, offset: 1280)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !520, file: !61, line: 93, baseType: !519, size: 64, offset: 1344)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !520, file: !61, line: 94, baseType: !106, size: 64, offset: 1408)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !520, file: !61, line: 95, baseType: !108, size: 64, offset: 1472)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !520, file: !61, line: 96, baseType: !53, size: 32, offset: 1536)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !520, file: !61, line: 98, baseType: !113, size: 160, offset: 1568)
!551 = distinct !DICompileUnit(language: DW_LANG_C99, file: !552, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !553, retainedTypes: !566, nameTableKind: None)
!552 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!553 = !{!554}
!554 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !555, file: !175, line: 186, baseType: !7, size: 32, elements: !564)
!555 = distinct !DISubprogram(name: "x2nrealloc", scope: !175, file: !175, line: 174, type: !556, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !551, retainedNodes: !559)
!556 = !DISubroutineType(types: !557)
!557 = !{!106, !106, !558, !108}
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!559 = !{!560, !561, !562, !563}
!560 = !DILocalVariable(name: "p", arg: 1, scope: !555, file: !175, line: 174, type: !106)
!561 = !DILocalVariable(name: "pn", arg: 2, scope: !555, file: !175, line: 174, type: !558)
!562 = !DILocalVariable(name: "s", arg: 3, scope: !555, file: !175, line: 174, type: !108)
!563 = !DILocalVariable(name: "n", scope: !555, file: !175, line: 176, type: !108)
!564 = !{!565}
!565 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!566 = !{!108, !423, !420, !424, !49, !379, !106, !567, !570}
!567 = !DISubprogram(name: "xcalloc", scope: !175, file: !175, line: 57, type: !568, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!568 = !DISubroutineType(types: !569)
!569 = !{!106, !110, !110}
!570 = !DISubprogram(name: "rpl_calloc", scope: !571, file: !571, line: 688, type: !568, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!571 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!572 = distinct !DICompileUnit(language: DW_LANG_C99, file: !573, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !54, retainedTypes: !574, nameTableKind: None)
!573 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!574 = !{!45, !164}
!575 = distinct !DICompileUnit(language: DW_LANG_C99, file: !576, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !577, retainedTypes: !586, nameTableKind: None)
!576 = !DIFile(filename: "lib/xdectoumax.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!577 = !{!578}
!578 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !579, line: 25, baseType: !7, size: 32, elements: !580)
!579 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!580 = !{!581, !582, !583, !584, !585}
!581 = !DIEnumerator(name: "LONGINT_OK", value: 0, isUnsigned: true)
!582 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1, isUnsigned: true)
!583 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2, isUnsigned: true)
!584 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3, isUnsigned: true)
!585 = !DIEnumerator(name: "LONGINT_INVALID", value: 4, isUnsigned: true)
!586 = !{!587, !591, !164}
!587 = !DISubprogram(name: "xstrtoumax", scope: !579, file: !579, line: 48, type: !588, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!588 = !DISubroutineType(types: !589)
!589 = !{!578, !51, !590, !53, !178, !51}
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!591 = !DISubprogram(name: "quote", scope: !592, file: !592, line: 44, type: !593, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!592 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!593 = !DISubroutineType(types: !594)
!594 = !{!51, !51}
!595 = distinct !DICompileUnit(language: DW_LANG_C99, file: !596, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !597, retainedTypes: !598, nameTableKind: None)
!596 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!597 = !{!578, !29}
!598 = !{!53, !86}
!599 = distinct !DICompileUnit(language: DW_LANG_C99, file: !600, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !54, retainedTypes: !601, nameTableKind: None)
!600 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!601 = !{!106}
!602 = distinct !DICompileUnit(language: DW_LANG_C99, file: !603, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !54, retainedTypes: !604, nameTableKind: None)
!603 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!604 = !{!605, !640, !641, !645}
!605 = !DISubprogram(name: "fileno", scope: !56, file: !56, line: 786, type: !606, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!606 = !DISubroutineType(types: !607)
!607 = !{!53, !608}
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !61, line: 49, size: 1728, elements: !610)
!610 = !{!611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !609, file: !61, line: 51, baseType: !53, size: 32)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !609, file: !61, line: 54, baseType: !49, size: 64, offset: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !609, file: !61, line: 55, baseType: !49, size: 64, offset: 128)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !609, file: !61, line: 56, baseType: !49, size: 64, offset: 192)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !609, file: !61, line: 57, baseType: !49, size: 64, offset: 256)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !609, file: !61, line: 58, baseType: !49, size: 64, offset: 320)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !609, file: !61, line: 59, baseType: !49, size: 64, offset: 384)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !609, file: !61, line: 60, baseType: !49, size: 64, offset: 448)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !609, file: !61, line: 61, baseType: !49, size: 64, offset: 512)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !609, file: !61, line: 64, baseType: !49, size: 64, offset: 576)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !609, file: !61, line: 65, baseType: !49, size: 64, offset: 640)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !609, file: !61, line: 66, baseType: !49, size: 64, offset: 704)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !609, file: !61, line: 68, baseType: !76, size: 64, offset: 768)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !609, file: !61, line: 70, baseType: !608, size: 64, offset: 832)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !609, file: !61, line: 72, baseType: !53, size: 32, offset: 896)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !609, file: !61, line: 73, baseType: !53, size: 32, offset: 928)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !609, file: !61, line: 74, baseType: !82, size: 64, offset: 960)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !609, file: !61, line: 77, baseType: !86, size: 16, offset: 1024)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !609, file: !61, line: 78, baseType: !88, size: 8, offset: 1040)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !609, file: !61, line: 79, baseType: !90, size: 8, offset: 1048)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !609, file: !61, line: 81, baseType: !94, size: 64, offset: 1088)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !609, file: !61, line: 89, baseType: !97, size: 64, offset: 1152)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !609, file: !61, line: 91, baseType: !99, size: 64, offset: 1216)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !609, file: !61, line: 92, baseType: !102, size: 64, offset: 1280)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !609, file: !61, line: 93, baseType: !608, size: 64, offset: 1344)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !609, file: !61, line: 94, baseType: !106, size: 64, offset: 1408)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !609, file: !61, line: 95, baseType: !108, size: 64, offset: 1472)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !609, file: !61, line: 96, baseType: !53, size: 32, offset: 1536)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !609, file: !61, line: 98, baseType: !113, size: 160, offset: 1568)
!640 = !DISubprogram(name: "fclose", scope: !56, file: !56, line: 213, type: !606, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!641 = !DISubprogram(name: "lseek", scope: !642, file: !642, line: 334, type: !643, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!642 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!643 = !DISubroutineType(types: !644)
!644 = !{!84, !53, !84, !53}
!645 = !DISubprogram(name: "rpl_fflush", scope: !161, file: !161, line: 718, type: !606, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!646 = distinct !DICompileUnit(language: DW_LANG_C99, file: !647, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !54, retainedTypes: !648, nameTableKind: None)
!647 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!648 = !{!106, !649, !684}
!649 = !DISubprogram(name: "fflush", scope: !56, file: !56, line: 218, type: !650, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!650 = !DISubroutineType(types: !651)
!651 = !{!53, !652}
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !61, line: 49, size: 1728, elements: !654)
!654 = !{!655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !653, file: !61, line: 51, baseType: !53, size: 32)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !653, file: !61, line: 54, baseType: !49, size: 64, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !653, file: !61, line: 55, baseType: !49, size: 64, offset: 128)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !653, file: !61, line: 56, baseType: !49, size: 64, offset: 192)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !653, file: !61, line: 57, baseType: !49, size: 64, offset: 256)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !653, file: !61, line: 58, baseType: !49, size: 64, offset: 320)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !653, file: !61, line: 59, baseType: !49, size: 64, offset: 384)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !653, file: !61, line: 60, baseType: !49, size: 64, offset: 448)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !653, file: !61, line: 61, baseType: !49, size: 64, offset: 512)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !653, file: !61, line: 64, baseType: !49, size: 64, offset: 576)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !653, file: !61, line: 65, baseType: !49, size: 64, offset: 640)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !653, file: !61, line: 66, baseType: !49, size: 64, offset: 704)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !653, file: !61, line: 68, baseType: !76, size: 64, offset: 768)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !653, file: !61, line: 70, baseType: !652, size: 64, offset: 832)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !653, file: !61, line: 72, baseType: !53, size: 32, offset: 896)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !653, file: !61, line: 73, baseType: !53, size: 32, offset: 928)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !653, file: !61, line: 74, baseType: !82, size: 64, offset: 960)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !653, file: !61, line: 77, baseType: !86, size: 16, offset: 1024)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !653, file: !61, line: 78, baseType: !88, size: 8, offset: 1040)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !653, file: !61, line: 79, baseType: !90, size: 8, offset: 1048)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !653, file: !61, line: 81, baseType: !94, size: 64, offset: 1088)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !653, file: !61, line: 89, baseType: !97, size: 64, offset: 1152)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !653, file: !61, line: 91, baseType: !99, size: 64, offset: 1216)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !653, file: !61, line: 92, baseType: !102, size: 64, offset: 1280)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !653, file: !61, line: 93, baseType: !652, size: 64, offset: 1344)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !653, file: !61, line: 94, baseType: !106, size: 64, offset: 1408)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !653, file: !61, line: 95, baseType: !108, size: 64, offset: 1472)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !653, file: !61, line: 96, baseType: !53, size: 32, offset: 1536)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !653, file: !61, line: 98, baseType: !113, size: 160, offset: 1568)
!684 = !DISubprogram(name: "rpl_fseeko", scope: !161, file: !161, line: 1034, type: !685, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!685 = !DISubroutineType(types: !686)
!686 = !{!53, !652, !84, !53}
!687 = distinct !DICompileUnit(language: DW_LANG_C99, file: !688, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !54, retainedTypes: !689, nameTableKind: None)
!688 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!689 = !{!106, !690, !641, !725}
!690 = !DISubprogram(name: "fileno", scope: !56, file: !56, line: 786, type: !691, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!691 = !DISubroutineType(types: !692)
!692 = !{!53, !693}
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !61, line: 49, size: 1728, elements: !695)
!695 = !{!696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !694, file: !61, line: 51, baseType: !53, size: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !694, file: !61, line: 54, baseType: !49, size: 64, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !694, file: !61, line: 55, baseType: !49, size: 64, offset: 128)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !694, file: !61, line: 56, baseType: !49, size: 64, offset: 192)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !694, file: !61, line: 57, baseType: !49, size: 64, offset: 256)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !694, file: !61, line: 58, baseType: !49, size: 64, offset: 320)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !694, file: !61, line: 59, baseType: !49, size: 64, offset: 384)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !694, file: !61, line: 60, baseType: !49, size: 64, offset: 448)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !694, file: !61, line: 61, baseType: !49, size: 64, offset: 512)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !694, file: !61, line: 64, baseType: !49, size: 64, offset: 576)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !694, file: !61, line: 65, baseType: !49, size: 64, offset: 640)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !694, file: !61, line: 66, baseType: !49, size: 64, offset: 704)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !694, file: !61, line: 68, baseType: !76, size: 64, offset: 768)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !694, file: !61, line: 70, baseType: !693, size: 64, offset: 832)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !694, file: !61, line: 72, baseType: !53, size: 32, offset: 896)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !694, file: !61, line: 73, baseType: !53, size: 32, offset: 928)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !694, file: !61, line: 74, baseType: !82, size: 64, offset: 960)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !694, file: !61, line: 77, baseType: !86, size: 16, offset: 1024)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !694, file: !61, line: 78, baseType: !88, size: 8, offset: 1040)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !694, file: !61, line: 79, baseType: !90, size: 8, offset: 1048)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !694, file: !61, line: 81, baseType: !94, size: 64, offset: 1088)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !694, file: !61, line: 89, baseType: !97, size: 64, offset: 1152)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !694, file: !61, line: 91, baseType: !99, size: 64, offset: 1216)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !694, file: !61, line: 92, baseType: !102, size: 64, offset: 1280)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !694, file: !61, line: 93, baseType: !693, size: 64, offset: 1344)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !694, file: !61, line: 94, baseType: !106, size: 64, offset: 1408)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !694, file: !61, line: 95, baseType: !108, size: 64, offset: 1472)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !694, file: !61, line: 96, baseType: !53, size: 32, offset: 1536)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !694, file: !61, line: 98, baseType: !113, size: 160, offset: 1568)
!725 = !DISubprogram(name: "fseeko", scope: !56, file: !56, line: 707, type: !726, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!726 = !DISubroutineType(types: !727)
!727 = !{!53, !693, !84, !53}
!728 = distinct !DICompileUnit(language: DW_LANG_C99, file: !729, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !54, retainedTypes: !730, nameTableKind: None)
!729 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!730 = !{!731, !108, !743}
!731 = !DISubprogram(name: "mbrtowc", scope: !407, file: !407, line: 296, type: !732, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!732 = !DISubroutineType(types: !733)
!733 = !{!110, !150, !51, !110, !734}
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !391, line: 13, size: 64, elements: !736)
!736 = !{!737, !738}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !735, file: !391, line: 15, baseType: !53, size: 32)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !735, file: !391, line: 20, baseType: !739, size: 32, offset: 32)
!739 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !735, file: !391, line: 16, size: 32, elements: !740)
!740 = !{!741, !742}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !739, file: !391, line: 18, baseType: !7, size: 32)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !739, file: !391, line: 19, baseType: !399, size: 32)
!743 = !DISubprogram(name: "hard_locale", scope: !744, file: !744, line: 26, type: !745, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!744 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!745 = !DISubroutineType(types: !746)
!746 = !{!189, !53}
!747 = distinct !DICompileUnit(language: DW_LANG_C99, file: !748, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !54, retainedTypes: !749, nameTableKind: None)
!748 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!749 = !{!750}
!750 = !DISubprogram(name: "rpl_fclose", scope: !161, file: !161, line: 672, type: !751, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!751 = !DISubroutineType(types: !752)
!752 = !{!53, !753}
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !61, line: 49, size: 1728, elements: !755)
!755 = !{!756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !754, file: !61, line: 51, baseType: !53, size: 32)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !754, file: !61, line: 54, baseType: !49, size: 64, offset: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !754, file: !61, line: 55, baseType: !49, size: 64, offset: 128)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !754, file: !61, line: 56, baseType: !49, size: 64, offset: 192)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !754, file: !61, line: 57, baseType: !49, size: 64, offset: 256)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !754, file: !61, line: 58, baseType: !49, size: 64, offset: 320)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !754, file: !61, line: 59, baseType: !49, size: 64, offset: 384)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !754, file: !61, line: 60, baseType: !49, size: 64, offset: 448)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !754, file: !61, line: 61, baseType: !49, size: 64, offset: 512)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !754, file: !61, line: 64, baseType: !49, size: 64, offset: 576)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !754, file: !61, line: 65, baseType: !49, size: 64, offset: 640)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !754, file: !61, line: 66, baseType: !49, size: 64, offset: 704)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !754, file: !61, line: 68, baseType: !76, size: 64, offset: 768)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !754, file: !61, line: 70, baseType: !753, size: 64, offset: 832)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !754, file: !61, line: 72, baseType: !53, size: 32, offset: 896)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !754, file: !61, line: 73, baseType: !53, size: 32, offset: 928)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !754, file: !61, line: 74, baseType: !82, size: 64, offset: 960)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !754, file: !61, line: 77, baseType: !86, size: 16, offset: 1024)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !754, file: !61, line: 78, baseType: !88, size: 8, offset: 1040)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !754, file: !61, line: 79, baseType: !90, size: 8, offset: 1048)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !754, file: !61, line: 81, baseType: !94, size: 64, offset: 1088)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !754, file: !61, line: 89, baseType: !97, size: 64, offset: 1152)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !754, file: !61, line: 91, baseType: !99, size: 64, offset: 1216)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !754, file: !61, line: 92, baseType: !102, size: 64, offset: 1280)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !754, file: !61, line: 93, baseType: !753, size: 64, offset: 1344)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !754, file: !61, line: 94, baseType: !106, size: 64, offset: 1408)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !754, file: !61, line: 95, baseType: !108, size: 64, offset: 1472)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !754, file: !61, line: 96, baseType: !53, size: 32, offset: 1536)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !754, file: !61, line: 98, baseType: !113, size: 160, offset: 1568)
!785 = distinct !DICompileUnit(language: DW_LANG_C99, file: !786, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !54, retainedTypes: !787, nameTableKind: None)
!786 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!787 = !{!788}
!788 = !DISubprogram(name: "setlocale_null_r", scope: !789, file: !789, line: 64, type: !790, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!789 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!790 = !DISubroutineType(types: !791)
!791 = !{!53, !53, !49, !110}
!792 = distinct !DICompileUnit(language: DW_LANG_C99, file: !793, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !794, retainedTypes: !1181, nameTableKind: None)
!793 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!794 = !{!795}
!795 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !796, line: 41, baseType: !7, size: 32, elements: !797)
!796 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!797 = !{!798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180}
!798 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!799 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!800 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!801 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!802 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!803 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!804 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!805 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!806 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!807 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!808 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!809 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!810 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!811 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!812 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!813 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!814 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!815 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!816 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!817 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!818 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!819 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!820 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!821 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!822 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!823 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!824 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!825 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!826 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!827 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!828 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!829 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!830 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!831 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!832 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!833 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!834 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!835 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!836 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!837 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!838 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!839 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!840 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!841 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!842 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!843 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!844 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!845 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!846 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!847 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!884 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!885 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!886 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!887 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!894 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!895 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!896 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!898 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!899 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!900 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!901 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!902 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!903 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!904 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!905 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!906 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!907 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!908 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!909 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!910 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!911 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!912 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!913 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!914 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!915 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!916 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!917 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!918 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!919 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!920 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!921 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!922 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!923 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!924 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!925 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!926 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!927 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!928 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!929 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!930 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!931 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!932 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!933 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!934 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!935 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!936 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!937 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!938 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!939 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!940 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!941 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!942 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!943 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!944 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!945 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!946 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!947 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!948 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!949 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!950 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!951 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!952 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!953 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!954 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!955 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!956 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!957 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!958 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!959 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!960 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!961 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!962 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!963 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
