source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [FILE]...\0A\00", align 1
@.str.2 = private unnamed_addr constant [60 x i8] c"Wrap input lines in each FILE, writing to standard output.\0A\00", align 1
@stdout = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str.14 = private unnamed_addr constant [56 x i8] c"\0AWith no FILE, or when FILE is -, read standard input.\0A\00", align 1

!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !44, globals: !55)
!3 = !DIFile(filename: "src/fold.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!4 = !{!5, !20, !29}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!9 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 45, baseType: !7, size: 32, elements: !22)
!21 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!22 = !{!23, !24, !25, !26, !27, !28}
!23 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0, isUnsigned: true)
!24 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2, isUnsigned: true)
!25 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5, isUnsigned: true)
!26 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4, isUnsigned: true)
!27 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3, isUnsigned: true)
!28 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !30, line: 46, baseType: !7, size: 32, elements: !31)
!30 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!31 = !{!32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43}
!32 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!33 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!34 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!35 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!36 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!37 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!38 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!39 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!40 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!41 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!42 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!43 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!44 = !{!45, !47, !48, !49, !50, !53, !54}
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!48 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!49 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !51, line: 62, baseType: !52)
!51 = !DIFile(filename: "/usr/lib/clang/7.0.0/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!52 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!55 = !{!56, !59, !61, !62, !68, !83, !161}
!56 = !DIGlobalVariableExpression(var: !57, expr: !DIExpression())
!57 = distinct !DIGlobalVariable(name: "break_spaces", scope: !2, file: !3, line: 39, type: !58, isLocal: true, isDefinition: true)
!58 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(name: "count_bytes", scope: !2, file: !3, line: 42, type: !58, isLocal: true, isDefinition: true)
!61 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!62 = !DIGlobalVariableExpression(var: !63, expr: !DIExpression())
!63 = distinct !DIGlobalVariable(name: "shortopts", scope: !2, file: !3, line: 47, type: !64, isLocal: true, isDefinition: true)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 280, elements: !66)
!65 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!66 = !{!67}
!67 = !DISubrange(count: 35)
!68 = !DIGlobalVariableExpression(var: !69, expr: !DIExpression())
!69 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 49, type: !70, isLocal: true, isDefinition: true)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 1536, elements: !81)
!71 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !73, line: 50, size: 256, elements: !74)
!73 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!74 = !{!75, !77, !78, !80}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !72, file: !73, line: 52, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !72, file: !73, line: 55, baseType: !48, size: 32, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !72, file: !73, line: 56, baseType: !79, size: 64, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !72, file: !73, line: 57, baseType: !48, size: 32, offset: 192)
!81 = !{!82}
!82 = !DISubrange(count: 6)
!83 = !DIGlobalVariableExpression(var: !84, expr: !DIExpression())
!84 = distinct !DIGlobalVariable(name: "line_out", scope: !85, file: !3, line: 126, type: !45, isLocal: true, isDefinition: true)
!85 = distinct !DISubprogram(name: "fold_file", scope: !3, file: !3, line: 120, type: !86, isLocal: true, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !88)
!86 = !DISubroutineType(types: !87)
!87 = !{!58, !76, !50}
!88 = !{!89, !90, !91, !147, !148, !149, !150, !151, !157, !158}
!89 = !DILocalVariable(name: "filename", arg: 1, scope: !85, file: !3, line: 120, type: !76)
!90 = !DILocalVariable(name: "width", arg: 2, scope: !85, file: !3, line: 120, type: !50)
!91 = !DILocalVariable(name: "istream", scope: !85, file: !3, line: 122, type: !92)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !94, line: 7, baseType: !95)
!94 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !96, line: 49, size: 1728, elements: !97)
!96 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!97 = !{!98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !113, !115, !116, !117, !121, !122, !124, !128, !131, !133, !136, !139, !140, !141, !142, !143}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !95, file: !96, line: 51, baseType: !48, size: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !95, file: !96, line: 54, baseType: !45, size: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !95, file: !96, line: 55, baseType: !45, size: 64, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !95, file: !96, line: 56, baseType: !45, size: 64, offset: 192)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !95, file: !96, line: 57, baseType: !45, size: 64, offset: 256)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !95, file: !96, line: 58, baseType: !45, size: 64, offset: 320)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !95, file: !96, line: 59, baseType: !45, size: 64, offset: 384)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !95, file: !96, line: 60, baseType: !45, size: 64, offset: 448)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !95, file: !96, line: 61, baseType: !45, size: 64, offset: 512)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !95, file: !96, line: 64, baseType: !45, size: 64, offset: 576)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !95, file: !96, line: 65, baseType: !45, size: 64, offset: 640)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !95, file: !96, line: 66, baseType: !45, size: 64, offset: 704)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !95, file: !96, line: 68, baseType: !111, size: 64, offset: 768)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !96, line: 36, flags: DIFlagFwdDecl)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !95, file: !96, line: 70, baseType: !114, size: 64, offset: 832)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !95, file: !96, line: 72, baseType: !48, size: 32, offset: 896)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !95, file: !96, line: 73, baseType: !48, size: 32, offset: 928)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !95, file: !96, line: 74, baseType: !118, size: 64, offset: 960)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !119, line: 150, baseType: !120)
!119 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!120 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !95, file: !96, line: 77, baseType: !49, size: 16, offset: 1024)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !95, file: !96, line: 78, baseType: !123, size: 8, offset: 1040)
!123 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !95, file: !96, line: 79, baseType: !125, size: 8, offset: 1048)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 8, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 1)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !95, file: !96, line: 81, baseType: !129, size: 64, offset: 1088)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !96, line: 43, baseType: null)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !95, file: !96, line: 89, baseType: !132, size: 64, offset: 1152)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !119, line: 151, baseType: !120)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !95, file: !96, line: 91, baseType: !134, size: 64, offset: 1216)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !96, line: 37, flags: DIFlagFwdDecl)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !95, file: !96, line: 92, baseType: !137, size: 64, offset: 1280)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !96, line: 38, flags: DIFlagFwdDecl)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !95, file: !96, line: 93, baseType: !114, size: 64, offset: 1344)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !95, file: !96, line: 94, baseType: !47, size: 64, offset: 1408)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !95, file: !96, line: 95, baseType: !50, size: 64, offset: 1472)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !95, file: !96, line: 96, baseType: !48, size: 32, offset: 1536)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !95, file: !96, line: 98, baseType: !144, size: 160, offset: 1568)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 160, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 20)
!147 = !DILocalVariable(name: "c", scope: !85, file: !3, line: 123, type: !48)
!148 = !DILocalVariable(name: "column", scope: !85, file: !3, line: 124, type: !50)
!149 = !DILocalVariable(name: "offset_out", scope: !85, file: !3, line: 125, type: !50)
!150 = !DILocalVariable(name: "saved_errno", scope: !85, file: !3, line: 128, type: !48)
!151 = !DILocalVariable(name: "found_blank", scope: !152, file: !3, line: 169, type: !58)
!152 = distinct !DILexicalBlock(scope: !153, file: !3, line: 168, column: 13)
!153 = distinct !DILexicalBlock(scope: !154, file: !3, line: 167, column: 15)
!154 = distinct !DILexicalBlock(scope: !155, file: !3, line: 163, column: 9)
!155 = distinct !DILexicalBlock(scope: !156, file: !3, line: 162, column: 11)
!156 = distinct !DILexicalBlock(scope: !85, file: !3, line: 147, column: 5)
!157 = !DILocalVariable(name: "logical_end", scope: !152, file: !3, line: 170, type: !50)
!158 = !DILocalVariable(name: "i", scope: !159, file: !3, line: 185, type: !50)
!159 = distinct !DILexicalBlock(scope: !160, file: !3, line: 184, column: 17)
!160 = distinct !DILexicalBlock(scope: !152, file: !3, line: 183, column: 19)
!161 = !DIGlobalVariableExpression(var: !162, expr: !DIExpression())
!162 = distinct !DIGlobalVariable(name: "allocated_out", scope: !85, file: !3, line: 127, type: !50, isLocal: true, isDefinition: true)
!163 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!164 = !DIGlobalVariableExpression(var: !57, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "Version", scope: !167, file: !168, line: 2, type: !76, isDefinition: true)
!167 = distinct !DICompileUnit(language: DW_LANG_C99, file: !168, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !169, globals: !170)
!168 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!169 = !{}
!170 = !{!165}
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(name: "file_name", scope: !173, file: !178, line: 46, type: !76, isLocal: true, isDefinition: true)
!173 = distinct !DICompileUnit(language: DW_LANG_C99, file: !174, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !169, globals: !175)
!174 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!175 = !{!171, !176}
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !173, file: !178, line: 56, type: !58, isLocal: true, isDefinition: true)
!178 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(name: "exit_failure", scope: !181, file: !184, line: 24, type: !185, isDefinition: true)
!181 = distinct !DICompileUnit(language: DW_LANG_C99, file: !182, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !169, globals: !183)
!182 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!183 = !{!179}
!184 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!185 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !48)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "program_name", scope: !188, file: !192, line: 33, type: !76, isDefinition: true)
!188 = distinct !DICompileUnit(language: DW_LANG_C99, file: !189, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !169, retainedTypes: !190, globals: !191)
!189 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!190 = !{!47, !45}
!191 = !{!186}
!192 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !195, file: !207, line: 85, type: !242, isDefinition: true)
!195 = distinct !DICompileUnit(language: DW_LANG_C99, file: !196, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !197, retainedTypes: !203, globals: !204)
!196 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!197 = !{!5, !198, !29}
!198 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, baseType: !7, size: 32, elements: !199)
!199 = !{!200, !201, !202}
!200 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!201 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!202 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!203 = !{!48, !49, !50, !45}
!204 = !{!193, !205, !212, !224, !226, !231, !238, !240}
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !195, file: !207, line: 101, type: !208, isDefinition: true)
!207 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 320, elements: !210)
!209 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!210 = !{!211}
!211 = !DISubrange(count: 10)
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !195, file: !207, line: 1052, type: !214, isDefinition: true)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !207, line: 65, size: 448, elements: !215)
!215 = !{!216, !217, !218, !222, !223}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !214, file: !207, line: 68, baseType: !5, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !214, file: !207, line: 71, baseType: !48, size: 32, offset: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !214, file: !207, line: 75, baseType: !219, size: 256, offset: 64)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !220)
!220 = !{!221}
!221 = !DISubrange(count: 8)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !214, file: !207, line: 78, baseType: !76, size: 64, offset: 320)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !214, file: !207, line: 81, baseType: !76, size: 64, offset: 384)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !195, file: !207, line: 116, type: !214, isLocal: true, isDefinition: true)
!226 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!227 = distinct !DIGlobalVariable(name: "slot0", scope: !195, file: !207, line: 842, type: !228, isLocal: true, isDefinition: true)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 2048, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 256)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(name: "slotvec", scope: !195, file: !207, line: 845, type: !233, isLocal: true, isDefinition: true)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !207, line: 834, size: 128, elements: !235)
!235 = !{!236, !237}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !234, file: !207, line: 836, baseType: !50, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !234, file: !207, line: 837, baseType: !45, size: 64, offset: 64)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(name: "nslots", scope: !195, file: !207, line: 843, type: !48, isLocal: true, isDefinition: true)
!240 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!241 = distinct !DIGlobalVariable(name: "slotvec0", scope: !195, file: !207, line: 844, type: !234, isLocal: true, isDefinition: true)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !243, size: 704, elements: !244)
!243 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!244 = !{!245}
!245 = !DISubrange(count: 11)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !248, file: !251, line: 26, type: !252, isDefinition: true)
!248 = distinct !DICompileUnit(language: DW_LANG_C99, file: !249, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !169, globals: !250)
!249 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!250 = !{!246}
!251 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 376, elements: !253)
!253 = !{!254}
!254 = !DISubrange(count: 47)
!255 = distinct !DICompileUnit(language: DW_LANG_C99, file: !256, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !257)
!256 = !DIFile(filename: "./lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!257 = !{!20}
!258 = distinct !DICompileUnit(language: DW_LANG_C99, file: !259, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !260, retainedTypes: !265)
!259 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!260 = !{!261}
!261 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !262, line: 41, baseType: !7, size: 32, elements: !263)
!262 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!263 = !{!264}
!264 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2018, isUnsigned: true)
!265 = !{!47}
!266 = distinct !DICompileUnit(language: DW_LANG_C99, file: !267, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !268, retainedTypes: !282)
!267 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!268 = !{!269}
!269 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !271, file: !270, line: 186, baseType: !7, size: 32, elements: !280)
!270 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!271 = distinct !DISubprogram(name: "x2nrealloc", scope: !270, file: !270, line: 174, type: !272, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: true, unit: !266, retainedNodes: !275)
!272 = !DISubroutineType(types: !273)
!273 = !{!47, !47, !274, !50}
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!275 = !{!276, !277, !278, !279}
!276 = !DILocalVariable(name: "p", arg: 1, scope: !271, file: !270, line: 174, type: !47)
!277 = !DILocalVariable(name: "pn", arg: 2, scope: !271, file: !270, line: 174, type: !274)
!278 = !DILocalVariable(name: "s", arg: 3, scope: !271, file: !270, line: 174, type: !50)
!279 = !DILocalVariable(name: "n", scope: !271, file: !270, line: 176, type: !50)
!280 = !{!281}
!281 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!282 = !{!50, !45, !47}
!283 = distinct !DICompileUnit(language: DW_LANG_C99, file: !284, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !169)
!284 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!285 = distinct !DICompileUnit(language: DW_LANG_C99, file: !286, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !287)
!286 = !DIFile(filename: "./lib/xdectoumax.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!287 = !{!288}
!288 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !289, line: 26, baseType: !7, size: 32, elements: !290)
!289 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!290 = !{!291, !292, !293, !294, !295}
!291 = !DIEnumerator(name: "LONGINT_OK", value: 0, isUnsigned: true)
!292 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1, isUnsigned: true)
!293 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2, isUnsigned: true)
!294 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3, isUnsigned: true)
!295 = !DIEnumerator(name: "LONGINT_INVALID", value: 4, isUnsigned: true)
!296 = distinct !DICompileUnit(language: DW_LANG_C99, file: !297, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !298, retainedTypes: !299)
!297 = !DIFile(filename: "./lib/xstrtoumax.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!298 = !{!288, !29}
!299 = !{!48, !49}
!300 = distinct !DICompileUnit(language: DW_LANG_C99, file: !301, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !169, retainedTypes: !265)
!301 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!302 = distinct !DICompileUnit(language: DW_LANG_C99, file: !303, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !169)
!303 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!304 = distinct !DICompileUnit(language: DW_LANG_C99, file: !305, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !169, retainedTypes: !265)
!305 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!306 = distinct !DICompileUnit(language: DW_LANG_C99, file: !307, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !169, retainedTypes: !265)
!307 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!308 = distinct !DICompileUnit(language: DW_LANG_C99, file: !309, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !169, retainedTypes: !310)
!309 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!310 = !{!50}
!311 = distinct !DICompileUnit(language: DW_LANG_C99, file: !312, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !169)
!312 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!313 = distinct !DICompileUnit(language: DW_LANG_C99, file: !314, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !169)
!314 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!315 = distinct !DICompileUnit(language: DW_LANG_C99, file: !316, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !317, retainedTypes: !265)
!316 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!317 = !{!318}
!318 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !319, line: 41, baseType: !7, size: 32, elements: !320)
!319 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!320 = !{!321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703}
!321 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!322 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!323 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!324 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!325 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!326 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!327 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!328 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!329 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!330 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!331 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!332 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!333 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!334 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!335 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!336 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!337 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!338 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!339 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!340 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!341 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!342 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!343 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!344 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!345 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!346 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!347 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!348 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!349 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!350 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!351 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!352 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!353 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!354 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!355 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!356 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!357 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!358 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!359 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!360 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!361 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!362 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!363 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!364 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!365 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!366 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!367 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!368 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!369 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!370 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!371 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!372 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!373 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!374 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!375 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!376 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!377 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!378 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!379 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!380 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!381 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!382 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!383 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!384 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!385 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!386 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!387 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!388 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!389 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!390 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!391 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!392 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!393 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!394 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!395 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!396 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!397 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!398 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!399 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!400 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!401 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!402 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!403 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!404 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!405 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!406 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!407 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!408 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!409 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!410 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!411 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!412 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!413 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!414 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!415 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!416 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!417 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!418 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!419 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!420 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!421 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!422 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!423 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!424 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!425 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!426 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!427 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!428 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!429 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!430 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!431 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!432 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!433 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!434 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!435 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!436 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!437 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!438 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!439 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!440 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!441 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!442 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!443 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!444 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!445 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!446 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!447 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!448 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!449 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!450 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!451 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!452 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!453 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!454 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!455 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!456 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!457 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!458 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!459 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!460 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!461 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!462 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!463 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!464 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!465 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!466 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!467 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!468 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!469 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!470 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!471 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!472 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!473 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!474 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!475 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!476 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!477 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!478 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!479 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!480 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!481 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!482 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!483 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!484 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!485 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!486 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!487 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!488 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!489 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!490 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!491 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!492 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!493 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!494 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!495 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!496 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!497 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!498 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!499 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!500 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!501 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!502 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!503 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!504 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!505 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!506 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!507 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!508 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!509 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!510 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!511 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!512 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!513 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!514 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!515 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!516 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!517 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!518 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!519 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!520 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!521 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!522 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!523 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!524 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!525 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!526 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!527 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!528 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!529 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!530 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!531 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!532 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!533 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!534 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!535 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!536 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!537 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!538 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!539 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!540 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!541 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!542 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!543 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!544 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!545 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!546 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!547 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!548 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!549 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!550 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!551 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!552 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!553 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!554 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!555 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!556 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!557 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!558 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!559 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!560 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!561 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!562 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!563 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!564 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!565 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!566 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!567 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!568 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!569 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!570 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!571 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!572 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!573 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!574 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!575 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!576 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!577 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!578 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!579 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!580 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!581 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!582 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!583 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!584 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!585 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!586 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!587 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!588 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!589 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!590 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!591 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!592 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!593 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!594 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!595 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!596 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!597 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!598 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!599 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!600 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!601 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!602 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!603 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!604 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!605 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!606 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!607 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!608 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!609 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!610 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!611 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!612 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!613 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!614 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!615 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!616 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!617 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!618 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!619 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!620 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!621 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!622 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!623 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!624 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!625 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!626 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!627 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!628 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!629 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!630 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!631 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!632 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!633 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!634 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!635 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!636 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!637 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!638 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!639 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!640 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!645 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!646 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!647 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!648 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!661 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!662 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!663 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!664 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!665 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!666 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!667 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!668 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!669 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!670 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!671 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!672 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!673 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!674 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!675 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!676 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!677 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!678 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!679 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!680 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!681 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!682 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!683 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!684 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!685 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!686 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!687 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!688 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!689 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!690 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!691 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!692 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!693 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!694 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!695 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!696 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!697 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!698 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!699 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!700 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!701 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!702 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!703 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!704 = !{!"clang version 7.0.0 (tags/RELEASE_700/final)"}
!705 = !{i32 2, !"Dwarf Version", i32 4}
!706 = !{i32 2, !"Debug Info Version", i32 3}
!707 = !{i32 1, !"wchar_size", i32 4}
!708 = !{i32 7, !"PIC Level", i32 2}
!709 = !{i32 7, !"PIE Level", i32 2}
!710 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 60, type: !711, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, retainedNodes: !713)
!711 = !DISubroutineType(types: !712)
!712 = !{null, !48}
!713 = !{!714}
!714 = !DILocalVariable(name: "status", arg: 1, scope: !710, file: !3, line: 60, type: !48)
!715 = !DILocalVariable(name: "infomap", scope: !716, file: !717, line: 632, type: !731)
!716 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !717, file: !717, line: 630, type: !718, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !720)
!717 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!718 = !DISubroutineType(types: !719)
!719 = !{null, !76}
!720 = !{!721, !715, !722, !723, !730}
!721 = !DILocalVariable(name: "program", arg: 1, scope: !716, file: !717, line: 630, type: !76)
!722 = !DILocalVariable(name: "node", scope: !716, file: !717, line: 642, type: !76)
!723 = !DILocalVariable(name: "map_prog", scope: !716, file: !717, line: 643, type: !724)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !726)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !716, file: !717, line: 632, size: 128, elements: !727)
!727 = !{!728, !729}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !726, file: !717, line: 632, baseType: !76, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !726, file: !717, line: 632, baseType: !76, size: 64, offset: 64)
!730 = !DILocalVariable(name: "lc_messages", scope: !716, file: !717, line: 655, type: !76)
!731 = !DICompositeType(tag: DW_TAG_array_type, baseType: !725, size: 896, elements: !732)
!732 = !{!733}
!733 = !DISubrange(count: 7)
!734 = !DILocation(line: 632, column: 67, scope: !716, inlinedAt: !735)
!735 = distinct !DILocation(line: 84, column: 7, scope: !736)
!736 = distinct !DILexicalBlock(scope: !737, file: !3, line: 65, column: 5)
!737 = distinct !DILexicalBlock(scope: !710, file: !3, line: 62, column: 7)
!738 = !DILocation(line: 60, column: 12, scope: !710)
!739 = !DILocation(line: 62, column: 14, scope: !737)
!740 = !DILocation(line: 62, column: 7, scope: !710)
!741 = !DILocation(line: 63, column: 5, scope: !742)
!742 = distinct !DILexicalBlock(scope: !737, file: !3, line: 63, column: 5)
!743 = !{!744, !744, i64 0}
!744 = !{!"any pointer", !745, i64 0}
!745 = !{!"omnipotent char", !746, i64 0}
!746 = !{!"Simple C/C++ TBAA"}
!747 = !DILocation(line: 66, column: 7, scope: !736)
!748 = !DILocation(line: 70, column: 7, scope: !736)
!749 = !DILocation(line: 580, column: 3, scope: !750, inlinedAt: !753)
!750 = distinct !DISubprogram(name: "emit_stdin_note", scope: !717, file: !717, line: 578, type: !751, isLocal: true, isDefinition: true, scopeLine: 579, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !169)
!751 = !DISubroutineType(types: !752)
!752 = !{null}
!753 = distinct !DILocation(line: 74, column: 7, scope: !736)
!754 = !DILocation(line: 587, column: 3, scope: !755, inlinedAt: !756)
!755 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !717, file: !717, line: 585, type: !751, isLocal: true, isDefinition: true, scopeLine: 586, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !169)
!756 = distinct !DILocation(line: 75, column: 7, scope: !736)
!757 = !DILocation(line: 77, column: 7, scope: !736)
!758 = !DILocation(line: 82, column: 7, scope: !736)
!759 = !DILocation(line: 83, column: 7, scope: !736)
!760 = !DILocation(line: 632, column: 3, scope: !716, inlinedAt: !735)
!761 = !DILocation(line: 643, column: 36, scope: !716, inlinedAt: !735)
!762 = !DILocation(line: 643, column: 25, scope: !716, inlinedAt: !735)
!763 = !DILocation(line: 645, column: 33, scope: !716, inlinedAt: !735)
!764 = !DILocation(line: 645, column: 3, scope: !716, inlinedAt: !735)
!765 = !DILocation(line: 646, column: 13, scope: !716, inlinedAt: !735)
!766 = !DILocation(line: 645, column: 20, scope: !716, inlinedAt: !735)
!767 = !{!768, !744, i64 0}
!768 = !{!"infomap", !744, i64 0, !744, i64 8}
!769 = !DILocation(line: 645, column: 10, scope: !716, inlinedAt: !735)
!770 = !DILocation(line: 645, column: 28, scope: !716, inlinedAt: !735)
!771 = distinct !{!771, !772, !773}
!772 = !DILocation(line: 645, column: 3, scope: !716)
!773 = !DILocation(line: 646, column: 13, scope: !716)
!774 = !DILocation(line: 648, column: 17, scope: !775, inlinedAt: !735)
!775 = distinct !DILexicalBlock(scope: !716, file: !717, line: 648, column: 7)
!776 = !{!768, !744, i64 8}
!777 = !DILocation(line: 648, column: 7, scope: !775, inlinedAt: !735)
!778 = !DILocation(line: 648, column: 7, scope: !716, inlinedAt: !735)
!779 = !DILocation(line: 642, column: 15, scope: !716, inlinedAt: !735)
!780 = !DILocation(line: 651, column: 3, scope: !716, inlinedAt: !735)
!781 = !DILocation(line: 655, column: 29, scope: !716, inlinedAt: !735)
!782 = !DILocation(line: 655, column: 15, scope: !716, inlinedAt: !735)
!783 = !DILocation(line: 656, column: 7, scope: !784, inlinedAt: !735)
!784 = distinct !DILexicalBlock(scope: !716, file: !717, line: 656, column: 7)
!785 = !DILocation(line: 656, column: 19, scope: !784, inlinedAt: !735)
!786 = !DILocation(line: 656, column: 22, scope: !784, inlinedAt: !735)
!787 = !DILocation(line: 656, column: 7, scope: !716, inlinedAt: !735)
!788 = !DILocation(line: 662, column: 7, scope: !789, inlinedAt: !735)
!789 = distinct !DILexicalBlock(scope: !784, file: !717, line: 657, column: 5)
!790 = !DILocation(line: 664, column: 5, scope: !789, inlinedAt: !735)
!791 = !DILocation(line: 665, column: 3, scope: !716, inlinedAt: !735)
!792 = !DILocation(line: 667, column: 3, scope: !716, inlinedAt: !735)
!793 = !DILocation(line: 669, column: 1, scope: !716, inlinedAt: !735)
!794 = !DILocation(line: 86, column: 3, scope: !710)
!795 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 240, type: !796, isDefinition: true, scopeLine: 241, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !799)
!796 = !DISubroutineType(types: !797)
!797 = !{!48, !48, !798}
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!799 = !{!800, !801, !802, !803, !804, !805, !806}
!800 = !DILocalVariable(name: "argc", arg: 1, scope: !795, file: !3, line: 240, type: !48)
!801 = !DILocalVariable(name: "argv", arg: 2, scope: !795, file: !3, line: 240, type: !798)
!802 = !DILocalVariable(name: "width", scope: !795, file: !3, line: 242, type: !50)
!803 = !DILocalVariable(name: "i", scope: !795, file: !3, line: 243, type: !48)
!804 = !DILocalVariable(name: "optc", scope: !795, file: !3, line: 244, type: !48)
!805 = !DILocalVariable(name: "ok", scope: !795, file: !3, line: 245, type: !58)
!806 = !DILocalVariable(name: "optargbuf", scope: !807, file: !3, line: 259, type: !808)
!807 = distinct !DILexicalBlock(scope: !795, file: !3, line: 258, column: 5)
!808 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 16, elements: !809)
!809 = !{!810}
!810 = !DISubrange(count: 2)
!811 = !DILocation(line: 240, column: 11, scope: !795)
!812 = !DILocation(line: 240, column: 24, scope: !795)
!813 = !DILocation(line: 242, column: 10, scope: !795)
!814 = !DILocation(line: 248, column: 21, scope: !795)
!815 = !DILocation(line: 248, column: 3, scope: !795)
!816 = !DILocation(line: 249, column: 3, scope: !795)
!817 = !DILocation(line: 250, column: 3, scope: !795)
!818 = !DILocation(line: 251, column: 3, scope: !795)
!819 = !DILocation(line: 253, column: 3, scope: !795)
!820 = !DILocation(line: 257, column: 18, scope: !795)
!821 = !DILocation(line: 244, column: 7, scope: !795)
!822 = !DILocation(line: 257, column: 71, scope: !795)
!823 = !DILocation(line: 257, column: 3, scope: !795)
!824 = !DILocation(line: 259, column: 7, scope: !807)
!825 = !DILocation(line: 259, column: 12, scope: !807)
!826 = !DILocation(line: 261, column: 7, scope: !807)
!827 = !DILocation(line: 283, column: 31, scope: !828)
!828 = distinct !DILexicalBlock(scope: !807, file: !3, line: 262, column: 9)
!829 = !DILocation(line: 265, column: 11, scope: !828)
!830 = !DILocation(line: 269, column: 11, scope: !828)
!831 = !DILocation(line: 273, column: 15, scope: !832)
!832 = distinct !DILexicalBlock(scope: !828, file: !3, line: 273, column: 15)
!833 = !DILocation(line: 273, column: 15, scope: !828)
!834 = !DILocation(line: 274, column: 19, scope: !832)
!835 = !DILocation(line: 274, column: 13, scope: !832)
!836 = !DILocation(line: 277, column: 30, scope: !837)
!837 = distinct !DILexicalBlock(scope: !832, file: !3, line: 276, column: 13)
!838 = !DILocation(line: 277, column: 28, scope: !837)
!839 = !{!745, !745, i64 0}
!840 = !DILocation(line: 278, column: 28, scope: !837)
!841 = !DILocation(line: 279, column: 22, scope: !837)
!842 = !DILocation(line: 284, column: 31, scope: !828)
!843 = !DILocation(line: 283, column: 19, scope: !828)
!844 = !DILocation(line: 285, column: 11, scope: !828)
!845 = !DILocation(line: 287, column: 9, scope: !828)
!846 = !DILocation(line: 289, column: 9, scope: !828)
!847 = !DILocation(line: 292, column: 11, scope: !828)
!848 = !DILocation(scope: !795)
!849 = !DILocation(line: 294, column: 5, scope: !795)
!850 = distinct !{!850, !823, !849}
!851 = !DILocation(scope: !828)
!852 = !DILocation(line: 296, column: 15, scope: !853)
!853 = distinct !DILexicalBlock(scope: !795, file: !3, line: 296, column: 7)
!854 = !{!855, !855, i64 0}
!855 = !{!"int", !745, i64 0}
!856 = !DILocation(line: 296, column: 12, scope: !853)
!857 = !DILocation(line: 296, column: 7, scope: !795)
!858 = !DILocation(line: 245, column: 8, scope: !795)
!859 = !DILocation(line: 243, column: 7, scope: !795)
!860 = !DILocation(line: 301, column: 26, scope: !861)
!861 = distinct !DILexicalBlock(scope: !862, file: !3, line: 301, column: 7)
!862 = distinct !DILexicalBlock(scope: !863, file: !3, line: 301, column: 7)
!863 = distinct !DILexicalBlock(scope: !853, file: !3, line: 299, column: 5)
!864 = !DILocation(line: 301, column: 7, scope: !862)
!865 = !DILocation(line: 302, column: 26, scope: !861)
!866 = !DILocation(line: 297, column: 10, scope: !853)
!867 = !DILocation(line: 297, column: 8, scope: !853)
!868 = !DILocation(line: 297, column: 5, scope: !853)
!869 = !DILocation(line: 302, column: 15, scope: !861)
!870 = !DILocation(line: 302, column: 12, scope: !861)
!871 = !DILocation(line: 301, column: 35, scope: !861)
!872 = distinct !{!872, !864, !873}
!873 = !DILocation(line: 302, column: 40, scope: !862)
!874 = !DILocation(scope: !863)
!875 = !DILocation(line: 305, column: 23, scope: !876)
!876 = distinct !DILexicalBlock(scope: !795, file: !3, line: 305, column: 7)
!877 = !DILocation(line: 305, column: 34, scope: !876)
!878 = !DILocation(line: 305, column: 26, scope: !876)
!879 = !DILocation(line: 305, column: 41, scope: !876)
!880 = !DILocation(line: 305, column: 7, scope: !795)
!881 = !DILocation(line: 306, column: 5, scope: !876)
!882 = !DILocation(line: 308, column: 10, scope: !795)
!883 = !DILocation(line: 308, column: 3, scope: !795)
!884 = !DILocation(line: 120, column: 24, scope: !85)
!885 = !DILocation(line: 120, column: 41, scope: !85)
!886 = !DILocation(line: 124, column: 10, scope: !85)
!887 = !DILocation(line: 125, column: 10, scope: !85)
!888 = !DILocation(line: 130, column: 7, scope: !889)
!889 = distinct !DILexicalBlock(scope: !85, file: !3, line: 130, column: 7)
!890 = !DILocation(line: 130, column: 7, scope: !85)
!891 = !DILocation(line: 132, column: 17, scope: !892)
!892 = distinct !DILexicalBlock(scope: !889, file: !3, line: 131, column: 5)
!893 = !DILocation(line: 122, column: 9, scope: !85)
!894 = !DILocation(line: 134, column: 5, scope: !892)
!895 = !DILocation(line: 136, column: 15, scope: !889)
!896 = !DILocation(scope: !889)
!897 = !DILocation(line: 138, column: 15, scope: !898)
!898 = distinct !DILexicalBlock(scope: !85, file: !3, line: 138, column: 7)
!899 = !DILocation(line: 138, column: 7, scope: !85)
!900 = !DILocation(line: 140, column: 17, scope: !901)
!901 = distinct !DILexicalBlock(scope: !898, file: !3, line: 139, column: 5)
!902 = !DILocation(line: 140, column: 30, scope: !901)
!903 = !DILocation(line: 140, column: 7, scope: !901)
!904 = !DILocation(line: 141, column: 7, scope: !901)
!905 = !DILocation(line: 144, column: 3, scope: !85)
!906 = !DILocation(line: 146, column: 3, scope: !85)
!907 = !DILocation(scope: !156)
!908 = !DILocalVariable(name: "__fp", arg: 1, scope: !909, file: !910, line: 66, type: !92)
!909 = distinct !DISubprogram(name: "getc_unlocked", scope: !910, file: !910, line: 66, type: !911, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !913)
!910 = !DIFile(filename: "/usr/include/bits/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!911 = !DISubroutineType(types: !912)
!912 = !{!48, !92}
!913 = !{!908}
!914 = !DILocation(line: 66, column: 22, scope: !909, inlinedAt: !915)
!915 = distinct !DILocation(line: 146, column: 15, scope: !85)
!916 = !DILocation(line: 68, column: 10, scope: !909, inlinedAt: !915)
!917 = !{!918, !744, i64 8}
!918 = !{!"_IO_FILE", !855, i64 0, !744, i64 8, !744, i64 16, !744, i64 24, !744, i64 32, !744, i64 40, !744, i64 48, !744, i64 56, !744, i64 64, !744, i64 72, !744, i64 80, !744, i64 88, !744, i64 96, !744, i64 104, !855, i64 112, !855, i64 116, !919, i64 120, !920, i64 128, !745, i64 130, !745, i64 131, !744, i64 136, !919, i64 144, !744, i64 152, !744, i64 160, !744, i64 168, !744, i64 176, !919, i64 184, !855, i64 192, !745, i64 196}
!919 = !{!"long", !745, i64 0}
!920 = !{!"short", !745, i64 0}
!921 = !{!918, !744, i64 16}
!922 = !{!"branch_weights", i32 2000, i32 1}
!923 = !DILocation(line: 123, column: 7, scope: !85)
!924 = !DILocation(line: 146, column: 31, scope: !85)
!925 = !DILocation(line: 148, column: 22, scope: !926)
!926 = distinct !DILexicalBlock(scope: !156, file: !3, line: 148, column: 11)
!927 = !DILocation(line: 148, column: 29, scope: !926)
!928 = !{!919, !919, i64 0}
!929 = !DILocation(line: 148, column: 26, scope: !926)
!930 = !DILocation(line: 148, column: 11, scope: !156)
!931 = !DILocation(line: 149, column: 20, scope: !926)
!932 = !DILocation(line: 149, column: 18, scope: !926)
!933 = !DILocation(line: 149, column: 9, scope: !926)
!934 = !DILocation(line: 151, column: 13, scope: !935)
!935 = distinct !DILexicalBlock(scope: !156, file: !3, line: 151, column: 11)
!936 = !DILocation(line: 151, column: 11, scope: !156)
!937 = !DILocation(line: 153, column: 11, scope: !938)
!938 = distinct !DILexicalBlock(scope: !935, file: !3, line: 152, column: 9)
!939 = !DILocation(line: 153, column: 34, scope: !938)
!940 = !DILocation(line: 154, column: 11, scope: !938)
!941 = !DILocation(line: 156, column: 11, scope: !938)
!942 = distinct !{!942, !906, !943}
!943 = !DILocation(line: 216, column: 5, scope: !85)
!944 = !DILocation(scope: !945)
!945 = distinct !DILexicalBlock(scope: !159, file: !3, line: 197, column: 19)
!946 = !DILocation(scope: !159)
!947 = !DILocalVariable(name: "column", arg: 1, scope: !948, file: !3, line: 94, type: !50)
!948 = distinct !DISubprogram(name: "adjust_column", scope: !3, file: !3, line: 94, type: !949, isLocal: true, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !951)
!949 = !DISubroutineType(types: !950)
!950 = !{!50, !50, !46}
!951 = !{!947, !952}
!952 = !DILocalVariable(name: "c", arg: 2, scope: !948, file: !3, line: 94, type: !46)
!953 = !DILocation(line: 94, column: 23, scope: !948, inlinedAt: !954)
!954 = distinct !DILocation(line: 160, column: 16, scope: !156)
!955 = !DILocation(line: 94, column: 36, scope: !948, inlinedAt: !954)
!956 = !DILocation(line: 96, column: 7, scope: !948, inlinedAt: !954)
!957 = !DILocation(line: 98, column: 11, scope: !958, inlinedAt: !954)
!958 = distinct !DILexicalBlock(scope: !959, file: !3, line: 97, column: 5)
!959 = distinct !DILexicalBlock(scope: !948, file: !3, line: 96, column: 7)
!960 = !DILocation(line: 100, column: 22, scope: !961, inlinedAt: !954)
!961 = distinct !DILexicalBlock(scope: !962, file: !3, line: 100, column: 15)
!962 = distinct !DILexicalBlock(scope: !963, file: !3, line: 99, column: 9)
!963 = distinct !DILexicalBlock(scope: !958, file: !3, line: 98, column: 11)
!964 = !DILocation(line: 101, column: 19, scope: !961, inlinedAt: !954)
!965 = !DILocation(line: 100, column: 15, scope: !962, inlinedAt: !954)
!966 = !DILocation(line: 106, column: 38, scope: !967, inlinedAt: !954)
!967 = distinct !DILexicalBlock(scope: !968, file: !3, line: 105, column: 16)
!968 = distinct !DILexicalBlock(scope: !963, file: !3, line: 103, column: 16)
!969 = !DILocation(line: 106, column: 29, scope: !967, inlinedAt: !954)
!970 = !DILocation(line: 106, column: 16, scope: !967, inlinedAt: !954)
!971 = !DILocation(line: 106, column: 9, scope: !967, inlinedAt: !954)
!972 = !DILocation(line: 108, column: 15, scope: !967, inlinedAt: !954)
!973 = !DILocation(line: 111, column: 11, scope: !959, inlinedAt: !954)
!974 = !DILocation(line: 162, column: 18, scope: !155)
!975 = !DILocation(line: 162, column: 11, scope: !156)
!976 = !DILocation(line: 167, column: 15, scope: !154)
!977 = !DILocation(scope: !978)
!978 = distinct !DILexicalBlock(scope: !152, file: !3, line: 174, column: 17)
!979 = !DILocation(line: 170, column: 22, scope: !152)
!980 = !DILocation(line: 173, column: 15, scope: !152)
!981 = !DILocation(line: 175, column: 19, scope: !978)
!982 = !DILocation(line: 176, column: 23, scope: !983)
!983 = distinct !DILexicalBlock(scope: !978, file: !3, line: 176, column: 23)
!984 = !{!920, !920, i64 0}
!985 = !DILocation(line: 176, column: 23, scope: !978)
!986 = distinct !{!986, !980, !987}
!987 = !DILocation(line: 181, column: 17, scope: !152)
!988 = !DILocation(line: 189, column: 19, scope: !159)
!989 = !DILocalVariable(name: "__c", arg: 1, scope: !990, file: !910, line: 108, type: !48)
!990 = distinct !DISubprogram(name: "putchar_unlocked", scope: !910, file: !910, line: 108, type: !991, isDefinition: true, scopeLine: 109, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !993)
!991 = !DISubroutineType(types: !992)
!992 = !{!48, !48}
!993 = !{!989}
!994 = !DILocation(line: 108, column: 23, scope: !990, inlinedAt: !995)
!995 = distinct !DILocation(line: 191, column: 19, scope: !159)
!996 = !DILocation(line: 110, column: 10, scope: !990, inlinedAt: !995)
!997 = !{!918, !744, i64 40}
!998 = !{!918, !744, i64 48}
!999 = !DILocation(line: 194, column: 28, scope: !159)
!1000 = !DILocation(line: 194, column: 47, scope: !159)
!1001 = !DILocation(line: 195, column: 39, scope: !159)
!1002 = !DILocation(line: 194, column: 19, scope: !159)
!1003 = !DILocation(line: 185, column: 26, scope: !159)
!1004 = !DILocation(line: 197, column: 42, scope: !1005)
!1005 = distinct !DILexicalBlock(scope: !945, file: !3, line: 197, column: 19)
!1006 = !DILocation(line: 197, column: 19, scope: !945)
!1007 = !DILocation(line: 94, column: 23, scope: !948, inlinedAt: !1008)
!1008 = distinct !DILocation(line: 198, column: 30, scope: !1005)
!1009 = !DILocation(line: 96, column: 7, scope: !948, inlinedAt: !1008)
!1010 = !DILocation(line: 198, column: 53, scope: !1005)
!1011 = !DILocation(line: 94, column: 36, scope: !948, inlinedAt: !1008)
!1012 = !DILocation(line: 98, column: 11, scope: !958, inlinedAt: !1008)
!1013 = !DILocation(line: 100, column: 22, scope: !961, inlinedAt: !1008)
!1014 = !DILocation(line: 101, column: 19, scope: !961, inlinedAt: !1008)
!1015 = !DILocation(line: 100, column: 15, scope: !962, inlinedAt: !1008)
!1016 = !DILocation(line: 106, column: 38, scope: !967, inlinedAt: !1008)
!1017 = !DILocation(line: 106, column: 29, scope: !967, inlinedAt: !1008)
!1018 = !DILocation(line: 106, column: 16, scope: !967, inlinedAt: !1008)
!1019 = !DILocation(line: 106, column: 9, scope: !967, inlinedAt: !1008)
!1020 = !DILocation(line: 108, column: 15, scope: !967, inlinedAt: !1008)
!1021 = !DILocation(line: 111, column: 11, scope: !959, inlinedAt: !1008)
!1022 = !DILocation(line: 197, column: 57, scope: !1005)
!1023 = distinct !{!1023, !1006, !1024}
!1024 = !DILocation(line: 198, column: 64, scope: !945)
!1025 = !DILocation(line: 203, column: 26, scope: !1026)
!1026 = distinct !DILexicalBlock(scope: !154, file: !3, line: 203, column: 15)
!1027 = !DILocation(scope: !154)
!1028 = !DILocation(line: 203, column: 15, scope: !154)
!1029 = !DILocation(line: 205, column: 38, scope: !1030)
!1030 = distinct !DILexicalBlock(scope: !1026, file: !3, line: 204, column: 13)
!1031 = !DILocation(line: 206, column: 15, scope: !1030)
!1032 = !DILocation(line: 209, column: 34, scope: !154)
!1033 = !DILocation(line: 210, column: 11, scope: !154)
!1034 = !DILocation(line: 212, column: 11, scope: !154)
!1035 = !DILocation(line: 215, column: 7, scope: !156)
!1036 = !DILocation(line: 215, column: 26, scope: !156)
!1037 = !DILocation(line: 215, column: 30, scope: !156)
!1038 = !DILocation(line: 218, column: 17, scope: !85)
!1039 = !DILocation(line: 128, column: 7, scope: !85)
!1040 = !DILocation(line: 220, column: 7, scope: !1041)
!1041 = distinct !DILexicalBlock(scope: !85, file: !3, line: 220, column: 7)
!1042 = !DILocation(line: 220, column: 7, scope: !85)
!1043 = !DILocation(line: 221, column: 5, scope: !1041)
!1044 = !DILocalVariable(name: "__stream", arg: 1, scope: !1045, file: !910, line: 135, type: !92)
!1045 = distinct !DISubprogram(name: "ferror_unlocked", scope: !910, file: !910, line: 135, type: !911, isDefinition: true, scopeLine: 136, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1046)
!1046 = !{!1044}
!1047 = !DILocation(line: 135, column: 1, scope: !1045, inlinedAt: !1048)
!1048 = distinct !DILocation(line: 223, column: 7, scope: !1049)
!1049 = distinct !DILexicalBlock(scope: !85, file: !3, line: 223, column: 7)
!1050 = !DILocation(line: 137, column: 10, scope: !1045, inlinedAt: !1048)
!1051 = !{!918, !855, i64 0}
!1052 = !DILocation(line: 223, column: 7, scope: !1049)
!1053 = !DILocation(line: 223, column: 7, scope: !85)
!1054 = !DILocation(line: 225, column: 36, scope: !1055)
!1055 = distinct !DILexicalBlock(scope: !1049, file: !3, line: 224, column: 5)
!1056 = !DILocation(line: 225, column: 7, scope: !1055)
!1057 = !DILocation(line: 226, column: 12, scope: !1058)
!1058 = distinct !DILexicalBlock(scope: !1055, file: !3, line: 226, column: 11)
!1059 = !DILocation(line: 226, column: 11, scope: !1055)
!1060 = !DILocation(line: 227, column: 9, scope: !1058)
!1061 = !DILocation(line: 230, column: 8, scope: !1062)
!1062 = distinct !DILexicalBlock(scope: !85, file: !3, line: 230, column: 7)
!1063 = !DILocation(line: 230, column: 30, scope: !1062)
!1064 = !DILocation(line: 230, column: 33, scope: !1062)
!1065 = !DILocation(line: 230, column: 50, scope: !1062)
!1066 = !DILocation(line: 230, column: 7, scope: !85)
!1067 = !DILocation(line: 232, column: 17, scope: !1068)
!1068 = distinct !DILexicalBlock(scope: !1062, file: !3, line: 231, column: 5)
!1069 = !DILocation(line: 232, column: 30, scope: !1068)
!1070 = !DILocation(line: 232, column: 7, scope: !1068)
!1071 = !DILocation(line: 233, column: 7, scope: !1068)
!1072 = !DILocation(scope: !1068)
!1073 = !DILocation(line: 237, column: 1, scope: !85)
!1074 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !178, file: !178, line: 51, type: !718, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: true, unit: !173, retainedNodes: !1075)
!1075 = !{!1076}
!1076 = !DILocalVariable(name: "file", arg: 1, scope: !1074, file: !178, line: 51, type: !76)
!1077 = !DILocation(line: 51, column: 41, scope: !1074)
!1078 = !DILocation(line: 53, column: 13, scope: !1074)
!1079 = !DILocation(line: 54, column: 1, scope: !1074)
!1080 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !178, file: !178, line: 88, type: !1081, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: true, unit: !173, retainedNodes: !1083)
!1081 = !DISubroutineType(types: !1082)
!1082 = !{null, !58}
!1083 = !{!1084}
!1084 = !DILocalVariable(name: "ignore", arg: 1, scope: !1080, file: !178, line: 88, type: !58)
!1085 = !DILocation(line: 88, column: 37, scope: !1080)
!1086 = !DILocation(line: 90, column: 16, scope: !1080)
!1087 = !{!1088, !1088, i64 0}
!1088 = !{!"_Bool", !745, i64 0}
!1089 = !DILocation(line: 91, column: 1, scope: !1080)
!1090 = distinct !DISubprogram(name: "close_stdout", scope: !178, file: !178, line: 117, type: !751, isDefinition: true, scopeLine: 118, flags: DIFlagPrototyped, isOptimized: true, unit: !173, retainedNodes: !1091)
!1091 = !{!1092}
!1092 = !DILocalVariable(name: "write_error", scope: !1093, file: !178, line: 122, type: !76)
!1093 = distinct !DILexicalBlock(scope: !1094, file: !178, line: 121, column: 5)
!1094 = distinct !DILexicalBlock(scope: !1090, file: !178, line: 119, column: 7)
!1095 = !DILocation(line: 119, column: 21, scope: !1094)
!1096 = !DILocation(line: 119, column: 7, scope: !1094)
!1097 = !DILocation(line: 119, column: 29, scope: !1094)
!1098 = !DILocation(line: 120, column: 7, scope: !1094)
!1099 = !DILocation(line: 120, column: 12, scope: !1094)
!1100 = !{i8 0, i8 2}
!1101 = !DILocation(line: 120, column: 25, scope: !1094)
!1102 = !DILocation(line: 120, column: 28, scope: !1094)
!1103 = !DILocation(line: 120, column: 34, scope: !1094)
!1104 = !DILocation(line: 119, column: 7, scope: !1090)
!1105 = !DILocation(line: 122, column: 33, scope: !1093)
!1106 = !DILocation(line: 122, column: 19, scope: !1093)
!1107 = !DILocation(line: 123, column: 11, scope: !1108)
!1108 = distinct !DILexicalBlock(scope: !1093, file: !178, line: 123, column: 11)
!1109 = !DILocation(scope: !1108)
!1110 = !DILocation(line: 123, column: 11, scope: !1093)
!1111 = !DILocation(line: 124, column: 36, scope: !1108)
!1112 = !DILocation(line: 124, column: 9, scope: !1108)
!1113 = !DILocation(line: 127, column: 9, scope: !1108)
!1114 = !DILocation(line: 129, column: 14, scope: !1093)
!1115 = !DILocation(line: 129, column: 7, scope: !1093)
!1116 = !DILocation(line: 134, column: 42, scope: !1117)
!1117 = distinct !DILexicalBlock(scope: !1090, file: !178, line: 134, column: 7)
!1118 = !DILocation(line: 134, column: 28, scope: !1117)
!1119 = !DILocation(line: 134, column: 50, scope: !1117)
!1120 = !DILocation(line: 134, column: 7, scope: !1090)
!1121 = !DILocation(line: 135, column: 12, scope: !1117)
!1122 = !DILocation(line: 135, column: 5, scope: !1117)
!1123 = !DILocation(line: 136, column: 1, scope: !1090)
!1124 = distinct !DISubprogram(name: "fdadvise", scope: !1125, file: !1125, line: 31, type: !1126, isDefinition: true, scopeLine: 32, flags: DIFlagPrototyped, isOptimized: true, unit: !255, retainedNodes: !1131)
!1125 = !DIFile(filename: "lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!1126 = !DISubroutineType(types: !1127)
!1127 = !{null, !48, !1128, !1128, !1130}
!1128 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !1129, line: 63, baseType: !118)
!1129 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!1130 = !DIDerivedType(tag: DW_TAG_typedef, name: "fadvice_t", file: !21, line: 52, baseType: !20)
!1131 = !{!1132, !1133, !1134, !1135, !1136}
!1132 = !DILocalVariable(name: "fd", arg: 1, scope: !1124, file: !1125, line: 31, type: !48)
!1133 = !DILocalVariable(name: "offset", arg: 2, scope: !1124, file: !1125, line: 31, type: !1128)
!1134 = !DILocalVariable(name: "len", arg: 3, scope: !1124, file: !1125, line: 31, type: !1128)
!1135 = !DILocalVariable(name: "advice", arg: 4, scope: !1124, file: !1125, line: 31, type: !1130)
!1136 = !DILocalVariable(name: "__x", scope: !1137, file: !1125, line: 34, type: !48)
!1137 = distinct !DILexicalBlock(scope: !1124, file: !1125, line: 34, column: 3)
!1138 = !DILocation(line: 31, column: 15, scope: !1124)
!1139 = !DILocation(line: 31, column: 25, scope: !1124)
!1140 = !DILocation(line: 31, column: 39, scope: !1124)
!1141 = !DILocation(line: 31, column: 54, scope: !1124)
!1142 = !DILocation(line: 34, column: 3, scope: !1137)
!1143 = !DILocation(line: 36, column: 1, scope: !1124)
!1144 = distinct !DISubprogram(name: "fadvise", scope: !1125, file: !1125, line: 39, type: !1145, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: true, unit: !255, retainedNodes: !1181)
!1145 = !DISubroutineType(types: !1146)
!1146 = !{null, !1147, !1130}
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64)
!1148 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !94, line: 7, baseType: !1149)
!1149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !96, line: 49, size: 1728, elements: !1150)
!1150 = !{!1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1149, file: !96, line: 51, baseType: !48, size: 32)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1149, file: !96, line: 54, baseType: !45, size: 64, offset: 64)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1149, file: !96, line: 55, baseType: !45, size: 64, offset: 128)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1149, file: !96, line: 56, baseType: !45, size: 64, offset: 192)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1149, file: !96, line: 57, baseType: !45, size: 64, offset: 256)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1149, file: !96, line: 58, baseType: !45, size: 64, offset: 320)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1149, file: !96, line: 59, baseType: !45, size: 64, offset: 384)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1149, file: !96, line: 60, baseType: !45, size: 64, offset: 448)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1149, file: !96, line: 61, baseType: !45, size: 64, offset: 512)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1149, file: !96, line: 64, baseType: !45, size: 64, offset: 576)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1149, file: !96, line: 65, baseType: !45, size: 64, offset: 640)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1149, file: !96, line: 66, baseType: !45, size: 64, offset: 704)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1149, file: !96, line: 68, baseType: !111, size: 64, offset: 768)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1149, file: !96, line: 70, baseType: !1165, size: 64, offset: 832)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1149, file: !96, line: 72, baseType: !48, size: 32, offset: 896)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1149, file: !96, line: 73, baseType: !48, size: 32, offset: 928)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1149, file: !96, line: 74, baseType: !118, size: 64, offset: 960)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1149, file: !96, line: 77, baseType: !49, size: 16, offset: 1024)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1149, file: !96, line: 78, baseType: !123, size: 8, offset: 1040)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1149, file: !96, line: 79, baseType: !125, size: 8, offset: 1048)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1149, file: !96, line: 81, baseType: !129, size: 64, offset: 1088)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1149, file: !96, line: 89, baseType: !132, size: 64, offset: 1152)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1149, file: !96, line: 91, baseType: !134, size: 64, offset: 1216)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1149, file: !96, line: 92, baseType: !137, size: 64, offset: 1280)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1149, file: !96, line: 93, baseType: !1165, size: 64, offset: 1344)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1149, file: !96, line: 94, baseType: !47, size: 64, offset: 1408)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1149, file: !96, line: 95, baseType: !50, size: 64, offset: 1472)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1149, file: !96, line: 96, baseType: !48, size: 32, offset: 1536)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1149, file: !96, line: 98, baseType: !144, size: 160, offset: 1568)
!1181 = !{!1182, !1183}
!1182 = !DILocalVariable(name: "fp", arg: 1, scope: !1144, file: !1125, line: 39, type: !1147)
!1183 = !DILocalVariable(name: "advice", arg: 2, scope: !1144, file: !1125, line: 39, type: !1130)
!1184 = !DILocation(line: 39, column: 16, scope: !1144)
!1185 = !DILocation(line: 39, column: 30, scope: !1144)
!1186 = !DILocation(line: 41, column: 7, scope: !1187)
!1187 = distinct !DILexicalBlock(scope: !1144, file: !1125, line: 41, column: 7)
!1188 = !DILocation(line: 41, column: 7, scope: !1144)
!1189 = !DILocation(line: 42, column: 15, scope: !1187)
!1190 = !DILocation(line: 31, column: 15, scope: !1124, inlinedAt: !1191)
!1191 = distinct !DILocation(line: 42, column: 5, scope: !1187)
!1192 = !DILocation(line: 31, column: 25, scope: !1124, inlinedAt: !1191)
!1193 = !DILocation(line: 31, column: 39, scope: !1124, inlinedAt: !1191)
!1194 = !DILocation(line: 31, column: 54, scope: !1124, inlinedAt: !1191)
!1195 = !DILocation(line: 34, column: 3, scope: !1137, inlinedAt: !1191)
!1196 = !DILocation(line: 42, column: 5, scope: !1187)
!1197 = !DILocation(line: 43, column: 1, scope: !1144)
!1198 = distinct !DISubprogram(name: "set_program_name", scope: !192, file: !192, line: 39, type: !718, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: true, unit: !188, retainedNodes: !1199)
!1199 = !{!1200, !1201, !1202}
