source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [11 x i8] c"Usage: %s\0A\00", align 1
@.str.2 = private unnamed_addr constant [73 x i8] c"Output platform dependent limits in a format useful for shell scripts.\0A\0A\00", align 1
@stdout = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str.3 = private unnamed_addr constant [45 x i8] c"      --help     display this help and exit\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "file_name", scope: !2, file: !3, line: 46, type: !74, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !84, nameTableKind: None)
!3 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{}
!5 = !{!6, !70, !76, !80}
!6 = !DISubprogram(name: "close_stream", scope: !7, file: !7, line: 2, type: !8, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!7 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!8 = !DISubroutineType(types: !9)
!9 = !{!10, !11}
!10 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !13, line: 49, size: 1728, elements: !14)
!13 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!14 = !{!15, !16, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !32, !33, !34, !35, !39, !41, !43, !47, !50, !52, !55, !58, !59, !61, !65, !66}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !12, file: !13, line: 51, baseType: !10, size: 32)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !12, file: !13, line: 54, baseType: !17, size: 64, offset: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !12, file: !13, line: 55, baseType: !17, size: 64, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !12, file: !13, line: 56, baseType: !17, size: 64, offset: 192)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !12, file: !13, line: 57, baseType: !17, size: 64, offset: 256)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !12, file: !13, line: 58, baseType: !17, size: 64, offset: 320)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !12, file: !13, line: 59, baseType: !17, size: 64, offset: 384)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !12, file: !13, line: 60, baseType: !17, size: 64, offset: 448)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !12, file: !13, line: 61, baseType: !17, size: 64, offset: 512)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !12, file: !13, line: 64, baseType: !17, size: 64, offset: 576)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !12, file: !13, line: 65, baseType: !17, size: 64, offset: 640)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !12, file: !13, line: 66, baseType: !17, size: 64, offset: 704)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !12, file: !13, line: 68, baseType: !30, size: 64, offset: 768)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !13, line: 36, flags: DIFlagFwdDecl)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !12, file: !13, line: 70, baseType: !11, size: 64, offset: 832)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !12, file: !13, line: 72, baseType: !10, size: 32, offset: 896)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !12, file: !13, line: 73, baseType: !10, size: 32, offset: 928)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !12, file: !13, line: 74, baseType: !36, size: 64, offset: 960)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !37, line: 152, baseType: !38)
!37 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!38 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !12, file: !13, line: 77, baseType: !40, size: 16, offset: 1024)
!40 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !12, file: !13, line: 78, baseType: !42, size: 8, offset: 1040)
!42 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !12, file: !13, line: 79, baseType: !44, size: 8, offset: 1048)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 8, elements: !45)
!45 = !{!46}
!46 = !DISubrange(count: 1)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !12, file: !13, line: 81, baseType: !48, size: 64, offset: 1088)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !13, line: 43, baseType: null)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !12, file: !13, line: 89, baseType: !51, size: 64, offset: 1152)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !37, line: 153, baseType: !38)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !12, file: !13, line: 91, baseType: !53, size: 64, offset: 1216)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !13, line: 37, flags: DIFlagFwdDecl)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !12, file: !13, line: 92, baseType: !56, size: 64, offset: 1280)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !13, line: 38, flags: DIFlagFwdDecl)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !12, file: !13, line: 93, baseType: !11, size: 64, offset: 1344)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !12, file: !13, line: 94, baseType: !60, size: 64, offset: 1408)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !12, file: !13, line: 95, baseType: !62, size: 64, offset: 1472)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !63, line: 46, baseType: !64)
!63 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!64 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !12, file: !13, line: 96, baseType: !10, size: 32, offset: 1536)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !12, file: !13, line: 98, baseType: !67, size: 160, offset: 1568)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 160, elements: !68)
!68 = !{!69}
!69 = !DISubrange(count: 20)
!70 = !DISubprogram(name: "dcgettext", scope: !71, file: !71, line: 51, type: !72, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!71 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!72 = !DISubroutineType(types: !73)
!73 = !{!17, !74, !74, !10}
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!76 = !DISubprogram(name: "quotearg_colon", scope: !77, file: !77, line: 391, type: !78, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!77 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!78 = !DISubroutineType(types: !79)
!79 = !{!17, !74}
!80 = !DISubprogram(name: "error", scope: !81, file: !81, line: 52, type: !82, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!81 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!82 = !DISubroutineType(types: !83)
!83 = !{null, !10, !10, !74, null}
!84 = !{!0, !85}
!85 = !DIGlobalVariableExpression(var: !86, expr: !DIExpression())
!86 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !2, file: !3, line: 56, type: !87, isLocal: true, isDefinition: true)
!87 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!88 = !DIGlobalVariableExpression(var: !89, expr: !DIExpression())
!89 = distinct !DIGlobalVariable(name: "exit_failure", scope: !90, file: !91, line: 24, type: !93, isDefinition: true)
!90 = distinct !DICompileUnit(language: DW_LANG_C99, file: !91, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, globals: !92, nameTableKind: None)
!91 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!92 = !{!88}
!93 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !10)
!94 = !DIGlobalVariableExpression(var: !95, expr: !DIExpression())
!95 = distinct !DIGlobalVariable(name: "long_options", scope: !96, file: !97, line: 34, type: !159, isLocal: true, isDefinition: true)
!96 = distinct !DICompileUnit(language: DW_LANG_C99, file: !97, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !98, globals: !158, nameTableKind: None)
!97 = !DIFile(filename: "lib/long-options.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!98 = !{!99, !114}
!99 = !DISubprogram(name: "getopt_long", scope: !100, file: !100, line: 66, type: !101, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!100 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!101 = !DISubroutineType(types: !102)
!102 = !{!10, !10, !103, !74, !105, !112}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !100, line: 50, size: 256, elements: !108)
!108 = !{!109, !110, !111, !113}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !107, file: !100, line: 52, baseType: !74, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !107, file: !100, line: 55, baseType: !10, size: 32, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !107, file: !100, line: 56, baseType: !112, size: 64, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !107, file: !100, line: 57, baseType: !10, size: 32, offset: 192)
!114 = !DISubprogram(name: "version_etc_va", scope: !115, file: !115, line: 63, type: !116, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!115 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!116 = !DISubroutineType(types: !117)
!117 = !{null, !118, !74, !74, !74, !150}
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !13, line: 49, size: 1728, elements: !120)
!120 = !{!121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !119, file: !13, line: 51, baseType: !10, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !119, file: !13, line: 54, baseType: !17, size: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !119, file: !13, line: 55, baseType: !17, size: 64, offset: 128)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !119, file: !13, line: 56, baseType: !17, size: 64, offset: 192)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !119, file: !13, line: 57, baseType: !17, size: 64, offset: 256)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !119, file: !13, line: 58, baseType: !17, size: 64, offset: 320)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !119, file: !13, line: 59, baseType: !17, size: 64, offset: 384)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !119, file: !13, line: 60, baseType: !17, size: 64, offset: 448)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !119, file: !13, line: 61, baseType: !17, size: 64, offset: 512)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !119, file: !13, line: 64, baseType: !17, size: 64, offset: 576)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !119, file: !13, line: 65, baseType: !17, size: 64, offset: 640)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !119, file: !13, line: 66, baseType: !17, size: 64, offset: 704)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !119, file: !13, line: 68, baseType: !30, size: 64, offset: 768)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !119, file: !13, line: 70, baseType: !118, size: 64, offset: 832)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !119, file: !13, line: 72, baseType: !10, size: 32, offset: 896)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !119, file: !13, line: 73, baseType: !10, size: 32, offset: 928)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !119, file: !13, line: 74, baseType: !36, size: 64, offset: 960)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !119, file: !13, line: 77, baseType: !40, size: 16, offset: 1024)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !119, file: !13, line: 78, baseType: !42, size: 8, offset: 1040)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !119, file: !13, line: 79, baseType: !44, size: 8, offset: 1048)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !119, file: !13, line: 81, baseType: !48, size: 64, offset: 1088)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !119, file: !13, line: 89, baseType: !51, size: 64, offset: 1152)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !119, file: !13, line: 91, baseType: !53, size: 64, offset: 1216)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !119, file: !13, line: 92, baseType: !56, size: 64, offset: 1280)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !119, file: !13, line: 93, baseType: !118, size: 64, offset: 1344)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !119, file: !13, line: 94, baseType: !60, size: 64, offset: 1408)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !119, file: !13, line: 95, baseType: !62, size: 64, offset: 1472)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !119, file: !13, line: 96, baseType: !10, size: 32, offset: 1536)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !119, file: !13, line: 98, baseType: !67, size: 160, offset: 1568)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !97, line: 72, size: 192, elements: !152)
!152 = !{!153, !155, !156, !157}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !151, file: !97, line: 72, baseType: !154, size: 32)
!154 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !151, file: !97, line: 72, baseType: !154, size: 32, offset: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !151, file: !97, line: 72, baseType: !60, size: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !151, file: !97, line: 72, baseType: !60, size: 64, offset: 128)
!158 = !{!94}
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 768, elements: !160)
!160 = !{!161}
!161 = !DISubrange(count: 3)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(name: "program_name", scope: !164, file: !165, line: 33, type: !74, isDefinition: true)
!164 = distinct !DICompileUnit(language: DW_LANG_C99, file: !165, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !166, globals: !203, nameTableKind: None)
!165 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!166 = !{!60, !167, !17}
!167 = !DISubprogram(name: "fputs", scope: !168, file: !168, line: 626, type: !169, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!168 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!169 = !DISubroutineType(types: !170)
!170 = !{!10, !74, !171}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !13, line: 49, size: 1728, elements: !173)
!173 = !{!174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !172, file: !13, line: 51, baseType: !10, size: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !172, file: !13, line: 54, baseType: !17, size: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !172, file: !13, line: 55, baseType: !17, size: 64, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !172, file: !13, line: 56, baseType: !17, size: 64, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !172, file: !13, line: 57, baseType: !17, size: 64, offset: 256)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !172, file: !13, line: 58, baseType: !17, size: 64, offset: 320)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !172, file: !13, line: 59, baseType: !17, size: 64, offset: 384)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !172, file: !13, line: 60, baseType: !17, size: 64, offset: 448)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !172, file: !13, line: 61, baseType: !17, size: 64, offset: 512)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !172, file: !13, line: 64, baseType: !17, size: 64, offset: 576)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !172, file: !13, line: 65, baseType: !17, size: 64, offset: 640)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !172, file: !13, line: 66, baseType: !17, size: 64, offset: 704)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !172, file: !13, line: 68, baseType: !30, size: 64, offset: 768)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !172, file: !13, line: 70, baseType: !171, size: 64, offset: 832)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !172, file: !13, line: 72, baseType: !10, size: 32, offset: 896)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !172, file: !13, line: 73, baseType: !10, size: 32, offset: 928)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !172, file: !13, line: 74, baseType: !36, size: 64, offset: 960)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !172, file: !13, line: 77, baseType: !40, size: 16, offset: 1024)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !172, file: !13, line: 78, baseType: !42, size: 8, offset: 1040)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !172, file: !13, line: 79, baseType: !44, size: 8, offset: 1048)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !172, file: !13, line: 81, baseType: !48, size: 64, offset: 1088)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !172, file: !13, line: 89, baseType: !51, size: 64, offset: 1152)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !172, file: !13, line: 91, baseType: !53, size: 64, offset: 1216)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !172, file: !13, line: 92, baseType: !56, size: 64, offset: 1280)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !172, file: !13, line: 93, baseType: !171, size: 64, offset: 1344)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !172, file: !13, line: 94, baseType: !60, size: 64, offset: 1408)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !172, file: !13, line: 95, baseType: !62, size: 64, offset: 1472)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !172, file: !13, line: 96, baseType: !10, size: 32, offset: 1536)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !172, file: !13, line: 98, baseType: !67, size: 160, offset: 1568)
!203 = !{!162}
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !206, file: !207, line: 85, type: !343, isDefinition: true)
!206 = distinct !DICompileUnit(language: DW_LANG_C99, file: !207, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !208, retainedTypes: !242, globals: !316, nameTableKind: None)
!207 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!208 = !{!209, !222, !227}
!209 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !77, line: 32, baseType: !154, size: 32, elements: !210)
!210 = !{!211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221}
!211 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!212 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!213 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!214 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!215 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!216 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!217 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!218 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!219 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!220 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!221 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!222 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !77, line: 242, baseType: !154, size: 32, elements: !223)
!223 = !{!224, !225, !226}
!224 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!225 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!226 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!227 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !228, line: 46, baseType: !154, size: 32, elements: !229)
!228 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!229 = !{!230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241}
!230 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!231 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!232 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!233 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!234 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!235 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!236 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!237 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!238 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!239 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!240 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!241 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!242 = !{!243, !249, !265, !269, !10, !40, !272, !62, !289, !293, !70, !299, !303, !17, !307, !310, !313}
!243 = !DISubprogram(name: "xmemdup", scope: !244, file: !244, line: 62, type: !245, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!244 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!245 = !DISubroutineType(types: !246)
!246 = !{!60, !247, !64}
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!249 = !DISubprogram(name: "quotearg_alloc_mem", scope: !77, file: !77, line: 342, type: !250, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!250 = !DISubroutineType(types: !251)
!251 = !{!17, !74, !64, !252, !253}
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !255)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !207, line: 65, size: 448, elements: !256)
!256 = !{!257, !258, !259, !263, !264}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !255, file: !207, line: 68, baseType: !209, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !255, file: !207, line: 71, baseType: !10, size: 32, offset: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !255, file: !207, line: 75, baseType: !260, size: 256, offset: 64)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 256, elements: !261)
!261 = !{!262}
!262 = !DISubrange(count: 8)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !255, file: !207, line: 78, baseType: !74, size: 64, offset: 320)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !255, file: !207, line: 81, baseType: !74, size: 64, offset: 384)
!265 = !DISubprogram(name: "free", scope: !266, file: !266, line: 565, type: !267, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!266 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!267 = !DISubroutineType(types: !268)
!268 = !{null, !60}
!269 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !77, file: !77, line: 408, type: !270, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!270 = !DISubroutineType(types: !271)
!271 = !{!17, !10, !74, !74, !74, !64}
!272 = !DISubprogram(name: "rpl_mbrtowc", scope: !273, file: !273, line: 717, type: !274, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!273 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!274 = !DISubroutineType(types: !275)
!275 = !{!64, !112, !74, !64, !276}
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !278, line: 13, size: 64, elements: !279)
!278 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!279 = !{!280, !281}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !277, file: !278, line: 15, baseType: !10, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !277, file: !278, line: 20, baseType: !282, size: 32, offset: 32)
!282 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !277, file: !278, line: 16, size: 32, elements: !283)
!283 = !{!284, !285}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !282, file: !278, line: 18, baseType: !154, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !282, file: !278, line: 19, baseType: !286, size: 32)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 32, elements: !287)
!287 = !{!288}
!288 = !DISubrange(count: 4)
!289 = !DISubprogram(name: "iswprint", scope: !290, file: !290, line: 120, type: !291, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!290 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!291 = !DISubroutineType(types: !292)
!292 = !{!10, !154}
!293 = !DISubprogram(name: "mbsinit", scope: !294, file: !294, line: 292, type: !295, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!294 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!295 = !DISubroutineType(types: !296)
!296 = !{!10, !297}
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !277)
!299 = !DISubprogram(name: "locale_charset", scope: !300, file: !300, line: 35, type: !301, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!300 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!301 = !DISubroutineType(types: !302)
!302 = !{!74}
!303 = !DISubprogram(name: "c_strcasecmp", scope: !304, file: !304, line: 42, type: !305, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!304 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!305 = !DISubroutineType(types: !306)
!306 = !{!10, !74, !74}
!307 = !DISubprogram(name: "xmalloc", scope: !244, file: !244, line: 53, type: !308, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!308 = !DISubroutineType(types: !309)
!309 = !{!60, !64}
!310 = !DISubprogram(name: "xalloc_die", scope: !244, file: !244, line: 51, type: !311, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !4)
!311 = !DISubroutineType(types: !312)
!312 = !{null}
!313 = !DISubprogram(name: "xrealloc", scope: !244, file: !244, line: 59, type: !314, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!314 = !DISubroutineType(types: !315)
!315 = !{!60, !60, !64}
!316 = !{!204, !317, !323, !325, !327, !332, !339, !341}
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !206, file: !207, line: 101, type: !319, isDefinition: true)
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !320, size: 320, elements: !321)
!320 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !209)
!321 = !{!322}
!322 = !DISubrange(count: 10)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !206, file: !207, line: 1052, type: !255, isDefinition: true)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !206, file: !207, line: 116, type: !255, isLocal: true, isDefinition: true)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "slot0", scope: !206, file: !207, line: 842, type: !329, isLocal: true, isDefinition: true)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 2048, elements: !330)
!330 = !{!331}
!331 = !DISubrange(count: 256)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(name: "slotvec", scope: !206, file: !207, line: 845, type: !334, isLocal: true, isDefinition: true)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !207, line: 834, size: 128, elements: !336)
!336 = !{!337, !338}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !335, file: !207, line: 836, baseType: !62, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !335, file: !207, line: 837, baseType: !17, size: 64, offset: 64)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "nslots", scope: !206, file: !207, line: 843, type: !10, isLocal: true, isDefinition: true)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "slotvec0", scope: !206, file: !207, line: 844, type: !335, isLocal: true, isDefinition: true)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !344, size: 704, elements: !345)
!344 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !74)
!345 = !{!346}
!346 = !DISubrange(count: 11)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !349, file: !350, line: 26, type: !352, isDefinition: true)
!349 = distinct !DICompileUnit(language: DW_LANG_C99, file: !350, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, globals: !351, nameTableKind: None)
!350 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!351 = !{!347}
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 376, elements: !353)
!353 = !{!354}
!354 = !DISubrange(count: 47)
!355 = distinct !DICompileUnit(language: DW_LANG_C99, file: !356, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !357, retainedTypes: !366, nameTableKind: None)
!356 = !DIFile(filename: "src/getlimits.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!357 = !{!358}
!358 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !359, line: 52, baseType: !154, size: 32, elements: !360)
!359 = !DIFile(filename: "./lib/ftoastr.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!360 = !{!361, !362, !363, !364, !365}
!361 = !DIEnumerator(name: "FTOASTR_LEFT_JUSTIFY", value: 1, isUnsigned: true)
!362 = !DIEnumerator(name: "FTOASTR_ALWAYS_SIGNED", value: 2, isUnsigned: true)
!363 = !DIEnumerator(name: "FTOASTR_SPACE_POSITIVE", value: 4, isUnsigned: true)
!364 = !DIEnumerator(name: "FTOASTR_ZERO_PAD", value: 8, isUnsigned: true)
!365 = !DIEnumerator(name: "FTOASTR_UPPER_E", value: 16, isUnsigned: true)
!366 = !{!70, !367, !402, !406, !410, !413, !414, !74, !60, !418, !426, !429, !431, !433, !436, !439, !441, !443, !444, !448, !451, !455}
!367 = !DISubprogram(name: "fputs_unlocked", scope: !168, file: !168, line: 662, type: !368, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!368 = !DISubroutineType(types: !369)
!369 = !{!10, !74, !370}
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !13, line: 49, size: 1728, elements: !372)
!372 = !{!373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !371, file: !13, line: 51, baseType: !10, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !371, file: !13, line: 54, baseType: !17, size: 64, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !371, file: !13, line: 55, baseType: !17, size: 64, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !371, file: !13, line: 56, baseType: !17, size: 64, offset: 192)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !371, file: !13, line: 57, baseType: !17, size: 64, offset: 256)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !371, file: !13, line: 58, baseType: !17, size: 64, offset: 320)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !371, file: !13, line: 59, baseType: !17, size: 64, offset: 384)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !371, file: !13, line: 60, baseType: !17, size: 64, offset: 448)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !371, file: !13, line: 61, baseType: !17, size: 64, offset: 512)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !371, file: !13, line: 64, baseType: !17, size: 64, offset: 576)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !371, file: !13, line: 65, baseType: !17, size: 64, offset: 640)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !371, file: !13, line: 66, baseType: !17, size: 64, offset: 704)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !371, file: !13, line: 68, baseType: !30, size: 64, offset: 768)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !371, file: !13, line: 70, baseType: !370, size: 64, offset: 832)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !371, file: !13, line: 72, baseType: !10, size: 32, offset: 896)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !371, file: !13, line: 73, baseType: !10, size: 32, offset: 928)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !371, file: !13, line: 74, baseType: !36, size: 64, offset: 960)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !371, file: !13, line: 77, baseType: !40, size: 16, offset: 1024)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !371, file: !13, line: 78, baseType: !42, size: 8, offset: 1040)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !371, file: !13, line: 79, baseType: !44, size: 8, offset: 1048)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !371, file: !13, line: 81, baseType: !48, size: 64, offset: 1088)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !371, file: !13, line: 89, baseType: !51, size: 64, offset: 1152)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !371, file: !13, line: 91, baseType: !53, size: 64, offset: 1216)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !371, file: !13, line: 92, baseType: !56, size: 64, offset: 1280)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !371, file: !13, line: 93, baseType: !370, size: 64, offset: 1344)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !371, file: !13, line: 94, baseType: !60, size: 64, offset: 1408)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !371, file: !13, line: 95, baseType: !62, size: 64, offset: 1472)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !371, file: !13, line: 96, baseType: !10, size: 32, offset: 1536)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !371, file: !13, line: 98, baseType: !67, size: 160, offset: 1568)
!402 = !DISubprogram(name: "set_program_name", scope: !403, file: !403, line: 37, type: !404, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!403 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!404 = !DISubroutineType(types: !405)
!405 = !{null, !74}
!406 = !DISubprogram(name: "setlocale", scope: !407, file: !407, line: 122, type: !408, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!407 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!408 = !DISubroutineType(types: !409)
!409 = !{!17, !10, !74}
!410 = !DISubprogram(name: "bindtextdomain", scope: !71, file: !71, line: 86, type: !411, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!411 = !DISubroutineType(types: !412)
!412 = !{!17, !74, !74}
!413 = !DISubprogram(name: "textdomain", scope: !71, file: !71, line: 82, type: !78, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!414 = !DISubprogram(name: "atexit", scope: !266, file: !266, line: 595, type: !415, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!415 = !DISubroutineType(types: !416)
!416 = !{!10, !417}
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!418 = !DISubprogram(name: "parse_long_options", scope: !419, file: !419, line: 25, type: !420, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!419 = !DIFile(filename: "./lib/long-options.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!420 = !DISubroutineType(types: !421)
!421 = !{null, !10, !422, !74, !74, !74, !423, null}
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{null, !10}
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !427, line: 102, baseType: !428)
!427 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !37, line: 73, baseType: !64)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !427, line: 101, baseType: !430)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !37, line: 72, baseType: !38)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !168, line: 77, baseType: !432)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !37, line: 193, baseType: !38)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !434, line: 7, baseType: !435)
!434 = !DIFile(filename: "/usr/include/bits/types/time_t.h", directory: "")
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !37, line: 160, baseType: !38)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !437, line: 79, baseType: !438)
!437 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !37, line: 146, baseType: !154)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !437, line: 64, baseType: !440)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !37, line: 147, baseType: !154)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !437, line: 97, baseType: !442)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !37, line: 154, baseType: !10)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !168, line: 63, baseType: !36)
!444 = !DISubprogram(name: "ftoastr", scope: !359, file: !359, line: 47, type: !445, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!445 = !DISubroutineType(types: !446)
!446 = !{!10, !17, !64, !10, !10, !447}
!447 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!448 = !DISubprogram(name: "puts", scope: !168, file: !168, line: 632, type: !449, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!449 = !DISubroutineType(types: !450)
!450 = !{!10, !74}
!451 = !DISubprogram(name: "dtoastr", scope: !359, file: !359, line: 48, type: !452, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!452 = !DISubroutineType(types: !453)
!453 = !{!10, !17, !64, !10, !10, !454}
!454 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!455 = !DISubprogram(name: "ldtoastr", scope: !359, file: !359, line: 49, type: !456, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!456 = !DISubroutineType(types: !457)
!457 = !{!10, !17, !64, !10, !10, !458}
!458 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!459 = distinct !DICompileUnit(language: DW_LANG_C99, file: !460, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !357, nameTableKind: None)
!460 = !DIFile(filename: "lib/dtoastr.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!461 = distinct !DICompileUnit(language: DW_LANG_C99, file: !462, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !357, nameTableKind: None)
!462 = !DIFile(filename: "lib/ftoastr.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!463 = distinct !DICompileUnit(language: DW_LANG_C99, file: !464, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !357, nameTableKind: None)
!464 = !DIFile(filename: "lib/ldtoastr.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!465 = distinct !DICompileUnit(language: DW_LANG_C99, file: !466, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !467, retainedTypes: !471, nameTableKind: None)
!466 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!467 = !{!468}
!468 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !466, line: 40, baseType: !154, size: 32, elements: !469)
!469 = !{!470}
!470 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!471 = !{!70, !472, !60}
!472 = !DISubprogram(name: "fputs_unlocked", scope: !168, file: !168, line: 662, type: !473, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!473 = !DISubroutineType(types: !474)
!474 = !{!10, !74, !475}
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !13, line: 49, size: 1728, elements: !477)
!477 = !{!478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !476, file: !13, line: 51, baseType: !10, size: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !476, file: !13, line: 54, baseType: !17, size: 64, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !476, file: !13, line: 55, baseType: !17, size: 64, offset: 128)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !476, file: !13, line: 56, baseType: !17, size: 64, offset: 192)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !476, file: !13, line: 57, baseType: !17, size: 64, offset: 256)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !476, file: !13, line: 58, baseType: !17, size: 64, offset: 320)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !476, file: !13, line: 59, baseType: !17, size: 64, offset: 384)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !476, file: !13, line: 60, baseType: !17, size: 64, offset: 448)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !476, file: !13, line: 61, baseType: !17, size: 64, offset: 512)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !476, file: !13, line: 64, baseType: !17, size: 64, offset: 576)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !476, file: !13, line: 65, baseType: !17, size: 64, offset: 640)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !476, file: !13, line: 66, baseType: !17, size: 64, offset: 704)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !476, file: !13, line: 68, baseType: !30, size: 64, offset: 768)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !476, file: !13, line: 70, baseType: !475, size: 64, offset: 832)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !476, file: !13, line: 72, baseType: !10, size: 32, offset: 896)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !476, file: !13, line: 73, baseType: !10, size: 32, offset: 928)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !476, file: !13, line: 74, baseType: !36, size: 64, offset: 960)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !476, file: !13, line: 77, baseType: !40, size: 16, offset: 1024)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !476, file: !13, line: 78, baseType: !42, size: 8, offset: 1040)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !476, file: !13, line: 79, baseType: !44, size: 8, offset: 1048)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !476, file: !13, line: 81, baseType: !48, size: 64, offset: 1088)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !476, file: !13, line: 89, baseType: !51, size: 64, offset: 1152)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !476, file: !13, line: 91, baseType: !53, size: 64, offset: 1216)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !476, file: !13, line: 92, baseType: !56, size: 64, offset: 1280)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !476, file: !13, line: 93, baseType: !475, size: 64, offset: 1344)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !476, file: !13, line: 94, baseType: !60, size: 64, offset: 1408)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !476, file: !13, line: 95, baseType: !62, size: 64, offset: 1472)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !476, file: !13, line: 96, baseType: !10, size: 32, offset: 1536)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !476, file: !13, line: 98, baseType: !67, size: 160, offset: 1568)
!507 = distinct !DICompileUnit(language: DW_LANG_C99, file: !508, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !509, retainedTypes: !522, nameTableKind: None)
!508 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!509 = !{!510}
!510 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !511, file: !244, line: 186, baseType: !154, size: 32, elements: !520)
!511 = distinct !DISubprogram(name: "x2nrealloc", scope: !244, file: !244, line: 174, type: !512, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !507, retainedNodes: !515)
!512 = !DISubroutineType(types: !513)
!513 = !{!60, !60, !514, !62}
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!515 = !{!516, !517, !518, !519}
!516 = !DILocalVariable(name: "p", arg: 1, scope: !511, file: !244, line: 174, type: !60)
!517 = !DILocalVariable(name: "pn", arg: 2, scope: !511, file: !244, line: 174, type: !514)
!518 = !DILocalVariable(name: "s", arg: 3, scope: !511, file: !244, line: 174, type: !62)
!519 = !DILocalVariable(name: "n", scope: !511, file: !244, line: 176, type: !62)
!520 = !{!521}
!521 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!522 = !{!62, !310, !307, !313, !17, !265, !60, !523, !526}
!523 = !DISubprogram(name: "xcalloc", scope: !244, file: !244, line: 57, type: !524, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!524 = !DISubroutineType(types: !525)
!525 = !{!60, !64, !64}
!526 = !DISubprogram(name: "rpl_calloc", scope: !527, file: !527, line: 688, type: !524, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!527 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!528 = distinct !DICompileUnit(language: DW_LANG_C99, file: !529, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !530, nameTableKind: None)
!529 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!530 = !{!70, !80}
!531 = distinct !DICompileUnit(language: DW_LANG_C99, file: !532, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !533, nameTableKind: None)
!532 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!533 = !{!60}
!534 = distinct !DICompileUnit(language: DW_LANG_C99, file: !535, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !536, nameTableKind: None)
!535 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!536 = !{!537, !62, !549}
!537 = !DISubprogram(name: "mbrtowc", scope: !294, file: !294, line: 296, type: !538, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!538 = !DISubroutineType(types: !539)
!539 = !{!64, !112, !74, !64, !540}
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !278, line: 13, size: 64, elements: !542)
!542 = !{!543, !544}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !541, file: !278, line: 15, baseType: !10, size: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !541, file: !278, line: 20, baseType: !545, size: 32, offset: 32)
!545 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !541, file: !278, line: 16, size: 32, elements: !546)
!546 = !{!547, !548}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !545, file: !278, line: 18, baseType: !154, size: 32)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !545, file: !278, line: 19, baseType: !286, size: 32)
!549 = !DISubprogram(name: "hard_locale", scope: !550, file: !550, line: 26, type: !551, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!550 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!551 = !DISubroutineType(types: !552)
!552 = !{!87, !10}
!553 = distinct !DICompileUnit(language: DW_LANG_C99, file: !554, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !555, nameTableKind: None)
!554 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!555 = !{!556}
!556 = !DISubprogram(name: "rpl_fclose", scope: !557, file: !557, line: 672, type: !558, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!557 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!558 = !DISubroutineType(types: !559)
!559 = !{!10, !560}
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !13, line: 49, size: 1728, elements: !562)
!562 = !{!563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !561, file: !13, line: 51, baseType: !10, size: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !561, file: !13, line: 54, baseType: !17, size: 64, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !561, file: !13, line: 55, baseType: !17, size: 64, offset: 128)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !561, file: !13, line: 56, baseType: !17, size: 64, offset: 192)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !561, file: !13, line: 57, baseType: !17, size: 64, offset: 256)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !561, file: !13, line: 58, baseType: !17, size: 64, offset: 320)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !561, file: !13, line: 59, baseType: !17, size: 64, offset: 384)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !561, file: !13, line: 60, baseType: !17, size: 64, offset: 448)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !561, file: !13, line: 61, baseType: !17, size: 64, offset: 512)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !561, file: !13, line: 64, baseType: !17, size: 64, offset: 576)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !561, file: !13, line: 65, baseType: !17, size: 64, offset: 640)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !561, file: !13, line: 66, baseType: !17, size: 64, offset: 704)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !561, file: !13, line: 68, baseType: !30, size: 64, offset: 768)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !561, file: !13, line: 70, baseType: !560, size: 64, offset: 832)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !561, file: !13, line: 72, baseType: !10, size: 32, offset: 896)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !561, file: !13, line: 73, baseType: !10, size: 32, offset: 928)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !561, file: !13, line: 74, baseType: !36, size: 64, offset: 960)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !561, file: !13, line: 77, baseType: !40, size: 16, offset: 1024)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !561, file: !13, line: 78, baseType: !42, size: 8, offset: 1040)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !561, file: !13, line: 79, baseType: !44, size: 8, offset: 1048)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !561, file: !13, line: 81, baseType: !48, size: 64, offset: 1088)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !561, file: !13, line: 89, baseType: !51, size: 64, offset: 1152)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !561, file: !13, line: 91, baseType: !53, size: 64, offset: 1216)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !561, file: !13, line: 92, baseType: !56, size: 64, offset: 1280)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !561, file: !13, line: 93, baseType: !560, size: 64, offset: 1344)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !561, file: !13, line: 94, baseType: !60, size: 64, offset: 1408)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !561, file: !13, line: 95, baseType: !62, size: 64, offset: 1472)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !561, file: !13, line: 96, baseType: !10, size: 32, offset: 1536)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !561, file: !13, line: 98, baseType: !67, size: 160, offset: 1568)
!592 = distinct !DICompileUnit(language: DW_LANG_C99, file: !593, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !594, nameTableKind: None)
!593 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!594 = !{!595}
!595 = !DISubprogram(name: "setlocale_null_r", scope: !596, file: !596, line: 64, type: !597, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!596 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!597 = !DISubroutineType(types: !598)
!598 = !{!10, !10, !17, !64}
!599 = distinct !DICompileUnit(language: DW_LANG_C99, file: !600, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !601, retainedTypes: !988, nameTableKind: None)
!600 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!601 = !{!602}
!602 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !603, line: 41, baseType: !154, size: 32, elements: !604)
!603 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!604 = !{!605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987}
!605 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!606 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!607 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!608 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!609 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!610 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!611 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!612 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!613 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!614 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!615 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!616 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!617 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!618 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!619 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!620 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!621 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!622 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!623 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!624 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!625 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!626 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!627 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!628 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!629 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!630 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!631 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!632 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!633 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!634 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!635 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!636 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!637 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!638 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!639 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!640 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!641 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!642 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!643 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!644 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!645 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!646 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!647 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!648 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!649 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!650 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!651 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!652 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!653 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!654 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!661 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!662 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!663 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!664 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!665 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!666 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!667 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!668 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!669 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!670 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!671 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!672 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!673 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!674 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!675 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!676 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!677 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!678 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!679 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!680 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!681 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!682 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!683 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!684 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!685 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!686 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!687 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!688 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!689 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!690 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!691 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!692 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!693 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!694 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!695 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!696 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!697 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!698 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!699 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!700 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!701 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!702 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!703 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!704 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!705 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!706 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!707 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!708 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!709 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!710 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!711 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!712 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!713 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!714 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!715 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!716 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!717 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!718 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!719 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!720 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!721 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!722 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!723 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!724 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!725 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!726 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!727 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!728 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!729 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!730 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!731 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!732 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!733 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!734 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!735 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!736 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!737 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!738 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!739 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!740 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!741 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!742 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!743 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!744 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!745 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!746 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!747 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!748 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!749 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!750 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!751 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!752 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!753 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!754 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!755 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!756 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!757 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!758 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!759 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!760 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!761 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!762 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!763 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!764 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!765 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!766 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!767 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!768 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!769 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!770 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!771 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!772 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!773 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!774 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!779 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!780 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!781 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!782 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!783 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!784 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!785 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!786 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!787 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!788 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!789 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!790 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!791 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!793 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!794 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!795 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!796 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!797 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!798 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!799 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!800 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!801 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!802 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!803 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!804 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!805 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!806 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!807 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!808 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!809 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!810 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!812 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!813 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!814 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!815 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!816 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!817 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!818 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!819 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!820 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!821 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!822 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!823 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!824 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!825 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!826 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!827 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!828 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!829 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!830 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!831 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!832 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!833 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!834 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!835 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!836 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!837 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!838 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!839 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!840 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!841 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!842 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!843 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!844 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!845 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!846 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!847 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!873 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!874 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!875 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!876 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!877 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!878 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!879 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!880 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!881 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!882 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!883 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!884 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!885 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!886 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!887 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!889 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!890 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!891 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!892 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!893 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!894 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!895 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!896 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!898 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!899 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!900 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!901 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!902 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!903 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!904 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!905 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!906 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!907 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!908 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!909 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!910 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!911 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!912 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!913 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!914 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!915 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!916 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!917 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!918 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!919 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!920 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!921 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!922 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!923 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!924 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!925 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!926 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!927 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!928 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!929 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!930 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!931 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!932 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!933 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!934 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!935 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!936 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!937 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!938 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!939 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!940 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!941 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!942 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!943 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!944 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!945 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!946 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!947 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!948 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!949 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!950 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!951 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!952 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!953 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!954 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!955 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!956 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!957 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!958 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!959 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!960 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!961 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!962 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!963 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!964 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!965 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!966 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!967 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!968 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!969 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!970 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!971 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!972 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!973 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!974 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!975 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!976 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!977 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!978 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!979 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!980 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!981 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!982 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!983 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!984 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!985 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!986 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!987 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!988 = !{!989, !60}
!989 = !DISubprogram(name: "nl_langinfo", scope: !603, file: !603, line: 661, type: !990, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!990 = !DISubroutineType(types: !991)
!991 = !{!17, !10}
!992 = distinct !DICompileUnit(language: DW_LANG_C99, file: !993, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !994, nameTableKind: None)
!993 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!994 = !{!60, !406}
!995 = distinct !DICompileUnit(language: DW_LANG_C99, file: !996, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !997, nameTableKind: None)
!996 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!997 = !{!998, !1033, !1034, !1038}
!998 = !DISubprogram(name: "fileno", scope: !168, file: !168, line: 786, type: !999, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!10, !1001}
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !13, line: 49, size: 1728, elements: !1003)
!1003 = !{!1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1002, file: !13, line: 51, baseType: !10, size: 32)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1002, file: !13, line: 54, baseType: !17, size: 64, offset: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1002, file: !13, line: 55, baseType: !17, size: 64, offset: 128)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1002, file: !13, line: 56, baseType: !17, size: 64, offset: 192)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1002, file: !13, line: 57, baseType: !17, size: 64, offset: 256)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1002, file: !13, line: 58, baseType: !17, size: 64, offset: 320)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1002, file: !13, line: 59, baseType: !17, size: 64, offset: 384)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1002, file: !13, line: 60, baseType: !17, size: 64, offset: 448)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1002, file: !13, line: 61, baseType: !17, size: 64, offset: 512)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1002, file: !13, line: 64, baseType: !17, size: 64, offset: 576)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1002, file: !13, line: 65, baseType: !17, size: 64, offset: 640)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1002, file: !13, line: 66, baseType: !17, size: 64, offset: 704)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1002, file: !13, line: 68, baseType: !30, size: 64, offset: 768)
