source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.F_triple = type { i8*, i64, i64 }
%struct.Src_to_dest = type { i64, i64, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__acl_entry_ext = type opaque
%struct.__acl_ext = type opaque
%struct.__dirstream = type opaque
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.cp_options = type { i32, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i32, i32, %struct.hash_table*, %struct.hash_table* }
%struct.dir_list = type { %struct.dir_list*, i64, i64 }
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%struct.direntry_t = type { i8*, i64 }
%struct.error_context = type { void (%struct.error_context*, i8*, ...)*, i8* (%struct.error_context*, i8*)*, void (%struct.error_context*, i8*)* }
%struct.extent_info = type { i64, i64, i32 }
%struct.extent_scan = type { i32, i64, i32, i64, i8, i8, %struct.extent_info* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "owner_name", scope: !2, file: !3, line: 74, type: !87, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !82, globals: !425, nameTableKind: None)
!3 = !DIFile(filename: "src/install.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !13, !20, !26, !32, !37, !51, !74}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "backup_type", file: !6, line: 30, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/backupfile.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "no_backups", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "simple_backups", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "numbered_existing_backups", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "numbered_backups", value: 3, isUnsigned: true)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Dereference_symlink", file: !14, line: 69, baseType: !7, size: 32, elements: !15)
!14 = !DIFile(filename: "src/copy.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!15 = !{!16, !17, !18, !19}
!16 = !DIEnumerator(name: "DEREF_UNDEFINED", value: 1, isUnsigned: true)
!17 = !DIEnumerator(name: "DEREF_NEVER", value: 2, isUnsigned: true)
!18 = !DIEnumerator(name: "DEREF_COMMAND_LINE_ARGUMENTS", value: 3, isUnsigned: true)
!19 = !DIEnumerator(name: "DEREF_ALWAYS", value: 4, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Interactive", file: !14, line: 60, baseType: !7, size: 32, elements: !21)
!21 = !{!22, !23, !24, !25}
!22 = !DIEnumerator(name: "I_ALWAYS_YES", value: 1, isUnsigned: true)
!23 = !DIEnumerator(name: "I_ALWAYS_NO", value: 2, isUnsigned: true)
!24 = !DIEnumerator(name: "I_ASK_USER", value: 3, isUnsigned: true)
!25 = !DIEnumerator(name: "I_UNSPECIFIED", value: 4, isUnsigned: true)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Sparse_type", file: !14, line: 26, baseType: !7, size: 32, elements: !27)
!27 = !{!28, !29, !30, !31}
!28 = !DIEnumerator(name: "SPARSE_UNUSED", value: 0, isUnsigned: true)
!29 = !DIEnumerator(name: "SPARSE_NEVER", value: 1, isUnsigned: true)
!30 = !DIEnumerator(name: "SPARSE_AUTO", value: 2, isUnsigned: true)
!31 = !DIEnumerator(name: "SPARSE_ALWAYS", value: 3, isUnsigned: true)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Reflink_type", file: !14, line: 47, baseType: !7, size: 32, elements: !33)
!33 = !{!34, !35, !36}
!34 = !DIEnumerator(name: "REFLINK_NEVER", value: 0, isUnsigned: true)
!35 = !DIEnumerator(name: "REFLINK_AUTO", value: 1, isUnsigned: true)
!36 = !DIEnumerator(name: "REFLINK_ALWAYS", value: 2, isUnsigned: true)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !38, line: 32, baseType: !7, size: 32, elements: !39)
!38 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!39 = !{!40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50}
!40 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!41 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!42 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!43 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!44 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!45 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!46 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!47 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!48 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!49 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!50 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !53, file: !52, line: 39, baseType: !7, size: 32, elements: !67)
!52 = !DIFile(filename: "./lib/savewd.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savewd", file: !52, line: 36, size: 64, elements: !54)
!54 = !{!55, !56}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !53, file: !52, line: 66, baseType: !51, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !53, file: !52, line: 74, baseType: !57, size: 32, offset: 32)
!57 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !53, file: !52, line: 69, size: 32, elements: !58)
!58 = !{!59, !61, !62}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !57, file: !52, line: 71, baseType: !60, size: 32)
!60 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "errnum", scope: !57, file: !52, line: 72, baseType: !60, size: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !57, file: !52, line: 73, baseType: !63, size: 32)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !64, line: 97, baseType: !65)
!64 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !66, line: 154, baseType: !60)
!66 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!67 = !{!68, !69, !70, !71, !72, !73}
!68 = !DIEnumerator(name: "INITIAL_STATE", value: 0, isUnsigned: true)
!69 = !DIEnumerator(name: "FD_STATE", value: 1, isUnsigned: true)
!70 = !DIEnumerator(name: "FD_POST_CHDIR_STATE", value: 2, isUnsigned: true)
!71 = !DIEnumerator(name: "FORKING_STATE", value: 3, isUnsigned: true)
!72 = !DIEnumerator(name: "ERROR_STATE", value: 4, isUnsigned: true)
!73 = !DIEnumerator(name: "FINAL_STATE", value: 5, isUnsigned: true)
!74 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !75, line: 25, baseType: !7, size: 32, elements: !76)
!75 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!76 = !{!77, !78, !79, !80, !81}
!77 = !DIEnumerator(name: "LONGINT_OK", value: 0, isUnsigned: true)
!78 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1, isUnsigned: true)
!79 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2, isUnsigned: true)
!80 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3, isUnsigned: true)
!81 = !DIEnumerator(name: "LONGINT_INVALID", value: 4, isUnsigned: true)
!82 = !{!83, !92, !152, !156, !160, !163, !166, !173, !177, !192, !197, !200, !202, !87, !142, !206, !210, !213, !216, !217, !221, !227, !234, !237, !245, !247, !298, !299, !301, !317, !321, !322, !323, !334, !335, !336, !346, !349, !250, !353, !356, !360, !363, !367, !373, !376, !377, !381, !384, !388, !391, !394, !398, !411, !414, !415, !418, !421}
!83 = !DISubprogram(name: "dcgettext", scope: !84, file: !84, line: 51, type: !85, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!84 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!85 = !DISubroutineType(types: !86)
!86 = !{!87, !89, !89, !60}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !88)
!91 = !{}
!92 = !DISubprogram(name: "fputs_unlocked", scope: !93, file: !93, line: 662, type: !94, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!93 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!94 = !DISubroutineType(types: !95)
!95 = !{!60, !89, !96}
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !98, line: 49, size: 1728, elements: !99)
!98 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!99 = !{!100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !115, !116, !117, !118, !121, !123, !125, !129, !132, !134, !137, !140, !141, !143, !147, !148}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !97, file: !98, line: 51, baseType: !60, size: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !97, file: !98, line: 54, baseType: !87, size: 64, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !97, file: !98, line: 55, baseType: !87, size: 64, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !97, file: !98, line: 56, baseType: !87, size: 64, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !97, file: !98, line: 57, baseType: !87, size: 64, offset: 256)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !97, file: !98, line: 58, baseType: !87, size: 64, offset: 320)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !97, file: !98, line: 59, baseType: !87, size: 64, offset: 384)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !97, file: !98, line: 60, baseType: !87, size: 64, offset: 448)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !97, file: !98, line: 61, baseType: !87, size: 64, offset: 512)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !97, file: !98, line: 64, baseType: !87, size: 64, offset: 576)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !97, file: !98, line: 65, baseType: !87, size: 64, offset: 640)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !97, file: !98, line: 66, baseType: !87, size: 64, offset: 704)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !97, file: !98, line: 68, baseType: !113, size: 64, offset: 768)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !98, line: 36, flags: DIFlagFwdDecl)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !97, file: !98, line: 70, baseType: !96, size: 64, offset: 832)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !97, file: !98, line: 72, baseType: !60, size: 32, offset: 896)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !97, file: !98, line: 73, baseType: !60, size: 32, offset: 928)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !97, file: !98, line: 74, baseType: !119, size: 64, offset: 960)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !66, line: 152, baseType: !120)
!120 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !97, file: !98, line: 77, baseType: !122, size: 16, offset: 1024)
!122 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !97, file: !98, line: 78, baseType: !124, size: 8, offset: 1040)
!124 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !97, file: !98, line: 79, baseType: !126, size: 8, offset: 1048)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 8, elements: !127)
!127 = !{!128}
!128 = !DISubrange(count: 1)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !97, file: !98, line: 81, baseType: !130, size: 64, offset: 1088)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !98, line: 43, baseType: null)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !97, file: !98, line: 89, baseType: !133, size: 64, offset: 1152)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !66, line: 153, baseType: !120)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !97, file: !98, line: 91, baseType: !135, size: 64, offset: 1216)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !98, line: 37, flags: DIFlagFwdDecl)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !97, file: !98, line: 92, baseType: !138, size: 64, offset: 1280)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !98, line: 38, flags: DIFlagFwdDecl)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !97, file: !98, line: 93, baseType: !96, size: 64, offset: 1344)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !97, file: !98, line: 94, baseType: !142, size: 64, offset: 1408)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !97, file: !98, line: 95, baseType: !144, size: 64, offset: 1472)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !145, line: 46, baseType: !146)
!145 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!146 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !97, file: !98, line: 96, baseType: !60, size: 32, offset: 1536)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !97, file: !98, line: 98, baseType: !149, size: 160, offset: 1568)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 160, elements: !150)
!150 = !{!151}
!151 = !DISubrange(count: 20)
!152 = !DISubprogram(name: "set_program_name", scope: !153, file: !153, line: 37, type: !154, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!153 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!154 = !DISubroutineType(types: !155)
!155 = !{null, !89}
!156 = !DISubprogram(name: "setlocale", scope: !157, file: !157, line: 122, type: !158, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!157 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!158 = !DISubroutineType(types: !159)
!159 = !{!87, !60, !89}
!160 = !DISubprogram(name: "bindtextdomain", scope: !84, file: !84, line: 86, type: !161, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!161 = !DISubroutineType(types: !162)
!162 = !{!87, !89, !89}
!163 = !DISubprogram(name: "textdomain", scope: !84, file: !84, line: 82, type: !164, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!164 = !DISubroutineType(types: !165)
!165 = !{!87, !89}
!166 = !DISubprogram(name: "atexit", scope: !167, file: !167, line: 595, type: !168, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!167 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!168 = !DISubroutineType(types: !169)
!169 = !{!60, !170}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DISubroutineType(types: !172)
!172 = !{null}
!173 = !DISubprogram(name: "umask", scope: !174, file: !174, line: 308, type: !175, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!174 = !DIFile(filename: "/usr/include/sys/stat.h", directory: "")
!175 = !DISubroutineType(types: !176)
!176 = !{!7, !7}
!177 = !DISubprogram(name: "getopt_long", scope: !178, file: !178, line: 66, type: !179, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!178 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!179 = !DISubroutineType(types: !180)
!180 = !{!60, !60, !181, !89, !183, !190}
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !87)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !185)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !178, line: 50, size: 256, elements: !186)
!186 = !{!187, !188, !189, !191}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !185, file: !178, line: 52, baseType: !89, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !185, file: !178, line: 55, baseType: !60, size: 32, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !185, file: !178, line: 56, baseType: !190, size: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !185, file: !178, line: 57, baseType: !60, size: 32, offset: 192)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !193, line: 72, baseType: !194)
!193 = !DIFile(filename: "/usr/include/signal.h", directory: "")
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{null, !60}
!197 = !DISubprogram(name: "signal", scope: !193, file: !193, line: 88, type: !198, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!198 = !DISubroutineType(types: !199)
!199 = !{!194, !60, !194}
!200 = !DISubprogram(name: "xstrdup", scope: !201, file: !201, line: 64, type: !164, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!201 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!202 = !DISubprogram(name: "error", scope: !203, file: !203, line: 52, type: !204, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!203 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!204 = !DISubroutineType(types: !205)
!205 = !{null, !60, !60, !89, null}
!206 = !DISubprogram(name: "version_etc", scope: !207, file: !207, line: 69, type: !208, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!207 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!208 = !DISubroutineType(types: !209)
!209 = !{null, !96, !89, !89, !89, null}
!210 = !DISubprogram(name: "quotearg_style", scope: !38, file: !38, line: 377, type: !211, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!211 = !DISubroutineType(types: !212)
!212 = !{!87, !37, !89}
!213 = !DISubprogram(name: "xget_version", scope: !6, file: !6, line: 55, type: !214, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!214 = !DISubroutineType(types: !215)
!215 = !{!5, !89, !89}
!216 = !DISubprogram(name: "set_simple_backup_suffix", scope: !6, file: !6, line: 51, type: !154, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!217 = !DISubprogram(name: "quote", scope: !218, file: !218, line: 44, type: !219, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!218 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!219 = !DISubroutineType(types: !220)
!220 = !{!89, !89}
!221 = !DISubprogram(name: "mode_compile", scope: !222, file: !222, line: 25, type: !223, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!222 = !DIFile(filename: "./lib/modechange.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!223 = !DISubroutineType(types: !224)
!224 = !{!225, !89}
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DICompositeType(tag: DW_TAG_structure_type, name: "mode_change", file: !222, line: 25, flags: DIFlagFwdDecl)
!227 = !DISubprogram(name: "mode_adjust", scope: !222, file: !222, line: 27, type: !228, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!228 = !DISubroutineType(types: !229)
!229 = !{!7, !7, !230, !7, !231, !233}
!230 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !226)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!234 = !DISubprogram(name: "free", scope: !167, file: !167, line: 565, type: !235, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!235 = !DISubroutineType(types: !236)
!236 = !{null, !142}
!237 = !DISubprogram(name: "savewd_process_files", scope: !52, file: !52, line: 147, type: !238, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!238 = !DISubroutineType(types: !239)
!239 = !{!60, !60, !240, !241, !142}
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DISubroutineType(types: !243)
!243 = !{!60, !87, !244, !142}
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!245 = !DISubprogram(name: "hash_init", scope: !246, file: !246, line: 1, type: !171, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!246 = !DIFile(filename: "src/cp-hash.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!247 = !DISubprogram(name: "dest_info_init", scope: !14, file: !14, line: 300, type: !248, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!248 = !DISubroutineType(types: !249)
!249 = !{null, !250}
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cp_options", file: !14, line: 98, size: 640, elements: !252)
!252 = !{!253, !254, !255, !256, !257, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !297}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "backup_type", scope: !251, file: !14, line: 100, baseType: !5, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "dereference", scope: !251, file: !14, line: 103, baseType: !13, size: 32, offset: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !251, file: !14, line: 108, baseType: !20, size: 32, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_mode", scope: !251, file: !14, line: 111, baseType: !26, size: 32, offset: 96)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !251, file: !14, line: 115, baseType: !258, size: 32, offset: 128)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !64, line: 69, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !66, line: 150, baseType: !7)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "copy_as_regular", scope: !251, file: !14, line: 119, baseType: !230, size: 8, offset: 160)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_before_opening", scope: !251, file: !14, line: 123, baseType: !230, size: 8, offset: 168)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_after_failed_open", scope: !251, file: !14, line: 130, baseType: !230, size: 8, offset: 176)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "hard_link", scope: !251, file: !14, line: 134, baseType: !230, size: 8, offset: 184)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "move_mode", scope: !251, file: !14, line: 138, baseType: !230, size: 8, offset: 192)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "install_mode", scope: !251, file: !14, line: 141, baseType: !230, size: 8, offset: 200)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "chown_privileges", scope: !251, file: !14, line: 145, baseType: !230, size: 8, offset: 208)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "owner_privileges", scope: !251, file: !14, line: 152, baseType: !230, size: 8, offset: 216)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "one_file_system", scope: !251, file: !14, line: 156, baseType: !230, size: 8, offset: 224)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_ownership", scope: !251, file: !14, line: 160, baseType: !230, size: 8, offset: 232)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_mode", scope: !251, file: !14, line: 161, baseType: !230, size: 8, offset: 240)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_timestamps", scope: !251, file: !14, line: 162, baseType: !230, size: 8, offset: 248)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "explicit_no_preserve_mode", scope: !251, file: !14, line: 163, baseType: !230, size: 8, offset: 256)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "set_security_context", scope: !251, file: !14, line: 166, baseType: !230, size: 8, offset: 264)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_links", scope: !251, file: !14, line: 178, baseType: !230, size: 8, offset: 272)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "data_copy_required", scope: !251, file: !14, line: 182, baseType: !230, size: 8, offset: 280)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve", scope: !251, file: !14, line: 188, baseType: !230, size: 8, offset: 288)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_security_context", scope: !251, file: !14, line: 192, baseType: !230, size: 8, offset: 296)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_context", scope: !251, file: !14, line: 201, baseType: !230, size: 8, offset: 304)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_xattr", scope: !251, file: !14, line: 205, baseType: !230, size: 8, offset: 312)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_xattr", scope: !251, file: !14, line: 214, baseType: !230, size: 8, offset: 320)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "reduce_diagnostics", scope: !251, file: !14, line: 223, baseType: !230, size: 8, offset: 328)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !251, file: !14, line: 227, baseType: !230, size: 8, offset: 336)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "set_mode", scope: !251, file: !14, line: 231, baseType: !230, size: 8, offset: 344)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "symbolic_link", scope: !251, file: !14, line: 235, baseType: !230, size: 8, offset: 352)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !251, file: !14, line: 239, baseType: !230, size: 8, offset: 360)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !251, file: !14, line: 242, baseType: !230, size: 8, offset: 368)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_tty", scope: !251, file: !14, line: 245, baseType: !230, size: 8, offset: 376)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "open_dangling_dest_symlink", scope: !251, file: !14, line: 250, baseType: !230, size: 8, offset: 384)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "last_file", scope: !251, file: !14, line: 254, baseType: !230, size: 8, offset: 392)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "rename_errno", scope: !251, file: !14, line: 259, baseType: !60, size: 32, offset: 416)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "reflink_mode", scope: !251, file: !14, line: 262, baseType: !32, size: 32, offset: 448)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "dest_info", scope: !251, file: !14, line: 273, baseType: !293, size: 64, offset: 512)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !295, line: 69, baseType: !296)
!295 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!296 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !295, line: 67, flags: DIFlagFwdDecl)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "src_info", scope: !251, file: !14, line: 276, baseType: !293, size: 64, offset: 576)
!298 = !DISubprogram(name: "cp_options_default", scope: !14, file: !14, line: 303, type: !248, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!299 = !DISubprogram(name: "last_component", scope: !300, file: !300, line: 46, type: !164, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!300 = !DIFile(filename: "./lib/dirname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!301 = !DISubprogram(name: "getpwnam", scope: !302, file: !302, line: 116, type: !303, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!302 = !DIFile(filename: "/usr/include/pwd.h", directory: "")
!303 = !DISubroutineType(types: !304)
!304 = !{!305, !89}
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !302, line: 49, size: 384, elements: !307)
!307 = !{!308, !309, !310, !312, !314, !315, !316}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !306, file: !302, line: 51, baseType: !87, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !306, file: !302, line: 52, baseType: !87, size: 64, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !306, file: !302, line: 54, baseType: !311, size: 32, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !66, line: 146, baseType: !7)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !306, file: !302, line: 55, baseType: !313, size: 32, offset: 160)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !66, line: 147, baseType: !7)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !306, file: !302, line: 56, baseType: !87, size: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !306, file: !302, line: 57, baseType: !87, size: 64, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !306, file: !302, line: 58, baseType: !87, size: 64, offset: 320)
!317 = !DISubprogram(name: "xstrtoumax", scope: !75, file: !75, line: 48, type: !318, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!318 = !DISubroutineType(types: !319)
!319 = !{!74, !89, !240, !60, !320, !89}
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !64, line: 79, baseType: !311)
!322 = !DISubprogram(name: "endpwent", scope: !302, file: !302, line: 78, type: !171, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!323 = !DISubprogram(name: "getgrnam", scope: !324, file: !324, line: 107, type: !325, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!324 = !DIFile(filename: "/usr/include/grp.h", directory: "")
!325 = !DISubroutineType(types: !326)
!326 = !{!327, !89}
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "group", file: !324, line: 42, size: 256, elements: !329)
!329 = !{!330, !331, !332, !333}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "gr_name", scope: !328, file: !324, line: 44, baseType: !87, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "gr_passwd", scope: !328, file: !324, line: 45, baseType: !87, size: 64, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "gr_gid", scope: !328, file: !324, line: 46, baseType: !313, size: 32, offset: 128)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "gr_mem", scope: !328, file: !324, line: 47, baseType: !240, size: 64, offset: 192)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !64, line: 64, baseType: !313)
!335 = !DISubprogram(name: "endgrent", scope: !324, file: !324, line: 67, type: !171, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!336 = !DISubprogram(name: "make_dir_parents", scope: !337, file: !337, line: 25, type: !338, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!337 = !DIFile(filename: "./lib/mkdir-p.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!338 = !DISubroutineType(types: !339)
!339 = !{!230, !87, !244, !340, !142, !7, !343, !7, !7, !7, !230}
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DISubroutineType(types: !342)
!342 = !{!60, !89, !89, !142}
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{null, !89, !142}
!346 = !DISubprogram(name: "mkdir", scope: !174, file: !174, line: 317, type: !347, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!347 = !DISubroutineType(types: !348)
!348 = !{!60, !89, !7}
!349 = !DISubprogram(name: "prog_fprintf", scope: !350, file: !350, line: 22, type: !351, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!350 = !DIFile(filename: "src/prog-fprintf.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!351 = !DISubroutineType(types: !352)
!352 = !{null, !96, !89, null}
!353 = !DISubprogram(name: "savewd_finish", scope: !52, file: !52, line: 131, type: !354, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!354 = !DISubroutineType(types: !355)
!355 = !{null, !244}
!356 = !DISubprogram(name: "mkancesdirs", scope: !357, file: !357, line: 8, type: !358, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!357 = !DIFile(filename: "./lib/mkancesdirs.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!358 = !DISubroutineType(types: !359)
!359 = !{!120, !87, !244, !340, !142}
!360 = !DISubprogram(name: "savewd_restore", scope: !52, file: !52, line: 120, type: !361, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!361 = !DISubroutineType(types: !362)
!362 = !{!60, !244, !60}
!363 = !DISubprogram(name: "unlink", scope: !364, file: !364, line: 825, type: !365, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!364 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!365 = !DISubroutineType(types: !366)
!366 = !{!60, !89}
!367 = !DISubprogram(name: "copy", scope: !14, file: !14, line: 288, type: !368, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!368 = !DISubroutineType(types: !369)
!369 = !{!230, !89, !89, !230, !370, !372, !372}
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !251)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!373 = !DISubprogram(name: "getuid", scope: !364, file: !364, line: 675, type: !374, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!374 = !DISubroutineType(types: !375)
!375 = !{!7}
!376 = !DISubprogram(name: "getgid", scope: !364, file: !364, line: 681, type: !374, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!377 = !DISubprogram(name: "open", scope: !378, file: !378, line: 196, type: !379, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!378 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
!379 = !DISubroutineType(types: !380)
!380 = !{!60, !89, !60, null}
!381 = !DISubprogram(name: "close", scope: !364, file: !364, line: 353, type: !382, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!382 = !DISubroutineType(types: !383)
!383 = !{!60, !60}
!384 = !DISubprogram(name: "full_read", scope: !385, file: !385, line: 23, type: !386, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!385 = !DIFile(filename: "./lib/full-read.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!386 = !DISubroutineType(types: !387)
!387 = !{!146, !60, !142, !146}
!388 = !DISubprogram(name: "fork", scope: !364, file: !364, line: 756, type: !389, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!389 = !DISubroutineType(types: !390)
!390 = !{!60}
!391 = !DISubprogram(name: "execlp", scope: !364, file: !364, line: 584, type: !392, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!392 = !DISubroutineType(types: !393)
!393 = !{!60, !89, !89, null}
!394 = !DISubprogram(name: "waitpid", scope: !395, file: !395, line: 111, type: !396, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!395 = !DIFile(filename: "/usr/include/sys/wait.h", directory: "")
!396 = !DISubroutineType(types: !397)
!397 = !{!60, !60, !190, !60}
!398 = !DISubprogram(name: "utimens", scope: !399, file: !399, line: 22, type: !400, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!399 = !DIFile(filename: "./lib/utimens.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!400 = !DISubroutineType(types: !401)
!401 = !{!60, !89, !402}
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !404)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !405, line: 10, size: 128, elements: !406)
!405 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!406 = !{!407, !409}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !404, file: !405, line: 12, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !66, line: 160, baseType: !120)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !404, file: !405, line: 16, baseType: !410, size: 64, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !66, line: 196, baseType: !120)
!411 = !DISubprogram(name: "lchown", scope: !364, file: !364, line: 483, type: !412, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!412 = !DISubroutineType(types: !413)
!413 = !{!60, !89, !7, !7}
!414 = !DISubprogram(name: "chmod", scope: !174, file: !174, line: 280, type: !347, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!415 = !DISubprogram(name: "quotearg_n_style_colon", scope: !38, file: !38, line: 397, type: !416, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!416 = !DISubroutineType(types: !417)
!417 = !{!87, !60, !37, !89}
!418 = !DISubprogram(name: "quote_n", scope: !218, file: !218, line: 40, type: !419, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!419 = !DISubroutineType(types: !420)
!420 = !{!89, !60, !89}
!421 = !DISubprogram(name: "file_name_concat", scope: !422, file: !422, line: 22, type: !423, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!422 = !DIFile(filename: "./lib/filenamecat.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!423 = !DISubroutineType(types: !424)
!424 = !{!87, !89, !89, !240}
!425 = !{!0, !426, !428, !430, !432, !434, !436, !441, !443, !445, !447, !449, !451, !453, !455, !467, !469}
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(name: "group_name", scope: !2, file: !3, line: 81, type: !87, isLocal: true, isDefinition: true)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(name: "copy_only_if_needed", scope: !2, file: !3, line: 102, type: !230, isLocal: true, isDefinition: true)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(name: "strip_files", scope: !2, file: !3, line: 105, type: !230, isLocal: true, isDefinition: true)
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(name: "dir_arg", scope: !2, file: !3, line: 108, type: !230, isLocal: true, isDefinition: true)
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(name: "selinux_enabled", scope: !2, file: !3, line: 53, type: !60, isLocal: true, isDefinition: true)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 121, type: !438, isLocal: true, isDefinition: true)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 4608, elements: !439)
!439 = !{!440}
!440 = !DISubrange(count: 18)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(name: "strip_program", scope: !2, file: !3, line: 111, type: !89, isLocal: true, isDefinition: true)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(name: "use_default_selinux_context", scope: !2, file: !3, line: 54, type: !230, isLocal: true, isDefinition: true)
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(name: "mode", scope: !2, file: !3, line: 90, type: !258, isLocal: true, isDefinition: true)
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(name: "dir_mode_bits", scope: !2, file: !3, line: 99, type: !258, isLocal: true, isDefinition: true)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(name: "dir_mode", scope: !2, file: !3, line: 93, type: !258, isLocal: true, isDefinition: true)
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(name: "owner_id", scope: !2, file: !3, line: 77, type: !321, isLocal: true, isDefinition: true)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(name: "group_id", scope: !2, file: !3, line: 84, type: !334, isLocal: true, isDefinition: true)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(name: "a_buff", scope: !457, file: !3, line: 149, type: !464, isLocal: true, isDefinition: true)
!457 = distinct !DISubprogram(name: "have_same_content", scope: !3, file: !3, line: 146, type: !458, scopeLine: 147, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !460)
!458 = !DISubroutineType(types: !459)
!459 = !{!230, !60, !60}
!460 = !{!461, !462, !463}
!461 = !DILocalVariable(name: "a_fd", arg: 1, scope: !457, file: !3, line: 146, type: !60)
!462 = !DILocalVariable(name: "b_fd", arg: 2, scope: !457, file: !3, line: 146, type: !60)
!463 = !DILocalVariable(name: "size", scope: !457, file: !3, line: 152, type: !144)
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 32768, elements: !465)
!465 = !{!466}
!466 = !DISubrange(count: 4096)
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(name: "b_buff", scope: !457, file: !3, line: 150, type: !464, isLocal: true, isDefinition: true)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(name: "first_call", scope: !471, file: !3, line: 318, type: !230, isLocal: true, isDefinition: true)
!471 = distinct !DISubprogram(name: "setdefaultfilecon", scope: !3, file: !3, line: 314, type: !154, scopeLine: 315, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !472)
!472 = !{!473, !474, !501, !502, !505, !506}
!473 = !DILocalVariable(name: "file", arg: 1, scope: !471, file: !3, line: 314, type: !89)
!474 = !DILocalVariable(name: "st", scope: !471, file: !3, line: 316, type: !475)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !476, line: 46, size: 1152, elements: !477)
!476 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "")
!477 = !{!478, !480, !482, !484, !485, !486, !487, !488, !489, !490, !492, !494, !495, !496, !497}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !475, file: !476, line: 48, baseType: !479, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !66, line: 145, baseType: !146)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !475, file: !476, line: 53, baseType: !481, size: 64, offset: 64)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !66, line: 148, baseType: !146)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !475, file: !476, line: 61, baseType: !483, size: 64, offset: 128)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !66, line: 151, baseType: !146)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !475, file: !476, line: 62, baseType: !259, size: 32, offset: 192)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !475, file: !476, line: 64, baseType: !311, size: 32, offset: 224)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !475, file: !476, line: 65, baseType: !313, size: 32, offset: 256)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !475, file: !476, line: 67, baseType: !60, size: 32, offset: 288)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !475, file: !476, line: 69, baseType: !479, size: 64, offset: 320)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !475, file: !476, line: 74, baseType: !119, size: 64, offset: 384)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !475, file: !476, line: 78, baseType: !491, size: 64, offset: 448)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !66, line: 174, baseType: !120)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !475, file: !476, line: 80, baseType: !493, size: 64, offset: 512)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !66, line: 179, baseType: !120)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !475, file: !476, line: 91, baseType: !404, size: 128, offset: 576)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !475, file: !476, line: 92, baseType: !404, size: 128, offset: 704)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !475, file: !476, line: 93, baseType: !404, size: 128, offset: 832)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !475, file: !476, line: 106, baseType: !498, size: 192, offset: 960)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !410, size: 192, elements: !499)
!499 = !{!500}
!500 = !DISubrange(count: 3)
!501 = !DILocalVariable(name: "scontext", scope: !471, file: !3, line: 317, type: !87)
!502 = !DILocalVariable(name: "p0", scope: !503, file: !3, line: 337, type: !89)
!503 = distinct !DILexicalBlock(scope: !504, file: !3, line: 329, column: 5)
!504 = distinct !DILexicalBlock(scope: !471, file: !3, line: 328, column: 7)
!505 = !DILocalVariable(name: "p", scope: !503, file: !3, line: 338, type: !89)
!506 = !DILocalVariable(name: "prefix", scope: !507, file: !3, line: 347, type: !87)
!507 = distinct !DILexicalBlock(scope: !508, file: !3, line: 346, column: 9)
!508 = distinct !DILexicalBlock(scope: !503, file: !3, line: 345, column: 11)
!509 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!510 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!511 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(name: "top_level_src_name", scope: !514, file: !515, line: 147, type: !89, isLocal: true, isDefinition: true)
!514 = distinct !DICompileUnit(language: DW_LANG_C99, file: !515, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !516, retainedTypes: !541, globals: !779, nameTableKind: None)
!515 = !DIFile(filename: "src/copy.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!516 = !{!5, !13, !20, !26, !32, !37, !517, !521, !528, !537}
!517 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !518, line: 27, baseType: !7, size: 32, elements: !519)
!518 = !DIFile(filename: "./lib/utimecmp.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!519 = !{!520}
!520 = !DIEnumerator(name: "UTIMECMP_TRUNCATE_SOURCE", value: 1, isUnsigned: true)
!521 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "savedir_option", file: !522, line: 26, baseType: !7, size: 32, elements: !523)
!522 = !DIFile(filename: "./lib/savedir.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!523 = !{!524, !525, !526, !527}
!524 = !DIEnumerator(name: "SAVEDIR_SORT_NONE", value: 0, isUnsigned: true)
!525 = !DIEnumerator(name: "SAVEDIR_SORT_NAME", value: 1, isUnsigned: true)
!526 = !DIEnumerator(name: "SAVEDIR_SORT_INODE", value: 2, isUnsigned: true)
!527 = !DIEnumerator(name: "SAVEDIR_SORT_FASTREAD", value: 2, isUnsigned: true)
!528 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !529, line: 45, baseType: !7, size: 32, elements: !530)
!529 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!530 = !{!531, !532, !533, !534, !535, !536}
!531 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0, isUnsigned: true)
!532 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2, isUnsigned: true)
!533 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5, isUnsigned: true)
!534 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4, isUnsigned: true)
!535 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3, isUnsigned: true)
!536 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1, isUnsigned: true)
!537 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !538, line: 73, baseType: !7, size: 32, elements: !539)
!538 = !DIFile(filename: "src/ioblksize.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!539 = !{!540}
!540 = !DIEnumerator(name: "IO_BUFSIZE", value: 131072, isUnsigned: true)
!541 = !{!83, !217, !202, !210, !542, !543, !566, !258, !173, !142, !7, !567, !571, !600, !603, !606, !415, !299, !609, !87, !234, !363, !612, !615, !619, !622, !625, !346, !626, !628, !629, !633, !634, !411, !638, !643, !647, !650, !651, !654, !658, !661, !146, !665, !667, !670, !671, !421, !674, !676, !144, !677, !680, !684, !687, !381, !690, !694, !715, !718, !721, !725, !729, !733, !736, !737, !738, !741, !764, !767, !778}
!542 = !DISubprogram(name: "quotearg_n_style", scope: !38, file: !38, line: 368, type: !416, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!543 = !DISubprogram(name: "hash_initialize", scope: !295, file: !295, line: 89, type: !544, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!544 = !DISubroutineType(types: !545)
!545 = !{!546, !146, !547, !557, !562, !565}
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !549)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !295, line: 53, size: 160, elements: !550)
!550 = !{!551, !553, !554, !555, !556}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !549, file: !295, line: 58, baseType: !552, size: 32)
!552 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !549, file: !295, line: 59, baseType: !552, size: 32, offset: 32)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !549, file: !295, line: 60, baseType: !552, size: 32, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !549, file: !295, line: 61, baseType: !552, size: 32, offset: 96)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !549, file: !295, line: 62, baseType: !230, size: 8, offset: 128)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DISubroutineType(types: !559)
!559 = !{!146, !560, !146}
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{!230, !560, !560}
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!566 = !DISubprogram(name: "geteuid", scope: !364, file: !364, line: 678, type: !374, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!567 = !DISubprogram(name: "renameatu", scope: !568, file: !568, line: 28, type: !569, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!568 = !DIFile(filename: "./lib/renameatu.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!569 = !DISubroutineType(types: !570)
!570 = !{!60, !60, !89, !60, !89, !7}
!571 = !DISubprogram(name: "seen_file", scope: !572, file: !572, line: 14, type: !573, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!572 = !DIFile(filename: "./lib/file-set.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!573 = !DISubroutineType(types: !574)
!574 = !{!230, !575, !89, !577}
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !296)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !579)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !476, line: 46, size: 1152, elements: !580)
!580 = !{!581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !597, !598, !599}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !579, file: !476, line: 48, baseType: !479, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !579, file: !476, line: 53, baseType: !481, size: 64, offset: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !579, file: !476, line: 61, baseType: !483, size: 64, offset: 128)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !579, file: !476, line: 62, baseType: !259, size: 32, offset: 192)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !579, file: !476, line: 64, baseType: !311, size: 32, offset: 224)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !579, file: !476, line: 65, baseType: !313, size: 32, offset: 256)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !579, file: !476, line: 67, baseType: !60, size: 32, offset: 288)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !579, file: !476, line: 69, baseType: !479, size: 64, offset: 320)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !579, file: !476, line: 74, baseType: !119, size: 64, offset: 384)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !579, file: !476, line: 78, baseType: !491, size: 64, offset: 448)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !579, file: !476, line: 80, baseType: !493, size: 64, offset: 512)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !579, file: !476, line: 91, baseType: !593, size: 128, offset: 576)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !405, line: 10, size: 128, elements: !594)
!594 = !{!595, !596}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !593, file: !405, line: 12, baseType: !408, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !593, file: !405, line: 16, baseType: !410, size: 64, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !579, file: !476, line: 92, baseType: !593, size: 128, offset: 704)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !579, file: !476, line: 93, baseType: !593, size: 128, offset: 832)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !579, file: !476, line: 106, baseType: !498, size: 192, offset: 960)
!600 = !DISubprogram(name: "record_file", scope: !572, file: !572, line: 7, type: !601, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!601 = !DISubroutineType(types: !602)
!602 = !{null, !546, !89, !577}
!603 = !DISubprogram(name: "utimecmp", scope: !518, file: !518, line: 35, type: !604, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!604 = !DISubroutineType(types: !605)
!605 = !{!60, !89, !577, !577, !60}
!606 = !DISubprogram(name: "remember_copied", scope: !246, file: !246, line: 4, type: !607, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!607 = !DISubroutineType(types: !608)
!608 = !{!87, !89, !146, !146}
!609 = !DISubprogram(name: "backup_file_rename", scope: !6, file: !6, line: 52, type: !610, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!610 = !DISubroutineType(types: !611)
!611 = !{!87, !60, !89, !5}
!612 = !DISubprogram(name: "src_to_dest_lookup", scope: !246, file: !246, line: 5, type: !613, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!613 = !DISubroutineType(types: !614)
!614 = !{!87, !146, !146}
!615 = !DISubprogram(name: "same_name", scope: !616, file: !616, line: 23, type: !617, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!616 = !DIFile(filename: "./lib/same.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!617 = !DISubroutineType(types: !618)
!618 = !{!230, !89, !89}
!619 = !DISubprogram(name: "rename", scope: !93, file: !93, line: 148, type: !620, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!620 = !DISubroutineType(types: !621)
!621 = !{!60, !89, !89}
!622 = !DISubprogram(name: "forget_created", scope: !246, file: !246, line: 3, type: !623, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!623 = !DISubroutineType(types: !624)
!624 = !{null, !146, !146}
!625 = !DISubprogram(name: "rmdir", scope: !364, file: !364, line: 834, type: !365, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!626 = !DISubprogram(name: "lchmod", scope: !627, file: !627, line: 993, type: !347, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!627 = !DIFile(filename: "./lib/sys/stat.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!628 = !DISubprogram(name: "dir_name", scope: !300, file: !300, line: 40, type: !164, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!629 = !DISubprogram(name: "force_symlinkat", scope: !630, file: !630, line: 2, type: !631, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!630 = !DIFile(filename: "src/force-link.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!631 = !DISubroutineType(types: !632)
!632 = !{!60, !89, !60, !89, !230, !60}
!633 = !DISubprogram(name: "mkfifo", scope: !174, file: !174, line: 346, type: !347, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!634 = !DISubprogram(name: "areadlink_with_size", scope: !635, file: !635, line: 24, type: !636, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!635 = !DIFile(filename: "./lib/areadlink.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!636 = !DISubroutineType(types: !637)
!637 = !{!87, !89, !146}
!638 = !DISubprogram(name: "utimens", scope: !399, file: !399, line: 22, type: !639, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!639 = !DISubroutineType(types: !640)
!640 = !{!60, !89, !641}
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !593)
!643 = !DISubprogram(name: "copy_acl", scope: !644, file: !644, line: 32, type: !645, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!644 = !DIFile(filename: "./lib/acl.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!645 = !DISubroutineType(types: !646)
!646 = !{!60, !89, !60, !89, !60, !7}
!647 = !DISubprogram(name: "set_acl", scope: !644, file: !644, line: 30, type: !648, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!648 = !DISubroutineType(types: !649)
!649 = !{!60, !89, !60, !7}
!650 = !DISubprogram(name: "canonicalize_file_name", scope: !167, file: !167, line: 790, type: !164, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!651 = !DISubprogram(name: "force_linkat", scope: !630, file: !630, line: 1, type: !652, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!652 = !DISubroutineType(types: !653)
!653 = !{!60, !60, !89, !60, !89, !60, !230, !60}
!654 = !DISubprogram(name: "can_write_any_file", scope: !655, file: !655, line: 2, type: !656, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!655 = !DIFile(filename: "./lib/write-any-file.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!656 = !DISubroutineType(types: !657)
!657 = !{!230}
!658 = !DISubprogram(name: "euidaccess", scope: !364, file: !364, line: 292, type: !659, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!659 = !DISubroutineType(types: !660)
!660 = !{!60, !89, !60}
!661 = !DISubprogram(name: "strmode", scope: !662, file: !662, line: 35, type: !663, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!662 = !DIFile(filename: "./lib/filemode.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!663 = !DISubroutineType(types: !664)
!664 = !{null, !7, !87}
!665 = !DISubprogram(name: "yesno", scope: !666, file: !666, line: 22, type: !656, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!666 = !DIFile(filename: "./lib/yesno.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!667 = !DISubprogram(name: "xmalloc", scope: !201, file: !201, line: 53, type: !668, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!668 = !DISubroutineType(types: !669)
!669 = !{!142, !146}
!670 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!671 = !DISubprogram(name: "savedir", scope: !522, file: !522, line: 39, type: !672, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!672 = !DISubroutineType(types: !673)
!673 = !{!87, !89, !521}
!674 = !DISubprogram(name: "open_safer", scope: !675, file: !675, line: 22, type: !379, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!675 = !DIFile(filename: "./lib/fcntl-safer.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!676 = !DISubprogram(name: "getpagesize", scope: !364, file: !364, line: 976, type: !389, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!677 = !DISubprogram(name: "fdadvise", scope: !529, file: !529, line: 71, type: !678, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!678 = !DISubroutineType(types: !679)
!679 = !{null, !60, !120, !120, !528}
!680 = !DISubprogram(name: "buffer_lcm", scope: !681, file: !681, line: 2, type: !682, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!681 = !DIFile(filename: "./lib/buffer-lcm.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!682 = !DISubroutineType(types: !683)
!683 = !{!146, !146, !146, !146}
!684 = !DISubprogram(name: "ftruncate", scope: !364, file: !364, line: 1014, type: !685, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!685 = !DISubroutineType(types: !686)
!686 = !{!60, !60, !120}
!687 = !DISubprogram(name: "fdutimens", scope: !399, file: !399, line: 21, type: !688, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!688 = !DISubroutineType(types: !689)
!689 = !{!60, !60, !89, !641}
!690 = !DISubprogram(name: "ioctl", scope: !691, file: !691, line: 41, type: !692, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!691 = !DIFile(filename: "/usr/include/sys/ioctl.h", directory: "")
!692 = !DISubroutineType(types: !693)
!693 = !{!60, !60, !146, null}
!694 = !DISubprogram(name: "extent_scan_init", scope: !695, file: !695, line: 61, type: !696, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!695 = !DIFile(filename: "src/extent-scan.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!696 = !DISubroutineType(types: !697)
!697 = !{null, !60, !698}
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extent_scan", file: !695, line: 36, size: 384, elements: !700)
!700 = !{!701, !702, !704, !705, !706, !707, !708}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !699, file: !695, line: 39, baseType: !60, size: 32)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "scan_start", scope: !699, file: !695, line: 42, baseType: !703, size: 64, offset: 64)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !93, line: 63, baseType: !119)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "fm_flags", scope: !699, file: !695, line: 45, baseType: !7, size: 32, offset: 128)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "ei_count", scope: !699, file: !695, line: 48, baseType: !144, size: 64, offset: 192)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "initial_scan_failed", scope: !699, file: !695, line: 52, baseType: !230, size: 8, offset: 256)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "hit_final_extent", scope: !699, file: !695, line: 55, baseType: !230, size: 8, offset: 264)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "ext_info", scope: !699, file: !695, line: 58, baseType: !709, size: 64, offset: 320)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extent_info", file: !695, line: 23, size: 192, elements: !711)
!711 = !{!712, !713, !714}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "ext_logical", scope: !710, file: !695, line: 26, baseType: !703, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "ext_length", scope: !710, file: !695, line: 29, baseType: !703, size: 64, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "ext_flags", scope: !710, file: !695, line: 32, baseType: !7, size: 32, offset: 128)
!715 = !DISubprogram(name: "extent_scan_read", scope: !695, file: !695, line: 63, type: !716, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!716 = !DISubroutineType(types: !717)
!717 = !{!230, !698}
!718 = !DISubprogram(name: "lseek", scope: !364, file: !364, line: 334, type: !719, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!719 = !DISubroutineType(types: !720)
!720 = !{!120, !60, !120, !60}
!721 = !DISubprogram(name: "rpl_calloc", scope: !722, file: !722, line: 688, type: !723, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!722 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!723 = !DISubroutineType(types: !724)
!724 = !{!142, !146, !146}
!725 = !DISubprogram(name: "full_write", scope: !726, file: !726, line: 29, type: !727, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!726 = !DIFile(filename: "./lib/full-write.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!727 = !DISubroutineType(types: !728)
!728 = !{!146, !60, !560, !146}
!729 = !DISubprogram(name: "fallocate", scope: !730, file: !730, line: 413, type: !731, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!730 = !DIFile(filename: "/usr/include/bits/fcntl-linux.h", directory: "")
!731 = !DISubroutineType(types: !732)
!732 = !{!60, !60, !60, !120, !120}
!733 = !DISubprogram(name: "fchmod", scope: !174, file: !174, line: 293, type: !734, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!734 = !DISubroutineType(types: !735)
!735 = !{!60, !60, !7}
!736 = !DISubprogram(name: "lutimens", scope: !399, file: !399, line: 23, type: !639, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!737 = !DISubprogram(name: "qset_acl", scope: !644, file: !644, line: 29, type: !648, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!738 = !DISubprogram(name: "fchown", scope: !364, file: !364, line: 478, type: !739, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!739 = !DISubroutineType(types: !740)
!740 = !{!60, !60, !7, !7}
!741 = !DISubprogram(name: "attr_copy_fd", scope: !742, file: !742, line: 30, type: !743, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!742 = !DIFile(filename: "/usr/include/attr/libattr.h", directory: "")
!743 = !DISubroutineType(types: !744)
!744 = !{!60, !89, !60, !89, !60, !745, !748}
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DISubroutineType(types: !747)
!747 = !{!60, !89, !748}
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "error_context", file: !750, line: 25, size: 192, elements: !751)
!750 = !DIFile(filename: "/usr/include/attr/error_context.h", directory: "")
!751 = !{!752, !756, !760}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !749, file: !750, line: 27, baseType: !753, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DISubroutineType(types: !755)
!755 = !{null, !748, !89, null}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "quote", scope: !749, file: !750, line: 30, baseType: !757, size: 64, offset: 64)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DISubroutineType(types: !759)
!759 = !{!89, !748, !89}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "quote_free", scope: !749, file: !750, line: 33, baseType: !761, size: 64, offset: 128)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DISubroutineType(types: !763)
!763 = !{null, !748, !89}
!764 = !DISubprogram(name: "attr_copy_file", scope: !742, file: !742, line: 27, type: !765, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!765 = !DISubroutineType(types: !766)
!766 = !{!60, !89, !89, !745, !748}
!767 = !DISubprogram(name: "verror", scope: !768, file: !768, line: 34, type: !769, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!768 = !DIFile(filename: "./lib/verror.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!769 = !DISubroutineType(types: !770)
!770 = !{null, !60, !60, !89, !771}
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !515, line: 657, size: 192, elements: !773)
!773 = !{!774, !775, !776, !777}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !772, file: !515, line: 657, baseType: !7, size: 32)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !772, file: !515, line: 657, baseType: !7, size: 32, offset: 32)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !772, file: !515, line: 657, baseType: !142, size: 64, offset: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !772, file: !515, line: 657, baseType: !142, size: 64, offset: 128)
!778 = !DISubprogram(name: "attr_copy_check_permissions", scope: !742, file: !742, line: 35, type: !746, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!779 = !{!780, !512, !785, !787, !797, !799}
!780 = !DIGlobalVariableExpression(var: !781, expr: !DIExpression())
!781 = distinct !DIGlobalVariable(name: "mask", scope: !782, file: !515, line: 3087, type: !258, isLocal: true, isDefinition: true)
!782 = distinct !DISubprogram(name: "cached_umask", scope: !515, file: !515, line: 3085, type: !783, scopeLine: 3086, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !514, retainedNodes: !91)
!783 = !DISubroutineType(types: !784)
!784 = !{!258}
!785 = !DIGlobalVariableExpression(var: !786, expr: !DIExpression())
!786 = distinct !DIGlobalVariable(name: "top_level_dst_name", scope: !514, file: !515, line: 148, type: !89, isLocal: true, isDefinition: true)
!787 = !DIGlobalVariableExpression(var: !788, expr: !DIExpression())
!788 = distinct !DIGlobalVariable(name: "zeros", scope: !789, file: !515, line: 385, type: !87, isLocal: true, isDefinition: true)
!789 = distinct !DISubprogram(name: "write_zeros", scope: !515, file: !515, line: 383, type: !790, scopeLine: 384, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !514, retainedNodes: !792)
!790 = !DISubroutineType(types: !791)
!791 = !{!230, !60, !703}
!792 = !{!793, !794, !795}
!793 = !DILocalVariable(name: "fd", arg: 1, scope: !789, file: !515, line: 383, type: !60)
!794 = !DILocalVariable(name: "n_bytes", arg: 2, scope: !789, file: !515, line: 383, type: !703)
!795 = !DILocalVariable(name: "n", scope: !796, file: !515, line: 404, type: !144)
!796 = distinct !DILexicalBlock(scope: !789, file: !515, line: 403, column: 5)
!797 = !DIGlobalVariableExpression(var: !798, expr: !DIExpression())
!798 = distinct !DIGlobalVariable(name: "nz", scope: !789, file: !515, line: 386, type: !144, isLocal: true, isDefinition: true)
!799 = !DIGlobalVariableExpression(var: !800, expr: !DIExpression())
!800 = distinct !DIGlobalVariable(name: "fallback", scope: !789, file: !515, line: 393, type: !801, isLocal: true, isDefinition: true)
!801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 8192, elements: !802)
!802 = !{!803}
!803 = !DISubrange(count: 1024)
!804 = !DIGlobalVariableExpression(var: !798, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709421568, DW_OP_mul, DW_OP_constu, 131072, DW_OP_plus, DW_OP_stack_value))
!805 = !DIGlobalVariableExpression(var: !806, expr: !DIExpression())
!806 = distinct !DIGlobalVariable(name: "src_to_dest", scope: !807, file: !808, line: 45, type: !293, isLocal: true, isDefinition: true)
!807 = distinct !DICompileUnit(language: DW_LANG_C99, file: !808, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !91, retainedTypes: !809, globals: !836, nameTableKind: None)
!808 = !DIFile(filename: "src/cp-hash.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!809 = !{!810, !813, !667, !200, !816, !142, !817, !87, !818, !830, !234, !833}
!810 = !DISubprogram(name: "hash_delete", scope: !295, file: !295, line: 104, type: !811, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!811 = !DISubroutineType(types: !812)
!812 = !{!142, !546, !560}
!813 = !DISubprogram(name: "hash_lookup", scope: !295, file: !295, line: 78, type: !814, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!814 = !DISubroutineType(types: !815)
!815 = !{!142, !575, !560}
!816 = !DISubprogram(name: "hash_insert", scope: !295, file: !295, line: 100, type: !811, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!817 = !DISubprogram(name: "xalloc_die", scope: !201, file: !201, line: 51, type: !171, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !91)
!818 = !DISubprogram(name: "hash_initialize", scope: !295, file: !295, line: 89, type: !819, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!819 = !DISubroutineType(types: !820)
!820 = !{!546, !146, !821, !557, !562, !565}
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !823)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !295, line: 53, size: 160, elements: !824)
!824 = !{!825, !826, !827, !828, !829}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !823, file: !295, line: 58, baseType: !552, size: 32)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !823, file: !295, line: 59, baseType: !552, size: 32, offset: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !823, file: !295, line: 60, baseType: !552, size: 32, offset: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !823, file: !295, line: 61, baseType: !552, size: 32, offset: 96)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !823, file: !295, line: 62, baseType: !230, size: 8, offset: 128)
!830 = !DISubprogram(name: "hash_free", scope: !295, file: !295, line: 96, type: !831, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!831 = !DISubroutineType(types: !832)
!832 = !{null, !546}
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !834, line: 102, baseType: !835)
!834 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !66, line: 73, baseType: !146)
!836 = !{!805}
!837 = !DIGlobalVariableExpression(var: !838, expr: !DIExpression())
!838 = distinct !DIGlobalVariable(name: "simple_pattern", scope: !839, file: !840, line: 38, type: !869, isLocal: true, isDefinition: true)
!839 = distinct !DICompileUnit(language: DW_LANG_C99, file: !840, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !841, retainedTypes: !848, globals: !868, nameTableKind: None)
!840 = !DIFile(filename: "src/force-link.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!841 = !{!842, !845}
!842 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !840, line: 39, baseType: !7, size: 32, elements: !843)
!843 = !{!844}
!844 = !DIEnumerator(name: "x_suffix_len", value: 6, isUnsigned: true)
!845 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !840, line: 44, baseType: !7, size: 32, elements: !846)
!846 = !{!847}
!847 = !DIEnumerator(name: "smallsize", value: 256, isUnsigned: true)
!848 = !{!849, !852, !859, !862, !234, !865, !299}
!849 = !DISubprogram(name: "linkat", scope: !364, file: !364, line: 795, type: !850, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!850 = !DISubroutineType(types: !851)
!851 = !{!60, !60, !89, !60, !89, !60}
!852 = !DISubprogram(name: "try_tempname_len", scope: !853, file: !853, line: 62, type: !854, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!853 = !DIFile(filename: "./lib/tempname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!854 = !DISubroutineType(types: !855)
!855 = !{!60, !87, !60, !142, !856, !146}
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DISubroutineType(types: !858)
!858 = !{!60, !87, !142}
!859 = !DISubprogram(name: "renameat", scope: !93, file: !93, line: 152, type: !860, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!860 = !DISubroutineType(types: !861)
!861 = !{!60, !60, !89, !60, !89}
!862 = !DISubprogram(name: "unlinkat", scope: !364, file: !364, line: 829, type: !863, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!863 = !DISubroutineType(types: !864)
!864 = !{!60, !60, !89, !60}
!865 = !DISubprogram(name: "symlinkat", scope: !364, file: !364, line: 815, type: !866, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!866 = !DISubroutineType(types: !867)
!867 = !{!60, !89, !60, !89}
!868 = !{!837}
!869 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 72, elements: !870)
!870 = !{!871}
!871 = !DISubrange(count: 9)
!872 = !DIGlobalVariableExpression(var: !873, expr: !DIExpression())
!873 = distinct !DIGlobalVariable(name: "Version", scope: !874, file: !875, line: 2, type: !89, isDefinition: true)
!874 = distinct !DICompileUnit(language: DW_LANG_C99, file: !875, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !91, globals: !876, nameTableKind: None)
!875 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!876 = !{!872}
!877 = !DIGlobalVariableExpression(var: !878, expr: !DIExpression())
!878 = distinct !DIGlobalVariable(name: "simple_backup_suffix", scope: !879, file: !880, line: 82, type: !89, isDefinition: true)
!879 = distinct !DICompileUnit(language: DW_LANG_C99, file: !880, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !881, retainedTypes: !942, globals: !979, nameTableKind: None)
!880 = !DIFile(filename: "lib/backupfile.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!881 = !{!5, !882, !912, !918}
!882 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !883, file: !880, line: 327, baseType: !7, size: 32, elements: !910)
!883 = distinct !DISubprogram(name: "backupfile_internal", scope: !880, file: !880, line: 314, type: !884, scopeLine: 316, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !879, retainedNodes: !886)
!884 = !DISubroutineType(types: !885)
!885 = !{!87, !60, !89, !5, !230}
!886 = !{!887, !888, !889, !890, !891, !893, !894, !895, !896, !899, !900, !905, !906, !907, !909}
!887 = !DILocalVariable(name: "dir_fd", arg: 1, scope: !883, file: !880, line: 314, type: !60)
!888 = !DILocalVariable(name: "file", arg: 2, scope: !883, file: !880, line: 314, type: !89)
!889 = !DILocalVariable(name: "backup_type", arg: 3, scope: !883, file: !880, line: 315, type: !5)
!890 = !DILocalVariable(name: "rename", arg: 4, scope: !883, file: !880, line: 315, type: !230)
!891 = !DILocalVariable(name: "base_offset", scope: !883, file: !880, line: 317, type: !892)
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !145, line: 35, baseType: !120)
!893 = !DILocalVariable(name: "filelen", scope: !883, file: !880, line: 318, type: !144)
!894 = !DILocalVariable(name: "simple_backup_suffix_size", scope: !883, file: !880, line: 325, type: !144)
!895 = !DILocalVariable(name: "backup_suffix_size_guess", scope: !883, file: !880, line: 326, type: !144)
!896 = !DILocalVariable(name: "ssize", scope: !883, file: !880, line: 331, type: !897)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !64, line: 108, baseType: !898)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !66, line: 193, baseType: !120)
!899 = !DILocalVariable(name: "s", scope: !883, file: !880, line: 332, type: !87)
!900 = !DILocalVariable(name: "dirp", scope: !883, file: !880, line: 336, type: !901)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !903, line: 127, baseType: !904)
!903 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!904 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !903, line: 127, flags: DIFlagFwdDecl)
!905 = !DILocalVariable(name: "sdir", scope: !883, file: !880, line: 337, type: !60)
!906 = !DILocalVariable(name: "base_max", scope: !883, file: !880, line: 338, type: !144)
!907 = !DILocalVariable(name: "flags", scope: !908, file: !880, line: 380, type: !7)
!908 = distinct !DILexicalBlock(scope: !883, file: !880, line: 340, column: 5)
!909 = !DILocalVariable(name: "e", scope: !908, file: !880, line: 383, type: !60)
!910 = !{!911}
!911 = !DIEnumerator(name: "GUESS", value: 9, isUnsigned: true)
!912 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "numbered_backup_result", file: !880, line: 172, baseType: !7, size: 32, elements: !913)
!913 = !{!914, !915, !916, !917}
!914 = !DIEnumerator(name: "BACKUP_IS_SAME_LENGTH", value: 0, isUnsigned: true)
!915 = !DIEnumerator(name: "BACKUP_IS_LONGER", value: 1, isUnsigned: true)
!916 = !DIEnumerator(name: "BACKUP_IS_NEW", value: 2, isUnsigned: true)
!917 = !DIEnumerator(name: "BACKUP_NOMEM", value: 3, isUnsigned: true)
!918 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !919, line: 24, baseType: !7, size: 32, elements: !920)
!919 = !DIFile(filename: "/usr/include/bits/confname.h", directory: "")
!920 = !{!921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941}
!921 = !DIEnumerator(name: "_PC_LINK_MAX", value: 0, isUnsigned: true)
!922 = !DIEnumerator(name: "_PC_MAX_CANON", value: 1, isUnsigned: true)
!923 = !DIEnumerator(name: "_PC_MAX_INPUT", value: 2, isUnsigned: true)
!924 = !DIEnumerator(name: "_PC_NAME_MAX", value: 3, isUnsigned: true)
!925 = !DIEnumerator(name: "_PC_PATH_MAX", value: 4, isUnsigned: true)
!926 = !DIEnumerator(name: "_PC_PIPE_BUF", value: 5, isUnsigned: true)
!927 = !DIEnumerator(name: "_PC_CHOWN_RESTRICTED", value: 6, isUnsigned: true)
!928 = !DIEnumerator(name: "_PC_NO_TRUNC", value: 7, isUnsigned: true)
!929 = !DIEnumerator(name: "_PC_VDISABLE", value: 8, isUnsigned: true)
!930 = !DIEnumerator(name: "_PC_SYNC_IO", value: 9, isUnsigned: true)
!931 = !DIEnumerator(name: "_PC_ASYNC_IO", value: 10, isUnsigned: true)
!932 = !DIEnumerator(name: "_PC_PRIO_IO", value: 11, isUnsigned: true)
!933 = !DIEnumerator(name: "_PC_SOCK_MAXBUF", value: 12, isUnsigned: true)
!934 = !DIEnumerator(name: "_PC_FILESIZEBITS", value: 13, isUnsigned: true)
!935 = !DIEnumerator(name: "_PC_REC_INCR_XFER_SIZE", value: 14, isUnsigned: true)
!936 = !DIEnumerator(name: "_PC_REC_MAX_XFER_SIZE", value: 15, isUnsigned: true)
!937 = !DIEnumerator(name: "_PC_REC_MIN_XFER_SIZE", value: 16, isUnsigned: true)
!938 = !DIEnumerator(name: "_PC_REC_XFER_ALIGN", value: 17, isUnsigned: true)
!939 = !DIEnumerator(name: "_PC_ALLOC_SIZE_MIN", value: 18, isUnsigned: true)
!940 = !DIEnumerator(name: "_PC_SYMLINK_MAX", value: 19, isUnsigned: true)
!941 = !DIEnumerator(name: "_PC_2_SYMLINKS", value: 20, isUnsigned: true)
!942 = !{!943, !299, !944, !234, !567, !948, !951, !954, !958, !142, !7, !144, !973, !976}
!943 = !DISubprogram(name: "getenv", scope: !167, file: !167, line: 634, type: !164, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!944 = !DISubprogram(name: "closedir", scope: !903, file: !903, line: 149, type: !945, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!945 = !DISubroutineType(types: !946)
!946 = !{!60, !947}
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!948 = !DISubprogram(name: "base_len", scope: !300, file: !300, line: 44, type: !949, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!949 = !DISubroutineType(types: !950)
!950 = !{!146, !89}
!951 = !DISubprogram(name: "rewinddir", scope: !903, file: !903, line: 209, type: !952, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!952 = !DISubroutineType(types: !953)
!953 = !{null, !947}
!954 = !DISubprogram(name: "opendirat", scope: !955, file: !955, line: 2, type: !956, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!955 = !DIFile(filename: "./lib/opendirat.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!956 = !DISubroutineType(types: !957)
!957 = !{!947, !60, !89, !60, !190}
!958 = !DISubprogram(name: "readdir", scope: !903, file: !903, line: 162, type: !959, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!959 = !DISubroutineType(types: !960)
!960 = !{!961, !947}
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !963, line: 22, size: 2240, elements: !964)
!963 = !DIFile(filename: "/usr/include/bits/dirent.h", directory: "")
!964 = !{!965, !966, !967, !968, !969}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !962, file: !963, line: 25, baseType: !481, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !962, file: !963, line: 26, baseType: !119, size: 64, offset: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !962, file: !963, line: 31, baseType: !122, size: 16, offset: 128)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !962, file: !963, line: 32, baseType: !670, size: 8, offset: 144)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !962, file: !963, line: 33, baseType: !970, size: 2048, offset: 152)
!970 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 2048, elements: !971)
!971 = !{!972}
!972 = !DISubrange(count: 256)
!973 = !DISubprogram(name: "pathconf", scope: !364, file: !364, line: 612, type: !974, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!974 = !DISubroutineType(types: !975)
!975 = !{!120, !89, !60}
!976 = !DISubprogram(name: "fpathconf", scope: !364, file: !364, line: 616, type: !977, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!977 = !DISubroutineType(types: !978)
!978 = !{!120, !60, !60}
!979 = !{!877}
!980 = !DIGlobalVariableExpression(var: !981, expr: !DIExpression())
!981 = distinct !DIGlobalVariable(name: "backup_args", scope: !982, file: !983, line: 42, type: !995, isLocal: true, isDefinition: true)
!982 = distinct !DICompileUnit(language: DW_LANG_C99, file: !983, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !984, retainedTypes: !985, globals: !988, nameTableKind: None)
!983 = !DIFile(filename: "lib/backup-find.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!984 = !{!5}
!985 = !{!986, !817, !560, !943}
!986 = !DISubprogram(name: "backupfile_internal", scope: !987, file: !987, line: 3, type: !884, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!987 = !DIFile(filename: "./lib/backup-internal.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!988 = !{!989, !980}
!989 = !DIGlobalVariableExpression(var: !990, expr: !DIExpression())
!990 = distinct !DIGlobalVariable(name: "backup_types", scope: !982, file: !983, line: 53, type: !991, isLocal: true, isDefinition: true)
!991 = !DICompositeType(tag: DW_TAG_array_type, baseType: !992, size: 256, elements: !993)
!992 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!993 = !{!994}
!994 = !DISubrange(count: 8)
!995 = !DICompositeType(tag: DW_TAG_array_type, baseType: !996, size: 576, elements: !870)
!996 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !89)
!997 = !DIGlobalVariableExpression(var: !998, expr: !DIExpression())
!998 = distinct !DIGlobalVariable(name: "file_name", scope: !999, file: !1000, line: 37, type: !89, isLocal: true, isDefinition: true)
!999 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1000, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !91, retainedTypes: !1001, globals: !1050, nameTableKind: None)
!1000 = !DIFile(filename: "lib/closein.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1001 = !{!1002, !1038, !1042, !1045, !83, !1047, !202, !1048}
!1002 = !DISubprogram(name: "freadahead", scope: !1003, file: !1003, line: 41, type: !1004, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !91)
!1003 = !DIFile(filename: "./lib/freadahead.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!146, !1006}
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !98, line: 49, size: 1728, elements: !1008)
!1008 = !{!1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1007, file: !98, line: 51, baseType: !60, size: 32)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1007, file: !98, line: 54, baseType: !87, size: 64, offset: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1007, file: !98, line: 55, baseType: !87, size: 64, offset: 128)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1007, file: !98, line: 56, baseType: !87, size: 64, offset: 192)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1007, file: !98, line: 57, baseType: !87, size: 64, offset: 256)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1007, file: !98, line: 58, baseType: !87, size: 64, offset: 320)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1007, file: !98, line: 59, baseType: !87, size: 64, offset: 384)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1007, file: !98, line: 60, baseType: !87, size: 64, offset: 448)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1007, file: !98, line: 61, baseType: !87, size: 64, offset: 512)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1007, file: !98, line: 64, baseType: !87, size: 64, offset: 576)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1007, file: !98, line: 65, baseType: !87, size: 64, offset: 640)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1007, file: !98, line: 66, baseType: !87, size: 64, offset: 704)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1007, file: !98, line: 68, baseType: !113, size: 64, offset: 768)
