source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.F_triple = type { i8*, i64, i64 }
%struct.Src_to_dest = type { i64, i64, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__acl_entry_ext = type opaque
%struct.__acl_ext = type opaque
%struct.__dirstream = type opaque
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.cp_options = type { i32, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i32, i32, %struct.hash_table*, %struct.hash_table* }
%struct.dir_list = type { %struct.dir_list*, i64, i64 }
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%struct.direntry_t = type { i8*, i64 }
%struct.error_context = type { void (%struct.error_context*, i8*, ...)*, i8* (%struct.error_context*, i8*)*, void (%struct.error_context*, i8*)* }
%struct.extent_info = type { i64, i64, i32 }
%struct.extent_scan = type { i32, i64, i32, i64, i8, i8, %struct.extent_info* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "owner_name", scope: !2, file: !3, line: 74, type: !88, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !82, globals: !144, nameTableKind: None)
!3 = !DIFile(filename: "src/install.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !13, !20, !26, !32, !37, !51, !74}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "backup_type", file: !6, line: 30, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/backupfile.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "no_backups", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "simple_backups", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "numbered_existing_backups", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "numbered_backups", value: 3, isUnsigned: true)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Dereference_symlink", file: !14, line: 69, baseType: !7, size: 32, elements: !15)
!14 = !DIFile(filename: "src/copy.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!15 = !{!16, !17, !18, !19}
!16 = !DIEnumerator(name: "DEREF_UNDEFINED", value: 1, isUnsigned: true)
!17 = !DIEnumerator(name: "DEREF_NEVER", value: 2, isUnsigned: true)
!18 = !DIEnumerator(name: "DEREF_COMMAND_LINE_ARGUMENTS", value: 3, isUnsigned: true)
!19 = !DIEnumerator(name: "DEREF_ALWAYS", value: 4, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Interactive", file: !14, line: 60, baseType: !7, size: 32, elements: !21)
!21 = !{!22, !23, !24, !25}
!22 = !DIEnumerator(name: "I_ALWAYS_YES", value: 1, isUnsigned: true)
!23 = !DIEnumerator(name: "I_ALWAYS_NO", value: 2, isUnsigned: true)
!24 = !DIEnumerator(name: "I_ASK_USER", value: 3, isUnsigned: true)
!25 = !DIEnumerator(name: "I_UNSPECIFIED", value: 4, isUnsigned: true)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Sparse_type", file: !14, line: 26, baseType: !7, size: 32, elements: !27)
!27 = !{!28, !29, !30, !31}
!28 = !DIEnumerator(name: "SPARSE_UNUSED", value: 0, isUnsigned: true)
!29 = !DIEnumerator(name: "SPARSE_NEVER", value: 1, isUnsigned: true)
!30 = !DIEnumerator(name: "SPARSE_AUTO", value: 2, isUnsigned: true)
!31 = !DIEnumerator(name: "SPARSE_ALWAYS", value: 3, isUnsigned: true)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Reflink_type", file: !14, line: 47, baseType: !7, size: 32, elements: !33)
!33 = !{!34, !35, !36}
!34 = !DIEnumerator(name: "REFLINK_NEVER", value: 0, isUnsigned: true)
!35 = !DIEnumerator(name: "REFLINK_AUTO", value: 1, isUnsigned: true)
!36 = !DIEnumerator(name: "REFLINK_ALWAYS", value: 2, isUnsigned: true)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !38, line: 32, baseType: !7, size: 32, elements: !39)
!38 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!39 = !{!40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50}
!40 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!41 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!42 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!43 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!44 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!45 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!46 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!47 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!48 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!49 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!50 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !53, file: !52, line: 39, baseType: !7, size: 32, elements: !67)
!52 = !DIFile(filename: "./lib/savewd.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savewd", file: !52, line: 36, size: 64, elements: !54)
!54 = !{!55, !56}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !53, file: !52, line: 66, baseType: !51, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !53, file: !52, line: 74, baseType: !57, size: 32, offset: 32)
!57 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !53, file: !52, line: 69, size: 32, elements: !58)
!58 = !{!59, !61, !62}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !57, file: !52, line: 71, baseType: !60, size: 32)
!60 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "errnum", scope: !57, file: !52, line: 72, baseType: !60, size: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !57, file: !52, line: 73, baseType: !63, size: 32)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !64, line: 97, baseType: !65)
!64 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !66, line: 154, baseType: !60)
!66 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!67 = !{!68, !69, !70, !71, !72, !73}
!68 = !DIEnumerator(name: "INITIAL_STATE", value: 0, isUnsigned: true)
!69 = !DIEnumerator(name: "FD_STATE", value: 1, isUnsigned: true)
!70 = !DIEnumerator(name: "FD_POST_CHDIR_STATE", value: 2, isUnsigned: true)
!71 = !DIEnumerator(name: "FORKING_STATE", value: 3, isUnsigned: true)
!72 = !DIEnumerator(name: "ERROR_STATE", value: 4, isUnsigned: true)
!73 = !DIEnumerator(name: "FINAL_STATE", value: 5, isUnsigned: true)
!74 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !75, line: 25, baseType: !7, size: 32, elements: !76)
!75 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!76 = !{!77, !78, !79, !80, !81}
!77 = !DIEnumerator(name: "LONGINT_OK", value: 0, isUnsigned: true)
!78 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1, isUnsigned: true)
!79 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2, isUnsigned: true)
!80 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3, isUnsigned: true)
!81 = !DIEnumerator(name: "LONGINT_INVALID", value: 4, isUnsigned: true)
!82 = !{!83, !88, !90, !91, !93, !95}
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !84, line: 72, baseType: !85)
!84 = !DIFile(filename: "/usr/include/signal.h", directory: "")
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DISubroutineType(types: !87)
!87 = !{null, !60}
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !64, line: 79, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !66, line: 146, baseType: !7)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !64, line: 64, baseType: !94)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !66, line: 147, baseType: !7)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cp_options", file: !14, line: 98, size: 640, elements: !97)
!97 = !{!98, !99, !100, !101, !102, !105, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !143}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "backup_type", scope: !96, file: !14, line: 100, baseType: !5, size: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "dereference", scope: !96, file: !14, line: 103, baseType: !13, size: 32, offset: 32)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !96, file: !14, line: 108, baseType: !20, size: 32, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_mode", scope: !96, file: !14, line: 111, baseType: !26, size: 32, offset: 96)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !96, file: !14, line: 115, baseType: !103, size: 32, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !64, line: 69, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !66, line: 150, baseType: !7)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "copy_as_regular", scope: !96, file: !14, line: 119, baseType: !106, size: 8, offset: 160)
!106 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_before_opening", scope: !96, file: !14, line: 123, baseType: !106, size: 8, offset: 168)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_after_failed_open", scope: !96, file: !14, line: 130, baseType: !106, size: 8, offset: 176)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "hard_link", scope: !96, file: !14, line: 134, baseType: !106, size: 8, offset: 184)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "move_mode", scope: !96, file: !14, line: 138, baseType: !106, size: 8, offset: 192)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "install_mode", scope: !96, file: !14, line: 141, baseType: !106, size: 8, offset: 200)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "chown_privileges", scope: !96, file: !14, line: 145, baseType: !106, size: 8, offset: 208)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "owner_privileges", scope: !96, file: !14, line: 152, baseType: !106, size: 8, offset: 216)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "one_file_system", scope: !96, file: !14, line: 156, baseType: !106, size: 8, offset: 224)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_ownership", scope: !96, file: !14, line: 160, baseType: !106, size: 8, offset: 232)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_mode", scope: !96, file: !14, line: 161, baseType: !106, size: 8, offset: 240)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_timestamps", scope: !96, file: !14, line: 162, baseType: !106, size: 8, offset: 248)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "explicit_no_preserve_mode", scope: !96, file: !14, line: 163, baseType: !106, size: 8, offset: 256)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "set_security_context", scope: !96, file: !14, line: 166, baseType: !106, size: 8, offset: 264)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_links", scope: !96, file: !14, line: 178, baseType: !106, size: 8, offset: 272)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "data_copy_required", scope: !96, file: !14, line: 182, baseType: !106, size: 8, offset: 280)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve", scope: !96, file: !14, line: 188, baseType: !106, size: 8, offset: 288)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_security_context", scope: !96, file: !14, line: 192, baseType: !106, size: 8, offset: 296)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_context", scope: !96, file: !14, line: 201, baseType: !106, size: 8, offset: 304)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_xattr", scope: !96, file: !14, line: 205, baseType: !106, size: 8, offset: 312)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_xattr", scope: !96, file: !14, line: 214, baseType: !106, size: 8, offset: 320)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "reduce_diagnostics", scope: !96, file: !14, line: 223, baseType: !106, size: 8, offset: 328)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !96, file: !14, line: 227, baseType: !106, size: 8, offset: 336)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "set_mode", scope: !96, file: !14, line: 231, baseType: !106, size: 8, offset: 344)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "symbolic_link", scope: !96, file: !14, line: 235, baseType: !106, size: 8, offset: 352)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !96, file: !14, line: 239, baseType: !106, size: 8, offset: 360)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !96, file: !14, line: 242, baseType: !106, size: 8, offset: 368)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_tty", scope: !96, file: !14, line: 245, baseType: !106, size: 8, offset: 376)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "open_dangling_dest_symlink", scope: !96, file: !14, line: 250, baseType: !106, size: 8, offset: 384)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "last_file", scope: !96, file: !14, line: 254, baseType: !106, size: 8, offset: 392)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "rename_errno", scope: !96, file: !14, line: 259, baseType: !60, size: 32, offset: 416)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "reflink_mode", scope: !96, file: !14, line: 262, baseType: !32, size: 32, offset: 448)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "dest_info", scope: !96, file: !14, line: 273, baseType: !139, size: 64, offset: 512)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !141, line: 69, baseType: !142)
!141 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !141, line: 67, flags: DIFlagFwdDecl)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "src_info", scope: !96, file: !14, line: 276, baseType: !139, size: 64, offset: 576)
!144 = !{!0, !145, !147, !149, !151, !153, !155, !171, !173, !175, !177, !179, !181, !183, !185, !200, !202}
!145 = !DIGlobalVariableExpression(var: !146, expr: !DIExpression())
!146 = distinct !DIGlobalVariable(name: "group_name", scope: !2, file: !3, line: 81, type: !88, isLocal: true, isDefinition: true)
!147 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression())
!148 = distinct !DIGlobalVariable(name: "copy_only_if_needed", scope: !2, file: !3, line: 102, type: !106, isLocal: true, isDefinition: true)
!149 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression())
!150 = distinct !DIGlobalVariable(name: "strip_files", scope: !2, file: !3, line: 105, type: !106, isLocal: true, isDefinition: true)
!151 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression())
!152 = distinct !DIGlobalVariable(name: "dir_arg", scope: !2, file: !3, line: 108, type: !106, isLocal: true, isDefinition: true)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "selinux_enabled", scope: !2, file: !3, line: 53, type: !60, isLocal: true, isDefinition: true)
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 121, type: !157, isLocal: true, isDefinition: true)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 4608, elements: !169)
!158 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !159)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !160, line: 50, size: 256, elements: !161)
!160 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!161 = !{!162, !165, !166, !168}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !159, file: !160, line: 52, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !89)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !159, file: !160, line: 55, baseType: !60, size: 32, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !159, file: !160, line: 56, baseType: !167, size: 64, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !159, file: !160, line: 57, baseType: !60, size: 32, offset: 192)
!169 = !{!170}
!170 = !DISubrange(count: 18)
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(name: "strip_program", scope: !2, file: !3, line: 111, type: !163, isLocal: true, isDefinition: true)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(name: "use_default_selinux_context", scope: !2, file: !3, line: 54, type: !106, isLocal: true, isDefinition: true)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "mode", scope: !2, file: !3, line: 90, type: !103, isLocal: true, isDefinition: true)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "dir_mode_bits", scope: !2, file: !3, line: 99, type: !103, isLocal: true, isDefinition: true)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(name: "dir_mode", scope: !2, file: !3, line: 93, type: !103, isLocal: true, isDefinition: true)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "owner_id", scope: !2, file: !3, line: 77, type: !91, isLocal: true, isDefinition: true)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(name: "group_id", scope: !2, file: !3, line: 84, type: !93, isLocal: true, isDefinition: true)
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "a_buff", scope: !187, file: !3, line: 149, type: !197, isLocal: true, isDefinition: true)
!187 = distinct !DISubprogram(name: "have_same_content", scope: !3, file: !3, line: 146, type: !188, scopeLine: 147, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !190)
!188 = !DISubroutineType(types: !189)
!189 = !{!106, !60, !60}
!190 = !{!191, !192, !193}
!191 = !DILocalVariable(name: "a_fd", arg: 1, scope: !187, file: !3, line: 146, type: !60)
!192 = !DILocalVariable(name: "b_fd", arg: 2, scope: !187, file: !3, line: 146, type: !60)
!193 = !DILocalVariable(name: "size", scope: !187, file: !3, line: 152, type: !194)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !195, line: 46, baseType: !196)
!195 = !DIFile(filename: "/usr/lib/clang/12.0.1/include/stddef.h", directory: "")
!196 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 32768, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 4096)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(name: "b_buff", scope: !187, file: !3, line: 150, type: !197, isLocal: true, isDefinition: true)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(name: "first_call", scope: !204, file: !3, line: 318, type: !106, isLocal: true, isDefinition: true)
!204 = distinct !DISubprogram(name: "setdefaultfilecon", scope: !3, file: !3, line: 314, type: !205, scopeLine: 315, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !207)
!205 = !DISubroutineType(types: !206)
!206 = !{null, !163}
!207 = !{!208, !209, !245, !246, !249, !250}
!208 = !DILocalVariable(name: "file", arg: 1, scope: !204, file: !3, line: 314, type: !163)
!209 = !DILocalVariable(name: "st", scope: !204, file: !3, line: 316, type: !210)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !211, line: 26, size: 1152, elements: !212)
!211 = !DIFile(filename: "/usr/include/bits/struct_stat.h", directory: "")
!212 = !{!213, !215, !217, !219, !220, !221, !222, !223, !224, !227, !229, !231, !239, !240, !241}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !210, file: !211, line: 28, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !66, line: 145, baseType: !196)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !210, file: !211, line: 33, baseType: !216, size: 64, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !66, line: 148, baseType: !196)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !210, file: !211, line: 41, baseType: !218, size: 64, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !66, line: 151, baseType: !196)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !210, file: !211, line: 42, baseType: !104, size: 32, offset: 192)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !210, file: !211, line: 44, baseType: !92, size: 32, offset: 224)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !210, file: !211, line: 45, baseType: !94, size: 32, offset: 256)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !210, file: !211, line: 47, baseType: !60, size: 32, offset: 288)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !210, file: !211, line: 49, baseType: !214, size: 64, offset: 320)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !210, file: !211, line: 54, baseType: !225, size: 64, offset: 384)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !66, line: 152, baseType: !226)
!226 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !210, file: !211, line: 58, baseType: !228, size: 64, offset: 448)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !66, line: 175, baseType: !226)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !210, file: !211, line: 60, baseType: !230, size: 64, offset: 512)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !66, line: 180, baseType: !226)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !210, file: !211, line: 71, baseType: !232, size: 128, offset: 576)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !233, line: 10, size: 128, elements: !234)
!233 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!234 = !{!235, !237}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !232, file: !233, line: 12, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !66, line: 160, baseType: !226)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !232, file: !233, line: 16, baseType: !238, size: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !66, line: 197, baseType: !226)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !210, file: !211, line: 72, baseType: !232, size: 128, offset: 704)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !210, file: !211, line: 73, baseType: !232, size: 128, offset: 832)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !210, file: !211, line: 86, baseType: !242, size: 192, offset: 960)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !238, size: 192, elements: !243)
!243 = !{!244}
!244 = !DISubrange(count: 3)
!245 = !DILocalVariable(name: "scontext", scope: !204, file: !3, line: 317, type: !88)
!246 = !DILocalVariable(name: "p0", scope: !247, file: !3, line: 337, type: !163)
!247 = distinct !DILexicalBlock(scope: !248, file: !3, line: 329, column: 5)
!248 = distinct !DILexicalBlock(scope: !204, file: !3, line: 328, column: 7)
!249 = !DILocalVariable(name: "p", scope: !247, file: !3, line: 338, type: !163)
!250 = !DILocalVariable(name: "prefix", scope: !251, file: !3, line: 347, type: !88)
!251 = distinct !DILexicalBlock(scope: !252, file: !3, line: 346, column: 9)
!252 = distinct !DILexicalBlock(scope: !247, file: !3, line: 345, column: 11)
!253 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!254 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!255 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(name: "top_level_src_name", scope: !258, file: !259, line: 147, type: !163, isLocal: true, isDefinition: true)
!258 = distinct !DICompileUnit(language: DW_LANG_C99, file: !259, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !260, retainedTypes: !285, globals: !287, nameTableKind: None)
!259 = !DIFile(filename: "src/copy.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!260 = !{!5, !13, !20, !26, !32, !37, !261, !265, !272, !281}
!261 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !262, line: 27, baseType: !7, size: 32, elements: !263)
!262 = !DIFile(filename: "./lib/utimecmp.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!263 = !{!264}
!264 = !DIEnumerator(name: "UTIMECMP_TRUNCATE_SOURCE", value: 1, isUnsigned: true)
!265 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "savedir_option", file: !266, line: 26, baseType: !7, size: 32, elements: !267)
!266 = !DIFile(filename: "./lib/savedir.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!267 = !{!268, !269, !270, !271}
!268 = !DIEnumerator(name: "SAVEDIR_SORT_NONE", value: 0, isUnsigned: true)
!269 = !DIEnumerator(name: "SAVEDIR_SORT_NAME", value: 1, isUnsigned: true)
!270 = !DIEnumerator(name: "SAVEDIR_SORT_INODE", value: 2, isUnsigned: true)
!271 = !DIEnumerator(name: "SAVEDIR_SORT_FASTREAD", value: 2, isUnsigned: true)
!272 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !273, line: 45, baseType: !7, size: 32, elements: !274)
!273 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!274 = !{!275, !276, !277, !278, !279, !280}
!275 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0, isUnsigned: true)
!276 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2, isUnsigned: true)
!277 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5, isUnsigned: true)
!278 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4, isUnsigned: true)
!279 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3, isUnsigned: true)
!280 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1, isUnsigned: true)
!281 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !282, line: 73, baseType: !7, size: 32, elements: !283)
!282 = !DIFile(filename: "src/ioblksize.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!283 = !{!284}
!284 = !DIEnumerator(name: "IO_BUFSIZE", value: 131072, isUnsigned: true)
!285 = !{!103, !90, !7, !88, !196, !286, !194}
!286 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!287 = !{!288, !256, !294, !296, !308, !310}
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(name: "mask", scope: !290, file: !259, line: 3087, type: !103, isLocal: true, isDefinition: true)
!290 = distinct !DISubprogram(name: "cached_umask", scope: !259, file: !259, line: 3085, type: !291, scopeLine: 3086, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !258, retainedNodes: !293)
!291 = !DISubroutineType(types: !292)
!292 = !{!103}
!293 = !{}
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(name: "top_level_dst_name", scope: !258, file: !259, line: 148, type: !163, isLocal: true, isDefinition: true)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "zeros", scope: !298, file: !259, line: 385, type: !88, isLocal: true, isDefinition: true)
!298 = distinct !DISubprogram(name: "write_zeros", scope: !259, file: !259, line: 383, type: !299, scopeLine: 384, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !258, retainedNodes: !303)
!299 = !DISubroutineType(types: !300)
!300 = !{!106, !60, !301}
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !302, line: 63, baseType: !225)
!302 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!303 = !{!304, !305, !306}
!304 = !DILocalVariable(name: "fd", arg: 1, scope: !298, file: !259, line: 383, type: !60)
!305 = !DILocalVariable(name: "n_bytes", arg: 2, scope: !298, file: !259, line: 383, type: !301)
!306 = !DILocalVariable(name: "n", scope: !307, file: !259, line: 404, type: !194)
!307 = distinct !DILexicalBlock(scope: !298, file: !259, line: 403, column: 5)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(name: "nz", scope: !298, file: !259, line: 386, type: !194, isLocal: true, isDefinition: true)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(name: "fallback", scope: !298, file: !259, line: 393, type: !312, isLocal: true, isDefinition: true)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 8192, elements: !313)
!313 = !{!314}
!314 = !DISubrange(count: 1024)
!315 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709421568, DW_OP_mul, DW_OP_constu, 131072, DW_OP_plus, DW_OP_stack_value))
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "src_to_dest", scope: !318, file: !319, line: 45, type: !139, isLocal: true, isDefinition: true)
!318 = distinct !DICompileUnit(language: DW_LANG_C99, file: !319, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !293, retainedTypes: !320, globals: !324, nameTableKind: None)
!319 = !DIFile(filename: "src/cp-hash.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!320 = !{!90, !88, !321}
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !322, line: 102, baseType: !323)
!322 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !66, line: 73, baseType: !196)
!324 = !{!316}
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "simple_pattern", scope: !327, file: !328, line: 38, type: !337, isLocal: true, isDefinition: true)
!327 = distinct !DICompileUnit(language: DW_LANG_C99, file: !328, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !329, globals: !336, nameTableKind: None)
!328 = !DIFile(filename: "src/force-link.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!329 = !{!330, !333}
!330 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !328, line: 39, baseType: !7, size: 32, elements: !331)
!331 = !{!332}
!332 = !DIEnumerator(name: "x_suffix_len", value: 6, isUnsigned: true)
!333 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !328, line: 44, baseType: !7, size: 32, elements: !334)
!334 = !{!335}
!335 = !DIEnumerator(name: "smallsize", value: 256, isUnsigned: true)
!336 = !{!325}
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 72, elements: !338)
!338 = !{!339}
!339 = !DISubrange(count: 9)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(name: "Version", scope: !342, file: !343, line: 2, type: !163, isDefinition: true)
!342 = distinct !DICompileUnit(language: DW_LANG_C99, file: !343, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !293, globals: !344, nameTableKind: None)
!343 = !DIFile(filename: "src/version.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!344 = !{!340}
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(name: "simple_backup_suffix", scope: !347, file: !348, line: 82, type: !163, isDefinition: true)
!347 = distinct !DICompileUnit(language: DW_LANG_C99, file: !348, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !349, retainedTypes: !410, globals: !411, nameTableKind: None)
!348 = !DIFile(filename: "lib/backupfile.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!349 = !{!5, !350, !380, !386}
!350 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !351, file: !348, line: 327, baseType: !7, size: 32, elements: !378)
!351 = distinct !DISubprogram(name: "backupfile_internal", scope: !348, file: !348, line: 314, type: !352, scopeLine: 316, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !347, retainedNodes: !354)
!352 = !DISubroutineType(types: !353)
!353 = !{!88, !60, !163, !5, !106}
!354 = !{!355, !356, !357, !358, !359, !361, !362, !363, !364, !367, !368, !373, !374, !375, !377}
!355 = !DILocalVariable(name: "dir_fd", arg: 1, scope: !351, file: !348, line: 314, type: !60)
!356 = !DILocalVariable(name: "file", arg: 2, scope: !351, file: !348, line: 314, type: !163)
!357 = !DILocalVariable(name: "backup_type", arg: 3, scope: !351, file: !348, line: 315, type: !5)
!358 = !DILocalVariable(name: "rename", arg: 4, scope: !351, file: !348, line: 315, type: !106)
!359 = !DILocalVariable(name: "base_offset", scope: !351, file: !348, line: 317, type: !360)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !195, line: 35, baseType: !226)
!361 = !DILocalVariable(name: "filelen", scope: !351, file: !348, line: 318, type: !194)
!362 = !DILocalVariable(name: "simple_backup_suffix_size", scope: !351, file: !348, line: 325, type: !194)
!363 = !DILocalVariable(name: "backup_suffix_size_guess", scope: !351, file: !348, line: 326, type: !194)
!364 = !DILocalVariable(name: "ssize", scope: !351, file: !348, line: 331, type: !365)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !64, line: 108, baseType: !366)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !66, line: 194, baseType: !226)
!367 = !DILocalVariable(name: "s", scope: !351, file: !348, line: 332, type: !88)
!368 = !DILocalVariable(name: "dirp", scope: !351, file: !348, line: 336, type: !369)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !371, line: 127, baseType: !372)
!371 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !371, line: 127, flags: DIFlagFwdDecl)
!373 = !DILocalVariable(name: "sdir", scope: !351, file: !348, line: 337, type: !60)
!374 = !DILocalVariable(name: "base_max", scope: !351, file: !348, line: 338, type: !194)
!375 = !DILocalVariable(name: "flags", scope: !376, file: !348, line: 380, type: !7)
!376 = distinct !DILexicalBlock(scope: !351, file: !348, line: 340, column: 5)
!377 = !DILocalVariable(name: "e", scope: !376, file: !348, line: 383, type: !60)
!378 = !{!379}
!379 = !DIEnumerator(name: "GUESS", value: 9, isUnsigned: true)
!380 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "numbered_backup_result", file: !348, line: 172, baseType: !7, size: 32, elements: !381)
!381 = !{!382, !383, !384, !385}
!382 = !DIEnumerator(name: "BACKUP_IS_SAME_LENGTH", value: 0, isUnsigned: true)
!383 = !DIEnumerator(name: "BACKUP_IS_LONGER", value: 1, isUnsigned: true)
!384 = !DIEnumerator(name: "BACKUP_IS_NEW", value: 2, isUnsigned: true)
!385 = !DIEnumerator(name: "BACKUP_NOMEM", value: 3, isUnsigned: true)
!386 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !387, line: 24, baseType: !7, size: 32, elements: !388)
!387 = !DIFile(filename: "/usr/include/bits/confname.h", directory: "")
!388 = !{!389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409}
!389 = !DIEnumerator(name: "_PC_LINK_MAX", value: 0, isUnsigned: true)
!390 = !DIEnumerator(name: "_PC_MAX_CANON", value: 1, isUnsigned: true)
!391 = !DIEnumerator(name: "_PC_MAX_INPUT", value: 2, isUnsigned: true)
!392 = !DIEnumerator(name: "_PC_NAME_MAX", value: 3, isUnsigned: true)
!393 = !DIEnumerator(name: "_PC_PATH_MAX", value: 4, isUnsigned: true)
!394 = !DIEnumerator(name: "_PC_PIPE_BUF", value: 5, isUnsigned: true)
!395 = !DIEnumerator(name: "_PC_CHOWN_RESTRICTED", value: 6, isUnsigned: true)
!396 = !DIEnumerator(name: "_PC_NO_TRUNC", value: 7, isUnsigned: true)
!397 = !DIEnumerator(name: "_PC_VDISABLE", value: 8, isUnsigned: true)
!398 = !DIEnumerator(name: "_PC_SYNC_IO", value: 9, isUnsigned: true)
!399 = !DIEnumerator(name: "_PC_ASYNC_IO", value: 10, isUnsigned: true)
!400 = !DIEnumerator(name: "_PC_PRIO_IO", value: 11, isUnsigned: true)
!401 = !DIEnumerator(name: "_PC_SOCK_MAXBUF", value: 12, isUnsigned: true)
!402 = !DIEnumerator(name: "_PC_FILESIZEBITS", value: 13, isUnsigned: true)
!403 = !DIEnumerator(name: "_PC_REC_INCR_XFER_SIZE", value: 14, isUnsigned: true)
!404 = !DIEnumerator(name: "_PC_REC_MAX_XFER_SIZE", value: 15, isUnsigned: true)
!405 = !DIEnumerator(name: "_PC_REC_MIN_XFER_SIZE", value: 16, isUnsigned: true)
!406 = !DIEnumerator(name: "_PC_REC_XFER_ALIGN", value: 17, isUnsigned: true)
!407 = !DIEnumerator(name: "_PC_ALLOC_SIZE_MIN", value: 18, isUnsigned: true)
!408 = !DIEnumerator(name: "_PC_SYMLINK_MAX", value: 19, isUnsigned: true)
!409 = !DIEnumerator(name: "_PC_2_SYMLINKS", value: 20, isUnsigned: true)
!410 = !{!90, !7, !194}
!411 = !{!345}
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(name: "backup_args", scope: !414, file: !415, line: 42, type: !427, isLocal: true, isDefinition: true)
!414 = distinct !DICompileUnit(language: DW_LANG_C99, file: !415, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !416, retainedTypes: !417, globals: !420, nameTableKind: None)
!415 = !DIFile(filename: "lib/backup-find.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!416 = !{!5}
!417 = !{!418}
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!420 = !{!421, !412}
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(name: "backup_types", scope: !414, file: !415, line: 53, type: !423, isLocal: true, isDefinition: true)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !424, size: 256, elements: !425)
!424 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!425 = !{!426}
!426 = !DISubrange(count: 8)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !428, size: 576, elements: !338)
!428 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !163)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(name: "file_name", scope: !431, file: !432, line: 37, type: !163, isLocal: true, isDefinition: true)
!431 = distinct !DICompileUnit(language: DW_LANG_C99, file: !432, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !293, globals: !433, nameTableKind: None)
!432 = !DIFile(filename: "lib/closein.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!433 = !{!429}
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(name: "file_name", scope: !436, file: !437, line: 46, type: !163, isLocal: true, isDefinition: true)
!436 = distinct !DICompileUnit(language: DW_LANG_C99, file: !437, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !293, globals: !438, nameTableKind: None)
!437 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!438 = !{!434, !439}
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !436, file: !437, line: 56, type: !106, isLocal: true, isDefinition: true)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(name: "exit_failure", scope: !443, file: !444, line: 24, type: !446, isDefinition: true)
!443 = distinct !DICompileUnit(language: DW_LANG_C99, file: !444, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !293, globals: !445, nameTableKind: None)
!444 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!445 = !{!441}
!446 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !60)
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(name: "default_tuning", scope: !449, file: !450, line: 130, type: !453, isLocal: true, isDefinition: true)
!449 = distinct !DICompileUnit(language: DW_LANG_C99, file: !450, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !293, retainedTypes: !451, globals: !452, nameTableKind: None)
!450 = !DIFile(filename: "lib/hash.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!451 = !{!196, !90, !194}
!452 = !{!447}
!453 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !454)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !141, line: 65, baseType: !455)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !141, line: 53, size: 160, elements: !456)
!456 = !{!457, !459, !460, !461, !462}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !455, file: !141, line: 58, baseType: !458, size: 32)
!458 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !455, file: !141, line: 59, baseType: !458, size: 32, offset: 32)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !455, file: !141, line: 60, baseType: !458, size: 32, offset: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !455, file: !141, line: 61, baseType: !458, size: 32, offset: 96)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !455, file: !141, line: 62, baseType: !106, size: 8, offset: 128)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(name: "program_name", scope: !465, file: !466, line: 33, type: !163, isDefinition: true)
!465 = distinct !DICompileUnit(language: DW_LANG_C99, file: !466, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !293, retainedTypes: !467, globals: !468, nameTableKind: None)
!466 = !DIFile(filename: "lib/progname.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!467 = !{!90, !88}
!468 = !{!463}
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !471, file: !472, line: 85, type: !531, isDefinition: true)
!471 = distinct !DICompileUnit(language: DW_LANG_C99, file: !472, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !473, retainedTypes: !494, globals: !496, nameTableKind: None)
!472 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!473 = !{!37, !474, !479}
!474 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !38, line: 242, baseType: !7, size: 32, elements: !475)
!475 = !{!476, !477, !478}
!476 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!477 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!478 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!479 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !480, line: 46, baseType: !7, size: 32, elements: !481)
!480 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!481 = !{!482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493}
!482 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!483 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!484 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!485 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!486 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!487 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!488 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!489 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!490 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!491 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!492 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!493 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!494 = !{!60, !495, !194, !88}
!495 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!496 = !{!469, !497, !503, !513, !515, !520, !527, !529}
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !471, file: !472, line: 101, type: !499, isDefinition: true)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !500, size: 320, elements: !501)
!500 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!501 = !{!502}
!502 = !DISubrange(count: 10)
!503 = !DIGlobalVariableExpression(var: !504, expr: !DIExpression())
!504 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !471, file: !472, line: 1052, type: !505, isDefinition: true)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !472, line: 65, size: 448, elements: !506)
!506 = !{!507, !508, !509, !511, !512}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !505, file: !472, line: 68, baseType: !37, size: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !505, file: !472, line: 71, baseType: !60, size: 32, offset: 32)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !505, file: !472, line: 75, baseType: !510, size: 256, offset: 64)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !425)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !505, file: !472, line: 78, baseType: !163, size: 64, offset: 320)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !505, file: !472, line: 81, baseType: !163, size: 64, offset: 384)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !471, file: !472, line: 116, type: !505, isLocal: true, isDefinition: true)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(name: "slot0", scope: !471, file: !472, line: 842, type: !517, isLocal: true, isDefinition: true)
!517 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 2048, elements: !518)
!518 = !{!519}
!519 = !DISubrange(count: 256)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(name: "slotvec", scope: !471, file: !472, line: 845, type: !522, isLocal: true, isDefinition: true)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !472, line: 834, size: 128, elements: !524)
!524 = !{!525, !526}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !523, file: !472, line: 836, baseType: !194, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !523, file: !472, line: 837, baseType: !88, size: 64, offset: 64)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(name: "nslots", scope: !471, file: !472, line: 843, type: !60, isLocal: true, isDefinition: true)
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(name: "slotvec0", scope: !471, file: !472, line: 844, type: !523, isLocal: true, isDefinition: true)
!531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !428, size: 704, elements: !532)
!532 = !{!533}
!533 = !DISubrange(count: 11)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(name: "comparison_function_table", scope: !536, file: !537, line: 74, type: !554, isLocal: true, isDefinition: true)
!536 = distinct !DICompileUnit(language: DW_LANG_C99, file: !537, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !538, retainedTypes: !552, globals: !553, nameTableKind: None)
!537 = !DIFile(filename: "lib/savedir.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!538 = !{!265, !539}
!539 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !541, file: !540, line: 186, baseType: !7, size: 32, elements: !550)
!540 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!541 = distinct !DISubprogram(name: "x2nrealloc", scope: !540, file: !540, line: 174, type: !542, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !536, retainedNodes: !545)
!542 = !DISubroutineType(types: !543)
!543 = !{!90, !90, !544, !194}
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!545 = !{!546, !547, !548, !549}
!546 = !DILocalVariable(name: "p", arg: 1, scope: !541, file: !540, line: 174, type: !90)
!547 = !DILocalVariable(name: "pn", arg: 2, scope: !541, file: !540, line: 174, type: !544)
!548 = !DILocalVariable(name: "s", arg: 3, scope: !541, file: !540, line: 174, type: !194)
!549 = !DILocalVariable(name: "n", scope: !541, file: !540, line: 176, type: !194)
!550 = !{!551}
!551 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!552 = !{!90, !194}
!553 = !{!534}
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !555, size: 192, elements: !243)
!555 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !556)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "comparison_function", file: !537, line: 72, baseType: !557)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DISubroutineType(types: !559)
!559 = !{!60, !418, !418}
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(name: "letters", scope: !562, file: !563, line: 184, type: !565, isLocal: true, isDefinition: true)
!562 = distinct !DICompileUnit(language: DW_LANG_C99, file: !563, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !293, globals: !564, nameTableKind: None)
!563 = !DIFile(filename: "lib/tempname.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!564 = !{!560}
!565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 504, elements: !566)
!566 = !{!567}
!567 = !DISubrange(count: 63)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(name: "ht", scope: !570, file: !571, line: 163, type: !139, isLocal: true, isDefinition: true)
!570 = distinct !DISubprogram(name: "utimecmpat", scope: !571, file: !571, line: 132, type: !572, scopeLine: 136, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !597, retainedNodes: !612)
!571 = !DIFile(filename: "lib/utimecmp.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!572 = !DISubroutineType(types: !573)
!573 = !{!60, !60, !163, !574, !574, !60}
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !576)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !211, line: 26, size: 1152, elements: !577)
!577 = !{!578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !594, !595, !596}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !576, file: !211, line: 28, baseType: !214, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !576, file: !211, line: 33, baseType: !216, size: 64, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !576, file: !211, line: 41, baseType: !218, size: 64, offset: 128)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !576, file: !211, line: 42, baseType: !104, size: 32, offset: 192)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !576, file: !211, line: 44, baseType: !92, size: 32, offset: 224)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !576, file: !211, line: 45, baseType: !94, size: 32, offset: 256)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !576, file: !211, line: 47, baseType: !60, size: 32, offset: 288)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !576, file: !211, line: 49, baseType: !214, size: 64, offset: 320)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !576, file: !211, line: 54, baseType: !225, size: 64, offset: 384)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !576, file: !211, line: 58, baseType: !228, size: 64, offset: 448)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !576, file: !211, line: 60, baseType: !230, size: 64, offset: 512)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !576, file: !211, line: 71, baseType: !590, size: 128, offset: 576)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !233, line: 10, size: 128, elements: !591)
!591 = !{!592, !593}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !590, file: !233, line: 12, baseType: !236, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !590, file: !233, line: 16, baseType: !238, size: 64, offset: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !576, file: !211, line: 72, baseType: !590, size: 128, offset: 704)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !576, file: !211, line: 73, baseType: !590, size: 128, offset: 832)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !576, file: !211, line: 86, baseType: !242, size: 192, offset: 960)
!597 = distinct !DICompileUnit(language: DW_LANG_C99, file: !571, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !598, globals: !602, nameTableKind: None)
!598 = !{!261, !599}
!599 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !571, line: 49, baseType: !7, size: 32, elements: !600)
!600 = !{!601}
!601 = !DIEnumerator(name: "SYSCALL_RESOLUTION", value: 1, isUnsigned: true)
!602 = !{!568, !603}
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(name: "new_dst_res", scope: !570, file: !571, line: 166, type: !605, isLocal: true, isDefinition: true)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fs_res", file: !571, line: 66, size: 128, elements: !607)
!607 = !{!608, !610, !611}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !606, file: !571, line: 69, baseType: !609, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !64, line: 59, baseType: !214)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "resolution", scope: !606, file: !571, line: 76, baseType: !60, size: 32, offset: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "exact", scope: !606, file: !571, line: 80, baseType: !106, size: 8, offset: 96)
!612 = !{!613, !614, !615, !616, !617, !618, !621, !622, !623, !624, !627, !628, !629, !632, !633, !634, !635, !636, !637, !639, !642, !643, !644, !645, !651, !652, !654, !656, !658, !659}
!613 = !DILocalVariable(name: "dfd", arg: 1, scope: !570, file: !571, line: 132, type: !60)
!614 = !DILocalVariable(name: "dst_name", arg: 2, scope: !570, file: !571, line: 132, type: !163)
!615 = !DILocalVariable(name: "dst_stat", arg: 3, scope: !570, file: !571, line: 133, type: !574)
!616 = !DILocalVariable(name: "src_stat", arg: 4, scope: !570, file: !571, line: 134, type: !574)
!617 = !DILocalVariable(name: "options", arg: 5, scope: !570, file: !571, line: 135, type: !60)
!618 = !DILocalVariable(name: "dst_s", scope: !570, file: !571, line: 153, type: !619)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !620, line: 7, baseType: !236)
!620 = !DIFile(filename: "/usr/include/bits/types/time_t.h", directory: "")
!621 = !DILocalVariable(name: "src_s", scope: !570, file: !571, line: 154, type: !619)
!622 = !DILocalVariable(name: "dst_ns", scope: !570, file: !571, line: 155, type: !60)
!623 = !DILocalVariable(name: "src_ns", scope: !570, file: !571, line: 156, type: !60)
!624 = !DILocalVariable(name: "dst_res", scope: !625, file: !571, line: 167, type: !605)
!625 = distinct !DILexicalBlock(scope: !626, file: !571, line: 159, column: 5)
!626 = distinct !DILexicalBlock(scope: !570, file: !571, line: 158, column: 7)
!627 = !DILocalVariable(name: "tmp_dst_res", scope: !625, file: !571, line: 168, type: !606)
!628 = !DILocalVariable(name: "res", scope: !625, file: !571, line: 171, type: !60)
!629 = !DILocalVariable(name: "dst_a_s", scope: !630, file: !571, line: 262, type: !619)
!630 = distinct !DILexicalBlock(scope: !631, file: !571, line: 258, column: 9)
!631 = distinct !DILexicalBlock(scope: !625, file: !571, line: 257, column: 11)
!632 = !DILocalVariable(name: "dst_c_s", scope: !630, file: !571, line: 263, type: !619)
!633 = !DILocalVariable(name: "dst_m_s", scope: !630, file: !571, line: 264, type: !619)
!634 = !DILocalVariable(name: "dst_a_ns", scope: !630, file: !571, line: 265, type: !60)
!635 = !DILocalVariable(name: "dst_c_ns", scope: !630, file: !571, line: 266, type: !60)
!636 = !DILocalVariable(name: "dst_m_ns", scope: !630, file: !571, line: 267, type: !60)
!637 = !DILocalVariable(name: "odd_second", scope: !638, file: !571, line: 276, type: !106)
!638 = distinct !DILexicalBlock(scope: !630, file: !571, line: 275, column: 11)
!639 = !DILocalVariable(name: "a", scope: !640, file: !571, line: 285, type: !60)
!640 = distinct !DILexicalBlock(scope: !641, file: !571, line: 284, column: 15)
!641 = distinct !DILexicalBlock(scope: !638, file: !571, line: 278, column: 17)
!642 = !DILocalVariable(name: "c", scope: !640, file: !571, line: 286, type: !60)
!643 = !DILocalVariable(name: "m", scope: !640, file: !571, line: 287, type: !60)
!644 = !DILocalVariable(name: "SR10", scope: !640, file: !571, line: 291, type: !60)
!645 = !DILocalVariable(name: "timespec", scope: !646, file: !571, line: 313, type: !648)
!646 = distinct !DILexicalBlock(scope: !647, file: !571, line: 312, column: 13)
!647 = distinct !DILexicalBlock(scope: !630, file: !571, line: 311, column: 15)
!648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !590, size: 256, elements: !649)
!649 = !{!650}
!650 = !DISubrange(count: 2)
!651 = !DILocalVariable(name: "dst_status", scope: !646, file: !571, line: 314, type: !576)
!652 = !DILocalVariable(name: "s", scope: !653, file: !571, line: 324, type: !619)
!653 = distinct !DILexicalBlock(scope: !646, file: !571, line: 323, column: 15)
!654 = !DILocalVariable(name: "stat_result", scope: !655, file: !571, line: 348, type: !60)
!655 = distinct !DILexicalBlock(scope: !646, file: !571, line: 347, column: 15)
!656 = !DILocalVariable(name: "old_res", scope: !657, file: !571, line: 369, type: !60)
!657 = distinct !DILexicalBlock(scope: !646, file: !571, line: 368, column: 15)
!658 = !DILocalVariable(name: "a", scope: !657, file: !571, line: 370, type: !60)
!659 = !DILabel(scope: !660, name: "low_memory", file: !571, line: 211)
!660 = distinct !DILexicalBlock(scope: !661, file: !571, line: 210, column: 9)
!661 = distinct !DILexicalBlock(scope: !625, file: !571, line: 187, column: 11)
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(name: "utimensat_works_really", scope: !664, file: !665, line: 75, type: !60, isLocal: true, isDefinition: true)
!664 = distinct !DICompileUnit(language: DW_LANG_C99, file: !665, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !666, globals: !671, nameTableKind: None)
!665 = !DIFile(filename: "lib/utimens.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!666 = !{!667}
!667 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !668, line: 42, baseType: !7, size: 32, elements: !669)
!668 = !DIFile(filename: "./lib/timespec.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!669 = !{!670}
!670 = !DIEnumerator(name: "TIMESPEC_HZ", value: 1000000000, isUnsigned: true)
!671 = !{!662, !672}
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(name: "lutimensat_works_really", scope: !664, file: !665, line: 76, type: !60, isLocal: true, isDefinition: true)
!674 = !DIGlobalVariableExpression(var: !675, expr: !DIExpression())
!675 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !676, file: !677, line: 26, type: !679, isDefinition: true)
!676 = distinct !DICompileUnit(language: DW_LANG_C99, file: !677, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !293, globals: !678, nameTableKind: None)
!677 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!678 = !{!674}
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 376, elements: !680)
!680 = !{!681}
!681 = !DISubrange(count: 47)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!683 = distinct !DIGlobalVariable(name: "initialized", scope: !684, file: !685, line: 34, type: !106, isLocal: true, isDefinition: true)
!684 = distinct !DISubprogram(name: "can_write_any_file", scope: !685, file: !685, line: 32, type: !686, scopeLine: 33, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !688, retainedNodes: !693)
!685 = !DIFile(filename: "lib/write-any-file.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!686 = !DISubroutineType(types: !687)
!687 = !{!106}
!688 = distinct !DICompileUnit(language: DW_LANG_C99, file: !685, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !293, globals: !689, nameTableKind: None)
!689 = !{!690, !691}
!690 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!691 = !DIGlobalVariableExpression(var: !692, expr: !DIExpression())
!692 = distinct !DIGlobalVariable(name: "can_write", scope: !684, file: !685, line: 35, type: !106, isLocal: true, isDefinition: true)
!693 = !{!694}
!694 = !DILocalVariable(name: "can", scope: !695, file: !685, line: 39, type: !106)
!695 = distinct !DILexicalBlock(scope: !696, file: !685, line: 38, column: 5)
!696 = distinct !DILexicalBlock(scope: !684, file: !685, line: 37, column: 7)
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !699, file: !700, line: 67, type: !704, isDefinition: true)
!699 = distinct !DICompileUnit(language: DW_LANG_C99, file: !700, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !701, retainedTypes: !702, globals: !703, nameTableKind: None)
!700 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!701 = !{!37}
!702 = !{!90, !163, !286}
!703 = !{!697}
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !705, line: 61, baseType: !706)
!705 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DISubroutineType(types: !708)
!708 = !{null}
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !711, file: !712, line: 507, type: !60, isLocal: true, isDefinition: true)
!711 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !712, file: !712, line: 488, type: !713, scopeLine: 489, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !715, retainedNodes: !717)
!712 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!713 = !DISubroutineType(types: !714)
!714 = !{!60, !60, !60}
!715 = distinct !DICompileUnit(language: DW_LANG_C99, file: !712, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !293, globals: !716, nameTableKind: None)
!716 = !{!709}
!717 = !{!718, !719, !720, !721, !724}
!718 = !DILocalVariable(name: "fd", arg: 1, scope: !711, file: !712, line: 488, type: !60)
!719 = !DILocalVariable(name: "target", arg: 2, scope: !711, file: !712, line: 488, type: !60)
!720 = !DILocalVariable(name: "result", scope: !711, file: !712, line: 490, type: !60)
!721 = !DILocalVariable(name: "flags", scope: !722, file: !712, line: 531, type: !60)
!722 = distinct !DILexicalBlock(scope: !723, file: !712, line: 530, column: 5)
!723 = distinct !DILexicalBlock(scope: !711, file: !712, line: 529, column: 7)
!724 = !DILocalVariable(name: "saved_errno", scope: !725, file: !712, line: 534, type: !60)
!725 = distinct !DILexicalBlock(scope: !726, file: !712, line: 533, column: 9)
!726 = distinct !DILexicalBlock(scope: !722, file: !712, line: 532, column: 11)
!727 = distinct !DICompileUnit(language: DW_LANG_C99, file: !728, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !293, retainedTypes: !729, nameTableKind: None)
!728 = !DIFile(filename: "src/prog-fprintf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!729 = !{!286}
!730 = distinct !DICompileUnit(language: DW_LANG_C99, file: !731, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !732, retainedTypes: !810, nameTableKind: None)
!731 = !DIFile(filename: "src/extent-scan.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!732 = !{!733}
!733 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !734, file: !731, line: 98, baseType: !7, size: 32, elements: !808)
!734 = distinct !DISubprogram(name: "extent_scan_read", scope: !731, file: !731, line: 87, type: !735, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !730, retainedNodes: !755)
!735 = !DISubroutineType(types: !736)
!736 = !{!106, !737}
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extent_scan", file: !739, line: 36, size: 384, elements: !740)
!739 = !DIFile(filename: "src/extent-scan.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!740 = !{!741, !742, !744, !745, !746, !747, !748}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !738, file: !739, line: 39, baseType: !60, size: 32)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "scan_start", scope: !738, file: !739, line: 42, baseType: !743, size: 64, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !64, line: 85, baseType: !225)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "fm_flags", scope: !738, file: !739, line: 45, baseType: !7, size: 32, offset: 128)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "ei_count", scope: !738, file: !739, line: 48, baseType: !194, size: 64, offset: 192)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "initial_scan_failed", scope: !738, file: !739, line: 52, baseType: !106, size: 8, offset: 256)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "hit_final_extent", scope: !738, file: !739, line: 55, baseType: !106, size: 8, offset: 264)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "ext_info", scope: !738, file: !739, line: 58, baseType: !749, size: 64, offset: 320)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extent_info", file: !739, line: 23, size: 192, elements: !751)
!751 = !{!752, !753, !754}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "ext_logical", scope: !750, file: !739, line: 26, baseType: !743, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "ext_length", scope: !750, file: !739, line: 29, baseType: !743, size: 64, offset: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "ext_flags", scope: !750, file: !739, line: 32, baseType: !7, size: 32, offset: 128)
!755 = !{!756, !757, !758, !759, !793, !795, !797, !799, !800, !807}
!756 = !DILocalVariable(name: "scan", arg: 1, scope: !734, file: !731, line: 87, type: !737)
!757 = !DILocalVariable(name: "si", scope: !734, file: !731, line: 89, type: !7)
!758 = !DILocalVariable(name: "last_ei", scope: !734, file: !731, line: 90, type: !749)
!759 = !DILocalVariable(name: "fiemap_buf", scope: !760, file: !731, line: 94, type: !761)
!760 = distinct !DILexicalBlock(scope: !734, file: !731, line: 93, column: 5)
!761 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !734, file: !731, line: 94, size: 32768, elements: !762)
!762 = !{!763, !792}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !761, file: !731, line: 94, baseType: !764, size: 256)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fiemap", file: !765, line: 35, size: 256, elements: !766)
!765 = !DIFile(filename: "src/fiemap.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!766 = !{!767, !771, !772, !775, !776, !777, !778}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "fm_start", scope: !764, file: !765, line: 38, baseType: !768, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !769, line: 27, baseType: !770)
!769 = !DIFile(filename: "/usr/include/bits/stdint-uintn.h", directory: "")
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !66, line: 45, baseType: !196)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "fm_length", scope: !764, file: !765, line: 41, baseType: !768, size: 64, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "fm_flags", scope: !764, file: !765, line: 44, baseType: !773, size: 32, offset: 128)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !769, line: 26, baseType: !774)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !66, line: 42, baseType: !7)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "fm_mapped_extents", scope: !764, file: !765, line: 47, baseType: !773, size: 32, offset: 160)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "fm_extent_count", scope: !764, file: !765, line: 50, baseType: !773, size: 32, offset: 192)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "fm_reserved", scope: !764, file: !765, line: 52, baseType: !773, size: 32, offset: 224)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "fm_extents", scope: !764, file: !765, line: 55, baseType: !779, offset: 256)
!779 = !DICompositeType(tag: DW_TAG_array_type, baseType: !780, elements: !790)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fiemap_extent", file: !765, line: 14, size: 448, elements: !781)
!781 = !{!782, !783, !784, !785, !787, !788}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "fe_logical", scope: !780, file: !765, line: 18, baseType: !768, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "fe_physical", scope: !780, file: !765, line: 22, baseType: !768, size: 64, offset: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "fe_length", scope: !780, file: !765, line: 25, baseType: !768, size: 64, offset: 128)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "fe_reserved64", scope: !780, file: !765, line: 27, baseType: !786, size: 128, offset: 192)
!786 = !DICompositeType(tag: DW_TAG_array_type, baseType: !768, size: 128, elements: !649)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "fe_flags", scope: !780, file: !765, line: 30, baseType: !773, size: 32, offset: 320)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "fe_reserved", scope: !780, file: !765, line: 32, baseType: !789, size: 96, offset: 352)
!789 = !DICompositeType(tag: DW_TAG_array_type, baseType: !773, size: 96, elements: !243)
!790 = !{!791}
!791 = !DISubrange(count: -1)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !761, file: !731, line: 94, baseType: !197, size: 32768)
!793 = !DILocalVariable(name: "fiemap", scope: !760, file: !731, line: 95, type: !794)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!795 = !DILocalVariable(name: "fm_extents", scope: !760, file: !731, line: 96, type: !796)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!797 = !DILocalVariable(name: "prev_idx", scope: !798, file: !731, line: 132, type: !194)
!798 = distinct !DILexicalBlock(scope: !760, file: !731, line: 129, column: 7)
!799 = !DILocalVariable(name: "i", scope: !760, file: !731, line: 138, type: !7)
!800 = !DILocalVariable(name: "new_logical", scope: !801, file: !731, line: 164, type: !768)
!801 = distinct !DILexicalBlock(scope: !802, file: !731, line: 159, column: 13)
!802 = distinct !DILexicalBlock(scope: !803, file: !731, line: 156, column: 20)
!803 = distinct !DILexicalBlock(scope: !804, file: !731, line: 146, column: 15)
!804 = distinct !DILexicalBlock(scope: !805, file: !731, line: 140, column: 9)
!805 = distinct !DILexicalBlock(scope: !806, file: !731, line: 139, column: 7)
!806 = distinct !DILexicalBlock(scope: !760, file: !731, line: 139, column: 7)
!807 = !DILocalVariable(name: "length_adjust", scope: !801, file: !731, line: 165, type: !768)
!808 = !{!809}
!809 = !DIEnumerator(name: "count", value: 72, isUnsigned: true)
!810 = !{!743, !194}
!811 = distinct !DICompileUnit(language: DW_LANG_C99, file: !812, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !293, nameTableKind: None)
!812 = !DIFile(filename: "src/selinux.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!813 = distinct !DICompileUnit(language: DW_LANG_C99, file: !814, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !293, nameTableKind: None)
!814 = !DIFile(filename: "lib/copy-acl.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!815 = distinct !DICompileUnit(language: DW_LANG_C99, file: !816, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !293, nameTableKind: None)
!816 = !DIFile(filename: "lib/set-acl.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!817 = distinct !DICompileUnit(language: DW_LANG_C99, file: !818, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !819, retainedTypes: !851, nameTableKind: None)
!818 = !DIFile(filename: "lib/areadlink-with-size.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!819 = !{!820}
!820 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !821, file: !818, line: 64, baseType: !7, size: 32, elements: !849)
!821 = distinct !DISubprogram(name: "areadlink_with_size", scope: !818, file: !818, line: 53, type: !822, scopeLine: 54, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !817, retainedNodes: !824)
!822 = !DISubroutineType(types: !823)
!823 = !{!88, !163, !194}
!824 = !{!825, !826, !827, !828, !829, !830, !831, !833, !834, !838, !839, !840, !843}
!825 = !DILocalVariable(name: "file", arg: 1, scope: !821, file: !818, line: 53, type: !163)
!826 = !DILocalVariable(name: "size", arg: 2, scope: !821, file: !818, line: 53, type: !194)
!827 = !DILocalVariable(name: "symlink_max", scope: !821, file: !818, line: 58, type: !194)
!828 = !DILocalVariable(name: "INITIAL_LIMIT_BOUND", scope: !821, file: !818, line: 59, type: !194)
!829 = !DILocalVariable(name: "initial_limit", scope: !821, file: !818, line: 60, type: !194)
!830 = !DILocalVariable(name: "buf_size", scope: !821, file: !818, line: 67, type: !194)
!831 = !DILocalVariable(name: "r", scope: !832, file: !818, line: 72, type: !365)
!832 = distinct !DILexicalBlock(scope: !821, file: !818, line: 71, column: 5)
!833 = !DILocalVariable(name: "link_length", scope: !832, file: !818, line: 73, type: !194)
!834 = !DILocalVariable(name: "stackbuf", scope: !832, file: !818, line: 74, type: !835)
!835 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 1024, elements: !836)
!836 = !{!837}
!837 = !DISubrange(count: 128)
!838 = !DILocalVariable(name: "buf", scope: !832, file: !818, line: 75, type: !88)
!839 = !DILocalVariable(name: "buffer", scope: !832, file: !818, line: 76, type: !88)
!840 = !DILocalVariable(name: "saved_errno", scope: !841, file: !818, line: 92, type: !60)
!841 = distinct !DILexicalBlock(scope: !842, file: !818, line: 91, column: 9)
!842 = distinct !DILexicalBlock(scope: !832, file: !818, line: 90, column: 11)
!843 = !DILocalVariable(name: "shrinked_buffer", scope: !844, file: !818, line: 110, type: !88)
!844 = distinct !DILexicalBlock(scope: !845, file: !818, line: 108, column: 13)
!845 = distinct !DILexicalBlock(scope: !846, file: !818, line: 107, column: 20)
!846 = distinct !DILexicalBlock(scope: !847, file: !818, line: 101, column: 15)
!847 = distinct !DILexicalBlock(scope: !848, file: !818, line: 99, column: 9)
!848 = distinct !DILexicalBlock(scope: !832, file: !818, line: 98, column: 11)
!849 = !{!850}
!850 = !DIEnumerator(name: "stackbuf_size", value: 128, isUnsigned: true)
!851 = !{!90}
!852 = distinct !DICompileUnit(language: DW_LANG_C99, file: !853, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !416, nameTableKind: None)
!853 = !DIFile(filename: "lib/backup-rename.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!854 = distinct !DICompileUnit(language: DW_LANG_C99, file: !855, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !293, nameTableKind: None)
!855 = !DIFile(filename: "lib/buffer-lcm.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!856 = distinct !DICompileUnit(language: DW_LANG_C99, file: !857, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !293, nameTableKind: None)
!857 = !DIFile(filename: "lib/dirname.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!858 = distinct !DICompileUnit(language: DW_LANG_C99, file: !859, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !293, nameTableKind: None)
!859 = !DIFile(filename: "lib/dirname-lgpl.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!860 = distinct !DICompileUnit(language: DW_LANG_C99, file: !861, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !293, retainedTypes: !862, nameTableKind: None)
!861 = !DIFile(filename: "lib/basename-lgpl.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!862 = !{!88}
!863 = distinct !DICompileUnit(language: DW_LANG_C99, file: !864, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !865, nameTableKind: None)
!864 = !DIFile(filename: "lib/fadvise.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!865 = !{!272}
!866 = distinct !DICompileUnit(language: DW_LANG_C99, file: !867, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !293, nameTableKind: None)
!867 = !DIFile(filename: "lib/open-safer.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!868 = distinct !DICompileUnit(language: DW_LANG_C99, file: !869, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !293, retainedTypes: !467, nameTableKind: None)
!869 = !DIFile(filename: "lib/file-set.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!870 = distinct !DICompileUnit(language: DW_LANG_C99, file: !871, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !293, nameTableKind: None)
!871 = !DIFile(filename: "lib/filemode.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!872 = distinct !DICompileUnit(language: DW_LANG_C99, file: !873, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !293, retainedTypes: !851, nameTableKind: None)
!873 = !DIFile(filename: "lib/filenamecat.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!874 = distinct !DICompileUnit(language: DW_LANG_C99, file: !875, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !293, retainedTypes: !851, nameTableKind: None)
!875 = !DIFile(filename: "lib/filenamecat-lgpl.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!876 = distinct !DICompileUnit(language: DW_LANG_C99, file: !877, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !293, retainedTypes: !878, nameTableKind: None)
!877 = !DIFile(filename: "lib/full-read.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!878 = !{!88, !194}
!879 = distinct !DICompileUnit(language: DW_LANG_C99, file: !880, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !293, retainedTypes: !881, nameTableKind: None)
!880 = !DIFile(filename: "lib/full-write.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!881 = !{!163, !194}
!882 = distinct !DICompileUnit(language: DW_LANG_C99, file: !883, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !293, nameTableKind: None)
!883 = !DIFile(filename: "lib/hash-triple.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!884 = distinct !DICompileUnit(language: DW_LANG_C99, file: !885, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !886, nameTableKind: None)
!885 = !DIFile(filename: "lib/mkancesdirs.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!886 = !{!887, !897}
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !888, file: !52, line: 39, baseType: !7, size: 32, elements: !67)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savewd", file: !52, line: 36, size: 64, elements: !889)
!889 = !{!890, !891}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !888, file: !52, line: 66, baseType: !887, size: 32)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !888, file: !52, line: 74, baseType: !892, size: 32, offset: 32)
!892 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !888, file: !52, line: 69, size: 32, elements: !893)
!893 = !{!894, !895, !896}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !892, file: !52, line: 71, baseType: !60, size: 32)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "errnum", scope: !892, file: !52, line: 72, baseType: !60, size: 32)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !892, file: !52, line: 73, baseType: !63, size: 32)
!897 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !52, line: 86, baseType: !7, size: 32, elements: !898)
!898 = !{!899, !900}
!899 = !DIEnumerator(name: "SAVEWD_CHDIR_NOFOLLOW", value: 1, isUnsigned: true)
!900 = !DIEnumerator(name: "SAVEWD_CHDIR_SKIP_READABLE", value: 2, isUnsigned: true)
!901 = distinct !DICompileUnit(language: DW_LANG_C99, file: !902, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !903, retainedTypes: !914, nameTableKind: None)
!902 = !DIFile(filename: "lib/mkdir-p.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!903 = !{!904, !897}
!904 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !905, file: !52, line: 39, baseType: !7, size: 32, elements: !67)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savewd", file: !52, line: 36, size: 64, elements: !906)
!906 = !{!907, !908}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !905, file: !52, line: 66, baseType: !904, size: 32)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !905, file: !52, line: 74, baseType: !909, size: 32, offset: 32)
!909 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !905, file: !52, line: 69, size: 32, elements: !910)
!910 = !{!911, !912, !913}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !909, file: !52, line: 71, baseType: !60, size: 32)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "errnum", scope: !909, file: !52, line: 72, baseType: !60, size: 32)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !909, file: !52, line: 73, baseType: !63, size: 32)
!914 = !{!91, !93}
!915 = distinct !DICompileUnit(language: DW_LANG_C99, file: !916, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !917, retainedTypes: !924, nameTableKind: None)
!916 = !DIFile(filename: "lib/modechange.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!917 = !{!918}
!918 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !916, line: 78, baseType: !7, size: 32, elements: !919)
!919 = !{!920, !921, !922, !923}
!920 = !DIEnumerator(name: "MODE_DONE", value: 0, isUnsigned: true)
!921 = !DIEnumerator(name: "MODE_ORDINARY_CHANGE", value: 1, isUnsigned: true)
!922 = !DIEnumerator(name: "MODE_X_IF_ANY_X", value: 2, isUnsigned: true)
!923 = !DIEnumerator(name: "MODE_COPY_EXISTING", value: 3, isUnsigned: true)
!924 = !{!194}
!925 = distinct !DICompileUnit(language: DW_LANG_C99, file: !926, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !293, nameTableKind: None)
!926 = !DIFile(filename: "lib/opendirat.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!927 = distinct !DICompileUnit(language: DW_LANG_C99, file: !928, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !293, nameTableKind: None)
!928 = !DIFile(filename: "lib/qcopy-acl.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!929 = distinct !DICompileUnit(language: DW_LANG_C99, file: !930, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !293, nameTableKind: None)
!930 = !DIFile(filename: "lib/qset-acl.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!931 = distinct !DICompileUnit(language: DW_LANG_C99, file: !932, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !293, retainedTypes: !862, nameTableKind: None)
!932 = !DIFile(filename: "lib/renameatu.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!933 = distinct !DICompileUnit(language: DW_LANG_C99, file: !934, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !935, nameTableKind: None)
!934 = !DIFile(filename: "lib/safe-read.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!935 = !{!936}
!936 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !937, line: 40, baseType: !7, size: 32, elements: !938)
!937 = !DIFile(filename: "./lib/sys-limits.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!938 = !{!939}
!939 = !DIEnumerator(name: "SYS_BUFSIZE_MAX", value: 2146435072, isUnsigned: true)
!940 = distinct !DICompileUnit(language: DW_LANG_C99, file: !941, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !935, nameTableKind: None)
!941 = !DIFile(filename: "lib/safe-write.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!942 = distinct !DICompileUnit(language: DW_LANG_C99, file: !943, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !293, nameTableKind: None)
!943 = !DIFile(filename: "lib/same.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!944 = distinct !DICompileUnit(language: DW_LANG_C99, file: !945, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !946, nameTableKind: None)
!945 = !DIFile(filename: "lib/savewd.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!946 = !{!947, !897}
!947 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !948, file: !52, line: 39, baseType: !7, size: 32, elements: !67)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savewd", file: !52, line: 36, size: 64, elements: !949)
!949 = !{!950, !951}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !948, file: !52, line: 66, baseType: !947, size: 32)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !948, file: !52, line: 74, baseType: !952, size: 32, offset: 32)
!952 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !948, file: !52, line: 69, size: 32, elements: !953)
!953 = !{!954, !955, !956}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !952, file: !52, line: 71, baseType: !60, size: 32)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "errnum", scope: !952, file: !52, line: 72, baseType: !60, size: 32)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !952, file: !52, line: 73, baseType: !63, size: 32)
!957 = distinct !DICompileUnit(language: DW_LANG_C99, file: !958, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !293, nameTableKind: None)
!958 = !DIFile(filename: "lib/fd-safer.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!959 = distinct !DICompileUnit(language: DW_LANG_C99, file: !960, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !293, nameTableKind: None)
!960 = !DIFile(filename: "lib/verror.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!961 = distinct !DICompileUnit(language: DW_LANG_C99, file: !962, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !963, retainedTypes: !851, nameTableKind: None)
!962 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!963 = !{!964}
!964 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !962, line: 40, baseType: !7, size: 32, elements: !965)
!965 = !{!966}
!966 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!967 = distinct !DICompileUnit(language: DW_LANG_C99, file: !968, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !969, retainedTypes: !977, nameTableKind: None)
!968 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!969 = !{!970}
!970 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !971, file: !540, line: 186, baseType: !7, size: 32, elements: !550)
!971 = distinct !DISubprogram(name: "x2nrealloc", scope: !540, file: !540, line: 174, type: !542, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !967, retainedNodes: !972)
!972 = !{!973, !974, !975, !976}
!973 = !DILocalVariable(name: "p", arg: 1, scope: !971, file: !540, line: 174, type: !90)
!974 = !DILocalVariable(name: "pn", arg: 2, scope: !971, file: !540, line: 174, type: !544)
!975 = !DILocalVariable(name: "s", arg: 3, scope: !971, file: !540, line: 174, type: !194)
!976 = !DILocalVariable(name: "n", scope: !971, file: !540, line: 176, type: !194)
!977 = !{!194, !88, !90}
!978 = distinct !DICompileUnit(language: DW_LANG_C99, file: !979, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !293, nameTableKind: None)
!979 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!980 = distinct !DICompileUnit(language: DW_LANG_C99, file: !981, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !982, retainedTypes: !983, nameTableKind: None)
!981 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!982 = !{!74, !479}
!983 = !{!60, !495}
!984 = distinct !DICompileUnit(language: DW_LANG_C99, file: !985, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !293, retainedTypes: !862, nameTableKind: None)
!985 = !DIFile(filename: "lib/xvasprintf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!986 = distinct !DICompileUnit(language: DW_LANG_C99, file: !987, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !293, nameTableKind: None)
!987 = !DIFile(filename: "lib/yesno.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!988 = distinct !DICompileUnit(language: DW_LANG_C99, file: !989, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !293, retainedTypes: !851, nameTableKind: None)
!989 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!990 = distinct !DICompileUnit(language: DW_LANG_C99, file: !991, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !293, retainedTypes: !851, nameTableKind: None)
!991 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!992 = distinct !DICompileUnit(language: DW_LANG_C99, file: !993, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !293, nameTableKind: None)
!993 = !DIFile(filename: "lib/freadahead.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!994 = distinct !DICompileUnit(language: DW_LANG_C99, file: !995, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !293, retainedTypes: !851, nameTableKind: None)
!995 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!996 = distinct !DICompileUnit(language: DW_LANG_C99, file: !997, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !293, retainedTypes: !924, nameTableKind: None)
!997 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!998 = distinct !DICompileUnit(language: DW_LANG_C99, file: !999, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !293, nameTableKind: None)
!999 = !DIFile(filename: "lib/acl-internal.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1000 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1001, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !293, retainedTypes: !851, nameTableKind: None)
!1001 = !DIFile(filename: "lib/get-permissions.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
