source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.F_triple = type { i8*, i64, i64 }
%struct.Src_to_dest = type { i64, i64, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__acl_entry_ext = type opaque
%struct.__acl_ext = type opaque
%struct.__dirstream = type opaque
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.cp_options = type { i32, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i32, i32, %struct.hash_table*, %struct.hash_table* }
%struct.dir_list = type { %struct.dir_list*, i64, i64 }
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%struct.direntry_t = type { i8*, i64 }
%struct.error_context = type { void (%struct.error_context*, i8*, ...)*, i8* (%struct.error_context*, i8*)*, void (%struct.error_context*, i8*)* }
%struct.extent_info = type { i64, i64, i32 }
%struct.extent_scan = type { i32, i64, i32, i64, i8, i8, %struct.extent_info* }
%struct.fiemap = type { i64, i64, i32, i32, i32, i32, [0 x %struct.fiemap_extent] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "owner_name", scope: !2, file: !3, line: 74, type: !88, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !82, globals: !144)
!3 = !DIFile(filename: "src/install.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!4 = !{!5, !13, !20, !26, !32, !37, !51, !59}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "backup_type", file: !6, line: 28, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/backupfile.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "no_backups", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "simple_backups", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "numbered_existing_backups", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "numbered_backups", value: 3, isUnsigned: true)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Dereference_symlink", file: !14, line: 69, baseType: !7, size: 32, elements: !15)
!14 = !DIFile(filename: "src/copy.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!15 = !{!16, !17, !18, !19}
!16 = !DIEnumerator(name: "DEREF_UNDEFINED", value: 1, isUnsigned: true)
!17 = !DIEnumerator(name: "DEREF_NEVER", value: 2, isUnsigned: true)
!18 = !DIEnumerator(name: "DEREF_COMMAND_LINE_ARGUMENTS", value: 3, isUnsigned: true)
!19 = !DIEnumerator(name: "DEREF_ALWAYS", value: 4, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Interactive", file: !14, line: 60, baseType: !7, size: 32, elements: !21)
!21 = !{!22, !23, !24, !25}
!22 = !DIEnumerator(name: "I_ALWAYS_YES", value: 1, isUnsigned: true)
!23 = !DIEnumerator(name: "I_ALWAYS_NO", value: 2, isUnsigned: true)
!24 = !DIEnumerator(name: "I_ASK_USER", value: 3, isUnsigned: true)
!25 = !DIEnumerator(name: "I_UNSPECIFIED", value: 4, isUnsigned: true)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Sparse_type", file: !14, line: 26, baseType: !7, size: 32, elements: !27)
!27 = !{!28, !29, !30, !31}
!28 = !DIEnumerator(name: "SPARSE_UNUSED", value: 0, isUnsigned: true)
!29 = !DIEnumerator(name: "SPARSE_NEVER", value: 1, isUnsigned: true)
!30 = !DIEnumerator(name: "SPARSE_AUTO", value: 2, isUnsigned: true)
!31 = !DIEnumerator(name: "SPARSE_ALWAYS", value: 3, isUnsigned: true)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Reflink_type", file: !14, line: 47, baseType: !7, size: 32, elements: !33)
!33 = !{!34, !35, !36}
!34 = !DIEnumerator(name: "REFLINK_NEVER", value: 0, isUnsigned: true)
!35 = !DIEnumerator(name: "REFLINK_AUTO", value: 1, isUnsigned: true)
!36 = !DIEnumerator(name: "REFLINK_ALWAYS", value: 2, isUnsigned: true)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !38, line: 32, baseType: !7, size: 32, elements: !39)
!38 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!39 = !{!40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50}
!40 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!41 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!42 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!43 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!44 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!45 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!46 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!47 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!48 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!49 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!50 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !52, line: 26, baseType: !7, size: 32, elements: !53)
!52 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!53 = !{!54, !55, !56, !57, !58}
!54 = !DIEnumerator(name: "LONGINT_OK", value: 0, isUnsigned: true)
!55 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1, isUnsigned: true)
!56 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2, isUnsigned: true)
!57 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3, isUnsigned: true)
!58 = !DIEnumerator(name: "LONGINT_INVALID", value: 4, isUnsigned: true)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !61, file: !60, line: 39, baseType: !7, size: 32, elements: !75)
!60 = !DIFile(filename: "./lib/savewd.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savewd", file: !60, line: 36, size: 64, elements: !62)
!62 = !{!63, !64}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !61, file: !60, line: 66, baseType: !59, size: 32)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !61, file: !60, line: 74, baseType: !65, size: 32, offset: 32)
!65 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !61, file: !60, line: 69, size: 32, elements: !66)
!66 = !{!67, !69, !70}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !65, file: !60, line: 71, baseType: !68, size: 32)
!68 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "errnum", scope: !65, file: !60, line: 72, baseType: !68, size: 32)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !65, file: !60, line: 73, baseType: !71, size: 32)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !72, line: 97, baseType: !73)
!72 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !74, line: 152, baseType: !68)
!74 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!75 = !{!76, !77, !78, !79, !80, !81}
!76 = !DIEnumerator(name: "INITIAL_STATE", value: 0, isUnsigned: true)
!77 = !DIEnumerator(name: "FD_STATE", value: 1, isUnsigned: true)
!78 = !DIEnumerator(name: "FD_POST_CHDIR_STATE", value: 2, isUnsigned: true)
!79 = !DIEnumerator(name: "FORKING_STATE", value: 3, isUnsigned: true)
!80 = !DIEnumerator(name: "ERROR_STATE", value: 4, isUnsigned: true)
!81 = !DIEnumerator(name: "FINAL_STATE", value: 5, isUnsigned: true)
!82 = !{!83, !88, !90, !91, !93, !95}
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !84, line: 72, baseType: !85)
!84 = !DIFile(filename: "/usr/include/signal.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DISubroutineType(types: !87)
!87 = !{null, !68}
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !72, line: 79, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !74, line: 144, baseType: !7)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !72, line: 64, baseType: !94)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !74, line: 145, baseType: !7)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cp_options", file: !14, line: 98, size: 640, elements: !97)
!97 = !{!98, !99, !100, !101, !102, !105, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !143}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "backup_type", scope: !96, file: !14, line: 100, baseType: !5, size: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "dereference", scope: !96, file: !14, line: 103, baseType: !13, size: 32, offset: 32)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !96, file: !14, line: 108, baseType: !20, size: 32, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_mode", scope: !96, file: !14, line: 111, baseType: !26, size: 32, offset: 96)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !96, file: !14, line: 115, baseType: !103, size: 32, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !72, line: 69, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !74, line: 148, baseType: !7)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "copy_as_regular", scope: !96, file: !14, line: 119, baseType: !106, size: 8, offset: 160)
!106 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_before_opening", scope: !96, file: !14, line: 123, baseType: !106, size: 8, offset: 168)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_after_failed_open", scope: !96, file: !14, line: 130, baseType: !106, size: 8, offset: 176)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "hard_link", scope: !96, file: !14, line: 134, baseType: !106, size: 8, offset: 184)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "move_mode", scope: !96, file: !14, line: 138, baseType: !106, size: 8, offset: 192)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "install_mode", scope: !96, file: !14, line: 141, baseType: !106, size: 8, offset: 200)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "chown_privileges", scope: !96, file: !14, line: 145, baseType: !106, size: 8, offset: 208)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "owner_privileges", scope: !96, file: !14, line: 152, baseType: !106, size: 8, offset: 216)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "one_file_system", scope: !96, file: !14, line: 156, baseType: !106, size: 8, offset: 224)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_ownership", scope: !96, file: !14, line: 160, baseType: !106, size: 8, offset: 232)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_mode", scope: !96, file: !14, line: 161, baseType: !106, size: 8, offset: 240)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_timestamps", scope: !96, file: !14, line: 162, baseType: !106, size: 8, offset: 248)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "explicit_no_preserve_mode", scope: !96, file: !14, line: 163, baseType: !106, size: 8, offset: 256)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "set_security_context", scope: !96, file: !14, line: 166, baseType: !106, size: 8, offset: 264)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_links", scope: !96, file: !14, line: 178, baseType: !106, size: 8, offset: 272)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "data_copy_required", scope: !96, file: !14, line: 182, baseType: !106, size: 8, offset: 280)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve", scope: !96, file: !14, line: 188, baseType: !106, size: 8, offset: 288)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_security_context", scope: !96, file: !14, line: 192, baseType: !106, size: 8, offset: 296)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_context", scope: !96, file: !14, line: 201, baseType: !106, size: 8, offset: 304)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_xattr", scope: !96, file: !14, line: 205, baseType: !106, size: 8, offset: 312)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_xattr", scope: !96, file: !14, line: 214, baseType: !106, size: 8, offset: 320)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "reduce_diagnostics", scope: !96, file: !14, line: 223, baseType: !106, size: 8, offset: 328)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !96, file: !14, line: 227, baseType: !106, size: 8, offset: 336)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "set_mode", scope: !96, file: !14, line: 231, baseType: !106, size: 8, offset: 344)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "symbolic_link", scope: !96, file: !14, line: 235, baseType: !106, size: 8, offset: 352)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !96, file: !14, line: 239, baseType: !106, size: 8, offset: 360)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !96, file: !14, line: 242, baseType: !106, size: 8, offset: 368)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_tty", scope: !96, file: !14, line: 245, baseType: !106, size: 8, offset: 376)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "open_dangling_dest_symlink", scope: !96, file: !14, line: 250, baseType: !106, size: 8, offset: 384)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "last_file", scope: !96, file: !14, line: 254, baseType: !106, size: 8, offset: 392)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "rename_errno", scope: !96, file: !14, line: 259, baseType: !68, size: 32, offset: 416)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "reflink_mode", scope: !96, file: !14, line: 262, baseType: !32, size: 32, offset: 448)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "dest_info", scope: !96, file: !14, line: 273, baseType: !139, size: 64, offset: 512)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !141, line: 69, baseType: !142)
!141 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !141, line: 67, flags: DIFlagFwdDecl)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "src_info", scope: !96, file: !14, line: 276, baseType: !139, size: 64, offset: 576)
!144 = !{!0, !145, !147, !149, !151, !153, !155, !171, !173, !175, !177, !179, !181, !183, !185, !200, !202}
!145 = !DIGlobalVariableExpression(var: !146, expr: !DIExpression())
!146 = distinct !DIGlobalVariable(name: "group_name", scope: !2, file: !3, line: 81, type: !88, isLocal: true, isDefinition: true)
!147 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression())
!148 = distinct !DIGlobalVariable(name: "copy_only_if_needed", scope: !2, file: !3, line: 102, type: !106, isLocal: true, isDefinition: true)
!149 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression())
!150 = distinct !DIGlobalVariable(name: "strip_files", scope: !2, file: !3, line: 105, type: !106, isLocal: true, isDefinition: true)
!151 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression())
!152 = distinct !DIGlobalVariable(name: "dir_arg", scope: !2, file: !3, line: 108, type: !106, isLocal: true, isDefinition: true)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "selinux_enabled", scope: !2, file: !3, line: 53, type: !68, isLocal: true, isDefinition: true)
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 121, type: !157, isLocal: true, isDefinition: true)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 4608, elements: !169)
!158 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !159)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !160, line: 50, size: 256, elements: !161)
!160 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!161 = !{!162, !165, !166, !168}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !159, file: !160, line: 52, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !89)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !159, file: !160, line: 55, baseType: !68, size: 32, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !159, file: !160, line: 56, baseType: !167, size: 64, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !159, file: !160, line: 57, baseType: !68, size: 32, offset: 192)
!169 = !{!170}
!170 = !DISubrange(count: 18)
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(name: "strip_program", scope: !2, file: !3, line: 111, type: !163, isLocal: true, isDefinition: true)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(name: "use_default_selinux_context", scope: !2, file: !3, line: 54, type: !106, isLocal: true, isDefinition: true)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "mode", scope: !2, file: !3, line: 90, type: !103, isLocal: true, isDefinition: true)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "dir_mode_bits", scope: !2, file: !3, line: 99, type: !103, isLocal: true, isDefinition: true)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(name: "dir_mode", scope: !2, file: !3, line: 93, type: !103, isLocal: true, isDefinition: true)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "owner_id", scope: !2, file: !3, line: 77, type: !91, isLocal: true, isDefinition: true)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(name: "group_id", scope: !2, file: !3, line: 84, type: !93, isLocal: true, isDefinition: true)
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "a_buff", scope: !187, file: !3, line: 149, type: !197, isLocal: true, isDefinition: true)
!187 = distinct !DISubprogram(name: "have_same_content", scope: !3, file: !3, line: 146, type: !188, isLocal: true, isDefinition: true, scopeLine: 147, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !190)
!188 = !DISubroutineType(types: !189)
!189 = !{!106, !68, !68}
!190 = !{!191, !192, !193}
!191 = !DILocalVariable(name: "a_fd", arg: 1, scope: !187, file: !3, line: 146, type: !68)
!192 = !DILocalVariable(name: "b_fd", arg: 2, scope: !187, file: !3, line: 146, type: !68)
!193 = !DILocalVariable(name: "size", scope: !187, file: !3, line: 152, type: !194)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !195, line: 62, baseType: !196)
!195 = !DIFile(filename: "/usr/lib/clang/7.0.0/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!196 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 32768, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 4096)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(name: "b_buff", scope: !187, file: !3, line: 150, type: !197, isLocal: true, isDefinition: true)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(name: "first_call", scope: !204, file: !3, line: 318, type: !106, isLocal: true, isDefinition: true)
!204 = distinct !DISubprogram(name: "setdefaultfilecon", scope: !3, file: !3, line: 314, type: !205, isLocal: true, isDefinition: true, scopeLine: 315, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !207)
!205 = !DISubroutineType(types: !206)
!206 = !{null, !163}
!207 = !{!208, !209, !245, !246, !249, !250}
!208 = !DILocalVariable(name: "file", arg: 1, scope: !204, file: !3, line: 314, type: !163)
!209 = !DILocalVariable(name: "st", scope: !204, file: !3, line: 316, type: !210)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !211, line: 46, size: 1152, elements: !212)
!211 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!212 = !{!213, !215, !217, !219, !220, !221, !222, !223, !224, !227, !229, !231, !239, !240, !241}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !210, file: !211, line: 48, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !74, line: 143, baseType: !196)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !210, file: !211, line: 53, baseType: !216, size: 64, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !74, line: 146, baseType: !196)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !210, file: !211, line: 61, baseType: !218, size: 64, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !74, line: 149, baseType: !196)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !210, file: !211, line: 62, baseType: !104, size: 32, offset: 192)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !210, file: !211, line: 64, baseType: !92, size: 32, offset: 224)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !210, file: !211, line: 65, baseType: !94, size: 32, offset: 256)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !210, file: !211, line: 67, baseType: !68, size: 32, offset: 288)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !210, file: !211, line: 69, baseType: !214, size: 64, offset: 320)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !210, file: !211, line: 74, baseType: !225, size: 64, offset: 384)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !74, line: 150, baseType: !226)
!226 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !210, file: !211, line: 78, baseType: !228, size: 64, offset: 448)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !74, line: 172, baseType: !226)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !210, file: !211, line: 80, baseType: !230, size: 64, offset: 512)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !74, line: 177, baseType: !226)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !210, file: !211, line: 91, baseType: !232, size: 128, offset: 576)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !233, line: 9, size: 128, elements: !234)
!233 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!234 = !{!235, !237}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !232, file: !233, line: 11, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !74, line: 158, baseType: !226)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !232, file: !233, line: 12, baseType: !238, size: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !74, line: 194, baseType: !226)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !210, file: !211, line: 92, baseType: !232, size: 128, offset: 704)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !210, file: !211, line: 93, baseType: !232, size: 128, offset: 832)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !210, file: !211, line: 106, baseType: !242, size: 192, offset: 960)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !238, size: 192, elements: !243)
!243 = !{!244}
!244 = !DISubrange(count: 3)
!245 = !DILocalVariable(name: "scontext", scope: !204, file: !3, line: 317, type: !88)
!246 = !DILocalVariable(name: "p0", scope: !247, file: !3, line: 337, type: !163)
!247 = distinct !DILexicalBlock(scope: !248, file: !3, line: 329, column: 5)
!248 = distinct !DILexicalBlock(scope: !204, file: !3, line: 328, column: 7)
!249 = !DILocalVariable(name: "p", scope: !247, file: !3, line: 338, type: !163)
!250 = !DILocalVariable(name: "prefix", scope: !251, file: !3, line: 347, type: !88)
!251 = distinct !DILexicalBlock(scope: !252, file: !3, line: 346, column: 9)
!252 = distinct !DILexicalBlock(scope: !247, file: !3, line: 345, column: 11)
!253 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!254 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!255 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(name: "top_level_src_name", scope: !258, file: !259, line: 147, type: !163, isLocal: true, isDefinition: true)
!258 = distinct !DICompileUnit(language: DW_LANG_C99, file: !259, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !260, retainedTypes: !285, globals: !289)
!259 = !DIFile(filename: "src/copy.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!260 = !{!5, !13, !20, !26, !32, !37, !261, !265, !272, !281}
!261 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !262, line: 27, baseType: !7, size: 32, elements: !263)
!262 = !DIFile(filename: "./lib/utimecmp.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!263 = !{!264}
!264 = !DIEnumerator(name: "UTIMECMP_TRUNCATE_SOURCE", value: 1, isUnsigned: true)
!265 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "savedir_option", file: !266, line: 26, baseType: !7, size: 32, elements: !267)
!266 = !DIFile(filename: "./lib/savedir.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!267 = !{!268, !269, !270, !271}
!268 = !DIEnumerator(name: "SAVEDIR_SORT_NONE", value: 0, isUnsigned: true)
!269 = !DIEnumerator(name: "SAVEDIR_SORT_NAME", value: 1, isUnsigned: true)
!270 = !DIEnumerator(name: "SAVEDIR_SORT_INODE", value: 2, isUnsigned: true)
!271 = !DIEnumerator(name: "SAVEDIR_SORT_FASTREAD", value: 2, isUnsigned: true)
!272 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !273, line: 45, baseType: !7, size: 32, elements: !274)
!273 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!274 = !{!275, !276, !277, !278, !279, !280}
!275 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0, isUnsigned: true)
!276 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2, isUnsigned: true)
!277 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5, isUnsigned: true)
!278 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4, isUnsigned: true)
!279 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3, isUnsigned: true)
!280 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1, isUnsigned: true)
!281 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !282, line: 73, baseType: !7, size: 32, elements: !283)
!282 = !DIFile(filename: "src/ioblksize.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!283 = !{!284}
!284 = !DIEnumerator(name: "IO_BUFSIZE", value: 131072, isUnsigned: true)
!285 = !{!103, !90, !7, !88, !196, !286, !194, !287}
!286 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !288, line: 63, baseType: !225)
!288 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!289 = !{!290, !256, !296, !298, !308, !310}
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "mask", scope: !292, file: !259, line: 3050, type: !103, isLocal: true, isDefinition: true)
!292 = distinct !DISubprogram(name: "cached_umask", scope: !259, file: !259, line: 3048, type: !293, isDefinition: true, scopeLine: 3049, flags: DIFlagPrototyped, isOptimized: true, unit: !258, retainedNodes: !295)
!293 = !DISubroutineType(types: !294)
!294 = !{!103}
!295 = !{}
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "top_level_dst_name", scope: !258, file: !259, line: 148, type: !163, isLocal: true, isDefinition: true)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "zeros", scope: !300, file: !259, line: 351, type: !88, isLocal: true, isDefinition: true)
!300 = distinct !DISubprogram(name: "write_zeros", scope: !259, file: !259, line: 349, type: !301, isLocal: true, isDefinition: true, scopeLine: 350, flags: DIFlagPrototyped, isOptimized: true, unit: !258, retainedNodes: !303)
!301 = !DISubroutineType(types: !302)
!302 = !{!106, !68, !287}
!303 = !{!304, !305, !306}
!304 = !DILocalVariable(name: "fd", arg: 1, scope: !300, file: !259, line: 349, type: !68)
!305 = !DILocalVariable(name: "n_bytes", arg: 2, scope: !300, file: !259, line: 349, type: !287)
!306 = !DILocalVariable(name: "n", scope: !307, file: !259, line: 370, type: !194)
!307 = distinct !DILexicalBlock(scope: !300, file: !259, line: 369, column: 5)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(name: "nz", scope: !300, file: !259, line: 352, type: !194, isLocal: true, isDefinition: true)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(name: "fallback", scope: !300, file: !259, line: 359, type: !312, isLocal: true, isDefinition: true)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 8192, elements: !313)
!313 = !{!314}
!314 = !DISubrange(count: 1024)
!315 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 18446744073709421568, DW_OP_mul, DW_OP_constu, 131072, DW_OP_plus, DW_OP_stack_value))
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "src_to_dest", scope: !318, file: !319, line: 45, type: !139, isLocal: true, isDefinition: true)
!318 = distinct !DICompileUnit(language: DW_LANG_C99, file: !319, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !295, retainedTypes: !320, globals: !324)
!319 = !DIFile(filename: "src/cp-hash.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!320 = !{!90, !88, !321}
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !322, line: 102, baseType: !323)
!322 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !74, line: 72, baseType: !196)
!324 = !{!316}
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "simple_pattern", scope: !327, file: !328, line: 38, type: !337, isLocal: true, isDefinition: true)
!327 = distinct !DICompileUnit(language: DW_LANG_C99, file: !328, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !329, globals: !336)
!328 = !DIFile(filename: "src/force-link.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!329 = !{!330, !333}
!330 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !328, line: 39, baseType: !7, size: 32, elements: !331)
!331 = !{!332}
!332 = !DIEnumerator(name: "x_suffix_len", value: 6, isUnsigned: true)
!333 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !328, line: 44, baseType: !7, size: 32, elements: !334)
!334 = !{!335}
!335 = !DIEnumerator(name: "smallsize", value: 256, isUnsigned: true)
!336 = !{!325}
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 72, elements: !338)
!338 = !{!339}
!339 = !DISubrange(count: 9)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(name: "Version", scope: !342, file: !343, line: 2, type: !163, isDefinition: true)
!342 = distinct !DICompileUnit(language: DW_LANG_C99, file: !343, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !295, globals: !344)
!343 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!344 = !{!340}
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(name: "simple_backup_suffix", scope: !347, file: !351, line: 79, type: !163, isDefinition: true)
!347 = distinct !DICompileUnit(language: DW_LANG_C99, file: !348, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !349, retainedTypes: !409, globals: !410)
!348 = !DIFile(filename: "./lib/backupfile.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!349 = !{!5, !350, !379, !385}
!350 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !352, file: !351, line: 304, baseType: !7, size: 32, elements: !377)
!351 = !DIFile(filename: "lib/backupfile.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!352 = distinct !DISubprogram(name: "backupfile_internal", scope: !351, file: !351, line: 292, type: !353, isDefinition: true, scopeLine: 293, flags: DIFlagPrototyped, isOptimized: true, unit: !347, retainedNodes: !355)
!353 = !DISubroutineType(types: !354)
!354 = !{!88, !163, !5, !106}
!355 = !{!356, !357, !358, !359, !361, !362, !363, !364, !367, !368, !373, !375, !376}
!356 = !DILocalVariable(name: "file", arg: 1, scope: !352, file: !351, line: 292, type: !163)
!357 = !DILocalVariable(name: "backup_type", arg: 2, scope: !352, file: !351, line: 292, type: !5)
!358 = !DILocalVariable(name: "rename", arg: 3, scope: !352, file: !351, line: 292, type: !106)
!359 = !DILocalVariable(name: "base_offset", scope: !352, file: !351, line: 294, type: !360)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !195, line: 51, baseType: !226)
!361 = !DILocalVariable(name: "filelen", scope: !352, file: !351, line: 295, type: !194)
!362 = !DILocalVariable(name: "simple_backup_suffix_size", scope: !352, file: !351, line: 302, type: !194)
!363 = !DILocalVariable(name: "backup_suffix_size_guess", scope: !352, file: !351, line: 303, type: !194)
!364 = !DILocalVariable(name: "ssize", scope: !352, file: !351, line: 308, type: !365)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !72, line: 108, baseType: !366)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !74, line: 191, baseType: !226)
!367 = !DILocalVariable(name: "s", scope: !352, file: !351, line: 309, type: !88)
!368 = !DILocalVariable(name: "dirp", scope: !352, file: !351, line: 313, type: !369)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !371, line: 127, baseType: !372)
!371 = !DIFile(filename: "/usr/include/dirent.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !371, line: 127, flags: DIFlagFwdDecl)
!373 = !DILocalVariable(name: "sdir", scope: !374, file: !351, line: 349, type: !68)
!374 = distinct !DILexicalBlock(scope: !352, file: !351, line: 315, column: 5)
!375 = !DILocalVariable(name: "flags", scope: !374, file: !351, line: 355, type: !7)
!376 = !DILocalVariable(name: "e", scope: !374, file: !351, line: 358, type: !68)
!377 = !{!378}
!378 = !DIEnumerator(name: "GUESS", value: 9, isUnsigned: true)
!379 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "numbered_backup_result", file: !351, line: 152, baseType: !7, size: 32, elements: !380)
!380 = !{!381, !382, !383, !384}
!381 = !DIEnumerator(name: "BACKUP_IS_SAME_LENGTH", value: 0, isUnsigned: true)
!382 = !DIEnumerator(name: "BACKUP_IS_LONGER", value: 1, isUnsigned: true)
!383 = !DIEnumerator(name: "BACKUP_IS_NEW", value: 2, isUnsigned: true)
!384 = !DIEnumerator(name: "BACKUP_NOMEM", value: 3, isUnsigned: true)
!385 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !386, line: 24, baseType: !7, size: 32, elements: !387)
!386 = !DIFile(filename: "/usr/include/bits/confname.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!387 = !{!388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408}
!388 = !DIEnumerator(name: "_PC_LINK_MAX", value: 0, isUnsigned: true)
!389 = !DIEnumerator(name: "_PC_MAX_CANON", value: 1, isUnsigned: true)
!390 = !DIEnumerator(name: "_PC_MAX_INPUT", value: 2, isUnsigned: true)
!391 = !DIEnumerator(name: "_PC_NAME_MAX", value: 3, isUnsigned: true)
!392 = !DIEnumerator(name: "_PC_PATH_MAX", value: 4, isUnsigned: true)
!393 = !DIEnumerator(name: "_PC_PIPE_BUF", value: 5, isUnsigned: true)
!394 = !DIEnumerator(name: "_PC_CHOWN_RESTRICTED", value: 6, isUnsigned: true)
!395 = !DIEnumerator(name: "_PC_NO_TRUNC", value: 7, isUnsigned: true)
!396 = !DIEnumerator(name: "_PC_VDISABLE", value: 8, isUnsigned: true)
!397 = !DIEnumerator(name: "_PC_SYNC_IO", value: 9, isUnsigned: true)
!398 = !DIEnumerator(name: "_PC_ASYNC_IO", value: 10, isUnsigned: true)
!399 = !DIEnumerator(name: "_PC_PRIO_IO", value: 11, isUnsigned: true)
!400 = !DIEnumerator(name: "_PC_SOCK_MAXBUF", value: 12, isUnsigned: true)
!401 = !DIEnumerator(name: "_PC_FILESIZEBITS", value: 13, isUnsigned: true)
!402 = !DIEnumerator(name: "_PC_REC_INCR_XFER_SIZE", value: 14, isUnsigned: true)
!403 = !DIEnumerator(name: "_PC_REC_MAX_XFER_SIZE", value: 15, isUnsigned: true)
!404 = !DIEnumerator(name: "_PC_REC_MIN_XFER_SIZE", value: 16, isUnsigned: true)
!405 = !DIEnumerator(name: "_PC_REC_XFER_ALIGN", value: 17, isUnsigned: true)
!406 = !DIEnumerator(name: "_PC_ALLOC_SIZE_MIN", value: 18, isUnsigned: true)
!407 = !DIEnumerator(name: "_PC_SYMLINK_MAX", value: 19, isUnsigned: true)
!408 = !DIEnumerator(name: "_PC_2_SYMLINKS", value: 20, isUnsigned: true)
!409 = !{!90, !7, !194}
!410 = !{!345}
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(name: "backup_args", scope: !413, file: !420, line: 40, type: !425, isLocal: true, isDefinition: true)
!413 = distinct !DICompileUnit(language: DW_LANG_C99, file: !414, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !415, retainedTypes: !416, globals: !417)
!414 = !DIFile(filename: "./lib/backup-find.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!415 = !{!5}
!416 = !{!163}
!417 = !{!418, !411}
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(name: "backup_types", scope: !413, file: !420, line: 51, type: !421, isLocal: true, isDefinition: true)
!420 = !DIFile(filename: "lib/backup-find.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !422, size: 256, elements: !423)
!422 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!423 = !{!424}
!424 = !DISubrange(count: 8)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !426, size: 576, elements: !338)
!426 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !163)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(name: "file_name", scope: !429, file: !432, line: 37, type: !163, isLocal: true, isDefinition: true)
!429 = distinct !DICompileUnit(language: DW_LANG_C99, file: !430, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !295, globals: !431)
!430 = !DIFile(filename: "./lib/closein.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!431 = !{!427}
!432 = !DIFile(filename: "lib/closein.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(name: "file_name", scope: !435, file: !440, line: 46, type: !163, isLocal: true, isDefinition: true)
!435 = distinct !DICompileUnit(language: DW_LANG_C99, file: !436, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !295, globals: !437)
!436 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!437 = !{!433, !438}
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !435, file: !440, line: 56, type: !106, isLocal: true, isDefinition: true)
!440 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(name: "exit_failure", scope: !443, file: !446, line: 24, type: !447, isDefinition: true)
!443 = distinct !DICompileUnit(language: DW_LANG_C99, file: !444, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !295, globals: !445)
!444 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!445 = !{!441}
!446 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!447 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !68)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "default_tuning", scope: !450, file: !454, line: 130, type: !455, isLocal: true, isDefinition: true)
!450 = distinct !DICompileUnit(language: DW_LANG_C99, file: !451, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !295, retainedTypes: !452, globals: !453)
!451 = !DIFile(filename: "./lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!452 = !{!196, !90, !194}
!453 = !{!448}
!454 = !DIFile(filename: "lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!455 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !456)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !141, line: 65, baseType: !457)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !141, line: 53, size: 160, elements: !458)
!458 = !{!459, !461, !462, !463, !464}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !457, file: !141, line: 58, baseType: !460, size: 32)
!460 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !457, file: !141, line: 59, baseType: !460, size: 32, offset: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !457, file: !141, line: 60, baseType: !460, size: 32, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !457, file: !141, line: 61, baseType: !460, size: 32, offset: 96)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !457, file: !141, line: 62, baseType: !106, size: 8, offset: 128)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(name: "program_name", scope: !467, file: !471, line: 33, type: !163, isDefinition: true)
!467 = distinct !DICompileUnit(language: DW_LANG_C99, file: !468, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !295, retainedTypes: !469, globals: !470)
!468 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!469 = !{!90, !88}
!470 = !{!465}
!471 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !474, file: !502, line: 85, type: !535, isDefinition: true)
!474 = distinct !DICompileUnit(language: DW_LANG_C99, file: !475, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !476, retainedTypes: !497, globals: !499)
!475 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!476 = !{!37, !477, !482}
!477 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !38, line: 242, baseType: !7, size: 32, elements: !478)
!478 = !{!479, !480, !481}
!479 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!480 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!481 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!482 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !483, line: 46, baseType: !7, size: 32, elements: !484)
!483 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!484 = !{!485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496}
!485 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!486 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!487 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!488 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!489 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!490 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!491 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!492 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!493 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!494 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!495 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!496 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!497 = !{!68, !498, !194, !88}
!498 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!499 = !{!472, !500, !507, !517, !519, !524, !531, !533}
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !474, file: !502, line: 101, type: !503, isDefinition: true)
!502 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !504, size: 320, elements: !505)
!504 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!505 = !{!506}
!506 = !DISubrange(count: 10)
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !474, file: !502, line: 1052, type: !509, isDefinition: true)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !502, line: 65, size: 448, elements: !510)
!510 = !{!511, !512, !513, !515, !516}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !509, file: !502, line: 68, baseType: !37, size: 32)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !509, file: !502, line: 71, baseType: !68, size: 32, offset: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !509, file: !502, line: 75, baseType: !514, size: 256, offset: 64)
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !423)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !509, file: !502, line: 78, baseType: !163, size: 64, offset: 320)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !509, file: !502, line: 81, baseType: !163, size: 64, offset: 384)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !474, file: !502, line: 116, type: !509, isLocal: true, isDefinition: true)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(name: "slot0", scope: !474, file: !502, line: 842, type: !521, isLocal: true, isDefinition: true)
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 2048, elements: !522)
!522 = !{!523}
!523 = !DISubrange(count: 256)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(name: "slotvec", scope: !474, file: !502, line: 845, type: !526, isLocal: true, isDefinition: true)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !502, line: 834, size: 128, elements: !528)
!528 = !{!529, !530}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !527, file: !502, line: 836, baseType: !194, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !527, file: !502, line: 837, baseType: !88, size: 64, offset: 64)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(name: "nslots", scope: !474, file: !502, line: 843, type: !68, isLocal: true, isDefinition: true)
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(name: "slotvec0", scope: !474, file: !502, line: 844, type: !527, isLocal: true, isDefinition: true)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !426, size: 704, elements: !536)
!536 = !{!537}
!537 = !DISubrange(count: 11)
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(name: "comparison_function_table", scope: !540, file: !558, line: 74, type: !559, isLocal: true, isDefinition: true)
!540 = distinct !DICompileUnit(language: DW_LANG_C99, file: !541, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !542, retainedTypes: !556, globals: !557)
!541 = !DIFile(filename: "./lib/savedir.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!542 = !{!265, !543}
!543 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !545, file: !544, line: 186, baseType: !7, size: 32, elements: !554)
!544 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!545 = distinct !DISubprogram(name: "x2nrealloc", scope: !544, file: !544, line: 174, type: !546, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: true, unit: !540, retainedNodes: !549)
!546 = !DISubroutineType(types: !547)
!547 = !{!90, !90, !548, !194}
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!549 = !{!550, !551, !552, !553}
!550 = !DILocalVariable(name: "p", arg: 1, scope: !545, file: !544, line: 174, type: !90)
!551 = !DILocalVariable(name: "pn", arg: 2, scope: !545, file: !544, line: 174, type: !548)
!552 = !DILocalVariable(name: "s", arg: 3, scope: !545, file: !544, line: 174, type: !194)
!553 = !DILocalVariable(name: "n", scope: !545, file: !544, line: 176, type: !194)
!554 = !{!555}
!555 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!556 = !{!90, !194}
!557 = !{!538}
!558 = !DIFile(filename: "lib/savedir.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !560, size: 192, elements: !243)
!560 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !561)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "comparison_function", file: !558, line: 72, baseType: !562)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{!68, !565, !565}
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(name: "letters", scope: !569, file: !572, line: 184, type: !573, isLocal: true, isDefinition: true)
!569 = distinct !DICompileUnit(language: DW_LANG_C99, file: !570, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !295, globals: !571)
!570 = !DIFile(filename: "./lib/tempname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!571 = !{!567}
!572 = !DIFile(filename: "lib/tempname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 504, elements: !574)
!574 = !{!575}
!575 = !DISubrange(count: 63)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(name: "ht", scope: !578, file: !579, line: 163, type: !139, isLocal: true, isDefinition: true)
!578 = distinct !DISubprogram(name: "utimecmpat", scope: !579, file: !579, line: 132, type: !580, isDefinition: true, scopeLine: 136, flags: DIFlagPrototyped, isOptimized: true, unit: !605, retainedNodes: !621)
!579 = !DIFile(filename: "lib/utimecmp.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!580 = !DISubroutineType(types: !581)
!581 = !{!68, !68, !163, !582, !582, !68}
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !584)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !211, line: 46, size: 1152, elements: !585)
!585 = !{!586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !602, !603, !604}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !584, file: !211, line: 48, baseType: !214, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !584, file: !211, line: 53, baseType: !216, size: 64, offset: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !584, file: !211, line: 61, baseType: !218, size: 64, offset: 128)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !584, file: !211, line: 62, baseType: !104, size: 32, offset: 192)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !584, file: !211, line: 64, baseType: !92, size: 32, offset: 224)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !584, file: !211, line: 65, baseType: !94, size: 32, offset: 256)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !584, file: !211, line: 67, baseType: !68, size: 32, offset: 288)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !584, file: !211, line: 69, baseType: !214, size: 64, offset: 320)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !584, file: !211, line: 74, baseType: !225, size: 64, offset: 384)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !584, file: !211, line: 78, baseType: !228, size: 64, offset: 448)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !584, file: !211, line: 80, baseType: !230, size: 64, offset: 512)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !584, file: !211, line: 91, baseType: !598, size: 128, offset: 576)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !233, line: 9, size: 128, elements: !599)
!599 = !{!600, !601}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !598, file: !233, line: 11, baseType: !236, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !598, file: !233, line: 12, baseType: !238, size: 64, offset: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !584, file: !211, line: 92, baseType: !598, size: 128, offset: 704)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !584, file: !211, line: 93, baseType: !598, size: 128, offset: 832)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !584, file: !211, line: 106, baseType: !242, size: 192, offset: 960)
!605 = distinct !DICompileUnit(language: DW_LANG_C99, file: !606, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !607, globals: !611)
!606 = !DIFile(filename: "./lib/utimecmp.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!607 = !{!261, !608}
!608 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !579, line: 49, baseType: !7, size: 32, elements: !609)
!609 = !{!610}
!610 = !DIEnumerator(name: "SYSCALL_RESOLUTION", value: 1, isUnsigned: true)
!611 = !{!576, !612}
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(name: "new_dst_res", scope: !578, file: !579, line: 166, type: !614, isLocal: true, isDefinition: true)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fs_res", file: !579, line: 66, size: 128, elements: !616)
!616 = !{!617, !619, !620}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !615, file: !579, line: 69, baseType: !618, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !72, line: 59, baseType: !214)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "resolution", scope: !615, file: !579, line: 76, baseType: !68, size: 32, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "exact", scope: !615, file: !579, line: 80, baseType: !106, size: 8, offset: 96)
!621 = !{!622, !623, !624, !625, !626, !627, !630, !631, !632, !633, !636, !637, !638, !641, !642, !643, !644, !645, !646, !648, !651, !652, !653, !654, !660, !661, !663, !665, !667}
!622 = !DILocalVariable(name: "dfd", arg: 1, scope: !578, file: !579, line: 132, type: !68)
!623 = !DILocalVariable(name: "dst_name", arg: 2, scope: !578, file: !579, line: 132, type: !163)
!624 = !DILocalVariable(name: "dst_stat", arg: 3, scope: !578, file: !579, line: 133, type: !582)
!625 = !DILocalVariable(name: "src_stat", arg: 4, scope: !578, file: !579, line: 134, type: !582)
!626 = !DILocalVariable(name: "options", arg: 5, scope: !578, file: !579, line: 135, type: !68)
!627 = !DILocalVariable(name: "dst_s", scope: !578, file: !579, line: 153, type: !628)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !629, line: 7, baseType: !236)
!629 = !DIFile(filename: "/usr/include/bits/types/time_t.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!630 = !DILocalVariable(name: "src_s", scope: !578, file: !579, line: 154, type: !628)
!631 = !DILocalVariable(name: "dst_ns", scope: !578, file: !579, line: 155, type: !68)
!632 = !DILocalVariable(name: "src_ns", scope: !578, file: !579, line: 156, type: !68)
!633 = !DILocalVariable(name: "dst_res", scope: !634, file: !579, line: 167, type: !614)
!634 = distinct !DILexicalBlock(scope: !635, file: !579, line: 159, column: 5)
!635 = distinct !DILexicalBlock(scope: !578, file: !579, line: 158, column: 7)
!636 = !DILocalVariable(name: "tmp_dst_res", scope: !634, file: !579, line: 168, type: !615)
!637 = !DILocalVariable(name: "res", scope: !634, file: !579, line: 171, type: !68)
!638 = !DILocalVariable(name: "dst_a_s", scope: !639, file: !579, line: 262, type: !628)
!639 = distinct !DILexicalBlock(scope: !640, file: !579, line: 258, column: 9)
!640 = distinct !DILexicalBlock(scope: !634, file: !579, line: 257, column: 11)
!641 = !DILocalVariable(name: "dst_c_s", scope: !639, file: !579, line: 263, type: !628)
!642 = !DILocalVariable(name: "dst_m_s", scope: !639, file: !579, line: 264, type: !628)
!643 = !DILocalVariable(name: "dst_a_ns", scope: !639, file: !579, line: 265, type: !68)
!644 = !DILocalVariable(name: "dst_c_ns", scope: !639, file: !579, line: 266, type: !68)
!645 = !DILocalVariable(name: "dst_m_ns", scope: !639, file: !579, line: 267, type: !68)
!646 = !DILocalVariable(name: "odd_second", scope: !647, file: !579, line: 276, type: !106)
!647 = distinct !DILexicalBlock(scope: !639, file: !579, line: 275, column: 11)
!648 = !DILocalVariable(name: "a", scope: !649, file: !579, line: 285, type: !68)
!649 = distinct !DILexicalBlock(scope: !650, file: !579, line: 284, column: 15)
!650 = distinct !DILexicalBlock(scope: !647, file: !579, line: 278, column: 17)
!651 = !DILocalVariable(name: "c", scope: !649, file: !579, line: 286, type: !68)
!652 = !DILocalVariable(name: "m", scope: !649, file: !579, line: 287, type: !68)
!653 = !DILocalVariable(name: "SR10", scope: !649, file: !579, line: 291, type: !68)
!654 = !DILocalVariable(name: "timespec", scope: !655, file: !579, line: 313, type: !657)
!655 = distinct !DILexicalBlock(scope: !656, file: !579, line: 312, column: 13)
!656 = distinct !DILexicalBlock(scope: !639, file: !579, line: 311, column: 15)
!657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !598, size: 256, elements: !658)
!658 = !{!659}
!659 = !DISubrange(count: 2)
!660 = !DILocalVariable(name: "dst_status", scope: !655, file: !579, line: 314, type: !584)
!661 = !DILocalVariable(name: "s", scope: !662, file: !579, line: 324, type: !628)
!662 = distinct !DILexicalBlock(scope: !655, file: !579, line: 323, column: 15)
!663 = !DILocalVariable(name: "stat_result", scope: !664, file: !579, line: 348, type: !68)
!664 = distinct !DILexicalBlock(scope: !655, file: !579, line: 347, column: 15)
!665 = !DILocalVariable(name: "old_res", scope: !666, file: !579, line: 369, type: !68)
!666 = distinct !DILexicalBlock(scope: !655, file: !579, line: 368, column: 15)
!667 = !DILocalVariable(name: "a", scope: !666, file: !579, line: 370, type: !68)
!668 = !DIGlobalVariableExpression(var: !669, expr: !DIExpression())
!669 = distinct !DIGlobalVariable(name: "utimensat_works_really", scope: !670, file: !680, line: 75, type: !68, isLocal: true, isDefinition: true)
!670 = distinct !DICompileUnit(language: DW_LANG_C99, file: !671, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !672, globals: !677)
!671 = !DIFile(filename: "./lib/utimens.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!672 = !{!673}
!673 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !674, line: 41, baseType: !7, size: 32, elements: !675)
!674 = !DIFile(filename: "./lib/timespec.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!675 = !{!676}
!676 = !DIEnumerator(name: "TIMESPEC_RESOLUTION", value: 1000000000, isUnsigned: true)
!677 = !{!668, !678}
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(name: "lutimensat_works_really", scope: !670, file: !680, line: 76, type: !68, isLocal: true, isDefinition: true)
!680 = !DIFile(filename: "lib/utimens.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !683, file: !686, line: 26, type: !687, isDefinition: true)
!683 = distinct !DICompileUnit(language: DW_LANG_C99, file: !684, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !295, globals: !685)
!684 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!685 = !{!681}
!686 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 376, elements: !688)
!688 = !{!689}
!689 = !DISubrange(count: 47)
!690 = !DIGlobalVariableExpression(var: !691, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!691 = distinct !DIGlobalVariable(name: "initialized", scope: !692, file: !693, line: 34, type: !106, isLocal: true, isDefinition: true)
!692 = distinct !DISubprogram(name: "can_write_any_file", scope: !693, file: !693, line: 32, type: !694, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: true, unit: !696, retainedNodes: !702)
!693 = !DIFile(filename: "lib/write-any-file.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!694 = !DISubroutineType(types: !695)
!695 = !{!106}
!696 = distinct !DICompileUnit(language: DW_LANG_C99, file: !697, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !295, globals: !698)
!697 = !DIFile(filename: "./lib/write-any-file.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!698 = !{!699, !700}
!699 = !DIGlobalVariableExpression(var: !691, expr: !DIExpression())
!700 = !DIGlobalVariableExpression(var: !701, expr: !DIExpression())
!701 = distinct !DIGlobalVariable(name: "can_write", scope: !692, file: !693, line: 35, type: !106, isLocal: true, isDefinition: true)
!702 = !{!703}
!703 = !DILocalVariable(name: "can", scope: !704, file: !693, line: 39, type: !106)
!704 = distinct !DILexicalBlock(scope: !705, file: !693, line: 38, column: 5)
!705 = distinct !DILexicalBlock(scope: !692, file: !693, line: 37, column: 7)
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !708, file: !709, line: 339, type: !68, isLocal: true, isDefinition: true)
!708 = distinct !DISubprogram(name: "rpl_fcntl", scope: !709, file: !709, line: 276, type: !710, isDefinition: true, scopeLine: 277, flags: DIFlagPrototyped, isOptimized: true, unit: !712, retainedNodes: !715)
!709 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!710 = !DISubroutineType(types: !711)
!711 = !{!68, !68, !68, null}
!712 = distinct !DICompileUnit(language: DW_LANG_C99, file: !713, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !295, globals: !714)
!713 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!714 = !{!706}
!715 = !{!716, !717, !718, !731, !732, !735, !738, !741}
!716 = !DILocalVariable(name: "fd", arg: 1, scope: !708, file: !709, line: 276, type: !68)
!717 = !DILocalVariable(name: "action", arg: 2, scope: !708, file: !709, line: 276, type: !68)
!718 = !DILocalVariable(name: "arg", scope: !708, file: !709, line: 278, type: !719)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !720, line: 30, baseType: !721)
!720 = !DIFile(filename: "/usr/lib/clang/7.0.0/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !713, line: 278, baseType: !722)
!722 = !DICompositeType(tag: DW_TAG_array_type, baseType: !723, size: 192, elements: !729)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !713, line: 278, size: 192, elements: !724)
!724 = !{!725, !726, !727, !728}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !723, file: !713, line: 278, baseType: !7, size: 32)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !723, file: !713, line: 278, baseType: !7, size: 32, offset: 32)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !723, file: !713, line: 278, baseType: !90, size: 64, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !723, file: !713, line: 278, baseType: !90, size: 64, offset: 128)
!729 = !{!730}
!730 = !DISubrange(count: 1)
!731 = !DILocalVariable(name: "result", scope: !708, file: !709, line: 279, type: !68)
!732 = !DILocalVariable(name: "target", scope: !733, file: !709, line: 326, type: !68)
!733 = distinct !DILexicalBlock(scope: !734, file: !709, line: 325, column: 7)
!734 = distinct !DILexicalBlock(scope: !708, file: !709, line: 282, column: 5)
!735 = !DILocalVariable(name: "flags", scope: !736, file: !709, line: 363, type: !68)
!736 = distinct !DILexicalBlock(scope: !737, file: !709, line: 362, column: 11)
!737 = distinct !DILexicalBlock(scope: !733, file: !709, line: 361, column: 13)
!738 = !DILocalVariable(name: "saved_errno", scope: !739, file: !709, line: 366, type: !68)
!739 = distinct !DILexicalBlock(scope: !740, file: !709, line: 365, column: 15)
!740 = distinct !DILexicalBlock(scope: !736, file: !709, line: 364, column: 17)
!741 = !DILocalVariable(name: "p", scope: !742, file: !709, line: 408, type: !90)
!742 = distinct !DILexicalBlock(scope: !734, file: !709, line: 406, column: 7)
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !745, file: !750, line: 69, type: !751, isDefinition: true)
!745 = distinct !DICompileUnit(language: DW_LANG_C99, file: !746, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !747, retainedTypes: !748, globals: !749)
!746 = !DIFile(filename: "./lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!747 = !{!37}
!748 = !{!90, !286}
!749 = !{!743}
!750 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !752, line: 55, baseType: !753)
!752 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DISubroutineType(types: !755)
!755 = !{null}
!756 = distinct !DICompileUnit(language: DW_LANG_C99, file: !757, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !295, retainedTypes: !758)
!757 = !DIFile(filename: "src/prog-fprintf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!758 = !{!286}
!759 = distinct !DICompileUnit(language: DW_LANG_C99, file: !760, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !761, retainedTypes: !839)
!760 = !DIFile(filename: "src/extent-scan.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!761 = !{!762}
!762 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !763, file: !760, line: 97, baseType: !7, size: 32, elements: !837)
!763 = distinct !DISubprogram(name: "extent_scan_read", scope: !760, file: !760, line: 87, type: !764, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: true, unit: !759, retainedNodes: !784)
!764 = !DISubroutineType(types: !765)
!765 = !{!106, !766}
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extent_scan", file: !768, line: 36, size: 384, elements: !769)
!768 = !DIFile(filename: "src/extent-scan.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!769 = !{!770, !771, !773, !774, !775, !776, !777}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !767, file: !768, line: 39, baseType: !68, size: 32)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "scan_start", scope: !767, file: !768, line: 42, baseType: !772, size: 64, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !72, line: 85, baseType: !225)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "fm_flags", scope: !767, file: !768, line: 45, baseType: !7, size: 32, offset: 128)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "ei_count", scope: !767, file: !768, line: 48, baseType: !194, size: 64, offset: 192)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "initial_scan_failed", scope: !767, file: !768, line: 52, baseType: !106, size: 8, offset: 256)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "hit_final_extent", scope: !767, file: !768, line: 55, baseType: !106, size: 8, offset: 264)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "ext_info", scope: !767, file: !768, line: 58, baseType: !778, size: 64, offset: 320)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extent_info", file: !768, line: 23, size: 192, elements: !780)
!780 = !{!781, !782, !783}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "ext_logical", scope: !779, file: !768, line: 26, baseType: !772, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "ext_length", scope: !779, file: !768, line: 29, baseType: !772, size: 64, offset: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "ext_flags", scope: !779, file: !768, line: 32, baseType: !7, size: 32, offset: 128)
!784 = !{!785, !786, !787, !788, !822, !824, !826, !828, !829, !836}
!785 = !DILocalVariable(name: "scan", arg: 1, scope: !763, file: !760, line: 87, type: !766)
!786 = !DILocalVariable(name: "si", scope: !763, file: !760, line: 89, type: !7)
!787 = !DILocalVariable(name: "last_ei", scope: !763, file: !760, line: 90, type: !778)
!788 = !DILocalVariable(name: "fiemap_buf", scope: !789, file: !760, line: 94, type: !790)
!789 = distinct !DILexicalBlock(scope: !763, file: !760, line: 93, column: 5)
!790 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !763, file: !760, line: 94, size: 32768, elements: !791)
!791 = !{!792, !821}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !790, file: !760, line: 94, baseType: !793, size: 256)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fiemap", file: !794, line: 35, size: 256, elements: !795)
!794 = !DIFile(filename: "src/fiemap.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!795 = !{!796, !800, !801, !804, !805, !806, !807}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "fm_start", scope: !793, file: !794, line: 38, baseType: !797, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !798, line: 27, baseType: !799)
!798 = !DIFile(filename: "/usr/include/bits/stdint-uintn.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !74, line: 44, baseType: !196)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "fm_length", scope: !793, file: !794, line: 41, baseType: !797, size: 64, offset: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "fm_flags", scope: !793, file: !794, line: 44, baseType: !802, size: 32, offset: 128)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !798, line: 26, baseType: !803)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !74, line: 41, baseType: !7)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "fm_mapped_extents", scope: !793, file: !794, line: 47, baseType: !802, size: 32, offset: 160)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "fm_extent_count", scope: !793, file: !794, line: 50, baseType: !802, size: 32, offset: 192)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "fm_reserved", scope: !793, file: !794, line: 52, baseType: !802, size: 32, offset: 224)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "fm_extents", scope: !793, file: !794, line: 59, baseType: !808, offset: 256)
!808 = !DICompositeType(tag: DW_TAG_array_type, baseType: !809, elements: !819)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fiemap_extent", file: !794, line: 14, size: 448, elements: !810)
!810 = !{!811, !812, !813, !814, !816, !817}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "fe_logical", scope: !809, file: !794, line: 18, baseType: !797, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "fe_physical", scope: !809, file: !794, line: 22, baseType: !797, size: 64, offset: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "fe_length", scope: !809, file: !794, line: 25, baseType: !797, size: 64, offset: 128)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "fe_reserved64", scope: !809, file: !794, line: 27, baseType: !815, size: 128, offset: 192)
!815 = !DICompositeType(tag: DW_TAG_array_type, baseType: !797, size: 128, elements: !658)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "fe_flags", scope: !809, file: !794, line: 30, baseType: !802, size: 32, offset: 320)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "fe_reserved", scope: !809, file: !794, line: 32, baseType: !818, size: 96, offset: 352)
!818 = !DICompositeType(tag: DW_TAG_array_type, baseType: !802, size: 96, elements: !243)
!819 = !{!820}
!820 = !DISubrange(count: 0)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !790, file: !760, line: 94, baseType: !197, size: 32768)
!822 = !DILocalVariable(name: "fiemap", scope: !789, file: !760, line: 95, type: !823)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!824 = !DILocalVariable(name: "fm_extents", scope: !789, file: !760, line: 96, type: !825)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!826 = !DILocalVariable(name: "prev_idx", scope: !827, file: !760, line: 131, type: !194)
!827 = distinct !DILexicalBlock(scope: !789, file: !760, line: 128, column: 7)
!828 = !DILocalVariable(name: "i", scope: !789, file: !760, line: 137, type: !7)
!829 = !DILocalVariable(name: "new_logical", scope: !830, file: !760, line: 163, type: !797)
!830 = distinct !DILexicalBlock(scope: !831, file: !760, line: 158, column: 13)
!831 = distinct !DILexicalBlock(scope: !832, file: !760, line: 155, column: 20)
!832 = distinct !DILexicalBlock(scope: !833, file: !760, line: 145, column: 15)
!833 = distinct !DILexicalBlock(scope: !834, file: !760, line: 139, column: 9)
!834 = distinct !DILexicalBlock(scope: !835, file: !760, line: 138, column: 7)
!835 = distinct !DILexicalBlock(scope: !789, file: !760, line: 138, column: 7)
!836 = !DILocalVariable(name: "length_adjust", scope: !830, file: !760, line: 164, type: !797)
!837 = !{!838}
!838 = !DIEnumerator(name: "count", value: 72, isUnsigned: true)
!839 = !{!772, !194}
!840 = distinct !DICompileUnit(language: DW_LANG_C99, file: !841, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !295)
!841 = !DIFile(filename: "src/selinux.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!842 = distinct !DICompileUnit(language: DW_LANG_C99, file: !843, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !295)
!843 = !DIFile(filename: "./lib/copy-acl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!844 = distinct !DICompileUnit(language: DW_LANG_C99, file: !845, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !295)
!845 = !DIFile(filename: "./lib/set-acl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!846 = distinct !DICompileUnit(language: DW_LANG_C99, file: !847, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !295, retainedTypes: !848)
!847 = !DIFile(filename: "./lib/areadlink-with-size.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!848 = !{!90}
!849 = distinct !DICompileUnit(language: DW_LANG_C99, file: !850, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !415)
!850 = !DIFile(filename: "./lib/backup-rename.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!851 = distinct !DICompileUnit(language: DW_LANG_C99, file: !852, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !295)
!852 = !DIFile(filename: "./lib/buffer-lcm.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!853 = distinct !DICompileUnit(language: DW_LANG_C99, file: !854, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !295)
!854 = !DIFile(filename: "./lib/opendir-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!855 = distinct !DICompileUnit(language: DW_LANG_C99, file: !856, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !295)
!856 = !DIFile(filename: "./lib/dirname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!857 = distinct !DICompileUnit(language: DW_LANG_C99, file: !858, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !295)
!858 = !DIFile(filename: "./lib/dirname-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!859 = distinct !DICompileUnit(language: DW_LANG_C99, file: !860, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !295, retainedTypes: !861)
!860 = !DIFile(filename: "./lib/basename-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!861 = !{!88}
!862 = distinct !DICompileUnit(language: DW_LANG_C99, file: !863, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !864)
!863 = !DIFile(filename: "./lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!864 = !{!272}
!865 = distinct !DICompileUnit(language: DW_LANG_C99, file: !866, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !295)
!866 = !DIFile(filename: "./lib/open-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!867 = distinct !DICompileUnit(language: DW_LANG_C99, file: !868, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !295, retainedTypes: !469)
!868 = !DIFile(filename: "./lib/file-set.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!869 = distinct !DICompileUnit(language: DW_LANG_C99, file: !870, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !295)
!870 = !DIFile(filename: "./lib/filemode.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!871 = distinct !DICompileUnit(language: DW_LANG_C99, file: !872, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !295, retainedTypes: !848)
!872 = !DIFile(filename: "./lib/filenamecat.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!873 = distinct !DICompileUnit(language: DW_LANG_C99, file: !874, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !295, retainedTypes: !848)
!874 = !DIFile(filename: "./lib/filenamecat-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!875 = distinct !DICompileUnit(language: DW_LANG_C99, file: !876, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !295, retainedTypes: !877)
!876 = !DIFile(filename: "./lib/full-read.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!877 = !{!88, !194}
!878 = distinct !DICompileUnit(language: DW_LANG_C99, file: !879, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !295, retainedTypes: !880)
!879 = !DIFile(filename: "./lib/full-write.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!880 = !{!163, !194}
!881 = distinct !DICompileUnit(language: DW_LANG_C99, file: !882, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !295)
!882 = !DIFile(filename: "./lib/hash-triple.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!883 = distinct !DICompileUnit(language: DW_LANG_C99, file: !884, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !885)
!884 = !DIFile(filename: "./lib/mkancesdirs.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!885 = !{!886, !896}
!886 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !887, file: !60, line: 39, baseType: !7, size: 32, elements: !75)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savewd", file: !60, line: 36, size: 64, elements: !888)
!888 = !{!889, !890}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !887, file: !60, line: 66, baseType: !886, size: 32)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !887, file: !60, line: 74, baseType: !891, size: 32, offset: 32)
!891 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !887, file: !60, line: 69, size: 32, elements: !892)
!892 = !{!893, !894, !895}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !891, file: !60, line: 71, baseType: !68, size: 32)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "errnum", scope: !891, file: !60, line: 72, baseType: !68, size: 32)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !891, file: !60, line: 73, baseType: !71, size: 32)
!896 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !60, line: 86, baseType: !7, size: 32, elements: !897)
!897 = !{!898, !899}
!898 = !DIEnumerator(name: "SAVEWD_CHDIR_NOFOLLOW", value: 1, isUnsigned: true)
!899 = !DIEnumerator(name: "SAVEWD_CHDIR_SKIP_READABLE", value: 2, isUnsigned: true)
!900 = distinct !DICompileUnit(language: DW_LANG_C99, file: !901, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !902, retainedTypes: !913)
!901 = !DIFile(filename: "./lib/mkdir-p.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!902 = !{!903, !896}
!903 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !904, file: !60, line: 39, baseType: !7, size: 32, elements: !75)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savewd", file: !60, line: 36, size: 64, elements: !905)
!905 = !{!906, !907}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !904, file: !60, line: 66, baseType: !903, size: 32)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !904, file: !60, line: 74, baseType: !908, size: 32, offset: 32)
!908 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !904, file: !60, line: 69, size: 32, elements: !909)
!909 = !{!910, !911, !912}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !908, file: !60, line: 71, baseType: !68, size: 32)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "errnum", scope: !908, file: !60, line: 72, baseType: !68, size: 32)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !908, file: !60, line: 73, baseType: !71, size: 32)
!913 = !{!91, !93}
!914 = distinct !DICompileUnit(language: DW_LANG_C99, file: !915, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !916, retainedTypes: !924)
!915 = !DIFile(filename: "./lib/modechange.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!916 = !{!917}
!917 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !918, line: 78, baseType: !7, size: 32, elements: !919)
!918 = !DIFile(filename: "lib/modechange.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!919 = !{!920, !921, !922, !923}
!920 = !DIEnumerator(name: "MODE_DONE", value: 0, isUnsigned: true)
!921 = !DIEnumerator(name: "MODE_ORDINARY_CHANGE", value: 1, isUnsigned: true)
!922 = !DIEnumerator(name: "MODE_X_IF_ANY_X", value: 2, isUnsigned: true)
!923 = !DIEnumerator(name: "MODE_COPY_EXISTING", value: 3, isUnsigned: true)
!924 = !{!194}
!925 = distinct !DICompileUnit(language: DW_LANG_C99, file: !926, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !295)
!926 = !DIFile(filename: "./lib/qcopy-acl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!927 = distinct !DICompileUnit(language: DW_LANG_C99, file: !928, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !295)
!928 = !DIFile(filename: "./lib/qset-acl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!929 = distinct !DICompileUnit(language: DW_LANG_C99, file: !930, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !295, retainedTypes: !861)
!930 = !DIFile(filename: "./lib/renameat2.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!931 = distinct !DICompileUnit(language: DW_LANG_C99, file: !932, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !933)
!932 = !DIFile(filename: "./lib/safe-read.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!933 = !{!934}
!934 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !935, line: 40, baseType: !7, size: 32, elements: !936)
!935 = !DIFile(filename: "./lib/sys-limits.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!936 = !{!937}
!937 = !DIEnumerator(name: "SYS_BUFSIZE_MAX", value: 2146435072, isUnsigned: true)
!938 = distinct !DICompileUnit(language: DW_LANG_C99, file: !939, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !933)
!939 = !DIFile(filename: "./lib/safe-write.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!940 = distinct !DICompileUnit(language: DW_LANG_C99, file: !941, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !295)
!941 = !DIFile(filename: "./lib/same.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!942 = distinct !DICompileUnit(language: DW_LANG_C99, file: !943, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !944)
!943 = !DIFile(filename: "./lib/savewd.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!944 = !{!945, !896}
!945 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !946, file: !60, line: 39, baseType: !7, size: 32, elements: !75)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savewd", file: !60, line: 36, size: 64, elements: !947)
!947 = !{!948, !949}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !946, file: !60, line: 66, baseType: !945, size: 32)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !946, file: !60, line: 74, baseType: !950, size: 32, offset: 32)
!950 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !946, file: !60, line: 69, size: 32, elements: !951)
!951 = !{!952, !953, !954}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !950, file: !60, line: 71, baseType: !68, size: 32)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "errnum", scope: !950, file: !60, line: 72, baseType: !68, size: 32)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !950, file: !60, line: 73, baseType: !71, size: 32)
!955 = distinct !DICompileUnit(language: DW_LANG_C99, file: !956, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !295)
!956 = !DIFile(filename: "./lib/fd-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!957 = distinct !DICompileUnit(language: DW_LANG_C99, file: !958, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !295)
!958 = !DIFile(filename: "./lib/verror.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!959 = distinct !DICompileUnit(language: DW_LANG_C99, file: !960, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !961, retainedTypes: !848)
!960 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!961 = !{!962}
!962 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !963, line: 41, baseType: !7, size: 32, elements: !964)
!963 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!964 = !{!965}
!965 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2018, isUnsigned: true)
!966 = distinct !DICompileUnit(language: DW_LANG_C99, file: !967, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !968, retainedTypes: !976)
!967 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!968 = !{!969}
!969 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !970, file: !544, line: 186, baseType: !7, size: 32, elements: !554)
!970 = distinct !DISubprogram(name: "x2nrealloc", scope: !544, file: !544, line: 174, type: !546, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: true, unit: !966, retainedNodes: !971)
!971 = !{!972, !973, !974, !975}
!972 = !DILocalVariable(name: "p", arg: 1, scope: !970, file: !544, line: 174, type: !90)
!973 = !DILocalVariable(name: "pn", arg: 2, scope: !970, file: !544, line: 174, type: !548)
!974 = !DILocalVariable(name: "s", arg: 3, scope: !970, file: !544, line: 174, type: !194)
!975 = !DILocalVariable(name: "n", scope: !970, file: !544, line: 176, type: !194)
!976 = !{!194, !88, !90}
!977 = distinct !DICompileUnit(language: DW_LANG_C99, file: !978, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !295)
!978 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!979 = distinct !DICompileUnit(language: DW_LANG_C99, file: !980, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !981, retainedTypes: !982)
!980 = !DIFile(filename: "./lib/xstrtoul.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!981 = !{!51, !482}
!982 = !{!68, !498}
!983 = distinct !DICompileUnit(language: DW_LANG_C99, file: !984, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !295, retainedTypes: !861)
!984 = !DIFile(filename: "./lib/xvasprintf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!985 = distinct !DICompileUnit(language: DW_LANG_C99, file: !986, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !295)
!986 = !DIFile(filename: "./lib/yesno.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!987 = distinct !DICompileUnit(language: DW_LANG_C99, file: !988, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !295, retainedTypes: !848)
!988 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!989 = distinct !DICompileUnit(language: DW_LANG_C99, file: !990, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !295, retainedTypes: !848)
!990 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!991 = distinct !DICompileUnit(language: DW_LANG_C99, file: !992, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !295)
