; ModuleID = 'coreutils-8.32/src/groups.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.passwd = type { i8*, i8*, i32, i32, i8*, i8*, i8* }
%struct.group = type { i8*, i8*, i32, i8** }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [37 x i8] c"Usage: %s [OPTION]... [USERNAME]...\0A\00", align 1
@.str.2 = private unnamed_addr constant [155 x i8] c"Print group memberships for each USERNAME or, if no USERNAME is specified, for\0Athe current process (which may differ if the groups database has changed).\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 40, type: !154, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !153, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/groups.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{}
!5 = !{!6, !15, !76, !80, !84, !87, !90, !97, !10, !66, !112, !116, !121, !125, !126, !127, !132, !148, !152}
!6 = !DISubprogram(name: "dcgettext", scope: !7, file: !7, line: 51, type: !8, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!7 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!8 = !DISubroutineType(types: !9)
!9 = !{!10, !12, !12, !14}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!14 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!15 = !DISubprogram(name: "fputs_unlocked", scope: !16, file: !16, line: 662, type: !17, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!16 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!17 = !DISubroutineType(types: !18)
!18 = !{!14, !12, !19}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !22)
!21 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!22 = !{!23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !38, !39, !40, !41, !45, !47, !49, !53, !56, !58, !61, !64, !65, !67, !71, !72}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !20, file: !21, line: 51, baseType: !14, size: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !20, file: !21, line: 54, baseType: !10, size: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !20, file: !21, line: 55, baseType: !10, size: 64, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !20, file: !21, line: 56, baseType: !10, size: 64, offset: 192)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !20, file: !21, line: 57, baseType: !10, size: 64, offset: 256)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !20, file: !21, line: 58, baseType: !10, size: 64, offset: 320)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !20, file: !21, line: 59, baseType: !10, size: 64, offset: 384)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !20, file: !21, line: 60, baseType: !10, size: 64, offset: 448)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !20, file: !21, line: 61, baseType: !10, size: 64, offset: 512)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !20, file: !21, line: 64, baseType: !10, size: 64, offset: 576)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !20, file: !21, line: 65, baseType: !10, size: 64, offset: 640)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !20, file: !21, line: 66, baseType: !10, size: 64, offset: 704)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !20, file: !21, line: 68, baseType: !36, size: 64, offset: 768)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !21, line: 36, flags: DIFlagFwdDecl)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !20, file: !21, line: 70, baseType: !19, size: 64, offset: 832)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !20, file: !21, line: 72, baseType: !14, size: 32, offset: 896)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !20, file: !21, line: 73, baseType: !14, size: 32, offset: 928)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !20, file: !21, line: 74, baseType: !42, size: 64, offset: 960)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !43, line: 152, baseType: !44)
!43 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!44 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !20, file: !21, line: 77, baseType: !46, size: 16, offset: 1024)
!46 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !20, file: !21, line: 78, baseType: !48, size: 8, offset: 1040)
!48 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !20, file: !21, line: 79, baseType: !50, size: 8, offset: 1048)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 8, elements: !51)
!51 = !{!52}
!52 = !DISubrange(count: 1)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !20, file: !21, line: 81, baseType: !54, size: 64, offset: 1088)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !21, line: 43, baseType: null)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !20, file: !21, line: 89, baseType: !57, size: 64, offset: 1152)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !43, line: 153, baseType: !44)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !20, file: !21, line: 91, baseType: !59, size: 64, offset: 1216)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !21, line: 37, flags: DIFlagFwdDecl)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !20, file: !21, line: 92, baseType: !62, size: 64, offset: 1280)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !21, line: 38, flags: DIFlagFwdDecl)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !20, file: !21, line: 93, baseType: !19, size: 64, offset: 1344)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !20, file: !21, line: 94, baseType: !66, size: 64, offset: 1408)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !20, file: !21, line: 95, baseType: !68, size: 64, offset: 1472)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !69, line: 46, baseType: !70)
!69 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!70 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !20, file: !21, line: 96, baseType: !14, size: 32, offset: 1536)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !20, file: !21, line: 98, baseType: !73, size: 160, offset: 1568)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 160, elements: !74)
!74 = !{!75}
!75 = !DISubrange(count: 20)
!76 = !DISubprogram(name: "set_program_name", scope: !77, file: !77, line: 37, type: !78, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!77 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!78 = !DISubroutineType(types: !79)
!79 = !{null, !12}
!80 = !DISubprogram(name: "setlocale", scope: !81, file: !81, line: 122, type: !82, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!81 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!82 = !DISubroutineType(types: !83)
!83 = !{!10, !14, !12}
!84 = !DISubprogram(name: "bindtextdomain", scope: !7, file: !7, line: 86, type: !85, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!85 = !DISubroutineType(types: !86)
!86 = !{!10, !12, !12}
!87 = !DISubprogram(name: "textdomain", scope: !7, file: !7, line: 82, type: !88, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!88 = !DISubroutineType(types: !89)
!89 = !{!10, !12}
!90 = !DISubprogram(name: "atexit", scope: !91, file: !91, line: 595, type: !92, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!91 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!92 = !DISubroutineType(types: !93)
!93 = !{!14, !94}
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DISubroutineType(types: !96)
!96 = !{null}
!97 = !DISubprogram(name: "getopt_long", scope: !98, file: !98, line: 66, type: !99, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!98 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!99 = !DISubroutineType(types: !100)
!100 = !{!14, !14, !101, !12, !103, !110}
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !105)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !98, line: 50, size: 256, elements: !106)
!106 = !{!107, !108, !109, !111}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !105, file: !98, line: 52, baseType: !12, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !105, file: !98, line: 55, baseType: !14, size: 32, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !105, file: !98, line: 56, baseType: !110, size: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !105, file: !98, line: 57, baseType: !14, size: 32, offset: 192)
!112 = !DISubprogram(name: "version_etc", scope: !113, file: !113, line: 69, type: !114, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!113 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!114 = !DISubroutineType(types: !115)
!115 = !{null, !19, !12, !12, !12, null}
!116 = !DISubprogram(name: "getuid", scope: !117, file: !117, line: 675, type: !118, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!117 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!118 = !DISubroutineType(types: !119)
!119 = !{!120}
!120 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!121 = !DISubprogram(name: "error", scope: !122, file: !122, line: 52, type: !123, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!122 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!123 = !DISubroutineType(types: !124)
!124 = !{null, !14, !14, !12, null}
!125 = !DISubprogram(name: "getegid", scope: !117, file: !117, line: 684, type: !118, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!126 = !DISubprogram(name: "getgid", scope: !117, file: !117, line: 681, type: !118, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!127 = !DISubprogram(name: "print_group_list", scope: !128, file: !128, line: 19, type: !129, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!128 = !DIFile(filename: "src/group-list.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!129 = !DISubroutineType(types: !130)
!130 = !{!131, !12, !120, !120, !120, !131, !11}
!131 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!132 = !DISubprogram(name: "getpwnam", scope: !133, file: !133, line: 116, type: !134, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!133 = !DIFile(filename: "/usr/include/pwd.h", directory: "")
!134 = !DISubroutineType(types: !135)
!135 = !{!136, !12}
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !133, line: 49, size: 384, elements: !138)
!138 = !{!139, !140, !141, !143, !145, !146, !147}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !137, file: !133, line: 51, baseType: !10, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !137, file: !133, line: 52, baseType: !10, size: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !137, file: !133, line: 54, baseType: !142, size: 32, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !43, line: 146, baseType: !120)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !137, file: !133, line: 55, baseType: !144, size: 32, offset: 160)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !43, line: 147, baseType: !120)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !137, file: !133, line: 56, baseType: !10, size: 64, offset: 192)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !137, file: !133, line: 57, baseType: !10, size: 64, offset: 256)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !137, file: !133, line: 58, baseType: !10, size: 64, offset: 320)
!148 = !DISubprogram(name: "quote", scope: !149, file: !149, line: 44, type: !150, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!149 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!150 = !DISubroutineType(types: !151)
!151 = !{!12, !12}
!152 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!153 = !{!0}
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 768, elements: !155)
!155 = !{!156}
!156 = !DISubrange(count: 3)
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!158 = distinct !DIGlobalVariable(name: "buf", scope: !159, file: !160, line: 96, type: !248, isLocal: true, isDefinition: true)
!159 = distinct !DISubprogram(name: "gidtostr_ptr", scope: !160, file: !160, line: 94, type: !161, scopeLine: 95, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !167, retainedNodes: !246)
!160 = !DIFile(filename: "src/group-list.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!161 = !DISubroutineType(types: !162)
!162 = !{!10, !163}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !166, line: 64, baseType: !144)
!166 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!167 = distinct !DICompileUnit(language: DW_LANG_C99, file: !160, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !168, globals: !245, splitDebugInlining: false, nameTableKind: None)
!168 = !{!169, !66, !182, !185, !6, !148, !121, !191, !194, !70, !206, !152, !241}
!169 = !DISubprogram(name: "getpwuid", scope: !133, file: !133, line: 110, type: !170, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!170 = !DISubroutineType(types: !171)
!171 = !{!172, !120}
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !133, line: 49, size: 384, elements: !174)
!174 = !{!175, !176, !177, !178, !179, !180, !181}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !173, file: !133, line: 51, baseType: !10, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !173, file: !133, line: 52, baseType: !10, size: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !173, file: !133, line: 54, baseType: !142, size: 32, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !173, file: !133, line: 55, baseType: !144, size: 32, offset: 160)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !173, file: !133, line: 56, baseType: !10, size: 64, offset: 192)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !173, file: !133, line: 57, baseType: !10, size: 64, offset: 256)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !173, file: !133, line: 58, baseType: !10, size: 64, offset: 320)
!182 = !DISubprogram(name: "print_group", scope: !128, file: !128, line: 18, type: !183, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!183 = !DISubroutineType(types: !184)
!184 = !{!131, !120, !131}
!185 = !DISubprogram(name: "xgetgroups", scope: !186, file: !186, line: 21, type: !187, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!186 = !DIFile(filename: "./lib/mgetgroups.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!187 = !DISubroutineType(types: !188)
!188 = !{!14, !12, !120, !189}
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!191 = !DISubprogram(name: "free", scope: !91, file: !91, line: 565, type: !192, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!192 = !DISubroutineType(types: !193)
!193 = !{null, !66}
!194 = !DISubprogram(name: "getgrgid", scope: !195, file: !195, line: 101, type: !196, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!195 = !DIFile(filename: "/usr/include/grp.h", directory: "")
!196 = !DISubroutineType(types: !197)
!197 = !{!198, !120}
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "group", file: !195, line: 42, size: 256, elements: !200)
!200 = !{!201, !202, !203, !204}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "gr_name", scope: !199, file: !195, line: 44, baseType: !10, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "gr_passwd", scope: !199, file: !195, line: 45, baseType: !10, size: 64, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "gr_gid", scope: !199, file: !195, line: 46, baseType: !144, size: 32, offset: 128)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "gr_mem", scope: !199, file: !195, line: 47, baseType: !205, size: 64, offset: 192)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!206 = !DISubprogram(name: "fputs_unlocked", scope: !16, file: !16, line: 662, type: !207, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!207 = !DISubroutineType(types: !208)
!208 = !{!14, !12, !209}
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !211)
!211 = !{!212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !210, file: !21, line: 51, baseType: !14, size: 32)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !210, file: !21, line: 54, baseType: !10, size: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !210, file: !21, line: 55, baseType: !10, size: 64, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !210, file: !21, line: 56, baseType: !10, size: 64, offset: 192)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !210, file: !21, line: 57, baseType: !10, size: 64, offset: 256)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !210, file: !21, line: 58, baseType: !10, size: 64, offset: 320)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !210, file: !21, line: 59, baseType: !10, size: 64, offset: 384)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !210, file: !21, line: 60, baseType: !10, size: 64, offset: 448)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !210, file: !21, line: 61, baseType: !10, size: 64, offset: 512)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !210, file: !21, line: 64, baseType: !10, size: 64, offset: 576)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !210, file: !21, line: 65, baseType: !10, size: 64, offset: 640)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !210, file: !21, line: 66, baseType: !10, size: 64, offset: 704)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !210, file: !21, line: 68, baseType: !36, size: 64, offset: 768)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !210, file: !21, line: 70, baseType: !209, size: 64, offset: 832)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !210, file: !21, line: 72, baseType: !14, size: 32, offset: 896)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !210, file: !21, line: 73, baseType: !14, size: 32, offset: 928)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !210, file: !21, line: 74, baseType: !42, size: 64, offset: 960)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !210, file: !21, line: 77, baseType: !46, size: 16, offset: 1024)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !210, file: !21, line: 78, baseType: !48, size: 8, offset: 1040)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !210, file: !21, line: 79, baseType: !50, size: 8, offset: 1048)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !210, file: !21, line: 81, baseType: !54, size: 64, offset: 1088)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !210, file: !21, line: 89, baseType: !57, size: 64, offset: 1152)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !210, file: !21, line: 91, baseType: !59, size: 64, offset: 1216)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !210, file: !21, line: 92, baseType: !62, size: 64, offset: 1280)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !210, file: !21, line: 93, baseType: !209, size: 64, offset: 1344)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !210, file: !21, line: 94, baseType: !66, size: 64, offset: 1408)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !210, file: !21, line: 95, baseType: !68, size: 64, offset: 1472)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !210, file: !21, line: 96, baseType: !14, size: 32, offset: 1536)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !210, file: !21, line: 98, baseType: !73, size: 160, offset: 1568)
!241 = !DISubprogram(name: "umaxtostr", scope: !242, file: !242, line: 46, type: !243, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!242 = !DIFile(filename: "./lib/inttostr.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!243 = !DISubroutineType(types: !244)
!244 = !{!10, !70, !10}
!245 = !{!157}
!246 = !{!247}
!247 = !DILocalVariable(name: "gid", arg: 1, scope: !159, file: !160, line: 94, type: !163)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 168, elements: !249)
!249 = !{!250}
!250 = !DISubrange(count: 21)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(name: "Version", scope: !253, file: !254, line: 2, type: !12, isLocal: false, isDefinition: true)
!253 = distinct !DICompileUnit(language: DW_LANG_C99, file: !254, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !255, splitDebugInlining: false, nameTableKind: None)
!254 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!255 = !{!251}
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(name: "file_name", scope: !258, file: !259, line: 46, type: !12, isLocal: true, isDefinition: true)
!258 = distinct !DICompileUnit(language: DW_LANG_C99, file: !259, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !260, globals: !299, splitDebugInlining: false, nameTableKind: None)
!259 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!260 = !{!261, !6, !297, !121}
!261 = !DISubprogram(name: "close_stream", scope: !262, file: !262, line: 2, type: !263, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!262 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!263 = !DISubroutineType(types: !264)
!264 = !{!14, !265}
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !267)
!267 = !{!268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !266, file: !21, line: 51, baseType: !14, size: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !266, file: !21, line: 54, baseType: !10, size: 64, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !266, file: !21, line: 55, baseType: !10, size: 64, offset: 128)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !266, file: !21, line: 56, baseType: !10, size: 64, offset: 192)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !266, file: !21, line: 57, baseType: !10, size: 64, offset: 256)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !266, file: !21, line: 58, baseType: !10, size: 64, offset: 320)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !266, file: !21, line: 59, baseType: !10, size: 64, offset: 384)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !266, file: !21, line: 60, baseType: !10, size: 64, offset: 448)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !266, file: !21, line: 61, baseType: !10, size: 64, offset: 512)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !266, file: !21, line: 64, baseType: !10, size: 64, offset: 576)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !266, file: !21, line: 65, baseType: !10, size: 64, offset: 640)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !266, file: !21, line: 66, baseType: !10, size: 64, offset: 704)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !266, file: !21, line: 68, baseType: !36, size: 64, offset: 768)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !266, file: !21, line: 70, baseType: !265, size: 64, offset: 832)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !266, file: !21, line: 72, baseType: !14, size: 32, offset: 896)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !266, file: !21, line: 73, baseType: !14, size: 32, offset: 928)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !266, file: !21, line: 74, baseType: !42, size: 64, offset: 960)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !266, file: !21, line: 77, baseType: !46, size: 16, offset: 1024)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !266, file: !21, line: 78, baseType: !48, size: 8, offset: 1040)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !266, file: !21, line: 79, baseType: !50, size: 8, offset: 1048)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !266, file: !21, line: 81, baseType: !54, size: 64, offset: 1088)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !266, file: !21, line: 89, baseType: !57, size: 64, offset: 1152)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !266, file: !21, line: 91, baseType: !59, size: 64, offset: 1216)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !266, file: !21, line: 92, baseType: !62, size: 64, offset: 1280)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !266, file: !21, line: 93, baseType: !265, size: 64, offset: 1344)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !266, file: !21, line: 94, baseType: !66, size: 64, offset: 1408)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !266, file: !21, line: 95, baseType: !68, size: 64, offset: 1472)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !266, file: !21, line: 96, baseType: !14, size: 32, offset: 1536)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !266, file: !21, line: 98, baseType: !73, size: 160, offset: 1568)
!297 = !DISubprogram(name: "quotearg_colon", scope: !298, file: !298, line: 391, type: !88, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!298 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!299 = !{!256, !300}
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !258, file: !259, line: 56, type: !131, isLocal: true, isDefinition: true)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(name: "exit_failure", scope: !304, file: !305, line: 24, type: !307, isLocal: false, isDefinition: true)
!304 = distinct !DICompileUnit(language: DW_LANG_C99, file: !305, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !306, splitDebugInlining: false, nameTableKind: None)
!305 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!306 = !{!302}
!307 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !14)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(name: "program_name", scope: !310, file: !311, line: 33, type: !12, isLocal: false, isDefinition: true)
!310 = distinct !DICompileUnit(language: DW_LANG_C99, file: !311, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !312, globals: !348, splitDebugInlining: false, nameTableKind: None)
!311 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!312 = !{!66, !313, !10}
!313 = !DISubprogram(name: "fputs", scope: !16, file: !16, line: 626, type: !314, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!314 = !DISubroutineType(types: !315)
!315 = !{!14, !12, !316}
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !318)
!318 = !{!319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !317, file: !21, line: 51, baseType: !14, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !317, file: !21, line: 54, baseType: !10, size: 64, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !317, file: !21, line: 55, baseType: !10, size: 64, offset: 128)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !317, file: !21, line: 56, baseType: !10, size: 64, offset: 192)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !317, file: !21, line: 57, baseType: !10, size: 64, offset: 256)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !317, file: !21, line: 58, baseType: !10, size: 64, offset: 320)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !317, file: !21, line: 59, baseType: !10, size: 64, offset: 384)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !317, file: !21, line: 60, baseType: !10, size: 64, offset: 448)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !317, file: !21, line: 61, baseType: !10, size: 64, offset: 512)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !317, file: !21, line: 64, baseType: !10, size: 64, offset: 576)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !317, file: !21, line: 65, baseType: !10, size: 64, offset: 640)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !317, file: !21, line: 66, baseType: !10, size: 64, offset: 704)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !317, file: !21, line: 68, baseType: !36, size: 64, offset: 768)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !317, file: !21, line: 70, baseType: !316, size: 64, offset: 832)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !317, file: !21, line: 72, baseType: !14, size: 32, offset: 896)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !317, file: !21, line: 73, baseType: !14, size: 32, offset: 928)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !317, file: !21, line: 74, baseType: !42, size: 64, offset: 960)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !317, file: !21, line: 77, baseType: !46, size: 16, offset: 1024)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !317, file: !21, line: 78, baseType: !48, size: 8, offset: 1040)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !317, file: !21, line: 79, baseType: !50, size: 8, offset: 1048)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !317, file: !21, line: 81, baseType: !54, size: 64, offset: 1088)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !317, file: !21, line: 89, baseType: !57, size: 64, offset: 1152)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !317, file: !21, line: 91, baseType: !59, size: 64, offset: 1216)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !317, file: !21, line: 92, baseType: !62, size: 64, offset: 1280)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !317, file: !21, line: 93, baseType: !316, size: 64, offset: 1344)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !317, file: !21, line: 94, baseType: !66, size: 64, offset: 1408)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !317, file: !21, line: 95, baseType: !68, size: 64, offset: 1472)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !317, file: !21, line: 96, baseType: !14, size: 32, offset: 1536)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !317, file: !21, line: 98, baseType: !73, size: 160, offset: 1568)
!348 = !{!308}
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !351, file: !352, line: 85, type: !482, isLocal: false, isDefinition: true)
!351 = distinct !DICompileUnit(language: DW_LANG_C99, file: !352, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !353, retainedTypes: !387, globals: !455, splitDebugInlining: false, nameTableKind: None)
!352 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!353 = !{!354, !367, !372}
!354 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !298, line: 32, baseType: !120, size: 32, elements: !355)
!355 = !{!356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366}
!356 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!357 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!358 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!359 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!360 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!361 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!362 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!363 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!364 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!365 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!366 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!367 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !298, line: 242, baseType: !120, size: 32, elements: !368)
!368 = !{!369, !370, !371}
!369 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!370 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!371 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!372 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !373, line: 46, baseType: !120, size: 32, elements: !374)
!373 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!374 = !{!375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386}
!375 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!376 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!377 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!378 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!379 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!380 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!381 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!382 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!383 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!384 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!385 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!386 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!387 = !{!388, !394, !191, !410, !14, !46, !413, !68, !430, !434, !6, !440, !444, !10, !448, !451, !452}
!388 = !DISubprogram(name: "xmemdup", scope: !389, file: !389, line: 62, type: !390, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!389 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!390 = !DISubroutineType(types: !391)
!391 = !{!66, !392, !70}
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!394 = !DISubprogram(name: "quotearg_alloc_mem", scope: !298, file: !298, line: 342, type: !395, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!395 = !DISubroutineType(types: !396)
!396 = !{!10, !12, !70, !397, !398}
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !400)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !352, line: 65, size: 448, elements: !401)
!401 = !{!402, !403, !404, !408, !409}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !400, file: !352, line: 68, baseType: !354, size: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !400, file: !352, line: 71, baseType: !14, size: 32, offset: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !400, file: !352, line: 75, baseType: !405, size: 256, offset: 64)
!405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 256, elements: !406)
!406 = !{!407}
!407 = !DISubrange(count: 8)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !400, file: !352, line: 78, baseType: !12, size: 64, offset: 320)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !400, file: !352, line: 81, baseType: !12, size: 64, offset: 384)
!410 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !298, file: !298, line: 408, type: !411, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!411 = !DISubroutineType(types: !412)
!412 = !{!10, !14, !12, !12, !12, !70}
!413 = !DISubprogram(name: "rpl_mbrtowc", scope: !414, file: !414, line: 717, type: !415, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!414 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!415 = !DISubroutineType(types: !416)
!416 = !{!70, !110, !12, !70, !417}
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !419, line: 13, size: 64, elements: !420)
!419 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!420 = !{!421, !422}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !418, file: !419, line: 15, baseType: !14, size: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !418, file: !419, line: 20, baseType: !423, size: 32, offset: 32)
!423 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !418, file: !419, line: 16, size: 32, elements: !424)
!424 = !{!425, !426}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !423, file: !419, line: 18, baseType: !120, size: 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !423, file: !419, line: 19, baseType: !427, size: 32)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 32, elements: !428)
!428 = !{!429}
!429 = !DISubrange(count: 4)
!430 = !DISubprogram(name: "iswprint", scope: !431, file: !431, line: 120, type: !432, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!431 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!432 = !DISubroutineType(types: !433)
!433 = !{!14, !120}
!434 = !DISubprogram(name: "mbsinit", scope: !435, file: !435, line: 292, type: !436, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!435 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!436 = !DISubroutineType(types: !437)
!437 = !{!14, !438}
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !418)
!440 = !DISubprogram(name: "locale_charset", scope: !441, file: !441, line: 35, type: !442, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!441 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!442 = !DISubroutineType(types: !443)
!443 = !{!12}
!444 = !DISubprogram(name: "c_strcasecmp", scope: !445, file: !445, line: 42, type: !446, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!445 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!446 = !DISubroutineType(types: !447)
!447 = !{!14, !12, !12}
!448 = !DISubprogram(name: "xmalloc", scope: !389, file: !389, line: 53, type: !449, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!449 = !DISubroutineType(types: !450)
!450 = !{!66, !70}
!451 = !DISubprogram(name: "xalloc_die", scope: !389, file: !389, line: 51, type: !95, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !4)
!452 = !DISubprogram(name: "xrealloc", scope: !389, file: !389, line: 59, type: !453, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!453 = !DISubroutineType(types: !454)
!454 = !{!66, !66, !70}
!455 = !{!349, !456, !462, !464, !466, !471, !478, !480}
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !351, file: !352, line: 101, type: !458, isLocal: false, isDefinition: true)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !459, size: 320, elements: !460)
!459 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !354)
!460 = !{!461}
!461 = !DISubrange(count: 10)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !351, file: !352, line: 1052, type: !400, isLocal: false, isDefinition: true)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !351, file: !352, line: 116, type: !400, isLocal: true, isDefinition: true)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(name: "slot0", scope: !351, file: !352, line: 842, type: !468, isLocal: true, isDefinition: true)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 2048, elements: !469)
!469 = !{!470}
!470 = !DISubrange(count: 256)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(name: "slotvec", scope: !351, file: !352, line: 845, type: !473, isLocal: true, isDefinition: true)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !352, line: 834, size: 128, elements: !475)
!475 = !{!476, !477}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !474, file: !352, line: 836, baseType: !68, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !474, file: !352, line: 837, baseType: !10, size: 64, offset: 64)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(name: "nslots", scope: !351, file: !352, line: 843, type: !14, isLocal: true, isDefinition: true)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(name: "slotvec0", scope: !351, file: !352, line: 844, type: !474, isLocal: true, isDefinition: true)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !483, size: 704, elements: !484)
!483 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!484 = !{!485}
!485 = !DISubrange(count: 11)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !488, file: !489, line: 26, type: !491, isLocal: false, isDefinition: true)
!488 = distinct !DICompileUnit(language: DW_LANG_C99, file: !489, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !490, splitDebugInlining: false, nameTableKind: None)
!489 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!490 = !{!486}
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 376, elements: !492)
!492 = !{!493}
!493 = !DISubrange(count: 47)
!494 = distinct !DICompileUnit(language: DW_LANG_C99, file: !495, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !496, splitDebugInlining: false, nameTableKind: None)
!495 = !DIFile(filename: "lib/umaxtostr.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!496 = !{!497}
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !498, line: 102, baseType: !499)
!498 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !43, line: 73, baseType: !70)
!500 = distinct !DICompileUnit(language: DW_LANG_C99, file: !501, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !502, retainedTypes: !506, splitDebugInlining: false, nameTableKind: None)
!501 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!502 = !{!503}
!503 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !501, line: 40, baseType: !120, size: 32, elements: !504)
!504 = !{!505}
!505 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!506 = !{!6, !507, !66}
!507 = !DISubprogram(name: "fputs_unlocked", scope: !16, file: !16, line: 662, type: !508, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!508 = !DISubroutineType(types: !509)
!509 = !{!14, !12, !510}
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !512)
!512 = !{!513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !511, file: !21, line: 51, baseType: !14, size: 32)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !511, file: !21, line: 54, baseType: !10, size: 64, offset: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !511, file: !21, line: 55, baseType: !10, size: 64, offset: 128)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !511, file: !21, line: 56, baseType: !10, size: 64, offset: 192)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !511, file: !21, line: 57, baseType: !10, size: 64, offset: 256)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !511, file: !21, line: 58, baseType: !10, size: 64, offset: 320)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !511, file: !21, line: 59, baseType: !10, size: 64, offset: 384)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !511, file: !21, line: 60, baseType: !10, size: 64, offset: 448)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !511, file: !21, line: 61, baseType: !10, size: 64, offset: 512)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !511, file: !21, line: 64, baseType: !10, size: 64, offset: 576)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !511, file: !21, line: 65, baseType: !10, size: 64, offset: 640)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !511, file: !21, line: 66, baseType: !10, size: 64, offset: 704)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !511, file: !21, line: 68, baseType: !36, size: 64, offset: 768)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !511, file: !21, line: 70, baseType: !510, size: 64, offset: 832)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !511, file: !21, line: 72, baseType: !14, size: 32, offset: 896)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !511, file: !21, line: 73, baseType: !14, size: 32, offset: 928)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !511, file: !21, line: 74, baseType: !42, size: 64, offset: 960)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !511, file: !21, line: 77, baseType: !46, size: 16, offset: 1024)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !511, file: !21, line: 78, baseType: !48, size: 8, offset: 1040)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !511, file: !21, line: 79, baseType: !50, size: 8, offset: 1048)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !511, file: !21, line: 81, baseType: !54, size: 64, offset: 1088)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !511, file: !21, line: 89, baseType: !57, size: 64, offset: 1152)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !511, file: !21, line: 91, baseType: !59, size: 64, offset: 1216)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !511, file: !21, line: 92, baseType: !62, size: 64, offset: 1280)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !511, file: !21, line: 93, baseType: !510, size: 64, offset: 1344)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !511, file: !21, line: 94, baseType: !66, size: 64, offset: 1408)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !511, file: !21, line: 95, baseType: !68, size: 64, offset: 1472)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !511, file: !21, line: 96, baseType: !14, size: 32, offset: 1536)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !511, file: !21, line: 98, baseType: !73, size: 160, offset: 1568)
!542 = distinct !DICompileUnit(language: DW_LANG_C99, file: !543, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !544, retainedTypes: !557, splitDebugInlining: false, nameTableKind: None)
!543 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!544 = !{!545}
!545 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !546, file: !389, line: 186, baseType: !120, size: 32, elements: !555)
!546 = distinct !DISubprogram(name: "x2nrealloc", scope: !389, file: !389, line: 174, type: !547, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !542, retainedNodes: !550)
!547 = !DISubroutineType(types: !548)
!548 = !{!66, !66, !549, !68}
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!550 = !{!551, !552, !553, !554}
!551 = !DILocalVariable(name: "p", arg: 1, scope: !546, file: !389, line: 174, type: !66)
!552 = !DILocalVariable(name: "pn", arg: 2, scope: !546, file: !389, line: 174, type: !549)
!553 = !DILocalVariable(name: "s", arg: 3, scope: !546, file: !389, line: 174, type: !68)
!554 = !DILocalVariable(name: "n", scope: !546, file: !389, line: 176, type: !68)
!555 = !{!556}
!556 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!557 = !{!68, !451, !448, !452, !10, !191, !66, !558, !561}
!558 = !DISubprogram(name: "xcalloc", scope: !389, file: !389, line: 57, type: !559, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!559 = !DISubroutineType(types: !560)
!560 = !{!66, !70, !70}
!561 = !DISubprogram(name: "rpl_calloc", scope: !562, file: !562, line: 688, type: !559, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!562 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!563 = distinct !DICompileUnit(language: DW_LANG_C99, file: !564, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !565, splitDebugInlining: false, nameTableKind: None)
!564 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!565 = !{!6, !121}
!566 = distinct !DICompileUnit(language: DW_LANG_C99, file: !567, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !568, splitDebugInlining: false, nameTableKind: None)
!567 = !DIFile(filename: "lib/xgetgroups.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!568 = !{!569, !451}
!569 = !DISubprogram(name: "mgetgroups", scope: !186, file: !186, line: 19, type: !187, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!570 = distinct !DICompileUnit(language: DW_LANG_C99, file: !571, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !572, splitDebugInlining: false, nameTableKind: None)
!571 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!572 = !{!66}
!573 = distinct !DICompileUnit(language: DW_LANG_C99, file: !574, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !575, splitDebugInlining: false, nameTableKind: None)
!574 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!575 = !{!576, !68, !588}
!576 = !DISubprogram(name: "mbrtowc", scope: !435, file: !435, line: 296, type: !577, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!577 = !DISubroutineType(types: !578)
!578 = !{!70, !110, !12, !70, !579}
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !419, line: 13, size: 64, elements: !581)
!581 = !{!582, !583}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !580, file: !419, line: 15, baseType: !14, size: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !580, file: !419, line: 20, baseType: !584, size: 32, offset: 32)
!584 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !580, file: !419, line: 16, size: 32, elements: !585)
!585 = !{!586, !587}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !584, file: !419, line: 18, baseType: !120, size: 32)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !584, file: !419, line: 19, baseType: !427, size: 32)
!588 = !DISubprogram(name: "hard_locale", scope: !589, file: !589, line: 26, type: !590, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!589 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!590 = !DISubroutineType(types: !591)
!591 = !{!131, !14}
!592 = distinct !DICompileUnit(language: DW_LANG_C99, file: !593, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !594, splitDebugInlining: false, nameTableKind: None)
!593 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!594 = !{!595}
!595 = !DISubprogram(name: "rpl_fclose", scope: !596, file: !596, line: 672, type: !597, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!596 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!597 = !DISubroutineType(types: !598)
!598 = !{!14, !599}
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !601)
!601 = !{!602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !600, file: !21, line: 51, baseType: !14, size: 32)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !600, file: !21, line: 54, baseType: !10, size: 64, offset: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !600, file: !21, line: 55, baseType: !10, size: 64, offset: 128)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !600, file: !21, line: 56, baseType: !10, size: 64, offset: 192)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !600, file: !21, line: 57, baseType: !10, size: 64, offset: 256)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !600, file: !21, line: 58, baseType: !10, size: 64, offset: 320)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !600, file: !21, line: 59, baseType: !10, size: 64, offset: 384)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !600, file: !21, line: 60, baseType: !10, size: 64, offset: 448)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !600, file: !21, line: 61, baseType: !10, size: 64, offset: 512)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !600, file: !21, line: 64, baseType: !10, size: 64, offset: 576)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !600, file: !21, line: 65, baseType: !10, size: 64, offset: 640)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !600, file: !21, line: 66, baseType: !10, size: 64, offset: 704)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !600, file: !21, line: 68, baseType: !36, size: 64, offset: 768)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !600, file: !21, line: 70, baseType: !599, size: 64, offset: 832)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !600, file: !21, line: 72, baseType: !14, size: 32, offset: 896)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !600, file: !21, line: 73, baseType: !14, size: 32, offset: 928)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !600, file: !21, line: 74, baseType: !42, size: 64, offset: 960)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !600, file: !21, line: 77, baseType: !46, size: 16, offset: 1024)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !600, file: !21, line: 78, baseType: !48, size: 8, offset: 1040)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !600, file: !21, line: 79, baseType: !50, size: 8, offset: 1048)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !600, file: !21, line: 81, baseType: !54, size: 64, offset: 1088)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !600, file: !21, line: 89, baseType: !57, size: 64, offset: 1152)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !600, file: !21, line: 91, baseType: !59, size: 64, offset: 1216)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !600, file: !21, line: 92, baseType: !62, size: 64, offset: 1280)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !600, file: !21, line: 93, baseType: !599, size: 64, offset: 1344)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !600, file: !21, line: 94, baseType: !66, size: 64, offset: 1408)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !600, file: !21, line: 95, baseType: !68, size: 64, offset: 1472)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !600, file: !21, line: 96, baseType: !14, size: 32, offset: 1536)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !600, file: !21, line: 98, baseType: !73, size: 160, offset: 1568)
!631 = distinct !DICompileUnit(language: DW_LANG_C99, file: !632, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !633, splitDebugInlining: false, nameTableKind: None)
!632 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!633 = !{!634}
!634 = !DISubprogram(name: "setlocale_null_r", scope: !635, file: !635, line: 64, type: !636, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!635 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!636 = !DISubroutineType(types: !637)
!637 = !{!14, !14, !10, !70}
!638 = distinct !DICompileUnit(language: DW_LANG_C99, file: !639, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !640, retainedTypes: !1027, splitDebugInlining: false, nameTableKind: None)
!639 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!640 = !{!641}
!641 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !642, line: 41, baseType: !120, size: 32, elements: !643)
!642 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!643 = !{!644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026}
!644 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!645 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!646 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!647 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!648 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!649 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!650 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!651 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!652 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!653 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!654 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!655 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!656 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!657 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!658 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!659 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!660 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!661 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!662 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!663 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!664 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!665 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!666 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!667 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!668 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!669 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!670 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!671 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!672 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!673 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!674 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!675 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!676 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!677 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!678 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!679 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!680 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!681 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!682 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!683 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!684 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!685 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!686 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!687 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!688 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!689 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!690 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!691 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!692 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!693 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!694 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!695 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!696 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!697 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!698 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!699 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!700 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!701 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!702 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!703 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!704 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!705 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!706 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!707 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!708 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!709 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!710 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!711 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!712 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!713 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!714 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!715 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!716 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!717 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!719 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!720 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!721 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!722 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!723 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!724 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!725 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!726 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!727 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!728 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!729 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!730 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!731 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!732 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!733 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!734 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!735 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!736 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!737 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!738 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!739 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!740 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!741 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!742 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!743 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!744 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!745 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!746 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!747 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!748 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!749 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!750 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!751 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!752 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!753 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!754 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!755 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!756 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!757 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!758 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!759 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!760 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!761 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!762 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!763 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!764 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!765 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!766 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!767 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!768 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!769 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!770 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!771 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!772 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!773 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!774 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!779 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!780 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!781 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!782 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!783 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!784 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!785 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!786 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!787 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!788 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!789 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!790 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!791 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!793 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!794 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!795 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!796 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!797 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!798 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!799 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!800 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!801 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!802 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!803 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!804 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!805 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!806 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!807 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!808 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!809 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!810 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!812 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!813 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!814 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!815 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!816 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!817 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!818 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!819 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!820 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!821 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!822 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!823 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!824 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!825 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!826 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!827 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!828 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!829 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!830 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!831 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!832 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!833 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!834 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!835 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!836 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!837 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!838 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!839 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!840 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!841 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!842 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!843 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!844 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!845 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!846 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!847 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!884 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!885 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!886 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!887 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!894 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!895 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!896 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!898 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!899 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!900 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!901 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!902 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!903 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!904 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!905 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!906 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!907 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!908 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!909 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!910 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!911 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!912 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!913 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!914 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!915 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!916 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!917 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!918 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!919 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!920 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!921 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!922 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!923 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!924 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!925 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!926 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!927 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!928 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!929 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!930 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!931 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!932 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!933 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!934 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!935 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!936 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!937 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!938 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!939 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!940 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!941 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!942 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!943 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!944 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!945 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!946 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!947 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!948 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!949 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!950 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!951 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!952 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!953 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!954 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!955 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!956 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!957 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!958 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!959 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!960 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!961 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!962 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!963 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!964 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!965 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!966 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!967 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!968 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!969 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!970 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!971 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!972 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!973 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!974 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!975 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!976 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!977 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!978 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!979 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!980 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!981 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!982 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!983 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!984 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!985 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!986 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!987 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!988 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!989 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!990 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!991 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!992 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!993 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!994 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!995 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!996 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!997 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!998 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!999 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!1000 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!1001 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!1002 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!1003 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!1004 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!1005 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!1006 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!1007 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!1008 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!1009 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!1010 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!1011 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!1012 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!1013 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!1014 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!1015 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!1016 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!1017 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!1018 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!1019 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
