source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.group = type { i8*, i8*, i32, i8** }
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.passwd = type { i8*, i8*, i32, i32, i8*, i8*, i8* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [37 x i8] c"Usage: %s [OPTION]... [USERNAME]...\0A\00", align 1
@.str.2 = private unnamed_addr constant [155 x i8] c"Print group memberships for each USERNAME or, if no USERNAME is specified, for\0Athe current process (which may differ if the groups database has changed).\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 40, type: !11, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !10, nameTableKind: None)
!3 = !DIFile(filename: "src/groups.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{}
!5 = !{!6, !8, !9}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!9 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!10 = !{!0}
!11 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 768, elements: !24)
!12 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !14, line: 50, size: 256, elements: !15)
!14 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!15 = !{!16, !19, !21, !23}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !13, file: !14, line: 52, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !13, file: !14, line: 55, baseType: !20, size: 32, offset: 64)
!20 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !13, file: !14, line: 56, baseType: !22, size: 64, offset: 128)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !13, file: !14, line: 57, baseType: !20, size: 32, offset: 192)
!24 = !{!25}
!25 = !DISubrange(count: 3)
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(name: "buf", scope: !28, file: !29, line: 96, type: !45, isLocal: true, isDefinition: true)
!28 = distinct !DISubprogram(name: "gidtostr_ptr", scope: !29, file: !29, line: 94, type: !30, scopeLine: 95, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !39, retainedNodes: !43)
!29 = !DIFile(filename: "src/group-list.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!30 = !DISubroutineType(types: !31)
!31 = !{!6, !32}
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !35, line: 64, baseType: !36)
!35 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !37, line: 147, baseType: !38)
!37 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!38 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!39 = distinct !DICompileUnit(language: DW_LANG_C99, file: !29, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !40, globals: !42, nameTableKind: None)
!40 = !{!8, !41, !9}
!41 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!42 = !{!26}
!43 = !{!44}
!44 = !DILocalVariable(name: "gid", arg: 1, scope: !28, file: !29, line: 94, type: !32)
!45 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 168, elements: !46)
!46 = !{!47}
!47 = !DISubrange(count: 21)
!48 = !DIGlobalVariableExpression(var: !49, expr: !DIExpression())
!49 = distinct !DIGlobalVariable(name: "Version", scope: !50, file: !51, line: 2, type: !17, isDefinition: true)
!50 = distinct !DICompileUnit(language: DW_LANG_C99, file: !51, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, globals: !52, nameTableKind: None)
!51 = !DIFile(filename: "src/version.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!52 = !{!48}
!53 = !DIGlobalVariableExpression(var: !54, expr: !DIExpression())
!54 = distinct !DIGlobalVariable(name: "file_name", scope: !55, file: !56, line: 46, type: !17, isLocal: true, isDefinition: true)
!55 = distinct !DICompileUnit(language: DW_LANG_C99, file: !56, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, globals: !57, nameTableKind: None)
!56 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!57 = !{!53, !58}
!58 = !DIGlobalVariableExpression(var: !59, expr: !DIExpression())
!59 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !55, file: !56, line: 56, type: !60, isLocal: true, isDefinition: true)
!60 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!62 = distinct !DIGlobalVariable(name: "exit_failure", scope: !63, file: !64, line: 24, type: !66, isDefinition: true)
!63 = distinct !DICompileUnit(language: DW_LANG_C99, file: !64, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, globals: !65, nameTableKind: None)
!64 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!65 = !{!61}
!66 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !20)
!67 = !DIGlobalVariableExpression(var: !68, expr: !DIExpression())
!68 = distinct !DIGlobalVariable(name: "program_name", scope: !69, file: !70, line: 33, type: !17, isDefinition: true)
!69 = distinct !DICompileUnit(language: DW_LANG_C99, file: !70, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !71, globals: !72, nameTableKind: None)
!70 = !DIFile(filename: "lib/progname.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!71 = !{!8, !6}
!72 = !{!67}
!73 = !DIGlobalVariableExpression(var: !74, expr: !DIExpression())
!74 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !75, file: !76, line: 85, type: !153, isDefinition: true)
!75 = distinct !DICompileUnit(language: DW_LANG_C99, file: !76, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !77, retainedTypes: !112, globals: !116, nameTableKind: None)
!76 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!77 = !{!78, !92, !97}
!78 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !79, line: 32, baseType: !38, size: 32, elements: !80)
!79 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!80 = !{!81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91}
!81 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!82 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!83 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!84 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!85 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!86 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!87 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!88 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!89 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!90 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!91 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!92 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !79, line: 242, baseType: !38, size: 32, elements: !93)
!93 = !{!94, !95, !96}
!94 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!95 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!96 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !98, line: 46, baseType: !38, size: 32, elements: !99)
!98 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!99 = !{!100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111}
!100 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!101 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!102 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!103 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!104 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!105 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!106 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!107 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!108 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!109 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!110 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!111 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!112 = !{!20, !113, !114, !6}
!113 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !115, line: 46, baseType: !41)
!115 = !DIFile(filename: "/usr/lib/clang/12.0.1/include/stddef.h", directory: "")
!116 = !{!73, !117, !123, !135, !137, !142, !149, !151}
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !75, file: !76, line: 101, type: !119, isDefinition: true)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 320, elements: !121)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !78)
!121 = !{!122}
!122 = !DISubrange(count: 10)
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !75, file: !76, line: 1052, type: !125, isDefinition: true)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !76, line: 65, size: 448, elements: !126)
!126 = !{!127, !128, !129, !133, !134}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !125, file: !76, line: 68, baseType: !78, size: 32)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !125, file: !76, line: 71, baseType: !20, size: 32, offset: 32)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !125, file: !76, line: 75, baseType: !130, size: 256, offset: 64)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 256, elements: !131)
!131 = !{!132}
!132 = !DISubrange(count: 8)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !125, file: !76, line: 78, baseType: !17, size: 64, offset: 320)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !125, file: !76, line: 81, baseType: !17, size: 64, offset: 384)
!135 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression())
!136 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !75, file: !76, line: 116, type: !125, isLocal: true, isDefinition: true)
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(name: "slot0", scope: !75, file: !76, line: 842, type: !139, isLocal: true, isDefinition: true)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 2048, elements: !140)
!140 = !{!141}
!141 = !DISubrange(count: 256)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "slotvec", scope: !75, file: !76, line: 845, type: !144, isLocal: true, isDefinition: true)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !76, line: 834, size: 128, elements: !146)
!146 = !{!147, !148}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !145, file: !76, line: 836, baseType: !114, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !145, file: !76, line: 837, baseType: !6, size: 64, offset: 64)
!149 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression())
!150 = distinct !DIGlobalVariable(name: "nslots", scope: !75, file: !76, line: 843, type: !20, isLocal: true, isDefinition: true)
!151 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression())
!152 = distinct !DIGlobalVariable(name: "slotvec0", scope: !75, file: !76, line: 844, type: !145, isLocal: true, isDefinition: true)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 704, elements: !155)
!154 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!155 = !{!156}
!156 = !DISubrange(count: 11)
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!158 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !159, file: !160, line: 26, type: !162, isDefinition: true)
!159 = distinct !DICompileUnit(language: DW_LANG_C99, file: !160, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, globals: !161, nameTableKind: None)
!160 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!161 = !{!157}
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 376, elements: !163)
!163 = !{!164}
!164 = !DISubrange(count: 47)
!165 = distinct !DICompileUnit(language: DW_LANG_C99, file: !166, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !167, nameTableKind: None)
!166 = !DIFile(filename: "lib/umaxtostr.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!167 = !{!168}
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !169, line: 102, baseType: !170)
!169 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !37, line: 73, baseType: !41)
!171 = distinct !DICompileUnit(language: DW_LANG_C99, file: !172, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !173, retainedTypes: !177, nameTableKind: None)
!172 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!173 = !{!174}
!174 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !172, line: 40, baseType: !38, size: 32, elements: !175)
!175 = !{!176}
!176 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!177 = !{!8}
!178 = distinct !DICompileUnit(language: DW_LANG_C99, file: !179, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !180, retainedTypes: !194, nameTableKind: None)
!179 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!180 = !{!181}
!181 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !183, file: !182, line: 186, baseType: !38, size: 32, elements: !192)
!182 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!183 = distinct !DISubprogram(name: "x2nrealloc", scope: !182, file: !182, line: 174, type: !184, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !178, retainedNodes: !187)
!184 = !DISubroutineType(types: !185)
!185 = !{!8, !8, !186, !114}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!187 = !{!188, !189, !190, !191}
!188 = !DILocalVariable(name: "p", arg: 1, scope: !183, file: !182, line: 174, type: !8)
!189 = !DILocalVariable(name: "pn", arg: 2, scope: !183, file: !182, line: 174, type: !186)
!190 = !DILocalVariable(name: "s", arg: 3, scope: !183, file: !182, line: 174, type: !114)
!191 = !DILocalVariable(name: "n", scope: !183, file: !182, line: 176, type: !114)
!192 = !{!193}
!193 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!194 = !{!114, !6, !8}
!195 = distinct !DICompileUnit(language: DW_LANG_C99, file: !196, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!196 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!197 = distinct !DICompileUnit(language: DW_LANG_C99, file: !198, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!198 = !DIFile(filename: "lib/xgetgroups.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!199 = distinct !DICompileUnit(language: DW_LANG_C99, file: !200, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !177, nameTableKind: None)
!200 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!201 = distinct !DICompileUnit(language: DW_LANG_C99, file: !202, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !203, nameTableKind: None)
!202 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!203 = !{!114}
!204 = distinct !DICompileUnit(language: DW_LANG_C99, file: !205, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!205 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!206 = distinct !DICompileUnit(language: DW_LANG_C99, file: !207, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!207 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!208 = distinct !DICompileUnit(language: DW_LANG_C99, file: !209, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !210, retainedTypes: !177, nameTableKind: None)
!209 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!210 = !{!211}
!211 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !212, line: 41, baseType: !38, size: 32, elements: !213)
!212 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!213 = !{!214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596}
!214 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!215 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!216 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!217 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!218 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!219 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!220 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!221 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!222 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!223 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!224 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!225 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!226 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!227 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!228 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!229 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!230 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!231 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!232 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!233 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!234 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!235 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!236 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!237 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!238 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!239 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!240 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!241 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!242 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!243 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!244 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!245 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!246 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!247 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!248 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!249 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!250 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!251 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!252 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!253 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!254 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!255 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!256 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!257 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!258 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!259 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!260 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!261 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!262 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!263 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!264 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!265 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!266 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!267 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!268 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!269 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!270 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!271 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!272 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!273 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!274 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!275 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!276 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!277 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!278 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!279 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!280 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!281 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!282 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!283 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!284 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!285 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!286 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!287 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!288 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!289 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!290 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!291 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!292 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!293 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!294 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!295 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!296 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!297 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!298 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!299 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!300 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!301 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!302 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!303 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!304 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!305 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!306 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!307 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!308 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!309 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!310 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!311 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!312 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!313 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!314 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!315 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!316 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!317 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!318 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!319 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!320 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!321 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!322 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!323 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!324 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!325 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!326 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!327 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!328 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!329 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!330 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!331 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!332 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!333 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!334 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!335 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!336 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!337 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!338 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!339 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!340 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!341 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!342 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!343 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!344 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!345 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!346 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!347 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!348 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!349 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!350 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!351 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!352 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!353 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!354 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!355 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!356 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!357 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!358 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!359 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!360 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!361 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!362 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!363 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!364 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!365 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!366 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!367 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!368 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!369 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!370 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!371 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!372 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!373 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!374 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!375 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!376 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!377 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!378 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!379 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!380 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!381 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!382 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!383 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!384 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!385 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!386 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!387 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!388 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!389 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!390 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!391 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!392 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!393 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!394 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!395 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!396 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!397 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!398 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!399 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!400 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!401 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!402 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!403 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!404 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!405 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!406 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!407 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!408 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!409 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!410 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!411 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!412 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!413 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!414 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!415 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!416 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!417 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!418 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!419 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!420 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!421 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!422 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!423 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!424 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!425 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!426 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!427 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!428 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!429 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!430 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!431 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!432 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!433 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!434 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!435 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!436 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!437 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!438 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!439 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!440 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!441 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!442 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!443 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!444 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!445 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!446 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!447 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!448 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!449 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!450 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!451 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!452 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!453 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!454 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!455 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!456 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!457 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!458 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!459 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!460 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!461 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!462 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!463 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!464 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!465 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!466 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!467 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!468 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!469 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!470 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!471 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!472 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!473 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!474 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!475 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!476 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!477 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!478 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!479 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!480 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!481 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!482 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!483 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!484 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!485 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!486 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!487 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!488 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!489 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!490 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!491 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!492 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!493 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!494 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!495 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!496 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!497 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!498 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!499 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!500 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!501 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!502 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!503 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!504 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!505 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!506 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!507 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!508 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!509 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!510 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!511 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!512 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!513 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!514 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!515 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!516 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!517 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!518 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!519 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!520 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!521 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!522 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!523 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!524 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!525 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!526 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!527 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!528 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!529 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!530 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!531 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!532 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!533 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!534 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!535 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!536 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!537 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!538 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!539 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!540 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!541 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!542 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!543 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!544 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!545 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!546 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!547 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!548 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!549 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!550 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!551 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!552 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!553 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!554 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!555 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!556 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!557 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!558 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!559 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!560 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!561 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!562 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!563 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!564 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!565 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!566 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!567 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!568 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!569 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!570 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!571 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!572 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!573 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!574 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!575 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!576 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!577 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!578 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!579 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!580 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!581 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!582 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!583 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!584 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!585 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!586 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!587 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!588 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!589 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!590 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!591 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!592 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!593 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!594 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!595 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!596 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!597 = distinct !DICompileUnit(language: DW_LANG_C99, file: !598, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !599, retainedTypes: !631, nameTableKind: None)
!598 = !DIFile(filename: "lib/mgetgroups.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!599 = !{!600}
!600 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !601, file: !598, line: 83, baseType: !38, size: 32, elements: !629)
!601 = distinct !DISubprogram(name: "mgetgroups", scope: !598, file: !598, line: 66, type: !602, scopeLine: 67, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !597, retainedNodes: !606)
!602 = !DISubroutineType(types: !603)
!603 = !{!20, !17, !34, !604}
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!606 = !{!607, !608, !609, !610, !611, !612, !613, !617, !618, !621, !624, !627, !628}
!607 = !DILocalVariable(name: "username", arg: 1, scope: !601, file: !598, line: 66, type: !17)
!608 = !DILocalVariable(name: "gid", arg: 2, scope: !601, file: !598, line: 66, type: !34)
!609 = !DILocalVariable(name: "groups", arg: 3, scope: !601, file: !598, line: 66, type: !604)
!610 = !DILocalVariable(name: "max_n_groups", scope: !601, file: !598, line: 68, type: !20)
!611 = !DILocalVariable(name: "ng", scope: !601, file: !598, line: 69, type: !20)
!612 = !DILocalVariable(name: "g", scope: !601, file: !598, line: 70, type: !605)
!613 = !DILocalVariable(name: "h", scope: !614, file: !598, line: 92, type: !605)
!614 = distinct !DILexicalBlock(scope: !615, file: !598, line: 91, column: 9)
!615 = distinct !DILexicalBlock(scope: !616, file: !598, line: 82, column: 5)
!616 = distinct !DILexicalBlock(scope: !601, file: !598, line: 81, column: 7)
!617 = !DILocalVariable(name: "last_n_groups", scope: !614, file: !598, line: 93, type: !20)
!618 = !DILocalVariable(name: "saved_errno", scope: !619, file: !598, line: 105, type: !20)
!619 = distinct !DILexicalBlock(scope: !620, file: !598, line: 104, column: 13)
!620 = distinct !DILexicalBlock(scope: !614, file: !598, line: 103, column: 15)
!621 = !DILocalVariable(name: "saved_errno", scope: !622, file: !598, line: 156, type: !20)
!622 = distinct !DILexicalBlock(scope: !623, file: !598, line: 154, column: 5)
!623 = distinct !DILexicalBlock(scope: !601, file: !598, line: 153, column: 7)
!624 = !DILocalVariable(name: "first", scope: !625, file: !598, line: 187, type: !34)
!625 = distinct !DILexicalBlock(scope: !626, file: !598, line: 186, column: 5)
!626 = distinct !DILexicalBlock(scope: !601, file: !598, line: 185, column: 7)
!627 = !DILocalVariable(name: "next", scope: !625, file: !598, line: 188, type: !605)
!628 = !DILocalVariable(name: "groups_end", scope: !625, file: !598, line: 189, type: !605)
!629 = !{!630}
!630 = !DIEnumerator(name: "N_GROUPS_INIT", value: 10, isUnsigned: true)
!631 = !{!8, !34, !114}
!632 = distinct !DICompileUnit(language: DW_LANG_C99, file: !633, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !177, nameTableKind: None)
!633 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!634 = distinct !DICompileUnit(language: DW_LANG_C99, file: !635, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!635 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!636 = distinct !DICompileUnit(language: DW_LANG_C99, file: !637, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !177, nameTableKind: None)
!637 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!638 = distinct !DICompileUnit(language: DW_LANG_C99, file: !639, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !177, nameTableKind: None)
!639 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!640 = !{!"clang version 12.0.1"}
!641 = !{i32 7, !"Dwarf Version", i32 4}
!642 = !{i32 2, !"Debug Info Version", i32 3}
!643 = !{i32 1, !"wchar_size", i32 4}
!644 = !{i32 7, !"PIC Level", i32 2}
!645 = !{i32 7, !"PIE Level", i32 2}
!646 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 48, type: !647, scopeLine: 49, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !649)
!647 = !DISubroutineType(types: !648)
!648 = !{null, !20}
!649 = !{!650}
!650 = !DILocalVariable(name: "status", arg: 1, scope: !646, file: !3, line: 48, type: !20)
!651 = !DILocation(scope: !646)
!652 = !DILocation(line: 50, column: 14, scope: !653)
!653 = distinct !DILexicalBlock(scope: !646, file: !3, line: 50, column: 7)
!654 = !DILocation(line: 50, column: 7, scope: !646)
!655 = !DILocation(line: 51, column: 5, scope: !656)
!656 = distinct !DILexicalBlock(scope: !653, file: !3, line: 51, column: 5)
!657 = !{!658, !658, i64 0}
!658 = !{!"any pointer", !659, i64 0}
!659 = !{!"omnipotent char", !660, i64 0}
!660 = !{!"Simple C/C++ TBAA"}
!661 = !DILocation(line: 54, column: 7, scope: !662)
!662 = distinct !DILexicalBlock(scope: !653, file: !3, line: 53, column: 5)
!663 = !DILocation(line: 55, column: 7, scope: !662)
!664 = !DILocation(line: 60, column: 7, scope: !662)
!665 = !DILocation(line: 61, column: 7, scope: !662)
!666 = !DILocalVariable(name: "program", arg: 1, scope: !667, file: !668, line: 634, type: !17)
!667 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !668, file: !668, line: 634, type: !669, scopeLine: 635, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !671)
!668 = !DIFile(filename: "src/system.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!669 = !DISubroutineType(types: !670)
!670 = !{null, !17}
!671 = !{!666, !672, !681, !682, !684}
!672 = !DILocalVariable(name: "infomap", scope: !667, file: !668, line: 636, type: !673)
!673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !674, size: 896, elements: !679)
!674 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !675)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !667, file: !668, line: 636, size: 128, elements: !676)
!676 = !{!677, !678}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !675, file: !668, line: 636, baseType: !17, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !675, file: !668, line: 636, baseType: !17, size: 64, offset: 64)
!679 = !{!680}
!680 = !DISubrange(count: 7)
!681 = !DILocalVariable(name: "node", scope: !667, file: !668, line: 646, type: !17)
!682 = !DILocalVariable(name: "map_prog", scope: !667, file: !668, line: 647, type: !683)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!684 = !DILocalVariable(name: "lc_messages", scope: !667, file: !668, line: 659, type: !17)
!685 = !DILocation(scope: !667, inlinedAt: !686)
!686 = distinct !DILocation(line: 62, column: 7, scope: !662)
!687 = !DILocation(line: 636, column: 3, scope: !667, inlinedAt: !686)
!688 = !DILocation(line: 636, column: 67, scope: !667, inlinedAt: !686)
!689 = !DILocation(line: 647, column: 36, scope: !667, inlinedAt: !686)
!690 = !DILocation(line: 649, column: 3, scope: !667, inlinedAt: !686)
!691 = !DILocation(line: 649, column: 33, scope: !667, inlinedAt: !686)
!692 = !DILocation(line: 650, column: 13, scope: !667, inlinedAt: !686)
!693 = !DILocation(line: 649, column: 20, scope: !667, inlinedAt: !686)
!694 = !{!695, !658, i64 0}
!695 = !{!"infomap", !658, i64 0, !658, i64 8}
!696 = !DILocation(line: 649, column: 10, scope: !667, inlinedAt: !686)
!697 = !DILocation(line: 649, column: 28, scope: !667, inlinedAt: !686)
!698 = distinct !{!698, !690, !692, !699}
!699 = !{!"llvm.loop.mustprogress"}
!700 = !DILocation(line: 652, column: 17, scope: !701, inlinedAt: !686)
!701 = distinct !DILexicalBlock(scope: !667, file: !668, line: 652, column: 7)
!702 = !{!695, !658, i64 8}
!703 = !DILocation(line: 652, column: 7, scope: !701, inlinedAt: !686)
!704 = !DILocation(line: 652, column: 7, scope: !667, inlinedAt: !686)
!705 = !DILocation(line: 655, column: 3, scope: !667, inlinedAt: !686)
!706 = !DILocation(line: 659, column: 29, scope: !667, inlinedAt: !686)
!707 = !DILocation(line: 660, column: 7, scope: !708, inlinedAt: !686)
!708 = distinct !DILexicalBlock(scope: !667, file: !668, line: 660, column: 7)
!709 = !DILocation(line: 660, column: 19, scope: !708, inlinedAt: !686)
!710 = !DILocation(line: 660, column: 22, scope: !708, inlinedAt: !686)
!711 = !DILocation(line: 660, column: 7, scope: !667, inlinedAt: !686)
!712 = !DILocation(line: 666, column: 7, scope: !713, inlinedAt: !686)
!713 = distinct !DILexicalBlock(scope: !708, file: !668, line: 661, column: 5)
!714 = !DILocation(line: 668, column: 5, scope: !713, inlinedAt: !686)
!715 = !DILocation(line: 669, column: 3, scope: !667, inlinedAt: !686)
!716 = !DILocation(line: 671, column: 3, scope: !667, inlinedAt: !686)
!717 = !DILocation(line: 673, column: 1, scope: !667, inlinedAt: !686)
!718 = !DILocation(line: 64, column: 3, scope: !646)
!719 = !DISubprogram(name: "dcgettext", scope: !720, file: !720, line: 51, type: !721, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!720 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!721 = !DISubroutineType(types: !722)
!722 = !{!6, !17, !17, !20}
!723 = !DISubprogram(name: "fputs_unlocked", scope: !724, file: !724, line: 667, type: !725, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!724 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!725 = !DISubroutineType(types: !726)
!726 = !{!20, !17, !727}
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !729, line: 49, size: 1728, elements: !730)
!729 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!730 = !{!731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !746, !747, !748, !749, !752, !753, !755, !759, !762, !764, !767, !770, !771, !772, !773, !774}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !728, file: !729, line: 51, baseType: !20, size: 32)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !728, file: !729, line: 54, baseType: !6, size: 64, offset: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !728, file: !729, line: 55, baseType: !6, size: 64, offset: 128)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !728, file: !729, line: 56, baseType: !6, size: 64, offset: 192)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !728, file: !729, line: 57, baseType: !6, size: 64, offset: 256)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !728, file: !729, line: 58, baseType: !6, size: 64, offset: 320)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !728, file: !729, line: 59, baseType: !6, size: 64, offset: 384)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !728, file: !729, line: 60, baseType: !6, size: 64, offset: 448)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !728, file: !729, line: 61, baseType: !6, size: 64, offset: 512)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !728, file: !729, line: 64, baseType: !6, size: 64, offset: 576)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !728, file: !729, line: 65, baseType: !6, size: 64, offset: 640)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !728, file: !729, line: 66, baseType: !6, size: 64, offset: 704)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !728, file: !729, line: 68, baseType: !744, size: 64, offset: 768)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !729, line: 36, flags: DIFlagFwdDecl)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !728, file: !729, line: 70, baseType: !727, size: 64, offset: 832)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !728, file: !729, line: 72, baseType: !20, size: 32, offset: 896)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !728, file: !729, line: 73, baseType: !20, size: 32, offset: 928)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !728, file: !729, line: 74, baseType: !750, size: 64, offset: 960)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !37, line: 152, baseType: !751)
!751 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !728, file: !729, line: 77, baseType: !113, size: 16, offset: 1024)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !728, file: !729, line: 78, baseType: !754, size: 8, offset: 1040)
!754 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !728, file: !729, line: 79, baseType: !756, size: 8, offset: 1048)
!756 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 8, elements: !757)
!757 = !{!758}
!758 = !DISubrange(count: 1)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !728, file: !729, line: 81, baseType: !760, size: 64, offset: 1088)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !729, line: 43, baseType: null)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !728, file: !729, line: 89, baseType: !763, size: 64, offset: 1152)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !37, line: 153, baseType: !751)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !728, file: !729, line: 91, baseType: !765, size: 64, offset: 1216)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !729, line: 37, flags: DIFlagFwdDecl)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !728, file: !729, line: 92, baseType: !768, size: 64, offset: 1280)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !729, line: 38, flags: DIFlagFwdDecl)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !728, file: !729, line: 93, baseType: !727, size: 64, offset: 1344)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !728, file: !729, line: 94, baseType: !8, size: 64, offset: 1408)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !728, file: !729, line: 95, baseType: !114, size: 64, offset: 1472)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !728, file: !729, line: 96, baseType: !20, size: 32, offset: 1536)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !728, file: !729, line: 98, baseType: !775, size: 160, offset: 1568)
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 160, elements: !776)
!776 = !{!777}
!777 = !DISubrange(count: 20)
!778 = !DISubprogram(name: "setlocale", scope: !779, file: !779, line: 122, type: !780, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!779 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!780 = !DISubroutineType(types: !781)
!781 = !{!6, !20, !17}
!782 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 68, type: !783, scopeLine: 69, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !786)
!783 = !DISubroutineType(types: !784)
!784 = !{!20, !20, !785}
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!786 = !{!787, !788, !789, !790, !791, !792, !793, !796, !799, !800}
!787 = !DILocalVariable(name: "argc", arg: 1, scope: !782, file: !3, line: 68, type: !20)
!788 = !DILocalVariable(name: "argv", arg: 2, scope: !782, file: !3, line: 68, type: !785)
!789 = !DILocalVariable(name: "optc", scope: !782, file: !3, line: 70, type: !20)
!790 = !DILocalVariable(name: "ok", scope: !782, file: !3, line: 71, type: !60)
!791 = !DILocalVariable(name: "rgid", scope: !782, file: !3, line: 72, type: !34)
!792 = !DILocalVariable(name: "egid", scope: !782, file: !3, line: 72, type: !34)
!793 = !DILocalVariable(name: "ruid", scope: !782, file: !3, line: 73, type: !794)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !35, line: 79, baseType: !795)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !37, line: 146, baseType: !38)
!796 = !DILocalVariable(name: "NO_UID", scope: !797, file: !3, line: 100, type: !794)
!797 = distinct !DILexicalBlock(scope: !798, file: !3, line: 98, column: 5)
!798 = distinct !DILexicalBlock(scope: !782, file: !3, line: 97, column: 7)
!799 = !DILocalVariable(name: "NO_GID", scope: !797, file: !3, line: 101, type: !34)
!800 = !DILocalVariable(name: "pwd", scope: !801, file: !3, line: 127, type: !805)
!801 = distinct !DILexicalBlock(scope: !802, file: !3, line: 126, column: 9)
!802 = distinct !DILexicalBlock(scope: !803, file: !3, line: 125, column: 7)
!803 = distinct !DILexicalBlock(scope: !804, file: !3, line: 125, column: 7)
!804 = distinct !DILexicalBlock(scope: !798, file: !3, line: 123, column: 5)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !807, line: 49, size: 384, elements: !808)
!807 = !DIFile(filename: "/usr/include/pwd.h", directory: "")
!808 = !{!809, !810, !811, !812, !813, !814, !815}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !806, file: !807, line: 51, baseType: !6, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !806, file: !807, line: 52, baseType: !6, size: 64, offset: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !806, file: !807, line: 54, baseType: !795, size: 32, offset: 128)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !806, file: !807, line: 55, baseType: !36, size: 32, offset: 160)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !806, file: !807, line: 56, baseType: !6, size: 64, offset: 192)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !806, file: !807, line: 57, baseType: !6, size: 64, offset: 256)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !806, file: !807, line: 58, baseType: !6, size: 64, offset: 320)
!816 = !DILocation(scope: !782)
!817 = !DILocation(line: 76, column: 21, scope: !782)
!818 = !DILocation(line: 76, column: 3, scope: !782)
!819 = !DILocation(line: 77, column: 3, scope: !782)
!820 = !DILocation(line: 78, column: 3, scope: !782)
!821 = !DILocation(line: 79, column: 3, scope: !782)
!822 = !DILocation(line: 81, column: 3, scope: !782)
!823 = !DILocation(line: 86, column: 18, scope: !782)
!824 = !DILocation(line: 86, column: 3, scope: !782)
!825 = !DILocation(line: 90, column: 9, scope: !826)
!826 = distinct !DILexicalBlock(scope: !827, file: !3, line: 89, column: 9)
!827 = distinct !DILexicalBlock(scope: !782, file: !3, line: 87, column: 5)
!828 = !DILocation(line: 91, column: 9, scope: !826)
!829 = !DILocation(line: 93, column: 11, scope: !826)
!830 = !DILocation(line: 97, column: 7, scope: !798)
!831 = !{!832, !832, i64 0}
!832 = !{!"int", !659, i64 0}
!833 = !DILocation(line: 97, column: 14, scope: !798)
!834 = !DILocation(line: 97, column: 7, scope: !782)
!835 = !DILocation(line: 125, column: 22, scope: !802)
!836 = !DILocation(line: 125, column: 7, scope: !803)
!837 = !DILocation(scope: !797)
!838 = !DILocation(line: 103, column: 7, scope: !797)
!839 = !DILocation(line: 103, column: 13, scope: !797)
!840 = !DILocation(line: 104, column: 14, scope: !797)
!841 = !DILocation(line: 105, column: 16, scope: !842)
!842 = distinct !DILexicalBlock(scope: !797, file: !3, line: 105, column: 11)
!843 = !DILocation(line: 105, column: 26, scope: !842)
!844 = !DILocation(line: 105, column: 29, scope: !842)
!845 = !DILocation(line: 105, column: 11, scope: !797)
!846 = !DILocation(line: 106, column: 9, scope: !842)
!847 = !DILocation(line: 108, column: 13, scope: !797)
!848 = !DILocation(line: 109, column: 14, scope: !797)
!849 = !DILocation(line: 110, column: 16, scope: !850)
!850 = distinct !DILexicalBlock(scope: !797, file: !3, line: 110, column: 11)
!851 = !DILocation(line: 110, column: 26, scope: !850)
!852 = !DILocation(line: 110, column: 29, scope: !850)
!853 = !DILocation(line: 110, column: 11, scope: !797)
!854 = !DILocation(line: 111, column: 9, scope: !850)
!855 = !DILocation(line: 113, column: 13, scope: !797)
!856 = !DILocation(line: 114, column: 14, scope: !797)
!857 = !DILocation(line: 115, column: 16, scope: !858)
!858 = distinct !DILexicalBlock(scope: !797, file: !3, line: 115, column: 11)
!859 = !DILocation(line: 115, column: 26, scope: !858)
!860 = !DILocation(line: 115, column: 29, scope: !858)
!861 = !DILocation(line: 115, column: 11, scope: !797)
!862 = !DILocation(line: 116, column: 9, scope: !858)
!863 = !DILocation(line: 118, column: 12, scope: !864)
!864 = distinct !DILexicalBlock(scope: !797, file: !3, line: 118, column: 11)
!865 = !DILocation(line: 118, column: 11, scope: !797)
!866 = !DILocalVariable(name: "__c", arg: 1, scope: !867, file: !868, line: 108, type: !20)
!867 = distinct !DISubprogram(name: "putchar_unlocked", scope: !868, file: !868, line: 108, type: !869, scopeLine: 109, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !871)
!868 = !DIFile(filename: "/usr/include/bits/stdio.h", directory: "")
!869 = !DISubroutineType(types: !870)
!870 = !{!20, !20}
!871 = !{!866}
!872 = !DILocation(scope: !867, inlinedAt: !873)
!873 = distinct !DILocation(line: 120, column: 7, scope: !797)
!874 = !DILocation(line: 110, column: 10, scope: !867, inlinedAt: !873)
!875 = !{!876, !658, i64 40}
!876 = !{!"_IO_FILE", !832, i64 0, !658, i64 8, !658, i64 16, !658, i64 24, !658, i64 32, !658, i64 40, !658, i64 48, !658, i64 56, !658, i64 64, !658, i64 72, !658, i64 80, !658, i64 88, !658, i64 96, !658, i64 104, !832, i64 112, !832, i64 116, !877, i64 120, !878, i64 128, !659, i64 130, !659, i64 131, !658, i64 136, !877, i64 144, !658, i64 152, !658, i64 160, !658, i64 168, !658, i64 176, !877, i64 184, !832, i64 192, !659, i64 196}
!877 = !{!"long", !659, i64 0}
!878 = !{!"short", !659, i64 0}
!879 = !{!876, !658, i64 48}
!880 = !{!"branch_weights", i32 2000, i32 1}
!881 = !{!659, !659, i64 0}
!882 = !DILocation(line: 127, column: 42, scope: !801)
!883 = !DILocation(line: 127, column: 32, scope: !801)
!884 = !DILocation(scope: !801)
!885 = !DILocation(line: 128, column: 19, scope: !886)
!886 = distinct !DILexicalBlock(scope: !801, file: !3, line: 128, column: 15)
!887 = !DILocation(line: 128, column: 15, scope: !801)
!888 = !DILocation(line: 130, column: 28, scope: !889)
!889 = distinct !DILexicalBlock(scope: !886, file: !3, line: 129, column: 13)
!890 = !DILocation(line: 130, column: 63, scope: !889)
!891 = !DILocation(line: 130, column: 58, scope: !889)
!892 = !DILocation(line: 130, column: 51, scope: !889)
!893 = !DILocation(line: 130, column: 15, scope: !889)
!894 = !DILocation(line: 132, column: 15, scope: !889)
!895 = !DILocation(line: 134, column: 23, scope: !801)
!896 = !{!897, !832, i64 16}
!897 = !{!"passwd", !658, i64 0, !658, i64 8, !832, i64 16, !832, i64 20, !658, i64 24, !658, i64 32, !658, i64 40}
!898 = !DILocation(line: 135, column: 30, scope: !801)
!899 = !{!897, !832, i64 20}
!900 = !DILocation(line: 137, column: 11, scope: !801)
!901 = !DILocation(line: 138, column: 39, scope: !902)
!902 = distinct !DILexicalBlock(scope: !801, file: !3, line: 138, column: 15)
!903 = !DILocation(line: 138, column: 34, scope: !902)
!904 = !DILocation(line: 138, column: 16, scope: !902)
!905 = !DILocation(line: 138, column: 15, scope: !801)
!906 = !DILocation(scope: !867, inlinedAt: !907)
!907 = distinct !DILocation(line: 140, column: 11, scope: !801)
!908 = !DILocation(line: 110, column: 10, scope: !867, inlinedAt: !907)
!909 = !DILocation(line: 125, column: 36, scope: !802)
!910 = distinct !{!910, !836, !911, !699}
!911 = !DILocation(line: 141, column: 9, scope: !803)
!912 = !DILocation(line: 71, column: 8, scope: !782)
!913 = !DILocation(line: 144, column: 10, scope: !782)
!914 = !DILocation(line: 145, column: 1, scope: !782)
!915 = !DISubprogram(name: "bindtextdomain", scope: !720, file: !720, line: 86, type: !916, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!916 = !DISubroutineType(types: !917)
!917 = !{!6, !17, !17}
!918 = !DISubprogram(name: "textdomain", scope: !720, file: !720, line: 82, type: !919, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!919 = !DISubroutineType(types: !920)
!920 = !{!6, !17}
!921 = !DISubprogram(name: "atexit", scope: !922, file: !922, line: 595, type: !923, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!922 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!923 = !DISubroutineType(types: !924)
!924 = !{!20, !925}
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DISubroutineType(types: !927)
!927 = !{null}
!928 = !DISubprogram(name: "getopt_long", scope: !14, file: !14, line: 66, type: !929, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!929 = !DISubroutineType(types: !930)
!930 = !{!20, !20, !931, !17, !933, !22}
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!934 = !DISubprogram(name: "getuid", scope: !935, file: !935, line: 687, type: !936, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!935 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!936 = !DISubroutineType(types: !937)
!937 = !{!38}
!938 = !DISubprogram(name: "error", scope: !939, file: !939, line: 52, type: !940, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!939 = !DIFile(filename: "./lib/error.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!940 = !DISubroutineType(types: !941)
!941 = !{null, !20, !20, !17, null}
!942 = !DISubprogram(name: "getegid", scope: !935, file: !935, line: 696, type: !936, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!943 = !DISubprogram(name: "getgid", scope: !935, file: !935, line: 693, type: !936, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!944 = !DISubprogram(name: "getpwnam", scope: !807, file: !807, line: 116, type: !945, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!945 = !DISubroutineType(types: !946)
!946 = !{!805, !17}
!947 = distinct !DISubprogram(name: "print_group_list", scope: !29, file: !29, line: 36, type: !948, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !39, retainedNodes: !950)
!948 = !DISubroutineType(types: !949)
!949 = !{!60, !17, !794, !34, !34, !60, !7}
!950 = !{!951, !952, !953, !954, !955, !956, !957, !958, !969, !971, !972}
!951 = !DILocalVariable(name: "username", arg: 1, scope: !947, file: !29, line: 36, type: !17)
!952 = !DILocalVariable(name: "ruid", arg: 2, scope: !947, file: !29, line: 37, type: !794)
!953 = !DILocalVariable(name: "rgid", arg: 3, scope: !947, file: !29, line: 37, type: !34)
!954 = !DILocalVariable(name: "egid", arg: 4, scope: !947, file: !29, line: 37, type: !34)
!955 = !DILocalVariable(name: "use_names", arg: 5, scope: !947, file: !29, line: 38, type: !60)
!956 = !DILocalVariable(name: "delim", arg: 6, scope: !947, file: !29, line: 38, type: !7)
!957 = !DILocalVariable(name: "ok", scope: !947, file: !29, line: 40, type: !60)
!958 = !DILocalVariable(name: "pwd", scope: !947, file: !29, line: 41, type: !959)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !807, line: 49, size: 384, elements: !961)
!961 = !{!962, !963, !964, !965, !966, !967, !968}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !960, file: !807, line: 51, baseType: !6, size: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !960, file: !807, line: 52, baseType: !6, size: 64, offset: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !960, file: !807, line: 54, baseType: !795, size: 32, offset: 128)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !960, file: !807, line: 55, baseType: !36, size: 32, offset: 160)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !960, file: !807, line: 56, baseType: !6, size: 64, offset: 192)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !960, file: !807, line: 57, baseType: !6, size: 64, offset: 256)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !960, file: !807, line: 58, baseType: !6, size: 64, offset: 320)
!969 = !DILocalVariable(name: "groups", scope: !970, file: !29, line: 61, type: !605)
!970 = distinct !DILexicalBlock(scope: !947, file: !29, line: 60, column: 3)
!971 = !DILocalVariable(name: "n_groups", scope: !970, file: !29, line: 63, type: !20)
!972 = !DILocalVariable(name: "i", scope: !973, file: !29, line: 78, type: !20)
!973 = distinct !DILexicalBlock(scope: !970, file: !29, line: 78, column: 5)
!974 = !DILocation(scope: !947)
!975 = !DILocation(line: 43, column: 7, scope: !976)
!976 = distinct !DILexicalBlock(scope: !947, file: !29, line: 43, column: 7)
!977 = !DILocation(line: 43, column: 7, scope: !947)
!978 = !DILocation(line: 45, column: 13, scope: !979)
!979 = distinct !DILexicalBlock(scope: !976, file: !29, line: 44, column: 5)
!980 = !DILocation(line: 46, column: 15, scope: !981)
!981 = distinct !DILexicalBlock(scope: !979, file: !29, line: 46, column: 11)
!982 = !DILocation(line: 46, column: 11, scope: !979)
!983 = !DILocalVariable(name: "gid", arg: 1, scope: !984, file: !29, line: 103, type: !34)
!984 = distinct !DISubprogram(name: "print_group", scope: !29, file: !29, line: 103, type: !985, scopeLine: 104, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !39, retainedNodes: !987)
!985 = !DISubroutineType(types: !986)
!986 = !{!60, !34, !60}
!987 = !{!983, !988, !989, !998, !999}
!988 = !DILocalVariable(name: "use_name", arg: 2, scope: !984, file: !29, line: 103, type: !60)
!989 = !DILocalVariable(name: "grp", scope: !984, file: !29, line: 105, type: !990)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "group", file: !992, line: 42, size: 256, elements: !993)
!992 = !DIFile(filename: "/usr/include/grp.h", directory: "")
!993 = !{!994, !995, !996, !997}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "gr_name", scope: !991, file: !992, line: 44, baseType: !6, size: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "gr_passwd", scope: !991, file: !992, line: 45, baseType: !6, size: 64, offset: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "gr_gid", scope: !991, file: !992, line: 46, baseType: !36, size: 32, offset: 128)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "gr_mem", scope: !991, file: !992, line: 47, baseType: !785, size: 64, offset: 192)
!998 = !DILocalVariable(name: "ok", scope: !984, file: !29, line: 106, type: !60)
!999 = !DILocalVariable(name: "s", scope: !984, file: !29, line: 119, type: !6)
!1000 = !DILocation(scope: !984, inlinedAt: !1001)
!1001 = distinct !DILocation(line: 50, column: 8, scope: !1002)
!1002 = distinct !DILexicalBlock(scope: !947, file: !29, line: 50, column: 7)
!1003 = !DILocation(line: 108, column: 7, scope: !984, inlinedAt: !1001)
!1004 = !DILocation(line: 97, column: 21, scope: !28, inlinedAt: !1005)
!1005 = distinct !DILocation(line: 119, column: 34, scope: !984, inlinedAt: !1001)
!1006 = !DILocation(line: 110, column: 13, scope: !1007, inlinedAt: !1001)
!1007 = distinct !DILexicalBlock(scope: !1008, file: !29, line: 109, column: 5)
!1008 = distinct !DILexicalBlock(scope: !984, file: !29, line: 108, column: 7)
!1009 = !DILocation(line: 111, column: 15, scope: !1010, inlinedAt: !1001)
!1010 = distinct !DILexicalBlock(scope: !1007, file: !29, line: 111, column: 11)
!1011 = !DILocation(line: 111, column: 11, scope: !1007, inlinedAt: !1001)
!1012 = !DILocation(line: 113, column: 24, scope: !1013, inlinedAt: !1001)
!1013 = distinct !DILexicalBlock(scope: !1010, file: !29, line: 112, column: 9)
!1014 = !DILocation(line: 114, column: 18, scope: !1013, inlinedAt: !1001)
!1015 = !DILocation(line: 113, column: 11, scope: !1013, inlinedAt: !1001)
!1016 = !DILocation(line: 116, column: 9, scope: !1013, inlinedAt: !1001)
!1017 = !DILocation(line: 119, column: 24, scope: !984, inlinedAt: !1001)
!1018 = !{!1019, !658, i64 0}
!1019 = !{!"group", !658, i64 0, !658, i64 8, !832, i64 16, !658, i64 24}
!1020 = !DILocation(line: 120, column: 3, scope: !984, inlinedAt: !1001)
!1021 = !DILocation(line: 50, column: 7, scope: !947)
!1022 = !DILocation(scope: !28, inlinedAt: !1005)
!1023 = !DILocation(line: 97, column: 10, scope: !28, inlinedAt: !1005)
!1024 = !DILocation(line: 53, column: 12, scope: !1025)
!1025 = distinct !DILexicalBlock(scope: !947, file: !29, line: 53, column: 7)
!1026 = !DILocation(line: 53, column: 7, scope: !947)
!1027 = !DILocalVariable(name: "__c", arg: 1, scope: !1028, file: !868, line: 108, type: !20)
!1028 = distinct !DISubprogram(name: "putchar_unlocked", scope: !868, file: !868, line: 108, type: !869, scopeLine: 109, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !39, retainedNodes: !1029)
!1029 = !{!1027}
!1030 = !DILocation(scope: !1028, inlinedAt: !1031)
!1031 = distinct !DILocation(line: 55, column: 7, scope: !1032)
!1032 = distinct !DILexicalBlock(scope: !1025, file: !29, line: 54, column: 5)
!1033 = !DILocation(line: 110, column: 10, scope: !1028, inlinedAt: !1031)
!1034 = !DILocation(line: 55, column: 7, scope: !1032)
!1035 = !DILocation(scope: !984, inlinedAt: !1036)
!1036 = distinct !DILocation(line: 56, column: 12, scope: !1037)
!1037 = distinct !DILexicalBlock(scope: !1032, file: !29, line: 56, column: 11)
!1038 = !DILocation(line: 108, column: 7, scope: !984, inlinedAt: !1036)
!1039 = !DILocation(line: 97, column: 21, scope: !28, inlinedAt: !1040)
!1040 = distinct !DILocation(line: 119, column: 34, scope: !984, inlinedAt: !1036)
!1041 = !DILocation(line: 110, column: 13, scope: !1007, inlinedAt: !1036)
!1042 = !DILocation(line: 111, column: 15, scope: !1010, inlinedAt: !1036)
!1043 = !DILocation(line: 111, column: 11, scope: !1007, inlinedAt: !1036)
!1044 = !DILocation(line: 113, column: 24, scope: !1013, inlinedAt: !1036)
!1045 = !DILocation(line: 114, column: 18, scope: !1013, inlinedAt: !1036)
!1046 = !DILocation(line: 113, column: 11, scope: !1013, inlinedAt: !1036)
!1047 = !DILocation(line: 116, column: 9, scope: !1013, inlinedAt: !1036)
!1048 = !DILocation(line: 119, column: 24, scope: !984, inlinedAt: !1036)
!1049 = !DILocation(line: 120, column: 3, scope: !984, inlinedAt: !1036)
!1050 = !DILocation(line: 56, column: 11, scope: !1032)
!1051 = !DILocation(scope: !28, inlinedAt: !1040)
!1052 = !DILocation(line: 97, column: 10, scope: !28, inlinedAt: !1040)
!1053 = !DILocation(line: 61, column: 5, scope: !970)
!1054 = !DILocation(line: 63, column: 43, scope: !970)
!1055 = !DILocation(line: 63, column: 54, scope: !970)
!1056 = !DILocation(scope: !970)
!1057 = !DILocation(line: 63, column: 20, scope: !970)
!1058 = !DILocation(line: 64, column: 18, scope: !1059)
!1059 = distinct !DILexicalBlock(scope: !970, file: !29, line: 64, column: 9)
!1060 = !DILocation(line: 64, column: 9, scope: !970)
!1061 = !DILocation(scope: !973)
!1062 = !DILocation(line: 78, column: 23, scope: !1063)
!1063 = distinct !DILexicalBlock(scope: !973, file: !29, line: 78, column: 5)
!1064 = !DILocation(line: 78, column: 5, scope: !973)
!1065 = !DILocation(scope: !1066)
!1066 = distinct !DILexicalBlock(scope: !1067, file: !29, line: 66, column: 13)
!1067 = distinct !DILexicalBlock(scope: !1059, file: !29, line: 65, column: 7)
!1068 = !DILocation(line: 66, column: 13, scope: !1067)
!1069 = !DILocation(line: 68, column: 30, scope: !1070)
!1070 = distinct !DILexicalBlock(scope: !1066, file: !29, line: 67, column: 11)
!1071 = !DILocation(line: 69, column: 20, scope: !1070)
!1072 = !DILocation(line: 68, column: 13, scope: !1070)
!1073 = !DILocation(line: 70, column: 11, scope: !1070)
!1074 = !DILocation(line: 73, column: 30, scope: !1075)
!1075 = distinct !DILexicalBlock(scope: !1066, file: !29, line: 72, column: 11)
!1076 = !DILocation(line: 73, column: 13, scope: !1075)
!1077 = !DILocation(line: 47, column: 12, scope: !981)
!1078 = !DILocation(line: 85, column: 11, scope: !970)
!1079 = !DILocation(line: 85, column: 5, scope: !970)
!1080 = !DILocation(line: 86, column: 3, scope: !947)
!1081 = !DILocation(line: 79, column: 11, scope: !1082)
!1082 = distinct !DILexicalBlock(scope: !1063, file: !29, line: 79, column: 11)
!1083 = !DILocation(line: 79, column: 21, scope: !1082)
!1084 = !DILocation(line: 79, column: 29, scope: !1082)
!1085 = !DILocation(scope: !1028, inlinedAt: !1086)
!1086 = distinct !DILocation(line: 81, column: 11, scope: !1087)
!1087 = distinct !DILexicalBlock(scope: !1082, file: !29, line: 80, column: 9)
!1088 = !DILocation(line: 110, column: 10, scope: !1028, inlinedAt: !1086)
!1089 = !DILocation(line: 82, column: 29, scope: !1090)
!1090 = distinct !DILexicalBlock(scope: !1087, file: !29, line: 82, column: 15)
!1091 = !DILocation(scope: !984, inlinedAt: !1092)
!1092 = distinct !DILocation(line: 82, column: 16, scope: !1090)
!1093 = !DILocation(line: 108, column: 7, scope: !984, inlinedAt: !1092)
!1094 = !DILocation(line: 97, column: 21, scope: !28, inlinedAt: !1095)
!1095 = distinct !DILocation(line: 119, column: 34, scope: !984, inlinedAt: !1092)
!1096 = !DILocation(line: 110, column: 13, scope: !1007, inlinedAt: !1092)
!1097 = !DILocation(line: 111, column: 15, scope: !1010, inlinedAt: !1092)
!1098 = !DILocation(line: 111, column: 11, scope: !1007, inlinedAt: !1092)
!1099 = !DILocation(line: 113, column: 24, scope: !1013, inlinedAt: !1092)
!1100 = !DILocation(line: 114, column: 18, scope: !1013, inlinedAt: !1092)
!1101 = !DILocation(line: 113, column: 11, scope: !1013, inlinedAt: !1092)
!1102 = !DILocation(line: 116, column: 9, scope: !1013, inlinedAt: !1092)
!1103 = !DILocation(line: 119, column: 24, scope: !984, inlinedAt: !1092)
!1104 = !DILocation(line: 120, column: 3, scope: !984, inlinedAt: !1092)
!1105 = !DILocation(line: 82, column: 15, scope: !1087)
!1106 = !DILocation(scope: !28, inlinedAt: !1095)
!1107 = !DILocation(line: 97, column: 10, scope: !28, inlinedAt: !1095)
!1108 = !DILocation(line: 78, column: 36, scope: !1063)
!1109 = distinct !{!1109, !1064, !1110, !699}
!1110 = !DILocation(line: 84, column: 9, scope: !973)
!1111 = !DILocation(line: 88, column: 1, scope: !947)
!1112 = !DISubprogram(name: "getpwuid", scope: !807, file: !807, line: 110, type: !1113, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!1113 = !DISubroutineType(types: !1114)
!1114 = !{!959, !38}
!1115 = !DISubprogram(name: "getgrgid", scope: !992, file: !992, line: 101, type: !1116, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!1116 = !DISubroutineType(types: !1117)
!1117 = !{!990, !38}
!1118 = !DILocation(scope: !984)
!1119 = !DILocation(line: 108, column: 7, scope: !984)
!1120 = !DILocation(line: 97, column: 21, scope: !28, inlinedAt: !1121)
!1121 = distinct !DILocation(line: 119, column: 34, scope: !984)
!1122 = !DILocation(line: 110, column: 13, scope: !1007)
!1123 = !DILocation(line: 111, column: 15, scope: !1010)
!1124 = !DILocation(line: 111, column: 11, scope: !1007)
!1125 = !DILocation(line: 113, column: 24, scope: !1013)
!1126 = !DILocation(line: 114, column: 18, scope: !1013)
!1127 = !DILocation(line: 113, column: 11, scope: !1013)
!1128 = !DILocation(line: 116, column: 9, scope: !1013)
!1129 = !DILocation(line: 119, column: 24, scope: !984)
!1130 = !DILocation(line: 119, column: 13, scope: !984)
!1131 = !DILocation(scope: !28, inlinedAt: !1121)
!1132 = !DILocation(line: 97, column: 10, scope: !28, inlinedAt: !1121)
!1133 = !DILocation(line: 120, column: 3, scope: !984)
!1134 = !DILocation(line: 121, column: 3, scope: !984)
!1135 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !56, file: !56, line: 51, type: !669, scopeLine: 52, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !55, retainedNodes: !1136)
!1136 = !{!1137}
!1137 = !DILocalVariable(name: "file", arg: 1, scope: !1135, file: !56, line: 51, type: !17)
!1138 = !DILocation(scope: !1135)
!1139 = !DILocation(line: 53, column: 13, scope: !1135)
!1140 = !DILocation(line: 54, column: 1, scope: !1135)
!1141 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !56, file: !56, line: 88, type: !1142, scopeLine: 89, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !55, retainedNodes: !1144)
!1142 = !DISubroutineType(types: !1143)
!1143 = !{null, !60}
!1144 = !{!1145}
!1145 = !DILocalVariable(name: "ignore", arg: 1, scope: !1141, file: !56, line: 88, type: !60)
!1146 = !DILocation(scope: !1141)
!1147 = !DILocation(line: 90, column: 16, scope: !1141)
!1148 = !{!1149, !1149, i64 0}
!1149 = !{!"_Bool", !659, i64 0}
!1150 = !DILocation(line: 91, column: 1, scope: !1141)
!1151 = distinct !DISubprogram(name: "close_stdout", scope: !56, file: !56, line: 117, type: !926, scopeLine: 118, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !55, retainedNodes: !1152)
!1152 = !{!1153}
!1153 = !DILocalVariable(name: "write_error", scope: !1154, file: !56, line: 122, type: !17)
!1154 = distinct !DILexicalBlock(scope: !1155, file: !56, line: 121, column: 5)
!1155 = distinct !DILexicalBlock(scope: !1151, file: !56, line: 119, column: 7)
!1156 = !DILocation(line: 119, column: 21, scope: !1155)
!1157 = !DILocation(line: 119, column: 7, scope: !1155)
!1158 = !DILocation(line: 119, column: 29, scope: !1155)
!1159 = !DILocation(line: 120, column: 7, scope: !1155)
!1160 = !DILocation(line: 120, column: 12, scope: !1155)
!1161 = !{i8 0, i8 2}
!1162 = !DILocation(line: 120, column: 25, scope: !1155)
!1163 = !DILocation(line: 120, column: 28, scope: !1155)
!1164 = !DILocation(line: 120, column: 34, scope: !1155)
!1165 = !DILocation(line: 119, column: 7, scope: !1151)
!1166 = !DILocation(line: 122, column: 33, scope: !1154)
!1167 = !DILocation(scope: !1154)
!1168 = !DILocation(line: 123, column: 11, scope: !1169)
!1169 = distinct !DILexicalBlock(scope: !1154, file: !56, line: 123, column: 11)
!1170 = !DILocation(scope: !1169)
!1171 = !DILocation(line: 123, column: 11, scope: !1154)
!1172 = !DILocation(line: 124, column: 36, scope: !1169)
!1173 = !DILocation(line: 124, column: 9, scope: !1169)
!1174 = !DILocation(line: 127, column: 9, scope: !1169)
!1175 = !DILocation(line: 129, column: 14, scope: !1154)
!1176 = !DILocation(line: 129, column: 7, scope: !1154)
!1177 = !DILocation(line: 134, column: 42, scope: !1178)
!1178 = distinct !DILexicalBlock(scope: !1151, file: !56, line: 134, column: 7)
!1179 = !DILocation(line: 134, column: 28, scope: !1178)
!1180 = !DILocation(line: 134, column: 50, scope: !1178)
!1181 = !DILocation(line: 134, column: 7, scope: !1151)
!1182 = !DILocation(line: 135, column: 12, scope: !1178)
!1183 = !DILocation(line: 135, column: 5, scope: !1178)
!1184 = !DILocation(line: 136, column: 1, scope: !1151)
!1185 = distinct !DISubprogram(name: "umaxtostr", scope: !1186, file: !1186, line: 36, type: !1187, scopeLine: 37, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !165, retainedNodes: !1189)
!1186 = !DIFile(filename: "./lib/anytostr.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1187 = !DISubroutineType(types: !1188)
!1188 = !{!6, !168, !6}
!1189 = !{!1190, !1191, !1192}
!1190 = !DILocalVariable(name: "i", arg: 1, scope: !1185, file: !1186, line: 36, type: !168)
!1191 = !DILocalVariable(name: "buf", arg: 2, scope: !1185, file: !1186, line: 36, type: !6)
!1192 = !DILocalVariable(name: "p", scope: !1185, file: !1186, line: 38, type: !6)
!1193 = !DILocation(scope: !1185)
!1194 = !DILocation(line: 38, column: 17, scope: !1185)
!1195 = !DILocation(line: 39, column: 6, scope: !1185)
!1196 = !DILocation(line: 52, column: 24, scope: !1197)
!1197 = distinct !DILexicalBlock(scope: !1198, file: !1186, line: 50, column: 5)
!1198 = distinct !DILexicalBlock(scope: !1185, file: !1186, line: 41, column: 7)
!1199 = !DILocation(line: 52, column: 16, scope: !1197)
!1200 = !DILocation(line: 52, column: 10, scope: !1197)
!1201 = !DILocation(line: 52, column: 14, scope: !1197)
!1202 = !DILocation(line: 53, column: 17, scope: !1197)
!1203 = !DILocation(line: 53, column: 24, scope: !1197)
!1204 = !DILocation(line: 52, column: 9, scope: !1197)
