source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.infomap = type { i8*, i8* }
%struct.linebuffer = type { [8192 x i8], i64, i64, %struct.linebuffer* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [FILE]...\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 72, type: !223, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !30, globals: !211, nameTableKind: None)
!3 = !DIFile(filename: "src/head.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !11, !25}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "header_mode", file: !3, line: 66, baseType: !6, size: 32, elements: !7)
!6 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!7 = !{!8, !9, !10}
!8 = !DIEnumerator(name: "multiple_files", value: 0, isUnsigned: true)
!9 = !DIEnumerator(name: "always", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "never", value: 2, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !12, line: 32, baseType: !6, size: 32, elements: !13)
!12 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!13 = !{!14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24}
!14 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!17 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!18 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!19 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!20 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!21 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!22 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!23 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!24 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Copy_fd_status", file: !3, line: 74, baseType: !6, size: 32, elements: !26)
!26 = !{!27, !28, !29}
!27 = !DIEnumerator(name: "COPY_FD_OK", value: 0, isUnsigned: true)
!28 = !DIEnumerator(name: "COPY_FD_READ_ERROR", value: 1, isUnsigned: true)
!29 = !DIEnumerator(name: "COPY_FD_UNEXPECTED_EOF", value: 2, isUnsigned: true)
!30 = !{!31, !41, !102, !106, !110, !113, !116, !6, !123, !127, !35, !92, !142, !146, !147, !151, !155, !157, !161, !165, !169, !172, !175, !178, !94, !181, !185, !189, !37, !192, !197, !200, !201, !205, !207, !208}
!31 = !DISubprogram(name: "dcgettext", scope: !32, file: !32, line: 51, type: !33, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!32 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!33 = !DISubroutineType(types: !34)
!34 = !{!35, !37, !37, !39}
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!39 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!40 = !{}
!41 = !DISubprogram(name: "fputs_unlocked", scope: !42, file: !42, line: 662, type: !43, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!42 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!43 = !DISubroutineType(types: !44)
!44 = !{!39, !37, !45}
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !47, line: 49, size: 1728, elements: !48)
!47 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!48 = !{!49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !64, !65, !66, !67, !71, !73, !75, !79, !82, !84, !87, !90, !91, !93, !97, !98}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !46, file: !47, line: 51, baseType: !39, size: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !46, file: !47, line: 54, baseType: !35, size: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !46, file: !47, line: 55, baseType: !35, size: 64, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !46, file: !47, line: 56, baseType: !35, size: 64, offset: 192)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !46, file: !47, line: 57, baseType: !35, size: 64, offset: 256)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !46, file: !47, line: 58, baseType: !35, size: 64, offset: 320)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !46, file: !47, line: 59, baseType: !35, size: 64, offset: 384)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !46, file: !47, line: 60, baseType: !35, size: 64, offset: 448)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !46, file: !47, line: 61, baseType: !35, size: 64, offset: 512)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !46, file: !47, line: 64, baseType: !35, size: 64, offset: 576)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !46, file: !47, line: 65, baseType: !35, size: 64, offset: 640)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !46, file: !47, line: 66, baseType: !35, size: 64, offset: 704)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !46, file: !47, line: 68, baseType: !62, size: 64, offset: 768)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !47, line: 36, flags: DIFlagFwdDecl)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !46, file: !47, line: 70, baseType: !45, size: 64, offset: 832)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !46, file: !47, line: 72, baseType: !39, size: 32, offset: 896)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !46, file: !47, line: 73, baseType: !39, size: 32, offset: 928)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !46, file: !47, line: 74, baseType: !68, size: 64, offset: 960)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !69, line: 152, baseType: !70)
!69 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!70 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !46, file: !47, line: 77, baseType: !72, size: 16, offset: 1024)
!72 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !46, file: !47, line: 78, baseType: !74, size: 8, offset: 1040)
!74 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !46, file: !47, line: 79, baseType: !76, size: 8, offset: 1048)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 8, elements: !77)
!77 = !{!78}
!78 = !DISubrange(count: 1)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !46, file: !47, line: 81, baseType: !80, size: 64, offset: 1088)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !47, line: 43, baseType: null)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !46, file: !47, line: 89, baseType: !83, size: 64, offset: 1152)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !69, line: 153, baseType: !70)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !46, file: !47, line: 91, baseType: !85, size: 64, offset: 1216)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !47, line: 37, flags: DIFlagFwdDecl)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !46, file: !47, line: 92, baseType: !88, size: 64, offset: 1280)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !47, line: 38, flags: DIFlagFwdDecl)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !46, file: !47, line: 93, baseType: !45, size: 64, offset: 1344)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !46, file: !47, line: 94, baseType: !92, size: 64, offset: 1408)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !46, file: !47, line: 95, baseType: !94, size: 64, offset: 1472)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !95, line: 46, baseType: !96)
!95 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!96 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !46, file: !47, line: 96, baseType: !39, size: 32, offset: 1536)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !46, file: !47, line: 98, baseType: !99, size: 160, offset: 1568)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 160, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 20)
!102 = !DISubprogram(name: "set_program_name", scope: !103, file: !103, line: 37, type: !104, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!103 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!104 = !DISubroutineType(types: !105)
!105 = !{null, !37}
!106 = !DISubprogram(name: "setlocale", scope: !107, file: !107, line: 122, type: !108, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!107 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!108 = !DISubroutineType(types: !109)
!109 = !{!35, !39, !37}
!110 = !DISubprogram(name: "bindtextdomain", scope: !32, file: !32, line: 86, type: !111, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!111 = !DISubroutineType(types: !112)
!112 = !{!35, !37, !37}
!113 = !DISubprogram(name: "textdomain", scope: !32, file: !32, line: 82, type: !114, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!114 = !DISubroutineType(types: !115)
!115 = !{!35, !37}
!116 = !DISubprogram(name: "atexit", scope: !117, file: !117, line: 595, type: !118, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!117 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!118 = !DISubroutineType(types: !119)
!119 = !{!39, !120}
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{null}
!123 = !DISubprogram(name: "error", scope: !124, file: !124, line: 52, type: !125, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!124 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!125 = !DISubroutineType(types: !126)
!126 = !{null, !39, !39, !37, null}
!127 = !DISubprogram(name: "getopt_long", scope: !128, file: !128, line: 66, type: !129, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!128 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!129 = !DISubroutineType(types: !130)
!130 = !{!39, !39, !131, !37, !133, !140}
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !135)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !128, line: 50, size: 256, elements: !136)
!136 = !{!137, !138, !139, !141}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !135, file: !128, line: 52, baseType: !37, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !135, file: !128, line: 55, baseType: !39, size: 32, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !135, file: !128, line: 56, baseType: !140, size: 64, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !135, file: !128, line: 57, baseType: !39, size: 32, offset: 192)
!142 = !DISubprogram(name: "version_etc", scope: !143, file: !143, line: 69, type: !144, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!143 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!144 = !DISubroutineType(types: !145)
!145 = !{null, !45, !37, !37, !37, null}
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !42, line: 63, baseType: !68)
!147 = !DISubprogram(name: "umaxtostr", scope: !148, file: !148, line: 46, type: !149, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!148 = !DIFile(filename: "./lib/inttostr.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!149 = !DISubroutineType(types: !150)
!150 = !{!35, !96, !35}
!151 = !DISubprogram(name: "quote", scope: !152, file: !152, line: 44, type: !153, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!152 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!153 = !DISubroutineType(types: !154)
!154 = !{!37, !37}
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!157 = !DISubprogram(name: "close", scope: !158, file: !158, line: 353, type: !159, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!158 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!159 = !DISubroutineType(types: !160)
!160 = !{!39, !39}
!161 = !DISubprogram(name: "xdectoumax", scope: !162, file: !162, line: 31, type: !163, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!162 = !DIFile(filename: "./lib/xdectoint.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!163 = !DISubroutineType(types: !164)
!164 = !{!96, !37, !96, !96, !37, !37, !39}
!165 = !DISubprogram(name: "open", scope: !166, file: !166, line: 196, type: !167, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!166 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
!167 = !DISubroutineType(types: !168)
!168 = !{!39, !37, !39, null}
!169 = !DISubprogram(name: "quotearg_style", scope: !12, file: !12, line: 377, type: !170, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!170 = !DISubroutineType(types: !171)
!171 = !{!35, !11, !37}
!172 = !DISubprogram(name: "lseek", scope: !158, file: !158, line: 334, type: !173, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!173 = !DISubroutineType(types: !174)
!174 = !{!70, !39, !70, !39}
!175 = !DISubprogram(name: "quotearg_n_style_colon", scope: !12, file: !12, line: 397, type: !176, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!176 = !DISubroutineType(types: !177)
!177 = !{!35, !39, !11, !37}
!178 = !DISubprogram(name: "offtostr", scope: !148, file: !148, line: 44, type: !179, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!179 = !DISubroutineType(types: !180)
!180 = !{!35, !70, !35}
!181 = !DISubprogram(name: "xmalloc", scope: !182, file: !182, line: 53, type: !183, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!182 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!183 = !DISubroutineType(types: !184)
!184 = !{!92, !96}
!185 = !DISubprogram(name: "safe_read", scope: !186, file: !186, line: 42, type: !187, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!186 = !DIFile(filename: "./lib/safe-read.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!187 = !DISubroutineType(types: !188)
!188 = !{!96, !39, !92, !96}
!189 = !DISubprogram(name: "free", scope: !117, file: !117, line: 565, type: !190, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!190 = !DISubroutineType(types: !191)
!191 = !{null, !92}
!192 = !DISubprogram(name: "fwrite_unlocked", scope: !42, file: !42, line: 675, type: !193, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!193 = !DISubroutineType(types: !194)
!194 = !{!96, !195, !96, !96, !45}
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!197 = !DISubprogram(name: "clearerr_unlocked", scope: !42, file: !42, line: 765, type: !198, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!198 = !DISubroutineType(types: !199)
!199 = !{null, !45}
!200 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!201 = !DISubprogram(name: "memrchr", scope: !202, file: !202, line: 115, type: !203, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!202 = !DIFile(filename: "/usr/include/string.h", directory: "")
!203 = !DISubroutineType(types: !204)
!204 = !{!92, !195, !39, !96}
!205 = !DISubprogram(name: "full_read", scope: !206, file: !206, line: 23, type: !187, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!206 = !DIFile(filename: "./lib/full-read.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!207 = !DISubprogram(name: "xalloc_die", scope: !182, file: !182, line: 51, type: !121, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !40)
!208 = !DISubprogram(name: "xrealloc", scope: !182, file: !182, line: 59, type: !209, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!209 = !DISubroutineType(types: !210)
!210 = !{!92, !92, !96}
!211 = !{!212, !248, !250, !252, !254, !255, !260}
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(name: "default_file_list", scope: !214, file: !3, line: 938, type: !245, isLocal: true, isDefinition: true)
!214 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 918, type: !215, scopeLine: 919, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !218)
!215 = !DISubroutineType(types: !216)
!216 = !{!39, !39, !217}
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!218 = !{!219, !220, !221, !222, !224, !225, !226, !230, !231, !232, !233, !236, !237, !238, !239}
!219 = !DILocalVariable(name: "argc", arg: 1, scope: !214, file: !3, line: 918, type: !39)
!220 = !DILocalVariable(name: "argv", arg: 2, scope: !214, file: !3, line: 918, type: !217)
!221 = !DILocalVariable(name: "header_mode", scope: !214, file: !3, line: 920, type: !5)
!222 = !DILocalVariable(name: "ok", scope: !214, file: !3, line: 921, type: !223)
!223 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!224 = !DILocalVariable(name: "c", scope: !214, file: !3, line: 922, type: !39)
!225 = !DILocalVariable(name: "i", scope: !214, file: !3, line: 923, type: !94)
!226 = !DILocalVariable(name: "n_units", scope: !214, file: !3, line: 926, type: !227)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !228, line: 102, baseType: !229)
!228 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !69, line: 73, baseType: !96)
!230 = !DILocalVariable(name: "count_lines", scope: !214, file: !3, line: 930, type: !223)
!231 = !DILocalVariable(name: "elide_from_end", scope: !214, file: !3, line: 934, type: !223)
!232 = !DILocalVariable(name: "file_list", scope: !214, file: !3, line: 939, type: !155)
!233 = !DILocalVariable(name: "a", scope: !234, file: !3, line: 957, type: !35)
!234 = distinct !DILexicalBlock(scope: !235, file: !3, line: 956, column: 5)
!235 = distinct !DILexicalBlock(scope: !214, file: !3, line: 955, column: 7)
!236 = !DILocalVariable(name: "n_string", scope: !234, file: !3, line: 958, type: !35)
!237 = !DILocalVariable(name: "end_n_string", scope: !234, file: !3, line: 959, type: !35)
!238 = !DILocalVariable(name: "multiplier_char", scope: !234, file: !3, line: 960, type: !36)
!239 = !DILocalVariable(name: "umax_buf", scope: !240, file: !3, line: 1077, type: !242)
!240 = distinct !DILexicalBlock(scope: !241, file: !3, line: 1076, column: 5)
!241 = distinct !DILexicalBlock(scope: !214, file: !3, line: 1075, column: 8)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 168, elements: !243)
!243 = !{!244}
!244 = !DISubrange(count: 21)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 128, elements: !246)
!246 = !{!247}
!247 = !DISubrange(count: 2)
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(name: "presume_input_pipe", scope: !2, file: !3, line: 57, type: !223, isLocal: true, isDefinition: true)
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(name: "print_headers", scope: !2, file: !3, line: 60, type: !223, isLocal: true, isDefinition: true)
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(name: "line_end", scope: !2, file: !3, line: 63, type: !36, isLocal: true, isDefinition: true)
!254 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 88, type: !257, isLocal: true, isDefinition: true)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 2560, elements: !258)
!258 = !{!259}
!259 = !DISubrange(count: 10)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(name: "first_file", scope: !262, file: !3, line: 170, type: !223, isLocal: true, isDefinition: true)
!262 = distinct !DISubprogram(name: "write_header", scope: !3, file: !3, line: 168, type: !104, scopeLine: 169, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !263)
!263 = !{!264}
!264 = !DILocalVariable(name: "filename", arg: 1, scope: !262, file: !3, line: 168, type: !37)
!265 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!266 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 10, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!267 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!268 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(name: "Version", scope: !271, file: !272, line: 2, type: !37, isDefinition: true)
!271 = distinct !DICompileUnit(language: DW_LANG_C99, file: !272, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !40, globals: !273, nameTableKind: None)
!272 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!273 = !{!269}
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(name: "file_name", scope: !276, file: !277, line: 46, type: !37, isLocal: true, isDefinition: true)
!276 = distinct !DICompileUnit(language: DW_LANG_C99, file: !277, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !40, retainedTypes: !278, globals: !316, nameTableKind: None)
!277 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!278 = !{!279, !31, !315, !123}
!279 = !DISubprogram(name: "close_stream", scope: !280, file: !280, line: 2, type: !281, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!280 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!281 = !DISubroutineType(types: !282)
!282 = !{!39, !283}
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !47, line: 49, size: 1728, elements: !285)
!285 = !{!286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !284, file: !47, line: 51, baseType: !39, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !284, file: !47, line: 54, baseType: !35, size: 64, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !284, file: !47, line: 55, baseType: !35, size: 64, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !284, file: !47, line: 56, baseType: !35, size: 64, offset: 192)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !284, file: !47, line: 57, baseType: !35, size: 64, offset: 256)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !284, file: !47, line: 58, baseType: !35, size: 64, offset: 320)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !284, file: !47, line: 59, baseType: !35, size: 64, offset: 384)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !284, file: !47, line: 60, baseType: !35, size: 64, offset: 448)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !284, file: !47, line: 61, baseType: !35, size: 64, offset: 512)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !284, file: !47, line: 64, baseType: !35, size: 64, offset: 576)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !284, file: !47, line: 65, baseType: !35, size: 64, offset: 640)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !284, file: !47, line: 66, baseType: !35, size: 64, offset: 704)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !284, file: !47, line: 68, baseType: !62, size: 64, offset: 768)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !284, file: !47, line: 70, baseType: !283, size: 64, offset: 832)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !284, file: !47, line: 72, baseType: !39, size: 32, offset: 896)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !284, file: !47, line: 73, baseType: !39, size: 32, offset: 928)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !284, file: !47, line: 74, baseType: !68, size: 64, offset: 960)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !284, file: !47, line: 77, baseType: !72, size: 16, offset: 1024)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !284, file: !47, line: 78, baseType: !74, size: 8, offset: 1040)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !284, file: !47, line: 79, baseType: !76, size: 8, offset: 1048)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !284, file: !47, line: 81, baseType: !80, size: 64, offset: 1088)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !284, file: !47, line: 89, baseType: !83, size: 64, offset: 1152)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !284, file: !47, line: 91, baseType: !85, size: 64, offset: 1216)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !284, file: !47, line: 92, baseType: !88, size: 64, offset: 1280)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !284, file: !47, line: 93, baseType: !283, size: 64, offset: 1344)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !284, file: !47, line: 94, baseType: !92, size: 64, offset: 1408)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !284, file: !47, line: 95, baseType: !94, size: 64, offset: 1472)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !284, file: !47, line: 96, baseType: !39, size: 32, offset: 1536)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !284, file: !47, line: 98, baseType: !99, size: 160, offset: 1568)
!315 = !DISubprogram(name: "quotearg_colon", scope: !12, file: !12, line: 391, type: !114, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!316 = !{!274, !317}
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !276, file: !277, line: 56, type: !223, isLocal: true, isDefinition: true)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(name: "exit_failure", scope: !321, file: !322, line: 24, type: !324, isDefinition: true)
!321 = distinct !DICompileUnit(language: DW_LANG_C99, file: !322, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !40, globals: !323, nameTableKind: None)
!322 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!323 = !{!319}
!324 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !39)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "program_name", scope: !327, file: !328, line: 33, type: !37, isDefinition: true)
!327 = distinct !DICompileUnit(language: DW_LANG_C99, file: !328, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !40, retainedTypes: !329, globals: !365, nameTableKind: None)
!328 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!329 = !{!92, !330, !35}
!330 = !DISubprogram(name: "fputs", scope: !42, file: !42, line: 626, type: !331, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!331 = !DISubroutineType(types: !332)
!332 = !{!39, !37, !333}
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !47, line: 49, size: 1728, elements: !335)
!335 = !{!336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !334, file: !47, line: 51, baseType: !39, size: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !334, file: !47, line: 54, baseType: !35, size: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !334, file: !47, line: 55, baseType: !35, size: 64, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !334, file: !47, line: 56, baseType: !35, size: 64, offset: 192)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !334, file: !47, line: 57, baseType: !35, size: 64, offset: 256)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !334, file: !47, line: 58, baseType: !35, size: 64, offset: 320)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !334, file: !47, line: 59, baseType: !35, size: 64, offset: 384)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !334, file: !47, line: 60, baseType: !35, size: 64, offset: 448)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !334, file: !47, line: 61, baseType: !35, size: 64, offset: 512)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !334, file: !47, line: 64, baseType: !35, size: 64, offset: 576)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !334, file: !47, line: 65, baseType: !35, size: 64, offset: 640)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !334, file: !47, line: 66, baseType: !35, size: 64, offset: 704)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !334, file: !47, line: 68, baseType: !62, size: 64, offset: 768)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !334, file: !47, line: 70, baseType: !333, size: 64, offset: 832)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !334, file: !47, line: 72, baseType: !39, size: 32, offset: 896)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !334, file: !47, line: 73, baseType: !39, size: 32, offset: 928)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !334, file: !47, line: 74, baseType: !68, size: 64, offset: 960)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !334, file: !47, line: 77, baseType: !72, size: 16, offset: 1024)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !334, file: !47, line: 78, baseType: !74, size: 8, offset: 1040)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !334, file: !47, line: 79, baseType: !76, size: 8, offset: 1048)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !334, file: !47, line: 81, baseType: !80, size: 64, offset: 1088)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !334, file: !47, line: 89, baseType: !83, size: 64, offset: 1152)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !334, file: !47, line: 91, baseType: !85, size: 64, offset: 1216)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !334, file: !47, line: 92, baseType: !88, size: 64, offset: 1280)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !334, file: !47, line: 93, baseType: !333, size: 64, offset: 1344)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !334, file: !47, line: 94, baseType: !92, size: 64, offset: 1408)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !334, file: !47, line: 95, baseType: !94, size: 64, offset: 1472)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !334, file: !47, line: 96, baseType: !39, size: 32, offset: 1536)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !334, file: !47, line: 98, baseType: !99, size: 160, offset: 1568)
!365 = !{!325}
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !368, file: !369, line: 85, type: !474, isDefinition: true)
!368 = distinct !DICompileUnit(language: DW_LANG_C99, file: !369, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !370, retainedTypes: !391, globals: !449, nameTableKind: None)
!369 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!370 = !{!11, !371, !376}
!371 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !12, line: 242, baseType: !6, size: 32, elements: !372)
!372 = !{!373, !374, !375}
!373 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!374 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!375 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!376 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !377, line: 46, baseType: !6, size: 32, elements: !378)
!377 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!378 = !{!379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390}
!379 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!380 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!381 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!382 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!383 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!384 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!385 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!386 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!387 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!388 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!389 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!390 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!391 = !{!392, !395, !189, !411, !39, !72, !414, !94, !431, !435, !31, !441, !445, !35, !181, !207, !208}
!392 = !DISubprogram(name: "xmemdup", scope: !182, file: !182, line: 62, type: !393, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!393 = !DISubroutineType(types: !394)
!394 = !{!92, !195, !96}
!395 = !DISubprogram(name: "quotearg_alloc_mem", scope: !12, file: !12, line: 342, type: !396, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!396 = !DISubroutineType(types: !397)
!397 = !{!35, !37, !96, !398, !399}
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !401)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !369, line: 65, size: 448, elements: !402)
!402 = !{!403, !404, !405, !409, !410}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !401, file: !369, line: 68, baseType: !11, size: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !401, file: !369, line: 71, baseType: !39, size: 32, offset: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !401, file: !369, line: 75, baseType: !406, size: 256, offset: 64)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !407)
!407 = !{!408}
!408 = !DISubrange(count: 8)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !401, file: !369, line: 78, baseType: !37, size: 64, offset: 320)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !401, file: !369, line: 81, baseType: !37, size: 64, offset: 384)
!411 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !12, file: !12, line: 408, type: !412, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!412 = !DISubroutineType(types: !413)
!413 = !{!35, !39, !37, !37, !37, !96}
!414 = !DISubprogram(name: "rpl_mbrtowc", scope: !415, file: !415, line: 717, type: !416, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!415 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!416 = !DISubroutineType(types: !417)
!417 = !{!96, !140, !37, !96, !418}
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !420, line: 13, size: 64, elements: !421)
!420 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!421 = !{!422, !423}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !419, file: !420, line: 15, baseType: !39, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !419, file: !420, line: 20, baseType: !424, size: 32, offset: 32)
!424 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !419, file: !420, line: 16, size: 32, elements: !425)
!425 = !{!426, !427}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !424, file: !420, line: 18, baseType: !6, size: 32)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !424, file: !420, line: 19, baseType: !428, size: 32)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 32, elements: !429)
!429 = !{!430}
!430 = !DISubrange(count: 4)
!431 = !DISubprogram(name: "iswprint", scope: !432, file: !432, line: 120, type: !433, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!432 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!433 = !DISubroutineType(types: !434)
!434 = !{!39, !6}
!435 = !DISubprogram(name: "mbsinit", scope: !436, file: !436, line: 292, type: !437, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!436 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!437 = !DISubroutineType(types: !438)
!438 = !{!39, !439}
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !419)
!441 = !DISubprogram(name: "locale_charset", scope: !442, file: !442, line: 35, type: !443, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!442 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!443 = !DISubroutineType(types: !444)
!444 = !{!37}
!445 = !DISubprogram(name: "c_strcasecmp", scope: !446, file: !446, line: 42, type: !447, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!446 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!447 = !DISubroutineType(types: !448)
!448 = !{!39, !37, !37}
!449 = !{!366, !450, !454, !456, !458, !463, !470, !472}
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !368, file: !369, line: 101, type: !452, isDefinition: true)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !453, size: 320, elements: !258)
!453 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !368, file: !369, line: 1052, type: !401, isDefinition: true)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !368, file: !369, line: 116, type: !401, isLocal: true, isDefinition: true)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(name: "slot0", scope: !368, file: !369, line: 842, type: !460, isLocal: true, isDefinition: true)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 2048, elements: !461)
!461 = !{!462}
!462 = !DISubrange(count: 256)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(name: "slotvec", scope: !368, file: !369, line: 845, type: !465, isLocal: true, isDefinition: true)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !369, line: 834, size: 128, elements: !467)
!467 = !{!468, !469}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !466, file: !369, line: 836, baseType: !94, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !466, file: !369, line: 837, baseType: !35, size: 64, offset: 64)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(name: "nslots", scope: !368, file: !369, line: 843, type: !39, isLocal: true, isDefinition: true)
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(name: "slotvec0", scope: !368, file: !369, line: 844, type: !466, isLocal: true, isDefinition: true)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 704, elements: !475)
!475 = !{!476}
!476 = !DISubrange(count: 11)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !479, file: !480, line: 26, type: !482, isDefinition: true)
!479 = distinct !DICompileUnit(language: DW_LANG_C99, file: !480, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !40, globals: !481, nameTableKind: None)
!480 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!481 = !{!477}
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 376, elements: !483)
!483 = !{!484}
!484 = !DISubrange(count: 47)
!485 = distinct !DICompileUnit(language: DW_LANG_C99, file: !486, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !40, retainedTypes: !487, nameTableKind: None)
!486 = !DIFile(filename: "lib/full-read.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!487 = !{!35, !185, !94}
!488 = distinct !DICompileUnit(language: DW_LANG_C99, file: !489, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !40, retainedTypes: !490, nameTableKind: None)
!489 = !DIFile(filename: "lib/offtostr.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!490 = !{!491}
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !492, line: 85, baseType: !68)
!492 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!493 = distinct !DICompileUnit(language: DW_LANG_C99, file: !494, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !40, retainedTypes: !495, nameTableKind: None)
!494 = !DIFile(filename: "lib/umaxtostr.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!495 = !{!227}
!496 = distinct !DICompileUnit(language: DW_LANG_C99, file: !497, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !498, nameTableKind: None)
!497 = !DIFile(filename: "lib/safe-read.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!498 = !{!499}
!499 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !500, line: 40, baseType: !6, size: 32, elements: !501)
!500 = !DIFile(filename: "./lib/sys-limits.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!501 = !{!502}
!502 = !DIEnumerator(name: "SYS_BUFSIZE_MAX", value: 2146435072, isUnsigned: true)
!503 = distinct !DICompileUnit(language: DW_LANG_C99, file: !504, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !505, retainedTypes: !509, nameTableKind: None)
!504 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!505 = !{!506}
!506 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !504, line: 40, baseType: !6, size: 32, elements: !507)
!507 = !{!508}
!508 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!509 = !{!31, !510, !92}
!510 = !DISubprogram(name: "fputs_unlocked", scope: !42, file: !42, line: 662, type: !511, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!511 = !DISubroutineType(types: !512)
!512 = !{!39, !37, !513}
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !47, line: 49, size: 1728, elements: !515)
!515 = !{!516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !514, file: !47, line: 51, baseType: !39, size: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !514, file: !47, line: 54, baseType: !35, size: 64, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !514, file: !47, line: 55, baseType: !35, size: 64, offset: 128)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !514, file: !47, line: 56, baseType: !35, size: 64, offset: 192)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !514, file: !47, line: 57, baseType: !35, size: 64, offset: 256)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !514, file: !47, line: 58, baseType: !35, size: 64, offset: 320)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !514, file: !47, line: 59, baseType: !35, size: 64, offset: 384)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !514, file: !47, line: 60, baseType: !35, size: 64, offset: 448)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !514, file: !47, line: 61, baseType: !35, size: 64, offset: 512)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !514, file: !47, line: 64, baseType: !35, size: 64, offset: 576)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !514, file: !47, line: 65, baseType: !35, size: 64, offset: 640)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !514, file: !47, line: 66, baseType: !35, size: 64, offset: 704)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !514, file: !47, line: 68, baseType: !62, size: 64, offset: 768)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !514, file: !47, line: 70, baseType: !513, size: 64, offset: 832)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !514, file: !47, line: 72, baseType: !39, size: 32, offset: 896)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !514, file: !47, line: 73, baseType: !39, size: 32, offset: 928)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !514, file: !47, line: 74, baseType: !68, size: 64, offset: 960)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !514, file: !47, line: 77, baseType: !72, size: 16, offset: 1024)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !514, file: !47, line: 78, baseType: !74, size: 8, offset: 1040)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !514, file: !47, line: 79, baseType: !76, size: 8, offset: 1048)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !514, file: !47, line: 81, baseType: !80, size: 64, offset: 1088)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !514, file: !47, line: 89, baseType: !83, size: 64, offset: 1152)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !514, file: !47, line: 91, baseType: !85, size: 64, offset: 1216)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !514, file: !47, line: 92, baseType: !88, size: 64, offset: 1280)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !514, file: !47, line: 93, baseType: !513, size: 64, offset: 1344)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !514, file: !47, line: 94, baseType: !92, size: 64, offset: 1408)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !514, file: !47, line: 95, baseType: !94, size: 64, offset: 1472)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !514, file: !47, line: 96, baseType: !39, size: 32, offset: 1536)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !514, file: !47, line: 98, baseType: !99, size: 160, offset: 1568)
!545 = distinct !DICompileUnit(language: DW_LANG_C99, file: !546, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !547, retainedTypes: !560, nameTableKind: None)
!546 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!547 = !{!548}
!548 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !549, file: !182, line: 186, baseType: !6, size: 32, elements: !558)
!549 = distinct !DISubprogram(name: "x2nrealloc", scope: !182, file: !182, line: 174, type: !550, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !545, retainedNodes: !553)
!550 = !DISubroutineType(types: !551)
!551 = !{!92, !92, !552, !94}
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!553 = !{!554, !555, !556, !557}
!554 = !DILocalVariable(name: "p", arg: 1, scope: !549, file: !182, line: 174, type: !92)
!555 = !DILocalVariable(name: "pn", arg: 2, scope: !549, file: !182, line: 174, type: !552)
!556 = !DILocalVariable(name: "s", arg: 3, scope: !549, file: !182, line: 174, type: !94)
!557 = !DILocalVariable(name: "n", scope: !549, file: !182, line: 176, type: !94)
!558 = !{!559}
!559 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!560 = !{!94, !207, !181, !208, !35, !189, !92, !561, !564}
!561 = !DISubprogram(name: "xcalloc", scope: !182, file: !182, line: 57, type: !562, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!562 = !DISubroutineType(types: !563)
!563 = !{!92, !96, !96}
!564 = !DISubprogram(name: "rpl_calloc", scope: !565, file: !565, line: 688, type: !562, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!565 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!566 = distinct !DICompileUnit(language: DW_LANG_C99, file: !567, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !40, retainedTypes: !568, nameTableKind: None)
!567 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!568 = !{!31, !123}
!569 = distinct !DICompileUnit(language: DW_LANG_C99, file: !570, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !571, retainedTypes: !580, nameTableKind: None)
!570 = !DIFile(filename: "lib/xdectoumax.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!571 = !{!572}
!572 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !573, line: 25, baseType: !6, size: 32, elements: !574)
!573 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!574 = !{!575, !576, !577, !578, !579}
!575 = !DIEnumerator(name: "LONGINT_OK", value: 0, isUnsigned: true)
!576 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1, isUnsigned: true)
!577 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2, isUnsigned: true)
!578 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3, isUnsigned: true)
!579 = !DIEnumerator(name: "LONGINT_INVALID", value: 4, isUnsigned: true)
!580 = !{!581, !151, !123}
!581 = !DISubprogram(name: "xstrtoumax", scope: !573, file: !573, line: 48, type: !582, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!582 = !DISubroutineType(types: !583)
!583 = !{!572, !37, !217, !39, !398, !37}
!584 = distinct !DICompileUnit(language: DW_LANG_C99, file: !585, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !586, retainedTypes: !587, nameTableKind: None)
!585 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!586 = !{!572, !376}
!587 = !{!39, !72}
!588 = distinct !DICompileUnit(language: DW_LANG_C99, file: !589, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !40, retainedTypes: !590, nameTableKind: None)
!589 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!590 = !{!92}
!591 = distinct !DICompileUnit(language: DW_LANG_C99, file: !592, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !40, retainedTypes: !593, nameTableKind: None)
!592 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!593 = !{!594, !94, !606}
!594 = !DISubprogram(name: "mbrtowc", scope: !436, file: !436, line: 296, type: !595, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!595 = !DISubroutineType(types: !596)
!596 = !{!96, !140, !37, !96, !597}
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !420, line: 13, size: 64, elements: !599)
!599 = !{!600, !601}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !598, file: !420, line: 15, baseType: !39, size: 32)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !598, file: !420, line: 20, baseType: !602, size: 32, offset: 32)
!602 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !598, file: !420, line: 16, size: 32, elements: !603)
!603 = !{!604, !605}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !602, file: !420, line: 18, baseType: !6, size: 32)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !602, file: !420, line: 19, baseType: !428, size: 32)
!606 = !DISubprogram(name: "hard_locale", scope: !607, file: !607, line: 26, type: !608, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!607 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!608 = !DISubroutineType(types: !609)
!609 = !{!223, !39}
!610 = distinct !DICompileUnit(language: DW_LANG_C99, file: !611, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !40, retainedTypes: !612, nameTableKind: None)
!611 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!612 = !{!613}
!613 = !DISubprogram(name: "rpl_fclose", scope: !614, file: !614, line: 672, type: !615, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!614 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!615 = !DISubroutineType(types: !616)
!616 = !{!39, !617}
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !47, line: 49, size: 1728, elements: !619)
!619 = !{!620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !618, file: !47, line: 51, baseType: !39, size: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !618, file: !47, line: 54, baseType: !35, size: 64, offset: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !618, file: !47, line: 55, baseType: !35, size: 64, offset: 128)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !618, file: !47, line: 56, baseType: !35, size: 64, offset: 192)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !618, file: !47, line: 57, baseType: !35, size: 64, offset: 256)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !618, file: !47, line: 58, baseType: !35, size: 64, offset: 320)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !618, file: !47, line: 59, baseType: !35, size: 64, offset: 384)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !618, file: !47, line: 60, baseType: !35, size: 64, offset: 448)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !618, file: !47, line: 61, baseType: !35, size: 64, offset: 512)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !618, file: !47, line: 64, baseType: !35, size: 64, offset: 576)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !618, file: !47, line: 65, baseType: !35, size: 64, offset: 640)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !618, file: !47, line: 66, baseType: !35, size: 64, offset: 704)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !618, file: !47, line: 68, baseType: !62, size: 64, offset: 768)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !618, file: !47, line: 70, baseType: !617, size: 64, offset: 832)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !618, file: !47, line: 72, baseType: !39, size: 32, offset: 896)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !618, file: !47, line: 73, baseType: !39, size: 32, offset: 928)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !618, file: !47, line: 74, baseType: !68, size: 64, offset: 960)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !618, file: !47, line: 77, baseType: !72, size: 16, offset: 1024)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !618, file: !47, line: 78, baseType: !74, size: 8, offset: 1040)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !618, file: !47, line: 79, baseType: !76, size: 8, offset: 1048)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !618, file: !47, line: 81, baseType: !80, size: 64, offset: 1088)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !618, file: !47, line: 89, baseType: !83, size: 64, offset: 1152)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !618, file: !47, line: 91, baseType: !85, size: 64, offset: 1216)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !618, file: !47, line: 92, baseType: !88, size: 64, offset: 1280)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !618, file: !47, line: 93, baseType: !617, size: 64, offset: 1344)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !618, file: !47, line: 94, baseType: !92, size: 64, offset: 1408)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !618, file: !47, line: 95, baseType: !94, size: 64, offset: 1472)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !618, file: !47, line: 96, baseType: !39, size: 32, offset: 1536)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !618, file: !47, line: 98, baseType: !99, size: 160, offset: 1568)
!649 = distinct !DICompileUnit(language: DW_LANG_C99, file: !650, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !40, retainedTypes: !651, nameTableKind: None)
!650 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!651 = !{!652}
!652 = !DISubprogram(name: "setlocale_null_r", scope: !653, file: !653, line: 64, type: !654, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !40)
!653 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!654 = !DISubroutineType(types: !655)
!655 = !{!39, !39, !35, !96}
!656 = distinct !DICompileUnit(language: DW_LANG_C99, file: !657, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !658, retainedTypes: !1045, nameTableKind: None)
!657 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!658 = !{!659}
!659 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !660, line: 41, baseType: !6, size: 32, elements: !661)
!660 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!661 = !{!662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044}
!662 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!663 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!664 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!665 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!666 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!667 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!668 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!669 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!670 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!671 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!672 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!673 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!674 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!675 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!676 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!677 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!678 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!679 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!680 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!681 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!682 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!683 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!684 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!685 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!686 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!687 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!688 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!689 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!690 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!691 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!692 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!693 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!694 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!695 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!696 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!697 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!698 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!699 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!700 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!701 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!702 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!703 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!704 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!705 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!706 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!707 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!708 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!709 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!710 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!711 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!712 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!713 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!714 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!715 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!716 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!717 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!719 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!720 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!721 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!722 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!723 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!724 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!725 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!726 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!727 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!728 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!729 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!730 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!731 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!732 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!733 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!734 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!735 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!736 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!737 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!738 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!739 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!740 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!741 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!742 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!743 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!744 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!745 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!746 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!747 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!748 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!749 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!750 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!751 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!752 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!753 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!754 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!755 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!756 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!757 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!758 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!759 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!760 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!761 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!762 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!763 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!764 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!765 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!766 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!767 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!768 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!769 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!770 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!771 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!772 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!773 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!774 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!775 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!776 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!777 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!778 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!779 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!780 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!781 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!782 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!783 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!784 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!785 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!786 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!787 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!788 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!789 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!790 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!791 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!793 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!794 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!795 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!796 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!797 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!798 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!799 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!800 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!801 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!802 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!803 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!804 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!805 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!806 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!807 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!808 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!809 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!810 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!812 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!813 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!814 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!815 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!816 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!817 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!818 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!819 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!820 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!821 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!822 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!823 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!824 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!825 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!826 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!827 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!828 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!829 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!830 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!831 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!832 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!833 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!834 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!835 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!836 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!837 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!838 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!839 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!840 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!841 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!842 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!843 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!844 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!845 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!846 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!847 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!857 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!884 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!885 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!886 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!887 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!894 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!895 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!896 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!898 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!899 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!900 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!901 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!902 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!903 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!904 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!905 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!906 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!907 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!908 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!909 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!910 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!911 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!912 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!913 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!914 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!915 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!916 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!917 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!918 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!919 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!920 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!921 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!922 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!923 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!924 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!925 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!926 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!927 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!928 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!929 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!930 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!931 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!932 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!933 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!934 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!935 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!936 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!937 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!938 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!939 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!940 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!941 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!942 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!943 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!944 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!945 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!946 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!947 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!948 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!949 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!950 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!951 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!952 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!953 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!954 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!955 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!956 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!957 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!958 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!959 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!960 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!961 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!962 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!963 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!964 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!965 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!966 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!967 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!968 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!969 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!970 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!971 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!972 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!973 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!974 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!975 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!976 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!977 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!978 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!979 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!980 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!981 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!982 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!983 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!984 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!985 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!986 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!987 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!988 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!989 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!990 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!991 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!992 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!993 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!994 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!995 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!996 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!997 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!998 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!999 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!1000 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!1001 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!1002 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!1003 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!1004 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!1005 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!1006 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!1007 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!1008 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!1009 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!1010 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!1011 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!1012 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!1013 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!1014 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!1015 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!1016 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!1017 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!1018 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!1019 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!1020 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!1021 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!1022 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!1023 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!1024 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!1025 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!1026 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!1027 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!1028 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!1029 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!1030 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!1031 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!1032 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!1033 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!1034 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!1035 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!1036 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
