; ModuleID = 'coreutils-8.32/src/head.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.linebuffer = type { [8192 x i8], i64, i64, %struct.linebuffer* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [FILE]...\0A\00", align 1

!24 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Copy_fd_status", file: !3, line: 74, baseType: !6, size: 32, elements: !26)
!26 = !{!27, !28, !29}
!27 = !DIEnumerator(name: "COPY_FD_OK", value: 0, isUnsigned: true)
!28 = !DIEnumerator(name: "COPY_FD_READ_ERROR", value: 1, isUnsigned: true)
!29 = !DIEnumerator(name: "COPY_FD_UNEXPECTED_EOF", value: 2, isUnsigned: true)
!30 = !{!6, !31, !33, !34, !39, !43, !41, !46}
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !35, line: 63, baseType: !36)
!35 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !37, line: 152, baseType: !38)
!37 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!38 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !44, line: 46, baseType: !45)
!44 = !DIFile(filename: "/usr/lib/clang/12.0.1/include/stddef.h", directory: "")
!45 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!46 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!47 = !{!48, !85, !87, !89, !91, !92, !106}
!48 = !DIGlobalVariableExpression(var: !49, expr: !DIExpression())
!49 = distinct !DIGlobalVariable(name: "default_file_list", scope: !50, file: !3, line: 938, type: !82, isLocal: true, isDefinition: true)
!50 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 918, type: !51, scopeLine: 919, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !55)
!51 = !DISubroutineType(types: !52)
!52 = !{!53, !53, !54}
!53 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!55 = !{!56, !57, !58, !59, !61, !62, !63, !67, !68, !69, !70, !73, !74, !75, !76}
!56 = !DILocalVariable(name: "argc", arg: 1, scope: !50, file: !3, line: 918, type: !53)
!57 = !DILocalVariable(name: "argv", arg: 2, scope: !50, file: !3, line: 918, type: !54)
!58 = !DILocalVariable(name: "header_mode", scope: !50, file: !3, line: 920, type: !5)
!59 = !DILocalVariable(name: "ok", scope: !50, file: !3, line: 921, type: !60)
!60 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!61 = !DILocalVariable(name: "c", scope: !50, file: !3, line: 922, type: !53)
!62 = !DILocalVariable(name: "i", scope: !50, file: !3, line: 923, type: !43)
!63 = !DILocalVariable(name: "n_units", scope: !50, file: !3, line: 926, type: !64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !65, line: 102, baseType: !66)
!65 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !37, line: 73, baseType: !45)
!67 = !DILocalVariable(name: "count_lines", scope: !50, file: !3, line: 930, type: !60)
!68 = !DILocalVariable(name: "elide_from_end", scope: !50, file: !3, line: 934, type: !60)
!69 = !DILocalVariable(name: "file_list", scope: !50, file: !3, line: 939, type: !39)
!70 = !DILocalVariable(name: "a", scope: !71, file: !3, line: 957, type: !31)
!71 = distinct !DILexicalBlock(scope: !72, file: !3, line: 956, column: 5)
!72 = distinct !DILexicalBlock(scope: !50, file: !3, line: 955, column: 7)
!73 = !DILocalVariable(name: "n_string", scope: !71, file: !3, line: 958, type: !31)
!74 = !DILocalVariable(name: "end_n_string", scope: !71, file: !3, line: 959, type: !31)
!75 = !DILocalVariable(name: "multiplier_char", scope: !71, file: !3, line: 960, type: !32)
!76 = !DILocalVariable(name: "umax_buf", scope: !77, file: !3, line: 1077, type: !79)
!77 = distinct !DILexicalBlock(scope: !78, file: !3, line: 1076, column: 5)
!78 = distinct !DILexicalBlock(scope: !50, file: !3, line: 1075, column: 8)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 168, elements: !80)
!80 = !{!81}
!81 = !DISubrange(count: 21)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 128, elements: !83)
!83 = !{!84}
!84 = !DISubrange(count: 2)
!85 = !DIGlobalVariableExpression(var: !86, expr: !DIExpression())
!86 = distinct !DIGlobalVariable(name: "presume_input_pipe", scope: !2, file: !3, line: 57, type: !60, isLocal: true, isDefinition: true)
!87 = !DIGlobalVariableExpression(var: !88, expr: !DIExpression())
!88 = distinct !DIGlobalVariable(name: "print_headers", scope: !2, file: !3, line: 60, type: !60, isLocal: true, isDefinition: true)
!89 = !DIGlobalVariableExpression(var: !90, expr: !DIExpression())
!90 = distinct !DIGlobalVariable(name: "line_end", scope: !2, file: !3, line: 63, type: !32, isLocal: true, isDefinition: true)
!91 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!92 = !DIGlobalVariableExpression(var: !93, expr: !DIExpression())
!93 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 88, type: !94, isLocal: true, isDefinition: true)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 2560, elements: !104)
!95 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !96)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !97, line: 50, size: 256, elements: !98)
!97 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!98 = !{!99, !100, !101, !103}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !96, file: !97, line: 52, baseType: !41, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !96, file: !97, line: 55, baseType: !53, size: 32, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !96, file: !97, line: 56, baseType: !102, size: 64, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !96, file: !97, line: 57, baseType: !53, size: 32, offset: 192)
!104 = !{!105}
!105 = !DISubrange(count: 10)
!106 = !DIGlobalVariableExpression(var: !107, expr: !DIExpression())
!107 = distinct !DIGlobalVariable(name: "first_file", scope: !108, file: !3, line: 170, type: !60, isLocal: true, isDefinition: true)
!108 = distinct !DISubprogram(name: "write_header", scope: !3, file: !3, line: 168, type: !109, scopeLine: 169, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !111)
!109 = !DISubroutineType(types: !110)
!110 = !{null, !41}
!111 = !{!112}
!112 = !DILocalVariable(name: "filename", arg: 1, scope: !108, file: !3, line: 168, type: !41)
!113 = !DIGlobalVariableExpression(var: !88, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!114 = !DIGlobalVariableExpression(var: !90, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 10, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!115 = !DIGlobalVariableExpression(var: !86, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!116 = !DIGlobalVariableExpression(var: !107, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(name: "Version", scope: !119, file: !120, line: 2, type: !41, isLocal: false, isDefinition: true)
!119 = distinct !DICompileUnit(language: DW_LANG_C99, file: !120, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !121, globals: !122, splitDebugInlining: false, nameTableKind: None)
!120 = !DIFile(filename: "src/version.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!121 = !{}
!122 = !{!117}
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(name: "file_name", scope: !125, file: !126, line: 46, type: !41, isLocal: true, isDefinition: true)
!125 = distinct !DICompileUnit(language: DW_LANG_C99, file: !126, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !121, globals: !127, splitDebugInlining: false, nameTableKind: None)
!126 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!127 = !{!123, !128}
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !125, file: !126, line: 56, type: !60, isLocal: true, isDefinition: true)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(name: "exit_failure", scope: !132, file: !133, line: 24, type: !135, isLocal: false, isDefinition: true)
!132 = distinct !DICompileUnit(language: DW_LANG_C99, file: !133, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !121, globals: !134, splitDebugInlining: false, nameTableKind: None)
!133 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!134 = !{!130}
!135 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !53)
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(name: "program_name", scope: !138, file: !139, line: 33, type: !41, isLocal: false, isDefinition: true)
!138 = distinct !DICompileUnit(language: DW_LANG_C99, file: !139, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !121, retainedTypes: !140, globals: !141, splitDebugInlining: false, nameTableKind: None)
!139 = !DIFile(filename: "lib/progname.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!140 = !{!33, !31}
!141 = !{!136}
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !144, file: !145, line: 85, type: !204, isLocal: false, isDefinition: true)
!144 = distinct !DICompileUnit(language: DW_LANG_C99, file: !145, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !146, retainedTypes: !167, globals: !169, splitDebugInlining: false, nameTableKind: None)
!145 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!146 = !{!11, !147, !152}
!147 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !12, line: 242, baseType: !6, size: 32, elements: !148)
!148 = !{!149, !150, !151}
!149 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!150 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!151 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!152 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !153, line: 46, baseType: !6, size: 32, elements: !154)
!153 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!154 = !{!155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166}
!155 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!156 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!157 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!158 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!159 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!160 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!161 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!162 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!163 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!164 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!165 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!166 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!167 = !{!53, !168, !43, !31}
!168 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!169 = !{!142, !170, !174, !186, !188, !193, !200, !202}
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !144, file: !145, line: 101, type: !172, isLocal: false, isDefinition: true)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 320, elements: !104)
!173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !144, file: !145, line: 1052, type: !176, isLocal: false, isDefinition: true)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !145, line: 65, size: 448, elements: !177)
!177 = !{!178, !179, !180, !184, !185}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !176, file: !145, line: 68, baseType: !11, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !176, file: !145, line: 71, baseType: !53, size: 32, offset: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !176, file: !145, line: 75, baseType: !181, size: 256, offset: 64)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 8)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !176, file: !145, line: 78, baseType: !41, size: 64, offset: 320)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !176, file: !145, line: 81, baseType: !41, size: 64, offset: 384)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !144, file: !145, line: 116, type: !176, isLocal: true, isDefinition: true)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(name: "slot0", scope: !144, file: !145, line: 842, type: !190, isLocal: true, isDefinition: true)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 2048, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 256)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(name: "slotvec", scope: !144, file: !145, line: 845, type: !195, isLocal: true, isDefinition: true)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !145, line: 834, size: 128, elements: !197)
!197 = !{!198, !199}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !196, file: !145, line: 836, baseType: !43, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !196, file: !145, line: 837, baseType: !31, size: 64, offset: 64)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(name: "nslots", scope: !144, file: !145, line: 843, type: !53, isLocal: true, isDefinition: true)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(name: "slotvec0", scope: !144, file: !145, line: 844, type: !196, isLocal: true, isDefinition: true)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 704, elements: !205)
!205 = !{!206}
!206 = !DISubrange(count: 11)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !209, file: !210, line: 26, type: !212, isLocal: false, isDefinition: true)
!209 = distinct !DICompileUnit(language: DW_LANG_C99, file: !210, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !121, globals: !211, splitDebugInlining: false, nameTableKind: None)
!210 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!211 = !{!207}
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 376, elements: !213)
!213 = !{!214}
!214 = !DISubrange(count: 47)
!215 = distinct !DICompileUnit(language: DW_LANG_C99, file: !216, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !121, retainedTypes: !217, splitDebugInlining: false, nameTableKind: None)
!216 = !DIFile(filename: "lib/full-read.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!217 = !{!31, !43}
!218 = distinct !DICompileUnit(language: DW_LANG_C99, file: !219, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !121, retainedTypes: !220, splitDebugInlining: false, nameTableKind: None)
!219 = !DIFile(filename: "lib/offtostr.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!220 = !{!221}
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !222, line: 85, baseType: !36)
!222 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!223 = distinct !DICompileUnit(language: DW_LANG_C99, file: !224, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !121, retainedTypes: !225, splitDebugInlining: false, nameTableKind: None)
!224 = !DIFile(filename: "lib/umaxtostr.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!225 = !{!64}
!226 = distinct !DICompileUnit(language: DW_LANG_C99, file: !227, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !228, splitDebugInlining: false, nameTableKind: None)
!227 = !DIFile(filename: "lib/safe-read.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!228 = !{!229}
!229 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !230, line: 40, baseType: !6, size: 32, elements: !231)
!230 = !DIFile(filename: "./lib/sys-limits.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!231 = !{!232}
!232 = !DIEnumerator(name: "SYS_BUFSIZE_MAX", value: 2146435072, isUnsigned: true)
!233 = distinct !DICompileUnit(language: DW_LANG_C99, file: !234, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !235, retainedTypes: !239, splitDebugInlining: false, nameTableKind: None)
!234 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!235 = !{!236}
!236 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !234, line: 40, baseType: !6, size: 32, elements: !237)
!237 = !{!238}
!238 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!239 = !{!33}
!240 = distinct !DICompileUnit(language: DW_LANG_C99, file: !241, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !242, retainedTypes: !256, splitDebugInlining: false, nameTableKind: None)
!241 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!242 = !{!243}
!243 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !245, file: !244, line: 186, baseType: !6, size: 32, elements: !254)
!244 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!245 = distinct !DISubprogram(name: "x2nrealloc", scope: !244, file: !244, line: 174, type: !246, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !240, retainedNodes: !249)
!246 = !DISubroutineType(types: !247)
!247 = !{!33, !33, !248, !43}
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!249 = !{!250, !251, !252, !253}
!250 = !DILocalVariable(name: "p", arg: 1, scope: !245, file: !244, line: 174, type: !33)
!251 = !DILocalVariable(name: "pn", arg: 2, scope: !245, file: !244, line: 174, type: !248)
!252 = !DILocalVariable(name: "s", arg: 3, scope: !245, file: !244, line: 174, type: !43)
!253 = !DILocalVariable(name: "n", scope: !245, file: !244, line: 176, type: !43)
!254 = !{!255}
!255 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!256 = !{!43, !31, !33}
!257 = distinct !DICompileUnit(language: DW_LANG_C99, file: !258, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !121, splitDebugInlining: false, nameTableKind: None)
!258 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!259 = distinct !DICompileUnit(language: DW_LANG_C99, file: !260, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !261, splitDebugInlining: false, nameTableKind: None)
!260 = !DIFile(filename: "lib/xdectoumax.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!261 = !{!262}
!262 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !263, line: 25, baseType: !6, size: 32, elements: !264)
!263 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!264 = !{!265, !266, !267, !268, !269}
!265 = !DIEnumerator(name: "LONGINT_OK", value: 0, isUnsigned: true)
!266 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1, isUnsigned: true)
!267 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2, isUnsigned: true)
!268 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3, isUnsigned: true)
!269 = !DIEnumerator(name: "LONGINT_INVALID", value: 4, isUnsigned: true)
!270 = distinct !DICompileUnit(language: DW_LANG_C99, file: !271, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !272, retainedTypes: !273, splitDebugInlining: false, nameTableKind: None)
!271 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!272 = !{!262, !152}
!273 = !{!53, !168}
!274 = distinct !DICompileUnit(language: DW_LANG_C99, file: !275, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !121, retainedTypes: !239, splitDebugInlining: false, nameTableKind: None)
!275 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!276 = distinct !DICompileUnit(language: DW_LANG_C99, file: !277, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !121, retainedTypes: !278, splitDebugInlining: false, nameTableKind: None)
!277 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!278 = !{!43}
!279 = distinct !DICompileUnit(language: DW_LANG_C99, file: !280, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !121, splitDebugInlining: false, nameTableKind: None)
!280 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!281 = distinct !DICompileUnit(language: DW_LANG_C99, file: !282, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !121, splitDebugInlining: false, nameTableKind: None)
!282 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!283 = distinct !DICompileUnit(language: DW_LANG_C99, file: !284, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !285, retainedTypes: !239, splitDebugInlining: false, nameTableKind: None)
!284 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!285 = !{!286}
!286 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !287, line: 41, baseType: !6, size: 32, elements: !288)
!287 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!288 = !{!289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671}
!289 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!290 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!291 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!292 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!293 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!294 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!295 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!296 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!297 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!298 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!299 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!300 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!301 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!302 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!303 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!304 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!305 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!306 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!307 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!308 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!309 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!310 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!311 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!312 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!313 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!314 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!315 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!316 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!317 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!318 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!319 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!320 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!321 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!322 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!323 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!324 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!325 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!326 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!327 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!328 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!329 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!330 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!331 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!332 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!333 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!334 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!335 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!336 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!337 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!338 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!339 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!340 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!341 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!342 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!343 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!344 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!345 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!346 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!347 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!348 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!349 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!350 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!351 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!352 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!353 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!354 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!355 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!356 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!357 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!358 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!359 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!360 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!361 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!362 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!363 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!364 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!365 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!366 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!367 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!368 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!369 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!370 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!371 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!372 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!373 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!374 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!375 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!376 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!377 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!378 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!379 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!380 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!381 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!382 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!383 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!384 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!385 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!386 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!387 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!388 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!389 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!390 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!391 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!392 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!393 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!394 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!395 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!396 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!397 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!398 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!399 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!400 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!401 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!402 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!403 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!404 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!405 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!406 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!407 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!408 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!409 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!410 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!411 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!412 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!413 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!414 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!415 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!416 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!417 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!418 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!419 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!420 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!421 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!422 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!423 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!424 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!425 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!426 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!427 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!428 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!429 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!430 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!431 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!432 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!433 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!434 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!435 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!436 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!437 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!438 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!439 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!440 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!441 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!442 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!443 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!444 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!445 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!446 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!447 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!448 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!449 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!450 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!451 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!452 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!453 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!454 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!455 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!456 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!457 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!458 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!459 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!460 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!461 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!462 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!463 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!464 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!465 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!466 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!467 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!468 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!469 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!470 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!471 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!472 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!473 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!474 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!475 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!476 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!477 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!478 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!479 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!480 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!481 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!482 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!483 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!484 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!485 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!486 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!487 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!488 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!489 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!490 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!491 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!492 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!493 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!494 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!495 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!496 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!497 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!498 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!499 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!500 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!501 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!502 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!503 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!504 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!505 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!506 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!507 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!508 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!509 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!510 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!511 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!512 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!513 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!514 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!515 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!516 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!517 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!518 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!519 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!520 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!521 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!522 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!523 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!524 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!525 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!526 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!527 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!528 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!529 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!530 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!531 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!532 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!533 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!534 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!535 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!536 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!537 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!538 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!539 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!540 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!541 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!542 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!543 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!544 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!545 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!546 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!547 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!548 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!549 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!550 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!551 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!552 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!553 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!554 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!555 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!556 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!557 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!558 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!559 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!560 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!561 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!562 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!563 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!564 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!565 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!566 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!567 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!568 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!569 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!570 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!571 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!572 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!573 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!574 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!575 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!576 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!577 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!578 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!579 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!580 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!581 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!582 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!583 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!584 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!585 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!586 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!587 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!588 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!589 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!590 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!591 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!592 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!593 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!594 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!595 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!596 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!597 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!598 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!599 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!600 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!601 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!602 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!603 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!604 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!605 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!606 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!607 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!608 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!609 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!610 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!611 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!612 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!613 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!614 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!615 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!616 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!617 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!618 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!619 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!620 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!621 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!622 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!623 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!624 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!625 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!626 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!627 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!628 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!629 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!630 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!631 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!632 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!633 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!634 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!635 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!636 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!637 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!661 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!662 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!663 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!664 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!665 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!666 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!667 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!668 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!669 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!670 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!671 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!672 = distinct !DICompileUnit(language: DW_LANG_C99, file: !673, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !121, retainedTypes: !239, splitDebugInlining: false, nameTableKind: None)
!673 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!674 = distinct !DICompileUnit(language: DW_LANG_C99, file: !675, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !121, splitDebugInlining: false, nameTableKind: None)
!675 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!676 = distinct !DICompileUnit(language: DW_LANG_C99, file: !677, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !121, retainedTypes: !239, splitDebugInlining: false, nameTableKind: None)
!677 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!678 = distinct !DICompileUnit(language: DW_LANG_C99, file: !679, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !121, retainedTypes: !239, splitDebugInlining: false, nameTableKind: None)
!679 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!680 = !{!"clang version 12.0.1"}
!681 = !{i32 7, !"Dwarf Version", i32 4}
!682 = !{i32 2, !"Debug Info Version", i32 3}
!683 = !{i32 1, !"wchar_size", i32 4}
!684 = !{i32 7, !"PIC Level", i32 2}
!685 = !{i32 7, !"PIE Level", i32 2}
!686 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 104, type: !687, scopeLine: 105, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !689)
!687 = !DISubroutineType(types: !688)
!688 = !{null, !53}
!689 = !{!690}
!690 = !DILocalVariable(name: "status", arg: 1, scope: !686, file: !3, line: 104, type: !53)
!691 = !DILocation(line: 0, scope: !686)
!692 = !DILocation(line: 106, column: 14, scope: !693)
!693 = distinct !DILexicalBlock(scope: !686, file: !3, line: 106, column: 7)
!694 = !DILocation(line: 106, column: 7, scope: !686)
!695 = !DILocation(line: 107, column: 5, scope: !696)
!696 = distinct !DILexicalBlock(scope: !693, file: !3, line: 107, column: 5)
!697 = !{!698, !698, i64 0}
!698 = !{!"any pointer", !699, i64 0}
!699 = !{!"omnipotent char", !700, i64 0}
!700 = !{!"Simple C/C++ TBAA"}
!701 = !DILocation(line: 110, column: 7, scope: !702)
!702 = distinct !DILexicalBlock(scope: !693, file: !3, line: 109, column: 5)
!703 = !DILocation(line: 114, column: 7, scope: !702)
!704 = !DILocation(line: 583, column: 3, scope: !705, inlinedAt: !709)
!705 = distinct !DISubprogram(name: "emit_stdin_note", scope: !706, file: !706, line: 581, type: !707, scopeLine: 582, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !121)
!706 = !DIFile(filename: "src/system.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!707 = !DISubroutineType(types: !708)
!708 = !{null}
!709 = distinct !DILocation(line: 119, column: 7, scope: !702)
!710 = !DILocation(line: 590, column: 3, scope: !711, inlinedAt: !712)
!711 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !706, file: !706, line: 588, type: !707, scopeLine: 589, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !121)
!712 = distinct !DILocation(line: 120, column: 7, scope: !702)
!713 = !DILocation(line: 122, column: 7, scope: !702)
!714 = !DILocation(line: 130, column: 7, scope: !702)
!715 = !DILocation(line: 134, column: 7, scope: !702)
!716 = !DILocation(line: 137, column: 7, scope: !702)
!717 = !DILocation(line: 138, column: 7, scope: !702)
!718 = !DILocation(line: 139, column: 7, scope: !702)
!719 = !DILocalVariable(name: "program", arg: 1, scope: !720, file: !706, line: 634, type: !41)
!720 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !706, file: !706, line: 634, type: !109, scopeLine: 635, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !721)
!721 = !{!719, !722, !731, !732, !734}
!722 = !DILocalVariable(name: "infomap", scope: !720, file: !706, line: 636, type: !723)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !724, size: 896, elements: !729)
!724 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !725)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !720, file: !706, line: 636, size: 128, elements: !726)
!726 = !{!727, !728}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !725, file: !706, line: 636, baseType: !41, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !725, file: !706, line: 636, baseType: !41, size: 64, offset: 64)
!729 = !{!730}
!730 = !DISubrange(count: 7)
!731 = !DILocalVariable(name: "node", scope: !720, file: !706, line: 646, type: !41)
!732 = !DILocalVariable(name: "map_prog", scope: !720, file: !706, line: 647, type: !733)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!734 = !DILocalVariable(name: "lc_messages", scope: !720, file: !706, line: 659, type: !41)
!735 = !DILocation(line: 0, scope: !720, inlinedAt: !736)
!736 = distinct !DILocation(line: 146, column: 7, scope: !702)
!737 = !DILocation(line: 636, column: 3, scope: !720, inlinedAt: !736)
!738 = !DILocation(line: 636, column: 67, scope: !720, inlinedAt: !736)
!739 = !DILocation(line: 647, column: 36, scope: !720, inlinedAt: !736)
!740 = !DILocation(line: 649, column: 3, scope: !720, inlinedAt: !736)
!741 = !DILocation(line: 649, column: 33, scope: !720, inlinedAt: !736)
!742 = !DILocation(line: 650, column: 13, scope: !720, inlinedAt: !736)
!743 = !DILocation(line: 649, column: 20, scope: !720, inlinedAt: !736)
!744 = !{!745, !698, i64 0}
!745 = !{!"infomap", !698, i64 0, !698, i64 8}
!746 = !DILocation(line: 649, column: 10, scope: !720, inlinedAt: !736)
!747 = !DILocation(line: 649, column: 28, scope: !720, inlinedAt: !736)
!748 = distinct !{!748, !740, !742, !749}
!749 = !{!"llvm.loop.mustprogress"}
!750 = !DILocation(line: 652, column: 17, scope: !751, inlinedAt: !736)
!751 = distinct !DILexicalBlock(scope: !720, file: !706, line: 652, column: 7)
!752 = !{!745, !698, i64 8}
!753 = !DILocation(line: 652, column: 7, scope: !751, inlinedAt: !736)
!754 = !DILocation(line: 652, column: 7, scope: !720, inlinedAt: !736)
!755 = !DILocation(line: 655, column: 3, scope: !720, inlinedAt: !736)
!756 = !DILocation(line: 659, column: 29, scope: !720, inlinedAt: !736)
!757 = !DILocation(line: 660, column: 7, scope: !758, inlinedAt: !736)
!758 = distinct !DILexicalBlock(scope: !720, file: !706, line: 660, column: 7)
!759 = !DILocation(line: 660, column: 19, scope: !758, inlinedAt: !736)
!760 = !DILocation(line: 660, column: 22, scope: !758, inlinedAt: !736)
!761 = !DILocation(line: 660, column: 7, scope: !720, inlinedAt: !736)
!762 = !DILocation(line: 666, column: 7, scope: !763, inlinedAt: !736)
!763 = distinct !DILexicalBlock(scope: !758, file: !706, line: 661, column: 5)
!764 = !DILocation(line: 668, column: 5, scope: !763, inlinedAt: !736)
!765 = !DILocation(line: 669, column: 3, scope: !720, inlinedAt: !736)
!766 = !DILocation(line: 671, column: 3, scope: !720, inlinedAt: !736)
!767 = !DILocation(line: 673, column: 1, scope: !720, inlinedAt: !736)
!768 = !DILocation(line: 148, column: 3, scope: !686)
!769 = !DISubprogram(name: "dcgettext", scope: !770, file: !770, line: 51, type: !771, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !121)
!770 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!771 = !DISubroutineType(types: !772)
!772 = !{!31, !41, !41, !53}
!773 = !DISubprogram(name: "fputs_unlocked", scope: !35, file: !35, line: 667, type: !774, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !121)
!774 = !DISubroutineType(types: !775)
!775 = !{!53, !41, !776}
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !778, line: 49, size: 1728, elements: !779)
!778 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!779 = !{!780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !795, !796, !797, !798, !799, !800, !802, !806, !809, !811, !814, !817, !818, !819, !820, !821}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !777, file: !778, line: 51, baseType: !53, size: 32)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !777, file: !778, line: 54, baseType: !31, size: 64, offset: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !777, file: !778, line: 55, baseType: !31, size: 64, offset: 128)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !777, file: !778, line: 56, baseType: !31, size: 64, offset: 192)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !777, file: !778, line: 57, baseType: !31, size: 64, offset: 256)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !777, file: !778, line: 58, baseType: !31, size: 64, offset: 320)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !777, file: !778, line: 59, baseType: !31, size: 64, offset: 384)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !777, file: !778, line: 60, baseType: !31, size: 64, offset: 448)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !777, file: !778, line: 61, baseType: !31, size: 64, offset: 512)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !777, file: !778, line: 64, baseType: !31, size: 64, offset: 576)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !777, file: !778, line: 65, baseType: !31, size: 64, offset: 640)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !777, file: !778, line: 66, baseType: !31, size: 64, offset: 704)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !777, file: !778, line: 68, baseType: !793, size: 64, offset: 768)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !778, line: 36, flags: DIFlagFwdDecl)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !777, file: !778, line: 70, baseType: !776, size: 64, offset: 832)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !777, file: !778, line: 72, baseType: !53, size: 32, offset: 896)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !777, file: !778, line: 73, baseType: !53, size: 32, offset: 928)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !777, file: !778, line: 74, baseType: !36, size: 64, offset: 960)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !777, file: !778, line: 77, baseType: !168, size: 16, offset: 1024)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !777, file: !778, line: 78, baseType: !801, size: 8, offset: 1040)
!801 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !777, file: !778, line: 79, baseType: !803, size: 8, offset: 1048)
!803 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 8, elements: !804)
!804 = !{!805}
!805 = !DISubrange(count: 1)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !777, file: !778, line: 81, baseType: !807, size: 64, offset: 1088)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !778, line: 43, baseType: null)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !777, file: !778, line: 89, baseType: !810, size: 64, offset: 1152)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !37, line: 153, baseType: !38)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !777, file: !778, line: 91, baseType: !812, size: 64, offset: 1216)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !778, line: 37, flags: DIFlagFwdDecl)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !777, file: !778, line: 92, baseType: !815, size: 64, offset: 1280)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !778, line: 38, flags: DIFlagFwdDecl)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !777, file: !778, line: 93, baseType: !776, size: 64, offset: 1344)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !777, file: !778, line: 94, baseType: !33, size: 64, offset: 1408)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !777, file: !778, line: 95, baseType: !43, size: 64, offset: 1472)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !777, file: !778, line: 96, baseType: !53, size: 32, offset: 1536)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !777, file: !778, line: 98, baseType: !822, size: 160, offset: 1568)
!822 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 160, elements: !823)
!823 = !{!824}
!824 = !DISubrange(count: 20)
!825 = !DISubprogram(name: "setlocale", scope: !826, file: !826, line: 122, type: !827, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !121)
!826 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!827 = !DISubroutineType(types: !828)
!828 = !{!31, !53, !41}
!829 = !DILocation(line: 0, scope: !50)
!830 = !DILocation(line: 942, column: 21, scope: !50)
!831 = !DILocation(line: 942, column: 3, scope: !50)
!832 = !DILocation(line: 943, column: 3, scope: !50)
!833 = !DILocation(line: 944, column: 3, scope: !50)
!834 = !DILocation(line: 945, column: 3, scope: !50)
!835 = !DILocation(line: 947, column: 3, scope: !50)
!836 = !DILocation(line: 949, column: 19, scope: !50)
!837 = !DILocation(line: 951, column: 17, scope: !50)
!838 = !DILocation(line: 953, column: 12, scope: !50)
!839 = !DILocation(line: 955, column: 9, scope: !72)
!840 = !DILocation(line: 955, column: 16, scope: !72)
!841 = !DILocation(line: 955, column: 19, scope: !72)
!842 = !{!699, !699, i64 0}
!843 = !DILocation(line: 955, column: 30, scope: !72)
!844 = !DILocation(line: 955, column: 37, scope: !72)
!845 = !DILocation(line: 955, column: 40, scope: !72)
!846 = !DILocation(line: 955, column: 7, scope: !50)
!847 = !DILocation(line: 0, scope: !71)
!848 = !DILocation(line: 964, column: 10, scope: !71)
!849 = !DILocation(line: 965, column: 14, scope: !71)
!850 = distinct !{!850, !851, !852, !749}
!851 = !DILocation(line: 964, column: 7, scope: !71)
!852 = !DILocation(line: 965, column: 26, scope: !71)
!853 = !DILocation(line: 971, column: 7, scope: !854)
!854 = distinct !DILexicalBlock(scope: !71, file: !3, line: 971, column: 7)
!855 = !DILocation(line: 1011, column: 21, scope: !71)
!856 = !DILocalVariable(name: "count_lines", arg: 1, scope: !857, file: !3, line: 910, type: !60)
!857 = distinct !DISubprogram(name: "string_to_integer", scope: !3, file: !3, line: 910, type: !858, scopeLine: 911, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !860)
!858 = !DISubroutineType(types: !859)
!859 = !{!64, !60, !41}
!860 = !{!856, !861}
!861 = !DILocalVariable(name: "n_string", arg: 2, scope: !857, file: !3, line: 910, type: !41)
!862 = !DILocation(line: 0, scope: !857, inlinedAt: !863)
!863 = distinct !DILocation(line: 1015, column: 17, scope: !71)
!864 = !DILocation(line: 913, column: 22, scope: !857, inlinedAt: !863)
!865 = !DILocation(line: 973, column: 19, scope: !866)
!866 = distinct !DILexicalBlock(scope: !867, file: !3, line: 972, column: 9)
!867 = distinct !DILexicalBlock(scope: !854, file: !3, line: 971, column: 7)
!868 = !DILocation(line: 973, column: 11, scope: !866)
!869 = !DILocation(line: 985, column: 15, scope: !870)
!870 = distinct !DILexicalBlock(scope: !866, file: !3, line: 974, column: 13)
!871 = !DILocation(line: 989, column: 15, scope: !870)
!872 = !DILocation(line: 993, column: 15, scope: !870)
!873 = !DILocation(line: 997, column: 15, scope: !870)
!874 = !DILocation(line: 1000, column: 24, scope: !870)
!875 = !DILocation(line: 1001, column: 15, scope: !870)
!876 = !DILocation(line: 1004, column: 28, scope: !870)
!877 = !DILocation(line: 1004, column: 64, scope: !870)
!878 = !DILocation(line: 1004, column: 15, scope: !870)
!879 = !DILocation(line: 1005, column: 15, scope: !870)
!880 = !DILocation(line: 971, column: 19, scope: !867)
!881 = !DILocation(line: 971, column: 14, scope: !867)
!882 = distinct !{!882, !853, !883, !749}
!883 = !DILocation(line: 1007, column: 9, scope: !854)
!884 = !DILocation(line: 1012, column: 11, scope: !885)
!885 = distinct !DILexicalBlock(scope: !71, file: !3, line: 1012, column: 11)
!886 = !DILocation(line: 1012, column: 11, scope: !71)
!887 = !DILocation(line: 1013, column: 11, scope: !885)
!888 = !DILocation(line: 1013, column: 27, scope: !885)
!889 = !DILocation(line: 1013, column: 9, scope: !885)
!890 = !DILocation(line: 1015, column: 36, scope: !71)
!891 = !DILocation(line: 912, column: 10, scope: !857, inlinedAt: !863)
!892 = !DILocation(line: 1018, column: 17, scope: !71)
!893 = !DILocation(line: 1018, column: 15, scope: !71)
!894 = !DILocation(line: 1020, column: 11, scope: !71)
!895 = !DILocation(line: 1021, column: 5, scope: !71)
!896 = !DILocation(line: 920, column: 20, scope: !50)
!897 = !DILocation(line: 930, column: 8, scope: !50)
!898 = !DILocation(line: 1023, column: 3, scope: !50)
!899 = !DILocation(line: 1023, column: 15, scope: !50)
!900 = distinct !{!900, !898, !901, !749}
!901 = !DILocation(line: 1069, column: 5, scope: !50)
!902 = !DILocation(line: 1029, column: 30, scope: !903)
!903 = distinct !DILexicalBlock(scope: !904, file: !3, line: 1027, column: 9)
!904 = distinct !DILexicalBlock(scope: !50, file: !3, line: 1025, column: 5)
!905 = !DILocation(line: 1030, column: 11, scope: !903)
!906 = !DILocation(line: 1034, column: 30, scope: !903)
!907 = !DILocation(line: 1034, column: 29, scope: !903)
!908 = !DILocation(line: 1034, column: 37, scope: !903)
!909 = !DILocation(line: 1035, column: 15, scope: !903)
!910 = !DILocation(line: 1036, column: 13, scope: !911)
!911 = distinct !DILexicalBlock(scope: !903, file: !3, line: 1035, column: 15)
!912 = !DILocation(line: 1037, column: 53, scope: !903)
!913 = !DILocation(line: 0, scope: !857, inlinedAt: !914)
!914 = distinct !DILocation(line: 1037, column: 21, scope: !903)
!915 = !DILocation(line: 914, column: 36, scope: !857, inlinedAt: !914)
!916 = !DILocation(line: 912, column: 10, scope: !857, inlinedAt: !914)
!917 = !DILocation(line: 1038, column: 11, scope: !903)
!918 = !DILocation(line: 1042, column: 30, scope: !903)
!919 = !DILocation(line: 1042, column: 29, scope: !903)
!920 = !DILocation(line: 1042, column: 37, scope: !903)
!921 = !DILocation(line: 1043, column: 15, scope: !903)
!922 = !DILocation(line: 1044, column: 13, scope: !923)
!923 = distinct !DILexicalBlock(scope: !903, file: !3, line: 1043, column: 15)
!924 = !DILocation(line: 1045, column: 53, scope: !903)
!925 = !DILocation(line: 0, scope: !857, inlinedAt: !926)
!926 = distinct !DILocation(line: 1045, column: 21, scope: !903)
!927 = !DILocation(line: 913, column: 36, scope: !857, inlinedAt: !926)
!928 = !DILocation(line: 912, column: 10, scope: !857, inlinedAt: !926)
!929 = !DILocation(line: 1046, column: 11, scope: !903)
!930 = !DILocation(line: 0, scope: !903)
!931 = !DILocation(line: 1054, column: 11, scope: !903)
!932 = !DILocation(line: 1057, column: 20, scope: !903)
!933 = !DILocation(line: 1058, column: 11, scope: !903)
!934 = !DILocation(line: 1060, column: 9, scope: !903)
!935 = !DILocation(line: 1062, column: 9, scope: !903)
!936 = !DILocation(line: 1065, column: 15, scope: !937)
!937 = distinct !DILexicalBlock(scope: !903, file: !3, line: 1065, column: 15)
!938 = !DILocation(line: 1065, column: 15, scope: !903)
!939 = !DILocation(line: 1066, column: 26, scope: !937)
!940 = !DILocation(line: 1066, column: 13, scope: !937)
!941 = !DILocation(line: 1067, column: 11, scope: !903)
!942 = !DILocation(line: 1072, column: 7, scope: !943)
!943 = distinct !DILexicalBlock(scope: !50, file: !3, line: 1071, column: 7)
!944 = !DILocation(line: 1072, column: 44, scope: !943)
!945 = !{!946, !946, i64 0}
!946 = !{!"int", !699, i64 0}
!947 = !DILocation(line: 1072, column: 58, scope: !943)
!948 = !DILocation(line: 1072, column: 51, scope: !943)
!949 = !DILocation(line: 1071, column: 7, scope: !50)
!950 = !DILocation(line: 1073, column: 19, scope: !943)
!951 = !DILocation(line: 1073, column: 5, scope: !943)
!952 = !DILocation(line: 1075, column: 10, scope: !78)
!953 = !DILocation(line: 1075, column: 22, scope: !78)
!954 = !DILocation(line: 1075, column: 25, scope: !78)
!955 = !DILocation(line: 1075, column: 40, scope: !78)
!956 = !DILocation(line: 1077, column: 7, scope: !77)
!957 = !DILocation(line: 1077, column: 12, scope: !77)
!958 = !DILocation(line: 1078, column: 7, scope: !77)
!959 = !DILocation(line: 1082, column: 16, scope: !50)
!960 = !DILocation(line: 1082, column: 23, scope: !50)
!961 = !DILocation(line: 1088, column: 15, scope: !962)
!962 = distinct !DILexicalBlock(scope: !963, file: !3, line: 1088, column: 3)
!963 = distinct !DILexicalBlock(scope: !50, file: !3, line: 1088, column: 3)
!964 = !DILocation(line: 1088, column: 3, scope: !963)
!965 = !DILocalVariable(name: "filename", arg: 1, scope: !966, file: !3, line: 870, type: !41)
!966 = distinct !DISubprogram(name: "head_file", scope: !3, file: !3, line: 870, type: !967, scopeLine: 872, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !969)
!967 = !DISubroutineType(types: !968)
!968 = !{!60, !41, !64, !60, !60}
!969 = !{!965, !970, !971, !972, !973, !974, !975}
!970 = !DILocalVariable(name: "n_units", arg: 2, scope: !966, file: !3, line: 870, type: !64)
!971 = !DILocalVariable(name: "count_lines", arg: 3, scope: !966, file: !3, line: 870, type: !60)
!972 = !DILocalVariable(name: "elide_from_end", arg: 4, scope: !966, file: !3, line: 871, type: !60)
!973 = !DILocalVariable(name: "fd", scope: !966, file: !3, line: 873, type: !53)
!974 = !DILocalVariable(name: "ok", scope: !966, file: !3, line: 874, type: !60)
!975 = !DILocalVariable(name: "is_stdin", scope: !966, file: !3, line: 875, type: !60)
!976 = !DILocation(line: 0, scope: !966, inlinedAt: !977)
!977 = distinct !DILocation(line: 1089, column: 11, scope: !962)
!978 = !DILocation(line: 875, column: 19, scope: !966, inlinedAt: !977)
!979 = !DILocation(line: 877, column: 7, scope: !966, inlinedAt: !977)
!980 = !DILocation(line: 879, column: 23, scope: !981, inlinedAt: !977)
!981 = distinct !DILexicalBlock(scope: !982, file: !3, line: 878, column: 5)
!982 = distinct !DILexicalBlock(scope: !966, file: !3, line: 877, column: 7)
!983 = !DILocation(line: 881, column: 18, scope: !981, inlinedAt: !977)
!984 = !DILocation(line: 883, column: 5, scope: !981, inlinedAt: !977)
!985 = !DILocation(line: 886, column: 12, scope: !986, inlinedAt: !977)
!986 = distinct !DILexicalBlock(scope: !982, file: !3, line: 885, column: 5)
!987 = !DILocation(line: 887, column: 14, scope: !988, inlinedAt: !977)
!988 = distinct !DILexicalBlock(scope: !986, file: !3, line: 887, column: 11)
!989 = !DILocation(line: 887, column: 11, scope: !986, inlinedAt: !977)
!990 = !DILocation(line: 889, column: 21, scope: !991, inlinedAt: !977)
!991 = distinct !DILexicalBlock(scope: !988, file: !3, line: 888, column: 9)
!992 = !DILocation(line: 889, column: 28, scope: !991, inlinedAt: !977)
!993 = !DILocation(line: 889, column: 61, scope: !991, inlinedAt: !977)
!994 = !DILocation(line: 889, column: 11, scope: !991, inlinedAt: !977)
!995 = !DILocation(line: 890, column: 11, scope: !991, inlinedAt: !977)
!996 = !DILocation(line: 0, scope: !982, inlinedAt: !977)
!997 = !DILocalVariable(name: "buffer", scope: !998, file: !3, line: 801, type: !1050)
!998 = distinct !DISubprogram(name: "head_lines", scope: !3, file: !3, line: 799, type: !999, scopeLine: 800, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1001)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!60, !41, !53, !64}
!1001 = !{!1002, !1003, !1004, !997, !1005, !1007, !1008, !1011}
!1002 = !DILocalVariable(name: "filename", arg: 1, scope: !998, file: !3, line: 799, type: !41)
!1003 = !DILocalVariable(name: "fd", arg: 2, scope: !998, file: !3, line: 799, type: !53)
!1004 = !DILocalVariable(name: "lines_to_write", arg: 3, scope: !998, file: !3, line: 799, type: !64)
!1005 = !DILocalVariable(name: "bytes_read", scope: !1006, file: !3, line: 805, type: !43)
!1006 = distinct !DILexicalBlock(scope: !998, file: !3, line: 804, column: 5)
!1007 = !DILocalVariable(name: "bytes_to_write", scope: !1006, file: !3, line: 806, type: !43)
!1008 = !DILocalVariable(name: "n_bytes_past_EOL", scope: !1009, file: !3, line: 818, type: !34)
!1009 = distinct !DILexicalBlock(scope: !1010, file: !3, line: 817, column: 11)
!1010 = distinct !DILexicalBlock(scope: !1006, file: !3, line: 816, column: 13)
!1011 = !DILocalVariable(name: "st", scope: !1012, file: !3, line: 824, type: !1014)
!1012 = distinct !DILexicalBlock(scope: !1013, file: !3, line: 823, column: 15)
!1013 = distinct !DILexicalBlock(scope: !1009, file: !3, line: 822, column: 17)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !1015, line: 26, size: 1152, elements: !1016)
!1015 = !DIFile(filename: "/usr/include/bits/struct_stat.h", directory: "")
!1016 = !{!1017, !1019, !1021, !1023, !1025, !1027, !1029, !1030, !1031, !1032, !1034, !1036, !1044, !1045, !1046}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1014, file: !1015, line: 28, baseType: !1018, size: 64)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !37, line: 145, baseType: !45)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1014, file: !1015, line: 33, baseType: !1020, size: 64, offset: 64)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !37, line: 148, baseType: !45)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1014, file: !1015, line: 41, baseType: !1022, size: 64, offset: 128)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !37, line: 151, baseType: !45)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1014, file: !1015, line: 42, baseType: !1024, size: 32, offset: 192)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !37, line: 150, baseType: !6)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1014, file: !1015, line: 44, baseType: !1026, size: 32, offset: 224)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !37, line: 146, baseType: !6)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1014, file: !1015, line: 45, baseType: !1028, size: 32, offset: 256)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !37, line: 147, baseType: !6)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !1014, file: !1015, line: 47, baseType: !53, size: 32, offset: 288)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1014, file: !1015, line: 49, baseType: !1018, size: 64, offset: 320)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1014, file: !1015, line: 54, baseType: !36, size: 64, offset: 384)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1014, file: !1015, line: 58, baseType: !1033, size: 64, offset: 448)
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !37, line: 175, baseType: !38)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1014, file: !1015, line: 60, baseType: !1035, size: 64, offset: 512)
!1035 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !37, line: 180, baseType: !38)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1014, file: !1015, line: 71, baseType: !1037, size: 128, offset: 576)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !1038, line: 10, size: 128, elements: !1039)
!1038 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!1039 = !{!1040, !1042}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1037, file: !1038, line: 12, baseType: !1041, size: 64)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !37, line: 160, baseType: !38)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1037, file: !1038, line: 16, baseType: !1043, size: 64, offset: 64)
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !37, line: 197, baseType: !38)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !1014, file: !1015, line: 72, baseType: !1037, size: 128, offset: 704)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !1014, file: !1015, line: 73, baseType: !1037, size: 128, offset: 832)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !1014, file: !1015, line: 86, baseType: !1047, size: 192, offset: 960)
!1047 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1043, size: 192, elements: !1048)
!1048 = !{!1049}
!1049 = !DISubrange(count: 3)
!1050 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 65536, elements: !1051)
!1051 = !{!1052}
!1052 = !DISubrange(count: 8192)
!1053 = !DILocation(line: 801, column: 8, scope: !998, inlinedAt: !1054)
!1054 = distinct !DILocation(line: 864, column: 12, scope: !1055, inlinedAt: !1069)
!1055 = distinct !DILexicalBlock(scope: !1056, file: !3, line: 863, column: 7)
!1056 = distinct !DISubprogram(name: "head", scope: !3, file: !3, line: 836, type: !1057, scopeLine: 838, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1059)
!1057 = !DISubroutineType(types: !1058)
!1058 = !{!60, !41, !53, !64, !60, !60}
!1059 = !{!1060, !1061, !1062, !1063, !1064, !1065, !1068}
!1060 = !DILocalVariable(name: "filename", arg: 1, scope: !1056, file: !3, line: 836, type: !41)
!1061 = !DILocalVariable(name: "fd", arg: 2, scope: !1056, file: !3, line: 836, type: !53)
!1062 = !DILocalVariable(name: "n_units", arg: 3, scope: !1056, file: !3, line: 836, type: !64)
!1063 = !DILocalVariable(name: "count_lines", arg: 4, scope: !1056, file: !3, line: 836, type: !60)
!1064 = !DILocalVariable(name: "elide_from_end", arg: 5, scope: !1056, file: !3, line: 837, type: !60)
!1065 = !DILocalVariable(name: "current_pos", scope: !1066, file: !3, line: 844, type: !34)
!1066 = distinct !DILexicalBlock(scope: !1067, file: !3, line: 843, column: 5)
!1067 = distinct !DILexicalBlock(scope: !1056, file: !3, line: 842, column: 7)
!1068 = !DILocalVariable(name: "st", scope: !1066, file: !3, line: 845, type: !1014)
!1069 = distinct !DILocation(line: 894, column: 8, scope: !966, inlinedAt: !977)
!1070 = !DILocalVariable(name: "buf", scope: !1071, file: !3, line: 196, type: !1050)
!1071 = distinct !DISubprogram(name: "copy_fd", scope: !3, file: !3, line: 194, type: !1072, scopeLine: 195, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1074)
!1072 = !DISubroutineType(types: !1073)
!1073 = !{!25, !53, !64}
!1074 = !{!1075, !1076, !1070, !1077, !1079, !1081}
!1075 = !DILocalVariable(name: "src_fd", arg: 1, scope: !1071, file: !3, line: 194, type: !53)
!1076 = !DILocalVariable(name: "n_bytes", arg: 2, scope: !1071, file: !3, line: 194, type: !64)
!1077 = !DILocalVariable(name: "buf_size", scope: !1071, file: !3, line: 197, type: !1078)
!1078 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!1079 = !DILocalVariable(name: "n_to_read", scope: !1080, file: !3, line: 202, type: !43)
!1080 = distinct !DILexicalBlock(scope: !1071, file: !3, line: 201, column: 5)
!1081 = !DILocalVariable(name: "n_read", scope: !1080, file: !3, line: 203, type: !43)
!1082 = !DILocation(line: 196, column: 8, scope: !1071, inlinedAt: !1083)
!1083 = distinct !DILocation(line: 481, column: 33, scope: !1084, inlinedAt: !1101)
!1084 = distinct !DILexicalBlock(scope: !1085, file: !3, line: 472, column: 5)
!1085 = distinct !DILexicalBlock(scope: !1086, file: !3, line: 469, column: 7)
!1086 = distinct !DISubprogram(name: "elide_tail_bytes_file", scope: !3, file: !3, line: 465, type: !1087, scopeLine: 467, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1091)
!1087 = !DISubroutineType(types: !1088)
!1088 = !{!60, !41, !53, !64, !1089, !34}
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64)
!1090 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1014)
!1091 = !{!1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100}
!1092 = !DILocalVariable(name: "filename", arg: 1, scope: !1086, file: !3, line: 465, type: !41)
!1093 = !DILocalVariable(name: "fd", arg: 2, scope: !1086, file: !3, line: 465, type: !53)
!1094 = !DILocalVariable(name: "n_elide", arg: 3, scope: !1086, file: !3, line: 465, type: !64)
!1095 = !DILocalVariable(name: "st", arg: 4, scope: !1086, file: !3, line: 466, type: !1089)
!1096 = !DILocalVariable(name: "current_pos", arg: 5, scope: !1086, file: !3, line: 466, type: !34)
!1097 = !DILocalVariable(name: "size", scope: !1086, file: !3, line: 468, type: !34)
!1098 = !DILocalVariable(name: "diff", scope: !1084, file: !3, line: 475, type: !34)
!1099 = !DILocalVariable(name: "bytes_remaining", scope: !1084, file: !3, line: 476, type: !34)
!1100 = !DILocalVariable(name: "err", scope: !1084, file: !3, line: 481, type: !25)
!1101 = distinct !DILocation(line: 861, column: 16, scope: !1102, inlinedAt: !1069)
!1102 = distinct !DILexicalBlock(scope: !1066, file: !3, line: 858, column: 11)
!1103 = !DILocation(line: 196, column: 8, scope: !1071, inlinedAt: !1104)
!1104 = distinct !DILocation(line: 707, column: 25, scope: !1105, inlinedAt: !1130)
!1105 = distinct !DILexicalBlock(scope: !1106, file: !3, line: 702, column: 17)
!1106 = distinct !DILexicalBlock(scope: !1107, file: !3, line: 701, column: 19)
!1107 = distinct !DILexicalBlock(scope: !1108, file: !3, line: 697, column: 13)
!1108 = distinct !DILexicalBlock(scope: !1109, file: !3, line: 696, column: 15)
!1109 = distinct !DILexicalBlock(scope: !1110, file: !3, line: 685, column: 9)
!1110 = distinct !DILexicalBlock(scope: !1111, file: !3, line: 680, column: 5)
!1111 = distinct !DISubprogram(name: "elide_tail_lines_seekable", scope: !3, file: !3, line: 647, type: !1112, scopeLine: 650, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1114)
!1112 = !DISubroutineType(types: !1113)
!1113 = !{!60, !41, !53, !64, !34, !34}
!1114 = !{!1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1125, !1126, !1129}
!1115 = !DILocalVariable(name: "pretty_filename", arg: 1, scope: !1111, file: !3, line: 647, type: !41)
!1116 = !DILocalVariable(name: "fd", arg: 2, scope: !1111, file: !3, line: 647, type: !53)
!1117 = !DILocalVariable(name: "n_lines", arg: 3, scope: !1111, file: !3, line: 648, type: !64)
!1118 = !DILocalVariable(name: "start_pos", arg: 4, scope: !1111, file: !3, line: 649, type: !34)
!1119 = !DILocalVariable(name: "size", arg: 5, scope: !1111, file: !3, line: 649, type: !34)
!1120 = !DILocalVariable(name: "buffer", scope: !1111, file: !3, line: 651, type: !1050)
!1121 = !DILocalVariable(name: "bytes_read", scope: !1111, file: !3, line: 652, type: !43)
!1122 = !DILocalVariable(name: "pos", scope: !1111, file: !3, line: 653, type: !34)
!1123 = !DILocalVariable(name: "all_lines", scope: !1111, file: !3, line: 673, type: !1124)
!1124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!1125 = !DILocalVariable(name: "n", scope: !1110, file: !3, line: 683, type: !43)
!1126 = !DILocalVariable(name: "nl", scope: !1127, file: !3, line: 690, type: !41)
!1127 = distinct !DILexicalBlock(scope: !1128, file: !3, line: 689, column: 13)
!1128 = distinct !DILexicalBlock(scope: !1109, file: !3, line: 686, column: 15)
!1129 = !DILocalVariable(name: "err", scope: !1105, file: !3, line: 703, type: !25)
!1130 = distinct !DILocation(line: 768, column: 18, scope: !1131, inlinedAt: !1141)
!1131 = distinct !DILexicalBlock(scope: !1132, file: !3, line: 761, column: 5)
!1132 = distinct !DILexicalBlock(scope: !1133, file: !3, line: 758, column: 7)
!1133 = distinct !DISubprogram(name: "elide_tail_lines_file", scope: !3, file: !3, line: 754, type: !1087, scopeLine: 756, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1134)
!1134 = !{!1135, !1136, !1137, !1138, !1139, !1140}
!1135 = !DILocalVariable(name: "filename", arg: 1, scope: !1133, file: !3, line: 754, type: !41)
!1136 = !DILocalVariable(name: "fd", arg: 2, scope: !1133, file: !3, line: 754, type: !53)
!1137 = !DILocalVariable(name: "n_elide", arg: 3, scope: !1133, file: !3, line: 754, type: !64)
!1138 = !DILocalVariable(name: "st", arg: 4, scope: !1133, file: !3, line: 755, type: !1089)
!1139 = !DILocalVariable(name: "current_pos", arg: 5, scope: !1133, file: !3, line: 755, type: !34)
!1140 = !DILocalVariable(name: "size", scope: !1133, file: !3, line: 757, type: !34)
!1141 = distinct !DILocation(line: 859, column: 16, scope: !1102, inlinedAt: !1069)
!1142 = !DILocation(line: 0, scope: !1056, inlinedAt: !1069)
!1143 = !DILocation(line: 839, column: 7, scope: !1144, inlinedAt: !1069)
!1144 = distinct !DILexicalBlock(scope: !1056, file: !3, line: 839, column: 7)
!1145 = !DILocation(line: 839, column: 7, scope: !1056, inlinedAt: !1069)
!1146 = !DILocation(line: 0, scope: !108, inlinedAt: !1147)
!1147 = distinct !DILocation(line: 840, column: 5, scope: !1144, inlinedAt: !1069)
!1148 = !DILocation(line: 172, column: 3, scope: !108, inlinedAt: !1147)
!1149 = !DILocation(line: 173, column: 14, scope: !108, inlinedAt: !1147)
!1150 = !DILocation(line: 840, column: 5, scope: !1144, inlinedAt: !1069)
!1151 = !DILocation(line: 842, column: 7, scope: !1056, inlinedAt: !1069)
!1152 = !DILocation(line: 0, scope: !1066, inlinedAt: !1069)
!1153 = !DILocation(line: 845, column: 7, scope: !1066, inlinedAt: !1069)
!1154 = !DILocation(line: 845, column: 19, scope: !1066, inlinedAt: !1069)
!1155 = !DILocation(line: 846, column: 11, scope: !1156, inlinedAt: !1069)
!1156 = distinct !DILexicalBlock(scope: !1066, file: !3, line: 846, column: 11)
!1157 = !DILocation(line: 846, column: 27, scope: !1156, inlinedAt: !1069)
!1158 = !DILocation(line: 846, column: 11, scope: !1066, inlinedAt: !1069)
!1159 = !DILocation(line: 848, column: 21, scope: !1160, inlinedAt: !1069)
!1160 = distinct !DILexicalBlock(scope: !1156, file: !3, line: 847, column: 9)
!1161 = !DILocation(line: 848, column: 28, scope: !1160, inlinedAt: !1069)
!1162 = !DILocation(line: 849, column: 18, scope: !1160, inlinedAt: !1069)
!1163 = !DILocation(line: 848, column: 11, scope: !1160, inlinedAt: !1069)
!1164 = !DILocation(line: 850, column: 11, scope: !1160, inlinedAt: !1069)
!1165 = !DILocation(line: 852, column: 13, scope: !1166, inlinedAt: !1069)
!1166 = distinct !DILexicalBlock(scope: !1066, file: !3, line: 852, column: 11)
!1167 = !DILocation(line: 852, column: 32, scope: !1166, inlinedAt: !1069)
!1168 = !DILocalVariable(name: "sb", arg: 1, scope: !1169, file: !706, line: 705, type: !1089)
