source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.group = type { i8*, i8*, i32, i8** }
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.passwd = type { i8*, i8*, i32, i32, i8*, i8*, i8* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [USER]...\0A\00", align 1
@.str.2 = private unnamed_addr constant [105 x i8] c"Print user and group information for each specified USER,\0Aor (when USER omitted) for the current user.\0A\0A\00", align 1
@stdout = external local_unnamed_addr global %struct._IO_FILE*, align 8

!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!9 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!10 = !{!11, !18, !20, !24, !0, !26, !29, !31, !33, !35, !37, !39, !41, !43, !45, !47, !59}
!11 = !DIGlobalVariableExpression(var: !12, expr: !DIExpression())
!12 = distinct !DIGlobalVariable(name: "ruid", scope: !2, file: !3, line: 64, type: !13, isLocal: true, isDefinition: true)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !14, line: 79, baseType: !15)
!14 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !16, line: 146, baseType: !17)
!16 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!17 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!18 = !DIGlobalVariableExpression(var: !19, expr: !DIExpression())
!19 = distinct !DIGlobalVariable(name: "euid", scope: !2, file: !3, line: 64, type: !13, isLocal: true, isDefinition: true)
!20 = !DIGlobalVariableExpression(var: !21, expr: !DIExpression())
!21 = distinct !DIGlobalVariable(name: "rgid", scope: !2, file: !3, line: 65, type: !22, isLocal: true, isDefinition: true)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !14, line: 64, baseType: !23)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !16, line: 147, baseType: !17)
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "egid", scope: !2, file: !3, line: 65, type: !22, isLocal: true, isDefinition: true)
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(name: "just_context", scope: !2, file: !3, line: 45, type: !28, isLocal: true, isDefinition: true)
!28 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "just_group", scope: !2, file: !3, line: 51, type: !28, isLocal: true, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "use_name", scope: !2, file: !3, line: 61, type: !28, isLocal: true, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "use_real", scope: !2, file: !3, line: 53, type: !28, isLocal: true, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "just_user", scope: !2, file: !3, line: 55, type: !28, isLocal: true, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "opt_zero", scope: !2, file: !3, line: 47, type: !28, isLocal: true, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "just_group_list", scope: !2, file: !3, line: 49, type: !28, isLocal: true, isDefinition: true)
!41 = !DIGlobalVariableExpression(var: !42, expr: !DIExpression())
!42 = distinct !DIGlobalVariable(name: "context", scope: !2, file: !3, line: 69, type: !6, isLocal: true, isDefinition: true)
!43 = !DIGlobalVariableExpression(var: !44, expr: !DIExpression())
!44 = distinct !DIGlobalVariable(name: "multiple_users", scope: !2, file: !3, line: 59, type: !28, isLocal: true, isDefinition: true)
!45 = !DIGlobalVariableExpression(var: !46, expr: !DIExpression())
!46 = distinct !DIGlobalVariable(name: "ok", scope: !2, file: !3, line: 57, type: !28, isLocal: true, isDefinition: true)
!47 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression())
!48 = distinct !DIGlobalVariable(name: "buf", scope: !49, file: !3, line: 327, type: !56, isLocal: true, isDefinition: true)
!49 = distinct !DISubprogram(name: "uidtostr_ptr", scope: !3, file: !3, line: 325, type: !50, scopeLine: 326, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !54)
!50 = !DISubroutineType(types: !51)
!51 = !{!6, !52}
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!54 = !{!55}
!55 = !DILocalVariable(name: "uid", arg: 1, scope: !49, file: !3, line: 325, type: !52)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 168, elements: !57)
!57 = !{!58}
!58 = !DISubrange(count: 21)
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(name: "buf", scope: !61, file: !3, line: 316, type: !56, isLocal: true, isDefinition: true)
!61 = distinct !DISubprogram(name: "gidtostr_ptr", scope: !3, file: !3, line: 314, type: !62, scopeLine: 315, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !66)
!62 = !DISubroutineType(types: !63)
!63 = !{!6, !64}
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!66 = !{!67}
!67 = !DILocalVariable(name: "gid", arg: 1, scope: !61, file: !3, line: 314, type: !64)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 2560, elements: !81)
!69 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !70)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !71, line: 50, size: 256, elements: !72)
!71 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!72 = !{!73, !76, !78, !80}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !70, file: !71, line: 52, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !70, file: !71, line: 55, baseType: !77, size: 32, offset: 64)
!77 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !70, file: !71, line: 56, baseType: !79, size: 64, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !70, file: !71, line: 57, baseType: !77, size: 32, offset: 192)
!81 = !{!82}
!82 = !DISubrange(count: 10)
!83 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!84 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!85 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!86 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!87 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!88 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!89 = !DIGlobalVariableExpression(var: !90, expr: !DIExpression())
!90 = distinct !DIGlobalVariable(name: "buf", scope: !91, file: !92, line: 96, type: !56, isLocal: true, isDefinition: true)
!91 = distinct !DISubprogram(name: "gidtostr_ptr", scope: !92, file: !92, line: 94, type: !62, scopeLine: 95, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !93, retainedNodes: !97)
!92 = !DIFile(filename: "src/group-list.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!93 = distinct !DICompileUnit(language: DW_LANG_C99, file: !92, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !94, globals: !96, nameTableKind: None)
!94 = !{!8, !95, !9}
!95 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!96 = !{!89}
!97 = !{!98}
!98 = !DILocalVariable(name: "gid", arg: 1, scope: !91, file: !92, line: 94, type: !64)
!99 = !DIGlobalVariableExpression(var: !100, expr: !DIExpression())
!100 = distinct !DIGlobalVariable(name: "Version", scope: !101, file: !102, line: 2, type: !74, isDefinition: true)
!101 = distinct !DICompileUnit(language: DW_LANG_C99, file: !102, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, globals: !103, nameTableKind: None)
!102 = !DIFile(filename: "src/version.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!103 = !{!99}
!104 = !DIGlobalVariableExpression(var: !105, expr: !DIExpression())
!105 = distinct !DIGlobalVariable(name: "file_name", scope: !106, file: !107, line: 46, type: !74, isLocal: true, isDefinition: true)
!106 = distinct !DICompileUnit(language: DW_LANG_C99, file: !107, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, globals: !108, nameTableKind: None)
!107 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!108 = !{!104, !109}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !106, file: !107, line: 56, type: !28, isLocal: true, isDefinition: true)
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(name: "exit_failure", scope: !113, file: !114, line: 24, type: !116, isDefinition: true)
!113 = distinct !DICompileUnit(language: DW_LANG_C99, file: !114, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, globals: !115, nameTableKind: None)
!114 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!115 = !{!111}
!116 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !77)
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(name: "program_name", scope: !119, file: !120, line: 33, type: !74, isDefinition: true)
!119 = distinct !DICompileUnit(language: DW_LANG_C99, file: !120, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !121, globals: !122, nameTableKind: None)
!120 = !DIFile(filename: "lib/progname.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!121 = !{!8, !6}
!122 = !{!117}
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !125, file: !126, line: 85, type: !201, isDefinition: true)
!125 = distinct !DICompileUnit(language: DW_LANG_C99, file: !126, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !127, retainedTypes: !162, globals: !166, nameTableKind: None)
!126 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!127 = !{!128, !142, !147}
!128 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !129, line: 32, baseType: !17, size: 32, elements: !130)
!129 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!130 = !{!131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141}
!131 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!132 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!133 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!134 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!135 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!136 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!137 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!138 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!139 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!140 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!141 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!142 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !129, line: 242, baseType: !17, size: 32, elements: !143)
!143 = !{!144, !145, !146}
!144 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!145 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!146 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!147 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !148, line: 46, baseType: !17, size: 32, elements: !149)
!148 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!149 = !{!150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161}
!150 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!151 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!152 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!153 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!154 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!155 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!156 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!157 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!158 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!159 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!160 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!161 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!162 = !{!77, !163, !164, !6}
!163 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !165, line: 46, baseType: !95)
!165 = !DIFile(filename: "/usr/lib/clang/12.0.1/include/stddef.h", directory: "")
!166 = !{!123, !167, !171, !183, !185, !190, !197, !199}
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !125, file: !126, line: 101, type: !169, isDefinition: true)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 320, elements: !81)
!170 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !128)
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !125, file: !126, line: 1052, type: !173, isDefinition: true)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !126, line: 65, size: 448, elements: !174)
!174 = !{!175, !176, !177, !181, !182}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !173, file: !126, line: 68, baseType: !128, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !173, file: !126, line: 71, baseType: !77, size: 32, offset: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !173, file: !126, line: 75, baseType: !178, size: 256, offset: 64)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 256, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 8)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !173, file: !126, line: 78, baseType: !74, size: 64, offset: 320)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !173, file: !126, line: 81, baseType: !74, size: 64, offset: 384)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !125, file: !126, line: 116, type: !173, isLocal: true, isDefinition: true)
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "slot0", scope: !125, file: !126, line: 842, type: !187, isLocal: true, isDefinition: true)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 2048, elements: !188)
!188 = !{!189}
!189 = !DISubrange(count: 256)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(name: "slotvec", scope: !125, file: !126, line: 845, type: !192, isLocal: true, isDefinition: true)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !126, line: 834, size: 128, elements: !194)
!194 = !{!195, !196}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !193, file: !126, line: 836, baseType: !164, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !193, file: !126, line: 837, baseType: !6, size: 64, offset: 64)
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(name: "nslots", scope: !125, file: !126, line: 843, type: !77, isLocal: true, isDefinition: true)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(name: "slotvec0", scope: !125, file: !126, line: 844, type: !193, isLocal: true, isDefinition: true)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 704, elements: !203)
!202 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !74)
!203 = !{!204}
!204 = !DISubrange(count: 11)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !207, file: !208, line: 26, type: !210, isDefinition: true)
!207 = distinct !DICompileUnit(language: DW_LANG_C99, file: !208, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, globals: !209, nameTableKind: None)
!208 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!209 = !{!205}
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 376, elements: !211)
!211 = !{!212}
!212 = !DISubrange(count: 47)
!213 = distinct !DICompileUnit(language: DW_LANG_C99, file: !214, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !215, nameTableKind: None)
!214 = !DIFile(filename: "lib/umaxtostr.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!215 = !{!216}
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !217, line: 102, baseType: !218)
!217 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !16, line: 73, baseType: !95)
!219 = distinct !DICompileUnit(language: DW_LANG_C99, file: !220, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !221, retainedTypes: !230, globals: !231, nameTableKind: None)
!220 = !DIFile(filename: "lib/userspec.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!221 = !{!222}
!222 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !223, line: 25, baseType: !17, size: 32, elements: !224)
!223 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!224 = !{!225, !226, !227, !228, !229}
!225 = !DIEnumerator(name: "LONGINT_OK", value: 0, isUnsigned: true)
!226 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1, isUnsigned: true)
!227 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2, isUnsigned: true)
!228 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3, isUnsigned: true)
!229 = !DIEnumerator(name: "LONGINT_INVALID", value: 4, isUnsigned: true)
!230 = !{!8, !13, !22}
!231 = !{!232, !294, !296}
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(name: "E_invalid_user", scope: !234, file: !220, line: 106, type: !74, isLocal: true, isDefinition: true)
!234 = distinct !DISubprogram(name: "parse_with_separator", scope: !220, file: !220, line: 102, type: !235, scopeLine: 105, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !219, retainedNodes: !240)
!235 = !DISubroutineType(types: !236)
!236 = !{!74, !74, !74, !237, !238, !239, !239}
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!240 = !{!241, !242, !243, !244, !245, !246, !247, !248, !260, !269, !270, !271, !272, !273, !274, !277, !282, !285, !289}
!241 = !DILocalVariable(name: "spec", arg: 1, scope: !234, file: !220, line: 102, type: !74)
!242 = !DILocalVariable(name: "separator", arg: 2, scope: !234, file: !220, line: 102, type: !74)
!243 = !DILocalVariable(name: "uid", arg: 3, scope: !234, file: !220, line: 103, type: !237)
!244 = !DILocalVariable(name: "gid", arg: 4, scope: !234, file: !220, line: 103, type: !238)
!245 = !DILocalVariable(name: "username", arg: 5, scope: !234, file: !220, line: 104, type: !239)
!246 = !DILocalVariable(name: "groupname", arg: 6, scope: !234, file: !220, line: 104, type: !239)
!247 = !DILocalVariable(name: "error_msg", scope: !234, file: !220, line: 110, type: !74)
!248 = !DILocalVariable(name: "pwd", scope: !234, file: !220, line: 111, type: !249)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !251, line: 49, size: 384, elements: !252)
!251 = !DIFile(filename: "/usr/include/pwd.h", directory: "")
!252 = !{!253, !254, !255, !256, !257, !258, !259}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !250, file: !251, line: 51, baseType: !6, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !250, file: !251, line: 52, baseType: !6, size: 64, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !250, file: !251, line: 54, baseType: !15, size: 32, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !250, file: !251, line: 55, baseType: !23, size: 32, offset: 160)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !250, file: !251, line: 56, baseType: !6, size: 64, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !250, file: !251, line: 57, baseType: !6, size: 64, offset: 256)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !250, file: !251, line: 58, baseType: !6, size: 64, offset: 320)
!260 = !DILocalVariable(name: "grp", scope: !234, file: !220, line: 112, type: !261)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "group", file: !263, line: 42, size: 256, elements: !264)
!263 = !DIFile(filename: "/usr/include/grp.h", directory: "")
!264 = !{!265, !266, !267, !268}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "gr_name", scope: !262, file: !263, line: 44, baseType: !6, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "gr_passwd", scope: !262, file: !263, line: 45, baseType: !6, size: 64, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "gr_gid", scope: !262, file: !263, line: 46, baseType: !23, size: 32, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "gr_mem", scope: !262, file: !263, line: 47, baseType: !239, size: 64, offset: 192)
!269 = !DILocalVariable(name: "u", scope: !234, file: !220, line: 113, type: !6)
!270 = !DILocalVariable(name: "g", scope: !234, file: !220, line: 114, type: !74)
!271 = !DILocalVariable(name: "gname", scope: !234, file: !220, line: 115, type: !6)
!272 = !DILocalVariable(name: "unum", scope: !234, file: !220, line: 116, type: !13)
!273 = !DILocalVariable(name: "gnum", scope: !234, file: !220, line: 117, type: !22)
!274 = !DILocalVariable(name: "ulen", scope: !275, file: !220, line: 137, type: !164)
!275 = distinct !DILexicalBlock(scope: !276, file: !220, line: 136, column: 5)
!276 = distinct !DILexicalBlock(scope: !234, file: !220, line: 130, column: 7)
!277 = !DILocalVariable(name: "use_login_group", scope: !278, file: !220, line: 164, type: !28)
!278 = distinct !DILexicalBlock(scope: !279, file: !220, line: 163, column: 9)
!279 = distinct !DILexicalBlock(scope: !280, file: !220, line: 162, column: 11)
!280 = distinct !DILexicalBlock(scope: !281, file: !220, line: 159, column: 5)
!281 = distinct !DILexicalBlock(scope: !234, file: !220, line: 158, column: 7)
!282 = !DILocalVariable(name: "tmp", scope: !283, file: !220, line: 173, type: !95)
!283 = distinct !DILexicalBlock(scope: !284, file: !220, line: 172, column: 13)
!284 = distinct !DILexicalBlock(scope: !278, file: !220, line: 165, column: 15)
!285 = !DILocalVariable(name: "buf", scope: !286, file: !220, line: 188, type: !56)
!286 = distinct !DILexicalBlock(scope: !287, file: !220, line: 185, column: 13)
!287 = distinct !DILexicalBlock(scope: !288, file: !220, line: 184, column: 15)
!288 = distinct !DILexicalBlock(scope: !279, file: !220, line: 182, column: 9)
!289 = !DILocalVariable(name: "tmp", scope: !290, file: !220, line: 205, type: !95)
!290 = distinct !DILexicalBlock(scope: !291, file: !220, line: 204, column: 9)
!291 = distinct !DILexicalBlock(scope: !292, file: !220, line: 203, column: 11)
!292 = distinct !DILexicalBlock(scope: !293, file: !220, line: 199, column: 5)
!293 = distinct !DILexicalBlock(scope: !234, file: !220, line: 198, column: 7)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(name: "E_invalid_group", scope: !234, file: !220, line: 107, type: !74, isLocal: true, isDefinition: true)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "E_bad_spec", scope: !234, file: !220, line: 108, type: !74, isLocal: true, isDefinition: true)
!298 = distinct !DICompileUnit(language: DW_LANG_C99, file: !299, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !300, retainedTypes: !304, nameTableKind: None)
!299 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!300 = !{!301}
!301 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !299, line: 40, baseType: !17, size: 32, elements: !302)
!302 = !{!303}
!303 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!304 = !{!8}
!305 = distinct !DICompileUnit(language: DW_LANG_C99, file: !306, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !307, retainedTypes: !321, nameTableKind: None)
!306 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!307 = !{!308}
!308 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !310, file: !309, line: 186, baseType: !17, size: 32, elements: !319)
!309 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!310 = distinct !DISubprogram(name: "x2nrealloc", scope: !309, file: !309, line: 174, type: !311, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !305, retainedNodes: !314)
!311 = !DISubroutineType(types: !312)
!312 = !{!8, !8, !313, !164}
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!314 = !{!315, !316, !317, !318}
!315 = !DILocalVariable(name: "p", arg: 1, scope: !310, file: !309, line: 174, type: !8)
!316 = !DILocalVariable(name: "pn", arg: 2, scope: !310, file: !309, line: 174, type: !313)
!317 = !DILocalVariable(name: "s", arg: 3, scope: !310, file: !309, line: 174, type: !164)
!318 = !DILocalVariable(name: "n", scope: !310, file: !309, line: 176, type: !164)
!319 = !{!320}
!320 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!321 = !{!164, !6, !8}
!322 = distinct !DICompileUnit(language: DW_LANG_C99, file: !323, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!323 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!324 = distinct !DICompileUnit(language: DW_LANG_C99, file: !325, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!325 = !DIFile(filename: "lib/xgetgroups.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!326 = distinct !DICompileUnit(language: DW_LANG_C99, file: !327, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !328, retainedTypes: !329, nameTableKind: None)
!327 = !DIFile(filename: "lib/xstrtoul.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!328 = !{!222, !147}
!329 = !{!77, !163}
!330 = distinct !DICompileUnit(language: DW_LANG_C99, file: !331, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !304, nameTableKind: None)
!331 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!332 = distinct !DICompileUnit(language: DW_LANG_C99, file: !333, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !334, nameTableKind: None)
!333 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!334 = !{!164}
!335 = distinct !DICompileUnit(language: DW_LANG_C99, file: !336, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!336 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!337 = distinct !DICompileUnit(language: DW_LANG_C99, file: !338, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!338 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!339 = distinct !DICompileUnit(language: DW_LANG_C99, file: !340, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !341, retainedTypes: !304, nameTableKind: None)
!340 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!341 = !{!342}
!342 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !343, line: 41, baseType: !17, size: 32, elements: !344)
!343 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!344 = !{!345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727}
!345 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!346 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!347 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!348 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!349 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!350 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!351 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!352 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!353 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!354 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!355 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!356 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!357 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!358 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!359 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!360 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!361 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!362 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!363 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!364 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!365 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!366 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!367 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!368 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!369 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!370 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!371 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!372 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!373 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!374 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!375 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!376 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!377 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!378 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!379 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!380 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!381 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!382 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!383 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!384 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!385 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!386 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!387 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!388 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!389 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!390 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!391 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!392 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!393 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!394 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!395 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!396 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!397 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!398 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!399 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!400 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!401 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!402 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!403 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!404 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!405 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!406 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!407 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!408 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!409 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!410 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!411 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!412 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!413 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!414 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!415 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!416 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!417 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!418 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!419 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!420 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!421 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!422 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!423 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!424 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!425 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!426 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!427 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!428 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!429 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!430 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!431 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!432 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!433 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!434 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!435 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!436 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!437 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!438 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!439 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!440 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!441 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!442 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!443 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!444 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!445 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!446 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!447 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!448 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!449 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!450 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!451 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!452 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!453 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!454 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!455 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!456 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!457 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!458 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!459 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!460 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!461 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!462 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!463 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!464 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!465 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!466 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!467 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!468 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!469 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!470 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!471 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!472 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!473 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!474 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!475 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!476 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!477 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!478 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!479 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!480 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!481 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!482 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!483 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!484 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!485 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!486 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!487 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!488 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!489 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!490 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!491 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!492 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!493 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!494 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!495 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!496 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!497 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!498 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!499 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!500 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!501 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!502 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!503 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!504 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!505 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!506 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!507 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!508 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!509 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!510 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!511 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!512 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!513 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!514 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!515 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!516 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!517 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!518 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!519 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!520 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!521 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!522 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!523 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!524 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!525 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!526 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!527 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!528 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!529 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!530 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!531 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!532 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!533 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!534 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!535 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!536 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!537 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!538 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!539 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!540 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!541 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!542 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!543 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!544 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!545 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!546 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!547 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!548 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!549 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!550 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!551 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!552 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!553 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!554 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!555 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!556 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!557 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!558 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!559 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!560 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!561 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!562 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!563 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!564 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!565 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!566 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!567 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!568 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!569 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!570 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!571 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!572 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!573 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!574 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!575 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!576 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!577 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!578 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!579 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!580 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!581 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!582 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!583 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!584 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!585 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!586 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!587 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!588 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!589 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!590 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!591 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!592 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!593 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!594 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!595 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!596 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!597 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!598 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!599 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!600 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!601 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!602 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!603 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!604 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!605 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!606 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!607 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!608 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!609 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!610 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!611 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!612 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!613 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!614 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!615 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!616 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!617 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!618 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!619 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!620 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!621 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!622 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!623 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!624 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!625 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!626 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!627 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!628 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!629 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!630 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!631 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!632 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!633 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!634 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!635 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!636 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!637 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!660 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!661 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!662 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!663 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!664 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!665 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!666 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!667 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!668 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!669 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!670 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!671 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!672 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!673 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!674 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!675 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!676 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!677 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!678 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!679 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!680 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!681 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!682 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!683 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!684 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!685 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!686 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!687 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!688 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!689 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!690 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!691 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!692 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!693 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!694 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!695 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!696 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!697 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!698 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!699 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!700 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!701 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!702 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!703 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!704 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!705 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!706 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!707 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!708 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!709 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!710 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!711 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!712 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!713 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!714 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!715 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!716 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!717 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!719 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!720 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!721 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!722 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!723 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!724 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!725 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!726 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!727 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!728 = distinct !DICompileUnit(language: DW_LANG_C99, file: !729, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !730, retainedTypes: !761, nameTableKind: None)
!729 = !DIFile(filename: "lib/mgetgroups.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!730 = !{!731}
!731 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !732, file: !729, line: 83, baseType: !17, size: 32, elements: !759)
!732 = distinct !DISubprogram(name: "mgetgroups", scope: !729, file: !729, line: 66, type: !733, scopeLine: 67, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !728, retainedNodes: !736)
!733 = !DISubroutineType(types: !734)
!734 = !{!77, !74, !22, !735}
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!736 = !{!737, !738, !739, !740, !741, !742, !743, !747, !748, !751, !754, !757, !758}
!737 = !DILocalVariable(name: "username", arg: 1, scope: !732, file: !729, line: 66, type: !74)
!738 = !DILocalVariable(name: "gid", arg: 2, scope: !732, file: !729, line: 66, type: !22)
!739 = !DILocalVariable(name: "groups", arg: 3, scope: !732, file: !729, line: 66, type: !735)
!740 = !DILocalVariable(name: "max_n_groups", scope: !732, file: !729, line: 68, type: !77)
!741 = !DILocalVariable(name: "ng", scope: !732, file: !729, line: 69, type: !77)
!742 = !DILocalVariable(name: "g", scope: !732, file: !729, line: 70, type: !238)
!743 = !DILocalVariable(name: "h", scope: !744, file: !729, line: 92, type: !238)
!744 = distinct !DILexicalBlock(scope: !745, file: !729, line: 91, column: 9)
!745 = distinct !DILexicalBlock(scope: !746, file: !729, line: 82, column: 5)
!746 = distinct !DILexicalBlock(scope: !732, file: !729, line: 81, column: 7)
!747 = !DILocalVariable(name: "last_n_groups", scope: !744, file: !729, line: 93, type: !77)
!748 = !DILocalVariable(name: "saved_errno", scope: !749, file: !729, line: 105, type: !77)
!749 = distinct !DILexicalBlock(scope: !750, file: !729, line: 104, column: 13)
!750 = distinct !DILexicalBlock(scope: !744, file: !729, line: 103, column: 15)
!751 = !DILocalVariable(name: "saved_errno", scope: !752, file: !729, line: 156, type: !77)
!752 = distinct !DILexicalBlock(scope: !753, file: !729, line: 154, column: 5)
!753 = distinct !DILexicalBlock(scope: !732, file: !729, line: 153, column: 7)
!754 = !DILocalVariable(name: "first", scope: !755, file: !729, line: 187, type: !22)
!755 = distinct !DILexicalBlock(scope: !756, file: !729, line: 186, column: 5)
!756 = distinct !DILexicalBlock(scope: !732, file: !729, line: 185, column: 7)
!757 = !DILocalVariable(name: "next", scope: !755, file: !729, line: 188, type: !238)
!758 = !DILocalVariable(name: "groups_end", scope: !755, file: !729, line: 189, type: !238)
!759 = !{!760}
!760 = !DIEnumerator(name: "N_GROUPS_INIT", value: 10, isUnsigned: true)
!761 = !{!8, !22, !164}
!762 = distinct !DICompileUnit(language: DW_LANG_C99, file: !763, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !304, nameTableKind: None)
!763 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!764 = distinct !DICompileUnit(language: DW_LANG_C99, file: !765, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!765 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!766 = distinct !DICompileUnit(language: DW_LANG_C99, file: !767, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !304, nameTableKind: None)
!767 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!768 = distinct !DICompileUnit(language: DW_LANG_C99, file: !769, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !304, nameTableKind: None)
!769 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!770 = !{!"clang version 12.0.1"}
!771 = !{i32 7, !"Dwarf Version", i32 4}
!772 = !{i32 2, !"Debug Info Version", i32 3}
!773 = !{i32 1, !"wchar_size", i32 4}
!774 = !{i32 7, !"PIC Level", i32 2}
!775 = !{i32 7, !"PIE Level", i32 2}
!776 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 90, type: !777, scopeLine: 91, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !779)
!777 = !DISubroutineType(types: !778)
!778 = !{null, !77}
!779 = !{!780}
!780 = !DILocalVariable(name: "status", arg: 1, scope: !776, file: !3, line: 90, type: !77)
!781 = !DILocation(scope: !776)
!782 = !DILocation(line: 92, column: 14, scope: !783)
!783 = distinct !DILexicalBlock(scope: !776, file: !3, line: 92, column: 7)
!784 = !DILocation(line: 92, column: 7, scope: !776)
!785 = !DILocation(line: 93, column: 5, scope: !786)
!786 = distinct !DILexicalBlock(scope: !783, file: !3, line: 93, column: 5)
!787 = !{!788, !788, i64 0}
!788 = !{!"any pointer", !789, i64 0}
!789 = !{!"omnipotent char", !790, i64 0}
!790 = !{!"Simple C/C++ TBAA"}
!791 = !DILocation(line: 96, column: 7, scope: !792)
!792 = distinct !DILexicalBlock(scope: !783, file: !3, line: 95, column: 5)
!793 = !DILocation(line: 97, column: 7, scope: !792)
!794 = !DILocation(line: 102, column: 7, scope: !792)
!795 = !DILocation(line: 113, column: 7, scope: !792)
!796 = !DILocation(line: 114, column: 7, scope: !792)
!797 = !DILocation(line: 115, column: 7, scope: !792)
!798 = !DILocalVariable(name: "program", arg: 1, scope: !799, file: !800, line: 634, type: !74)
!799 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !800, file: !800, line: 634, type: !801, scopeLine: 635, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !803)
!800 = !DIFile(filename: "src/system.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!801 = !DISubroutineType(types: !802)
!802 = !{null, !74}
!803 = !{!798, !804, !813, !814, !816}
!804 = !DILocalVariable(name: "infomap", scope: !799, file: !800, line: 636, type: !805)
!805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !806, size: 896, elements: !811)
!806 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !807)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !799, file: !800, line: 636, size: 128, elements: !808)
!808 = !{!809, !810}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !807, file: !800, line: 636, baseType: !74, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !807, file: !800, line: 636, baseType: !74, size: 64, offset: 64)
!811 = !{!812}
!812 = !DISubrange(count: 7)
!813 = !DILocalVariable(name: "node", scope: !799, file: !800, line: 646, type: !74)
!814 = !DILocalVariable(name: "map_prog", scope: !799, file: !800, line: 647, type: !815)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!816 = !DILocalVariable(name: "lc_messages", scope: !799, file: !800, line: 659, type: !74)
!817 = !DILocation(scope: !799, inlinedAt: !818)
!818 = distinct !DILocation(line: 119, column: 7, scope: !792)
!819 = !DILocation(line: 636, column: 3, scope: !799, inlinedAt: !818)
!820 = !DILocation(line: 636, column: 67, scope: !799, inlinedAt: !818)
!821 = !DILocation(line: 647, column: 36, scope: !799, inlinedAt: !818)
!822 = !DILocation(line: 649, column: 3, scope: !799, inlinedAt: !818)
!823 = !DILocation(line: 649, column: 33, scope: !799, inlinedAt: !818)
!824 = !DILocation(line: 650, column: 13, scope: !799, inlinedAt: !818)
!825 = !DILocation(line: 649, column: 20, scope: !799, inlinedAt: !818)
!826 = !{!827, !788, i64 0}
!827 = !{!"infomap", !788, i64 0, !788, i64 8}
!828 = !DILocation(line: 649, column: 10, scope: !799, inlinedAt: !818)
!829 = !DILocation(line: 649, column: 28, scope: !799, inlinedAt: !818)
!830 = distinct !{!830, !822, !824, !831}
!831 = !{!"llvm.loop.mustprogress"}
!832 = !DILocation(line: 652, column: 17, scope: !833, inlinedAt: !818)
!833 = distinct !DILexicalBlock(scope: !799, file: !800, line: 652, column: 7)
!834 = !{!827, !788, i64 8}
!835 = !DILocation(line: 652, column: 7, scope: !833, inlinedAt: !818)
!836 = !DILocation(line: 652, column: 7, scope: !799, inlinedAt: !818)
!837 = !DILocation(line: 655, column: 3, scope: !799, inlinedAt: !818)
!838 = !DILocation(line: 659, column: 29, scope: !799, inlinedAt: !818)
!839 = !DILocation(line: 660, column: 7, scope: !840, inlinedAt: !818)
!840 = distinct !DILexicalBlock(scope: !799, file: !800, line: 660, column: 7)
!841 = !DILocation(line: 660, column: 19, scope: !840, inlinedAt: !818)
!842 = !DILocation(line: 660, column: 22, scope: !840, inlinedAt: !818)
!843 = !DILocation(line: 660, column: 7, scope: !799, inlinedAt: !818)
!844 = !DILocation(line: 666, column: 7, scope: !845, inlinedAt: !818)
!845 = distinct !DILexicalBlock(scope: !840, file: !800, line: 661, column: 5)
!846 = !DILocation(line: 668, column: 5, scope: !845, inlinedAt: !818)
!847 = !DILocation(line: 669, column: 3, scope: !799, inlinedAt: !818)
!848 = !DILocation(line: 671, column: 3, scope: !799, inlinedAt: !818)
!849 = !DILocation(line: 673, column: 1, scope: !799, inlinedAt: !818)
!850 = !DILocation(line: 121, column: 3, scope: !776)
!851 = !DISubprogram(name: "dcgettext", scope: !852, file: !852, line: 51, type: !853, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!852 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!853 = !DISubroutineType(types: !854)
!854 = !{!6, !74, !74, !77}
!855 = !DISubprogram(name: "fputs_unlocked", scope: !856, file: !856, line: 667, type: !857, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!856 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!857 = !DISubroutineType(types: !858)
!858 = !{!77, !74, !859}
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !861, line: 49, size: 1728, elements: !862)
!861 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!862 = !{!863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !878, !879, !880, !881, !884, !885, !887, !891, !894, !896, !899, !902, !903, !904, !905, !906}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !860, file: !861, line: 51, baseType: !77, size: 32)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !860, file: !861, line: 54, baseType: !6, size: 64, offset: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !860, file: !861, line: 55, baseType: !6, size: 64, offset: 128)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !860, file: !861, line: 56, baseType: !6, size: 64, offset: 192)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !860, file: !861, line: 57, baseType: !6, size: 64, offset: 256)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !860, file: !861, line: 58, baseType: !6, size: 64, offset: 320)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !860, file: !861, line: 59, baseType: !6, size: 64, offset: 384)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !860, file: !861, line: 60, baseType: !6, size: 64, offset: 448)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !860, file: !861, line: 61, baseType: !6, size: 64, offset: 512)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !860, file: !861, line: 64, baseType: !6, size: 64, offset: 576)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !860, file: !861, line: 65, baseType: !6, size: 64, offset: 640)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !860, file: !861, line: 66, baseType: !6, size: 64, offset: 704)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !860, file: !861, line: 68, baseType: !876, size: 64, offset: 768)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !861, line: 36, flags: DIFlagFwdDecl)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !860, file: !861, line: 70, baseType: !859, size: 64, offset: 832)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !860, file: !861, line: 72, baseType: !77, size: 32, offset: 896)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !860, file: !861, line: 73, baseType: !77, size: 32, offset: 928)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !860, file: !861, line: 74, baseType: !882, size: 64, offset: 960)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !16, line: 152, baseType: !883)
!883 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !860, file: !861, line: 77, baseType: !163, size: 16, offset: 1024)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !860, file: !861, line: 78, baseType: !886, size: 8, offset: 1040)
!886 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !860, file: !861, line: 79, baseType: !888, size: 8, offset: 1048)
!888 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 8, elements: !889)
!889 = !{!890}
!890 = !DISubrange(count: 1)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !860, file: !861, line: 81, baseType: !892, size: 64, offset: 1088)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !861, line: 43, baseType: null)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !860, file: !861, line: 89, baseType: !895, size: 64, offset: 1152)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !16, line: 153, baseType: !883)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !860, file: !861, line: 91, baseType: !897, size: 64, offset: 1216)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !861, line: 37, flags: DIFlagFwdDecl)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !860, file: !861, line: 92, baseType: !900, size: 64, offset: 1280)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !861, line: 38, flags: DIFlagFwdDecl)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !860, file: !861, line: 93, baseType: !859, size: 64, offset: 1344)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !860, file: !861, line: 94, baseType: !8, size: 64, offset: 1408)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !860, file: !861, line: 95, baseType: !164, size: 64, offset: 1472)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !860, file: !861, line: 96, baseType: !77, size: 32, offset: 1536)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !860, file: !861, line: 98, baseType: !907, size: 160, offset: 1568)
!907 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 160, elements: !908)
!908 = !{!909}
!909 = !DISubrange(count: 20)
!910 = !DISubprogram(name: "setlocale", scope: !911, file: !911, line: 122, type: !912, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!911 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!912 = !DISubroutineType(types: !913)
!913 = !{!6, !77, !74}
!914 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 125, type: !915, scopeLine: 126, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !917)
!915 = !DISubroutineType(types: !916)
!916 = !{!77, !77, !239}
!917 = !{!918, !919, !920, !921, !922, !923, !924, !925, !926, !942, !943, !945}
!918 = !DILocalVariable(name: "argc", arg: 1, scope: !914, file: !3, line: 125, type: !77)
!919 = !DILocalVariable(name: "argv", arg: 2, scope: !914, file: !3, line: 125, type: !239)
!920 = !DILocalVariable(name: "optc", scope: !914, file: !3, line: 127, type: !77)
!921 = !DILocalVariable(name: "selinux_enabled", scope: !914, file: !3, line: 128, type: !77)
!922 = !DILocalVariable(name: "smack_enabled", scope: !914, file: !3, line: 129, type: !28)
!923 = !DILocalVariable(name: "pw_name", scope: !914, file: !3, line: 130, type: !6)
!924 = !DILocalVariable(name: "n_ids", scope: !914, file: !3, line: 188, type: !164)
!925 = !DILocalVariable(name: "default_format", scope: !914, file: !3, line: 197, type: !28)
!926 = !DILocalVariable(name: "pwd", scope: !927, file: !3, line: 238, type: !932)
!927 = distinct !DILexicalBlock(scope: !928, file: !3, line: 237, column: 9)
!928 = distinct !DILexicalBlock(scope: !929, file: !3, line: 236, column: 7)
!929 = distinct !DILexicalBlock(scope: !930, file: !3, line: 236, column: 7)
!930 = distinct !DILexicalBlock(scope: !931, file: !3, line: 228, column: 5)
!931 = distinct !DILexicalBlock(scope: !914, file: !3, line: 227, column: 7)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !251, line: 49, size: 384, elements: !934)
!934 = !{!935, !936, !937, !938, !939, !940, !941}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !933, file: !251, line: 51, baseType: !6, size: 64)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !933, file: !251, line: 52, baseType: !6, size: 64, offset: 64)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !933, file: !251, line: 54, baseType: !15, size: 32, offset: 128)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !933, file: !251, line: 55, baseType: !23, size: 32, offset: 160)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !933, file: !251, line: 56, baseType: !6, size: 64, offset: 192)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !933, file: !251, line: 57, baseType: !6, size: 64, offset: 256)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !933, file: !251, line: 58, baseType: !6, size: 64, offset: 320)
!942 = !DILocalVariable(name: "spec", scope: !927, file: !3, line: 239, type: !74)
!943 = !DILocalVariable(name: "NO_UID", scope: !944, file: !3, line: 271, type: !13)
!944 = distinct !DILexicalBlock(scope: !931, file: !3, line: 267, column: 5)
!945 = !DILocalVariable(name: "NO_GID", scope: !944, file: !3, line: 272, type: !22)
!946 = !DILocation(scope: !914)
!947 = !DILocation(line: 133, column: 21, scope: !914)
!948 = !DILocation(line: 133, column: 3, scope: !914)
!949 = !DILocation(line: 134, column: 3, scope: !914)
!950 = !DILocation(line: 135, column: 3, scope: !914)
!951 = !DILocation(line: 136, column: 3, scope: !914)
!952 = !DILocation(line: 138, column: 3, scope: !914)
!953 = !DILocation(line: 140, column: 3, scope: !914)
!954 = !DILocation(line: 140, column: 18, scope: !914)
!955 = !DILocation(line: 157, column: 13, scope: !956)
!956 = distinct !DILexicalBlock(scope: !957, file: !3, line: 156, column: 15)
!957 = distinct !DILexicalBlock(scope: !958, file: !3, line: 143, column: 9)
!958 = distinct !DILexicalBlock(scope: !914, file: !3, line: 141, column: 5)
!959 = !DILocation(line: 168, column: 11, scope: !957)
!960 = !DILocation(line: 171, column: 11, scope: !957)
!961 = !DILocation(line: 174, column: 11, scope: !957)
!962 = !DILocation(line: 177, column: 11, scope: !957)
!963 = !DILocation(line: 180, column: 11, scope: !957)
!964 = !DILocation(line: 181, column: 9, scope: !957)
!965 = !DILocation(line: 182, column: 9, scope: !957)
!966 = !DILocation(line: 184, column: 11, scope: !957)
!967 = !DILocation(scope: !957)
!968 = distinct !{!968, !953, !969, !831}
!969 = !DILocation(line: 186, column: 5, scope: !914)
!970 = !DILocation(line: 188, column: 25, scope: !914)
!971 = !{!972, !972, i64 0}
!972 = !{!"int", !789, i64 0}
!973 = !DILocation(line: 188, column: 23, scope: !914)
!974 = !DILocation(line: 188, column: 18, scope: !914)
!975 = !DILocation(line: 194, column: 7, scope: !976)
!976 = distinct !DILexicalBlock(scope: !914, file: !3, line: 194, column: 7)
!977 = !DILocation(line: 194, column: 19, scope: !976)
!978 = !DILocation(line: 194, column: 17, scope: !976)
!979 = !DILocation(line: 194, column: 32, scope: !976)
!980 = !DILocation(line: 194, column: 30, scope: !976)
!981 = !DILocation(line: 194, column: 63, scope: !976)
!982 = !DILocation(line: 194, column: 7, scope: !914)
!983 = !DILocation(line: 195, column: 5, scope: !976)
!984 = !DILocation(line: 198, column: 28, scope: !914)
!985 = !DILocation(line: 202, column: 22, scope: !986)
!986 = distinct !DILexicalBlock(scope: !914, file: !3, line: 202, column: 7)
!987 = !DILocation(line: 215, column: 13, scope: !988)
!988 = distinct !DILexicalBlock(scope: !914, file: !3, line: 215, column: 7)
!989 = !DILocation(line: 227, column: 7, scope: !914)
!990 = !DILocation(line: 202, column: 26, scope: !986)
!991 = !DILocation(line: 202, column: 35, scope: !986)
!992 = !DILocation(line: 202, column: 38, scope: !986)
!993 = !DILocation(line: 202, column: 7, scope: !914)
!994 = !DILocation(line: 203, column: 5, scope: !986)
!995 = !DILocation(line: 206, column: 25, scope: !996)
!996 = distinct !DILexicalBlock(scope: !914, file: !3, line: 206, column: 7)
!997 = !DILocation(line: 206, column: 7, scope: !914)
!998 = !DILocation(line: 207, column: 5, scope: !996)
!999 = !DILocation(line: 216, column: 7, scope: !988)
!1000 = !DILocation(line: 217, column: 35, scope: !988)
!1001 = !DILocation(line: 229, column: 30, scope: !930)
!1002 = !DILocation(line: 229, column: 22, scope: !930)
!1003 = !{!1004, !1004, i64 0}
!1004 = !{!"_Bool", !789, i64 0}
!1005 = !DILocation(line: 234, column: 16, scope: !930)
!1006 = !DILocation(line: 234, column: 13, scope: !930)
!1007 = !DILocation(line: 236, column: 21, scope: !928)
!1008 = !DILocation(line: 236, column: 7, scope: !929)
!1009 = !DILocation(scope: !927)
!1010 = !DILocation(line: 239, column: 30, scope: !927)
!1011 = !DILocation(line: 243, column: 15, scope: !1012)
!1012 = distinct !DILexicalBlock(scope: !927, file: !3, line: 243, column: 15)
!1013 = !{!789, !789, i64 0}
!1014 = !DILocation(line: 243, column: 15, scope: !927)
!1015 = !DILocation(line: 245, column: 19, scope: !1016)
!1016 = distinct !DILexicalBlock(scope: !1017, file: !3, line: 245, column: 19)
!1017 = distinct !DILexicalBlock(scope: !1012, file: !3, line: 244, column: 13)
!1018 = !DILocation(line: 245, column: 67, scope: !1016)
!1019 = !DILocation(line: 245, column: 19, scope: !1017)
!1020 = !DILocation(line: 250, column: 35, scope: !1021)
!1021 = distinct !DILexicalBlock(scope: !1016, file: !3, line: 246, column: 17)
!1022 = !DILocation(line: 250, column: 25, scope: !1021)
!1023 = !DILocation(line: 253, column: 19, scope: !1024)
!1024 = distinct !DILexicalBlock(scope: !927, file: !3, line: 253, column: 15)
!1025 = !DILocation(line: 253, column: 15, scope: !927)
!1026 = !DILocation(line: 255, column: 25, scope: !1027)
!1027 = distinct !DILexicalBlock(scope: !1024, file: !3, line: 254, column: 13)
!1028 = !DILocation(line: 255, column: 32, scope: !1027)
!1029 = !DILocation(line: 255, column: 67, scope: !1027)
!1030 = !DILocation(line: 255, column: 62, scope: !1027)
!1031 = !DILocation(line: 255, column: 55, scope: !1027)
!1032 = !DILocation(line: 255, column: 15, scope: !1027)
!1033 = !DILocation(line: 256, column: 18, scope: !1027)
!1034 = !DILocation(line: 257, column: 15, scope: !1027)
!1035 = !DILocation(line: 259, column: 35, scope: !927)
!1036 = !{!1037, !788, i64 0}
!1037 = !{!"passwd", !788, i64 0, !788, i64 8, !972, i64 16, !972, i64 20, !788, i64 24, !788, i64 32, !788, i64 40}
!1038 = !DILocation(line: 259, column: 21, scope: !927)
!1039 = !DILocation(line: 260, column: 30, scope: !927)
!1040 = !{!1037, !972, i64 16}
!1041 = !DILocation(line: 260, column: 23, scope: !927)
!1042 = !DILocation(line: 260, column: 16, scope: !927)
!1043 = !DILocation(line: 261, column: 30, scope: !927)
!1044 = !{!1037, !972, i64 20}
!1045 = !DILocation(line: 261, column: 23, scope: !927)
!1046 = !DILocation(line: 261, column: 16, scope: !927)
!1047 = !DILocation(line: 262, column: 11, scope: !927)
!1048 = !DILocation(line: 263, column: 11, scope: !927)
!1049 = !DILocation(line: 264, column: 9, scope: !928)
!1050 = !DILocation(line: 236, column: 36, scope: !928)
!1051 = !DILocation(line: 236, column: 14, scope: !928)
!1052 = distinct !{!1052, !1008, !1053, !831}
!1053 = !DILocation(line: 264, column: 9, scope: !929)
!1054 = !DILocation(scope: !944)
!1055 = !DILocation(line: 274, column: 11, scope: !944)
!1056 = !DILocation(line: 274, column: 24, scope: !1057)
!1057 = distinct !DILexicalBlock(scope: !944, file: !3, line: 274, column: 11)
!1058 = !DILocation(line: 274, column: 11, scope: !1057)
!1059 = !DILocation(line: 275, column: 25, scope: !1057)
!1060 = !DILocation(line: 277, column: 11, scope: !1061)
!1061 = distinct !DILexicalBlock(scope: !1057, file: !3, line: 276, column: 9)
!1062 = !DILocation(line: 277, column: 17, scope: !1061)
!1063 = !DILocation(line: 278, column: 18, scope: !1061)
!1064 = !DILocation(line: 278, column: 16, scope: !1061)
!1065 = !DILocation(line: 279, column: 20, scope: !1066)
!1066 = distinct !DILexicalBlock(scope: !1061, file: !3, line: 279, column: 15)
!1067 = !DILocation(line: 279, column: 30, scope: !1066)
!1068 = !DILocation(line: 279, column: 33, scope: !1066)
!1069 = !DILocation(line: 279, column: 15, scope: !1061)
!1070 = !DILocation(line: 280, column: 13, scope: !1066)
!1071 = !DILocation(line: 283, column: 11, scope: !1072)
!1072 = distinct !DILexicalBlock(scope: !944, file: !3, line: 283, column: 11)
!1073 = !DILocation(line: 283, column: 11, scope: !944)
!1074 = !DILocation(line: 283, column: 23, scope: !1072)
!1075 = !DILocation(line: 284, column: 14, scope: !1072)
!1076 = !DILocation(line: 284, column: 25, scope: !1072)
!1077 = !DILocation(line: 294, column: 11, scope: !1078)
!1078 = distinct !DILexicalBlock(scope: !1079, file: !3, line: 293, column: 9)
!1079 = distinct !DILexicalBlock(scope: !944, file: !3, line: 292, column: 11)
!1080 = !DILocation(line: 286, column: 11, scope: !1081)
!1081 = distinct !DILexicalBlock(scope: !1072, file: !3, line: 285, column: 9)
!1082 = !DILocation(line: 286, column: 17, scope: !1081)
!1083 = !DILocation(line: 287, column: 18, scope: !1081)
!1084 = !DILocation(line: 287, column: 16, scope: !1081)
!1085 = !DILocation(line: 288, column: 20, scope: !1086)
!1086 = distinct !DILexicalBlock(scope: !1081, file: !3, line: 288, column: 15)
!1087 = !DILocation(line: 288, column: 30, scope: !1086)
!1088 = !DILocation(line: 288, column: 33, scope: !1086)
!1089 = !DILocation(line: 288, column: 15, scope: !1081)
!1090 = !DILocation(line: 289, column: 13, scope: !1086)
!1091 = !DILocation(line: 292, column: 12, scope: !1079)
!1092 = !DILocation(line: 292, column: 22, scope: !1079)
!1093 = !DILocation(line: 294, column: 17, scope: !1078)
!1094 = !DILocation(line: 295, column: 18, scope: !1078)
!1095 = !DILocation(line: 295, column: 16, scope: !1078)
!1096 = !DILocation(line: 296, column: 20, scope: !1097)
!1097 = distinct !DILexicalBlock(scope: !1078, file: !3, line: 296, column: 15)
!1098 = !DILocation(line: 296, column: 30, scope: !1097)
!1099 = !DILocation(line: 296, column: 33, scope: !1097)
!1100 = !DILocation(line: 296, column: 15, scope: !1078)
!1101 = !DILocation(line: 297, column: 13, scope: !1097)
!1102 = !DILocation(line: 299, column: 17, scope: !1078)
!1103 = !DILocation(line: 300, column: 18, scope: !1078)
!1104 = !DILocation(line: 300, column: 16, scope: !1078)
!1105 = !DILocation(line: 301, column: 20, scope: !1106)
!1106 = distinct !DILexicalBlock(scope: !1078, file: !3, line: 301, column: 15)
!1107 = !DILocation(line: 301, column: 30, scope: !1106)
!1108 = !DILocation(line: 301, column: 33, scope: !1106)
!1109 = !DILocation(line: 301, column: 15, scope: !1078)
!1110 = !DILocation(line: 302, column: 13, scope: !1106)
!1111 = !DILocation(line: 304, column: 9, scope: !944)
!1112 = !DILocation(line: 307, column: 10, scope: !914)
!1113 = !{i8 0, i8 2}
!1114 = !DILocation(line: 308, column: 1, scope: !914)
!1115 = !DISubprogram(name: "bindtextdomain", scope: !852, file: !852, line: 86, type: !1116, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!1116 = !DISubroutineType(types: !1117)
!1117 = !{!6, !74, !74}
!1118 = !DISubprogram(name: "textdomain", scope: !852, file: !852, line: 82, type: !1119, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!1119 = !DISubroutineType(types: !1120)
!1120 = !{!6, !74}
!1121 = !DISubprogram(name: "atexit", scope: !1122, file: !1122, line: 595, type: !1123, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!1122 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!1123 = !DISubroutineType(types: !1124)
!1124 = !{!77, !1125}
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = !DISubroutineType(types: !1127)
!1127 = !{null}
!1128 = !DISubprogram(name: "getopt_long", scope: !71, file: !71, line: 66, type: !1129, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!1129 = !DISubroutineType(types: !1130)
!1130 = !{!77, !77, !1131, !74, !1133, !79}
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64)
!1132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!1134 = !DISubprogram(name: "error", scope: !1135, file: !1135, line: 52, type: !1136, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!1135 = !DIFile(filename: "./lib/error.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1136 = !DISubroutineType(types: !1137)
!1137 = !{null, !77, !77, !74, null}
!1138 = !DISubprogram(name: "getenv", scope: !1122, file: !1122, line: 634, type: !1119, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!1139 = !DISubprogram(name: "getpwuid", scope: !251, file: !251, line: 110, type: !1140, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!1140 = !DISubroutineType(types: !1141)
!1141 = !{!932, !17}
!1142 = distinct !DISubprogram(name: "print_stuff", scope: !3, file: !3, line: 432, type: !801, scopeLine: 433, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1143)
!1143 = !{!1144}
!1144 = !DILocalVariable(name: "pw_name", arg: 1, scope: !1142, file: !3, line: 432, type: !74)
!1145 = !DILocation(scope: !1142)
!1146 = !DILocation(line: 434, column: 7, scope: !1147)
!1147 = distinct !DILexicalBlock(scope: !1142, file: !3, line: 434, column: 7)
!1148 = !DILocation(line: 434, column: 7, scope: !1142)
!1149 = !DILocation(line: 435, column: 19, scope: !1147)
!1150 = !DILocalVariable(name: "uid", arg: 1, scope: !1151, file: !3, line: 335, type: !13)
!1151 = distinct !DISubprogram(name: "print_user", scope: !3, file: !3, line: 335, type: !1152, scopeLine: 336, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1154)
!1152 = !DISubroutineType(types: !1153)
!1153 = !{null, !13}
!1154 = !{!1150, !1155, !1156}
!1155 = !DILocalVariable(name: "pwd", scope: !1151, file: !3, line: 337, type: !932)
!1156 = !DILocalVariable(name: "s", scope: !1151, file: !3, line: 350, type: !6)
!1157 = !DILocation(scope: !1151, inlinedAt: !1158)
!1158 = distinct !DILocation(line: 435, column: 7, scope: !1147)
!1159 = !DILocation(line: 339, column: 7, scope: !1160, inlinedAt: !1158)
!1160 = distinct !DILexicalBlock(scope: !1151, file: !3, line: 339, column: 7)
!1161 = !DILocation(line: 339, column: 7, scope: !1151, inlinedAt: !1158)
!1162 = !DILocation(line: 328, column: 21, scope: !49, inlinedAt: !1163)
!1163 = distinct !DILocation(line: 350, column: 34, scope: !1151, inlinedAt: !1158)
!1164 = !DILocation(line: 341, column: 13, scope: !1165, inlinedAt: !1158)
!1165 = distinct !DILexicalBlock(scope: !1160, file: !3, line: 340, column: 5)
!1166 = !DILocation(line: 342, column: 15, scope: !1167, inlinedAt: !1158)
!1167 = distinct !DILexicalBlock(scope: !1165, file: !3, line: 342, column: 11)
!1168 = !DILocation(line: 342, column: 11, scope: !1165, inlinedAt: !1158)
!1169 = !DILocation(line: 344, column: 24, scope: !1170, inlinedAt: !1158)
!1170 = distinct !DILexicalBlock(scope: !1167, file: !3, line: 343, column: 9)
!1171 = !DILocation(scope: !49, inlinedAt: !1172)
!1172 = distinct !DILocation(line: 345, column: 18, scope: !1170, inlinedAt: !1158)
!1173 = !DILocation(line: 328, column: 21, scope: !49, inlinedAt: !1172)
!1174 = !DILocation(line: 328, column: 10, scope: !49, inlinedAt: !1172)
!1175 = !DILocation(line: 344, column: 11, scope: !1170, inlinedAt: !1158)
