; ModuleID = 'coreutils-8.32/src/id.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.passwd = type { i8*, i8*, i32, i32, i8*, i8*, i8* }
%struct.group = type { i8*, i8*, i32, i8** }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [USER]...\0A\00", align 1
@.str.2 = private unnamed_addr constant [105 x i8] c"Print user and group information for each specified USER,\0Aor (when USER omitted) for the current user.\0A\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 75, type: !242, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !189, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/id.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{}
!5 = !{!6, !15, !76, !80, !84, !87, !90, !97, !112, !10, !66, !116, !120, !121, !128, !144, !148, !150, !153, !157, !158, !159, !160, !165, !168, !172, !183, !188}
!6 = !DISubprogram(name: "dcgettext", scope: !7, file: !7, line: 51, type: !8, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!7 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!8 = !DISubroutineType(types: !9)
!9 = !{!10, !12, !12, !14}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!14 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!15 = !DISubprogram(name: "fputs_unlocked", scope: !16, file: !16, line: 662, type: !17, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!16 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!17 = !DISubroutineType(types: !18)
!18 = !{!14, !12, !19}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !22)
!21 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!22 = !{!23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !38, !39, !40, !41, !45, !47, !49, !53, !56, !58, !61, !64, !65, !67, !71, !72}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !20, file: !21, line: 51, baseType: !14, size: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !20, file: !21, line: 54, baseType: !10, size: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !20, file: !21, line: 55, baseType: !10, size: 64, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !20, file: !21, line: 56, baseType: !10, size: 64, offset: 192)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !20, file: !21, line: 57, baseType: !10, size: 64, offset: 256)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !20, file: !21, line: 58, baseType: !10, size: 64, offset: 320)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !20, file: !21, line: 59, baseType: !10, size: 64, offset: 384)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !20, file: !21, line: 60, baseType: !10, size: 64, offset: 448)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !20, file: !21, line: 61, baseType: !10, size: 64, offset: 512)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !20, file: !21, line: 64, baseType: !10, size: 64, offset: 576)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !20, file: !21, line: 65, baseType: !10, size: 64, offset: 640)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !20, file: !21, line: 66, baseType: !10, size: 64, offset: 704)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !20, file: !21, line: 68, baseType: !36, size: 64, offset: 768)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !21, line: 36, flags: DIFlagFwdDecl)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !20, file: !21, line: 70, baseType: !19, size: 64, offset: 832)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !20, file: !21, line: 72, baseType: !14, size: 32, offset: 896)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !20, file: !21, line: 73, baseType: !14, size: 32, offset: 928)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !20, file: !21, line: 74, baseType: !42, size: 64, offset: 960)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !43, line: 152, baseType: !44)
!43 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!44 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !20, file: !21, line: 77, baseType: !46, size: 16, offset: 1024)
!46 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !20, file: !21, line: 78, baseType: !48, size: 8, offset: 1040)
!48 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !20, file: !21, line: 79, baseType: !50, size: 8, offset: 1048)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 8, elements: !51)
!51 = !{!52}
!52 = !DISubrange(count: 1)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !20, file: !21, line: 81, baseType: !54, size: 64, offset: 1088)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !21, line: 43, baseType: null)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !20, file: !21, line: 89, baseType: !57, size: 64, offset: 1152)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !43, line: 153, baseType: !44)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !20, file: !21, line: 91, baseType: !59, size: 64, offset: 1216)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !21, line: 37, flags: DIFlagFwdDecl)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !20, file: !21, line: 92, baseType: !62, size: 64, offset: 1280)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !21, line: 38, flags: DIFlagFwdDecl)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !20, file: !21, line: 93, baseType: !19, size: 64, offset: 1344)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !20, file: !21, line: 94, baseType: !66, size: 64, offset: 1408)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !20, file: !21, line: 95, baseType: !68, size: 64, offset: 1472)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !69, line: 46, baseType: !70)
!69 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!70 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !20, file: !21, line: 96, baseType: !14, size: 32, offset: 1536)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !20, file: !21, line: 98, baseType: !73, size: 160, offset: 1568)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 160, elements: !74)
!74 = !{!75}
!75 = !DISubrange(count: 20)
!76 = !DISubprogram(name: "set_program_name", scope: !77, file: !77, line: 37, type: !78, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!77 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!78 = !DISubroutineType(types: !79)
!79 = !{null, !12}
!80 = !DISubprogram(name: "setlocale", scope: !81, file: !81, line: 122, type: !82, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!81 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!82 = !DISubroutineType(types: !83)
!83 = !{!10, !14, !12}
!84 = !DISubprogram(name: "bindtextdomain", scope: !7, file: !7, line: 86, type: !85, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!85 = !DISubroutineType(types: !86)
!86 = !{!10, !12, !12}
!87 = !DISubprogram(name: "textdomain", scope: !7, file: !7, line: 82, type: !88, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!88 = !DISubroutineType(types: !89)
!89 = !{!10, !12}
!90 = !DISubprogram(name: "atexit", scope: !91, file: !91, line: 595, type: !92, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!91 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!92 = !DISubroutineType(types: !93)
!93 = !{!14, !94}
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DISubroutineType(types: !96)
!96 = !{null}
!97 = !DISubprogram(name: "getopt_long", scope: !98, file: !98, line: 66, type: !99, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!98 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!99 = !DISubroutineType(types: !100)
!100 = !{!14, !14, !101, !12, !103, !110}
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !105)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !98, line: 50, size: 256, elements: !106)
!106 = !{!107, !108, !109, !111}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !105, file: !98, line: 52, baseType: !12, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !105, file: !98, line: 55, baseType: !14, size: 32, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !105, file: !98, line: 56, baseType: !110, size: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !105, file: !98, line: 57, baseType: !14, size: 32, offset: 192)
!112 = !DISubprogram(name: "error", scope: !113, file: !113, line: 52, type: !114, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!113 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!114 = !DISubroutineType(types: !115)
!115 = !{null, !14, !14, !12, null}
!116 = !DISubprogram(name: "version_etc", scope: !117, file: !117, line: 69, type: !118, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!117 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!118 = !DISubroutineType(types: !119)
!119 = !{null, !19, !12, !12, !12, null}
!120 = !DISubprogram(name: "getenv", scope: !91, file: !91, line: 634, type: !88, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!121 = !DISubprogram(name: "parse_user_spec", scope: !122, file: !122, line: 7, type: !123, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!122 = !DIFile(filename: "./lib/userspec.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!123 = !DISubroutineType(types: !124)
!124 = !{!12, !12, !125, !125, !127, !127}
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!128 = !DISubprogram(name: "getpwuid", scope: !129, file: !129, line: 110, type: !130, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!129 = !DIFile(filename: "/usr/include/pwd.h", directory: "")
!130 = !DISubroutineType(types: !131)
!131 = !{!132, !126}
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !129, line: 49, size: 384, elements: !134)
!134 = !{!135, !136, !137, !139, !141, !142, !143}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !133, file: !129, line: 51, baseType: !10, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !133, file: !129, line: 52, baseType: !10, size: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !133, file: !129, line: 54, baseType: !138, size: 32, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !43, line: 146, baseType: !126)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !133, file: !129, line: 55, baseType: !140, size: 32, offset: 160)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !43, line: 147, baseType: !126)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !133, file: !129, line: 56, baseType: !10, size: 64, offset: 192)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !133, file: !129, line: 57, baseType: !10, size: 64, offset: 256)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !133, file: !129, line: 58, baseType: !10, size: 64, offset: 320)
!144 = !DISubprogram(name: "quote", scope: !145, file: !145, line: 44, type: !146, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!145 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!146 = !DISubroutineType(types: !147)
!147 = !{!12, !12}
!148 = !DISubprogram(name: "xstrdup", scope: !149, file: !149, line: 64, type: !88, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!149 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!150 = !DISubprogram(name: "free", scope: !91, file: !91, line: 565, type: !151, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!151 = !DISubroutineType(types: !152)
!152 = !{null, !66}
!153 = !DISubprogram(name: "geteuid", scope: !154, file: !154, line: 678, type: !155, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!154 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!155 = !DISubroutineType(types: !156)
!156 = !{!126}
!157 = !DISubprogram(name: "getuid", scope: !154, file: !154, line: 675, type: !155, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!158 = !DISubprogram(name: "getegid", scope: !154, file: !154, line: 684, type: !155, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!159 = !DISubprogram(name: "getgid", scope: !154, file: !154, line: 681, type: !155, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!160 = !DISubprogram(name: "print_group", scope: !161, file: !161, line: 18, type: !162, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!161 = !DIFile(filename: "src/group-list.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!162 = !DISubroutineType(types: !163)
!163 = !{!164, !126, !164}
!164 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!165 = !DISubprogram(name: "print_group_list", scope: !161, file: !161, line: 19, type: !166, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!166 = !DISubroutineType(types: !167)
!167 = !{!164, !12, !126, !126, !126, !164, !11}
!168 = !DISubprogram(name: "umaxtostr", scope: !169, file: !169, line: 46, type: !170, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!169 = !DIFile(filename: "./lib/inttostr.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!170 = !DISubroutineType(types: !171)
!171 = !{!10, !70, !10}
!172 = !DISubprogram(name: "getgrgid", scope: !173, file: !173, line: 101, type: !174, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!173 = !DIFile(filename: "/usr/include/grp.h", directory: "")
!174 = !DISubroutineType(types: !175)
!175 = !{!176, !126}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "group", file: !173, line: 42, size: 256, elements: !178)
!178 = !{!179, !180, !181, !182}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "gr_name", scope: !177, file: !173, line: 44, baseType: !10, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "gr_passwd", scope: !177, file: !173, line: 45, baseType: !10, size: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "gr_gid", scope: !177, file: !173, line: 46, baseType: !140, size: 32, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "gr_mem", scope: !177, file: !173, line: 47, baseType: !127, size: 64, offset: 192)
!183 = !DISubprogram(name: "xgetgroups", scope: !184, file: !184, line: 21, type: !185, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!184 = !DIFile(filename: "./lib/mgetgroups.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!185 = !DISubroutineType(types: !186)
!186 = !{!14, !12, !126, !187}
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!188 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!189 = !{!190, !194, !196, !199, !0, !201, !203, !205, !207, !209, !211, !213, !215, !217, !219, !221, !233}
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(name: "ruid", scope: !2, file: !3, line: 64, type: !192, isLocal: true, isDefinition: true)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !193, line: 79, baseType: !138)
!193 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(name: "euid", scope: !2, file: !3, line: 64, type: !192, isLocal: true, isDefinition: true)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "rgid", scope: !2, file: !3, line: 65, type: !198, isLocal: true, isDefinition: true)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !193, line: 64, baseType: !140)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(name: "egid", scope: !2, file: !3, line: 65, type: !198, isLocal: true, isDefinition: true)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "just_context", scope: !2, file: !3, line: 45, type: !164, isLocal: true, isDefinition: true)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(name: "just_group", scope: !2, file: !3, line: 51, type: !164, isLocal: true, isDefinition: true)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(name: "use_name", scope: !2, file: !3, line: 61, type: !164, isLocal: true, isDefinition: true)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "use_real", scope: !2, file: !3, line: 53, type: !164, isLocal: true, isDefinition: true)
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(name: "just_user", scope: !2, file: !3, line: 55, type: !164, isLocal: true, isDefinition: true)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "opt_zero", scope: !2, file: !3, line: 47, type: !164, isLocal: true, isDefinition: true)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(name: "just_group_list", scope: !2, file: !3, line: 49, type: !164, isLocal: true, isDefinition: true)
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(name: "context", scope: !2, file: !3, line: 69, type: !10, isLocal: true, isDefinition: true)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(name: "multiple_users", scope: !2, file: !3, line: 59, type: !164, isLocal: true, isDefinition: true)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(name: "ok", scope: !2, file: !3, line: 57, type: !164, isLocal: true, isDefinition: true)
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(name: "buf", scope: !223, file: !3, line: 327, type: !230, isLocal: true, isDefinition: true)
!223 = distinct !DISubprogram(name: "uidtostr_ptr", scope: !3, file: !3, line: 325, type: !224, scopeLine: 326, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !228)
!224 = !DISubroutineType(types: !225)
!225 = !{!10, !226}
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !192)
!228 = !{!229}
!229 = !DILocalVariable(name: "uid", arg: 1, scope: !223, file: !3, line: 325, type: !226)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 168, elements: !231)
!231 = !{!232}
!232 = !DISubrange(count: 21)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(name: "buf", scope: !235, file: !3, line: 316, type: !230, isLocal: true, isDefinition: true)
!235 = distinct !DISubprogram(name: "gidtostr_ptr", scope: !3, file: !3, line: 314, type: !236, scopeLine: 315, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !240)
!236 = !DISubroutineType(types: !237)
!237 = !{!10, !238}
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !198)
!240 = !{!241}
!241 = !DILocalVariable(name: "gid", arg: 1, scope: !235, file: !3, line: 314, type: !238)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 2560, elements: !243)
!243 = !{!244}
!244 = !DISubrange(count: 10)
!245 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!246 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!247 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!248 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!249 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!250 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(name: "buf", scope: !253, file: !254, line: 96, type: !230, isLocal: true, isDefinition: true)
!253 = distinct !DISubprogram(name: "gidtostr_ptr", scope: !254, file: !254, line: 94, type: !236, scopeLine: 95, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !255, retainedNodes: !316)
!254 = !DIFile(filename: "src/group-list.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!255 = distinct !DICompileUnit(language: DW_LANG_C99, file: !254, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !256, globals: !315, splitDebugInlining: false, nameTableKind: None)
!256 = !{!257, !66, !160, !183, !6, !144, !112, !150, !270, !70, !280, !188, !168}
!257 = !DISubprogram(name: "getpwuid", scope: !129, file: !129, line: 110, type: !258, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!258 = !DISubroutineType(types: !259)
!259 = !{!260, !126}
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !129, line: 49, size: 384, elements: !262)
!262 = !{!263, !264, !265, !266, !267, !268, !269}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !261, file: !129, line: 51, baseType: !10, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !261, file: !129, line: 52, baseType: !10, size: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !261, file: !129, line: 54, baseType: !138, size: 32, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !261, file: !129, line: 55, baseType: !140, size: 32, offset: 160)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !261, file: !129, line: 56, baseType: !10, size: 64, offset: 192)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !261, file: !129, line: 57, baseType: !10, size: 64, offset: 256)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !261, file: !129, line: 58, baseType: !10, size: 64, offset: 320)
!270 = !DISubprogram(name: "getgrgid", scope: !173, file: !173, line: 101, type: !271, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!271 = !DISubroutineType(types: !272)
!272 = !{!273, !126}
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "group", file: !173, line: 42, size: 256, elements: !275)
!275 = !{!276, !277, !278, !279}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "gr_name", scope: !274, file: !173, line: 44, baseType: !10, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "gr_passwd", scope: !274, file: !173, line: 45, baseType: !10, size: 64, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "gr_gid", scope: !274, file: !173, line: 46, baseType: !140, size: 32, offset: 128)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "gr_mem", scope: !274, file: !173, line: 47, baseType: !127, size: 64, offset: 192)
!280 = !DISubprogram(name: "fputs_unlocked", scope: !16, file: !16, line: 662, type: !281, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!281 = !DISubroutineType(types: !282)
!282 = !{!14, !12, !283}
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !285)
!285 = !{!286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !284, file: !21, line: 51, baseType: !14, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !284, file: !21, line: 54, baseType: !10, size: 64, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !284, file: !21, line: 55, baseType: !10, size: 64, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !284, file: !21, line: 56, baseType: !10, size: 64, offset: 192)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !284, file: !21, line: 57, baseType: !10, size: 64, offset: 256)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !284, file: !21, line: 58, baseType: !10, size: 64, offset: 320)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !284, file: !21, line: 59, baseType: !10, size: 64, offset: 384)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !284, file: !21, line: 60, baseType: !10, size: 64, offset: 448)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !284, file: !21, line: 61, baseType: !10, size: 64, offset: 512)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !284, file: !21, line: 64, baseType: !10, size: 64, offset: 576)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !284, file: !21, line: 65, baseType: !10, size: 64, offset: 640)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !284, file: !21, line: 66, baseType: !10, size: 64, offset: 704)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !284, file: !21, line: 68, baseType: !36, size: 64, offset: 768)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !284, file: !21, line: 70, baseType: !283, size: 64, offset: 832)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !284, file: !21, line: 72, baseType: !14, size: 32, offset: 896)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !284, file: !21, line: 73, baseType: !14, size: 32, offset: 928)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !284, file: !21, line: 74, baseType: !42, size: 64, offset: 960)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !284, file: !21, line: 77, baseType: !46, size: 16, offset: 1024)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !284, file: !21, line: 78, baseType: !48, size: 8, offset: 1040)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !284, file: !21, line: 79, baseType: !50, size: 8, offset: 1048)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !284, file: !21, line: 81, baseType: !54, size: 64, offset: 1088)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !284, file: !21, line: 89, baseType: !57, size: 64, offset: 1152)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !284, file: !21, line: 91, baseType: !59, size: 64, offset: 1216)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !284, file: !21, line: 92, baseType: !62, size: 64, offset: 1280)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !284, file: !21, line: 93, baseType: !283, size: 64, offset: 1344)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !284, file: !21, line: 94, baseType: !66, size: 64, offset: 1408)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !284, file: !21, line: 95, baseType: !68, size: 64, offset: 1472)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !284, file: !21, line: 96, baseType: !14, size: 32, offset: 1536)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !284, file: !21, line: 98, baseType: !73, size: 160, offset: 1568)
!315 = !{!251}
!316 = !{!317}
!317 = !DILocalVariable(name: "gid", arg: 1, scope: !253, file: !254, line: 94, type: !238)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "Version", scope: !320, file: !321, line: 2, type: !12, isLocal: false, isDefinition: true)
!320 = distinct !DICompileUnit(language: DW_LANG_C99, file: !321, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !322, splitDebugInlining: false, nameTableKind: None)
!321 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!322 = !{!318}
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(name: "file_name", scope: !325, file: !326, line: 46, type: !12, isLocal: true, isDefinition: true)
!325 = distinct !DICompileUnit(language: DW_LANG_C99, file: !326, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !327, globals: !366, splitDebugInlining: false, nameTableKind: None)
!326 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!327 = !{!328, !6, !364, !112}
!328 = !DISubprogram(name: "close_stream", scope: !329, file: !329, line: 2, type: !330, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!329 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!330 = !DISubroutineType(types: !331)
!331 = !{!14, !332}
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !334)
!334 = !{!335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !333, file: !21, line: 51, baseType: !14, size: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !333, file: !21, line: 54, baseType: !10, size: 64, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !333, file: !21, line: 55, baseType: !10, size: 64, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !333, file: !21, line: 56, baseType: !10, size: 64, offset: 192)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !333, file: !21, line: 57, baseType: !10, size: 64, offset: 256)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !333, file: !21, line: 58, baseType: !10, size: 64, offset: 320)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !333, file: !21, line: 59, baseType: !10, size: 64, offset: 384)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !333, file: !21, line: 60, baseType: !10, size: 64, offset: 448)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !333, file: !21, line: 61, baseType: !10, size: 64, offset: 512)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !333, file: !21, line: 64, baseType: !10, size: 64, offset: 576)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !333, file: !21, line: 65, baseType: !10, size: 64, offset: 640)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !333, file: !21, line: 66, baseType: !10, size: 64, offset: 704)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !333, file: !21, line: 68, baseType: !36, size: 64, offset: 768)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !333, file: !21, line: 70, baseType: !332, size: 64, offset: 832)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !333, file: !21, line: 72, baseType: !14, size: 32, offset: 896)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !333, file: !21, line: 73, baseType: !14, size: 32, offset: 928)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !333, file: !21, line: 74, baseType: !42, size: 64, offset: 960)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !333, file: !21, line: 77, baseType: !46, size: 16, offset: 1024)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !333, file: !21, line: 78, baseType: !48, size: 8, offset: 1040)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !333, file: !21, line: 79, baseType: !50, size: 8, offset: 1048)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !333, file: !21, line: 81, baseType: !54, size: 64, offset: 1088)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !333, file: !21, line: 89, baseType: !57, size: 64, offset: 1152)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !333, file: !21, line: 91, baseType: !59, size: 64, offset: 1216)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !333, file: !21, line: 92, baseType: !62, size: 64, offset: 1280)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !333, file: !21, line: 93, baseType: !332, size: 64, offset: 1344)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !333, file: !21, line: 94, baseType: !66, size: 64, offset: 1408)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !333, file: !21, line: 95, baseType: !68, size: 64, offset: 1472)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !333, file: !21, line: 96, baseType: !14, size: 32, offset: 1536)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !333, file: !21, line: 98, baseType: !73, size: 160, offset: 1568)
!364 = !DISubprogram(name: "quotearg_colon", scope: !365, file: !365, line: 391, type: !88, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!365 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!366 = !{!323, !367}
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !325, file: !326, line: 56, type: !164, isLocal: true, isDefinition: true)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(name: "exit_failure", scope: !371, file: !372, line: 24, type: !374, isLocal: false, isDefinition: true)
!371 = distinct !DICompileUnit(language: DW_LANG_C99, file: !372, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !373, splitDebugInlining: false, nameTableKind: None)
!372 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!373 = !{!369}
!374 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !14)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(name: "program_name", scope: !377, file: !378, line: 33, type: !12, isLocal: false, isDefinition: true)
!377 = distinct !DICompileUnit(language: DW_LANG_C99, file: !378, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !379, globals: !415, splitDebugInlining: false, nameTableKind: None)
!378 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!379 = !{!66, !380, !10}
!380 = !DISubprogram(name: "fputs", scope: !16, file: !16, line: 626, type: !381, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!381 = !DISubroutineType(types: !382)
!382 = !{!14, !12, !383}
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !385)
!385 = !{!386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !384, file: !21, line: 51, baseType: !14, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !384, file: !21, line: 54, baseType: !10, size: 64, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !384, file: !21, line: 55, baseType: !10, size: 64, offset: 128)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !384, file: !21, line: 56, baseType: !10, size: 64, offset: 192)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !384, file: !21, line: 57, baseType: !10, size: 64, offset: 256)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !384, file: !21, line: 58, baseType: !10, size: 64, offset: 320)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !384, file: !21, line: 59, baseType: !10, size: 64, offset: 384)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !384, file: !21, line: 60, baseType: !10, size: 64, offset: 448)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !384, file: !21, line: 61, baseType: !10, size: 64, offset: 512)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !384, file: !21, line: 64, baseType: !10, size: 64, offset: 576)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !384, file: !21, line: 65, baseType: !10, size: 64, offset: 640)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !384, file: !21, line: 66, baseType: !10, size: 64, offset: 704)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !384, file: !21, line: 68, baseType: !36, size: 64, offset: 768)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !384, file: !21, line: 70, baseType: !383, size: 64, offset: 832)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !384, file: !21, line: 72, baseType: !14, size: 32, offset: 896)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !384, file: !21, line: 73, baseType: !14, size: 32, offset: 928)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !384, file: !21, line: 74, baseType: !42, size: 64, offset: 960)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !384, file: !21, line: 77, baseType: !46, size: 16, offset: 1024)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !384, file: !21, line: 78, baseType: !48, size: 8, offset: 1040)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !384, file: !21, line: 79, baseType: !50, size: 8, offset: 1048)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !384, file: !21, line: 81, baseType: !54, size: 64, offset: 1088)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !384, file: !21, line: 89, baseType: !57, size: 64, offset: 1152)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !384, file: !21, line: 91, baseType: !59, size: 64, offset: 1216)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !384, file: !21, line: 92, baseType: !62, size: 64, offset: 1280)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !384, file: !21, line: 93, baseType: !383, size: 64, offset: 1344)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !384, file: !21, line: 94, baseType: !66, size: 64, offset: 1408)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !384, file: !21, line: 95, baseType: !68, size: 64, offset: 1472)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !384, file: !21, line: 96, baseType: !14, size: 32, offset: 1536)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !384, file: !21, line: 98, baseType: !73, size: 160, offset: 1568)
!415 = !{!375}
!416 = !DIGlobalVariableExpression(var: !417, expr: !DIExpression())
!417 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !418, file: !419, line: 85, type: !546, isLocal: false, isDefinition: true)
!418 = distinct !DICompileUnit(language: DW_LANG_C99, file: !419, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !420, retainedTypes: !454, globals: !521, splitDebugInlining: false, nameTableKind: None)
!419 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!420 = !{!421, !434, !439}
!421 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !365, line: 32, baseType: !126, size: 32, elements: !422)
!422 = !{!423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433}
!423 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!424 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!425 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!426 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!427 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!428 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!429 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!430 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!431 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!432 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!433 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!434 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !365, line: 242, baseType: !126, size: 32, elements: !435)
!435 = !{!436, !437, !438}
!436 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!437 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!438 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!439 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !440, line: 46, baseType: !126, size: 32, elements: !441)
!440 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!441 = !{!442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453}
!442 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!443 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!444 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!445 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!446 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!447 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!448 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!449 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!450 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!451 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!452 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!453 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!454 = !{!455, !460, !150, !476, !14, !46, !479, !68, !496, !500, !6, !506, !510, !10, !514, !517, !518}
!455 = !DISubprogram(name: "xmemdup", scope: !149, file: !149, line: 62, type: !456, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!456 = !DISubroutineType(types: !457)
!457 = !{!66, !458, !70}
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!460 = !DISubprogram(name: "quotearg_alloc_mem", scope: !365, file: !365, line: 342, type: !461, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!461 = !DISubroutineType(types: !462)
!462 = !{!10, !12, !70, !463, !464}
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !466)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !419, line: 65, size: 448, elements: !467)
!467 = !{!468, !469, !470, !474, !475}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !466, file: !419, line: 68, baseType: !421, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !466, file: !419, line: 71, baseType: !14, size: 32, offset: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !466, file: !419, line: 75, baseType: !471, size: 256, offset: 64)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 256, elements: !472)
!472 = !{!473}
!473 = !DISubrange(count: 8)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !466, file: !419, line: 78, baseType: !12, size: 64, offset: 320)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !466, file: !419, line: 81, baseType: !12, size: 64, offset: 384)
!476 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !365, file: !365, line: 408, type: !477, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!477 = !DISubroutineType(types: !478)
!478 = !{!10, !14, !12, !12, !12, !70}
!479 = !DISubprogram(name: "rpl_mbrtowc", scope: !480, file: !480, line: 717, type: !481, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!480 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!481 = !DISubroutineType(types: !482)
!482 = !{!70, !110, !12, !70, !483}
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !485, line: 13, size: 64, elements: !486)
!485 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!486 = !{!487, !488}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !484, file: !485, line: 15, baseType: !14, size: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !484, file: !485, line: 20, baseType: !489, size: 32, offset: 32)
!489 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !484, file: !485, line: 16, size: 32, elements: !490)
!490 = !{!491, !492}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !489, file: !485, line: 18, baseType: !126, size: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !489, file: !485, line: 19, baseType: !493, size: 32)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 32, elements: !494)
!494 = !{!495}
!495 = !DISubrange(count: 4)
!496 = !DISubprogram(name: "iswprint", scope: !497, file: !497, line: 120, type: !498, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!497 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!498 = !DISubroutineType(types: !499)
!499 = !{!14, !126}
!500 = !DISubprogram(name: "mbsinit", scope: !501, file: !501, line: 292, type: !502, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!501 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!502 = !DISubroutineType(types: !503)
!503 = !{!14, !504}
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !484)
!506 = !DISubprogram(name: "locale_charset", scope: !507, file: !507, line: 35, type: !508, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!507 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!508 = !DISubroutineType(types: !509)
!509 = !{!12}
!510 = !DISubprogram(name: "c_strcasecmp", scope: !511, file: !511, line: 42, type: !512, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!511 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!512 = !DISubroutineType(types: !513)
!513 = !{!14, !12, !12}
!514 = !DISubprogram(name: "xmalloc", scope: !149, file: !149, line: 53, type: !515, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!515 = !DISubroutineType(types: !516)
!516 = !{!66, !70}
!517 = !DISubprogram(name: "xalloc_die", scope: !149, file: !149, line: 51, type: !95, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !4)
!518 = !DISubprogram(name: "xrealloc", scope: !149, file: !149, line: 59, type: !519, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!519 = !DISubroutineType(types: !520)
!520 = !{!66, !66, !70}
!521 = !{!416, !522, !526, !528, !530, !535, !542, !544}
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !418, file: !419, line: 101, type: !524, isLocal: false, isDefinition: true)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !525, size: 320, elements: !243)
!525 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !421)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !418, file: !419, line: 1052, type: !466, isLocal: false, isDefinition: true)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !418, file: !419, line: 116, type: !466, isLocal: true, isDefinition: true)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(name: "slot0", scope: !418, file: !419, line: 842, type: !532, isLocal: true, isDefinition: true)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 2048, elements: !533)
!533 = !{!534}
!534 = !DISubrange(count: 256)
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(name: "slotvec", scope: !418, file: !419, line: 845, type: !537, isLocal: true, isDefinition: true)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !419, line: 834, size: 128, elements: !539)
!539 = !{!540, !541}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !538, file: !419, line: 836, baseType: !68, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !538, file: !419, line: 837, baseType: !10, size: 64, offset: 64)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(name: "nslots", scope: !418, file: !419, line: 843, type: !14, isLocal: true, isDefinition: true)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(name: "slotvec0", scope: !418, file: !419, line: 844, type: !538, isLocal: true, isDefinition: true)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !547, size: 704, elements: !548)
!547 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!548 = !{!549}
!549 = !DISubrange(count: 11)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !552, file: !553, line: 26, type: !555, isLocal: false, isDefinition: true)
!552 = distinct !DICompileUnit(language: DW_LANG_C99, file: !553, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !554, splitDebugInlining: false, nameTableKind: None)
!553 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!554 = !{!550}
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 376, elements: !556)
!556 = !{!557}
!557 = !DISubrange(count: 47)
!558 = distinct !DICompileUnit(language: DW_LANG_C99, file: !559, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !560, splitDebugInlining: false, nameTableKind: None)
!559 = !DIFile(filename: "lib/umaxtostr.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!560 = !{!561}
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !562, line: 102, baseType: !563)
!562 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !43, line: 73, baseType: !70)
!564 = distinct !DICompileUnit(language: DW_LANG_C99, file: !565, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !566, retainedTypes: !575, globals: !607, splitDebugInlining: false, nameTableKind: None)
!565 = !DIFile(filename: "lib/userspec.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!566 = !{!567}
!567 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !568, line: 25, baseType: !126, size: 32, elements: !569)
!568 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!569 = !{!570, !571, !572, !573, !574}
!570 = !DIEnumerator(name: "LONGINT_OK", value: 0, isUnsigned: true)
!571 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1, isUnsigned: true)
!572 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2, isUnsigned: true)
!573 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3, isUnsigned: true)
!574 = !DIEnumerator(name: "LONGINT_INVALID", value: 4, isUnsigned: true)
!575 = !{!66, !148, !455, !576, !589, !192, !592, !168, !602, !603, !604, !198, !150, !6}
!576 = !DISubprogram(name: "getpwnam", scope: !129, file: !129, line: 116, type: !577, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!577 = !DISubroutineType(types: !578)
!578 = !{!579, !12}
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !129, line: 49, size: 384, elements: !581)
!581 = !{!582, !583, !584, !585, !586, !587, !588}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !580, file: !129, line: 51, baseType: !10, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !580, file: !129, line: 52, baseType: !10, size: 64, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !580, file: !129, line: 54, baseType: !138, size: 32, offset: 128)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !580, file: !129, line: 55, baseType: !140, size: 32, offset: 160)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !580, file: !129, line: 56, baseType: !10, size: 64, offset: 192)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !580, file: !129, line: 57, baseType: !10, size: 64, offset: 256)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !580, file: !129, line: 58, baseType: !10, size: 64, offset: 320)
!589 = !DISubprogram(name: "xstrtoul", scope: !568, file: !568, line: 44, type: !590, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!590 = !DISubroutineType(types: !591)
!591 = !{!567, !12, !127, !14, !463, !12}
!592 = !DISubprogram(name: "getgrgid", scope: !173, file: !173, line: 101, type: !593, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!593 = !DISubroutineType(types: !594)
!594 = !{!595, !126}
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "group", file: !173, line: 42, size: 256, elements: !597)
!597 = !{!598, !599, !600, !601}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "gr_name", scope: !596, file: !173, line: 44, baseType: !10, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "gr_passwd", scope: !596, file: !173, line: 45, baseType: !10, size: 64, offset: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "gr_gid", scope: !596, file: !173, line: 46, baseType: !140, size: 32, offset: 128)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "gr_mem", scope: !596, file: !173, line: 47, baseType: !127, size: 64, offset: 192)
!602 = !DISubprogram(name: "endgrent", scope: !173, file: !173, line: 67, type: !95, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!603 = !DISubprogram(name: "endpwent", scope: !129, file: !129, line: 78, type: !95, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!604 = !DISubprogram(name: "getgrnam", scope: !173, file: !173, line: 107, type: !605, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!605 = !DISubroutineType(types: !606)
!606 = !{!595, !12}
!607 = !{!608, !650, !652}
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(name: "E_invalid_user", scope: !610, file: !565, line: 106, type: !12, isLocal: true, isDefinition: true)
!610 = distinct !DISubprogram(name: "parse_with_separator", scope: !565, file: !565, line: 102, type: !611, scopeLine: 105, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !564, retainedNodes: !615)
!611 = !DISubroutineType(types: !612)
!612 = !{!12, !12, !12, !613, !614, !127, !127}
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!615 = !{!616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !633, !638, !641, !645}
!616 = !DILocalVariable(name: "spec", arg: 1, scope: !610, file: !565, line: 102, type: !12)
!617 = !DILocalVariable(name: "separator", arg: 2, scope: !610, file: !565, line: 102, type: !12)
!618 = !DILocalVariable(name: "uid", arg: 3, scope: !610, file: !565, line: 103, type: !613)
!619 = !DILocalVariable(name: "gid", arg: 4, scope: !610, file: !565, line: 103, type: !614)
!620 = !DILocalVariable(name: "username", arg: 5, scope: !610, file: !565, line: 104, type: !127)
!621 = !DILocalVariable(name: "groupname", arg: 6, scope: !610, file: !565, line: 104, type: !127)
!622 = !DILocalVariable(name: "error_msg", scope: !610, file: !565, line: 110, type: !12)
!623 = !DILocalVariable(name: "pwd", scope: !610, file: !565, line: 111, type: !579)
!624 = !DILocalVariable(name: "grp", scope: !610, file: !565, line: 112, type: !595)
!625 = !DILocalVariable(name: "u", scope: !610, file: !565, line: 113, type: !10)
!626 = !DILocalVariable(name: "g", scope: !610, file: !565, line: 114, type: !12)
!627 = !DILocalVariable(name: "gname", scope: !610, file: !565, line: 115, type: !10)
!628 = !DILocalVariable(name: "unum", scope: !610, file: !565, line: 116, type: !192)
!629 = !DILocalVariable(name: "gnum", scope: !610, file: !565, line: 117, type: !198)
!630 = !DILocalVariable(name: "ulen", scope: !631, file: !565, line: 137, type: !68)
!631 = distinct !DILexicalBlock(scope: !632, file: !565, line: 136, column: 5)
!632 = distinct !DILexicalBlock(scope: !610, file: !565, line: 130, column: 7)
!633 = !DILocalVariable(name: "use_login_group", scope: !634, file: !565, line: 164, type: !164)
!634 = distinct !DILexicalBlock(scope: !635, file: !565, line: 163, column: 9)
!635 = distinct !DILexicalBlock(scope: !636, file: !565, line: 162, column: 11)
!636 = distinct !DILexicalBlock(scope: !637, file: !565, line: 159, column: 5)
!637 = distinct !DILexicalBlock(scope: !610, file: !565, line: 158, column: 7)
!638 = !DILocalVariable(name: "tmp", scope: !639, file: !565, line: 173, type: !70)
!639 = distinct !DILexicalBlock(scope: !640, file: !565, line: 172, column: 13)
!640 = distinct !DILexicalBlock(scope: !634, file: !565, line: 165, column: 15)
!641 = !DILocalVariable(name: "buf", scope: !642, file: !565, line: 188, type: !230)
!642 = distinct !DILexicalBlock(scope: !643, file: !565, line: 185, column: 13)
!643 = distinct !DILexicalBlock(scope: !644, file: !565, line: 184, column: 15)
!644 = distinct !DILexicalBlock(scope: !635, file: !565, line: 182, column: 9)
!645 = !DILocalVariable(name: "tmp", scope: !646, file: !565, line: 205, type: !70)
!646 = distinct !DILexicalBlock(scope: !647, file: !565, line: 204, column: 9)
!647 = distinct !DILexicalBlock(scope: !648, file: !565, line: 203, column: 11)
!648 = distinct !DILexicalBlock(scope: !649, file: !565, line: 199, column: 5)
!649 = distinct !DILexicalBlock(scope: !610, file: !565, line: 198, column: 7)
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(name: "E_invalid_group", scope: !610, file: !565, line: 107, type: !12, isLocal: true, isDefinition: true)
!652 = !DIGlobalVariableExpression(var: !653, expr: !DIExpression())
!653 = distinct !DIGlobalVariable(name: "E_bad_spec", scope: !610, file: !565, line: 108, type: !12, isLocal: true, isDefinition: true)
!654 = distinct !DICompileUnit(language: DW_LANG_C99, file: !655, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !656, retainedTypes: !660, splitDebugInlining: false, nameTableKind: None)
!655 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!656 = !{!657}
!657 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !655, line: 40, baseType: !126, size: 32, elements: !658)
!658 = !{!659}
!659 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!660 = !{!6, !661, !66}
!661 = !DISubprogram(name: "fputs_unlocked", scope: !16, file: !16, line: 662, type: !662, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!662 = !DISubroutineType(types: !663)
!663 = !{!14, !12, !664}
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !666)
!666 = !{!667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !665, file: !21, line: 51, baseType: !14, size: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !665, file: !21, line: 54, baseType: !10, size: 64, offset: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !665, file: !21, line: 55, baseType: !10, size: 64, offset: 128)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !665, file: !21, line: 56, baseType: !10, size: 64, offset: 192)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !665, file: !21, line: 57, baseType: !10, size: 64, offset: 256)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !665, file: !21, line: 58, baseType: !10, size: 64, offset: 320)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !665, file: !21, line: 59, baseType: !10, size: 64, offset: 384)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !665, file: !21, line: 60, baseType: !10, size: 64, offset: 448)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !665, file: !21, line: 61, baseType: !10, size: 64, offset: 512)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !665, file: !21, line: 64, baseType: !10, size: 64, offset: 576)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !665, file: !21, line: 65, baseType: !10, size: 64, offset: 640)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !665, file: !21, line: 66, baseType: !10, size: 64, offset: 704)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !665, file: !21, line: 68, baseType: !36, size: 64, offset: 768)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !665, file: !21, line: 70, baseType: !664, size: 64, offset: 832)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !665, file: !21, line: 72, baseType: !14, size: 32, offset: 896)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !665, file: !21, line: 73, baseType: !14, size: 32, offset: 928)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !665, file: !21, line: 74, baseType: !42, size: 64, offset: 960)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !665, file: !21, line: 77, baseType: !46, size: 16, offset: 1024)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !665, file: !21, line: 78, baseType: !48, size: 8, offset: 1040)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !665, file: !21, line: 79, baseType: !50, size: 8, offset: 1048)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !665, file: !21, line: 81, baseType: !54, size: 64, offset: 1088)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !665, file: !21, line: 89, baseType: !57, size: 64, offset: 1152)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !665, file: !21, line: 91, baseType: !59, size: 64, offset: 1216)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !665, file: !21, line: 92, baseType: !62, size: 64, offset: 1280)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !665, file: !21, line: 93, baseType: !664, size: 64, offset: 1344)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !665, file: !21, line: 94, baseType: !66, size: 64, offset: 1408)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !665, file: !21, line: 95, baseType: !68, size: 64, offset: 1472)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !665, file: !21, line: 96, baseType: !14, size: 32, offset: 1536)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !665, file: !21, line: 98, baseType: !73, size: 160, offset: 1568)
!696 = distinct !DICompileUnit(language: DW_LANG_C99, file: !697, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !698, retainedTypes: !711, splitDebugInlining: false, nameTableKind: None)
!697 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!698 = !{!699}
!699 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !700, file: !149, line: 186, baseType: !126, size: 32, elements: !709)
!700 = distinct !DISubprogram(name: "x2nrealloc", scope: !149, file: !149, line: 174, type: !701, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !696, retainedNodes: !704)
!701 = !DISubroutineType(types: !702)
!702 = !{!66, !66, !703, !68}
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!704 = !{!705, !706, !707, !708}
!705 = !DILocalVariable(name: "p", arg: 1, scope: !700, file: !149, line: 174, type: !66)
!706 = !DILocalVariable(name: "pn", arg: 2, scope: !700, file: !149, line: 174, type: !703)
!707 = !DILocalVariable(name: "s", arg: 3, scope: !700, file: !149, line: 174, type: !68)
!708 = !DILocalVariable(name: "n", scope: !700, file: !149, line: 176, type: !68)
!709 = !{!710}
!710 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!711 = !{!68, !517, !514, !518, !10, !150, !66, !712, !715}
!712 = !DISubprogram(name: "xcalloc", scope: !149, file: !149, line: 57, type: !713, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!713 = !DISubroutineType(types: !714)
!714 = !{!66, !70, !70}
!715 = !DISubprogram(name: "rpl_calloc", scope: !716, file: !716, line: 688, type: !713, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!716 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!717 = distinct !DICompileUnit(language: DW_LANG_C99, file: !718, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !719, splitDebugInlining: false, nameTableKind: None)
!718 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!719 = !{!6, !112}
!720 = distinct !DICompileUnit(language: DW_LANG_C99, file: !721, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !722, splitDebugInlining: false, nameTableKind: None)
!721 = !DIFile(filename: "lib/xgetgroups.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!722 = !{!723, !517}
!723 = !DISubprogram(name: "mgetgroups", scope: !184, file: !184, line: 19, type: !185, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!724 = distinct !DICompileUnit(language: DW_LANG_C99, file: !725, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !726, retainedTypes: !727, splitDebugInlining: false, nameTableKind: None)
!725 = !DIFile(filename: "lib/xstrtoul.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!726 = !{!567, !439}
!727 = !{!14, !46}
!728 = distinct !DICompileUnit(language: DW_LANG_C99, file: !729, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !730, splitDebugInlining: false, nameTableKind: None)
!729 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!730 = !{!66}
!731 = distinct !DICompileUnit(language: DW_LANG_C99, file: !732, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !733, splitDebugInlining: false, nameTableKind: None)
!732 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!733 = !{!734, !68, !746}
!734 = !DISubprogram(name: "mbrtowc", scope: !501, file: !501, line: 296, type: !735, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!735 = !DISubroutineType(types: !736)
!736 = !{!70, !110, !12, !70, !737}
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !485, line: 13, size: 64, elements: !739)
!739 = !{!740, !741}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !738, file: !485, line: 15, baseType: !14, size: 32)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !738, file: !485, line: 20, baseType: !742, size: 32, offset: 32)
!742 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !738, file: !485, line: 16, size: 32, elements: !743)
!743 = !{!744, !745}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !742, file: !485, line: 18, baseType: !126, size: 32)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !742, file: !485, line: 19, baseType: !493, size: 32)
!746 = !DISubprogram(name: "hard_locale", scope: !747, file: !747, line: 26, type: !748, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!747 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!748 = !DISubroutineType(types: !749)
!749 = !{!164, !14}
!750 = distinct !DICompileUnit(language: DW_LANG_C99, file: !751, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !752, splitDebugInlining: false, nameTableKind: None)
!751 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!752 = !{!753}
!753 = !DISubprogram(name: "rpl_fclose", scope: !754, file: !754, line: 672, type: !755, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!754 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!755 = !DISubroutineType(types: !756)
!756 = !{!14, !757}
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !759)
!759 = !{!760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !758, file: !21, line: 51, baseType: !14, size: 32)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !758, file: !21, line: 54, baseType: !10, size: 64, offset: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !758, file: !21, line: 55, baseType: !10, size: 64, offset: 128)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !758, file: !21, line: 56, baseType: !10, size: 64, offset: 192)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !758, file: !21, line: 57, baseType: !10, size: 64, offset: 256)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !758, file: !21, line: 58, baseType: !10, size: 64, offset: 320)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !758, file: !21, line: 59, baseType: !10, size: 64, offset: 384)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !758, file: !21, line: 60, baseType: !10, size: 64, offset: 448)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !758, file: !21, line: 61, baseType: !10, size: 64, offset: 512)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !758, file: !21, line: 64, baseType: !10, size: 64, offset: 576)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !758, file: !21, line: 65, baseType: !10, size: 64, offset: 640)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !758, file: !21, line: 66, baseType: !10, size: 64, offset: 704)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !758, file: !21, line: 68, baseType: !36, size: 64, offset: 768)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !758, file: !21, line: 70, baseType: !757, size: 64, offset: 832)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !758, file: !21, line: 72, baseType: !14, size: 32, offset: 896)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !758, file: !21, line: 73, baseType: !14, size: 32, offset: 928)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !758, file: !21, line: 74, baseType: !42, size: 64, offset: 960)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !758, file: !21, line: 77, baseType: !46, size: 16, offset: 1024)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !758, file: !21, line: 78, baseType: !48, size: 8, offset: 1040)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !758, file: !21, line: 79, baseType: !50, size: 8, offset: 1048)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !758, file: !21, line: 81, baseType: !54, size: 64, offset: 1088)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !758, file: !21, line: 89, baseType: !57, size: 64, offset: 1152)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !758, file: !21, line: 91, baseType: !59, size: 64, offset: 1216)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !758, file: !21, line: 92, baseType: !62, size: 64, offset: 1280)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !758, file: !21, line: 93, baseType: !757, size: 64, offset: 1344)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !758, file: !21, line: 94, baseType: !66, size: 64, offset: 1408)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !758, file: !21, line: 95, baseType: !68, size: 64, offset: 1472)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !758, file: !21, line: 96, baseType: !14, size: 32, offset: 1536)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !758, file: !21, line: 98, baseType: !73, size: 160, offset: 1568)
!789 = distinct !DICompileUnit(language: DW_LANG_C99, file: !790, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !791, splitDebugInlining: false, nameTableKind: None)
!790 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!791 = !{!792}
!792 = !DISubprogram(name: "setlocale_null_r", scope: !793, file: !793, line: 64, type: !794, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!793 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!794 = !DISubroutineType(types: !795)
!795 = !{!14, !14, !10, !70}
!796 = distinct !DICompileUnit(language: DW_LANG_C99, file: !797, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !798, retainedTypes: !1185, splitDebugInlining: false, nameTableKind: None)
!797 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!798 = !{!799}
!799 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !800, line: 41, baseType: !126, size: 32, elements: !801)
!800 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!801 = !{!802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184}
!802 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!803 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!804 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!805 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!806 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!807 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!808 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!809 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!810 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!811 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!812 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!813 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!814 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!815 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!816 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!817 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!818 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!819 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!820 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!821 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!822 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!823 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!824 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!825 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!826 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!827 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!828 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!829 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!830 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!831 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!832 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!833 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!834 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!835 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!836 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!837 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!838 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!839 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!840 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!841 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!842 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!843 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!844 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!845 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!846 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!847 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!848 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!849 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!850 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!851 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!884 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!885 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!886 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!887 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!894 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!895 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!896 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!898 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!899 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!900 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!901 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!902 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!903 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!904 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!905 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!906 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!907 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!908 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!909 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!910 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!911 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!912 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!913 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!914 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!915 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!916 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!917 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!918 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!919 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!920 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!921 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!922 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!923 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!924 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!925 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!926 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!927 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!928 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!929 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!930 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!931 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!932 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!933 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!934 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!935 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!936 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!937 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!938 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!939 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!940 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!941 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!942 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!943 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!944 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!945 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!946 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!947 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!948 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!949 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!950 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!951 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!952 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!953 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!954 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!955 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!956 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!957 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!958 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!959 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!960 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!961 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!962 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!963 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!964 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!965 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!966 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!967 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!968 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!969 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!970 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!971 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!972 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!973 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!974 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!975 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!976 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!977 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!978 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!979 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!980 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!981 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!982 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!983 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!984 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
