source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.field = type { i8*, i64 }
%struct.infomap = type { i8*, i8* }
%struct.line = type { %struct.linebuffer, i64, i64, %struct.field* }
%struct.linebuffer = type { i64, i64, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.outlist = type { i32, i64, %struct.outlist* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.seq = type { i64, i64, %struct.line** }
%struct.slotvec = type { i64, i8* }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [35 x i8] c"Usage: %s [OPTION]... FILE1 FILE2\0A\00", align 1

!26 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!27 = !{!28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38}
!28 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!29 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!30 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!31 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!32 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!33 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!34 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!35 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!36 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!37 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!38 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!39 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !40, line: 45, baseType: !6, size: 32, elements: !41)
!40 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!41 = !{!42, !43, !44, !45, !46, !47}
!42 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0, isUnsigned: true)
!43 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2, isUnsigned: true)
!44 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5, isUnsigned: true)
!45 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4, isUnsigned: true)
!46 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3, isUnsigned: true)
!47 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1, isUnsigned: true)
!48 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !50, file: !49, line: 186, baseType: !6, size: 32, elements: !63)
!49 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!50 = distinct !DISubprogram(name: "x2nrealloc", scope: !49, file: !49, line: 174, type: !51, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !58)
!51 = !DISubroutineType(types: !52)
!52 = !{!53, !53, !54, !55}
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !56, line: 46, baseType: !57)
!56 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!57 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!58 = !{!59, !60, !61, !62}
!59 = !DILocalVariable(name: "p", arg: 1, scope: !50, file: !49, line: 174, type: !53)
!60 = !DILocalVariable(name: "pn", arg: 2, scope: !50, file: !49, line: 174, type: !54)
!61 = !DILocalVariable(name: "s", arg: 3, scope: !50, file: !49, line: 174, type: !55)
!62 = !DILocalVariable(name: "n", scope: !50, file: !49, line: 176, type: !55)
!63 = !{!64}
!64 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!65 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !66, line: 46, baseType: !6, size: 32, elements: !67)
!66 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!67 = !{!68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79}
!68 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!69 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!70 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!71 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!72 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!73 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!74 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!75 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!76 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!77 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!78 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!79 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!80 = !{!81, !91, !148, !152, !156, !159, !162, !167, !174, !189, !194, !198, !85, !53, !202, !206, !210, !213, !217, !220, !221, !224, !227, !55, !230, !231, !87, !234, !239, !240, !244, !248, !258, !89, !122}
!81 = !DISubprogram(name: "dcgettext", scope: !82, file: !82, line: 51, type: !83, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!82 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!83 = !DISubroutineType(types: !84)
!84 = !{!85, !87, !87, !89}
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !86)
!89 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!90 = !{}
!91 = !DISubprogram(name: "fputs_unlocked", scope: !92, file: !92, line: 662, type: !93, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!92 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!93 = !DISubroutineType(types: !94)
!94 = !{!89, !87, !95}
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !97, line: 49, size: 1728, elements: !98)
!97 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!98 = !{!99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !114, !115, !116, !117, !121, !123, !125, !129, !132, !134, !137, !140, !141, !142, !143, !144}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !96, file: !97, line: 51, baseType: !89, size: 32)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !96, file: !97, line: 54, baseType: !85, size: 64, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !96, file: !97, line: 55, baseType: !85, size: 64, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !96, file: !97, line: 56, baseType: !85, size: 64, offset: 192)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !96, file: !97, line: 57, baseType: !85, size: 64, offset: 256)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !96, file: !97, line: 58, baseType: !85, size: 64, offset: 320)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !96, file: !97, line: 59, baseType: !85, size: 64, offset: 384)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !96, file: !97, line: 60, baseType: !85, size: 64, offset: 448)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !96, file: !97, line: 61, baseType: !85, size: 64, offset: 512)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !96, file: !97, line: 64, baseType: !85, size: 64, offset: 576)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !96, file: !97, line: 65, baseType: !85, size: 64, offset: 640)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !96, file: !97, line: 66, baseType: !85, size: 64, offset: 704)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !96, file: !97, line: 68, baseType: !112, size: 64, offset: 768)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !97, line: 36, flags: DIFlagFwdDecl)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !96, file: !97, line: 70, baseType: !95, size: 64, offset: 832)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !96, file: !97, line: 72, baseType: !89, size: 32, offset: 896)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !96, file: !97, line: 73, baseType: !89, size: 32, offset: 928)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !96, file: !97, line: 74, baseType: !118, size: 64, offset: 960)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !119, line: 152, baseType: !120)
!119 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!120 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !96, file: !97, line: 77, baseType: !122, size: 16, offset: 1024)
!122 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !96, file: !97, line: 78, baseType: !124, size: 8, offset: 1040)
!124 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !96, file: !97, line: 79, baseType: !126, size: 8, offset: 1048)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 8, elements: !127)
!127 = !{!128}
!128 = !DISubrange(count: 1)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !96, file: !97, line: 81, baseType: !130, size: 64, offset: 1088)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !97, line: 43, baseType: null)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !96, file: !97, line: 89, baseType: !133, size: 64, offset: 1152)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !119, line: 153, baseType: !120)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !96, file: !97, line: 91, baseType: !135, size: 64, offset: 1216)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !97, line: 37, flags: DIFlagFwdDecl)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !96, file: !97, line: 92, baseType: !138, size: 64, offset: 1280)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !97, line: 38, flags: DIFlagFwdDecl)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !96, file: !97, line: 93, baseType: !95, size: 64, offset: 1344)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !96, file: !97, line: 94, baseType: !53, size: 64, offset: 1408)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !96, file: !97, line: 95, baseType: !55, size: 64, offset: 1472)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !96, file: !97, line: 96, baseType: !89, size: 32, offset: 1536)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !96, file: !97, line: 98, baseType: !145, size: 160, offset: 1568)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 160, elements: !146)
!146 = !{!147}
!147 = !DISubrange(count: 20)
!148 = !DISubprogram(name: "set_program_name", scope: !149, file: !149, line: 37, type: !150, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!149 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!150 = !DISubroutineType(types: !151)
!151 = !{null, !87}
!152 = !DISubprogram(name: "setlocale", scope: !153, file: !153, line: 122, type: !154, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!153 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!154 = !DISubroutineType(types: !155)
!155 = !{!85, !89, !87}
!156 = !DISubprogram(name: "bindtextdomain", scope: !82, file: !82, line: 86, type: !157, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!157 = !DISubroutineType(types: !158)
!158 = !{!85, !87, !87}
!159 = !DISubprogram(name: "textdomain", scope: !82, file: !82, line: 82, type: !160, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!160 = !DISubroutineType(types: !161)
!161 = !{!85, !87}
!162 = !DISubprogram(name: "hard_locale", scope: !163, file: !163, line: 26, type: !164, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!163 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!164 = !DISubroutineType(types: !165)
!165 = !{!166, !89}
!166 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!167 = !DISubprogram(name: "atexit", scope: !168, file: !168, line: 595, type: !169, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!168 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!169 = !DISubroutineType(types: !170)
!170 = !{!89, !171}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{null}
!174 = !DISubprogram(name: "getopt_long", scope: !175, file: !175, line: 66, type: !176, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!175 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!176 = !DISubroutineType(types: !177)
!177 = !{!89, !89, !178, !87, !180, !187}
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !85)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !182)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !175, line: 50, size: 256, elements: !183)
!183 = !{!184, !185, !186, !188}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !182, file: !175, line: 52, baseType: !87, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !182, file: !175, line: 55, baseType: !89, size: 32, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !182, file: !175, line: 56, baseType: !187, size: 64, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !182, file: !175, line: 57, baseType: !89, size: 32, offset: 192)
!189 = !DISubprogram(name: "xstrtoul", scope: !18, file: !18, line: 44, type: !190, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!190 = !DISubroutineType(types: !191)
!191 = !{!17, !87, !192, !89, !193, !87}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!194 = !DISubprogram(name: "quote", scope: !195, file: !195, line: 44, type: !196, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!195 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!196 = !DISubroutineType(types: !197)
!197 = !{!87, !87}
!198 = !DISubprogram(name: "error", scope: !199, file: !199, line: 52, type: !200, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!199 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!200 = !DISubroutineType(types: !201)
!201 = !{null, !89, !89, !87, null}
!202 = !DISubprogram(name: "version_etc", scope: !203, file: !203, line: 69, type: !204, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!203 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!204 = !DISubroutineType(types: !205)
!205 = !{null, !95, !87, !87, !87, null}
!206 = !DISubprogram(name: "fopen_safer", scope: !207, file: !207, line: 23, type: !208, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!207 = !DIFile(filename: "./lib/stdio-safer.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!208 = !DISubroutineType(types: !209)
!209 = !{!95, !87, !87}
!210 = !DISubprogram(name: "quotearg_n_style_colon", scope: !26, file: !26, line: 397, type: !211, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!211 = !DISubroutineType(types: !212)
!212 = !{!85, !89, !25, !87}
!213 = !DISubprogram(name: "rpl_fclose", scope: !214, file: !214, line: 672, type: !215, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!214 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!215 = !DISubroutineType(types: !216)
!216 = !{!89, !95}
!217 = !DISubprogram(name: "free", scope: !168, file: !168, line: 565, type: !218, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!218 = !DISubroutineType(types: !219)
!219 = !{null, !53}
!220 = !DISubprogram(name: "xstrtoumax", scope: !18, file: !18, line: 48, type: !190, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!221 = !DISubprogram(name: "xmalloc", scope: !49, file: !49, line: 53, type: !222, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!222 = !DISubroutineType(types: !223)
!223 = !{!53, !57}
!224 = !DISubprogram(name: "quotearg_style", scope: !26, file: !26, line: 377, type: !225, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!225 = !DISubroutineType(types: !226)
!226 = !{!85, !25, !87}
!227 = !DISubprogram(name: "fadvise", scope: !40, file: !40, line: 72, type: !228, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!228 = !DISubroutineType(types: !229)
!229 = !{null, !95, !39}
!230 = !DISubprogram(name: "xalloc_die", scope: !49, file: !49, line: 51, type: !172, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !90)
!231 = !DISubprogram(name: "xrealloc", scope: !49, file: !49, line: 59, type: !232, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!232 = !DISubroutineType(types: !233)
!233 = !{!53, !53, !57}
!234 = !DISubprogram(name: "fwrite_unlocked", scope: !92, file: !92, line: 675, type: !235, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!235 = !DISubroutineType(types: !236)
!236 = !{!57, !237, !57, !57, !95}
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!239 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!240 = !DISubprogram(name: "memcasecmp", scope: !241, file: !241, line: 22, type: !242, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!241 = !DIFile(filename: "./lib/memcasecmp.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!242 = !DISubroutineType(types: !243)
!243 = !{!89, !237, !237, !57}
!244 = !DISubprogram(name: "xmemcoll", scope: !245, file: !245, line: 2, type: !246, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!245 = !DIFile(filename: "./lib/xmemcoll.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!246 = !DISubroutineType(types: !247)
!247 = !{!89, !85, !57, !85, !57}
!248 = !DISubprogram(name: "readlinebuffer_delim", scope: !249, file: !249, line: 41, type: !250, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!249 = !DIFile(filename: "./lib/linebuffer.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!250 = !DISubroutineType(types: !251)
!251 = !{!252, !252, !95, !86}
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "linebuffer", file: !249, line: 26, size: 192, elements: !254)
!254 = !{!255, !256, !257}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !253, file: !249, line: 28, baseType: !55, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !253, file: !249, line: 29, baseType: !55, size: 64, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !253, file: !249, line: 30, baseType: !85, size: 64, offset: 128)
!258 = !DISubprogram(name: "xcalloc", scope: !49, file: !49, line: 57, type: !259, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!259 = !DISubroutineType(types: !260)
!260 = !{!53, !57, !57}
!261 = !{!262, !0, !267, !269, !271, !273, !275, !278, !280, !282, !284, !286, !288, !303, !308, !310, !312, !320, !322, !324, !326, !328, !330, !332, !334}
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(name: "g_names", scope: !2, file: !3, line: 97, type: !264, isLocal: true, isDefinition: true)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 128, elements: !265)
!265 = !{!266}
!266 = !DISubrange(count: 2)
!267 = !DIGlobalVariableExpression(var: !268, expr: !DIExpression())
!268 = distinct !DIGlobalVariable(name: "print_unpairables_1", scope: !2, file: !3, line: 108, type: !166, isLocal: true, isDefinition: true)
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(name: "print_unpairables_2", scope: !2, file: !3, line: 108, type: !166, isLocal: true, isDefinition: true)
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(name: "print_pairables", scope: !2, file: !3, line: 111, type: !166, isLocal: true, isDefinition: true)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(name: "seen_unpairable", scope: !2, file: !3, line: 114, type: !166, isLocal: true, isDefinition: true)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(name: "issued_disorder_warning", scope: !2, file: !3, line: 117, type: !277, isLocal: true, isDefinition: true)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 16, elements: !265)
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(name: "empty_filler", scope: !2, file: !3, line: 120, type: !87, isLocal: true, isDefinition: true)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "autoformat", scope: !2, file: !3, line: 123, type: !166, isLocal: true, isDefinition: true)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "check_input_order", scope: !2, file: !3, line: 150, type: !12, isLocal: true, isDefinition: true)
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(name: "ignore_case", scope: !2, file: !3, line: 176, type: !166, isLocal: true, isDefinition: true)
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(name: "join_header_lines", scope: !2, file: !3, line: 180, type: !166, isLocal: true, isDefinition: true)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(name: "spareline", scope: !2, file: !3, line: 102, type: !290, isLocal: true, isDefinition: true)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 128, elements: !265)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "line", file: !3, line: 73, size: 384, elements: !293)
!293 = !{!294, !295, !296, !297}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !292, file: !3, line: 75, baseType: !253, size: 192)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "nfields", scope: !292, file: !3, line: 76, baseType: !55, size: 64, offset: 192)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "nfields_allocated", scope: !292, file: !3, line: 77, baseType: !55, size: 64, offset: 256)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !292, file: !3, line: 78, baseType: !298, size: 64, offset: 320)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "field", file: !3, line: 66, size: 128, elements: !300)
!300 = !{!301, !302}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "beg", scope: !299, file: !3, line: 68, baseType: !85, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !299, file: !3, line: 69, baseType: !55, size: 64, offset: 64)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 160, type: !305, isLocal: true, isDefinition: true)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 2048, elements: !306)
!306 = !{!307}
!307 = !DISubrange(count: 8)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(name: "join_field_1", scope: !2, file: !3, line: 130, type: !55, isLocal: true, isDefinition: true)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(name: "join_field_2", scope: !2, file: !3, line: 131, type: !55, isLocal: true, isDefinition: true)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(name: "outlist_end", scope: !2, file: !3, line: 137, type: !314, isLocal: true, isDefinition: true)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "outlist", file: !3, line: 53, size: 192, elements: !316)
!316 = !{!317, !318, !319}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !315, file: !3, line: 57, baseType: !89, size: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !315, file: !3, line: 60, baseType: !55, size: 64, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !315, file: !3, line: 62, baseType: !314, size: 64, offset: 128)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "outlist_head", scope: !2, file: !3, line: 134, type: !315, isLocal: true, isDefinition: true)
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(name: "tab", scope: !2, file: !3, line: 142, type: !89, isLocal: true, isDefinition: true)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(name: "eolchar", scope: !2, file: !3, line: 183, type: !86, isLocal: true, isDefinition: true)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "autocount_1", scope: !2, file: !3, line: 126, type: !55, isLocal: true, isDefinition: true)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "autocount_2", scope: !2, file: !3, line: 127, type: !55, isLocal: true, isDefinition: true)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(name: "uni_blank", scope: !2, file: !3, line: 173, type: !292, isLocal: true, isDefinition: true)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(name: "prevline", scope: !2, file: !3, line: 91, type: !290, isLocal: true, isDefinition: true)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "line_no", scope: !2, file: !3, line: 94, type: !336, isLocal: true, isDefinition: true)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !337, size: 128, elements: !265)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !338, line: 102, baseType: !339)
!338 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !119, line: 73, baseType: !57)
!340 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!341 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!342 = !DIGlobalVariableExpression(var: !268, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!343 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!344 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!345 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!346 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551606, DW_OP_mul, DW_OP_constu, 10, DW_OP_plus, DW_OP_stack_value))
!347 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "Version", scope: !350, file: !351, line: 2, type: !87, isDefinition: true)
!350 = distinct !DICompileUnit(language: DW_LANG_C99, file: !351, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !90, globals: !352, nameTableKind: None)
!351 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!352 = !{!348}
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(name: "file_name", scope: !355, file: !356, line: 46, type: !87, isLocal: true, isDefinition: true)
!355 = distinct !DICompileUnit(language: DW_LANG_C99, file: !356, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !90, retainedTypes: !357, globals: !395, nameTableKind: None)
!356 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!357 = !{!358, !81, !394, !198}
!358 = !DISubprogram(name: "close_stream", scope: !359, file: !359, line: 2, type: !360, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!359 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!360 = !DISubroutineType(types: !361)
!361 = !{!89, !362}
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !97, line: 49, size: 1728, elements: !364)
!364 = !{!365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !363, file: !97, line: 51, baseType: !89, size: 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !363, file: !97, line: 54, baseType: !85, size: 64, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !363, file: !97, line: 55, baseType: !85, size: 64, offset: 128)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !363, file: !97, line: 56, baseType: !85, size: 64, offset: 192)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !363, file: !97, line: 57, baseType: !85, size: 64, offset: 256)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !363, file: !97, line: 58, baseType: !85, size: 64, offset: 320)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !363, file: !97, line: 59, baseType: !85, size: 64, offset: 384)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !363, file: !97, line: 60, baseType: !85, size: 64, offset: 448)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !363, file: !97, line: 61, baseType: !85, size: 64, offset: 512)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !363, file: !97, line: 64, baseType: !85, size: 64, offset: 576)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !363, file: !97, line: 65, baseType: !85, size: 64, offset: 640)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !363, file: !97, line: 66, baseType: !85, size: 64, offset: 704)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !363, file: !97, line: 68, baseType: !112, size: 64, offset: 768)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !363, file: !97, line: 70, baseType: !362, size: 64, offset: 832)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !363, file: !97, line: 72, baseType: !89, size: 32, offset: 896)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !363, file: !97, line: 73, baseType: !89, size: 32, offset: 928)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !363, file: !97, line: 74, baseType: !118, size: 64, offset: 960)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !363, file: !97, line: 77, baseType: !122, size: 16, offset: 1024)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !363, file: !97, line: 78, baseType: !124, size: 8, offset: 1040)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !363, file: !97, line: 79, baseType: !126, size: 8, offset: 1048)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !363, file: !97, line: 81, baseType: !130, size: 64, offset: 1088)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !363, file: !97, line: 89, baseType: !133, size: 64, offset: 1152)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !363, file: !97, line: 91, baseType: !135, size: 64, offset: 1216)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !363, file: !97, line: 92, baseType: !138, size: 64, offset: 1280)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !363, file: !97, line: 93, baseType: !362, size: 64, offset: 1344)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !363, file: !97, line: 94, baseType: !53, size: 64, offset: 1408)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !363, file: !97, line: 95, baseType: !55, size: 64, offset: 1472)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !363, file: !97, line: 96, baseType: !89, size: 32, offset: 1536)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !363, file: !97, line: 98, baseType: !145, size: 160, offset: 1568)
!394 = !DISubprogram(name: "quotearg_colon", scope: !26, file: !26, line: 391, type: !160, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!395 = !{!353, !396}
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !355, file: !356, line: 56, type: !166, isLocal: true, isDefinition: true)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "exit_failure", scope: !400, file: !401, line: 24, type: !403, isDefinition: true)
!400 = distinct !DICompileUnit(language: DW_LANG_C99, file: !401, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !90, globals: !402, nameTableKind: None)
!401 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!402 = !{!398}
!403 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !89)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(name: "program_name", scope: !406, file: !407, line: 33, type: !87, isDefinition: true)
!406 = distinct !DICompileUnit(language: DW_LANG_C99, file: !407, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !90, retainedTypes: !408, globals: !444, nameTableKind: None)
!407 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!408 = !{!53, !409, !85}
!409 = !DISubprogram(name: "fputs", scope: !92, file: !92, line: 626, type: !410, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!410 = !DISubroutineType(types: !411)
!411 = !{!89, !87, !412}
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !97, line: 49, size: 1728, elements: !414)
!414 = !{!415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !413, file: !97, line: 51, baseType: !89, size: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !413, file: !97, line: 54, baseType: !85, size: 64, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !413, file: !97, line: 55, baseType: !85, size: 64, offset: 128)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !413, file: !97, line: 56, baseType: !85, size: 64, offset: 192)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !413, file: !97, line: 57, baseType: !85, size: 64, offset: 256)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !413, file: !97, line: 58, baseType: !85, size: 64, offset: 320)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !413, file: !97, line: 59, baseType: !85, size: 64, offset: 384)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !413, file: !97, line: 60, baseType: !85, size: 64, offset: 448)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !413, file: !97, line: 61, baseType: !85, size: 64, offset: 512)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !413, file: !97, line: 64, baseType: !85, size: 64, offset: 576)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !413, file: !97, line: 65, baseType: !85, size: 64, offset: 640)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !413, file: !97, line: 66, baseType: !85, size: 64, offset: 704)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !413, file: !97, line: 68, baseType: !112, size: 64, offset: 768)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !413, file: !97, line: 70, baseType: !412, size: 64, offset: 832)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !413, file: !97, line: 72, baseType: !89, size: 32, offset: 896)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !413, file: !97, line: 73, baseType: !89, size: 32, offset: 928)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !413, file: !97, line: 74, baseType: !118, size: 64, offset: 960)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !413, file: !97, line: 77, baseType: !122, size: 16, offset: 1024)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !413, file: !97, line: 78, baseType: !124, size: 8, offset: 1040)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !413, file: !97, line: 79, baseType: !126, size: 8, offset: 1048)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !413, file: !97, line: 81, baseType: !130, size: 64, offset: 1088)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !413, file: !97, line: 89, baseType: !133, size: 64, offset: 1152)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !413, file: !97, line: 91, baseType: !135, size: 64, offset: 1216)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !413, file: !97, line: 92, baseType: !138, size: 64, offset: 1280)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !413, file: !97, line: 93, baseType: !412, size: 64, offset: 1344)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !413, file: !97, line: 94, baseType: !53, size: 64, offset: 1408)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !413, file: !97, line: 95, baseType: !55, size: 64, offset: 1472)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !413, file: !97, line: 96, baseType: !89, size: 32, offset: 1536)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !413, file: !97, line: 98, baseType: !145, size: 160, offset: 1568)
!444 = !{!404}
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !447, file: !448, line: 85, type: !537, isDefinition: true)
!447 = distinct !DICompileUnit(language: DW_LANG_C99, file: !448, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !449, retainedTypes: !455, globals: !510, nameTableKind: None)
!448 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!449 = !{!25, !450, !65}
!450 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !26, line: 242, baseType: !6, size: 32, elements: !451)
!451 = !{!452, !453, !454}
!452 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!453 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!454 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!455 = !{!456, !459, !217, !472, !89, !122, !475, !55, !492, !496, !81, !502, !506, !85, !221, !230, !231}
!456 = !DISubprogram(name: "xmemdup", scope: !49, file: !49, line: 62, type: !457, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!457 = !DISubroutineType(types: !458)
!458 = !{!53, !237, !57}
!459 = !DISubprogram(name: "quotearg_alloc_mem", scope: !26, file: !26, line: 342, type: !460, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!460 = !DISubroutineType(types: !461)
!461 = !{!85, !87, !57, !193, !462}
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !464)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !448, line: 65, size: 448, elements: !465)
!465 = !{!466, !467, !468, !470, !471}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !464, file: !448, line: 68, baseType: !25, size: 32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !464, file: !448, line: 71, baseType: !89, size: 32, offset: 32)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !464, file: !448, line: 75, baseType: !469, size: 256, offset: 64)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !306)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !464, file: !448, line: 78, baseType: !87, size: 64, offset: 320)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !464, file: !448, line: 81, baseType: !87, size: 64, offset: 384)
!472 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !26, file: !26, line: 408, type: !473, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!473 = !DISubroutineType(types: !474)
!474 = !{!85, !89, !87, !87, !87, !57}
!475 = !DISubprogram(name: "rpl_mbrtowc", scope: !476, file: !476, line: 717, type: !477, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!476 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!477 = !DISubroutineType(types: !478)
!478 = !{!57, !187, !87, !57, !479}
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !481, line: 13, size: 64, elements: !482)
!481 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!482 = !{!483, !484}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !480, file: !481, line: 15, baseType: !89, size: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !480, file: !481, line: 20, baseType: !485, size: 32, offset: 32)
!485 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !480, file: !481, line: 16, size: 32, elements: !486)
!486 = !{!487, !488}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !485, file: !481, line: 18, baseType: !6, size: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !485, file: !481, line: 19, baseType: !489, size: 32)
!489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 32, elements: !490)
!490 = !{!491}
!491 = !DISubrange(count: 4)
!492 = !DISubprogram(name: "iswprint", scope: !493, file: !493, line: 120, type: !494, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!493 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!494 = !DISubroutineType(types: !495)
!495 = !{!89, !6}
!496 = !DISubprogram(name: "mbsinit", scope: !497, file: !497, line: 292, type: !498, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!497 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!498 = !DISubroutineType(types: !499)
!499 = !{!89, !500}
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !480)
!502 = !DISubprogram(name: "locale_charset", scope: !503, file: !503, line: 35, type: !504, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!503 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!504 = !DISubroutineType(types: !505)
!505 = !{!87}
!506 = !DISubprogram(name: "c_strcasecmp", scope: !507, file: !507, line: 42, type: !508, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!507 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!508 = !DISubroutineType(types: !509)
!509 = !{!89, !87, !87}
!510 = !{!445, !511, !517, !519, !521, !526, !533, !535}
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !447, file: !448, line: 101, type: !513, isDefinition: true)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !514, size: 320, elements: !515)
!514 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!515 = !{!516}
!516 = !DISubrange(count: 10)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !447, file: !448, line: 1052, type: !464, isDefinition: true)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !447, file: !448, line: 116, type: !464, isLocal: true, isDefinition: true)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(name: "slot0", scope: !447, file: !448, line: 842, type: !523, isLocal: true, isDefinition: true)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 2048, elements: !524)
!524 = !{!525}
!525 = !DISubrange(count: 256)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(name: "slotvec", scope: !447, file: !448, line: 845, type: !528, isLocal: true, isDefinition: true)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !448, line: 834, size: 128, elements: !530)
!530 = !{!531, !532}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !529, file: !448, line: 836, baseType: !55, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !529, file: !448, line: 837, baseType: !85, size: 64, offset: 64)
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(name: "nslots", scope: !447, file: !448, line: 843, type: !89, isLocal: true, isDefinition: true)
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(name: "slotvec0", scope: !447, file: !448, line: 844, type: !529, isLocal: true, isDefinition: true)
!537 = !DICompositeType(tag: DW_TAG_array_type, baseType: !538, size: 704, elements: !539)
!538 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !87)
!539 = !{!540}
!540 = !DISubrange(count: 11)
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !543, file: !544, line: 26, type: !546, isDefinition: true)
!543 = distinct !DICompileUnit(language: DW_LANG_C99, file: !544, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !90, globals: !545, nameTableKind: None)
!544 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!545 = !{!541}
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 376, elements: !547)
!547 = !{!548}
!548 = !DISubrange(count: 47)
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !551, file: !552, line: 507, type: !89, isLocal: true, isDefinition: true)
!551 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !552, file: !552, line: 488, type: !553, scopeLine: 489, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !555, retainedNodes: !566)
!552 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!553 = !DISubroutineType(types: !554)
!554 = !{!89, !89, !89}
!555 = distinct !DICompileUnit(language: DW_LANG_C99, file: !552, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !90, retainedTypes: !556, globals: !565, nameTableKind: None)
!556 = !{!557, !561}
!557 = !DISubprogram(name: "fcntl", scope: !558, file: !558, line: 176, type: !559, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!558 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
!559 = !DISubroutineType(types: !560)
!560 = !{!89, !89, !89, null}
!561 = !DISubprogram(name: "close", scope: !562, file: !562, line: 353, type: !563, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!562 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!563 = !DISubroutineType(types: !564)
!564 = !{!89, !89}
!565 = !{!549}
!566 = !{!567, !568, !569, !570, !573}
!567 = !DILocalVariable(name: "fd", arg: 1, scope: !551, file: !552, line: 488, type: !89)
!568 = !DILocalVariable(name: "target", arg: 2, scope: !551, file: !552, line: 488, type: !89)
!569 = !DILocalVariable(name: "result", scope: !551, file: !552, line: 490, type: !89)
!570 = !DILocalVariable(name: "flags", scope: !571, file: !552, line: 531, type: !89)
!571 = distinct !DILexicalBlock(scope: !572, file: !552, line: 530, column: 5)
!572 = distinct !DILexicalBlock(scope: !551, file: !552, line: 529, column: 7)
!573 = !DILocalVariable(name: "saved_errno", scope: !574, file: !552, line: 534, type: !89)
!574 = distinct !DILexicalBlock(scope: !575, file: !552, line: 533, column: 9)
!575 = distinct !DILexicalBlock(scope: !571, file: !552, line: 532, column: 11)
!576 = distinct !DICompileUnit(language: DW_LANG_C99, file: !577, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !578, retainedTypes: !579, nameTableKind: None)
!577 = !DIFile(filename: "lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!578 = !{!39}
!579 = !{!580, !583}
!580 = !DISubprogram(name: "posix_fadvise", scope: !558, file: !558, line: 288, type: !581, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!581 = !DISubroutineType(types: !582)
!582 = !{!89, !89, !120, !120, !89}
!583 = !DISubprogram(name: "fileno", scope: !92, file: !92, line: 786, type: !584, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!584 = !DISubroutineType(types: !585)
!585 = !{!89, !586}
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !97, line: 49, size: 1728, elements: !588)
!588 = !{!589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !587, file: !97, line: 51, baseType: !89, size: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !587, file: !97, line: 54, baseType: !85, size: 64, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !587, file: !97, line: 55, baseType: !85, size: 64, offset: 128)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !587, file: !97, line: 56, baseType: !85, size: 64, offset: 192)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !587, file: !97, line: 57, baseType: !85, size: 64, offset: 256)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !587, file: !97, line: 58, baseType: !85, size: 64, offset: 320)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !587, file: !97, line: 59, baseType: !85, size: 64, offset: 384)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !587, file: !97, line: 60, baseType: !85, size: 64, offset: 448)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !587, file: !97, line: 61, baseType: !85, size: 64, offset: 512)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !587, file: !97, line: 64, baseType: !85, size: 64, offset: 576)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !587, file: !97, line: 65, baseType: !85, size: 64, offset: 640)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !587, file: !97, line: 66, baseType: !85, size: 64, offset: 704)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !587, file: !97, line: 68, baseType: !112, size: 64, offset: 768)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !587, file: !97, line: 70, baseType: !586, size: 64, offset: 832)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !587, file: !97, line: 72, baseType: !89, size: 32, offset: 896)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !587, file: !97, line: 73, baseType: !89, size: 32, offset: 928)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !587, file: !97, line: 74, baseType: !118, size: 64, offset: 960)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !587, file: !97, line: 77, baseType: !122, size: 16, offset: 1024)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !587, file: !97, line: 78, baseType: !124, size: 8, offset: 1040)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !587, file: !97, line: 79, baseType: !126, size: 8, offset: 1048)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !587, file: !97, line: 81, baseType: !130, size: 64, offset: 1088)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !587, file: !97, line: 89, baseType: !133, size: 64, offset: 1152)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !587, file: !97, line: 91, baseType: !135, size: 64, offset: 1216)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !587, file: !97, line: 92, baseType: !138, size: 64, offset: 1280)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !587, file: !97, line: 93, baseType: !586, size: 64, offset: 1344)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !587, file: !97, line: 94, baseType: !53, size: 64, offset: 1408)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !587, file: !97, line: 95, baseType: !55, size: 64, offset: 1472)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !587, file: !97, line: 96, baseType: !89, size: 32, offset: 1536)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !587, file: !97, line: 98, baseType: !145, size: 160, offset: 1568)
!618 = distinct !DICompileUnit(language: DW_LANG_C99, file: !619, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !90, retainedTypes: !620, nameTableKind: None)
!619 = !DIFile(filename: "lib/fopen-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!620 = !{!621, !656, !658, !659, !561}
!621 = !DISubprogram(name: "fileno", scope: !92, file: !92, line: 786, type: !622, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!622 = !DISubroutineType(types: !623)
!623 = !{!89, !624}
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !97, line: 49, size: 1728, elements: !626)
!626 = !{!627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !625, file: !97, line: 51, baseType: !89, size: 32)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !625, file: !97, line: 54, baseType: !85, size: 64, offset: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !625, file: !97, line: 55, baseType: !85, size: 64, offset: 128)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !625, file: !97, line: 56, baseType: !85, size: 64, offset: 192)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !625, file: !97, line: 57, baseType: !85, size: 64, offset: 256)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !625, file: !97, line: 58, baseType: !85, size: 64, offset: 320)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !625, file: !97, line: 59, baseType: !85, size: 64, offset: 384)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !625, file: !97, line: 60, baseType: !85, size: 64, offset: 448)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !625, file: !97, line: 61, baseType: !85, size: 64, offset: 512)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !625, file: !97, line: 64, baseType: !85, size: 64, offset: 576)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !625, file: !97, line: 65, baseType: !85, size: 64, offset: 640)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !625, file: !97, line: 66, baseType: !85, size: 64, offset: 704)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !625, file: !97, line: 68, baseType: !112, size: 64, offset: 768)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !625, file: !97, line: 70, baseType: !624, size: 64, offset: 832)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !625, file: !97, line: 72, baseType: !89, size: 32, offset: 896)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !625, file: !97, line: 73, baseType: !89, size: 32, offset: 928)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !625, file: !97, line: 74, baseType: !118, size: 64, offset: 960)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !625, file: !97, line: 77, baseType: !122, size: 16, offset: 1024)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !625, file: !97, line: 78, baseType: !124, size: 8, offset: 1040)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !625, file: !97, line: 79, baseType: !126, size: 8, offset: 1048)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !625, file: !97, line: 81, baseType: !130, size: 64, offset: 1088)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !625, file: !97, line: 89, baseType: !133, size: 64, offset: 1152)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !625, file: !97, line: 91, baseType: !135, size: 64, offset: 1216)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !625, file: !97, line: 92, baseType: !138, size: 64, offset: 1280)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !625, file: !97, line: 93, baseType: !624, size: 64, offset: 1344)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !625, file: !97, line: 94, baseType: !53, size: 64, offset: 1408)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !625, file: !97, line: 95, baseType: !55, size: 64, offset: 1472)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !625, file: !97, line: 96, baseType: !89, size: 32, offset: 1536)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !625, file: !97, line: 98, baseType: !145, size: 160, offset: 1568)
!656 = !DISubprogram(name: "dup_safer", scope: !657, file: !657, line: 20, type: !563, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!657 = !DIFile(filename: "./lib/unistd-safer.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!658 = !DISubprogram(name: "rpl_fclose", scope: !214, file: !214, line: 672, type: !622, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!659 = !DISubprogram(name: "fdopen", scope: !92, file: !92, line: 279, type: !660, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!660 = !DISubroutineType(types: !661)
!661 = !{!624, !89, !87}
!662 = distinct !DICompileUnit(language: DW_LANG_C99, file: !663, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !90, retainedTypes: !664, nameTableKind: None)
!663 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!664 = !{!665}
!665 = !DISubprogram(name: "setlocale_null_r", scope: !666, file: !666, line: 64, type: !667, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!666 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!667 = !DISubroutineType(types: !668)
!668 = !{!89, !89, !85, !57}
!669 = distinct !DICompileUnit(language: DW_LANG_C99, file: !670, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !90, retainedTypes: !671, nameTableKind: None)
!670 = !DIFile(filename: "lib/linebuffer.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!671 = !{!672, !713, !217, !716}
!672 = !DISubprogram(name: "readlinebuffer_delim", scope: !249, file: !249, line: 41, type: !673, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!673 = !DISubroutineType(types: !674)
!674 = !{!675, !675, !681, !86}
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "linebuffer", file: !249, line: 26, size: 192, elements: !677)
!677 = !{!678, !679, !680}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !676, file: !249, line: 28, baseType: !55, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !676, file: !249, line: 29, baseType: !55, size: 64, offset: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !676, file: !249, line: 30, baseType: !85, size: 64, offset: 128)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !97, line: 49, size: 1728, elements: !683)
!683 = !{!684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !682, file: !97, line: 51, baseType: !89, size: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !682, file: !97, line: 54, baseType: !85, size: 64, offset: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !682, file: !97, line: 55, baseType: !85, size: 64, offset: 128)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !682, file: !97, line: 56, baseType: !85, size: 64, offset: 192)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !682, file: !97, line: 57, baseType: !85, size: 64, offset: 256)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !682, file: !97, line: 58, baseType: !85, size: 64, offset: 320)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !682, file: !97, line: 59, baseType: !85, size: 64, offset: 384)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !682, file: !97, line: 60, baseType: !85, size: 64, offset: 448)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !682, file: !97, line: 61, baseType: !85, size: 64, offset: 512)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !682, file: !97, line: 64, baseType: !85, size: 64, offset: 576)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !682, file: !97, line: 65, baseType: !85, size: 64, offset: 640)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !682, file: !97, line: 66, baseType: !85, size: 64, offset: 704)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !682, file: !97, line: 68, baseType: !112, size: 64, offset: 768)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !682, file: !97, line: 70, baseType: !681, size: 64, offset: 832)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !682, file: !97, line: 72, baseType: !89, size: 32, offset: 896)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !682, file: !97, line: 73, baseType: !89, size: 32, offset: 928)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !682, file: !97, line: 74, baseType: !118, size: 64, offset: 960)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !682, file: !97, line: 77, baseType: !122, size: 16, offset: 1024)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !682, file: !97, line: 78, baseType: !124, size: 8, offset: 1040)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !682, file: !97, line: 79, baseType: !126, size: 8, offset: 1048)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !682, file: !97, line: 81, baseType: !130, size: 64, offset: 1088)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !682, file: !97, line: 89, baseType: !133, size: 64, offset: 1152)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !682, file: !97, line: 91, baseType: !135, size: 64, offset: 1216)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !682, file: !97, line: 92, baseType: !138, size: 64, offset: 1280)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !682, file: !97, line: 93, baseType: !681, size: 64, offset: 1344)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !682, file: !97, line: 94, baseType: !53, size: 64, offset: 1408)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !682, file: !97, line: 95, baseType: !55, size: 64, offset: 1472)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !682, file: !97, line: 96, baseType: !89, size: 32, offset: 1536)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !682, file: !97, line: 98, baseType: !145, size: 160, offset: 1568)
!713 = !DISubprogram(name: "x2realloc", scope: !49, file: !49, line: 61, type: !714, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!714 = !DISubroutineType(types: !715)
!715 = !{!53, !53, !193}
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!717 = distinct !DICompileUnit(language: DW_LANG_C99, file: !718, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !90, retainedTypes: !719, nameTableKind: None)
!718 = !DIFile(filename: "lib/memcasecmp.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!719 = !{!89}
!720 = distinct !DICompileUnit(language: DW_LANG_C99, file: !721, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !90, retainedTypes: !722, nameTableKind: None)
!721 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!722 = !{!53, !152}
!723 = distinct !DICompileUnit(language: DW_LANG_C99, file: !724, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !90, retainedTypes: !725, nameTableKind: None)
!724 = !DIFile(filename: "lib/dup-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!725 = !{!726}
!726 = !DISubprogram(name: "rpl_fcntl", scope: !727, file: !727, line: 588, type: !559, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!727 = !DIFile(filename: "./lib/fcntl.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!728 = distinct !DICompileUnit(language: DW_LANG_C99, file: !729, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !730, retainedTypes: !734, nameTableKind: None)
!729 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!730 = !{!731}
!731 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !729, line: 40, baseType: !6, size: 32, elements: !732)
!732 = !{!733}
!733 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!734 = !{!81, !735, !53}
!735 = !DISubprogram(name: "fputs_unlocked", scope: !92, file: !92, line: 662, type: !736, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!736 = !DISubroutineType(types: !737)
!737 = !{!89, !87, !738}
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !97, line: 49, size: 1728, elements: !740)
!740 = !{!741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !739, file: !97, line: 51, baseType: !89, size: 32)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !739, file: !97, line: 54, baseType: !85, size: 64, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !739, file: !97, line: 55, baseType: !85, size: 64, offset: 128)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !739, file: !97, line: 56, baseType: !85, size: 64, offset: 192)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !739, file: !97, line: 57, baseType: !85, size: 64, offset: 256)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !739, file: !97, line: 58, baseType: !85, size: 64, offset: 320)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !739, file: !97, line: 59, baseType: !85, size: 64, offset: 384)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !739, file: !97, line: 60, baseType: !85, size: 64, offset: 448)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !739, file: !97, line: 61, baseType: !85, size: 64, offset: 512)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !739, file: !97, line: 64, baseType: !85, size: 64, offset: 576)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !739, file: !97, line: 65, baseType: !85, size: 64, offset: 640)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !739, file: !97, line: 66, baseType: !85, size: 64, offset: 704)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !739, file: !97, line: 68, baseType: !112, size: 64, offset: 768)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !739, file: !97, line: 70, baseType: !738, size: 64, offset: 832)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !739, file: !97, line: 72, baseType: !89, size: 32, offset: 896)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !739, file: !97, line: 73, baseType: !89, size: 32, offset: 928)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !739, file: !97, line: 74, baseType: !118, size: 64, offset: 960)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !739, file: !97, line: 77, baseType: !122, size: 16, offset: 1024)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !739, file: !97, line: 78, baseType: !124, size: 8, offset: 1040)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !739, file: !97, line: 79, baseType: !126, size: 8, offset: 1048)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !739, file: !97, line: 81, baseType: !130, size: 64, offset: 1088)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !739, file: !97, line: 89, baseType: !133, size: 64, offset: 1152)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !739, file: !97, line: 91, baseType: !135, size: 64, offset: 1216)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !739, file: !97, line: 92, baseType: !138, size: 64, offset: 1280)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !739, file: !97, line: 93, baseType: !738, size: 64, offset: 1344)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !739, file: !97, line: 94, baseType: !53, size: 64, offset: 1408)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !739, file: !97, line: 95, baseType: !55, size: 64, offset: 1472)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !739, file: !97, line: 96, baseType: !89, size: 32, offset: 1536)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !739, file: !97, line: 98, baseType: !145, size: 160, offset: 1568)
!770 = distinct !DICompileUnit(language: DW_LANG_C99, file: !771, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !772, retainedTypes: !780, nameTableKind: None)
!771 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!772 = !{!773}
!773 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !774, file: !49, line: 186, baseType: !6, size: 32, elements: !63)
!774 = distinct !DISubprogram(name: "x2nrealloc", scope: !49, file: !49, line: 174, type: !51, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !770, retainedNodes: !775)
!775 = !{!776, !777, !778, !779}
!776 = !DILocalVariable(name: "p", arg: 1, scope: !774, file: !49, line: 174, type: !53)
!777 = !DILocalVariable(name: "pn", arg: 2, scope: !774, file: !49, line: 174, type: !54)
!778 = !DILocalVariable(name: "s", arg: 3, scope: !774, file: !49, line: 174, type: !55)
!779 = !DILocalVariable(name: "n", scope: !774, file: !49, line: 176, type: !55)
!780 = !{!55, !230, !221, !231, !85, !217, !53, !258, !781}
!781 = !DISubprogram(name: "rpl_calloc", scope: !782, file: !782, line: 688, type: !259, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!782 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!783 = distinct !DICompileUnit(language: DW_LANG_C99, file: !784, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !90, retainedTypes: !785, nameTableKind: None)
!784 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!785 = !{!81, !198}
!786 = distinct !DICompileUnit(language: DW_LANG_C99, file: !787, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !788, retainedTypes: !789, nameTableKind: None)
!787 = !DIFile(filename: "lib/xmemcoll.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!788 = !{!25}
!789 = !{!790, !792, !81, !198, !795}
!790 = !DISubprogram(name: "memcoll", scope: !791, file: !791, line: 25, type: !246, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!791 = !DIFile(filename: "./lib/memcoll.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!792 = !DISubprogram(name: "memcoll0", scope: !791, file: !791, line: 26, type: !793, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!793 = !DISubroutineType(types: !794)
!794 = !{!89, !87, !57, !87, !57}
!795 = !DISubprogram(name: "quotearg_n_style_mem", scope: !26, file: !26, line: 373, type: !796, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!796 = !DISubroutineType(types: !797)
!797 = !{!85, !89, !25, !87, !57}
!798 = distinct !DICompileUnit(language: DW_LANG_C99, file: !799, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !800, retainedTypes: !801, nameTableKind: None)
!799 = !DIFile(filename: "lib/xstrtoul.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!800 = !{!17, !65}
!801 = !{!89, !122}
!802 = distinct !DICompileUnit(language: DW_LANG_C99, file: !803, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !800, retainedTypes: !801, nameTableKind: None)
!803 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!804 = distinct !DICompileUnit(language: DW_LANG_C99, file: !805, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !90, retainedTypes: !806, nameTableKind: None)
!805 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!806 = !{!53}
!807 = distinct !DICompileUnit(language: DW_LANG_C99, file: !808, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !90, retainedTypes: !809, nameTableKind: None)
!808 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!809 = !{!810, !845, !846, !849}
!810 = !DISubprogram(name: "fileno", scope: !92, file: !92, line: 786, type: !811, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!811 = !DISubroutineType(types: !812)
!812 = !{!89, !813}
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !97, line: 49, size: 1728, elements: !815)
!815 = !{!816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !814, file: !97, line: 51, baseType: !89, size: 32)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !814, file: !97, line: 54, baseType: !85, size: 64, offset: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !814, file: !97, line: 55, baseType: !85, size: 64, offset: 128)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !814, file: !97, line: 56, baseType: !85, size: 64, offset: 192)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !814, file: !97, line: 57, baseType: !85, size: 64, offset: 256)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !814, file: !97, line: 58, baseType: !85, size: 64, offset: 320)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !814, file: !97, line: 59, baseType: !85, size: 64, offset: 384)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !814, file: !97, line: 60, baseType: !85, size: 64, offset: 448)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !814, file: !97, line: 61, baseType: !85, size: 64, offset: 512)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !814, file: !97, line: 64, baseType: !85, size: 64, offset: 576)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !814, file: !97, line: 65, baseType: !85, size: 64, offset: 640)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !814, file: !97, line: 66, baseType: !85, size: 64, offset: 704)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !814, file: !97, line: 68, baseType: !112, size: 64, offset: 768)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !814, file: !97, line: 70, baseType: !813, size: 64, offset: 832)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !814, file: !97, line: 72, baseType: !89, size: 32, offset: 896)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !814, file: !97, line: 73, baseType: !89, size: 32, offset: 928)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !814, file: !97, line: 74, baseType: !118, size: 64, offset: 960)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !814, file: !97, line: 77, baseType: !122, size: 16, offset: 1024)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !814, file: !97, line: 78, baseType: !124, size: 8, offset: 1040)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !814, file: !97, line: 79, baseType: !126, size: 8, offset: 1048)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !814, file: !97, line: 81, baseType: !130, size: 64, offset: 1088)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !814, file: !97, line: 89, baseType: !133, size: 64, offset: 1152)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !814, file: !97, line: 91, baseType: !135, size: 64, offset: 1216)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !814, file: !97, line: 92, baseType: !138, size: 64, offset: 1280)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !814, file: !97, line: 93, baseType: !813, size: 64, offset: 1344)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !814, file: !97, line: 94, baseType: !53, size: 64, offset: 1408)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !814, file: !97, line: 95, baseType: !55, size: 64, offset: 1472)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !814, file: !97, line: 96, baseType: !89, size: 32, offset: 1536)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !814, file: !97, line: 98, baseType: !145, size: 160, offset: 1568)
!845 = !DISubprogram(name: "fclose", scope: !92, file: !92, line: 213, type: !811, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!846 = !DISubprogram(name: "lseek", scope: !562, file: !562, line: 334, type: !847, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!847 = !DISubroutineType(types: !848)
!848 = !{!120, !89, !120, !89}
!849 = !DISubprogram(name: "rpl_fflush", scope: !214, file: !214, line: 718, type: !811, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!850 = distinct !DICompileUnit(language: DW_LANG_C99, file: !851, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !90, retainedTypes: !852, nameTableKind: None)
!851 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!852 = !{!53, !853, !888}
!853 = !DISubprogram(name: "fflush", scope: !92, file: !92, line: 218, type: !854, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!854 = !DISubroutineType(types: !855)
!855 = !{!89, !856}
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !97, line: 49, size: 1728, elements: !858)
!858 = !{!859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !857, file: !97, line: 51, baseType: !89, size: 32)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !857, file: !97, line: 54, baseType: !85, size: 64, offset: 64)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !857, file: !97, line: 55, baseType: !85, size: 64, offset: 128)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !857, file: !97, line: 56, baseType: !85, size: 64, offset: 192)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !857, file: !97, line: 57, baseType: !85, size: 64, offset: 256)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !857, file: !97, line: 58, baseType: !85, size: 64, offset: 320)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !857, file: !97, line: 59, baseType: !85, size: 64, offset: 384)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !857, file: !97, line: 60, baseType: !85, size: 64, offset: 448)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !857, file: !97, line: 61, baseType: !85, size: 64, offset: 512)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !857, file: !97, line: 64, baseType: !85, size: 64, offset: 576)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !857, file: !97, line: 65, baseType: !85, size: 64, offset: 640)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !857, file: !97, line: 66, baseType: !85, size: 64, offset: 704)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !857, file: !97, line: 68, baseType: !112, size: 64, offset: 768)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !857, file: !97, line: 70, baseType: !856, size: 64, offset: 832)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !857, file: !97, line: 72, baseType: !89, size: 32, offset: 896)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !857, file: !97, line: 73, baseType: !89, size: 32, offset: 928)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !857, file: !97, line: 74, baseType: !118, size: 64, offset: 960)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !857, file: !97, line: 77, baseType: !122, size: 16, offset: 1024)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !857, file: !97, line: 78, baseType: !124, size: 8, offset: 1040)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !857, file: !97, line: 79, baseType: !126, size: 8, offset: 1048)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !857, file: !97, line: 81, baseType: !130, size: 64, offset: 1088)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !857, file: !97, line: 89, baseType: !133, size: 64, offset: 1152)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !857, file: !97, line: 91, baseType: !135, size: 64, offset: 1216)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !857, file: !97, line: 92, baseType: !138, size: 64, offset: 1280)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !857, file: !97, line: 93, baseType: !856, size: 64, offset: 1344)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !857, file: !97, line: 94, baseType: !53, size: 64, offset: 1408)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !857, file: !97, line: 95, baseType: !55, size: 64, offset: 1472)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !857, file: !97, line: 96, baseType: !89, size: 32, offset: 1536)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !857, file: !97, line: 98, baseType: !145, size: 160, offset: 1568)
!888 = !DISubprogram(name: "rpl_fseeko", scope: !214, file: !214, line: 1034, type: !889, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!889 = !DISubroutineType(types: !890)
!890 = !{!89, !856, !120, !89}
!891 = distinct !DICompileUnit(language: DW_LANG_C99, file: !892, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !90, retainedTypes: !893, nameTableKind: None)
!892 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!893 = !{!53, !894, !846, !929}
!894 = !DISubprogram(name: "fileno", scope: !92, file: !92, line: 786, type: !895, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!895 = !DISubroutineType(types: !896)
!896 = !{!89, !897}
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !97, line: 49, size: 1728, elements: !899)
!899 = !{!900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !898, file: !97, line: 51, baseType: !89, size: 32)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !898, file: !97, line: 54, baseType: !85, size: 64, offset: 64)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !898, file: !97, line: 55, baseType: !85, size: 64, offset: 128)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !898, file: !97, line: 56, baseType: !85, size: 64, offset: 192)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !898, file: !97, line: 57, baseType: !85, size: 64, offset: 256)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !898, file: !97, line: 58, baseType: !85, size: 64, offset: 320)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !898, file: !97, line: 59, baseType: !85, size: 64, offset: 384)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !898, file: !97, line: 60, baseType: !85, size: 64, offset: 448)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !898, file: !97, line: 61, baseType: !85, size: 64, offset: 512)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !898, file: !97, line: 64, baseType: !85, size: 64, offset: 576)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !898, file: !97, line: 65, baseType: !85, size: 64, offset: 640)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !898, file: !97, line: 66, baseType: !85, size: 64, offset: 704)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !898, file: !97, line: 68, baseType: !112, size: 64, offset: 768)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !898, file: !97, line: 70, baseType: !897, size: 64, offset: 832)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !898, file: !97, line: 72, baseType: !89, size: 32, offset: 896)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !898, file: !97, line: 73, baseType: !89, size: 32, offset: 928)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !898, file: !97, line: 74, baseType: !118, size: 64, offset: 960)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !898, file: !97, line: 77, baseType: !122, size: 16, offset: 1024)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !898, file: !97, line: 78, baseType: !124, size: 8, offset: 1040)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !898, file: !97, line: 79, baseType: !126, size: 8, offset: 1048)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !898, file: !97, line: 81, baseType: !130, size: 64, offset: 1088)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !898, file: !97, line: 89, baseType: !133, size: 64, offset: 1152)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !898, file: !97, line: 91, baseType: !135, size: 64, offset: 1216)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !898, file: !97, line: 92, baseType: !138, size: 64, offset: 1280)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !898, file: !97, line: 93, baseType: !897, size: 64, offset: 1344)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !898, file: !97, line: 94, baseType: !53, size: 64, offset: 1408)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !898, file: !97, line: 95, baseType: !55, size: 64, offset: 1472)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !898, file: !97, line: 96, baseType: !89, size: 32, offset: 1536)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !898, file: !97, line: 98, baseType: !145, size: 160, offset: 1568)
!929 = !DISubprogram(name: "fseeko", scope: !92, file: !92, line: 707, type: !930, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!930 = !DISubroutineType(types: !931)
!931 = !{!89, !897, !120, !89}
!932 = distinct !DICompileUnit(language: DW_LANG_C99, file: !933, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !90, retainedTypes: !934, nameTableKind: None)
!933 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!934 = !{!935, !55, !162}
!935 = !DISubprogram(name: "mbrtowc", scope: !497, file: !497, line: 296, type: !936, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !90)
!936 = !DISubroutineType(types: !937)
!937 = !{!57, !187, !87, !57, !938}
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !481, line: 13, size: 64, elements: !940)
!940 = !{!941, !942}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !939, file: !481, line: 15, baseType: !89, size: 32)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !939, file: !481, line: 20, baseType: !943, size: 32, offset: 32)
!943 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !939, file: !481, line: 16, size: 32, elements: !944)
!944 = !{!945, !946}
