source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.infomap = type { i8*, i8* }
%struct.numname = type { i32, [8 x i8] }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [90 x i8] c"Usage: %s [-s SIGNAL | -SIGNAL] PID...\0A  or:  %s -l [SIGNAL]...\0A  or:  %s -t [SIGNAL]...\0A\00", align 1
@.str.2 = private unnamed_addr constant [45 x i8] c"Send signals to processes, or list signals.\0A\00", align 1
@stdout = external local_unnamed_addr global %struct._IO_FILE*, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "short_options", scope: !2, file: !3, line: 54, type: !150, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !144, nameTableKind: None)
!3 = !DIFile(filename: "src/kill.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{}
!5 = !{!6, !15, !76, !80, !84, !87, !90, !97, !112, !116, !120, !10, !66, !124, !128, !132, !133, !136, !140}
!6 = !DISubprogram(name: "dcgettext", scope: !7, file: !7, line: 51, type: !8, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!7 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!8 = !DISubroutineType(types: !9)
!9 = !{!10, !12, !12, !14}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!14 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!15 = !DISubprogram(name: "fputs_unlocked", scope: !16, file: !16, line: 662, type: !17, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!16 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!17 = !DISubroutineType(types: !18)
!18 = !{!14, !12, !19}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !22)
!21 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!22 = !{!23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !38, !39, !40, !41, !45, !47, !49, !53, !56, !58, !61, !64, !65, !67, !71, !72}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !20, file: !21, line: 51, baseType: !14, size: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !20, file: !21, line: 54, baseType: !10, size: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !20, file: !21, line: 55, baseType: !10, size: 64, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !20, file: !21, line: 56, baseType: !10, size: 64, offset: 192)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !20, file: !21, line: 57, baseType: !10, size: 64, offset: 256)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !20, file: !21, line: 58, baseType: !10, size: 64, offset: 320)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !20, file: !21, line: 59, baseType: !10, size: 64, offset: 384)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !20, file: !21, line: 60, baseType: !10, size: 64, offset: 448)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !20, file: !21, line: 61, baseType: !10, size: 64, offset: 512)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !20, file: !21, line: 64, baseType: !10, size: 64, offset: 576)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !20, file: !21, line: 65, baseType: !10, size: 64, offset: 640)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !20, file: !21, line: 66, baseType: !10, size: 64, offset: 704)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !20, file: !21, line: 68, baseType: !36, size: 64, offset: 768)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !21, line: 36, flags: DIFlagFwdDecl)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !20, file: !21, line: 70, baseType: !19, size: 64, offset: 832)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !20, file: !21, line: 72, baseType: !14, size: 32, offset: 896)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !20, file: !21, line: 73, baseType: !14, size: 32, offset: 928)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !20, file: !21, line: 74, baseType: !42, size: 64, offset: 960)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !43, line: 152, baseType: !44)
!43 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!44 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !20, file: !21, line: 77, baseType: !46, size: 16, offset: 1024)
!46 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !20, file: !21, line: 78, baseType: !48, size: 8, offset: 1040)
!48 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !20, file: !21, line: 79, baseType: !50, size: 8, offset: 1048)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 8, elements: !51)
!51 = !{!52}
!52 = !DISubrange(count: 1)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !20, file: !21, line: 81, baseType: !54, size: 64, offset: 1088)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !21, line: 43, baseType: null)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !20, file: !21, line: 89, baseType: !57, size: 64, offset: 1152)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !43, line: 153, baseType: !44)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !20, file: !21, line: 91, baseType: !59, size: 64, offset: 1216)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !21, line: 37, flags: DIFlagFwdDecl)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !20, file: !21, line: 92, baseType: !62, size: 64, offset: 1280)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !21, line: 38, flags: DIFlagFwdDecl)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !20, file: !21, line: 93, baseType: !19, size: 64, offset: 1344)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !20, file: !21, line: 94, baseType: !66, size: 64, offset: 1408)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !20, file: !21, line: 95, baseType: !68, size: 64, offset: 1472)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !69, line: 46, baseType: !70)
!69 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!70 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !20, file: !21, line: 96, baseType: !14, size: 32, offset: 1536)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !20, file: !21, line: 98, baseType: !73, size: 160, offset: 1568)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 160, elements: !74)
!74 = !{!75}
!75 = !DISubrange(count: 20)
!76 = !DISubprogram(name: "set_program_name", scope: !77, file: !77, line: 37, type: !78, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!77 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!78 = !DISubroutineType(types: !79)
!79 = !{null, !12}
!80 = !DISubprogram(name: "setlocale", scope: !81, file: !81, line: 122, type: !82, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!81 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!82 = !DISubroutineType(types: !83)
!83 = !{!10, !14, !12}
!84 = !DISubprogram(name: "bindtextdomain", scope: !7, file: !7, line: 86, type: !85, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!85 = !DISubroutineType(types: !86)
!86 = !{!10, !12, !12}
!87 = !DISubprogram(name: "textdomain", scope: !7, file: !7, line: 82, type: !88, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!88 = !DISubroutineType(types: !89)
!89 = !{!10, !12}
!90 = !DISubprogram(name: "atexit", scope: !91, file: !91, line: 595, type: !92, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!91 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!92 = !DISubroutineType(types: !93)
!93 = !{!14, !94}
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DISubroutineType(types: !96)
!96 = !{null}
!97 = !DISubprogram(name: "getopt_long", scope: !98, file: !98, line: 66, type: !99, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!98 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!99 = !DISubroutineType(types: !100)
!100 = !{!14, !14, !101, !12, !103, !110}
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !105)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !98, line: 50, size: 256, elements: !106)
!106 = !{!107, !108, !109, !111}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !105, file: !98, line: 52, baseType: !12, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !105, file: !98, line: 55, baseType: !14, size: 32, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !105, file: !98, line: 56, baseType: !110, size: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !105, file: !98, line: 57, baseType: !14, size: 32, offset: 192)
!112 = !DISubprogram(name: "error", scope: !113, file: !113, line: 52, type: !114, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!113 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!114 = !DISubroutineType(types: !115)
!115 = !{null, !14, !14, !12, null}
!116 = !DISubprogram(name: "quote", scope: !117, file: !117, line: 44, type: !118, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!117 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!118 = !DISubroutineType(types: !119)
!119 = !{!12, !12}
!120 = !DISubprogram(name: "operand2sig", scope: !121, file: !121, line: 18, type: !122, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!121 = !DIFile(filename: "src/operand2sig.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!122 = !DISubroutineType(types: !123)
!123 = !{!14, !12, !10}
!124 = !DISubprogram(name: "version_etc", scope: !125, file: !125, line: 69, type: !126, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!125 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!126 = !DISubroutineType(types: !127)
!127 = !{null, !19, !12, !12, !12, null}
!128 = !DISubprogram(name: "sig2str", scope: !129, file: !129, line: 34, type: !130, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!129 = !DIFile(filename: "./lib/sig2str.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!130 = !DISubroutineType(types: !131)
!131 = !{!14, !14, !10}
!132 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!133 = !DISubprogram(name: "puts", scope: !16, file: !16, line: 632, type: !134, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!134 = !DISubroutineType(types: !135)
!135 = !{!14, !12}
!136 = !DISubprogram(name: "strsignal", scope: !137, file: !137, line: 447, type: !138, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!137 = !DIFile(filename: "/usr/include/string.h", directory: "")
!138 = !DISubroutineType(types: !139)
!139 = !{!10, !14}
!140 = !DISubprogram(name: "kill", scope: !141, file: !141, line: 112, type: !142, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!141 = !DIFile(filename: "/usr/include/signal.h", directory: "")
!142 = !DISubroutineType(types: !143)
!143 = !{!14, !14, !14}
!144 = !{!0, !145}
!145 = !DIGlobalVariableExpression(var: !146, expr: !DIExpression())
!146 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 60, type: !147, isLocal: true, isDefinition: true)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 1536, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 6)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 904, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 113)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "Version", scope: !155, file: !156, line: 2, type: !12, isDefinition: true)
!155 = distinct !DICompileUnit(language: DW_LANG_C99, file: !156, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, globals: !157, nameTableKind: None)
!156 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!157 = !{!153}
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "file_name", scope: !160, file: !161, line: 46, type: !12, isLocal: true, isDefinition: true)
!160 = distinct !DICompileUnit(language: DW_LANG_C99, file: !161, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !162, globals: !201, nameTableKind: None)
!161 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!162 = !{!163, !6, !199, !112}
!163 = !DISubprogram(name: "close_stream", scope: !164, file: !164, line: 2, type: !165, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!164 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!165 = !DISubroutineType(types: !166)
!166 = !{!14, !167}
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !169)
!169 = !{!170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !168, file: !21, line: 51, baseType: !14, size: 32)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !168, file: !21, line: 54, baseType: !10, size: 64, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !168, file: !21, line: 55, baseType: !10, size: 64, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !168, file: !21, line: 56, baseType: !10, size: 64, offset: 192)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !168, file: !21, line: 57, baseType: !10, size: 64, offset: 256)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !168, file: !21, line: 58, baseType: !10, size: 64, offset: 320)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !168, file: !21, line: 59, baseType: !10, size: 64, offset: 384)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !168, file: !21, line: 60, baseType: !10, size: 64, offset: 448)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !168, file: !21, line: 61, baseType: !10, size: 64, offset: 512)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !168, file: !21, line: 64, baseType: !10, size: 64, offset: 576)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !168, file: !21, line: 65, baseType: !10, size: 64, offset: 640)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !168, file: !21, line: 66, baseType: !10, size: 64, offset: 704)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !168, file: !21, line: 68, baseType: !36, size: 64, offset: 768)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !168, file: !21, line: 70, baseType: !167, size: 64, offset: 832)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !168, file: !21, line: 72, baseType: !14, size: 32, offset: 896)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !168, file: !21, line: 73, baseType: !14, size: 32, offset: 928)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !168, file: !21, line: 74, baseType: !42, size: 64, offset: 960)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !168, file: !21, line: 77, baseType: !46, size: 16, offset: 1024)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !168, file: !21, line: 78, baseType: !48, size: 8, offset: 1040)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !168, file: !21, line: 79, baseType: !50, size: 8, offset: 1048)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !168, file: !21, line: 81, baseType: !54, size: 64, offset: 1088)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !168, file: !21, line: 89, baseType: !57, size: 64, offset: 1152)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !168, file: !21, line: 91, baseType: !59, size: 64, offset: 1216)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !168, file: !21, line: 92, baseType: !62, size: 64, offset: 1280)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !168, file: !21, line: 93, baseType: !167, size: 64, offset: 1344)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !168, file: !21, line: 94, baseType: !66, size: 64, offset: 1408)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !168, file: !21, line: 95, baseType: !68, size: 64, offset: 1472)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !168, file: !21, line: 96, baseType: !14, size: 32, offset: 1536)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !168, file: !21, line: 98, baseType: !73, size: 160, offset: 1568)
!199 = !DISubprogram(name: "quotearg_colon", scope: !200, file: !200, line: 391, type: !88, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!200 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!201 = !{!158, !202}
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !160, file: !161, line: 56, type: !204, isLocal: true, isDefinition: true)
!204 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(name: "exit_failure", scope: !207, file: !208, line: 24, type: !210, isDefinition: true)
!207 = distinct !DICompileUnit(language: DW_LANG_C99, file: !208, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, globals: !209, nameTableKind: None)
!208 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!209 = !{!205}
!210 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !14)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "program_name", scope: !213, file: !214, line: 33, type: !12, isDefinition: true)
!213 = distinct !DICompileUnit(language: DW_LANG_C99, file: !214, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !215, globals: !251, nameTableKind: None)
!214 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!215 = !{!66, !216, !10}
!216 = !DISubprogram(name: "fputs", scope: !16, file: !16, line: 626, type: !217, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!217 = !DISubroutineType(types: !218)
!218 = !{!14, !12, !219}
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !221)
!221 = !{!222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !220, file: !21, line: 51, baseType: !14, size: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !220, file: !21, line: 54, baseType: !10, size: 64, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !220, file: !21, line: 55, baseType: !10, size: 64, offset: 128)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !220, file: !21, line: 56, baseType: !10, size: 64, offset: 192)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !220, file: !21, line: 57, baseType: !10, size: 64, offset: 256)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !220, file: !21, line: 58, baseType: !10, size: 64, offset: 320)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !220, file: !21, line: 59, baseType: !10, size: 64, offset: 384)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !220, file: !21, line: 60, baseType: !10, size: 64, offset: 448)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !220, file: !21, line: 61, baseType: !10, size: 64, offset: 512)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !220, file: !21, line: 64, baseType: !10, size: 64, offset: 576)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !220, file: !21, line: 65, baseType: !10, size: 64, offset: 640)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !220, file: !21, line: 66, baseType: !10, size: 64, offset: 704)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !220, file: !21, line: 68, baseType: !36, size: 64, offset: 768)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !220, file: !21, line: 70, baseType: !219, size: 64, offset: 832)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !220, file: !21, line: 72, baseType: !14, size: 32, offset: 896)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !220, file: !21, line: 73, baseType: !14, size: 32, offset: 928)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !220, file: !21, line: 74, baseType: !42, size: 64, offset: 960)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !220, file: !21, line: 77, baseType: !46, size: 16, offset: 1024)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !220, file: !21, line: 78, baseType: !48, size: 8, offset: 1040)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !220, file: !21, line: 79, baseType: !50, size: 8, offset: 1048)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !220, file: !21, line: 81, baseType: !54, size: 64, offset: 1088)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !220, file: !21, line: 89, baseType: !57, size: 64, offset: 1152)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !220, file: !21, line: 91, baseType: !59, size: 64, offset: 1216)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !220, file: !21, line: 92, baseType: !62, size: 64, offset: 1280)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !220, file: !21, line: 93, baseType: !219, size: 64, offset: 1344)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !220, file: !21, line: 94, baseType: !66, size: 64, offset: 1408)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !220, file: !21, line: 95, baseType: !68, size: 64, offset: 1472)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !220, file: !21, line: 96, baseType: !14, size: 32, offset: 1536)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !220, file: !21, line: 98, baseType: !73, size: 160, offset: 1568)
!251 = !{!211}
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !254, file: !255, line: 85, type: !388, isDefinition: true)
!254 = distinct !DICompileUnit(language: DW_LANG_C99, file: !255, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !256, retainedTypes: !290, globals: !361, nameTableKind: None)
!255 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!256 = !{!257, !270, !275}
!257 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !200, line: 32, baseType: !132, size: 32, elements: !258)
!258 = !{!259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269}
!259 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!260 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!261 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!262 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!263 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!264 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!265 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!266 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!267 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!268 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!269 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!270 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !200, line: 242, baseType: !132, size: 32, elements: !271)
!271 = !{!272, !273, !274}
!272 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!273 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!274 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!275 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !276, line: 46, baseType: !132, size: 32, elements: !277)
!276 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!277 = !{!278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289}
!278 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!279 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!280 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!281 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!282 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!283 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!284 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!285 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!286 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!287 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!288 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!289 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!290 = !{!291, !297, !313, !316, !14, !46, !319, !68, !336, !340, !6, !346, !350, !10, !354, !357, !358}
!291 = !DISubprogram(name: "xmemdup", scope: !292, file: !292, line: 62, type: !293, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!292 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!293 = !DISubroutineType(types: !294)
!294 = !{!66, !295, !70}
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!297 = !DISubprogram(name: "quotearg_alloc_mem", scope: !200, file: !200, line: 342, type: !298, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!298 = !DISubroutineType(types: !299)
!299 = !{!10, !12, !70, !300, !301}
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !303)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !255, line: 65, size: 448, elements: !304)
!304 = !{!305, !306, !307, !311, !312}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !303, file: !255, line: 68, baseType: !257, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !303, file: !255, line: 71, baseType: !14, size: 32, offset: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !303, file: !255, line: 75, baseType: !308, size: 256, offset: 64)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 256, elements: !309)
!309 = !{!310}
!310 = !DISubrange(count: 8)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !303, file: !255, line: 78, baseType: !12, size: 64, offset: 320)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !303, file: !255, line: 81, baseType: !12, size: 64, offset: 384)
!313 = !DISubprogram(name: "free", scope: !91, file: !91, line: 565, type: !314, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!314 = !DISubroutineType(types: !315)
!315 = !{null, !66}
!316 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !200, file: !200, line: 408, type: !317, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!317 = !DISubroutineType(types: !318)
!318 = !{!10, !14, !12, !12, !12, !70}
!319 = !DISubprogram(name: "rpl_mbrtowc", scope: !320, file: !320, line: 717, type: !321, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!320 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!321 = !DISubroutineType(types: !322)
!322 = !{!70, !110, !12, !70, !323}
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !325, line: 13, size: 64, elements: !326)
!325 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!326 = !{!327, !328}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !324, file: !325, line: 15, baseType: !14, size: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !324, file: !325, line: 20, baseType: !329, size: 32, offset: 32)
!329 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !324, file: !325, line: 16, size: 32, elements: !330)
!330 = !{!331, !332}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !329, file: !325, line: 18, baseType: !132, size: 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !329, file: !325, line: 19, baseType: !333, size: 32)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 32, elements: !334)
!334 = !{!335}
!335 = !DISubrange(count: 4)
!336 = !DISubprogram(name: "iswprint", scope: !337, file: !337, line: 120, type: !338, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!337 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!338 = !DISubroutineType(types: !339)
!339 = !{!14, !132}
!340 = !DISubprogram(name: "mbsinit", scope: !341, file: !341, line: 292, type: !342, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!341 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!342 = !DISubroutineType(types: !343)
!343 = !{!14, !344}
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !324)
!346 = !DISubprogram(name: "locale_charset", scope: !347, file: !347, line: 35, type: !348, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!347 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!348 = !DISubroutineType(types: !349)
!349 = !{!12}
!350 = !DISubprogram(name: "c_strcasecmp", scope: !351, file: !351, line: 42, type: !352, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!351 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!352 = !DISubroutineType(types: !353)
!353 = !{!14, !12, !12}
!354 = !DISubprogram(name: "xmalloc", scope: !292, file: !292, line: 53, type: !355, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!355 = !DISubroutineType(types: !356)
!356 = !{!66, !70}
!357 = !DISubprogram(name: "xalloc_die", scope: !292, file: !292, line: 51, type: !95, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !4)
!358 = !DISubprogram(name: "xrealloc", scope: !292, file: !292, line: 59, type: !359, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!359 = !DISubroutineType(types: !360)
!360 = !{!66, !66, !70}
!361 = !{!252, !362, !368, !370, !372, !377, !384, !386}
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !254, file: !255, line: 101, type: !364, isDefinition: true)
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !365, size: 320, elements: !366)
!365 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !257)
!366 = !{!367}
!367 = !DISubrange(count: 10)
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !254, file: !255, line: 1052, type: !303, isDefinition: true)
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !254, file: !255, line: 116, type: !303, isLocal: true, isDefinition: true)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "slot0", scope: !254, file: !255, line: 842, type: !374, isLocal: true, isDefinition: true)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 2048, elements: !375)
!375 = !{!376}
!376 = !DISubrange(count: 256)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "slotvec", scope: !254, file: !255, line: 845, type: !379, isLocal: true, isDefinition: true)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !255, line: 834, size: 128, elements: !381)
!381 = !{!382, !383}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !380, file: !255, line: 836, baseType: !68, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !380, file: !255, line: 837, baseType: !10, size: 64, offset: 64)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(name: "nslots", scope: !254, file: !255, line: 843, type: !14, isLocal: true, isDefinition: true)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "slotvec0", scope: !254, file: !255, line: 844, type: !380, isLocal: true, isDefinition: true)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !389, size: 704, elements: !390)
!389 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!390 = !{!391}
!391 = !DISubrange(count: 11)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !394, file: !395, line: 26, type: !397, isDefinition: true)
!394 = distinct !DICompileUnit(language: DW_LANG_C99, file: !395, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, globals: !396, nameTableKind: None)
!395 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!396 = !{!392}
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 376, elements: !398)
!398 = !{!399}
!399 = !DISubrange(count: 47)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(name: "numname_table", scope: !402, file: !403, line: 41, type: !406, isLocal: true, isDefinition: true)
!402 = distinct !DICompileUnit(language: DW_LANG_C99, file: !403, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !404, globals: !405, nameTableKind: None)
!403 = !DIFile(filename: "lib/sig2str.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!404 = !{!132}
!405 = !{!400}
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !407, size: 3360, elements: !412)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "numname", file: !403, line: 41, size: 96, elements: !408)
!408 = !{!409, !410}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !407, file: !403, line: 41, baseType: !14, size: 32)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !407, file: !403, line: 41, baseType: !411, size: 64, offset: 32)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 64, elements: !309)
!412 = !{!413}
!413 = !DISubrange(count: 35)
!414 = distinct !DICompileUnit(language: DW_LANG_C99, file: !415, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !416, nameTableKind: None)
!415 = !DIFile(filename: "src/operand2sig.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!416 = !{!132, !417, !418, !313, !128, !6, !116, !112}
!417 = !DISubprogram(name: "xstrdup", scope: !292, file: !292, line: 64, type: !88, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!418 = !DISubprogram(name: "str2sig", scope: !129, file: !129, line: 35, type: !419, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!419 = !DISubroutineType(types: !420)
!420 = !{!14, !12, !110}
!421 = distinct !DICompileUnit(language: DW_LANG_C99, file: !422, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !423, retainedTypes: !427, nameTableKind: None)
!422 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!423 = !{!424}
!424 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !422, line: 40, baseType: !132, size: 32, elements: !425)
!425 = !{!426}
!426 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!427 = !{!6, !428, !66}
!428 = !DISubprogram(name: "fputs_unlocked", scope: !16, file: !16, line: 662, type: !429, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!429 = !DISubroutineType(types: !430)
!430 = !{!14, !12, !431}
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !433)
!433 = !{!434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !432, file: !21, line: 51, baseType: !14, size: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !432, file: !21, line: 54, baseType: !10, size: 64, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !432, file: !21, line: 55, baseType: !10, size: 64, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !432, file: !21, line: 56, baseType: !10, size: 64, offset: 192)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !432, file: !21, line: 57, baseType: !10, size: 64, offset: 256)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !432, file: !21, line: 58, baseType: !10, size: 64, offset: 320)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !432, file: !21, line: 59, baseType: !10, size: 64, offset: 384)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !432, file: !21, line: 60, baseType: !10, size: 64, offset: 448)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !432, file: !21, line: 61, baseType: !10, size: 64, offset: 512)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !432, file: !21, line: 64, baseType: !10, size: 64, offset: 576)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !432, file: !21, line: 65, baseType: !10, size: 64, offset: 640)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !432, file: !21, line: 66, baseType: !10, size: 64, offset: 704)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !432, file: !21, line: 68, baseType: !36, size: 64, offset: 768)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !432, file: !21, line: 70, baseType: !431, size: 64, offset: 832)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !432, file: !21, line: 72, baseType: !14, size: 32, offset: 896)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !432, file: !21, line: 73, baseType: !14, size: 32, offset: 928)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !432, file: !21, line: 74, baseType: !42, size: 64, offset: 960)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !432, file: !21, line: 77, baseType: !46, size: 16, offset: 1024)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !432, file: !21, line: 78, baseType: !48, size: 8, offset: 1040)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !432, file: !21, line: 79, baseType: !50, size: 8, offset: 1048)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !432, file: !21, line: 81, baseType: !54, size: 64, offset: 1088)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !432, file: !21, line: 89, baseType: !57, size: 64, offset: 1152)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !432, file: !21, line: 91, baseType: !59, size: 64, offset: 1216)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !432, file: !21, line: 92, baseType: !62, size: 64, offset: 1280)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !432, file: !21, line: 93, baseType: !431, size: 64, offset: 1344)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !432, file: !21, line: 94, baseType: !66, size: 64, offset: 1408)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !432, file: !21, line: 95, baseType: !68, size: 64, offset: 1472)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !432, file: !21, line: 96, baseType: !14, size: 32, offset: 1536)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !432, file: !21, line: 98, baseType: !73, size: 160, offset: 1568)
!463 = distinct !DICompileUnit(language: DW_LANG_C99, file: !464, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !465, retainedTypes: !478, nameTableKind: None)
!464 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!465 = !{!466}
!466 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !467, file: !292, line: 186, baseType: !132, size: 32, elements: !476)
!467 = distinct !DISubprogram(name: "x2nrealloc", scope: !292, file: !292, line: 174, type: !468, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !463, retainedNodes: !471)
!468 = !DISubroutineType(types: !469)
!469 = !{!66, !66, !470, !68}
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!471 = !{!472, !473, !474, !475}
!472 = !DILocalVariable(name: "p", arg: 1, scope: !467, file: !292, line: 174, type: !66)
!473 = !DILocalVariable(name: "pn", arg: 2, scope: !467, file: !292, line: 174, type: !470)
!474 = !DILocalVariable(name: "s", arg: 3, scope: !467, file: !292, line: 174, type: !68)
!475 = !DILocalVariable(name: "n", scope: !467, file: !292, line: 176, type: !68)
!476 = !{!477}
!477 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!478 = !{!68, !357, !354, !358, !10, !313, !66, !479, !482}
!479 = !DISubprogram(name: "xcalloc", scope: !292, file: !292, line: 57, type: !480, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!480 = !DISubroutineType(types: !481)
!481 = !{!66, !70, !70}
!482 = !DISubprogram(name: "rpl_calloc", scope: !483, file: !483, line: 688, type: !480, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!483 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!484 = distinct !DICompileUnit(language: DW_LANG_C99, file: !485, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !486, nameTableKind: None)
!485 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!486 = !{!6, !112}
!487 = distinct !DICompileUnit(language: DW_LANG_C99, file: !488, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !489, nameTableKind: None)
!488 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!489 = !{!66}
!490 = distinct !DICompileUnit(language: DW_LANG_C99, file: !491, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !492, nameTableKind: None)
!491 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!492 = !{!493, !68, !505}
!493 = !DISubprogram(name: "mbrtowc", scope: !341, file: !341, line: 296, type: !494, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!494 = !DISubroutineType(types: !495)
!495 = !{!70, !110, !12, !70, !496}
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !325, line: 13, size: 64, elements: !498)
!498 = !{!499, !500}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !497, file: !325, line: 15, baseType: !14, size: 32)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !497, file: !325, line: 20, baseType: !501, size: 32, offset: 32)
!501 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !497, file: !325, line: 16, size: 32, elements: !502)
!502 = !{!503, !504}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !501, file: !325, line: 18, baseType: !132, size: 32)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !501, file: !325, line: 19, baseType: !333, size: 32)
!505 = !DISubprogram(name: "hard_locale", scope: !506, file: !506, line: 26, type: !507, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!506 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!507 = !DISubroutineType(types: !508)
!508 = !{!204, !14}
!509 = distinct !DICompileUnit(language: DW_LANG_C99, file: !510, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !511, nameTableKind: None)
!510 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!511 = !{!512}
!512 = !DISubprogram(name: "rpl_fclose", scope: !513, file: !513, line: 672, type: !514, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!513 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!514 = !DISubroutineType(types: !515)
!515 = !{!14, !516}
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !518)
!518 = !{!519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !517, file: !21, line: 51, baseType: !14, size: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !517, file: !21, line: 54, baseType: !10, size: 64, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !517, file: !21, line: 55, baseType: !10, size: 64, offset: 128)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !517, file: !21, line: 56, baseType: !10, size: 64, offset: 192)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !517, file: !21, line: 57, baseType: !10, size: 64, offset: 256)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !517, file: !21, line: 58, baseType: !10, size: 64, offset: 320)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !517, file: !21, line: 59, baseType: !10, size: 64, offset: 384)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !517, file: !21, line: 60, baseType: !10, size: 64, offset: 448)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !517, file: !21, line: 61, baseType: !10, size: 64, offset: 512)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !517, file: !21, line: 64, baseType: !10, size: 64, offset: 576)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !517, file: !21, line: 65, baseType: !10, size: 64, offset: 640)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !517, file: !21, line: 66, baseType: !10, size: 64, offset: 704)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !517, file: !21, line: 68, baseType: !36, size: 64, offset: 768)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !517, file: !21, line: 70, baseType: !516, size: 64, offset: 832)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !517, file: !21, line: 72, baseType: !14, size: 32, offset: 896)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !517, file: !21, line: 73, baseType: !14, size: 32, offset: 928)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !517, file: !21, line: 74, baseType: !42, size: 64, offset: 960)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !517, file: !21, line: 77, baseType: !46, size: 16, offset: 1024)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !517, file: !21, line: 78, baseType: !48, size: 8, offset: 1040)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !517, file: !21, line: 79, baseType: !50, size: 8, offset: 1048)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !517, file: !21, line: 81, baseType: !54, size: 64, offset: 1088)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !517, file: !21, line: 89, baseType: !57, size: 64, offset: 1152)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !517, file: !21, line: 91, baseType: !59, size: 64, offset: 1216)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !517, file: !21, line: 92, baseType: !62, size: 64, offset: 1280)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !517, file: !21, line: 93, baseType: !516, size: 64, offset: 1344)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !517, file: !21, line: 94, baseType: !66, size: 64, offset: 1408)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !517, file: !21, line: 95, baseType: !68, size: 64, offset: 1472)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !517, file: !21, line: 96, baseType: !14, size: 32, offset: 1536)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !517, file: !21, line: 98, baseType: !73, size: 160, offset: 1568)
!548 = distinct !DICompileUnit(language: DW_LANG_C99, file: !549, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !550, nameTableKind: None)
!549 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!550 = !{!551}
!551 = !DISubprogram(name: "setlocale_null_r", scope: !552, file: !552, line: 64, type: !553, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!552 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!553 = !DISubroutineType(types: !554)
!554 = !{!14, !14, !10, !70}
!555 = distinct !DICompileUnit(language: DW_LANG_C99, file: !556, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !557, retainedTypes: !944, nameTableKind: None)
!556 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!557 = !{!558}
!558 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !559, line: 41, baseType: !132, size: 32, elements: !560)
!559 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!560 = !{!561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943}
!561 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!562 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!563 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!564 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!565 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!566 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!567 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!568 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!569 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!570 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!571 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!572 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!573 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!574 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!575 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!576 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!577 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!578 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!579 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!580 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!581 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!582 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!583 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!584 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!585 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!586 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!587 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!588 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!589 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!590 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!591 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!592 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!593 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!594 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!595 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!596 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!597 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!598 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!599 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!600 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!601 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!602 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!603 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!604 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!605 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!606 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!607 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!608 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!609 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!610 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!611 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!612 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!613 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!614 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!615 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!616 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!617 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!618 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!619 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!620 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!621 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!622 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!623 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!624 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!625 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!626 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!627 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!628 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!629 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!630 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!631 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!632 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!633 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!634 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!635 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!636 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!637 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!661 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!662 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!663 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!664 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!665 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!666 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!667 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!668 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!669 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!670 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!671 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!672 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!673 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!674 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!675 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!676 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!677 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!678 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!679 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!680 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!681 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!682 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!683 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!684 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!685 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!686 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!687 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!688 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!689 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!690 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!691 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!692 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!693 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!694 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!695 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!696 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!697 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!698 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!699 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!700 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!701 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!702 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!703 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!704 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!705 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!706 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!707 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!708 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!709 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!710 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!711 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!712 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!713 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!714 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!715 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!716 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!717 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!719 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!720 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!721 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!722 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!723 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!724 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!725 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!726 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!727 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!728 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!729 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!730 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!731 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!732 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!733 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!734 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!735 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!736 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!737 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!738 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!739 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!740 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!741 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!742 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!743 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!744 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!745 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!746 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!747 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!748 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!749 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!750 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!751 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!752 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!753 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!754 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!755 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!756 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!757 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!758 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!759 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!760 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!761 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!762 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!763 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!764 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!765 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!766 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!767 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!768 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!769 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!770 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!771 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!772 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!773 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!774 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!779 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!780 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!781 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!782 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!783 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!784 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!785 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!786 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!787 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!788 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!789 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!790 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!791 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!793 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!794 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!795 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!796 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!797 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!798 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!799 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!800 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!801 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!802 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!803 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!804 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!805 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!806 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!807 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!808 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!809 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!810 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!812 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!813 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!814 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!815 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!816 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!817 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!818 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!819 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!820 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!821 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!822 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!823 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!824 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!825 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!826 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!827 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!828 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!829 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!830 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!831 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!832 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!833 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!834 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!835 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!836 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!837 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!838 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!839 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!840 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!841 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!842 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!843 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!844 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!845 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!846 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!847 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!848 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!849 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!850 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!876 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!877 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!878 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!879 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!880 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!884 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!885 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!886 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!887 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!888 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!894 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!895 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!896 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!898 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!899 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!900 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!901 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!902 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!903 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!904 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!905 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!906 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!907 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!908 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!909 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!910 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!911 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!912 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!913 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!914 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!915 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!916 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!917 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!918 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!919 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!920 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!921 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!922 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!923 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!924 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!925 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!926 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!927 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!928 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!929 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!930 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!931 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!932 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!933 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!934 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!935 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!936 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!937 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!938 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!939 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!940 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!941 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!942 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!943 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!944 = !{!945, !66}
!945 = !DISubprogram(name: "nl_langinfo", scope: !559, file: !559, line: 661, type: !138, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!946 = distinct !DICompileUnit(language: DW_LANG_C99, file: !947, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !948, nameTableKind: None)
!947 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!948 = !{!66, !80}
!949 = distinct !DICompileUnit(language: DW_LANG_C99, file: !950, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !951, nameTableKind: None)
!950 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!951 = !{!952, !987, !988, !992}
!952 = !DISubprogram(name: "fileno", scope: !16, file: !16, line: 786, type: !953, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!953 = !DISubroutineType(types: !954)
!954 = !{!14, !955}
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !957)
!957 = !{!958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !956, file: !21, line: 51, baseType: !14, size: 32)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !956, file: !21, line: 54, baseType: !10, size: 64, offset: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !956, file: !21, line: 55, baseType: !10, size: 64, offset: 128)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !956, file: !21, line: 56, baseType: !10, size: 64, offset: 192)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !956, file: !21, line: 57, baseType: !10, size: 64, offset: 256)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !956, file: !21, line: 58, baseType: !10, size: 64, offset: 320)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !956, file: !21, line: 59, baseType: !10, size: 64, offset: 384)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !956, file: !21, line: 60, baseType: !10, size: 64, offset: 448)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !956, file: !21, line: 61, baseType: !10, size: 64, offset: 512)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !956, file: !21, line: 64, baseType: !10, size: 64, offset: 576)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !956, file: !21, line: 65, baseType: !10, size: 64, offset: 640)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !956, file: !21, line: 66, baseType: !10, size: 64, offset: 704)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !956, file: !21, line: 68, baseType: !36, size: 64, offset: 768)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !956, file: !21, line: 70, baseType: !955, size: 64, offset: 832)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !956, file: !21, line: 72, baseType: !14, size: 32, offset: 896)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !956, file: !21, line: 73, baseType: !14, size: 32, offset: 928)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !956, file: !21, line: 74, baseType: !42, size: 64, offset: 960)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !956, file: !21, line: 77, baseType: !46, size: 16, offset: 1024)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !956, file: !21, line: 78, baseType: !48, size: 8, offset: 1040)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !956, file: !21, line: 79, baseType: !50, size: 8, offset: 1048)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !956, file: !21, line: 81, baseType: !54, size: 64, offset: 1088)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !956, file: !21, line: 89, baseType: !57, size: 64, offset: 1152)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !956, file: !21, line: 91, baseType: !59, size: 64, offset: 1216)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !956, file: !21, line: 92, baseType: !62, size: 64, offset: 1280)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !956, file: !21, line: 93, baseType: !955, size: 64, offset: 1344)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !956, file: !21, line: 94, baseType: !66, size: 64, offset: 1408)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !956, file: !21, line: 95, baseType: !68, size: 64, offset: 1472)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !956, file: !21, line: 96, baseType: !14, size: 32, offset: 1536)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !956, file: !21, line: 98, baseType: !73, size: 160, offset: 1568)
!987 = !DISubprogram(name: "fclose", scope: !16, file: !16, line: 213, type: !953, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!988 = !DISubprogram(name: "lseek", scope: !989, file: !989, line: 334, type: !990, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!989 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!990 = !DISubroutineType(types: !991)
!991 = !{!44, !14, !44, !14}
!992 = !DISubprogram(name: "rpl_fflush", scope: !513, file: !513, line: 718, type: !953, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!993 = distinct !DICompileUnit(language: DW_LANG_C99, file: !994, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !995, nameTableKind: None)
!994 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!995 = !{!66, !996, !1031}
!996 = !DISubprogram(name: "fflush", scope: !16, file: !16, line: 218, type: !997, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!997 = !DISubroutineType(types: !998)
!998 = !{!14, !999}
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !1001)
!1001 = !{!1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1000, file: !21, line: 51, baseType: !14, size: 32)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1000, file: !21, line: 54, baseType: !10, size: 64, offset: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1000, file: !21, line: 55, baseType: !10, size: 64, offset: 128)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1000, file: !21, line: 56, baseType: !10, size: 64, offset: 192)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1000, file: !21, line: 57, baseType: !10, size: 64, offset: 256)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1000, file: !21, line: 58, baseType: !10, size: 64, offset: 320)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1000, file: !21, line: 59, baseType: !10, size: 64, offset: 384)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1000, file: !21, line: 60, baseType: !10, size: 64, offset: 448)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1000, file: !21, line: 61, baseType: !10, size: 64, offset: 512)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1000, file: !21, line: 64, baseType: !10, size: 64, offset: 576)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1000, file: !21, line: 65, baseType: !10, size: 64, offset: 640)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1000, file: !21, line: 66, baseType: !10, size: 64, offset: 704)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1000, file: !21, line: 68, baseType: !36, size: 64, offset: 768)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1000, file: !21, line: 70, baseType: !999, size: 64, offset: 832)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1000, file: !21, line: 72, baseType: !14, size: 32, offset: 896)
