; ModuleID = 'coreutils-8.32/src/link.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [40 x i8] c"Usage: %s FILE1 FILE2\0A  or:  %s OPTION\0A\00", align 1
@.str.2 = private unnamed_addr constant [76 x i8] c"Call the link function to create a link named FILE2 to an existing FILE1.\0A\0A\00", align 1
@stdout = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str.3 = private unnamed_addr constant [45 x i8] c"      --help     display this help and exit\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "Version", scope: !2, file: !3, line: 2, type: !6, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !5, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{}
!5 = !{!0}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "file_name", scope: !11, file: !12, line: 46, type: !6, isLocal: true, isDefinition: true)
!11 = distinct !DICompileUnit(language: DW_LANG_C99, file: !12, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !13, globals: !89, splitDebugInlining: false, nameTableKind: None)
!12 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!13 = !{!14, !77, !81, !85}
!14 = !DISubprogram(name: "close_stream", scope: !15, file: !15, line: 2, type: !16, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!15 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!16 = !DISubroutineType(types: !17)
!17 = !{!18, !19}
!18 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !22)
!21 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!22 = !{!23, !24, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !39, !40, !41, !42, !46, !48, !50, !54, !57, !59, !62, !65, !66, !68, !72, !73}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !20, file: !21, line: 51, baseType: !18, size: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !20, file: !21, line: 54, baseType: !25, size: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !20, file: !21, line: 55, baseType: !25, size: 64, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !20, file: !21, line: 56, baseType: !25, size: 64, offset: 192)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !20, file: !21, line: 57, baseType: !25, size: 64, offset: 256)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !20, file: !21, line: 58, baseType: !25, size: 64, offset: 320)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !20, file: !21, line: 59, baseType: !25, size: 64, offset: 384)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !20, file: !21, line: 60, baseType: !25, size: 64, offset: 448)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !20, file: !21, line: 61, baseType: !25, size: 64, offset: 512)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !20, file: !21, line: 64, baseType: !25, size: 64, offset: 576)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !20, file: !21, line: 65, baseType: !25, size: 64, offset: 640)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !20, file: !21, line: 66, baseType: !25, size: 64, offset: 704)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !20, file: !21, line: 68, baseType: !37, size: 64, offset: 768)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !21, line: 36, flags: DIFlagFwdDecl)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !20, file: !21, line: 70, baseType: !19, size: 64, offset: 832)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !20, file: !21, line: 72, baseType: !18, size: 32, offset: 896)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !20, file: !21, line: 73, baseType: !18, size: 32, offset: 928)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !20, file: !21, line: 74, baseType: !43, size: 64, offset: 960)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !44, line: 152, baseType: !45)
!44 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!45 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !20, file: !21, line: 77, baseType: !47, size: 16, offset: 1024)
!47 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !20, file: !21, line: 78, baseType: !49, size: 8, offset: 1040)
!49 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !20, file: !21, line: 79, baseType: !51, size: 8, offset: 1048)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 8, elements: !52)
!52 = !{!53}
!53 = !DISubrange(count: 1)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !20, file: !21, line: 81, baseType: !55, size: 64, offset: 1088)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !21, line: 43, baseType: null)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !20, file: !21, line: 89, baseType: !58, size: 64, offset: 1152)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !44, line: 153, baseType: !45)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !20, file: !21, line: 91, baseType: !60, size: 64, offset: 1216)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !21, line: 37, flags: DIFlagFwdDecl)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !20, file: !21, line: 92, baseType: !63, size: 64, offset: 1280)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !21, line: 38, flags: DIFlagFwdDecl)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !20, file: !21, line: 93, baseType: !19, size: 64, offset: 1344)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !20, file: !21, line: 94, baseType: !67, size: 64, offset: 1408)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !20, file: !21, line: 95, baseType: !69, size: 64, offset: 1472)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !70, line: 46, baseType: !71)
!70 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!71 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !20, file: !21, line: 96, baseType: !18, size: 32, offset: 1536)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !20, file: !21, line: 98, baseType: !74, size: 160, offset: 1568)
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 160, elements: !75)
!75 = !{!76}
!76 = !DISubrange(count: 20)
!77 = !DISubprogram(name: "dcgettext", scope: !78, file: !78, line: 51, type: !79, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!78 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!79 = !DISubroutineType(types: !80)
!80 = !{!25, !6, !6, !18}
!81 = !DISubprogram(name: "quotearg_colon", scope: !82, file: !82, line: 391, type: !83, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!82 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!83 = !DISubroutineType(types: !84)
!84 = !{!25, !6}
!85 = !DISubprogram(name: "error", scope: !86, file: !86, line: 52, type: !87, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!86 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!87 = !DISubroutineType(types: !88)
!88 = !{null, !18, !18, !6, null}
!89 = !{!9, !90}
!90 = !DIGlobalVariableExpression(var: !91, expr: !DIExpression())
!91 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !11, file: !12, line: 56, type: !92, isLocal: true, isDefinition: true)
!92 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!93 = !DIGlobalVariableExpression(var: !94, expr: !DIExpression())
!94 = distinct !DIGlobalVariable(name: "exit_failure", scope: !95, file: !96, line: 24, type: !98, isLocal: false, isDefinition: true)
!95 = distinct !DICompileUnit(language: DW_LANG_C99, file: !96, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !97, splitDebugInlining: false, nameTableKind: None)
!96 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!97 = !{!93}
!98 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !18)
!99 = !DIGlobalVariableExpression(var: !100, expr: !DIExpression())
!100 = distinct !DIGlobalVariable(name: "long_options", scope: !101, file: !102, line: 34, type: !164, isLocal: true, isDefinition: true)
!101 = distinct !DICompileUnit(language: DW_LANG_C99, file: !102, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !103, globals: !163, splitDebugInlining: false, nameTableKind: None)
!102 = !DIFile(filename: "lib/long-options.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!103 = !{!104, !119}
!104 = !DISubprogram(name: "getopt_long", scope: !105, file: !105, line: 66, type: !106, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!105 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!106 = !DISubroutineType(types: !107)
!107 = !{!18, !18, !108, !6, !110, !117}
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !112)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !105, line: 50, size: 256, elements: !113)
!113 = !{!114, !115, !116, !118}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !112, file: !105, line: 52, baseType: !6, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !112, file: !105, line: 55, baseType: !18, size: 32, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !112, file: !105, line: 56, baseType: !117, size: 64, offset: 128)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !112, file: !105, line: 57, baseType: !18, size: 32, offset: 192)
!119 = !DISubprogram(name: "version_etc_va", scope: !120, file: !120, line: 63, type: !121, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!120 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!121 = !DISubroutineType(types: !122)
!122 = !{null, !123, !6, !6, !6, !155}
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !125)
!125 = !{!126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !124, file: !21, line: 51, baseType: !18, size: 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !124, file: !21, line: 54, baseType: !25, size: 64, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !124, file: !21, line: 55, baseType: !25, size: 64, offset: 128)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !124, file: !21, line: 56, baseType: !25, size: 64, offset: 192)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !124, file: !21, line: 57, baseType: !25, size: 64, offset: 256)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !124, file: !21, line: 58, baseType: !25, size: 64, offset: 320)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !124, file: !21, line: 59, baseType: !25, size: 64, offset: 384)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !124, file: !21, line: 60, baseType: !25, size: 64, offset: 448)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !124, file: !21, line: 61, baseType: !25, size: 64, offset: 512)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !124, file: !21, line: 64, baseType: !25, size: 64, offset: 576)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !124, file: !21, line: 65, baseType: !25, size: 64, offset: 640)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !124, file: !21, line: 66, baseType: !25, size: 64, offset: 704)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !124, file: !21, line: 68, baseType: !37, size: 64, offset: 768)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !124, file: !21, line: 70, baseType: !123, size: 64, offset: 832)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !124, file: !21, line: 72, baseType: !18, size: 32, offset: 896)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !124, file: !21, line: 73, baseType: !18, size: 32, offset: 928)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !124, file: !21, line: 74, baseType: !43, size: 64, offset: 960)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !124, file: !21, line: 77, baseType: !47, size: 16, offset: 1024)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !124, file: !21, line: 78, baseType: !49, size: 8, offset: 1040)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !124, file: !21, line: 79, baseType: !51, size: 8, offset: 1048)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !124, file: !21, line: 81, baseType: !55, size: 64, offset: 1088)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !124, file: !21, line: 89, baseType: !58, size: 64, offset: 1152)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !124, file: !21, line: 91, baseType: !60, size: 64, offset: 1216)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !124, file: !21, line: 92, baseType: !63, size: 64, offset: 1280)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !124, file: !21, line: 93, baseType: !123, size: 64, offset: 1344)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !124, file: !21, line: 94, baseType: !67, size: 64, offset: 1408)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !124, file: !21, line: 95, baseType: !69, size: 64, offset: 1472)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !124, file: !21, line: 96, baseType: !18, size: 32, offset: 1536)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !124, file: !21, line: 98, baseType: !74, size: 160, offset: 1568)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !102, line: 72, size: 192, elements: !157)
!157 = !{!158, !160, !161, !162}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !156, file: !102, line: 72, baseType: !159, size: 32)
!159 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !156, file: !102, line: 72, baseType: !159, size: 32, offset: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !156, file: !102, line: 72, baseType: !67, size: 64, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !156, file: !102, line: 72, baseType: !67, size: 64, offset: 128)
!163 = !{!99}
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 768, elements: !165)
!165 = !{!166}
!166 = !DISubrange(count: 3)
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(name: "program_name", scope: !169, file: !170, line: 33, type: !6, isLocal: false, isDefinition: true)
!169 = distinct !DICompileUnit(language: DW_LANG_C99, file: !170, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !171, globals: !208, splitDebugInlining: false, nameTableKind: None)
!170 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!171 = !{!67, !172, !25}
!172 = !DISubprogram(name: "fputs", scope: !173, file: !173, line: 626, type: !174, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!173 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!174 = !DISubroutineType(types: !175)
!175 = !{!18, !6, !176}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !178)
!178 = !{!179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !177, file: !21, line: 51, baseType: !18, size: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !177, file: !21, line: 54, baseType: !25, size: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !177, file: !21, line: 55, baseType: !25, size: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !177, file: !21, line: 56, baseType: !25, size: 64, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !177, file: !21, line: 57, baseType: !25, size: 64, offset: 256)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !177, file: !21, line: 58, baseType: !25, size: 64, offset: 320)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !177, file: !21, line: 59, baseType: !25, size: 64, offset: 384)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !177, file: !21, line: 60, baseType: !25, size: 64, offset: 448)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !177, file: !21, line: 61, baseType: !25, size: 64, offset: 512)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !177, file: !21, line: 64, baseType: !25, size: 64, offset: 576)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !177, file: !21, line: 65, baseType: !25, size: 64, offset: 640)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !177, file: !21, line: 66, baseType: !25, size: 64, offset: 704)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !177, file: !21, line: 68, baseType: !37, size: 64, offset: 768)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !177, file: !21, line: 70, baseType: !176, size: 64, offset: 832)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !177, file: !21, line: 72, baseType: !18, size: 32, offset: 896)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !177, file: !21, line: 73, baseType: !18, size: 32, offset: 928)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !177, file: !21, line: 74, baseType: !43, size: 64, offset: 960)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !177, file: !21, line: 77, baseType: !47, size: 16, offset: 1024)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !177, file: !21, line: 78, baseType: !49, size: 8, offset: 1040)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !177, file: !21, line: 79, baseType: !51, size: 8, offset: 1048)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !177, file: !21, line: 81, baseType: !55, size: 64, offset: 1088)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !177, file: !21, line: 89, baseType: !58, size: 64, offset: 1152)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !177, file: !21, line: 91, baseType: !60, size: 64, offset: 1216)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !177, file: !21, line: 92, baseType: !63, size: 64, offset: 1280)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !177, file: !21, line: 93, baseType: !176, size: 64, offset: 1344)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !177, file: !21, line: 94, baseType: !67, size: 64, offset: 1408)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !177, file: !21, line: 95, baseType: !69, size: 64, offset: 1472)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !177, file: !21, line: 96, baseType: !18, size: 32, offset: 1536)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !177, file: !21, line: 98, baseType: !74, size: 160, offset: 1568)
!208 = !{!167}
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !211, file: !212, line: 85, type: !348, isLocal: false, isDefinition: true)
!211 = distinct !DICompileUnit(language: DW_LANG_C99, file: !212, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !213, retainedTypes: !247, globals: !321, splitDebugInlining: false, nameTableKind: None)
!212 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!213 = !{!214, !227, !232}
!214 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !82, line: 32, baseType: !159, size: 32, elements: !215)
!215 = !{!216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226}
!216 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!217 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!218 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!219 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!220 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!221 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!222 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!223 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!224 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!225 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!226 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!227 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !82, line: 242, baseType: !159, size: 32, elements: !228)
!228 = !{!229, !230, !231}
!229 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!230 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!231 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!232 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !233, line: 46, baseType: !159, size: 32, elements: !234)
!233 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!234 = !{!235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246}
!235 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!236 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!237 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!238 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!239 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!240 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!241 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!242 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!243 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!244 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!245 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!246 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!247 = !{!248, !254, !270, !274, !18, !47, !277, !69, !294, !298, !77, !304, !308, !25, !312, !315, !318}
!248 = !DISubprogram(name: "xmemdup", scope: !249, file: !249, line: 62, type: !250, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!249 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!250 = !DISubroutineType(types: !251)
!251 = !{!67, !252, !71}
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!254 = !DISubprogram(name: "quotearg_alloc_mem", scope: !82, file: !82, line: 342, type: !255, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!255 = !DISubroutineType(types: !256)
!256 = !{!25, !6, !71, !257, !258}
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !260)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !212, line: 65, size: 448, elements: !261)
!261 = !{!262, !263, !264, !268, !269}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !260, file: !212, line: 68, baseType: !214, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !260, file: !212, line: 71, baseType: !18, size: 32, offset: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !260, file: !212, line: 75, baseType: !265, size: 256, offset: 64)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 256, elements: !266)
!266 = !{!267}
!267 = !DISubrange(count: 8)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !260, file: !212, line: 78, baseType: !6, size: 64, offset: 320)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !260, file: !212, line: 81, baseType: !6, size: 64, offset: 384)
!270 = !DISubprogram(name: "free", scope: !271, file: !271, line: 565, type: !272, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!271 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!272 = !DISubroutineType(types: !273)
!273 = !{null, !67}
!274 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !82, file: !82, line: 408, type: !275, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!275 = !DISubroutineType(types: !276)
!276 = !{!25, !18, !6, !6, !6, !71}
!277 = !DISubprogram(name: "rpl_mbrtowc", scope: !278, file: !278, line: 717, type: !279, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!278 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!279 = !DISubroutineType(types: !280)
!280 = !{!71, !117, !6, !71, !281}
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !283, line: 13, size: 64, elements: !284)
!283 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!284 = !{!285, !286}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !282, file: !283, line: 15, baseType: !18, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !282, file: !283, line: 20, baseType: !287, size: 32, offset: 32)
!287 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !282, file: !283, line: 16, size: 32, elements: !288)
!288 = !{!289, !290}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !287, file: !283, line: 18, baseType: !159, size: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !287, file: !283, line: 19, baseType: !291, size: 32)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 32, elements: !292)
!292 = !{!293}
!293 = !DISubrange(count: 4)
!294 = !DISubprogram(name: "iswprint", scope: !295, file: !295, line: 120, type: !296, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!295 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!296 = !DISubroutineType(types: !297)
!297 = !{!18, !159}
!298 = !DISubprogram(name: "mbsinit", scope: !299, file: !299, line: 292, type: !300, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!299 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!300 = !DISubroutineType(types: !301)
!301 = !{!18, !302}
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !282)
!304 = !DISubprogram(name: "locale_charset", scope: !305, file: !305, line: 35, type: !306, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!305 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!306 = !DISubroutineType(types: !307)
!307 = !{!6}
!308 = !DISubprogram(name: "c_strcasecmp", scope: !309, file: !309, line: 42, type: !310, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!309 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!310 = !DISubroutineType(types: !311)
!311 = !{!18, !6, !6}
!312 = !DISubprogram(name: "xmalloc", scope: !249, file: !249, line: 53, type: !313, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!313 = !DISubroutineType(types: !314)
!314 = !{!67, !71}
!315 = !DISubprogram(name: "xalloc_die", scope: !249, file: !249, line: 51, type: !316, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !4)
!316 = !DISubroutineType(types: !317)
!317 = !{null}
!318 = !DISubprogram(name: "xrealloc", scope: !249, file: !249, line: 59, type: !319, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!319 = !DISubroutineType(types: !320)
!320 = !{!67, !67, !71}
!321 = !{!209, !322, !328, !330, !332, !337, !344, !346}
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !211, file: !212, line: 101, type: !324, isLocal: false, isDefinition: true)
!324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !325, size: 320, elements: !326)
!325 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !214)
!326 = !{!327}
!327 = !DISubrange(count: 10)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !211, file: !212, line: 1052, type: !260, isLocal: false, isDefinition: true)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !211, file: !212, line: 116, type: !260, isLocal: true, isDefinition: true)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(name: "slot0", scope: !211, file: !212, line: 842, type: !334, isLocal: true, isDefinition: true)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, elements: !335)
!335 = !{!336}
!336 = !DISubrange(count: 256)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(name: "slotvec", scope: !211, file: !212, line: 845, type: !339, isLocal: true, isDefinition: true)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !212, line: 834, size: 128, elements: !341)
!341 = !{!342, !343}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !340, file: !212, line: 836, baseType: !69, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !340, file: !212, line: 837, baseType: !25, size: 64, offset: 64)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "nslots", scope: !211, file: !212, line: 843, type: !18, isLocal: true, isDefinition: true)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "slotvec0", scope: !211, file: !212, line: 844, type: !340, isLocal: true, isDefinition: true)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !349, size: 704, elements: !350)
!349 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!350 = !{!351}
!351 = !DISubrange(count: 11)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !354, file: !355, line: 26, type: !357, isLocal: false, isDefinition: true)
!354 = distinct !DICompileUnit(language: DW_LANG_C99, file: !355, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !356, splitDebugInlining: false, nameTableKind: None)
!355 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!356 = !{!352}
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 376, elements: !358)
!358 = !{!359}
!359 = !DISubrange(count: 47)
!360 = distinct !DICompileUnit(language: DW_LANG_C99, file: !361, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !362, retainedTypes: !363, splitDebugInlining: false, nameTableKind: None)
!361 = !DIFile(filename: "src/link.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!362 = !{!214}
!363 = !{!77, !364, !399, !403, !407, !410, !411, !6, !67, !415, !85, !423, !427, !429}
!364 = !DISubprogram(name: "fputs_unlocked", scope: !173, file: !173, line: 662, type: !365, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!365 = !DISubroutineType(types: !366)
!366 = !{!18, !6, !367}
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !369)
!369 = !{!370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !368, file: !21, line: 51, baseType: !18, size: 32)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !368, file: !21, line: 54, baseType: !25, size: 64, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !368, file: !21, line: 55, baseType: !25, size: 64, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !368, file: !21, line: 56, baseType: !25, size: 64, offset: 192)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !368, file: !21, line: 57, baseType: !25, size: 64, offset: 256)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !368, file: !21, line: 58, baseType: !25, size: 64, offset: 320)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !368, file: !21, line: 59, baseType: !25, size: 64, offset: 384)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !368, file: !21, line: 60, baseType: !25, size: 64, offset: 448)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !368, file: !21, line: 61, baseType: !25, size: 64, offset: 512)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !368, file: !21, line: 64, baseType: !25, size: 64, offset: 576)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !368, file: !21, line: 65, baseType: !25, size: 64, offset: 640)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !368, file: !21, line: 66, baseType: !25, size: 64, offset: 704)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !368, file: !21, line: 68, baseType: !37, size: 64, offset: 768)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !368, file: !21, line: 70, baseType: !367, size: 64, offset: 832)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !368, file: !21, line: 72, baseType: !18, size: 32, offset: 896)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !368, file: !21, line: 73, baseType: !18, size: 32, offset: 928)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !368, file: !21, line: 74, baseType: !43, size: 64, offset: 960)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !368, file: !21, line: 77, baseType: !47, size: 16, offset: 1024)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !368, file: !21, line: 78, baseType: !49, size: 8, offset: 1040)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !368, file: !21, line: 79, baseType: !51, size: 8, offset: 1048)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !368, file: !21, line: 81, baseType: !55, size: 64, offset: 1088)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !368, file: !21, line: 89, baseType: !58, size: 64, offset: 1152)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !368, file: !21, line: 91, baseType: !60, size: 64, offset: 1216)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !368, file: !21, line: 92, baseType: !63, size: 64, offset: 1280)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !368, file: !21, line: 93, baseType: !367, size: 64, offset: 1344)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !368, file: !21, line: 94, baseType: !67, size: 64, offset: 1408)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !368, file: !21, line: 95, baseType: !69, size: 64, offset: 1472)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !368, file: !21, line: 96, baseType: !18, size: 32, offset: 1536)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !368, file: !21, line: 98, baseType: !74, size: 160, offset: 1568)
!399 = !DISubprogram(name: "set_program_name", scope: !400, file: !400, line: 37, type: !401, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!400 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!401 = !DISubroutineType(types: !402)
!402 = !{null, !6}
!403 = !DISubprogram(name: "setlocale", scope: !404, file: !404, line: 122, type: !405, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!404 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!405 = !DISubroutineType(types: !406)
!406 = !{!25, !18, !6}
!407 = !DISubprogram(name: "bindtextdomain", scope: !78, file: !78, line: 86, type: !408, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!408 = !DISubroutineType(types: !409)
!409 = !{!25, !6, !6}
!410 = !DISubprogram(name: "textdomain", scope: !78, file: !78, line: 82, type: !83, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!411 = !DISubprogram(name: "atexit", scope: !271, file: !271, line: 595, type: !412, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!412 = !DISubroutineType(types: !413)
!413 = !{!18, !414}
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!415 = !DISubprogram(name: "parse_gnu_standard_options_only", scope: !416, file: !416, line: 33, type: !417, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!416 = !DIFile(filename: "./lib/long-options.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!417 = !DISubroutineType(types: !418)
!418 = !{null, !18, !419, !6, !6, !6, !92, !420, null}
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DISubroutineType(types: !422)
!422 = !{null, !18}
!423 = !DISubprogram(name: "quote", scope: !424, file: !424, line: 44, type: !425, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!424 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!425 = !DISubroutineType(types: !426)
!426 = !{!6, !6}
!427 = !DISubprogram(name: "link", scope: !428, file: !428, line: 789, type: !310, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!428 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!429 = !DISubprogram(name: "quotearg_n_style", scope: !82, file: !82, line: 368, type: !430, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!430 = !DISubroutineType(types: !431)
!431 = !{!25, !18, !214, !6}
!432 = distinct !DICompileUnit(language: DW_LANG_C99, file: !433, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !434, retainedTypes: !438, splitDebugInlining: false, nameTableKind: None)
!433 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!434 = !{!435}
!435 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !433, line: 40, baseType: !159, size: 32, elements: !436)
!436 = !{!437}
!437 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!438 = !{!77, !439, !67}
!439 = !DISubprogram(name: "fputs_unlocked", scope: !173, file: !173, line: 662, type: !440, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!440 = !DISubroutineType(types: !441)
!441 = !{!18, !6, !442}
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !444)
!444 = !{!445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !443, file: !21, line: 51, baseType: !18, size: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !443, file: !21, line: 54, baseType: !25, size: 64, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !443, file: !21, line: 55, baseType: !25, size: 64, offset: 128)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !443, file: !21, line: 56, baseType: !25, size: 64, offset: 192)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !443, file: !21, line: 57, baseType: !25, size: 64, offset: 256)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !443, file: !21, line: 58, baseType: !25, size: 64, offset: 320)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !443, file: !21, line: 59, baseType: !25, size: 64, offset: 384)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !443, file: !21, line: 60, baseType: !25, size: 64, offset: 448)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !443, file: !21, line: 61, baseType: !25, size: 64, offset: 512)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !443, file: !21, line: 64, baseType: !25, size: 64, offset: 576)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !443, file: !21, line: 65, baseType: !25, size: 64, offset: 640)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !443, file: !21, line: 66, baseType: !25, size: 64, offset: 704)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !443, file: !21, line: 68, baseType: !37, size: 64, offset: 768)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !443, file: !21, line: 70, baseType: !442, size: 64, offset: 832)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !443, file: !21, line: 72, baseType: !18, size: 32, offset: 896)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !443, file: !21, line: 73, baseType: !18, size: 32, offset: 928)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !443, file: !21, line: 74, baseType: !43, size: 64, offset: 960)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !443, file: !21, line: 77, baseType: !47, size: 16, offset: 1024)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !443, file: !21, line: 78, baseType: !49, size: 8, offset: 1040)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !443, file: !21, line: 79, baseType: !51, size: 8, offset: 1048)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !443, file: !21, line: 81, baseType: !55, size: 64, offset: 1088)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !443, file: !21, line: 89, baseType: !58, size: 64, offset: 1152)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !443, file: !21, line: 91, baseType: !60, size: 64, offset: 1216)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !443, file: !21, line: 92, baseType: !63, size: 64, offset: 1280)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !443, file: !21, line: 93, baseType: !442, size: 64, offset: 1344)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !443, file: !21, line: 94, baseType: !67, size: 64, offset: 1408)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !443, file: !21, line: 95, baseType: !69, size: 64, offset: 1472)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !443, file: !21, line: 96, baseType: !18, size: 32, offset: 1536)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !443, file: !21, line: 98, baseType: !74, size: 160, offset: 1568)
!474 = distinct !DICompileUnit(language: DW_LANG_C99, file: !475, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !476, retainedTypes: !489, splitDebugInlining: false, nameTableKind: None)
!475 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!476 = !{!477}
!477 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !478, file: !249, line: 186, baseType: !159, size: 32, elements: !487)
!478 = distinct !DISubprogram(name: "x2nrealloc", scope: !249, file: !249, line: 174, type: !479, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !474, retainedNodes: !482)
!479 = !DISubroutineType(types: !480)
!480 = !{!67, !67, !481, !69}
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!482 = !{!483, !484, !485, !486}
!483 = !DILocalVariable(name: "p", arg: 1, scope: !478, file: !249, line: 174, type: !67)
!484 = !DILocalVariable(name: "pn", arg: 2, scope: !478, file: !249, line: 174, type: !481)
!485 = !DILocalVariable(name: "s", arg: 3, scope: !478, file: !249, line: 174, type: !69)
!486 = !DILocalVariable(name: "n", scope: !478, file: !249, line: 176, type: !69)
!487 = !{!488}
!488 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!489 = !{!69, !315, !312, !318, !25, !270, !67, !490, !493}
!490 = !DISubprogram(name: "xcalloc", scope: !249, file: !249, line: 57, type: !491, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!491 = !DISubroutineType(types: !492)
!492 = !{!67, !71, !71}
!493 = !DISubprogram(name: "rpl_calloc", scope: !494, file: !494, line: 688, type: !491, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!494 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!495 = distinct !DICompileUnit(language: DW_LANG_C99, file: !496, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !497, splitDebugInlining: false, nameTableKind: None)
!496 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!497 = !{!77, !85}
!498 = distinct !DICompileUnit(language: DW_LANG_C99, file: !499, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !500, splitDebugInlining: false, nameTableKind: None)
!499 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!500 = !{!67}
!501 = distinct !DICompileUnit(language: DW_LANG_C99, file: !502, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !503, splitDebugInlining: false, nameTableKind: None)
!502 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!503 = !{!504, !69, !516}
!504 = !DISubprogram(name: "mbrtowc", scope: !299, file: !299, line: 296, type: !505, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!505 = !DISubroutineType(types: !506)
!506 = !{!71, !117, !6, !71, !507}
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !283, line: 13, size: 64, elements: !509)
!509 = !{!510, !511}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !508, file: !283, line: 15, baseType: !18, size: 32)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !508, file: !283, line: 20, baseType: !512, size: 32, offset: 32)
!512 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !508, file: !283, line: 16, size: 32, elements: !513)
!513 = !{!514, !515}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !512, file: !283, line: 18, baseType: !159, size: 32)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !512, file: !283, line: 19, baseType: !291, size: 32)
!516 = !DISubprogram(name: "hard_locale", scope: !517, file: !517, line: 26, type: !518, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!517 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!518 = !DISubroutineType(types: !519)
!519 = !{!92, !18}
!520 = distinct !DICompileUnit(language: DW_LANG_C99, file: !521, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !522, splitDebugInlining: false, nameTableKind: None)
!521 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!522 = !{!523}
!523 = !DISubprogram(name: "rpl_fclose", scope: !524, file: !524, line: 672, type: !525, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!524 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!525 = !DISubroutineType(types: !526)
!526 = !{!18, !527}
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !529)
!529 = !{!530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !528, file: !21, line: 51, baseType: !18, size: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !528, file: !21, line: 54, baseType: !25, size: 64, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !528, file: !21, line: 55, baseType: !25, size: 64, offset: 128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !528, file: !21, line: 56, baseType: !25, size: 64, offset: 192)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !528, file: !21, line: 57, baseType: !25, size: 64, offset: 256)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !528, file: !21, line: 58, baseType: !25, size: 64, offset: 320)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !528, file: !21, line: 59, baseType: !25, size: 64, offset: 384)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !528, file: !21, line: 60, baseType: !25, size: 64, offset: 448)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !528, file: !21, line: 61, baseType: !25, size: 64, offset: 512)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !528, file: !21, line: 64, baseType: !25, size: 64, offset: 576)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !528, file: !21, line: 65, baseType: !25, size: 64, offset: 640)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !528, file: !21, line: 66, baseType: !25, size: 64, offset: 704)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !528, file: !21, line: 68, baseType: !37, size: 64, offset: 768)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !528, file: !21, line: 70, baseType: !527, size: 64, offset: 832)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !528, file: !21, line: 72, baseType: !18, size: 32, offset: 896)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !528, file: !21, line: 73, baseType: !18, size: 32, offset: 928)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !528, file: !21, line: 74, baseType: !43, size: 64, offset: 960)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !528, file: !21, line: 77, baseType: !47, size: 16, offset: 1024)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !528, file: !21, line: 78, baseType: !49, size: 8, offset: 1040)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !528, file: !21, line: 79, baseType: !51, size: 8, offset: 1048)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !528, file: !21, line: 81, baseType: !55, size: 64, offset: 1088)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !528, file: !21, line: 89, baseType: !58, size: 64, offset: 1152)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !528, file: !21, line: 91, baseType: !60, size: 64, offset: 1216)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !528, file: !21, line: 92, baseType: !63, size: 64, offset: 1280)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !528, file: !21, line: 93, baseType: !527, size: 64, offset: 1344)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !528, file: !21, line: 94, baseType: !67, size: 64, offset: 1408)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !528, file: !21, line: 95, baseType: !69, size: 64, offset: 1472)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !528, file: !21, line: 96, baseType: !18, size: 32, offset: 1536)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !528, file: !21, line: 98, baseType: !74, size: 160, offset: 1568)
!559 = distinct !DICompileUnit(language: DW_LANG_C99, file: !560, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !561, splitDebugInlining: false, nameTableKind: None)
!560 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!561 = !{!562}
!562 = !DISubprogram(name: "setlocale_null_r", scope: !563, file: !563, line: 64, type: !564, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!563 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!564 = !DISubroutineType(types: !565)
!565 = !{!18, !18, !25, !71}
!566 = distinct !DICompileUnit(language: DW_LANG_C99, file: !567, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !568, retainedTypes: !955, splitDebugInlining: false, nameTableKind: None)
!567 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!568 = !{!569}
!569 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !570, line: 41, baseType: !159, size: 32, elements: !571)
!570 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!571 = !{!572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954}
!572 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!573 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!574 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!575 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!576 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!577 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!578 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!579 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!580 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!581 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!582 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!583 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!584 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!585 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!586 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!587 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!588 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!589 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!590 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!591 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!592 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!593 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!594 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!595 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!596 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!597 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!598 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!599 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!600 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!601 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!602 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!603 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!604 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!605 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!606 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!607 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!608 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!609 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!610 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!611 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!612 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!613 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!614 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!615 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!616 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!617 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!618 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!619 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!620 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!621 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!622 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!623 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!624 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!625 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!626 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!627 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!628 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!629 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!630 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!631 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!632 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!633 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!634 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!635 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!636 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!637 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!661 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!662 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!663 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!664 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!665 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!666 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!667 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!668 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!669 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!670 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!671 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!672 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!673 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!674 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!675 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!676 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!677 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!678 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!679 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!680 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!681 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!682 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!683 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!684 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!685 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!686 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!687 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!688 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!689 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!690 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!691 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!692 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!693 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!694 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!695 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!696 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!697 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!698 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!699 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!700 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!701 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!702 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!703 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!704 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!705 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!706 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!707 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!708 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!709 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!710 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!711 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!712 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!713 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!714 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!715 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!716 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!717 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!719 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!720 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!721 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!722 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!723 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!724 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!725 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!726 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!727 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!728 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!729 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!730 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!731 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!732 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!733 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!734 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!735 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!736 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!737 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!738 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!739 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!740 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!741 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!742 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!743 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!744 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!745 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!746 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!747 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!748 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!749 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!750 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!751 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!752 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!753 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!754 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!755 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!756 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!757 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!758 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!759 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!760 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!761 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!762 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!763 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!764 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!765 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!766 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!767 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!768 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!769 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!770 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!771 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!772 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!773 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!774 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!779 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!780 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!781 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!782 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!783 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!784 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!785 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!786 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!787 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!788 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!789 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!790 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!791 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!793 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!794 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!795 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!796 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!797 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!798 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!799 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!800 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!801 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!802 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!803 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!804 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!805 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!806 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!807 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!808 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!809 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!810 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!812 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!813 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!814 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!815 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!816 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!817 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!818 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!819 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!820 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!821 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!822 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!823 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!824 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!825 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!826 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!827 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!828 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!829 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!830 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!831 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!832 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!833 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!834 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!835 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!836 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!837 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!838 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!839 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!840 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!841 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!842 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!843 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!844 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!845 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!846 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!847 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!848 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!849 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!850 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!851 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!852 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!853 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!854 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!856 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!857 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!858 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!859 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!860 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!861 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!884 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!885 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!886 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!887 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!888 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!889 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!890 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!891 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!894 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!895 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!896 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!897 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!898 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!899 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!900 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!901 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!902 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!903 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!904 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!905 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!906 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!907 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!908 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!909 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!910 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!911 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!912 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!913 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!914 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!915 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!916 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!917 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!918 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!919 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!920 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!921 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!922 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!923 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!924 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!925 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!926 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!927 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!928 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!929 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!930 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!931 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!932 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!933 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!934 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!935 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!936 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!937 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!938 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!939 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!940 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!941 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!942 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!943 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!944 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!945 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!946 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!947 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!948 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!949 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!950 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!951 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!952 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!953 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!954 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!955 = !{!956, !67}
!956 = !DISubprogram(name: "nl_langinfo", scope: !570, file: !570, line: 661, type: !957, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!957 = !DISubroutineType(types: !958)
!958 = !{!25, !18}
!959 = distinct !DICompileUnit(language: DW_LANG_C99, file: !960, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !961, splitDebugInlining: false, nameTableKind: None)
!960 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!961 = !{!67, !403}
!962 = distinct !DICompileUnit(language: DW_LANG_C99, file: !963, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !964, splitDebugInlining: false, nameTableKind: None)
!963 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!964 = !{!965, !1000, !1001, !1004}
!965 = !DISubprogram(name: "fileno", scope: !173, file: !173, line: 786, type: !966, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!966 = !DISubroutineType(types: !967)
!967 = !{!18, !968}
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !970)
!970 = !{!971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !969, file: !21, line: 51, baseType: !18, size: 32)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !969, file: !21, line: 54, baseType: !25, size: 64, offset: 64)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !969, file: !21, line: 55, baseType: !25, size: 64, offset: 128)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !969, file: !21, line: 56, baseType: !25, size: 64, offset: 192)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !969, file: !21, line: 57, baseType: !25, size: 64, offset: 256)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !969, file: !21, line: 58, baseType: !25, size: 64, offset: 320)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !969, file: !21, line: 59, baseType: !25, size: 64, offset: 384)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !969, file: !21, line: 60, baseType: !25, size: 64, offset: 448)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !969, file: !21, line: 61, baseType: !25, size: 64, offset: 512)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !969, file: !21, line: 64, baseType: !25, size: 64, offset: 576)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !969, file: !21, line: 65, baseType: !25, size: 64, offset: 640)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !969, file: !21, line: 66, baseType: !25, size: 64, offset: 704)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !969, file: !21, line: 68, baseType: !37, size: 64, offset: 768)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !969, file: !21, line: 70, baseType: !968, size: 64, offset: 832)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !969, file: !21, line: 72, baseType: !18, size: 32, offset: 896)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !969, file: !21, line: 73, baseType: !18, size: 32, offset: 928)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !969, file: !21, line: 74, baseType: !43, size: 64, offset: 960)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !969, file: !21, line: 77, baseType: !47, size: 16, offset: 1024)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !969, file: !21, line: 78, baseType: !49, size: 8, offset: 1040)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !969, file: !21, line: 79, baseType: !51, size: 8, offset: 1048)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !969, file: !21, line: 81, baseType: !55, size: 64, offset: 1088)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !969, file: !21, line: 89, baseType: !58, size: 64, offset: 1152)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !969, file: !21, line: 91, baseType: !60, size: 64, offset: 1216)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !969, file: !21, line: 92, baseType: !63, size: 64, offset: 1280)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !969, file: !21, line: 93, baseType: !968, size: 64, offset: 1344)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !969, file: !21, line: 94, baseType: !67, size: 64, offset: 1408)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !969, file: !21, line: 95, baseType: !69, size: 64, offset: 1472)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !969, file: !21, line: 96, baseType: !18, size: 32, offset: 1536)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !969, file: !21, line: 98, baseType: !74, size: 160, offset: 1568)
!1000 = !DISubprogram(name: "fclose", scope: !173, file: !173, line: 213, type: !966, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!1001 = !DISubprogram(name: "lseek", scope: !428, file: !428, line: 334, type: !1002, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!45, !18, !45, !18}
!1004 = !DISubprogram(name: "rpl_fflush", scope: !524, file: !524, line: 718, type: !966, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!1005 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1006, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !1007, splitDebugInlining: false, nameTableKind: None)
!1006 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1007 = !{!67, !1008, !1043}
