source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.F_triple = type { i8*, i64, i64 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__dirstream = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%struct.hash_entry = type { i8*, %struct.hash_entry* }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.infomap = type { i8*, i8* }
%struct.isaac = type { i64, %struct.isaac_state, %union.anon.0 }
%struct.isaac_state = type { [256 x i64], i64, i64, i64 }
%struct.link_arg = type { i32, i8*, i32, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.randint_source = type { %struct.randread_source*, i64, i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1 = distinct !DIGlobalVariable(name: "hard_dir_link", scope: !2, file: !3, line: 79, type: !183, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !40, globals: !299, nameTableKind: None)
!3 = !DIFile(filename: "src/ln.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !20, !23, !30, !33}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!9 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 42, baseType: !7, size: 32, elements: !21)
!21 = !{!22}
!22 = !DIEnumerator(name: "O_PATHSEARCH", value: 2097152, isUnsigned: true)
!23 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "backup_type", file: !24, line: 30, baseType: !7, size: 32, elements: !25)
!24 = !DIFile(filename: "./lib/backupfile.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!25 = !{!26, !27, !28, !29}
!26 = !DIEnumerator(name: "no_backups", value: 0, isUnsigned: true)
!27 = !DIEnumerator(name: "simple_backups", value: 1, isUnsigned: true)
!28 = !DIEnumerator(name: "numbered_existing_backups", value: 2, isUnsigned: true)
!29 = !DIEnumerator(name: "numbered_backups", value: 3, isUnsigned: true)
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 97, baseType: !7, size: 32, elements: !31)
!31 = !{!32}
!32 = !DIEnumerator(name: "DEST_INFO_INITIAL_CAPACITY", value: 61, isUnsigned: true)
!33 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "canonicalize_mode_t", file: !34, line: 28, baseType: !7, size: 32, elements: !35)
!34 = !DIFile(filename: "./lib/canonicalize.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!35 = !{!36, !37, !38, !39}
!36 = !DIEnumerator(name: "CAN_EXISTING", value: 0, isUnsigned: true)
!37 = !DIEnumerator(name: "CAN_ALL_BUT_LAST", value: 1, isUnsigned: true)
!38 = !DIEnumerator(name: "CAN_MISSING", value: 2, isUnsigned: true)
!39 = !DIEnumerator(name: "CAN_NOLINKS", value: 4, isUnsigned: true)
!40 = !{!41, !51, !112, !116, !120, !123, !126, !133, !148, !152, !45, !102, !155, !159, !163, !166, !167, !195, !197, !199, !204, !207, !208, !212, !215, !218, !262, !263, !267, !271, !274, !277, !281, !284, !287, !290, !291, !294, !298}
!41 = !DISubprogram(name: "dcgettext", scope: !42, file: !42, line: 51, type: !43, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!42 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!43 = !DISubroutineType(types: !44)
!44 = !{!45, !47, !47, !49}
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!49 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!50 = !{}
!51 = !DISubprogram(name: "fputs_unlocked", scope: !52, file: !52, line: 662, type: !53, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!52 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!53 = !DISubroutineType(types: !54)
!54 = !{!49, !47, !55}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !57, line: 49, size: 1728, elements: !58)
!57 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!58 = !{!59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !74, !75, !76, !77, !81, !83, !85, !89, !92, !94, !97, !100, !101, !103, !107, !108}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !56, file: !57, line: 51, baseType: !49, size: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !56, file: !57, line: 54, baseType: !45, size: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !56, file: !57, line: 55, baseType: !45, size: 64, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !56, file: !57, line: 56, baseType: !45, size: 64, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !56, file: !57, line: 57, baseType: !45, size: 64, offset: 256)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !56, file: !57, line: 58, baseType: !45, size: 64, offset: 320)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !56, file: !57, line: 59, baseType: !45, size: 64, offset: 384)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !56, file: !57, line: 60, baseType: !45, size: 64, offset: 448)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !56, file: !57, line: 61, baseType: !45, size: 64, offset: 512)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !56, file: !57, line: 64, baseType: !45, size: 64, offset: 576)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !56, file: !57, line: 65, baseType: !45, size: 64, offset: 640)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !56, file: !57, line: 66, baseType: !45, size: 64, offset: 704)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !56, file: !57, line: 68, baseType: !72, size: 64, offset: 768)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !57, line: 36, flags: DIFlagFwdDecl)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !56, file: !57, line: 70, baseType: !55, size: 64, offset: 832)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !56, file: !57, line: 72, baseType: !49, size: 32, offset: 896)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !56, file: !57, line: 73, baseType: !49, size: 32, offset: 928)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !56, file: !57, line: 74, baseType: !78, size: 64, offset: 960)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !79, line: 152, baseType: !80)
!79 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!80 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !56, file: !57, line: 77, baseType: !82, size: 16, offset: 1024)
!82 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !56, file: !57, line: 78, baseType: !84, size: 8, offset: 1040)
!84 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !56, file: !57, line: 79, baseType: !86, size: 8, offset: 1048)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 8, elements: !87)
!87 = !{!88}
!88 = !DISubrange(count: 1)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !56, file: !57, line: 81, baseType: !90, size: 64, offset: 1088)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !57, line: 43, baseType: null)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !56, file: !57, line: 89, baseType: !93, size: 64, offset: 1152)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !79, line: 153, baseType: !80)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !56, file: !57, line: 91, baseType: !95, size: 64, offset: 1216)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !57, line: 37, flags: DIFlagFwdDecl)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !56, file: !57, line: 92, baseType: !98, size: 64, offset: 1280)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !57, line: 38, flags: DIFlagFwdDecl)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !56, file: !57, line: 93, baseType: !55, size: 64, offset: 1344)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !56, file: !57, line: 94, baseType: !102, size: 64, offset: 1408)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !56, file: !57, line: 95, baseType: !104, size: 64, offset: 1472)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !105, line: 46, baseType: !106)
!105 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!106 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !56, file: !57, line: 96, baseType: !49, size: 32, offset: 1536)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !56, file: !57, line: 98, baseType: !109, size: 160, offset: 1568)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 160, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 20)
!112 = !DISubprogram(name: "set_program_name", scope: !113, file: !113, line: 37, type: !114, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!113 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!114 = !DISubroutineType(types: !115)
!115 = !{null, !47}
!116 = !DISubprogram(name: "setlocale", scope: !117, file: !117, line: 122, type: !118, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!117 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!118 = !DISubroutineType(types: !119)
!119 = !{!45, !49, !47}
!120 = !DISubprogram(name: "bindtextdomain", scope: !42, file: !42, line: 86, type: !121, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!121 = !DISubroutineType(types: !122)
!122 = !{!45, !47, !47}
!123 = !DISubprogram(name: "textdomain", scope: !42, file: !42, line: 82, type: !124, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!124 = !DISubroutineType(types: !125)
!125 = !{!45, !47}
!126 = !DISubprogram(name: "atexit", scope: !127, file: !127, line: 595, type: !128, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!127 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!128 = !DISubroutineType(types: !129)
!129 = !{!49, !130}
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{null}
!133 = !DISubprogram(name: "getopt_long", scope: !134, file: !134, line: 66, type: !135, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!134 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!135 = !DISubroutineType(types: !136)
!136 = !{!49, !49, !137, !47, !139, !146}
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !134, line: 50, size: 256, elements: !142)
!142 = !{!143, !144, !145, !147}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !141, file: !134, line: 52, baseType: !47, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !141, file: !134, line: 55, baseType: !49, size: 32, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !141, file: !134, line: 56, baseType: !146, size: 64, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !141, file: !134, line: 57, baseType: !49, size: 32, offset: 192)
!148 = !DISubprogram(name: "error", scope: !149, file: !149, line: 52, type: !150, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!149 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!150 = !DISubroutineType(types: !151)
!151 = !{null, !49, !49, !47, null}
!152 = !DISubprogram(name: "quotearg_style", scope: !6, file: !6, line: 377, type: !153, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!153 = !DISubroutineType(types: !154)
!154 = !{!45, !5, !47}
!155 = !DISubprogram(name: "version_etc", scope: !156, file: !156, line: 69, type: !157, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!156 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!157 = !DISubroutineType(types: !158)
!158 = !{null, !55, !47, !47, !47, null}
!159 = !DISubprogram(name: "openat_safer", scope: !160, file: !160, line: 26, type: !161, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!160 = !DIFile(filename: "./lib/fcntl-safer.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!161 = !DISubroutineType(types: !162)
!162 = !{!49, !49, !47, !49, null}
!163 = !DISubprogram(name: "xget_version", scope: !24, file: !24, line: 55, type: !164, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!164 = !DISubroutineType(types: !165)
!165 = !{!23, !47, !47}
!166 = !DISubprogram(name: "set_simple_backup_suffix", scope: !24, file: !24, line: 51, type: !114, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!167 = !DISubprogram(name: "hash_initialize", scope: !168, file: !168, line: 89, type: !169, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!168 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!169 = !DISubroutineType(types: !170)
!170 = !{!171, !106, !173, !184, !189, !192}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !168, line: 67, flags: DIFlagFwdDecl)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !168, line: 53, size: 160, elements: !176)
!176 = !{!177, !179, !180, !181, !182}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !175, file: !168, line: 58, baseType: !178, size: 32)
!178 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !175, file: !168, line: 59, baseType: !178, size: 32, offset: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !175, file: !168, line: 60, baseType: !178, size: 32, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !175, file: !168, line: 61, baseType: !178, size: 32, offset: 96)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !175, file: !168, line: 62, baseType: !183, size: 8, offset: 128)
!183 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!106, !187, !106}
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!183, !187, !187}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{null, !102}
!195 = !DISubprogram(name: "xalloc_die", scope: !196, file: !196, line: 51, type: !131, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !50)
!196 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!197 = !DISubprogram(name: "last_component", scope: !198, file: !198, line: 46, type: !124, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!198 = !DIFile(filename: "./lib/dirname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!199 = !DISubprogram(name: "file_name_concat", scope: !200, file: !200, line: 22, type: !201, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!200 = !DIFile(filename: "./lib/filenamecat.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!201 = !DISubroutineType(types: !202)
!202 = !{!45, !47, !47, !203}
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!204 = !DISubprogram(name: "strip_trailing_slashes", scope: !198, file: !198, line: 48, type: !205, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!205 = !DISubroutineType(types: !206)
!206 = !{!183, !45}
!207 = !DISubprogram(name: "free", scope: !127, file: !127, line: 565, type: !193, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!208 = !DISubprogram(name: "symlinkat", scope: !209, file: !209, line: 815, type: !210, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!209 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!210 = !DISubroutineType(types: !211)
!211 = !{!49, !47, !49, !47}
!212 = !DISubprogram(name: "linkat", scope: !209, file: !209, line: 795, type: !213, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!213 = !DISubroutineType(types: !214)
!214 = !{!49, !49, !47, !49, !47, !49}
!215 = !DISubprogram(name: "quotearg_n_style_colon", scope: !6, file: !6, line: 397, type: !216, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!216 = !DISubroutineType(types: !217)
!217 = !{!45, !49, !5, !47}
!218 = !DISubprogram(name: "seen_file", scope: !219, file: !219, line: 14, type: !220, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!219 = !DIFile(filename: "./lib/file-set.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!220 = !DISubroutineType(types: !221)
!221 = !{!183, !222, !47, !224}
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !172)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !226)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !227, line: 46, size: 1152, elements: !228)
!227 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "")
!228 = !{!229, !231, !233, !235, !237, !239, !241, !242, !243, !244, !246, !248, !256, !257, !258}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !226, file: !227, line: 48, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !79, line: 145, baseType: !106)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !226, file: !227, line: 53, baseType: !232, size: 64, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !79, line: 148, baseType: !106)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !226, file: !227, line: 61, baseType: !234, size: 64, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !79, line: 151, baseType: !106)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !226, file: !227, line: 62, baseType: !236, size: 32, offset: 192)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !79, line: 150, baseType: !7)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !226, file: !227, line: 64, baseType: !238, size: 32, offset: 224)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !79, line: 146, baseType: !7)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !226, file: !227, line: 65, baseType: !240, size: 32, offset: 256)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !79, line: 147, baseType: !7)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !226, file: !227, line: 67, baseType: !49, size: 32, offset: 288)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !226, file: !227, line: 69, baseType: !230, size: 64, offset: 320)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !226, file: !227, line: 74, baseType: !78, size: 64, offset: 384)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !226, file: !227, line: 78, baseType: !245, size: 64, offset: 448)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !79, line: 174, baseType: !80)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !226, file: !227, line: 80, baseType: !247, size: 64, offset: 512)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !79, line: 179, baseType: !80)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !226, file: !227, line: 91, baseType: !249, size: 128, offset: 576)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !250, line: 10, size: 128, elements: !251)
!250 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!251 = !{!252, !254}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !249, file: !250, line: 12, baseType: !253, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !79, line: 160, baseType: !80)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !249, file: !250, line: 16, baseType: !255, size: 64, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !79, line: 196, baseType: !80)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !226, file: !227, line: 92, baseType: !249, size: 128, offset: 704)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !226, file: !227, line: 93, baseType: !249, size: 128, offset: 832)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !226, file: !227, line: 106, baseType: !259, size: 192, offset: 960)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !255, size: 192, elements: !260)
!260 = !{!261}
!261 = !DISubrange(count: 3)
!262 = !DISubprogram(name: "quotearg_n_style", scope: !6, file: !6, line: 368, type: !216, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!263 = !DISubprogram(name: "same_nameat", scope: !264, file: !264, line: 24, type: !265, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!264 = !DIFile(filename: "./lib/same.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!265 = !DISubroutineType(types: !266)
!266 = !{!183, !49, !47, !49, !47}
!267 = !DISubprogram(name: "yesno", scope: !268, file: !268, line: 22, type: !269, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!268 = !DIFile(filename: "./lib/yesno.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!269 = !DISubroutineType(types: !270)
!270 = !{!183}
!271 = !DISubprogram(name: "find_backup_file_name", scope: !24, file: !24, line: 53, type: !272, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!272 = !DISubroutineType(types: !273)
!273 = !{!45, !49, !47, !23}
!274 = !DISubprogram(name: "renameat", scope: !52, file: !52, line: 152, type: !275, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!275 = !DISubroutineType(types: !276)
!276 = !{!49, !49, !47, !49, !47}
!277 = !DISubprogram(name: "force_symlinkat", scope: !278, file: !278, line: 2, type: !279, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!278 = !DIFile(filename: "src/force-link.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!279 = !DISubroutineType(types: !280)
!280 = !{!49, !47, !49, !47, !183, !49}
!281 = !DISubprogram(name: "force_linkat", scope: !278, file: !278, line: 1, type: !282, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!282 = !DISubroutineType(types: !283)
!283 = !{!49, !49, !47, !49, !47, !49, !183, !49}
!284 = !DISubprogram(name: "record_file", scope: !219, file: !219, line: 7, type: !285, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!285 = !DISubroutineType(types: !286)
!286 = !{null, !171, !47, !224}
!287 = !DISubprogram(name: "xmalloc", scope: !196, file: !196, line: 53, type: !288, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!288 = !DISubroutineType(types: !289)
!289 = !{!102, !106}
!290 = !DISubprogram(name: "dir_name", scope: !198, file: !198, line: 40, type: !124, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!291 = !DISubprogram(name: "canonicalize_filename_mode", scope: !34, file: !34, line: 50, type: !292, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!292 = !DISubroutineType(types: !293)
!293 = !{!45, !47, !33}
!294 = !DISubprogram(name: "relpath", scope: !295, file: !295, line: 23, type: !296, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!295 = !DIFile(filename: "src/relpath.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!296 = !DISubroutineType(types: !297)
!297 = !{!183, !47, !47, !45, !106}
!298 = !DISubprogram(name: "xstrdup", scope: !196, file: !196, line: 64, type: !124, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!299 = !{!300, !302, !304, !306, !308, !310, !312, !313, !315, !319, !324, !326}
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(name: "backup_type", scope: !2, file: !3, line: 55, type: !23, isLocal: true, isDefinition: true)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(name: "symbolic_link", scope: !2, file: !3, line: 58, type: !183, isLocal: true, isDefinition: true)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(name: "relative", scope: !2, file: !3, line: 61, type: !183, isLocal: true, isDefinition: true)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(name: "interactive", scope: !2, file: !3, line: 67, type: !183, isLocal: true, isDefinition: true)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(name: "remove_existing_files", scope: !2, file: !3, line: 70, type: !183, isLocal: true, isDefinition: true)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(name: "verbose", scope: !2, file: !3, line: 73, type: !183, isLocal: true, isDefinition: true)
!312 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(name: "beware_hard_dir_link", scope: !2, file: !3, line: 82, type: !183, isLocal: true, isDefinition: true)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(name: "dest_set", scope: !2, file: !3, line: 94, type: !317, isLocal: true, isDefinition: true)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !168, line: 69, baseType: !172)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 99, type: !321, isLocal: true, isDefinition: true)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 4096, elements: !322)
!322 = !{!323}
!323 = !DISubrange(count: 16)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(name: "logical", scope: !2, file: !3, line: 64, type: !183, isLocal: true, isDefinition: true)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "dereference_dest_dir_symlinks", scope: !2, file: !3, line: 88, type: !183, isLocal: true, isDefinition: true)
!328 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!329 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!330 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!331 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!332 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!333 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!334 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(name: "simple_pattern", scope: !337, file: !338, line: 38, type: !358, isLocal: true, isDefinition: true)
!337 = distinct !DICompileUnit(language: DW_LANG_C99, file: !338, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !339, retainedTypes: !346, globals: !357, nameTableKind: None)
!338 = !DIFile(filename: "src/force-link.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!339 = !{!340, !343}
!340 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !338, line: 39, baseType: !7, size: 32, elements: !341)
!341 = !{!342}
!342 = !DIEnumerator(name: "x_suffix_len", value: 6, isUnsigned: true)
!343 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !338, line: 44, baseType: !7, size: 32, elements: !344)
!344 = !{!345}
!345 = !DIEnumerator(name: "smallsize", value: 256, isUnsigned: true)
!346 = !{!212, !347, !274, !354, !207, !208, !197}
!347 = !DISubprogram(name: "try_tempname_len", scope: !348, file: !348, line: 62, type: !349, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!348 = !DIFile(filename: "./lib/tempname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!349 = !DISubroutineType(types: !350)
!350 = !{!49, !45, !49, !102, !351, !106}
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{!49, !45, !102}
!354 = !DISubprogram(name: "unlinkat", scope: !209, file: !209, line: 829, type: !355, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!355 = !DISubroutineType(types: !356)
!356 = !{!49, !49, !47, !49}
!357 = !{!335}
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 72, elements: !359)
!359 = !{!360}
!360 = !DISubrange(count: 9)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "Version", scope: !363, file: !364, line: 2, type: !47, isDefinition: true)
!363 = distinct !DICompileUnit(language: DW_LANG_C99, file: !364, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !50, globals: !365, nameTableKind: None)
!364 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!365 = !{!361}
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "simple_backup_suffix", scope: !368, file: !369, line: 82, type: !47, isDefinition: true)
!368 = distinct !DICompileUnit(language: DW_LANG_C99, file: !369, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !370, retainedTypes: !432, globals: !474, nameTableKind: None)
!369 = !DIFile(filename: "lib/backupfile.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!370 = !{!23, !371, !402, !408}
!371 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !372, file: !369, line: 327, baseType: !7, size: 32, elements: !400)
!372 = distinct !DISubprogram(name: "backupfile_internal", scope: !369, file: !369, line: 314, type: !373, scopeLine: 316, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !368, retainedNodes: !375)
!373 = !DISubroutineType(types: !374)
!374 = !{!45, !49, !47, !23, !183}
!375 = !{!376, !377, !378, !379, !380, !382, !383, !384, !385, !389, !390, !395, !396, !397, !399}
!376 = !DILocalVariable(name: "dir_fd", arg: 1, scope: !372, file: !369, line: 314, type: !49)
!377 = !DILocalVariable(name: "file", arg: 2, scope: !372, file: !369, line: 314, type: !47)
!378 = !DILocalVariable(name: "backup_type", arg: 3, scope: !372, file: !369, line: 315, type: !23)
!379 = !DILocalVariable(name: "rename", arg: 4, scope: !372, file: !369, line: 315, type: !183)
!380 = !DILocalVariable(name: "base_offset", scope: !372, file: !369, line: 317, type: !381)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !105, line: 35, baseType: !80)
!382 = !DILocalVariable(name: "filelen", scope: !372, file: !369, line: 318, type: !104)
!383 = !DILocalVariable(name: "simple_backup_suffix_size", scope: !372, file: !369, line: 325, type: !104)
!384 = !DILocalVariable(name: "backup_suffix_size_guess", scope: !372, file: !369, line: 326, type: !104)
!385 = !DILocalVariable(name: "ssize", scope: !372, file: !369, line: 331, type: !386)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !387, line: 108, baseType: !388)
!387 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !79, line: 193, baseType: !80)
!389 = !DILocalVariable(name: "s", scope: !372, file: !369, line: 332, type: !45)
!390 = !DILocalVariable(name: "dirp", scope: !372, file: !369, line: 336, type: !391)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !393, line: 127, baseType: !394)
!393 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!394 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !393, line: 127, flags: DIFlagFwdDecl)
!395 = !DILocalVariable(name: "sdir", scope: !372, file: !369, line: 337, type: !49)
!396 = !DILocalVariable(name: "base_max", scope: !372, file: !369, line: 338, type: !104)
!397 = !DILocalVariable(name: "flags", scope: !398, file: !369, line: 380, type: !7)
!398 = distinct !DILexicalBlock(scope: !372, file: !369, line: 340, column: 5)
!399 = !DILocalVariable(name: "e", scope: !398, file: !369, line: 383, type: !49)
!400 = !{!401}
!401 = !DIEnumerator(name: "GUESS", value: 9, isUnsigned: true)
!402 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "numbered_backup_result", file: !369, line: 172, baseType: !7, size: 32, elements: !403)
!403 = !{!404, !405, !406, !407}
!404 = !DIEnumerator(name: "BACKUP_IS_SAME_LENGTH", value: 0, isUnsigned: true)
!405 = !DIEnumerator(name: "BACKUP_IS_LONGER", value: 1, isUnsigned: true)
!406 = !DIEnumerator(name: "BACKUP_IS_NEW", value: 2, isUnsigned: true)
!407 = !DIEnumerator(name: "BACKUP_NOMEM", value: 3, isUnsigned: true)
!408 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !409, line: 24, baseType: !7, size: 32, elements: !410)
!409 = !DIFile(filename: "/usr/include/bits/confname.h", directory: "")
!410 = !{!411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431}
!411 = !DIEnumerator(name: "_PC_LINK_MAX", value: 0, isUnsigned: true)
!412 = !DIEnumerator(name: "_PC_MAX_CANON", value: 1, isUnsigned: true)
!413 = !DIEnumerator(name: "_PC_MAX_INPUT", value: 2, isUnsigned: true)
!414 = !DIEnumerator(name: "_PC_NAME_MAX", value: 3, isUnsigned: true)
!415 = !DIEnumerator(name: "_PC_PATH_MAX", value: 4, isUnsigned: true)
!416 = !DIEnumerator(name: "_PC_PIPE_BUF", value: 5, isUnsigned: true)
!417 = !DIEnumerator(name: "_PC_CHOWN_RESTRICTED", value: 6, isUnsigned: true)
!418 = !DIEnumerator(name: "_PC_NO_TRUNC", value: 7, isUnsigned: true)
!419 = !DIEnumerator(name: "_PC_VDISABLE", value: 8, isUnsigned: true)
!420 = !DIEnumerator(name: "_PC_SYNC_IO", value: 9, isUnsigned: true)
!421 = !DIEnumerator(name: "_PC_ASYNC_IO", value: 10, isUnsigned: true)
!422 = !DIEnumerator(name: "_PC_PRIO_IO", value: 11, isUnsigned: true)
!423 = !DIEnumerator(name: "_PC_SOCK_MAXBUF", value: 12, isUnsigned: true)
!424 = !DIEnumerator(name: "_PC_FILESIZEBITS", value: 13, isUnsigned: true)
!425 = !DIEnumerator(name: "_PC_REC_INCR_XFER_SIZE", value: 14, isUnsigned: true)
!426 = !DIEnumerator(name: "_PC_REC_MAX_XFER_SIZE", value: 15, isUnsigned: true)
!427 = !DIEnumerator(name: "_PC_REC_MIN_XFER_SIZE", value: 16, isUnsigned: true)
!428 = !DIEnumerator(name: "_PC_REC_XFER_ALIGN", value: 17, isUnsigned: true)
!429 = !DIEnumerator(name: "_PC_ALLOC_SIZE_MIN", value: 18, isUnsigned: true)
!430 = !DIEnumerator(name: "_PC_SYMLINK_MAX", value: 19, isUnsigned: true)
!431 = !DIEnumerator(name: "_PC_2_SYMLINKS", value: 20, isUnsigned: true)
!432 = !{!433, !197, !434, !207, !438, !442, !445, !448, !452, !102, !7, !104, !468, !471}
!433 = !DISubprogram(name: "getenv", scope: !127, file: !127, line: 634, type: !124, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!434 = !DISubprogram(name: "closedir", scope: !393, file: !393, line: 149, type: !435, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!435 = !DISubroutineType(types: !436)
!436 = !{!49, !437}
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!438 = !DISubprogram(name: "renameatu", scope: !439, file: !439, line: 28, type: !440, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!439 = !DIFile(filename: "./lib/renameatu.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!440 = !DISubroutineType(types: !441)
!441 = !{!49, !49, !47, !49, !47, !7}
!442 = !DISubprogram(name: "base_len", scope: !198, file: !198, line: 44, type: !443, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!443 = !DISubroutineType(types: !444)
!444 = !{!106, !47}
!445 = !DISubprogram(name: "rewinddir", scope: !393, file: !393, line: 209, type: !446, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!446 = !DISubroutineType(types: !447)
!447 = !{null, !437}
!448 = !DISubprogram(name: "opendirat", scope: !449, file: !449, line: 2, type: !450, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!449 = !DIFile(filename: "./lib/opendirat.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!450 = !DISubroutineType(types: !451)
!451 = !{!437, !49, !47, !49, !146}
!452 = !DISubprogram(name: "readdir", scope: !393, file: !393, line: 162, type: !453, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!453 = !DISubroutineType(types: !454)
!454 = !{!455, !437}
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !457, line: 22, size: 2240, elements: !458)
!457 = !DIFile(filename: "/usr/include/bits/dirent.h", directory: "")
!458 = !{!459, !460, !461, !462, !464}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !456, file: !457, line: 25, baseType: !232, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !456, file: !457, line: 26, baseType: !78, size: 64, offset: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !456, file: !457, line: 31, baseType: !82, size: 16, offset: 128)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !456, file: !457, line: 32, baseType: !463, size: 8, offset: 144)
!463 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !456, file: !457, line: 33, baseType: !465, size: 2048, offset: 152)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 2048, elements: !466)
!466 = !{!467}
!467 = !DISubrange(count: 256)
!468 = !DISubprogram(name: "pathconf", scope: !209, file: !209, line: 612, type: !469, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!469 = !DISubroutineType(types: !470)
!470 = !{!80, !47, !49}
!471 = !DISubprogram(name: "fpathconf", scope: !209, file: !209, line: 616, type: !472, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!472 = !DISubroutineType(types: !473)
!473 = !{!80, !49, !49}
!474 = !{!366}
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(name: "backup_args", scope: !477, file: !478, line: 42, type: !490, isLocal: true, isDefinition: true)
!477 = distinct !DICompileUnit(language: DW_LANG_C99, file: !478, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !479, retainedTypes: !480, globals: !483, nameTableKind: None)
!478 = !DIFile(filename: "lib/backup-find.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!479 = !{!23}
!480 = !{!481, !195, !187, !433}
!481 = !DISubprogram(name: "backupfile_internal", scope: !482, file: !482, line: 3, type: !373, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!482 = !DIFile(filename: "./lib/backup-internal.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!483 = !{!484, !475}
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(name: "backup_types", scope: !477, file: !478, line: 53, type: !486, isLocal: true, isDefinition: true)
!486 = !DICompositeType(tag: DW_TAG_array_type, baseType: !487, size: 256, elements: !488)
!487 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!488 = !{!489}
!489 = !DISubrange(count: 8)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !491, size: 576, elements: !359)
!491 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !47)
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(name: "file_name", scope: !494, file: !495, line: 37, type: !47, isLocal: true, isDefinition: true)
!494 = distinct !DICompileUnit(language: DW_LANG_C99, file: !495, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !50, retainedTypes: !496, globals: !545, nameTableKind: None)
!495 = !DIFile(filename: "lib/closein.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!496 = !{!497, !533, !537, !540, !41, !542, !148, !543}
!497 = !DISubprogram(name: "freadahead", scope: !498, file: !498, line: 41, type: !499, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!498 = !DIFile(filename: "./lib/freadahead.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!499 = !DISubroutineType(types: !500)
!500 = !{!106, !501}
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !57, line: 49, size: 1728, elements: !503)
!503 = !{!504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !502, file: !57, line: 51, baseType: !49, size: 32)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !502, file: !57, line: 54, baseType: !45, size: 64, offset: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !502, file: !57, line: 55, baseType: !45, size: 64, offset: 128)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !502, file: !57, line: 56, baseType: !45, size: 64, offset: 192)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !502, file: !57, line: 57, baseType: !45, size: 64, offset: 256)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !502, file: !57, line: 58, baseType: !45, size: 64, offset: 320)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !502, file: !57, line: 59, baseType: !45, size: 64, offset: 384)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !502, file: !57, line: 60, baseType: !45, size: 64, offset: 448)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !502, file: !57, line: 61, baseType: !45, size: 64, offset: 512)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !502, file: !57, line: 64, baseType: !45, size: 64, offset: 576)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !502, file: !57, line: 65, baseType: !45, size: 64, offset: 640)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !502, file: !57, line: 66, baseType: !45, size: 64, offset: 704)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !502, file: !57, line: 68, baseType: !72, size: 64, offset: 768)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !502, file: !57, line: 70, baseType: !501, size: 64, offset: 832)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !502, file: !57, line: 72, baseType: !49, size: 32, offset: 896)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !502, file: !57, line: 73, baseType: !49, size: 32, offset: 928)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !502, file: !57, line: 74, baseType: !78, size: 64, offset: 960)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !502, file: !57, line: 77, baseType: !82, size: 16, offset: 1024)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !502, file: !57, line: 78, baseType: !84, size: 8, offset: 1040)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !502, file: !57, line: 79, baseType: !86, size: 8, offset: 1048)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !502, file: !57, line: 81, baseType: !90, size: 64, offset: 1088)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !502, file: !57, line: 89, baseType: !93, size: 64, offset: 1152)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !502, file: !57, line: 91, baseType: !95, size: 64, offset: 1216)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !502, file: !57, line: 92, baseType: !98, size: 64, offset: 1280)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !502, file: !57, line: 93, baseType: !501, size: 64, offset: 1344)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !502, file: !57, line: 94, baseType: !102, size: 64, offset: 1408)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !502, file: !57, line: 95, baseType: !104, size: 64, offset: 1472)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !502, file: !57, line: 96, baseType: !49, size: 32, offset: 1536)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !502, file: !57, line: 98, baseType: !109, size: 160, offset: 1568)
!533 = !DISubprogram(name: "rpl_fseeko", scope: !534, file: !534, line: 1034, type: !535, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!534 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!535 = !DISubroutineType(types: !536)
!536 = !{!49, !501, !80, !49}
!537 = !DISubprogram(name: "rpl_fflush", scope: !534, file: !534, line: 718, type: !538, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!538 = !DISubroutineType(types: !539)
!539 = !{!49, !501}
!540 = !DISubprogram(name: "close_stream", scope: !541, file: !541, line: 2, type: !538, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!541 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!542 = !DISubprogram(name: "quotearg_colon", scope: !6, file: !6, line: 391, type: !124, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!543 = !DISubprogram(name: "close_stdout", scope: !544, file: !544, line: 30, type: !131, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!544 = !DIFile(filename: "./lib/closeout.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!545 = !{!492}
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(name: "file_name", scope: !548, file: !549, line: 46, type: !47, isLocal: true, isDefinition: true)
!548 = distinct !DICompileUnit(language: DW_LANG_C99, file: !549, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !50, retainedTypes: !550, globals: !586, nameTableKind: None)
!549 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!550 = !{!551, !41, !542, !148}
!551 = !DISubprogram(name: "close_stream", scope: !541, file: !541, line: 2, type: !552, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!552 = !DISubroutineType(types: !553)
!553 = !{!49, !554}
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !57, line: 49, size: 1728, elements: !556)
!556 = !{!557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !555, file: !57, line: 51, baseType: !49, size: 32)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !555, file: !57, line: 54, baseType: !45, size: 64, offset: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !555, file: !57, line: 55, baseType: !45, size: 64, offset: 128)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !555, file: !57, line: 56, baseType: !45, size: 64, offset: 192)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !555, file: !57, line: 57, baseType: !45, size: 64, offset: 256)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !555, file: !57, line: 58, baseType: !45, size: 64, offset: 320)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !555, file: !57, line: 59, baseType: !45, size: 64, offset: 384)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !555, file: !57, line: 60, baseType: !45, size: 64, offset: 448)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !555, file: !57, line: 61, baseType: !45, size: 64, offset: 512)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !555, file: !57, line: 64, baseType: !45, size: 64, offset: 576)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !555, file: !57, line: 65, baseType: !45, size: 64, offset: 640)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !555, file: !57, line: 66, baseType: !45, size: 64, offset: 704)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !555, file: !57, line: 68, baseType: !72, size: 64, offset: 768)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !555, file: !57, line: 70, baseType: !554, size: 64, offset: 832)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !555, file: !57, line: 72, baseType: !49, size: 32, offset: 896)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !555, file: !57, line: 73, baseType: !49, size: 32, offset: 928)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !555, file: !57, line: 74, baseType: !78, size: 64, offset: 960)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !555, file: !57, line: 77, baseType: !82, size: 16, offset: 1024)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !555, file: !57, line: 78, baseType: !84, size: 8, offset: 1040)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !555, file: !57, line: 79, baseType: !86, size: 8, offset: 1048)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !555, file: !57, line: 81, baseType: !90, size: 64, offset: 1088)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !555, file: !57, line: 89, baseType: !93, size: 64, offset: 1152)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !555, file: !57, line: 91, baseType: !95, size: 64, offset: 1216)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !555, file: !57, line: 92, baseType: !98, size: 64, offset: 1280)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !555, file: !57, line: 93, baseType: !554, size: 64, offset: 1344)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !555, file: !57, line: 94, baseType: !102, size: 64, offset: 1408)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !555, file: !57, line: 95, baseType: !104, size: 64, offset: 1472)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !555, file: !57, line: 96, baseType: !49, size: 32, offset: 1536)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !555, file: !57, line: 98, baseType: !109, size: 160, offset: 1568)
!586 = !{!546, !587}
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !548, file: !549, line: 56, type: !183, isLocal: true, isDefinition: true)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(name: "exit_failure", scope: !591, file: !592, line: 24, type: !594, isDefinition: true)
!591 = distinct !DICompileUnit(language: DW_LANG_C99, file: !592, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !50, globals: !593, nameTableKind: None)
!592 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!593 = !{!589}
!594 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !49)
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(name: "default_tuning", scope: !597, file: !598, line: 130, type: !605, isLocal: true, isDefinition: true)
!597 = distinct !DICompileUnit(language: DW_LANG_C99, file: !598, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !50, retainedTypes: !599, globals: !604, nameTableKind: None)
!598 = !DIFile(filename: "lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!599 = !{!106, !102, !600, !207, !104}
!600 = !DISubprogram(name: "rpl_calloc", scope: !601, file: !601, line: 688, type: !602, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!601 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!602 = !DISubroutineType(types: !603)
!603 = !{!102, !106, !106}
!604 = !{!595}
!605 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !606)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !168, line: 65, baseType: !607)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !168, line: 53, size: 160, elements: !608)
!608 = !{!609, !610, !611, !612, !613}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !607, file: !168, line: 58, baseType: !178, size: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !607, file: !168, line: 59, baseType: !178, size: 32, offset: 32)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !607, file: !168, line: 60, baseType: !178, size: 32, offset: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !607, file: !168, line: 61, baseType: !178, size: 32, offset: 96)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !607, file: !168, line: 62, baseType: !183, size: 8, offset: 128)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(name: "program_name", scope: !616, file: !617, line: 33, type: !47, isDefinition: true)
!616 = distinct !DICompileUnit(language: DW_LANG_C99, file: !617, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !50, retainedTypes: !618, globals: !654, nameTableKind: None)
!617 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!618 = !{!102, !619, !45}
!619 = !DISubprogram(name: "fputs", scope: !52, file: !52, line: 626, type: !620, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!620 = !DISubroutineType(types: !621)
!621 = !{!49, !47, !622}
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !57, line: 49, size: 1728, elements: !624)
!624 = !{!625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !623, file: !57, line: 51, baseType: !49, size: 32)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !623, file: !57, line: 54, baseType: !45, size: 64, offset: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !623, file: !57, line: 55, baseType: !45, size: 64, offset: 128)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !623, file: !57, line: 56, baseType: !45, size: 64, offset: 192)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !623, file: !57, line: 57, baseType: !45, size: 64, offset: 256)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !623, file: !57, line: 58, baseType: !45, size: 64, offset: 320)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !623, file: !57, line: 59, baseType: !45, size: 64, offset: 384)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !623, file: !57, line: 60, baseType: !45, size: 64, offset: 448)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !623, file: !57, line: 61, baseType: !45, size: 64, offset: 512)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !623, file: !57, line: 64, baseType: !45, size: 64, offset: 576)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !623, file: !57, line: 65, baseType: !45, size: 64, offset: 640)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !623, file: !57, line: 66, baseType: !45, size: 64, offset: 704)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !623, file: !57, line: 68, baseType: !72, size: 64, offset: 768)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !623, file: !57, line: 70, baseType: !622, size: 64, offset: 832)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !623, file: !57, line: 72, baseType: !49, size: 32, offset: 896)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !623, file: !57, line: 73, baseType: !49, size: 32, offset: 928)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !623, file: !57, line: 74, baseType: !78, size: 64, offset: 960)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !623, file: !57, line: 77, baseType: !82, size: 16, offset: 1024)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !623, file: !57, line: 78, baseType: !84, size: 8, offset: 1040)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !623, file: !57, line: 79, baseType: !86, size: 8, offset: 1048)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !623, file: !57, line: 81, baseType: !90, size: 64, offset: 1088)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !623, file: !57, line: 89, baseType: !93, size: 64, offset: 1152)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !623, file: !57, line: 91, baseType: !95, size: 64, offset: 1216)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !623, file: !57, line: 92, baseType: !98, size: 64, offset: 1280)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !623, file: !57, line: 93, baseType: !622, size: 64, offset: 1344)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !623, file: !57, line: 94, baseType: !102, size: 64, offset: 1408)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !623, file: !57, line: 95, baseType: !104, size: 64, offset: 1472)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !623, file: !57, line: 96, baseType: !49, size: 32, offset: 1536)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !623, file: !57, line: 98, baseType: !109, size: 160, offset: 1568)
!654 = !{!614}
!655 = !DIGlobalVariableExpression(var: !656, expr: !DIExpression())
!656 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !657, file: !658, line: 85, type: !763, isDefinition: true)
!657 = distinct !DICompileUnit(language: DW_LANG_C99, file: !658, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !659, retainedTypes: !680, globals: !739, nameTableKind: None)
!658 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!659 = !{!5, !660, !665}
!660 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, baseType: !7, size: 32, elements: !661)
!661 = !{!662, !663, !664}
!662 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!663 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!664 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!665 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !666, line: 46, baseType: !7, size: 32, elements: !667)
!666 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!667 = !{!668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679}
!668 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!669 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!670 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!671 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!672 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!673 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!674 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!675 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!676 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!677 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!678 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!679 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!680 = !{!681, !684, !207, !698, !49, !82, !701, !104, !718, !722, !41, !728, !732, !45, !287, !195, !736}
!681 = !DISubprogram(name: "xmemdup", scope: !196, file: !196, line: 62, type: !682, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!682 = !DISubroutineType(types: !683)
!683 = !{!102, !187, !106}
!684 = !DISubprogram(name: "quotearg_alloc_mem", scope: !6, file: !6, line: 342, type: !685, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!685 = !DISubroutineType(types: !686)
!686 = !{!45, !47, !106, !687, !688}
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !690)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !658, line: 65, size: 448, elements: !691)
!691 = !{!692, !693, !694, !696, !697}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !690, file: !658, line: 68, baseType: !5, size: 32)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !690, file: !658, line: 71, baseType: !49, size: 32, offset: 32)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !690, file: !658, line: 75, baseType: !695, size: 256, offset: 64)
!695 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !488)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !690, file: !658, line: 78, baseType: !47, size: 64, offset: 320)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !690, file: !658, line: 81, baseType: !47, size: 64, offset: 384)
!698 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !6, file: !6, line: 408, type: !699, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!699 = !DISubroutineType(types: !700)
!700 = !{!45, !49, !47, !47, !47, !106}
!701 = !DISubprogram(name: "rpl_mbrtowc", scope: !702, file: !702, line: 717, type: !703, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!702 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!703 = !DISubroutineType(types: !704)
!704 = !{!106, !146, !47, !106, !705}
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !707, line: 13, size: 64, elements: !708)
!707 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!708 = !{!709, !710}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !706, file: !707, line: 15, baseType: !49, size: 32)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !706, file: !707, line: 20, baseType: !711, size: 32, offset: 32)
!711 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !706, file: !707, line: 16, size: 32, elements: !712)
!712 = !{!713, !714}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !711, file: !707, line: 18, baseType: !7, size: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !711, file: !707, line: 19, baseType: !715, size: 32)
!715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 32, elements: !716)
!716 = !{!717}
!717 = !DISubrange(count: 4)
!718 = !DISubprogram(name: "iswprint", scope: !719, file: !719, line: 120, type: !720, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!719 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!720 = !DISubroutineType(types: !721)
!721 = !{!49, !7}
!722 = !DISubprogram(name: "mbsinit", scope: !723, file: !723, line: 292, type: !724, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!723 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!724 = !DISubroutineType(types: !725)
!725 = !{!49, !726}
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !706)
!728 = !DISubprogram(name: "locale_charset", scope: !729, file: !729, line: 35, type: !730, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!729 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!730 = !DISubroutineType(types: !731)
!731 = !{!47}
!732 = !DISubprogram(name: "c_strcasecmp", scope: !733, file: !733, line: 42, type: !734, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!733 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!734 = !DISubroutineType(types: !735)
!735 = !{!49, !47, !47}
!736 = !DISubprogram(name: "xrealloc", scope: !196, file: !196, line: 59, type: !737, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!737 = !DISubroutineType(types: !738)
!738 = !{!102, !102, !106}
!739 = !{!655, !740, !746, !748, !750, !752, !759, !761}
!740 = !DIGlobalVariableExpression(var: !741, expr: !DIExpression())
!741 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !657, file: !658, line: 101, type: !742, isDefinition: true)
!742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !743, size: 320, elements: !744)
!743 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!744 = !{!745}
!745 = !DISubrange(count: 10)
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !657, file: !658, line: 1052, type: !690, isDefinition: true)
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !657, file: !658, line: 116, type: !690, isLocal: true, isDefinition: true)
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(name: "slot0", scope: !657, file: !658, line: 842, type: !465, isLocal: true, isDefinition: true)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(name: "slotvec", scope: !657, file: !658, line: 845, type: !754, isLocal: true, isDefinition: true)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !658, line: 834, size: 128, elements: !756)
!756 = !{!757, !758}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !755, file: !658, line: 836, baseType: !104, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !755, file: !658, line: 837, baseType: !45, size: 64, offset: 64)
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(name: "nslots", scope: !657, file: !658, line: 843, type: !49, isLocal: true, isDefinition: true)
!761 = !DIGlobalVariableExpression(var: !762, expr: !DIExpression())
!762 = distinct !DIGlobalVariable(name: "slotvec0", scope: !657, file: !658, line: 844, type: !755, isLocal: true, isDefinition: true)
!763 = !DICompositeType(tag: DW_TAG_array_type, baseType: !491, size: 704, elements: !764)
!764 = !{!765}
!765 = !DISubrange(count: 11)
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(name: "letters", scope: !768, file: !769, line: 184, type: !792, isLocal: true, isDefinition: true)
!768 = distinct !DICompileUnit(language: DW_LANG_C99, file: !769, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !50, retainedTypes: !770, globals: !791, nameTableKind: None)
!769 = !DIFile(filename: "lib/tempname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!770 = !{!771, !777, !780, !783, !787}
!771 = !DISubprogram(name: "randint_all_new", scope: !772, file: !772, line: 36, type: !773, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!772 = !DIFile(filename: "./lib/randint.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!773 = !DISubroutineType(types: !774)
!774 = !{!775, !47, !106}
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DICompositeType(tag: DW_TAG_structure_type, name: "randint_source", file: !772, line: 33, flags: DIFlagFwdDecl)
!777 = !DISubprogram(name: "randint_genmax", scope: !772, file: !772, line: 39, type: !778, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!778 = !DISubroutineType(types: !779)
!779 = !{!106, !775, !106}
!780 = !DISubprogram(name: "randint_all_free", scope: !772, file: !772, line: 50, type: !781, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!781 = !DISubroutineType(types: !782)
!782 = !{!49, !775}
!783 = !DISubprogram(name: "open", scope: !784, file: !784, line: 196, type: !785, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!784 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
!785 = !DISubroutineType(types: !786)
!786 = !{!49, !47, !49, null}
!787 = !DISubprogram(name: "mkdir", scope: !788, file: !788, line: 317, type: !789, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!788 = !DIFile(filename: "/usr/include/sys/stat.h", directory: "")
!789 = !DISubroutineType(types: !790)
!790 = !{!49, !47, !7}
!791 = !{!766}
!792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 504, elements: !793)
!793 = !{!794}
!794 = !DISubrange(count: 63)
!795 = !DIGlobalVariableExpression(var: !796, expr: !DIExpression())
!796 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !797, file: !798, line: 26, type: !800, isDefinition: true)
!797 = distinct !DICompileUnit(language: DW_LANG_C99, file: !798, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !50, globals: !799, nameTableKind: None)
!798 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!799 = !{!795}
!800 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 376, elements: !801)
!801 = !{!802}
!802 = !DISubrange(count: 47)
!803 = !DIGlobalVariableExpression(var: !804, expr: !DIExpression())
!804 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !805, file: !806, line: 67, type: !855, isDefinition: true)
!805 = distinct !DICompileUnit(language: DW_LANG_C99, file: !806, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !807, retainedTypes: !808, globals: !854, nameTableKind: None)
!806 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!807 = !{!5}
!808 = !{!102, !47, !41, !262, !809, !148, !813, !848, !851, !463}
!809 = !DISubprogram(name: "quote_n", scope: !810, file: !810, line: 40, type: !811, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!810 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!811 = !DISubroutineType(types: !812)
!812 = !{!47, !49, !47}
!813 = !DISubprogram(name: "fputs_unlocked", scope: !52, file: !52, line: 662, type: !814, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!814 = !DISubroutineType(types: !815)
!815 = !{!49, !47, !816}
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !57, line: 49, size: 1728, elements: !818)
!818 = !{!819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !817, file: !57, line: 51, baseType: !49, size: 32)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !817, file: !57, line: 54, baseType: !45, size: 64, offset: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !817, file: !57, line: 55, baseType: !45, size: 64, offset: 128)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !817, file: !57, line: 56, baseType: !45, size: 64, offset: 192)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !817, file: !57, line: 57, baseType: !45, size: 64, offset: 256)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !817, file: !57, line: 58, baseType: !45, size: 64, offset: 320)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !817, file: !57, line: 59, baseType: !45, size: 64, offset: 384)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !817, file: !57, line: 60, baseType: !45, size: 64, offset: 448)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !817, file: !57, line: 61, baseType: !45, size: 64, offset: 512)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !817, file: !57, line: 64, baseType: !45, size: 64, offset: 576)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !817, file: !57, line: 65, baseType: !45, size: 64, offset: 640)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !817, file: !57, line: 66, baseType: !45, size: 64, offset: 704)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !817, file: !57, line: 68, baseType: !72, size: 64, offset: 768)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !817, file: !57, line: 70, baseType: !816, size: 64, offset: 832)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !817, file: !57, line: 72, baseType: !49, size: 32, offset: 896)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !817, file: !57, line: 73, baseType: !49, size: 32, offset: 928)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !817, file: !57, line: 74, baseType: !78, size: 64, offset: 960)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !817, file: !57, line: 77, baseType: !82, size: 16, offset: 1024)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !817, file: !57, line: 78, baseType: !84, size: 8, offset: 1040)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !817, file: !57, line: 79, baseType: !86, size: 8, offset: 1048)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !817, file: !57, line: 81, baseType: !90, size: 64, offset: 1088)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !817, file: !57, line: 89, baseType: !93, size: 64, offset: 1152)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !817, file: !57, line: 91, baseType: !95, size: 64, offset: 1216)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !817, file: !57, line: 92, baseType: !98, size: 64, offset: 1280)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !817, file: !57, line: 93, baseType: !816, size: 64, offset: 1344)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !817, file: !57, line: 94, baseType: !102, size: 64, offset: 1408)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !817, file: !57, line: 95, baseType: !104, size: 64, offset: 1472)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !817, file: !57, line: 96, baseType: !49, size: 32, offset: 1536)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !817, file: !57, line: 98, baseType: !109, size: 160, offset: 1568)
!848 = !DISubprogram(name: "quote", scope: !810, file: !810, line: 44, type: !849, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!849 = !DISubroutineType(types: !850)
!850 = !{!47, !47}
!851 = !DISubprogram(name: "usage", scope: !806, file: !806, line: 56, type: !852, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!852 = !DISubroutineType(types: !853)
!853 = !{null, !49}
!854 = !{!803}
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !856, line: 61, baseType: !130)
!856 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!857 = !DIGlobalVariableExpression(var: !858, expr: !DIExpression())
!858 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !859, file: !860, line: 507, type: !49, isLocal: true, isDefinition: true)
!859 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !860, file: !860, line: 488, type: !861, scopeLine: 489, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !863, retainedNodes: !872)
!860 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!861 = !DISubroutineType(types: !862)
!862 = !{!49, !49, !49}
!863 = distinct !DICompileUnit(language: DW_LANG_C99, file: !860, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !50, retainedTypes: !864, globals: !871, nameTableKind: None)
!864 = !{!865, !868}
!865 = !DISubprogram(name: "fcntl", scope: !784, file: !784, line: 176, type: !866, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!866 = !DISubroutineType(types: !867)
!867 = !{!49, !49, !49, null}
!868 = !DISubprogram(name: "close", scope: !209, file: !209, line: 353, type: !869, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!869 = !DISubroutineType(types: !870)
!870 = !{!49, !49}
!871 = !{!857}
!872 = !{!873, !874, !875, !876, !879}
!873 = !DILocalVariable(name: "fd", arg: 1, scope: !859, file: !860, line: 488, type: !49)
!874 = !DILocalVariable(name: "target", arg: 2, scope: !859, file: !860, line: 488, type: !49)
!875 = !DILocalVariable(name: "result", scope: !859, file: !860, line: 490, type: !49)
!876 = !DILocalVariable(name: "flags", scope: !877, file: !860, line: 531, type: !49)
!877 = distinct !DILexicalBlock(scope: !878, file: !860, line: 530, column: 5)
!878 = distinct !DILexicalBlock(scope: !859, file: !860, line: 529, column: 7)
!879 = !DILocalVariable(name: "saved_errno", scope: !880, file: !860, line: 534, type: !49)
!880 = distinct !DILexicalBlock(scope: !881, file: !860, line: 533, column: 9)
!881 = distinct !DILexicalBlock(scope: !877, file: !860, line: 532, column: 11)
!882 = distinct !DICompileUnit(language: DW_LANG_C99, file: !883, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !50, retainedTypes: !884, nameTableKind: None)
!883 = !DIFile(filename: "src/relpath.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!884 = !{!41, !148, !885}
!885 = !DISubprogram(name: "fputs_unlocked", scope: !52, file: !52, line: 662, type: !886, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!886 = !DISubroutineType(types: !887)
!887 = !{!49, !47, !888}
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !57, line: 49, size: 1728, elements: !890)
!890 = !{!891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !889, file: !57, line: 51, baseType: !49, size: 32)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !889, file: !57, line: 54, baseType: !45, size: 64, offset: 64)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !889, file: !57, line: 55, baseType: !45, size: 64, offset: 128)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !889, file: !57, line: 56, baseType: !45, size: 64, offset: 192)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !889, file: !57, line: 57, baseType: !45, size: 64, offset: 256)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !889, file: !57, line: 58, baseType: !45, size: 64, offset: 320)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !889, file: !57, line: 59, baseType: !45, size: 64, offset: 384)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !889, file: !57, line: 60, baseType: !45, size: 64, offset: 448)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !889, file: !57, line: 61, baseType: !45, size: 64, offset: 512)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !889, file: !57, line: 64, baseType: !45, size: 64, offset: 576)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !889, file: !57, line: 65, baseType: !45, size: 64, offset: 640)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !889, file: !57, line: 66, baseType: !45, size: 64, offset: 704)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !889, file: !57, line: 68, baseType: !72, size: 64, offset: 768)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !889, file: !57, line: 70, baseType: !888, size: 64, offset: 832)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !889, file: !57, line: 72, baseType: !49, size: 32, offset: 896)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !889, file: !57, line: 73, baseType: !49, size: 32, offset: 928)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !889, file: !57, line: 74, baseType: !78, size: 64, offset: 960)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !889, file: !57, line: 77, baseType: !82, size: 16, offset: 1024)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !889, file: !57, line: 78, baseType: !84, size: 8, offset: 1040)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !889, file: !57, line: 79, baseType: !86, size: 8, offset: 1048)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !889, file: !57, line: 81, baseType: !90, size: 64, offset: 1088)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !889, file: !57, line: 89, baseType: !93, size: 64, offset: 1152)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !889, file: !57, line: 91, baseType: !95, size: 64, offset: 1216)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !889, file: !57, line: 92, baseType: !98, size: 64, offset: 1280)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !889, file: !57, line: 93, baseType: !888, size: 64, offset: 1344)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !889, file: !57, line: 94, baseType: !102, size: 64, offset: 1408)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !889, file: !57, line: 95, baseType: !104, size: 64, offset: 1472)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !889, file: !57, line: 96, baseType: !49, size: 32, offset: 1536)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !889, file: !57, line: 98, baseType: !109, size: 160, offset: 1568)
!920 = distinct !DICompileUnit(language: DW_LANG_C99, file: !921, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !922, retainedTypes: !923, nameTableKind: None)
!921 = !DIFile(filename: "lib/canonicalize.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!922 = !{!33}
!923 = !{!102, !924, !736, !287, !928, !207, !932, !935, !195, !947, !973}
!924 = !DISubprogram(name: "xgetcwd", scope: !925, file: !925, line: 17, type: !926, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!925 = !DIFile(filename: "./lib/xgetcwd.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!926 = !DISubroutineType(types: !927)
!927 = !{!45}
!928 = !DISubprogram(name: "areadlink_with_size", scope: !929, file: !929, line: 24, type: !930, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!929 = !DIFile(filename: "./lib/areadlink.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!930 = !DISubroutineType(types: !931)
!931 = !{!45, !47, !106}
!932 = !DISubprogram(name: "hash_free", scope: !168, file: !168, line: 96, type: !933, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!933 = !DISubroutineType(types: !934)
!934 = !{null, !171}
!935 = !DISubprogram(name: "hash_initialize", scope: !168, file: !168, line: 89, type: !936, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!936 = !DISubroutineType(types: !937)
!937 = !{!171, !106, !938, !184, !189, !192}
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !940)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !168, line: 53, size: 160, elements: !941)
!941 = !{!942, !943, !944, !945, !946}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !940, file: !168, line: 58, baseType: !178, size: 32)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !940, file: !168, line: 59, baseType: !178, size: 32, offset: 32)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !940, file: !168, line: 60, baseType: !178, size: 32, offset: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !940, file: !168, line: 61, baseType: !178, size: 32, offset: 96)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !940, file: !168, line: 62, baseType: !183, size: 8, offset: 128)
!947 = !DISubprogram(name: "seen_file", scope: !219, file: !219, line: 14, type: !948, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!948 = !DISubroutineType(types: !949)
!949 = !{!183, !222, !47, !950}
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !952)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !227, line: 46, size: 1152, elements: !953)
!953 = !{!954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !970, !971, !972}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !952, file: !227, line: 48, baseType: !230, size: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !952, file: !227, line: 53, baseType: !232, size: 64, offset: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !952, file: !227, line: 61, baseType: !234, size: 64, offset: 128)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !952, file: !227, line: 62, baseType: !236, size: 32, offset: 192)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !952, file: !227, line: 64, baseType: !238, size: 32, offset: 224)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !952, file: !227, line: 65, baseType: !240, size: 32, offset: 256)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !952, file: !227, line: 67, baseType: !49, size: 32, offset: 288)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !952, file: !227, line: 69, baseType: !230, size: 64, offset: 320)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !952, file: !227, line: 74, baseType: !78, size: 64, offset: 384)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !952, file: !227, line: 78, baseType: !245, size: 64, offset: 448)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !952, file: !227, line: 80, baseType: !247, size: 64, offset: 512)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !952, file: !227, line: 91, baseType: !966, size: 128, offset: 576)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !250, line: 10, size: 128, elements: !967)
!967 = !{!968, !969}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !966, file: !250, line: 12, baseType: !253, size: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !966, file: !250, line: 16, baseType: !255, size: 64, offset: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !952, file: !227, line: 92, baseType: !966, size: 128, offset: 704)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !952, file: !227, line: 93, baseType: !966, size: 128, offset: 832)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !952, file: !227, line: 106, baseType: !259, size: 192, offset: 960)
!973 = !DISubprogram(name: "record_file", scope: !219, file: !219, line: 7, type: !974, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!974 = !DISubroutineType(types: !975)
!975 = !{null, !171, !47, !950}
!976 = distinct !DICompileUnit(language: DW_LANG_C99, file: !977, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !50, retainedTypes: !978, nameTableKind: None)
!977 = !DIFile(filename: "lib/dirname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!978 = !{!979, !195}
!979 = !DISubprogram(name: "mdir_name", scope: !198, file: !198, line: 43, type: !124, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !50)
!980 = distinct !DICompileUnit(language: DW_LANG_C99, file: !981, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !50, retainedTypes: !982, nameTableKind: None)
!981 = !DIFile(filename: "lib/dirname-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!982 = !{!197}
