; ModuleID = 'coreutils-8.32/src/ls.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.pending = type { i8*, i8*, i8, %struct.pending* }
%struct.timespec = type { i64, i64 }
%struct.ignore_pattern = type { i8*, %struct.ignore_pattern* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.color_ext_type = type { %struct.bin_str, %struct.bin_str, %struct.color_ext_type* }
%struct.bin_str = type { i64, i8* }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.hash_entry = type { i8*, %struct.hash_entry* }
%struct.obstack = type { i64, %struct._obstack_chunk*, i8*, i8*, i8*, %union.anon, i64, %union.anon.0, %union.anon.1, i8*, i8 }
%struct._obstack_chunk = type { i8*, %struct._obstack_chunk*, [0 x i8] }
%union.anon = type { i64 }

!56 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sort_type", file: !3, line: 477, baseType: !57, size: 32, elements: !58)
!57 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!58 = !{!59, !60, !61, !62, !63, !64, !65}
!59 = !DIEnumerator(name: "sort_none", value: -1)
!60 = !DIEnumerator(name: "sort_name", value: 0)
!61 = !DIEnumerator(name: "sort_extension", value: 1)
!62 = !DIEnumerator(name: "sort_size", value: 2)
!63 = !DIEnumerator(name: "sort_version", value: 3)
!64 = !DIEnumerator(name: "sort_time", value: 4)
!65 = !DIEnumerator(name: "sort_numtypes", value: 5)
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "filetype", file: !3, line: 170, baseType: !6, size: 32, elements: !67)
!67 = !{!68, !69, !70, !71, !72, !73, !74, !75, !76, !77}
!68 = !DIEnumerator(name: "unknown", value: 0, isUnsigned: true)
!69 = !DIEnumerator(name: "fifo", value: 1, isUnsigned: true)
!70 = !DIEnumerator(name: "chardev", value: 2, isUnsigned: true)
!71 = !DIEnumerator(name: "directory", value: 3, isUnsigned: true)
!72 = !DIEnumerator(name: "blockdev", value: 4, isUnsigned: true)
!73 = !DIEnumerator(name: "normal", value: 5, isUnsigned: true)
!74 = !DIEnumerator(name: "symbolic_link", value: 6, isUnsigned: true)
!75 = !DIEnumerator(name: "sock", value: 7, isUnsigned: true)
!76 = !DIEnumerator(name: "whiteout", value: 8, isUnsigned: true)
!77 = !DIEnumerator(name: "arg_directory", value: 9, isUnsigned: true)
!78 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !79, line: 112, baseType: !6, size: 32, elements: !80)
!79 = !DIFile(filename: "src/system.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!80 = !{!81}
!81 = !DIEnumerator(name: "NOT_AN_INODE_NUMBER", value: 0, isUnsigned: true)
!82 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !83, line: 32, baseType: !6, size: 32, elements: !84)
!83 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!84 = !{!85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95}
!85 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!86 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!87 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!88 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!89 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!90 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!91 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!92 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!93 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!94 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!95 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!96 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "acl_type", file: !3, line: 198, baseType: !6, size: 32, elements: !97)
!97 = !{!98, !99, !100}
!98 = !DIEnumerator(name: "ACL_T_NONE", value: 0, isUnsigned: true)
!99 = !DIEnumerator(name: "ACL_T_LSM_CONTEXT_ONLY", value: 1, isUnsigned: true)
!100 = !DIEnumerator(name: "ACL_T_YES", value: 2, isUnsigned: true)
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !102, file: !3, line: 1556, baseType: !6, size: 32, elements: !223)
!102 = distinct !DISubprogram(name: "signal_setup", scope: !3, file: !3, line: 1530, type: !103, scopeLine: 1531, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !106)
!103 = !DISubroutineType(types: !104)
!104 = !{null, !105}
!105 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!106 = !{!107, !108, !109}
!107 = !DILocalVariable(name: "init", arg: 1, scope: !102, file: !3, line: 1530, type: !105)
!108 = !DILocalVariable(name: "j", scope: !102, file: !3, line: 1562, type: !57)
!109 = !DILocalVariable(name: "act", scope: !110, file: !3, line: 1567, type: !112)
!110 = distinct !DILexicalBlock(scope: !111, file: !3, line: 1565, column: 5)
!111 = distinct !DILexicalBlock(scope: !102, file: !3, line: 1564, column: 7)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !113, line: 27, size: 1216, elements: !114)
!113 = !DIFile(filename: "/usr/include/bits/sigaction.h", directory: "")
!114 = !{!115, !208, !218, !219}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !112, file: !113, line: 38, baseType: !116, size: 64)
!116 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !112, file: !113, line: 31, size: 64, elements: !117)
!117 = !{!118, !124}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !116, file: !113, line: 34, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !120, line: 72, baseType: !121)
!120 = !DIFile(filename: "/usr/include/signal.h", directory: "")
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{null, !57}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !116, file: !113, line: 36, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{null, !57, !128, !164}
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !130, line: 124, baseType: !131)
!130 = !DIFile(filename: "/usr/include/bits/types/siginfo_t.h", directory: "")
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !130, line: 36, size: 1024, elements: !132)
!132 = !{!133, !134, !135, !136, !137}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !131, file: !130, line: 38, baseType: !57, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !131, file: !130, line: 40, baseType: !57, size: 32, offset: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !131, file: !130, line: 42, baseType: !57, size: 32, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !131, file: !130, line: 48, baseType: !57, size: 32, offset: 96)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !131, file: !130, line: 123, baseType: !138, size: 896, offset: 128)
!138 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !131, file: !130, line: 51, size: 896, elements: !139)
!139 = !{!140, !144, !152, !165, !171, !181, !197, !202}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !138, file: !130, line: 53, baseType: !141, size: 896)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 896, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 28)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !138, file: !130, line: 60, baseType: !145, size: 64)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !138, file: !130, line: 56, size: 64, elements: !146)
!146 = !{!147, !150}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !145, file: !130, line: 58, baseType: !148, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !149, line: 154, baseType: !57)
!149 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!150 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !145, file: !130, line: 59, baseType: !151, size: 32, offset: 32)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !149, line: 146, baseType: !6)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !138, file: !130, line: 68, baseType: !153, size: 128)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !138, file: !130, line: 63, size: 128, elements: !154)
!154 = !{!155, !156, !157}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !153, file: !130, line: 65, baseType: !57, size: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !153, file: !130, line: 66, baseType: !57, size: 32, offset: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !153, file: !130, line: 67, baseType: !158, size: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigval_t", file: !159, line: 30, baseType: !160)
!159 = !DIFile(filename: "/usr/include/bits/types/__sigval_t.h", directory: "")
!160 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !159, line: 24, size: 64, elements: !161)
!161 = !{!162, !163}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !160, file: !159, line: 26, baseType: !57, size: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !160, file: !159, line: 27, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !138, file: !130, line: 76, baseType: !166, size: 128)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !138, file: !130, line: 71, size: 128, elements: !167)
!167 = !{!168, !169, !170}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !166, file: !130, line: 73, baseType: !148, size: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !166, file: !130, line: 74, baseType: !151, size: 32, offset: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !166, file: !130, line: 75, baseType: !158, size: 64, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !138, file: !130, line: 86, baseType: !172, size: 256)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !138, file: !130, line: 79, size: 256, elements: !173)
!173 = !{!174, !175, !176, !177, !180}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !172, file: !130, line: 81, baseType: !148, size: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !172, file: !130, line: 82, baseType: !151, size: 32, offset: 32)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !172, file: !130, line: 83, baseType: !57, size: 32, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !172, file: !130, line: 84, baseType: !178, size: 64, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !149, line: 156, baseType: !179)
!179 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !172, file: !130, line: 85, baseType: !178, size: 64, offset: 192)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !138, file: !130, line: 105, baseType: !182, size: 256)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !138, file: !130, line: 89, size: 256, elements: !183)
!183 = !{!184, !185, !187}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !182, file: !130, line: 91, baseType: !164, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_lsb", scope: !182, file: !130, line: 93, baseType: !186, size: 16, offset: 64)
!186 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_bounds", scope: !182, file: !130, line: 104, baseType: !188, size: 128, offset: 128)
!188 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !182, file: !130, line: 94, size: 128, elements: !189)
!189 = !{!190, !195}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_bnd", scope: !188, file: !130, line: 101, baseType: !191, size: 128)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !188, file: !130, line: 97, size: 128, elements: !192)
!192 = !{!193, !194}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_lower", scope: !191, file: !130, line: 99, baseType: !164, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_upper", scope: !191, file: !130, line: 100, baseType: !164, size: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_pkey", scope: !188, file: !130, line: 103, baseType: !196, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !149, line: 42, baseType: !6)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !138, file: !130, line: 112, baseType: !198, size: 128)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !138, file: !130, line: 108, size: 128, elements: !199)
!199 = !{!200, !201}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !198, file: !130, line: 110, baseType: !179, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "si_fd", scope: !198, file: !130, line: 111, baseType: !57, size: 32, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !138, file: !130, line: 121, baseType: !203, size: 128)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !138, file: !130, line: 116, size: 128, elements: !204)
!204 = !{!205, !206, !207}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !203, file: !130, line: 118, baseType: !164, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !203, file: !130, line: 119, baseType: !57, size: 32, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !203, file: !130, line: 120, baseType: !6, size: 32, offset: 96)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !112, file: !113, line: 46, baseType: !209, size: 1024, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !210, line: 8, baseType: !211)
!210 = !DIFile(filename: "/usr/include/bits/types/__sigset_t.h", directory: "")
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !210, line: 5, size: 1024, elements: !212)
!212 = !{!213}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !211, file: !210, line: 7, baseType: !214, size: 1024)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 1024, elements: !216)
!215 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!216 = !{!217}
!217 = !DISubrange(count: 16)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !112, file: !113, line: 49, baseType: !57, size: 32, offset: 1088)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !112, file: !113, line: 52, baseType: !220, size: 64, offset: 1152)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{null}
!223 = !{!224}
!224 = !DIEnumerator(name: "nsigs", value: 12, isUnsigned: true)
!225 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "time_type", file: !3, line: 462, baseType: !6, size: 32, elements: !226)
!226 = !{!227, !228, !229, !230, !231}
!227 = !DIEnumerator(name: "time_mtime", value: 0, isUnsigned: true)
!228 = !DIEnumerator(name: "time_ctime", value: 1, isUnsigned: true)
!229 = !DIEnumerator(name: "time_atime", value: 2, isUnsigned: true)
!230 = !DIEnumerator(name: "time_btime", value: 3, isUnsigned: true)
!231 = !DIEnumerator(name: "time_numtypes", value: 4, isUnsigned: true)
!232 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 679, baseType: !6, size: 32, elements: !233)
!233 = !{!234, !235, !236}
!234 = !DIEnumerator(name: "IGNORE_DEFAULT", value: 0, isUnsigned: true)
!235 = !DIEnumerator(name: "IGNORE_DOT_AND_DOTDOT", value: 1, isUnsigned: true)
!236 = !DIEnumerator(name: "IGNORE_MINIMAL", value: 2, isUnsigned: true)
!237 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !238, line: 25, baseType: !6, size: 32, elements: !239)
!238 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!239 = !{!240, !241, !242, !243, !244}
!240 = !DIEnumerator(name: "LONGINT_OK", value: 0, isUnsigned: true)
!241 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1, isUnsigned: true)
!242 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2, isUnsigned: true)
!243 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3, isUnsigned: true)
!244 = !DIEnumerator(name: "LONGINT_INVALID", value: 4, isUnsigned: true)
!245 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !246, line: 43, baseType: !6, size: 32, elements: !247)
!246 = !DIFile(filename: "./lib/human.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!247 = !{!248, !249, !250, !251, !252, !253, !254, !255, !256, !257}
!248 = !DIEnumerator(name: "human_ceiling", value: 0, isUnsigned: true)
!249 = !DIEnumerator(name: "human_round_to_nearest", value: 1, isUnsigned: true)
!250 = !DIEnumerator(name: "human_floor", value: 2, isUnsigned: true)
!251 = !DIEnumerator(name: "human_group_digits", value: 4, isUnsigned: true)
!252 = !DIEnumerator(name: "human_suppress_point_zero", value: 8, isUnsigned: true)
!253 = !DIEnumerator(name: "human_autoscale", value: 16, isUnsigned: true)
!254 = !DIEnumerator(name: "human_base_1024", value: 32, isUnsigned: true)
!255 = !DIEnumerator(name: "human_space_before_unit", value: 64, isUnsigned: true)
!256 = !DIEnumerator(name: "human_SI", value: 128, isUnsigned: true)
!257 = !DIEnumerator(name: "human_B", value: 256, isUnsigned: true)
!258 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "when_type", file: !3, line: 576, baseType: !6, size: 32, elements: !259)
!259 = !{!260, !261, !262}
!260 = !DIEnumerator(name: "when_never", value: 0, isUnsigned: true)
!261 = !DIEnumerator(name: "when_always", value: 1, isUnsigned: true)
!262 = !DIEnumerator(name: "when_if_tty", value: 2, isUnsigned: true)
!263 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "time_style", file: !3, line: 439, baseType: !6, size: 32, elements: !264)
!264 = !{!265, !266, !267, !268}
!265 = !DIEnumerator(name: "full_iso_time_style", value: 0, isUnsigned: true)
!266 = !DIEnumerator(name: "long_iso_time_style", value: 1, isUnsigned: true)
!267 = !DIEnumerator(name: "iso_time_style", value: 2, isUnsigned: true)
!268 = !DIEnumerator(name: "locale_time_style", value: 3, isUnsigned: true)
!269 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 1281, baseType: !6, size: 32, elements: !270)
!270 = !{!271}
!271 = !DIEnumerator(name: "ABFORMAT_SIZE", value: 128, isUnsigned: true)
!272 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 1278, baseType: !6, size: 32, elements: !273)
!273 = !{!274}
!274 = !DIEnumerator(name: "MAX_MON_WIDTH", value: 12, isUnsigned: true)
!275 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !276, line: 41, baseType: !6, size: 32, elements: !277)
!276 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!277 = !{!278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660}
!278 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!279 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!280 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!281 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!282 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!283 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!284 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!285 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!286 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!287 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!288 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!289 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!290 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!291 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!292 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!293 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!294 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!295 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!296 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!297 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!298 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!299 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!300 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!301 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!302 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!303 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!304 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!305 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!306 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!307 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!308 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!309 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!310 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!311 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!312 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!313 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!314 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!315 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!316 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!317 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!318 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!319 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!320 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!321 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!322 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!323 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!324 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!325 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!326 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!327 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!328 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!329 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!330 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!331 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!332 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!333 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!334 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!335 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!336 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!337 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!338 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!339 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!340 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!341 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!342 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!343 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!344 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!345 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!346 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!347 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!348 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!349 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!350 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!351 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!352 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!353 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!354 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!355 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!356 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!357 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!358 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!359 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!360 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!361 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!362 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!363 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!364 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!365 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!366 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!367 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!368 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!369 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!370 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!371 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!372 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!373 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!374 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!375 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!376 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!377 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!378 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!379 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!380 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!381 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!382 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!383 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!384 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!385 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!386 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!387 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!388 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!389 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!390 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!391 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!392 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!393 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!394 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!395 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!396 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!397 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!398 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!399 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!400 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!401 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!402 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!403 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!404 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!405 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!406 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!407 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!408 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!409 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!410 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!411 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!412 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!413 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!414 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!415 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!416 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!417 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!418 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!419 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!420 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!421 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!422 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!423 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!424 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!425 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!426 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!427 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!428 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!429 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!430 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!431 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!432 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!433 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!434 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!435 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!436 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!437 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!438 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!439 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!440 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!441 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!442 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!443 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!444 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!445 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!446 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!447 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!448 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!449 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!450 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!451 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!452 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!453 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!454 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!455 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!456 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!457 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!458 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!459 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!460 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!461 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!462 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!463 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!464 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!465 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!466 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!467 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!468 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!469 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!470 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!471 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!472 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!473 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!474 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!475 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!476 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!477 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!478 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!479 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!480 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!481 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!482 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!483 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!484 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!485 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!486 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!487 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!488 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!489 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!490 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!491 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!492 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!493 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!494 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!495 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!496 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!497 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!498 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!499 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!500 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!501 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!502 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!503 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!504 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!505 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!506 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!507 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!508 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!509 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!510 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!511 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!512 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!513 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!514 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!515 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!516 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!517 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!518 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!519 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!520 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!521 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!522 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!523 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!524 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!525 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!526 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!527 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!528 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!529 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!530 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!531 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!532 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!533 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!534 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!535 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!536 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!537 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!538 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!539 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!540 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!541 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!542 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!543 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!544 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!545 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!546 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!547 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!548 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!549 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!550 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!551 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!552 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!553 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!554 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!555 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!556 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!557 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!558 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!559 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!560 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!561 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!562 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!563 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!564 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!565 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!566 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!567 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!568 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!569 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!570 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!571 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!572 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!573 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!574 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!575 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!576 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!577 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!578 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!579 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!580 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!581 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!582 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!583 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!584 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!585 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!586 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!587 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!588 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!589 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!590 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!591 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!592 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!593 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!594 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!595 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!596 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!597 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!598 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!599 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!600 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!601 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!602 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!603 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!604 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!605 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!606 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!607 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!608 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!609 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!610 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!611 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!612 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!613 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!614 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!615 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!616 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!617 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!618 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!619 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!620 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!621 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!622 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!623 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!624 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!625 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!626 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!627 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!628 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!629 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!630 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!631 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!632 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!633 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!634 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!635 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!636 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!637 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!661 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !662, line: 19, baseType: !6, size: 32, elements: !663)
!662 = !DIFile(filename: "./lib/mbsalign.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!663 = !{!664, !665, !666}
!664 = !DIEnumerator(name: "MBS_ALIGN_LEFT", value: 0, isUnsigned: true)
!665 = !DIEnumerator(name: "MBS_ALIGN_RIGHT", value: 1, isUnsigned: true)
!666 = !DIEnumerator(name: "MBS_ALIGN_CENTER", value: 2, isUnsigned: true)
!667 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !668, line: 46, baseType: !6, size: 32, elements: !669)
!668 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!669 = !{!670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681}
!670 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!671 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!672 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!673 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!674 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!675 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!676 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!677 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!678 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!679 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!680 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!681 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!682 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "parse_state", file: !3, line: 2648, baseType: !6, size: 32, elements: !683)
!683 = !{!684, !685, !686, !687, !688, !689}
!684 = !DIEnumerator(name: "PS_START", value: 1, isUnsigned: true)
!685 = !DIEnumerator(name: "PS_2", value: 2, isUnsigned: true)
!686 = !DIEnumerator(name: "PS_3", value: 3, isUnsigned: true)
!687 = !DIEnumerator(name: "PS_4", value: 4, isUnsigned: true)
!688 = !DIEnumerator(name: "PS_DONE", value: 5, isUnsigned: true)
!689 = !DIEnumerator(name: "PS_FAIL", value: 6, isUnsigned: true)
!690 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !691, file: !3, line: 2459, baseType: !6, size: 32, elements: !713)
!691 = distinct !DISubprogram(name: "get_funky_string", scope: !3, file: !3, line: 2454, type: !692, scopeLine: 2456, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !703)
!692 = !DISubroutineType(types: !693)
!693 = !{!105, !694, !697, !105, !700}
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !696)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !702, line: 46, baseType: !215)
!702 = !DIFile(filename: "/usr/lib/clang/12.0.1/include/stddef.h", directory: "")
!703 = !{!704, !705, !706, !707, !708, !709, !710, !711, !712}
!704 = !DILocalVariable(name: "dest", arg: 1, scope: !691, file: !3, line: 2454, type: !694)
!705 = !DILocalVariable(name: "src", arg: 2, scope: !691, file: !3, line: 2454, type: !697)
!706 = !DILocalVariable(name: "equals_end", arg: 3, scope: !691, file: !3, line: 2454, type: !105)
!707 = !DILocalVariable(name: "output_count", arg: 4, scope: !691, file: !3, line: 2455, type: !700)
!708 = !DILocalVariable(name: "num", scope: !691, file: !3, line: 2457, type: !696)
!709 = !DILocalVariable(name: "count", scope: !691, file: !3, line: 2458, type: !701)
!710 = !DILocalVariable(name: "state", scope: !691, file: !3, line: 2461, type: !690)
!711 = !DILocalVariable(name: "p", scope: !691, file: !3, line: 2462, type: !698)
!712 = !DILocalVariable(name: "q", scope: !691, file: !3, line: 2463, type: !695)
!713 = !{!714, !715, !716, !717, !718, !719, !720}
!714 = !DIEnumerator(name: "ST_GND", value: 0, isUnsigned: true)
!715 = !DIEnumerator(name: "ST_BACKSLASH", value: 1, isUnsigned: true)
!716 = !DIEnumerator(name: "ST_OCTAL", value: 2, isUnsigned: true)
!717 = !DIEnumerator(name: "ST_HEX", value: 3, isUnsigned: true)
!718 = !DIEnumerator(name: "ST_CARET", value: 4, isUnsigned: true)
!719 = !DIEnumerator(name: "ST_END", value: 5, isUnsigned: true)
!720 = !DIEnumerator(name: "ST_ERROR", value: 6, isUnsigned: true)
!721 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "canonicalize_mode_t", file: !722, line: 28, baseType: !6, size: 32, elements: !723)
!722 = !DIFile(filename: "./lib/canonicalize.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!723 = !{!724, !725, !726, !727}
!724 = !DIEnumerator(name: "CAN_EXISTING", value: 0, isUnsigned: true)
!725 = !DIEnumerator(name: "CAN_ALL_BUT_LAST", value: 1, isUnsigned: true)
!726 = !DIEnumerator(name: "CAN_MISSING", value: 2, isUnsigned: true)
!727 = !DIEnumerator(name: "CAN_NOLINKS", value: 4, isUnsigned: true)
!728 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !729, line: 42, baseType: !6, size: 32, elements: !730)
!729 = !DIFile(filename: "./lib/timespec.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!730 = !{!731}
!731 = !DIEnumerator(name: "TIMESPEC_HZ", value: 1000000000, isUnsigned: true)
!732 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 758, baseType: !6, size: 32, elements: !733)
!733 = !{!734}
!734 = !DIEnumerator(name: "TIME_STAMP_LEN_MAXIMUM", value: 1000, isUnsigned: true)
!735 = !{!736, !164, !739, !701, !742, !698, !119, !700, !695, !215, !743, !57, !745, !746, !747, !750, !751}
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !737, line: 7, baseType: !738)
!737 = !DIFile(filename: "/usr/include/bits/types/time_t.h", directory: "")
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !149, line: 160, baseType: !179)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !740, line: 102, baseType: !741)
!740 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !149, line: 73, baseType: !215)
!742 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!745 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !149, line: 145, baseType: !215)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !748, line: 85, baseType: !749)
!748 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !149, line: 152, baseType: !179)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !753)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fileinfo", file: !3, line: 205, size: 1600, elements: !754)
!754 = !{!755, !756, !757, !758, !792, !793, !795, !796, !797, !798, !799, !800}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !753, file: !3, line: 208, baseType: !695, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "linkname", scope: !753, file: !3, line: 211, baseType: !695, size: 64, offset: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "absolute_name", scope: !753, file: !3, line: 214, baseType: !695, size: 64, offset: 128)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "stat", scope: !753, file: !3, line: 216, baseType: !759, size: 1152, offset: 192)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !760, line: 26, size: 1152, elements: !761)
!760 = !DIFile(filename: "/usr/include/bits/struct_stat.h", directory: "")
!761 = !{!762, !763, !765, !767, !769, !770, !772, !773, !774, !775, !777, !779, !786, !787, !788}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !759, file: !760, line: 28, baseType: !746, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !759, file: !760, line: 33, baseType: !764, size: 64, offset: 64)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !149, line: 148, baseType: !215)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !759, file: !760, line: 41, baseType: !766, size: 64, offset: 128)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !149, line: 151, baseType: !215)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !759, file: !760, line: 42, baseType: !768, size: 32, offset: 192)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !149, line: 150, baseType: !6)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !759, file: !760, line: 44, baseType: !151, size: 32, offset: 224)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !759, file: !760, line: 45, baseType: !771, size: 32, offset: 256)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !149, line: 147, baseType: !6)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !759, file: !760, line: 47, baseType: !57, size: 32, offset: 288)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !759, file: !760, line: 49, baseType: !746, size: 64, offset: 320)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !759, file: !760, line: 54, baseType: !749, size: 64, offset: 384)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !759, file: !760, line: 58, baseType: !776, size: 64, offset: 448)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !149, line: 175, baseType: !179)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !759, file: !760, line: 60, baseType: !778, size: 64, offset: 512)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !149, line: 180, baseType: !179)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !759, file: !760, line: 71, baseType: !780, size: 128, offset: 576)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !781, line: 10, size: 128, elements: !782)
!781 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!782 = !{!783, !784}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !780, file: !781, line: 12, baseType: !738, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !780, file: !781, line: 16, baseType: !785, size: 64, offset: 64)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !149, line: 197, baseType: !179)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !759, file: !760, line: 72, baseType: !780, size: 128, offset: 704)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !759, file: !760, line: 73, baseType: !780, size: 128, offset: 832)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !759, file: !760, line: 86, baseType: !789, size: 192, offset: 960)
!789 = !DICompositeType(tag: DW_TAG_array_type, baseType: !785, size: 192, elements: !790)
!790 = !{!791}
!791 = !DISubrange(count: 3)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "filetype", scope: !753, file: !3, line: 218, baseType: !66, size: 32, offset: 1344)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "linkmode", scope: !753, file: !3, line: 222, baseType: !794, size: 32, offset: 1376)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !748, line: 69, baseType: !768)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "scontext", scope: !753, file: !3, line: 225, baseType: !695, size: 64, offset: 1408)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "stat_ok", scope: !753, file: !3, line: 227, baseType: !105, size: 8, offset: 1472)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "linkok", scope: !753, file: !3, line: 231, baseType: !105, size: 8, offset: 1480)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "acl_type", scope: !753, file: !3, line: 235, baseType: !96, size: 32, offset: 1504)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "has_capability", scope: !753, file: !3, line: 238, baseType: !105, size: 8, offset: 1536)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "quoted", scope: !753, file: !3, line: 241, baseType: !57, size: 32, offset: 1568)
!801 = !{!802, !808, !811, !813, !815, !817, !819, !828, !830, !832, !834, !836, !838, !840, !842, !844, !846, !848, !850, !852, !854, !856, !860, !862, !868, !870, !872, !878, !0, !880, !882, !933, !935, !937, !942, !944, !953, !959, !963, !1037, !1039, !1041, !1043, !1045, !1047, !1049, !1051, !1053, !1055, !1057, !1071, !1073, !1075, !1077, !1079, !1081, !1083, !1085, !1091, !1096, !1100, !1105, !1109, !1111, !1117, !1122, !1128, !1131, !1133, !1135, !1137, !1142, !1144, !1148, !1153, !1155, !1161, !1163, !1171, !1176, !1222, !1224, !1227, !1230, !1232, !1234, !1236, !1238, !1240, !1242, !1244, !1246, !1248, !1250, !1252, !1262, !1272, !1281, !1283, !1299, !1309, !1328, !1346, !1354, !1359}
!802 = !DIGlobalVariableExpression(var: !803, expr: !DIExpression())
!803 = distinct !DIGlobalVariable(name: "active_dir_set", scope: !2, file: !3, line: 325, type: !804, isLocal: true, isDefinition: true)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !806, line: 69, baseType: !807)
!806 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!807 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !806, line: 67, flags: DIFlagFwdDecl)
!808 = !DIGlobalVariableExpression(var: !809, expr: !DIExpression())
!809 = distinct !DIGlobalVariable(name: "cwd_file", scope: !2, file: !3, line: 336, type: !810, isLocal: true, isDefinition: true)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!811 = !DIGlobalVariableExpression(var: !812, expr: !DIExpression())
!812 = distinct !DIGlobalVariable(name: "cwd_n_alloc", scope: !2, file: !3, line: 339, type: !701, isLocal: true, isDefinition: true)
!813 = !DIGlobalVariableExpression(var: !814, expr: !DIExpression())
!814 = distinct !DIGlobalVariable(name: "cwd_n_used", scope: !2, file: !3, line: 342, type: !701, isLocal: true, isDefinition: true)
!815 = !DIGlobalVariableExpression(var: !816, expr: !DIExpression())
!816 = distinct !DIGlobalVariable(name: "color_symlink_as_referent", scope: !2, file: !3, line: 361, type: !105, isLocal: true, isDefinition: true)
!817 = !DIGlobalVariableExpression(var: !818, expr: !DIExpression())
!818 = distinct !DIGlobalVariable(name: "hostname", scope: !2, file: !3, line: 363, type: !698, isLocal: true, isDefinition: true)
!819 = !DIGlobalVariableExpression(var: !820, expr: !DIExpression())
!820 = distinct !DIGlobalVariable(name: "pending_dirs", scope: !2, file: !3, line: 384, type: !821, isLocal: true, isDefinition: true)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pending", file: !3, line: 373, size: 256, elements: !823)
!823 = !{!824, !825, !826, !827}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !822, file: !3, line: 375, baseType: !695, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !822, file: !3, line: 379, baseType: !695, size: 64, offset: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "command_line_arg", scope: !822, file: !3, line: 380, baseType: !105, size: 8, offset: 128)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !822, file: !3, line: 381, baseType: !821, size: 64, offset: 192)
!828 = !DIGlobalVariableExpression(var: !829, expr: !DIExpression())
!829 = distinct !DIGlobalVariable(name: "current_time", scope: !2, file: !3, line: 389, type: !780, isLocal: true, isDefinition: true)
!830 = !DIGlobalVariableExpression(var: !831, expr: !DIExpression())
!831 = distinct !DIGlobalVariable(name: "print_scontext", scope: !2, file: !3, line: 391, type: !105, isLocal: true, isDefinition: true)
!832 = !DIGlobalVariableExpression(var: !833, expr: !DIExpression())
!833 = distinct !DIGlobalVariable(name: "format", scope: !2, file: !3, line: 434, type: !36, isLocal: true, isDefinition: true)
!834 = !DIGlobalVariableExpression(var: !835, expr: !DIExpression())
!835 = distinct !DIGlobalVariable(name: "sort_type", scope: !2, file: !3, line: 488, type: !56, isLocal: true, isDefinition: true)
!836 = !DIGlobalVariableExpression(var: !837, expr: !DIExpression())
!837 = distinct !DIGlobalVariable(name: "print_block_size", scope: !2, file: !3, line: 517, type: !105, isLocal: true, isDefinition: true)
!838 = !DIGlobalVariableExpression(var: !839, expr: !DIExpression())
!839 = distinct !DIGlobalVariable(name: "dired", scope: !2, file: !3, line: 532, type: !105, isLocal: true, isDefinition: true)
!840 = !DIGlobalVariableExpression(var: !841, expr: !DIExpression())
!841 = distinct !DIGlobalVariable(name: "indicator_style", scope: !2, file: !3, line: 549, type: !50, isLocal: true, isDefinition: true)
!842 = !DIGlobalVariableExpression(var: !843, expr: !DIExpression())
!843 = distinct !DIGlobalVariable(name: "print_with_color", scope: !2, file: !3, line: 566, type: !105, isLocal: true, isDefinition: true)
!844 = !DIGlobalVariableExpression(var: !845, expr: !DIExpression())
!845 = distinct !DIGlobalVariable(name: "print_hyperlink", scope: !2, file: !3, line: 568, type: !105, isLocal: true, isDefinition: true)
!846 = !DIGlobalVariableExpression(var: !847, expr: !DIExpression())
!847 = distinct !DIGlobalVariable(name: "check_symlink_mode", scope: !2, file: !3, line: 652, type: !105, isLocal: true, isDefinition: true)
!848 = !DIGlobalVariableExpression(var: !849, expr: !DIExpression())
!849 = distinct !DIGlobalVariable(name: "dereference", scope: !2, file: !3, line: 661, type: !43, isLocal: true, isDefinition: true)
!850 = !DIGlobalVariableExpression(var: !851, expr: !DIExpression())
!851 = distinct !DIGlobalVariable(name: "recursive", scope: !2, file: !3, line: 666, type: !105, isLocal: true, isDefinition: true)
!852 = !DIGlobalVariableExpression(var: !853, expr: !DIExpression())
!853 = distinct !DIGlobalVariable(name: "immediate_dirs", scope: !2, file: !3, line: 671, type: !105, isLocal: true, isDefinition: true)
!854 = !DIGlobalVariableExpression(var: !855, expr: !DIExpression())
!855 = distinct !DIGlobalVariable(name: "directories_first", scope: !2, file: !3, line: 675, type: !105, isLocal: true, isDefinition: true)
!856 = !DIGlobalVariableExpression(var: !857, expr: !DIExpression())
!857 = distinct !DIGlobalVariable(name: "filename_quoting_options", scope: !2, file: !3, line: 722, type: !858, isLocal: true, isDefinition: true)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !83, line: 270, flags: DIFlagFwdDecl)
!860 = !DIGlobalVariableExpression(var: !861, expr: !DIExpression())
!861 = distinct !DIGlobalVariable(name: "print_dir_name", scope: !2, file: !3, line: 731, type: !105, isLocal: true, isDefinition: true)
!862 = !DIGlobalVariableExpression(var: !863, expr: !DIExpression())
!863 = distinct !DIGlobalVariable(name: "localtz", scope: !2, file: !3, line: 740, type: !864, isLocal: true, isDefinition: true)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !865, line: 778, baseType: !866)
!865 = !DIFile(filename: "./lib/time.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !865, line: 778, flags: DIFlagFwdDecl)
!868 = !DIGlobalVariableExpression(var: !869, expr: !DIExpression())
!869 = distinct !DIGlobalVariable(name: "format_needs_stat", scope: !2, file: !3, line: 745, type: !105, isLocal: true, isDefinition: true)
!870 = !DIGlobalVariableExpression(var: !871, expr: !DIExpression())
!871 = distinct !DIGlobalVariable(name: "format_needs_type", scope: !2, file: !3, line: 750, type: !105, isLocal: true, isDefinition: true)
!872 = !DIGlobalVariableExpression(var: !873, expr: !DIExpression())
!873 = distinct !DIGlobalVariable(name: "interrupt_signal", scope: !2, file: !3, line: 799, type: !874, isLocal: true, isDefinition: true)
!874 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !875)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "sig_atomic_t", file: !876, line: 8, baseType: !877)
!876 = !DIFile(filename: "/usr/include/bits/types/sig_atomic_t.h", directory: "")
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sig_atomic_t", file: !149, line: 215, baseType: !57)
!878 = !DIGlobalVariableExpression(var: !879, expr: !DIExpression())
!879 = distinct !DIGlobalVariable(name: "stop_signal_count", scope: !2, file: !3, line: 803, type: !874, isLocal: true, isDefinition: true)
!880 = !DIGlobalVariableExpression(var: !881, expr: !DIExpression())
!881 = distinct !DIGlobalVariable(name: "dired_pos", scope: !2, file: !3, line: 972, type: !701, isLocal: true, isDefinition: true)
!882 = !DIGlobalVariableExpression(var: !883, expr: !DIExpression())
!883 = distinct !DIGlobalVariable(name: "dired_obstack", scope: !2, file: !3, line: 993, type: !884, isLocal: true, isDefinition: true)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !885, line: 174, size: 704, elements: !886)
!885 = !DIFile(filename: "./lib/obstack.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!886 = !{!887, !888, !898, !899, !900, !901, !906, !907, !918, !929, !930, !931, !932}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !884, file: !885, line: 176, baseType: !701, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !884, file: !885, line: 177, baseType: !889, size: 64, offset: 64)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !885, line: 167, size: 128, elements: !891)
!891 = !{!892, !893, !894}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !890, file: !885, line: 169, baseType: !695, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !890, file: !885, line: 170, baseType: !889, size: 64, offset: 64)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !890, file: !885, line: 171, baseType: !895, offset: 128)
!895 = !DICompositeType(tag: DW_TAG_array_type, baseType: !696, elements: !896)
!896 = !{!897}
!897 = !DISubrange(count: -1)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !884, file: !885, line: 178, baseType: !695, size: 64, offset: 128)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !884, file: !885, line: 179, baseType: !695, size: 64, offset: 192)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !884, file: !885, line: 180, baseType: !695, size: 64, offset: 256)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !884, file: !885, line: 185, baseType: !902, size: 64, offset: 320)
!902 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !884, file: !885, line: 181, size: 64, elements: !903)
!903 = !{!904, !905}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !902, file: !885, line: 183, baseType: !701, size: 64)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !902, file: !885, line: 184, baseType: !164, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !884, file: !885, line: 186, baseType: !701, size: 64, offset: 384)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !884, file: !885, line: 193, baseType: !908, size: 64, offset: 448)
!908 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !884, file: !885, line: 189, size: 64, elements: !909)
!909 = !{!910, !914}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !908, file: !885, line: 191, baseType: !911, size: 64)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DISubroutineType(types: !913)
!913 = !{!164, !701}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !908, file: !885, line: 192, baseType: !915, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DISubroutineType(types: !917)
!917 = !{!164, !164, !701}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !884, file: !885, line: 198, baseType: !919, size: 64, offset: 512)
!919 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !884, file: !885, line: 194, size: 64, elements: !920)
!920 = !{!921, !925}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !919, file: !885, line: 196, baseType: !922, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DISubroutineType(types: !924)
!924 = !{null, !164}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !919, file: !885, line: 197, baseType: !926, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DISubroutineType(types: !928)
!928 = !{null, !164, !164}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !884, file: !885, line: 200, baseType: !164, size: 64, offset: 576)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !884, file: !885, line: 201, baseType: !6, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !884, file: !885, line: 202, baseType: !6, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !884, file: !885, line: 206, baseType: !6, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!933 = !DIGlobalVariableExpression(var: !934, expr: !DIExpression())
!934 = distinct !DIGlobalVariable(name: "subdired_obstack", scope: !2, file: !3, line: 1000, type: !884, isLocal: true, isDefinition: true)
!935 = !DIGlobalVariableExpression(var: !936, expr: !DIExpression())
!936 = distinct !DIGlobalVariable(name: "dev_ino_obstack", scope: !2, file: !3, line: 1014, type: !884, isLocal: true, isDefinition: true)
!937 = !DIGlobalVariableExpression(var: !938, expr: !DIExpression())
!938 = distinct !DIGlobalVariable(name: "RFC3986", scope: !2, file: !3, line: 1258, type: !939, isLocal: true, isDefinition: true)
!939 = !DICompositeType(tag: DW_TAG_array_type, baseType: !696, size: 2048, elements: !940)
!940 = !{!941}
!941 = !DISubrange(count: 256)
!942 = !DIGlobalVariableExpression(var: !943, expr: !DIExpression())
!943 = distinct !DIGlobalVariable(name: "used_color", scope: !2, file: !3, line: 574, type: !105, isLocal: true, isDefinition: true)
!944 = !DIGlobalVariableExpression(var: !945, expr: !DIExpression())
!945 = distinct !DIGlobalVariable(name: "color_indicator", scope: !2, file: !3, line: 615, type: !946, isLocal: true, isDefinition: true)
!946 = !DICompositeType(tag: DW_TAG_array_type, baseType: !947, size: 3072, elements: !951)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_str", file: !3, line: 250, size: 128, elements: !948)
!948 = !{!949, !950}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !947, file: !3, line: 252, baseType: !701, size: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !947, file: !3, line: 253, baseType: !698, size: 64, offset: 64)
!951 = !{!952}
!952 = !DISubrange(count: 24)
!953 = !DIGlobalVariableExpression(var: !954, expr: !DIExpression())
!954 = distinct !DIGlobalVariable(name: "sig", scope: !102, file: !3, line: 1533, type: !955, isLocal: true, isDefinition: true)
!955 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 384, elements: !957)
!956 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!957 = !{!958}
!958 = !DISubrange(count: 12)
!959 = !DIGlobalVariableExpression(var: !960, expr: !DIExpression())
!960 = distinct !DIGlobalVariable(name: "caught_signals", scope: !2, file: !3, line: 795, type: !961, isLocal: true, isDefinition: true)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !962, line: 7, baseType: !209)
!962 = !DIFile(filename: "/usr/include/bits/types/sigset_t.h", directory: "")
!963 = !DIGlobalVariableExpression(var: !964, expr: !DIExpression())
!964 = distinct !DIGlobalVariable(name: "posix_prefix", scope: !965, file: !3, line: 2354, type: !1034, isLocal: true, isDefinition: true)
!965 = distinct !DISubprogram(name: "decode_switches", scope: !3, file: !3, line: 1863, type: !966, scopeLine: 1864, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !968)
!966 = !DISubroutineType(types: !967)
!967 = !{!57, !57, !694}
!968 = !{!969, !970, !971, !972, !973, !974, !976, !985, !987, !990, !992, !993, !1001, !1003, !1005, !1007, !1010, !1011, !1014, !1017, !1020, !1021, !1024, !1029}
!969 = !DILocalVariable(name: "argc", arg: 1, scope: !965, file: !3, line: 1863, type: !57)
!970 = !DILocalVariable(name: "argv", arg: 2, scope: !965, file: !3, line: 1863, type: !694)
!971 = !DILocalVariable(name: "time_style_option", scope: !965, file: !3, line: 1865, type: !695)
!972 = !DILocalVariable(name: "sort_type_specified", scope: !965, file: !3, line: 1867, type: !105)
!973 = !DILocalVariable(name: "kibibytes_specified", scope: !965, file: !3, line: 1868, type: !105)
!974 = !DILocalVariable(name: "p", scope: !975, file: !3, line: 1927, type: !698)
!975 = distinct !DILexicalBlock(scope: !965, file: !3, line: 1926, column: 3)
!976 = !DILocalVariable(name: "ws", scope: !977, file: !3, line: 1936, type: !978)
!977 = distinct !DILexicalBlock(scope: !965, file: !3, line: 1935, column: 3)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "winsize", file: !979, line: 27, size: 64, elements: !980)
!979 = !DIFile(filename: "/usr/include/bits/ioctl-types.h", directory: "")
!980 = !{!981, !982, !983, !984}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "ws_row", scope: !978, file: !979, line: 29, baseType: !745, size: 16)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "ws_col", scope: !978, file: !979, line: 30, baseType: !745, size: 16, offset: 16)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "ws_xpixel", scope: !978, file: !979, line: 31, baseType: !745, size: 16, offset: 32)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "ws_ypixel", scope: !978, file: !979, line: 32, baseType: !745, size: 16, offset: 48)
!985 = !DILocalVariable(name: "p", scope: !986, file: !3, line: 1945, type: !698)
!986 = distinct !DILexicalBlock(scope: !965, file: !3, line: 1944, column: 3)
!987 = !DILocalVariable(name: "tmp", scope: !988, file: !3, line: 1949, type: !739)
!988 = distinct !DILexicalBlock(scope: !989, file: !3, line: 1948, column: 7)
!989 = distinct !DILexicalBlock(scope: !986, file: !3, line: 1947, column: 9)
!990 = !DILocalVariable(name: "oi", scope: !991, file: !3, line: 1963, type: !57)
!991 = distinct !DILexicalBlock(scope: !965, file: !3, line: 1962, column: 5)
!992 = !DILocalVariable(name: "c", scope: !991, file: !3, line: 1964, type: !57)
!993 = !DILocalVariable(name: "hide", scope: !994, file: !3, line: 2167, type: !996)
!994 = distinct !DILexicalBlock(scope: !995, file: !3, line: 2166, column: 11)
!995 = distinct !DILexicalBlock(scope: !991, file: !3, line: 1971, column: 9)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ignore_pattern", file: !3, line: 697, size: 128, elements: !998)
!998 = !{!999, !1000}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "pattern", scope: !997, file: !3, line: 699, baseType: !698, size: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !997, file: !3, line: 700, baseType: !996, size: 64, offset: 64)
!1001 = !DILocalVariable(name: "i", scope: !1002, file: !3, line: 2198, type: !57)
!1002 = distinct !DILexicalBlock(scope: !995, file: !3, line: 2197, column: 11)
!1003 = !DILocalVariable(name: "i", scope: !1004, file: !3, line: 2222, type: !57)
!1004 = distinct !DILexicalBlock(scope: !995, file: !3, line: 2221, column: 11)
!1005 = !DILocalVariable(name: "e", scope: !1006, file: !3, line: 2259, type: !237)
!1006 = distinct !DILexicalBlock(scope: !995, file: !3, line: 2258, column: 11)
!1007 = !DILocalVariable(name: "ls_block_size", scope: !1008, file: !3, line: 2289, type: !698)
!1008 = distinct !DILexicalBlock(scope: !1009, file: !3, line: 2288, column: 5)
!1009 = distinct !DILexicalBlock(scope: !965, file: !3, line: 2287, column: 7)
!1010 = !DILocalVariable(name: "qs", scope: !965, file: !3, line: 2310, type: !82)
!1011 = !DILocalVariable(name: "p", scope: !1012, file: !3, line: 2322, type: !698)
!1012 = distinct !DILexicalBlock(scope: !1013, file: !3, line: 2321, column: 5)
!1013 = distinct !DILexicalBlock(scope: !965, file: !3, line: 2320, column: 7)
!1014 = !DILocalVariable(name: "style", scope: !1015, file: !3, line: 2353, type: !695)
!1015 = distinct !DILexicalBlock(scope: !1016, file: !3, line: 2352, column: 5)
!1016 = distinct !DILexicalBlock(scope: !965, file: !3, line: 2351, column: 7)
!1017 = !DILocalVariable(name: "p0", scope: !1018, file: !3, line: 2369, type: !695)
!1018 = distinct !DILexicalBlock(scope: !1019, file: !3, line: 2368, column: 9)
!1019 = distinct !DILexicalBlock(scope: !1015, file: !3, line: 2367, column: 11)
!1020 = !DILocalVariable(name: "p1", scope: !1018, file: !3, line: 2370, type: !695)
!1021 = !DILocalVariable(name: "res", scope: !1022, file: !3, line: 2385, type: !1023)
!1022 = distinct !DILexicalBlock(scope: !1019, file: !3, line: 2384, column: 9)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !702, line: 35, baseType: !179)
!1024 = !DILocalVariable(name: "p", scope: !1025, file: !3, line: 2401, type: !1027)
!1025 = distinct !DILexicalBlock(scope: !1026, file: !3, line: 2389, column: 13)
!1026 = distinct !DILexicalBlock(scope: !1022, file: !3, line: 2388, column: 15)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1028 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !698)
!1029 = !DILocalVariable(name: "i", scope: !1030, file: !3, line: 2427, type: !57)
!1030 = distinct !DILexicalBlock(scope: !1031, file: !3, line: 2427, column: 19)
!1031 = distinct !DILexicalBlock(scope: !1032, file: !3, line: 2426, column: 17)
!1032 = distinct !DILexicalBlock(scope: !1033, file: !3, line: 2425, column: 19)
!1033 = distinct !DILexicalBlock(scope: !1022, file: !3, line: 2409, column: 13)
!1034 = !DICompositeType(tag: DW_TAG_array_type, baseType: !699, size: 56, elements: !1035)
!1035 = !{!1036}
!1036 = !DISubrange(count: 7)
!1037 = !DIGlobalVariableExpression(var: !1038, expr: !DIExpression())
!1038 = distinct !DIGlobalVariable(name: "qmark_funny_chars", scope: !2, file: !3, line: 718, type: !105, isLocal: true, isDefinition: true)
!1039 = !DIGlobalVariableExpression(var: !1040, expr: !DIExpression())
!1040 = distinct !DIGlobalVariable(name: "time_type", scope: !2, file: !3, line: 471, type: !225, isLocal: true, isDefinition: true)
!1041 = !DIGlobalVariableExpression(var: !1042, expr: !DIExpression())
!1042 = distinct !DIGlobalVariable(name: "sort_reverse", scope: !2, file: !3, line: 496, type: !105, isLocal: true, isDefinition: true)
!1043 = !DIGlobalVariableExpression(var: !1044, expr: !DIExpression())
!1044 = distinct !DIGlobalVariable(name: "numeric_ids", scope: !2, file: !3, line: 513, type: !105, isLocal: true, isDefinition: true)
!1045 = !DIGlobalVariableExpression(var: !1046, expr: !DIExpression())
!1046 = distinct !DIGlobalVariable(name: "print_inode", scope: !2, file: !3, line: 656, type: !105, isLocal: true, isDefinition: true)
!1047 = !DIGlobalVariableExpression(var: !1048, expr: !DIExpression())
!1048 = distinct !DIGlobalVariable(name: "ignore_mode", scope: !2, file: !3, line: 690, type: !232, isLocal: true, isDefinition: true)
!1049 = !DIGlobalVariableExpression(var: !1050, expr: !DIExpression())
!1050 = distinct !DIGlobalVariable(name: "ignore_patterns", scope: !2, file: !3, line: 703, type: !996, isLocal: true, isDefinition: true)
!1051 = !DIGlobalVariableExpression(var: !1052, expr: !DIExpression())
!1052 = distinct !DIGlobalVariable(name: "hide_patterns", scope: !2, file: !3, line: 707, type: !996, isLocal: true, isDefinition: true)
!1053 = !DIGlobalVariableExpression(var: !1054, expr: !DIExpression())
!1054 = distinct !DIGlobalVariable(name: "line_length", scope: !2, file: !3, line: 736, type: !701, isLocal: true, isDefinition: true)
!1055 = !DIGlobalVariableExpression(var: !1056, expr: !DIExpression())
!1056 = distinct !DIGlobalVariable(name: "tabsize", scope: !2, file: !3, line: 727, type: !701, isLocal: true, isDefinition: true)
!1057 = !DIGlobalVariableExpression(var: !1058, expr: !DIExpression())
!1058 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 846, type: !1059, isLocal: true, isDefinition: true)
!1059 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1060, size: 11264, elements: !1069)
!1060 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1061)
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !1062, line: 50, size: 256, elements: !1063)
!1062 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!1063 = !{!1064, !1065, !1066, !1068}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1061, file: !1062, line: 52, baseType: !698, size: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !1061, file: !1062, line: 55, baseType: !57, size: 32, offset: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1061, file: !1062, line: 56, baseType: !1067, size: 64, offset: 128)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1061, file: !1062, line: 57, baseType: !57, size: 32, offset: 192)
!1069 = !{!1070}
!1070 = !DISubrange(count: 44)
!1071 = !DIGlobalVariableExpression(var: !1072, expr: !DIExpression())
!1072 = distinct !DIGlobalVariable(name: "print_owner", scope: !2, file: !3, line: 500, type: !105, isLocal: true, isDefinition: true)
!1073 = !DIGlobalVariableExpression(var: !1074, expr: !DIExpression())
!1074 = distinct !DIGlobalVariable(name: "human_output_opts", scope: !2, file: !3, line: 520, type: !57, isLocal: true, isDefinition: true)
!1075 = !DIGlobalVariableExpression(var: !1076, expr: !DIExpression())
!1076 = distinct !DIGlobalVariable(name: "file_human_output_opts", scope: !2, file: !3, line: 526, type: !57, isLocal: true, isDefinition: true)
!1077 = !DIGlobalVariableExpression(var: !1078, expr: !DIExpression())
!1078 = distinct !DIGlobalVariable(name: "output_block_size", scope: !2, file: !3, line: 523, type: !739, isLocal: true, isDefinition: true)
!1079 = !DIGlobalVariableExpression(var: !1080, expr: !DIExpression())
!1080 = distinct !DIGlobalVariable(name: "file_output_block_size", scope: !2, file: !3, line: 527, type: !739, isLocal: true, isDefinition: true)
!1081 = !DIGlobalVariableExpression(var: !1082, expr: !DIExpression())
!1082 = distinct !DIGlobalVariable(name: "print_group", scope: !2, file: !3, line: 508, type: !105, isLocal: true, isDefinition: true)
!1083 = !DIGlobalVariableExpression(var: !1084, expr: !DIExpression())
!1084 = distinct !DIGlobalVariable(name: "print_author", scope: !2, file: !3, line: 504, type: !105, isLocal: true, isDefinition: true)
!1085 = !DIGlobalVariableExpression(var: !1086, expr: !DIExpression())
!1086 = distinct !DIGlobalVariable(name: "sort_types", scope: !2, file: !3, line: 912, type: !1087, isLocal: true, isDefinition: true)
!1087 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1088, size: 160, elements: !1089)
!1088 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!1089 = !{!1090}
!1090 = !DISubrange(count: 5)
!1091 = !DIGlobalVariableExpression(var: !1092, expr: !DIExpression())
!1092 = distinct !DIGlobalVariable(name: "sort_args", scope: !2, file: !3, line: 908, type: !1093, isLocal: true, isDefinition: true)
!1093 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1028, size: 384, elements: !1094)
!1094 = !{!1095}
!1095 = !DISubrange(count: 6)
!1096 = !DIGlobalVariableExpression(var: !1097, expr: !DIExpression())
!1097 = distinct !DIGlobalVariable(name: "time_types", scope: !2, file: !3, line: 925, type: !1098, isLocal: true, isDefinition: true)
!1098 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1099, size: 224, elements: !1035)
!1099 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !225)
!1100 = !DIGlobalVariableExpression(var: !1101, expr: !DIExpression())
!1101 = distinct !DIGlobalVariable(name: "time_args", scope: !2, file: !3, line: 918, type: !1102, isLocal: true, isDefinition: true)
!1102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1028, size: 512, elements: !1103)
!1103 = !{!1104}
!1104 = !DISubrange(count: 8)
!1105 = !DIGlobalVariableExpression(var: !1106, expr: !DIExpression())
!1106 = distinct !DIGlobalVariable(name: "format_types", scope: !2, file: !3, line: 901, type: !1107, isLocal: true, isDefinition: true)
!1107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1108, size: 224, elements: !1035)
!1108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!1109 = !DIGlobalVariableExpression(var: !1110, expr: !DIExpression())
!1110 = distinct !DIGlobalVariable(name: "format_args", scope: !2, file: !3, line: 896, type: !1102, isLocal: true, isDefinition: true)
!1111 = !DIGlobalVariableExpression(var: !1112, expr: !DIExpression())
!1112 = distinct !DIGlobalVariable(name: "when_types", scope: !2, file: !3, line: 940, type: !1113, isLocal: true, isDefinition: true)
!1113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1114, size: 288, elements: !1115)
!1114 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !258)
!1115 = !{!1116}
!1116 = !DISubrange(count: 9)
!1117 = !DIGlobalVariableExpression(var: !1118, expr: !DIExpression())
!1118 = distinct !DIGlobalVariable(name: "when_args", scope: !2, file: !3, line: 933, type: !1119, isLocal: true, isDefinition: true)
!1119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1028, size: 640, elements: !1120)
!1120 = !{!1121}
!1121 = !DISubrange(count: 10)
!1122 = !DIGlobalVariableExpression(var: !1123, expr: !DIExpression())
!1123 = distinct !DIGlobalVariable(name: "indicator_style_types", scope: !2, file: !3, line: 556, type: !1124, isLocal: true, isDefinition: true)
!1124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1125, size: 128, elements: !1126)
!1125 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!1126 = !{!1127}
!1127 = !DISubrange(count: 4)
!1128 = !DIGlobalVariableExpression(var: !1129, expr: !DIExpression())
!1129 = distinct !DIGlobalVariable(name: "indicator_style_args", scope: !2, file: !3, line: 552, type: !1130, isLocal: true, isDefinition: true)
!1130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1028, size: 320, elements: !1089)
!1131 = !DIGlobalVariableExpression(var: !1132, expr: !DIExpression())
!1132 = distinct !DIGlobalVariable(name: "max_idx", scope: !2, file: !3, line: 960, type: !701, isLocal: true, isDefinition: true)
!1133 = !DIGlobalVariableExpression(var: !1134, expr: !DIExpression())
!1134 = distinct !DIGlobalVariable(name: "align_variable_outer_quotes", scope: !2, file: !3, line: 349, type: !105, isLocal: true, isDefinition: true)
!1135 = !DIGlobalVariableExpression(var: !1136, expr: !DIExpression())
!1136 = distinct !DIGlobalVariable(name: "dirname_quoting_options", scope: !2, file: !3, line: 723, type: !858, isLocal: true, isDefinition: true)
!1137 = !DIGlobalVariableExpression(var: !1138, expr: !DIExpression())
!1138 = distinct !DIGlobalVariable(name: "long_time_format", scope: !2, file: !3, line: 763, type: !1139, isLocal: true, isDefinition: true)
!1139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !698, size: 128, elements: !1140)
!1140 = !{!1141}
!1141 = !DISubrange(count: 2)
!1142 = !DIGlobalVariableExpression(var: !1143, expr: !DIExpression())
!1143 = distinct !DIGlobalVariable(name: "time_style_args", scope: !2, file: !3, line: 447, type: !1130, isLocal: true, isDefinition: true)
!1144 = !DIGlobalVariableExpression(var: !1145, expr: !DIExpression())
!1145 = distinct !DIGlobalVariable(name: "time_style_types", scope: !2, file: !3, line: 451, type: !1146, isLocal: true, isDefinition: true)
!1146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1147, size: 128, elements: !1126)
!1147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !263)
!1148 = !DIGlobalVariableExpression(var: !1149, expr: !DIExpression())
!1149 = distinct !DIGlobalVariable(name: "abformat", scope: !2, file: !3, line: 1282, type: !1150, isLocal: true, isDefinition: true)
!1150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !696, size: 24576, elements: !1151)
!1151 = !{!1141, !958, !1152}
!1152 = !DISubrange(count: 128)
!1153 = !DIGlobalVariableExpression(var: !1154, expr: !DIExpression())
!1154 = distinct !DIGlobalVariable(name: "use_abformat", scope: !2, file: !3, line: 1286, type: !105, isLocal: true, isDefinition: true)
!1155 = !DIGlobalVariableExpression(var: !1156, expr: !DIExpression())
!1156 = distinct !DIGlobalVariable(name: "G_line", scope: !2, file: !1157, line: 1, type: !1158, isLocal: true, isDefinition: true)
!1157 = !DIFile(filename: "src/dircolors.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !699, size: 34432, elements: !1159)
!1159 = !{!1160}
!1160 = !DISubrange(count: 4304)
