; ModuleID = 'coreutils-8.32/src/make-prime-list.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.prime = type { i32, i64, i64 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [56 x i8] c"Usage: %s LIMIT\0AProduces a list of odd primes <= LIMIT\0A\00", align 1
@.str.2 = private unnamed_addr constant [27 x i8] c"Virtual memory exhausted.\0A\00", align 1
@.str.3 = private unnamed_addr constant [37 x i8] c"/* Generated file -- DO NOT EDIT */\0A\00", align 1
@.str.4 = private unnamed_addr constant [27 x i8] c"#define WIDE_UINT_BITS %u\0A\00", align 1
@.str.5 = private unnamed_addr constant [16 x i8] c"P (%u, %u,\0A   (\00", align 1
@.str.6 = private unnamed_addr constant [25 x i8] c"),\0A   UINTMAX_MAX / %u)\0A\00", align 1
@.str.7 = private unnamed_addr constant [29 x i8] c"\0A#undef FIRST_OMITTED_PRIME\0A\00", align 1
@.str.8 = private unnamed_addr constant [32 x i8] c"#define FIRST_OMITTED_PRIME %u\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "src/make-prime-list.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!2 = !{}
!3 = !{!4, !9, !72, !13, !73, !8, !74}
!4 = !DISubprogram(name: "free", scope: !5, file: !5, line: 565, type: !6, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !2)
!5 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!6 = !DISubroutineType(types: !7)
!7 = !{null, !8}
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!9 = !DISubprogram(name: "ferror", scope: !10, file: !10, line: 761, type: !11, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !2)
!10 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!11 = !DISubroutineType(types: !12)
!12 = !{!13, !14}
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !16, line: 49, size: 1728, elements: !17)
!16 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!17 = !{!18, !19, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !35, !36, !37, !38, !42, !44, !46, !50, !53, !55, !58, !61, !62, !63, !67, !68}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !15, file: !16, line: 51, baseType: !13, size: 32)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !15, file: !16, line: 54, baseType: !20, size: 64, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !15, file: !16, line: 55, baseType: !20, size: 64, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !15, file: !16, line: 56, baseType: !20, size: 64, offset: 192)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !15, file: !16, line: 57, baseType: !20, size: 64, offset: 256)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !15, file: !16, line: 58, baseType: !20, size: 64, offset: 320)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !15, file: !16, line: 59, baseType: !20, size: 64, offset: 384)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !15, file: !16, line: 60, baseType: !20, size: 64, offset: 448)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !15, file: !16, line: 61, baseType: !20, size: 64, offset: 512)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !15, file: !16, line: 64, baseType: !20, size: 64, offset: 576)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !15, file: !16, line: 65, baseType: !20, size: 64, offset: 640)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !15, file: !16, line: 66, baseType: !20, size: 64, offset: 704)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !15, file: !16, line: 68, baseType: !33, size: 64, offset: 768)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !16, line: 36, flags: DIFlagFwdDecl)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !15, file: !16, line: 70, baseType: !14, size: 64, offset: 832)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !15, file: !16, line: 72, baseType: !13, size: 32, offset: 896)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !15, file: !16, line: 73, baseType: !13, size: 32, offset: 928)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !15, file: !16, line: 74, baseType: !39, size: 64, offset: 960)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !40, line: 152, baseType: !41)
!40 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!41 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !15, file: !16, line: 77, baseType: !43, size: 16, offset: 1024)
!43 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !15, file: !16, line: 78, baseType: !45, size: 8, offset: 1040)
!45 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !15, file: !16, line: 79, baseType: !47, size: 8, offset: 1048)
!47 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 8, elements: !48)
!48 = !{!49}
!49 = !DISubrange(count: 1)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !15, file: !16, line: 81, baseType: !51, size: 64, offset: 1088)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !16, line: 43, baseType: null)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !15, file: !16, line: 89, baseType: !54, size: 64, offset: 1152)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !40, line: 153, baseType: !41)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !15, file: !16, line: 91, baseType: !56, size: 64, offset: 1216)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !16, line: 37, flags: DIFlagFwdDecl)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !15, file: !16, line: 92, baseType: !59, size: 64, offset: 1280)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !16, line: 38, flags: DIFlagFwdDecl)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !15, file: !16, line: 93, baseType: !14, size: 64, offset: 1344)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !15, file: !16, line: 94, baseType: !8, size: 64, offset: 1408)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !15, file: !16, line: 95, baseType: !64, size: 64, offset: 1472)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !65, line: 46, baseType: !66)
!65 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!66 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !15, file: !16, line: 96, baseType: !13, size: 32, offset: 1536)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !15, file: !16, line: 98, baseType: !69, size: 160, offset: 1568)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 160, elements: !70)
!70 = !{!71}
!71 = !DISubrange(count: 20)
!72 = !DISubprogram(name: "fclose", scope: !10, file: !10, line: 213, type: !11, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !2)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!74 = !DISubprogram(name: "puts", scope: !10, file: !10, line: 632, type: !75, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !2)
!75 = !DISubroutineType(types: !76)
!76 = !{!13, !77}
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!79 = !{!"clang version 10.0.0 "}
!80 = !{i32 7, !"Dwarf Version", i32 4}
!81 = !{i32 2, !"Debug Info Version", i32 3}
!82 = !{i32 1, !"wchar_size", i32 4}
!83 = !{i32 7, !"PIC Level", i32 2}
!84 = !{i32 7, !"PIE Level", i32 2}
!85 = distinct !DISubprogram(name: "main", scope: !1, file: !1, line: 172, type: !86, scopeLine: 173, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !88)
!86 = !DISubroutineType(types: !87)
!87 = !{!13, !13, !73}
!88 = !{!89, !90, !91, !92, !93, !94, !95, !107, !108, !112}
!89 = !DILocalVariable(name: "argc", arg: 1, scope: !85, file: !1, line: 172, type: !13)
!90 = !DILocalVariable(name: "argv", arg: 2, scope: !85, file: !1, line: 172, type: !73)
!91 = !DILocalVariable(name: "limit", scope: !85, file: !1, line: 174, type: !13)
!92 = !DILocalVariable(name: "sieve", scope: !85, file: !1, line: 176, type: !20)
!93 = !DILocalVariable(name: "size", scope: !85, file: !1, line: 177, type: !64)
!94 = !DILocalVariable(name: "i", scope: !85, file: !1, line: 177, type: !64)
!95 = !DILocalVariable(name: "prime_list", scope: !85, file: !1, line: 179, type: !96)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prime", file: !1, line: 49, size: 192, elements: !98)
!98 = !{!99, !101, !106}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !97, file: !1, line: 51, baseType: !100, size: 32)
!100 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "pinv", scope: !97, file: !1, line: 52, baseType: !102, size: 64, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "wide_uint", file: !1, line: 45, baseType: !103)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !104, line: 102, baseType: !105)
!104 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !40, line: 73, baseType: !66)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "lim", scope: !97, file: !1, line: 53, baseType: !102, size: 64, offset: 128)
!107 = !DILocalVariable(name: "nprimes", scope: !85, file: !1, line: 180, type: !100)
!108 = !DILocalVariable(name: "p", scope: !109, file: !1, line: 206, type: !100)
!109 = distinct !DILexicalBlock(scope: !110, file: !1, line: 205, column: 5)
!110 = distinct !DILexicalBlock(scope: !111, file: !1, line: 204, column: 3)
!111 = distinct !DILexicalBlock(scope: !85, file: !1, line: 204, column: 3)
!112 = !DILocalVariable(name: "j", scope: !109, file: !1, line: 207, type: !100)
!113 = !DILocation(line: 0, scope: !85)
!114 = !DILocation(line: 182, column: 12, scope: !115)
!115 = distinct !DILexicalBlock(scope: !85, file: !1, line: 182, column: 7)
!116 = !DILocation(line: 182, column: 7, scope: !85)
!117 = !DILocation(line: 184, column: 7, scope: !118)
!118 = distinct !DILexicalBlock(scope: !115, file: !1, line: 183, column: 5)
!119 = !{!120, !120, i64 0}
!120 = !{!"any pointer", !121, i64 0}
!121 = !{!"omnipotent char", !122, i64 0}
!122 = !{!"Simple C/C++ TBAA"}
!123 = !DILocation(line: 186, column: 7, scope: !118)
!124 = !DILocation(line: 188, column: 17, scope: !85)
!125 = !DILocalVariable(name: "__nptr", arg: 1, scope: !126, file: !5, line: 361, type: !77)
!126 = distinct !DISubprogram(name: "atoi", scope: !5, file: !5, line: 361, type: !75, scopeLine: 362, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !127)
!127 = !{!125}
!128 = !DILocation(line: 0, scope: !126, inlinedAt: !129)
!129 = distinct !DILocation(line: 188, column: 11, scope: !85)
!130 = !DILocation(line: 363, column: 16, scope: !126, inlinedAt: !129)
!131 = !DILocation(line: 363, column: 10, scope: !126, inlinedAt: !129)
!132 = !DILocation(line: 189, column: 13, scope: !133)
!133 = distinct !DILexicalBlock(scope: !85, file: !1, line: 189, column: 7)
!134 = !DILocation(line: 189, column: 7, scope: !85)
!135 = !DILocation(line: 193, column: 16, scope: !136)
!136 = distinct !DILexicalBlock(scope: !85, file: !1, line: 193, column: 8)
!137 = !DILocation(line: 193, column: 8, scope: !85)
!138 = !DILocation(line: 196, column: 16, scope: !85)
!139 = !DILocation(line: 196, column: 19, scope: !85)
!140 = !DILocation(line: 196, column: 10, scope: !85)
!141 = !DILocalVariable(name: "s", arg: 1, scope: !142, file: !1, line: 161, type: !64)
!142 = distinct !DISubprogram(name: "xalloc", scope: !1, file: !1, line: 161, type: !143, scopeLine: 162, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !145)
!143 = !DISubroutineType(types: !144)
!144 = !{!8, !64}
!145 = !{!141, !146}
!146 = !DILocalVariable(name: "p", scope: !142, file: !1, line: 163, type: !8)
!147 = !DILocation(line: 0, scope: !142, inlinedAt: !148)
!148 = distinct !DILocation(line: 198, column: 11, scope: !85)
!149 = !DILocation(line: 163, column: 13, scope: !142, inlinedAt: !148)
!150 = !DILocation(line: 164, column: 7, scope: !151, inlinedAt: !148)
!151 = distinct !DILexicalBlock(scope: !142, file: !1, line: 164, column: 7)
!152 = !DILocation(line: 164, column: 7, scope: !142, inlinedAt: !148)
!153 = !DILocation(line: 167, column: 3, scope: !142, inlinedAt: !148)
!154 = !DILocation(line: 168, column: 3, scope: !142, inlinedAt: !148)
!155 = !DILocalVariable(name: "__dest", arg: 1, scope: !156, file: !157, line: 59, type: !8)
!156 = distinct !DISubprogram(name: "memset", scope: !157, file: !157, line: 59, type: !158, scopeLine: 60, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !160)
!157 = !DIFile(filename: "/usr/include/bits/string_fortified.h", directory: "")
!158 = !DISubroutineType(types: !159)
!159 = !{!8, !8, !13, !64}
!160 = !{!155, !161, !162}
!161 = !DILocalVariable(name: "__ch", arg: 2, scope: !156, file: !157, line: 59, type: !13)
