; ModuleID = 'coreutils-8.32/src/md5sum.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.md5_ctx = type { i32, i32, i32, i32, [2 x i32], i32, [32 x i32] }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [71 x i8] c"Usage: %s [OPTION]... [FILE]...\0APrint or check %s (%d-bit) checksums.\0A\00", align 1
@.str.2 = private unnamed_addr constant [4 x i8] c"MD5\00", align 1
@.str.36 = private unnamed_addr constant [56 x i8] c"\0AWith no FILE, or when FILE is -, read standard input.\0A\00", align 1

!3 = !DIFile(filename: "src/md5sum.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !20, !35, !49}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!9 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 46, baseType: !7, size: 32, elements: !22)
!21 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!22 = !{!23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34}
!23 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!24 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!25 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!26 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!27 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!28 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!29 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!30 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!31 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!32 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!33 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!34 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !37, file: !36, line: 187, baseType: !7, size: 32, elements: !47)
!36 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!37 = distinct !DISubprogram(name: "select_plural", scope: !36, file: !36, line: 183, type: !38, scopeLine: 184, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !45)
!38 = !DISubroutineType(types: !39)
!39 = !{!40, !41}
!40 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !42, line: 102, baseType: !43)
!42 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !44, line: 73, baseType: !40)
!44 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!45 = !{!46}
!46 = !DILocalVariable(name: "n", arg: 1, scope: !37, file: !36, line: 183, type: !41)
!47 = !{!48}
!48 = !DIEnumerator(name: "PLURAL_REDUCER", value: 1000000, isUnsigned: true)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !50, line: 45, baseType: !7, size: 32, elements: !51)
!50 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!51 = !{!52, !53, !54, !55, !56, !57}
!52 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0, isUnsigned: true)
!53 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2, isUnsigned: true)
!54 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5, isUnsigned: true)
!55 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4, isUnsigned: true)
!56 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3, isUnsigned: true)
!57 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1, isUnsigned: true)
!58 = !{!59, !69, !128, !132, !136, !139, !142, !149, !152, !63, !119, !167, !171, !175, !121, !179, !183, !67, !186, !189, !192, !99, !194, !197, !193}
!59 = !DISubprogram(name: "dcgettext", scope: !60, file: !60, line: 51, type: !61, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!60 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!61 = !DISubroutineType(types: !62)
!62 = !{!63, !65, !65, !67}
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !64)
!67 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!68 = !{}
!69 = !DISubprogram(name: "fputs_unlocked", scope: !70, file: !70, line: 662, type: !71, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!70 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!71 = !DISubroutineType(types: !72)
!72 = !{!67, !65, !73}
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !76)
!75 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!76 = !{!77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !92, !93, !94, !95, !98, !100, !102, !106, !109, !111, !114, !117, !118, !120, !123, !124}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !74, file: !75, line: 51, baseType: !67, size: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !74, file: !75, line: 54, baseType: !63, size: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !74, file: !75, line: 55, baseType: !63, size: 64, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !74, file: !75, line: 56, baseType: !63, size: 64, offset: 192)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !74, file: !75, line: 57, baseType: !63, size: 64, offset: 256)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !74, file: !75, line: 58, baseType: !63, size: 64, offset: 320)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !74, file: !75, line: 59, baseType: !63, size: 64, offset: 384)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !74, file: !75, line: 60, baseType: !63, size: 64, offset: 448)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !74, file: !75, line: 61, baseType: !63, size: 64, offset: 512)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !74, file: !75, line: 64, baseType: !63, size: 64, offset: 576)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !74, file: !75, line: 65, baseType: !63, size: 64, offset: 640)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !74, file: !75, line: 66, baseType: !63, size: 64, offset: 704)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !74, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !75, line: 36, flags: DIFlagFwdDecl)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !74, file: !75, line: 70, baseType: !73, size: 64, offset: 832)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !74, file: !75, line: 72, baseType: !67, size: 32, offset: 896)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !74, file: !75, line: 73, baseType: !67, size: 32, offset: 928)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !74, file: !75, line: 74, baseType: !96, size: 64, offset: 960)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !44, line: 152, baseType: !97)
!97 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !74, file: !75, line: 77, baseType: !99, size: 16, offset: 1024)
!99 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !74, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!101 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !74, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 8, elements: !104)
!104 = !{!105}
!105 = !DISubrange(count: 1)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !74, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !75, line: 43, baseType: null)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !74, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !44, line: 153, baseType: !97)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !74, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !75, line: 37, flags: DIFlagFwdDecl)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !74, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !75, line: 38, flags: DIFlagFwdDecl)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !74, file: !75, line: 93, baseType: !73, size: 64, offset: 1344)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !74, file: !75, line: 94, baseType: !119, size: 64, offset: 1408)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !74, file: !75, line: 95, baseType: !121, size: 64, offset: 1472)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !122, line: 46, baseType: !40)
!122 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !74, file: !75, line: 96, baseType: !67, size: 32, offset: 1536)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !74, file: !75, line: 98, baseType: !125, size: 160, offset: 1568)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 160, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 20)
!128 = !DISubprogram(name: "set_program_name", scope: !129, file: !129, line: 37, type: !130, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!129 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!130 = !DISubroutineType(types: !131)
!131 = !{null, !65}
!132 = !DISubprogram(name: "setlocale", scope: !133, file: !133, line: 122, type: !134, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!133 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!134 = !DISubroutineType(types: !135)
!135 = !{!63, !67, !65}
!136 = !DISubprogram(name: "bindtextdomain", scope: !60, file: !60, line: 86, type: !137, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!137 = !DISubroutineType(types: !138)
!138 = !{!63, !65, !65}
!139 = !DISubprogram(name: "textdomain", scope: !60, file: !60, line: 82, type: !140, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!140 = !DISubroutineType(types: !141)
!141 = !{!63, !65}
!142 = !DISubprogram(name: "atexit", scope: !143, file: !143, line: 595, type: !144, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!143 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!144 = !DISubroutineType(types: !145)
!145 = !{!67, !146}
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{null}
!149 = !DISubprogram(name: "setvbuf", scope: !70, file: !70, line: 308, type: !150, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!150 = !DISubroutineType(types: !151)
!151 = !{!67, !73, !63, !67, !40}
!152 = !DISubprogram(name: "getopt_long", scope: !153, file: !153, line: 66, type: !154, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!153 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!154 = !DISubroutineType(types: !155)
!155 = !{!67, !67, !156, !65, !158, !165}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !160)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !153, line: 50, size: 256, elements: !161)
!161 = !{!162, !163, !164, !166}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !160, file: !153, line: 52, baseType: !65, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !160, file: !153, line: 55, baseType: !67, size: 32, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !160, file: !153, line: 56, baseType: !165, size: 64, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !160, file: !153, line: 57, baseType: !67, size: 32, offset: 192)
!167 = !DISubprogram(name: "version_etc", scope: !168, file: !168, line: 69, type: !169, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!168 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!169 = !DISubroutineType(types: !170)
!170 = !{null, !73, !65, !65, !65, null}
!171 = !DISubprogram(name: "error", scope: !172, file: !172, line: 52, type: !173, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!172 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!173 = !DISubroutineType(types: !174)
!174 = !{null, !67, !67, !65, null}
!175 = !DISubprogram(name: "rpl_fclose", scope: !176, file: !176, line: 672, type: !177, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!176 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!177 = !DISubroutineType(types: !178)
!178 = !{!67, !73}
!179 = !DISubprogram(name: "fopen_safer", scope: !180, file: !180, line: 23, type: !181, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!180 = !DIFile(filename: "./lib/stdio-safer.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!181 = !DISubroutineType(types: !182)
!182 = !{!73, !65, !65}
!183 = !DISubprogram(name: "quotearg_n_style_colon", scope: !6, file: !6, line: 397, type: !184, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!184 = !DISubroutineType(types: !185)
!185 = !{!63, !67, !5, !65}
!186 = !DISubprogram(name: "free", scope: !143, file: !143, line: 565, type: !187, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!187 = !DISubroutineType(types: !188)
!188 = !{null, !119}
!189 = !DISubprogram(name: "dcngettext", scope: !60, file: !60, line: 73, type: !190, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!190 = !DISubroutineType(types: !191)
!191 = !{!63, !65, !65, !65, !40, !67}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!194 = !DISubprogram(name: "fadvise", scope: !50, file: !50, line: 72, type: !195, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!195 = !DISubroutineType(types: !196)
!196 = !{null, !73, !49}
!197 = !DISubprogram(name: "md5_stream", scope: !198, file: !198, line: 133, type: !199, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!198 = !DIFile(filename: "./lib/md5.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!199 = !DISubroutineType(types: !200)
!200 = !{!67, !73, !119}
!201 = !{!202, !205, !207, !0, !209, !211, !213, !215, !217, !219, !221, !274}
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 131, type: !204, isLocal: true, isDefinition: true)
!204 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(name: "min_digest_line_length", scope: !2, file: !3, line: 134, type: !121, isLocal: true, isDefinition: true)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "digest_hex_bytes", scope: !2, file: !3, line: 137, type: !121, isLocal: true, isDefinition: true)
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(name: "status_only", scope: !2, file: !3, line: 141, type: !204, isLocal: true, isDefinition: true)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "warn", scope: !2, file: !3, line: 145, type: !204, isLocal: true, isDefinition: true)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(name: "quiet", scope: !2, file: !3, line: 151, type: !204, isLocal: true, isDefinition: true)
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(name: "ignore_missing", scope: !2, file: !3, line: 148, type: !204, isLocal: true, isDefinition: true)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(name: "strict", scope: !2, file: !3, line: 155, type: !204, isLocal: true, isDefinition: true)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(name: "delim", scope: !2, file: !3, line: 161, type: !193, isLocal: true, isDefinition: true)
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(name: "bin2hex", scope: !223, file: !3, line: 730, type: !271, isLocal: true, isDefinition: true)
!223 = distinct !DISubprogram(name: "digest_check", scope: !3, file: !3, line: 652, type: !224, scopeLine: 653, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !226)
!224 = !DISubroutineType(types: !225)
!225 = !{!204, !65}
!226 = !{!227, !228, !232, !233, !234, !235, !236, !237, !238, !240, !241, !242, !243, !244, !245, !247, !248, !249, !253, !256, !257, !258, !262, !263, !269}
!227 = !DILocalVariable(name: "checkfile_name", arg: 1, scope: !223, file: !3, line: 652, type: !65)
!228 = !DILocalVariable(name: "checkfile_stream", scope: !223, file: !3, line: 654, type: !229)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !231, line: 7, baseType: !74)
!231 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "")
!232 = !DILocalVariable(name: "n_misformatted_lines", scope: !223, file: !3, line: 655, type: !41)
!233 = !DILocalVariable(name: "n_improperly_formatted_lines", scope: !223, file: !3, line: 656, type: !41)
!234 = !DILocalVariable(name: "n_mismatched_checksums", scope: !223, file: !3, line: 657, type: !41)
!235 = !DILocalVariable(name: "n_open_or_read_failures", scope: !223, file: !3, line: 658, type: !41)
!236 = !DILocalVariable(name: "properly_formatted_lines", scope: !223, file: !3, line: 659, type: !204)
!237 = !DILocalVariable(name: "matched_checksums", scope: !223, file: !3, line: 660, type: !204)
!238 = !DILocalVariable(name: "bin_buffer_unaligned", scope: !223, file: !3, line: 661, type: !239)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 160, elements: !126)
!240 = !DILocalVariable(name: "bin_buffer", scope: !223, file: !3, line: 663, type: !192)
!241 = !DILocalVariable(name: "line_number", scope: !223, file: !3, line: 664, type: !41)
!242 = !DILocalVariable(name: "line", scope: !223, file: !3, line: 665, type: !63)
!243 = !DILocalVariable(name: "line_chars_allocated", scope: !223, file: !3, line: 666, type: !121)
!244 = !DILocalVariable(name: "is_stdin", scope: !223, file: !3, line: 667, type: !204)
!245 = !DILocalVariable(name: "filename", scope: !246, file: !3, line: 690, type: !63)
!246 = distinct !DILexicalBlock(scope: !223, file: !3, line: 689, column: 5)
!247 = !DILocalVariable(name: "binary", scope: !246, file: !3, line: 691, type: !67)
!248 = !DILocalVariable(name: "hex_digest", scope: !246, file: !3, line: 692, type: !192)
!249 = !DILocalVariable(name: "line_length", scope: !246, file: !3, line: 693, type: !250)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !251, line: 108, baseType: !252)
!251 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !44, line: 193, baseType: !97)
!253 = !DILocalVariable(name: "ok", scope: !254, file: !3, line: 734, type: !204)
!254 = distinct !DILexicalBlock(scope: !255, file: !3, line: 729, column: 9)
!255 = distinct !DILexicalBlock(scope: !246, file: !3, line: 712, column: 11)
!256 = !DILocalVariable(name: "missing", scope: !254, file: !3, line: 735, type: !204)
!257 = !DILocalVariable(name: "needs_escape", scope: !254, file: !3, line: 738, type: !204)
!258 = !DILocalVariable(name: "digest_bin_bytes", scope: !259, file: !3, line: 762, type: !121)
!259 = distinct !DILexicalBlock(scope: !260, file: !3, line: 761, column: 13)
!260 = distinct !DILexicalBlock(scope: !261, file: !3, line: 755, column: 20)
!261 = distinct !DILexicalBlock(scope: !254, file: !3, line: 744, column: 15)
!262 = !DILocalVariable(name: "cnt", scope: !259, file: !3, line: 763, type: !121)
!263 = !DILocalVariable(name: "__res", scope: !264, file: !3, line: 769, type: !67)
!264 = distinct !DILexicalBlock(scope: !265, file: !3, line: 769, column: 23)
!265 = distinct !DILexicalBlock(scope: !266, file: !3, line: 769, column: 23)
!266 = distinct !DILexicalBlock(scope: !267, file: !3, line: 768, column: 17)
!267 = distinct !DILexicalBlock(scope: !268, file: !3, line: 767, column: 15)
!268 = distinct !DILexicalBlock(scope: !259, file: !3, line: 767, column: 15)
!269 = !DILocalVariable(name: "__res", scope: !270, file: !3, line: 771, type: !67)
!270 = distinct !DILexicalBlock(scope: !265, file: !3, line: 771, column: 27)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 128, elements: !272)
!272 = !{!273}
!273 = !DISubrange(count: 16)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(name: "bsd_reversed", scope: !2, file: !3, line: 158, type: !67, isLocal: true, isDefinition: true)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 3328, elements: !277)
!277 = !{!278}
!278 = !DISubrange(count: 13)
!279 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!280 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!281 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!282 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!283 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!284 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551606, DW_OP_mul, DW_OP_constu, 10, DW_OP_plus, DW_OP_stack_value))
!285 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 34, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!286 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 32, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!287 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(name: "Version", scope: !290, file: !291, line: 2, type: !65, isLocal: false, isDefinition: true)
!290 = distinct !DICompileUnit(language: DW_LANG_C99, file: !291, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, globals: !292, splitDebugInlining: false, nameTableKind: None)
!291 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!292 = !{!288}
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(name: "file_name", scope: !295, file: !296, line: 46, type: !65, isLocal: true, isDefinition: true)
!295 = distinct !DICompileUnit(language: DW_LANG_C99, file: !296, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, retainedTypes: !297, globals: !335, splitDebugInlining: false, nameTableKind: None)
!296 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!297 = !{!298, !59, !334, !171}
!298 = !DISubprogram(name: "close_stream", scope: !299, file: !299, line: 2, type: !300, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!299 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!300 = !DISubroutineType(types: !301)
!301 = !{!67, !302}
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !304)
!304 = !{!305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !303, file: !75, line: 51, baseType: !67, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !303, file: !75, line: 54, baseType: !63, size: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !303, file: !75, line: 55, baseType: !63, size: 64, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !303, file: !75, line: 56, baseType: !63, size: 64, offset: 192)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !303, file: !75, line: 57, baseType: !63, size: 64, offset: 256)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !303, file: !75, line: 58, baseType: !63, size: 64, offset: 320)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !303, file: !75, line: 59, baseType: !63, size: 64, offset: 384)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !303, file: !75, line: 60, baseType: !63, size: 64, offset: 448)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !303, file: !75, line: 61, baseType: !63, size: 64, offset: 512)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !303, file: !75, line: 64, baseType: !63, size: 64, offset: 576)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !303, file: !75, line: 65, baseType: !63, size: 64, offset: 640)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !303, file: !75, line: 66, baseType: !63, size: 64, offset: 704)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !303, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !303, file: !75, line: 70, baseType: !302, size: 64, offset: 832)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !303, file: !75, line: 72, baseType: !67, size: 32, offset: 896)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !303, file: !75, line: 73, baseType: !67, size: 32, offset: 928)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !303, file: !75, line: 74, baseType: !96, size: 64, offset: 960)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !303, file: !75, line: 77, baseType: !99, size: 16, offset: 1024)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !303, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !303, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !303, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !303, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !303, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !303, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !303, file: !75, line: 93, baseType: !302, size: 64, offset: 1344)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !303, file: !75, line: 94, baseType: !119, size: 64, offset: 1408)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !303, file: !75, line: 95, baseType: !121, size: 64, offset: 1472)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !303, file: !75, line: 96, baseType: !67, size: 32, offset: 1536)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !303, file: !75, line: 98, baseType: !125, size: 160, offset: 1568)
!334 = !DISubprogram(name: "quotearg_colon", scope: !6, file: !6, line: 391, type: !140, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!335 = !{!293, !336}
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !295, file: !296, line: 56, type: !204, isLocal: true, isDefinition: true)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "fillbuf", scope: !340, file: !341, line: 70, type: !370, isLocal: true, isDefinition: true)
!340 = distinct !DICompileUnit(language: DW_LANG_C99, file: !341, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, retainedTypes: !342, globals: !369, splitDebugInlining: false, nameTableKind: None)
!341 = !DIFile(filename: "lib/md5.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!342 = !{!63, !343, !186, !367, !65, !368}
!343 = !DISubprogram(name: "md5_process_block", scope: !198, file: !198, line: 94, type: !344, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!344 = !DISubroutineType(types: !345)
!345 = !{null, !346, !40, !348}
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "md5_ctx", file: !198, line: 69, size: 1248, elements: !350)
!350 = !{!351, !355, !356, !357, !358, !362, !363}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !349, file: !198, line: 71, baseType: !352, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !353, line: 26, baseType: !354)
!353 = !DIFile(filename: "/usr/include/bits/stdint-uintn.h", directory: "")
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !44, line: 42, baseType: !7)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !349, file: !198, line: 72, baseType: !352, size: 32, offset: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !349, file: !198, line: 73, baseType: !352, size: 32, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "D", scope: !349, file: !198, line: 74, baseType: !352, size: 32, offset: 96)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !349, file: !198, line: 76, baseType: !359, size: 64, offset: 128)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !352, size: 64, elements: !360)
!360 = !{!361}
!361 = !DISubrange(count: 2)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !349, file: !198, line: 77, baseType: !352, size: 32, offset: 192)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !349, file: !198, line: 78, baseType: !364, size: 1024, offset: 224)
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !352, size: 1024, elements: !365)
!365 = !{!366}
!366 = !DISubrange(count: 32)
!367 = !DISubprogram(name: "md5_process_bytes", scope: !198, file: !198, line: 101, type: !344, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !42, line: 90, baseType: !40)
!369 = !{!338}
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !371, size: 512, elements: !372)
!371 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !193)
!372 = !{!373}
!373 = !DISubrange(count: 64)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(name: "exit_failure", scope: !376, file: !377, line: 24, type: !379, isLocal: false, isDefinition: true)
!376 = distinct !DICompileUnit(language: DW_LANG_C99, file: !377, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, globals: !378, splitDebugInlining: false, nameTableKind: None)
!377 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!378 = !{!374}
!379 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !67)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(name: "program_name", scope: !382, file: !383, line: 33, type: !65, isLocal: false, isDefinition: true)
!382 = distinct !DICompileUnit(language: DW_LANG_C99, file: !383, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, retainedTypes: !384, globals: !420, splitDebugInlining: false, nameTableKind: None)
!383 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!384 = !{!119, !385, !63}
!385 = !DISubprogram(name: "fputs", scope: !70, file: !70, line: 626, type: !386, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!386 = !DISubroutineType(types: !387)
!387 = !{!67, !65, !388}
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !390)
!390 = !{!391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !389, file: !75, line: 51, baseType: !67, size: 32)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !389, file: !75, line: 54, baseType: !63, size: 64, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !389, file: !75, line: 55, baseType: !63, size: 64, offset: 128)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !389, file: !75, line: 56, baseType: !63, size: 64, offset: 192)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !389, file: !75, line: 57, baseType: !63, size: 64, offset: 256)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !389, file: !75, line: 58, baseType: !63, size: 64, offset: 320)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !389, file: !75, line: 59, baseType: !63, size: 64, offset: 384)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !389, file: !75, line: 60, baseType: !63, size: 64, offset: 448)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !389, file: !75, line: 61, baseType: !63, size: 64, offset: 512)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !389, file: !75, line: 64, baseType: !63, size: 64, offset: 576)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !389, file: !75, line: 65, baseType: !63, size: 64, offset: 640)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !389, file: !75, line: 66, baseType: !63, size: 64, offset: 704)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !389, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !389, file: !75, line: 70, baseType: !388, size: 64, offset: 832)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !389, file: !75, line: 72, baseType: !67, size: 32, offset: 896)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !389, file: !75, line: 73, baseType: !67, size: 32, offset: 928)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !389, file: !75, line: 74, baseType: !96, size: 64, offset: 960)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !389, file: !75, line: 77, baseType: !99, size: 16, offset: 1024)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !389, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !389, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !389, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !389, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !389, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !389, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !389, file: !75, line: 93, baseType: !388, size: 64, offset: 1344)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !389, file: !75, line: 94, baseType: !119, size: 64, offset: 1408)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !389, file: !75, line: 95, baseType: !121, size: 64, offset: 1472)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !389, file: !75, line: 96, baseType: !67, size: 32, offset: 1536)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !389, file: !75, line: 98, baseType: !125, size: 160, offset: 1568)
!420 = !{!380}
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !423, file: !424, line: 85, type: !524, isLocal: false, isDefinition: true)
!423 = distinct !DICompileUnit(language: DW_LANG_C99, file: !424, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !425, retainedTypes: !431, globals: !497, splitDebugInlining: false, nameTableKind: None)
!424 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!425 = !{!5, !426, !20}
!426 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, baseType: !7, size: 32, elements: !427)
!427 = !{!428, !429, !430}
!428 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!429 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!430 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!431 = !{!432, !436, !186, !452, !67, !99, !455, !121, !472, !476, !59, !482, !486, !63, !490, !493, !494}
!432 = !DISubprogram(name: "xmemdup", scope: !433, file: !433, line: 62, type: !434, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!433 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!434 = !DISubroutineType(types: !435)
!435 = !{!119, !346, !40}
!436 = !DISubprogram(name: "quotearg_alloc_mem", scope: !6, file: !6, line: 342, type: !437, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!437 = !DISubroutineType(types: !438)
!438 = !{!63, !65, !40, !439, !440}
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !442)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !424, line: 65, size: 448, elements: !443)
!443 = !{!444, !445, !446, !450, !451}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !442, file: !424, line: 68, baseType: !5, size: 32)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !442, file: !424, line: 71, baseType: !67, size: 32, offset: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !442, file: !424, line: 75, baseType: !447, size: 256, offset: 64)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !448)
!448 = !{!449}
!449 = !DISubrange(count: 8)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !442, file: !424, line: 78, baseType: !65, size: 64, offset: 320)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !442, file: !424, line: 81, baseType: !65, size: 64, offset: 384)
!452 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !6, file: !6, line: 408, type: !453, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!453 = !DISubroutineType(types: !454)
!454 = !{!63, !67, !65, !65, !65, !40}
!455 = !DISubprogram(name: "rpl_mbrtowc", scope: !456, file: !456, line: 717, type: !457, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!456 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!457 = !DISubroutineType(types: !458)
!458 = !{!40, !165, !65, !40, !459}
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !461, line: 13, size: 64, elements: !462)
!461 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!462 = !{!463, !464}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !460, file: !461, line: 15, baseType: !67, size: 32)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !460, file: !461, line: 20, baseType: !465, size: 32, offset: 32)
!465 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !460, file: !461, line: 16, size: 32, elements: !466)
!466 = !{!467, !468}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !465, file: !461, line: 18, baseType: !7, size: 32)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !465, file: !461, line: 19, baseType: !469, size: 32)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 32, elements: !470)
!470 = !{!471}
!471 = !DISubrange(count: 4)
!472 = !DISubprogram(name: "iswprint", scope: !473, file: !473, line: 120, type: !474, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!473 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!474 = !DISubroutineType(types: !475)
!475 = !{!67, !7}
!476 = !DISubprogram(name: "mbsinit", scope: !477, file: !477, line: 292, type: !478, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!477 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!478 = !DISubroutineType(types: !479)
!479 = !{!67, !480}
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !460)
!482 = !DISubprogram(name: "locale_charset", scope: !483, file: !483, line: 35, type: !484, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!483 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!484 = !DISubroutineType(types: !485)
!485 = !{!65}
!486 = !DISubprogram(name: "c_strcasecmp", scope: !487, file: !487, line: 42, type: !488, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!487 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!488 = !DISubroutineType(types: !489)
!489 = !{!67, !65, !65}
!490 = !DISubprogram(name: "xmalloc", scope: !433, file: !433, line: 53, type: !491, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!491 = !DISubroutineType(types: !492)
!492 = !{!119, !40}
!493 = !DISubprogram(name: "xalloc_die", scope: !433, file: !433, line: 51, type: !147, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !68)
!494 = !DISubprogram(name: "xrealloc", scope: !433, file: !433, line: 59, type: !495, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!495 = !DISubroutineType(types: !496)
!496 = !{!119, !119, !40}
!497 = !{!421, !498, !504, !506, !508, !513, !520, !522}
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !423, file: !424, line: 101, type: !500, isLocal: false, isDefinition: true)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, size: 320, elements: !502)
!501 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!502 = !{!503}
!503 = !DISubrange(count: 10)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !423, file: !424, line: 1052, type: !442, isLocal: false, isDefinition: true)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !423, file: !424, line: 116, type: !442, isLocal: true, isDefinition: true)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(name: "slot0", scope: !423, file: !424, line: 842, type: !510, isLocal: true, isDefinition: true)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 2048, elements: !511)
!511 = !{!512}
!512 = !DISubrange(count: 256)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(name: "slotvec", scope: !423, file: !424, line: 845, type: !515, isLocal: true, isDefinition: true)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !424, line: 834, size: 128, elements: !517)
!517 = !{!518, !519}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !516, file: !424, line: 836, baseType: !121, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !516, file: !424, line: 837, baseType: !63, size: 64, offset: 64)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(name: "nslots", scope: !423, file: !424, line: 843, type: !67, isLocal: true, isDefinition: true)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(name: "slotvec0", scope: !423, file: !424, line: 844, type: !516, isLocal: true, isDefinition: true)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !525, size: 704, elements: !526)
!525 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!526 = !{!527}
!527 = !DISubrange(count: 11)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !530, file: !531, line: 26, type: !533, isLocal: false, isDefinition: true)
!530 = distinct !DICompileUnit(language: DW_LANG_C99, file: !531, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, globals: !532, splitDebugInlining: false, nameTableKind: None)
!531 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!532 = !{!528}
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 376, elements: !534)
!534 = !{!535}
!535 = !DISubrange(count: 47)
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !538, file: !539, line: 507, type: !67, isLocal: true, isDefinition: true)
!538 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !539, file: !539, line: 488, type: !540, scopeLine: 489, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !542, retainedNodes: !553)
!539 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!540 = !DISubroutineType(types: !541)
!541 = !{!67, !67, !67}
!542 = distinct !DICompileUnit(language: DW_LANG_C99, file: !539, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, retainedTypes: !543, globals: !552, splitDebugInlining: false, nameTableKind: None)
!543 = !{!544, !548}
!544 = !DISubprogram(name: "fcntl", scope: !545, file: !545, line: 176, type: !546, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!545 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
!546 = !DISubroutineType(types: !547)
!547 = !{!67, !67, !67, null}
!548 = !DISubprogram(name: "close", scope: !549, file: !549, line: 353, type: !550, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!549 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!550 = !DISubroutineType(types: !551)
!551 = !{!67, !67}
!552 = !{!536}
!553 = !{!554, !555, !556, !557, !560}
!554 = !DILocalVariable(name: "fd", arg: 1, scope: !538, file: !539, line: 488, type: !67)
!555 = !DILocalVariable(name: "target", arg: 2, scope: !538, file: !539, line: 488, type: !67)
!556 = !DILocalVariable(name: "result", scope: !538, file: !539, line: 490, type: !67)
!557 = !DILocalVariable(name: "flags", scope: !558, file: !539, line: 531, type: !67)
!558 = distinct !DILexicalBlock(scope: !559, file: !539, line: 530, column: 5)
!559 = distinct !DILexicalBlock(scope: !538, file: !539, line: 529, column: 7)
!560 = !DILocalVariable(name: "saved_errno", scope: !561, file: !539, line: 534, type: !67)
!561 = distinct !DILexicalBlock(scope: !562, file: !539, line: 533, column: 9)
!562 = distinct !DILexicalBlock(scope: !558, file: !539, line: 532, column: 11)
!563 = distinct !DICompileUnit(language: DW_LANG_C99, file: !564, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !565, retainedTypes: !566, splitDebugInlining: false, nameTableKind: None)
!564 = !DIFile(filename: "lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!565 = !{!49}
!566 = !{!567, !570}
!567 = !DISubprogram(name: "posix_fadvise", scope: !545, file: !545, line: 288, type: !568, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!568 = !DISubroutineType(types: !569)
!569 = !{!67, !67, !97, !97, !67}
!570 = !DISubprogram(name: "fileno", scope: !70, file: !70, line: 786, type: !571, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!571 = !DISubroutineType(types: !572)
!572 = !{!67, !573}
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !575)
!575 = !{!576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !574, file: !75, line: 51, baseType: !67, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !574, file: !75, line: 54, baseType: !63, size: 64, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !574, file: !75, line: 55, baseType: !63, size: 64, offset: 128)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !574, file: !75, line: 56, baseType: !63, size: 64, offset: 192)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !574, file: !75, line: 57, baseType: !63, size: 64, offset: 256)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !574, file: !75, line: 58, baseType: !63, size: 64, offset: 320)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !574, file: !75, line: 59, baseType: !63, size: 64, offset: 384)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !574, file: !75, line: 60, baseType: !63, size: 64, offset: 448)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !574, file: !75, line: 61, baseType: !63, size: 64, offset: 512)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !574, file: !75, line: 64, baseType: !63, size: 64, offset: 576)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !574, file: !75, line: 65, baseType: !63, size: 64, offset: 640)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !574, file: !75, line: 66, baseType: !63, size: 64, offset: 704)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !574, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !574, file: !75, line: 70, baseType: !573, size: 64, offset: 832)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !574, file: !75, line: 72, baseType: !67, size: 32, offset: 896)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !574, file: !75, line: 73, baseType: !67, size: 32, offset: 928)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !574, file: !75, line: 74, baseType: !96, size: 64, offset: 960)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !574, file: !75, line: 77, baseType: !99, size: 16, offset: 1024)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !574, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !574, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !574, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !574, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !574, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !574, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !574, file: !75, line: 93, baseType: !573, size: 64, offset: 1344)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !574, file: !75, line: 94, baseType: !119, size: 64, offset: 1408)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !574, file: !75, line: 95, baseType: !121, size: 64, offset: 1472)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !574, file: !75, line: 96, baseType: !67, size: 32, offset: 1536)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !574, file: !75, line: 98, baseType: !125, size: 160, offset: 1568)
!605 = distinct !DICompileUnit(language: DW_LANG_C99, file: !606, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, retainedTypes: !607, splitDebugInlining: false, nameTableKind: None)
!606 = !DIFile(filename: "lib/fopen-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!607 = !{!608, !643, !645, !646, !548}
!608 = !DISubprogram(name: "fileno", scope: !70, file: !70, line: 786, type: !609, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!609 = !DISubroutineType(types: !610)
!610 = !{!67, !611}
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !613)
!613 = !{!614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !612, file: !75, line: 51, baseType: !67, size: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !612, file: !75, line: 54, baseType: !63, size: 64, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !612, file: !75, line: 55, baseType: !63, size: 64, offset: 128)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !612, file: !75, line: 56, baseType: !63, size: 64, offset: 192)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !612, file: !75, line: 57, baseType: !63, size: 64, offset: 256)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !612, file: !75, line: 58, baseType: !63, size: 64, offset: 320)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !612, file: !75, line: 59, baseType: !63, size: 64, offset: 384)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !612, file: !75, line: 60, baseType: !63, size: 64, offset: 448)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !612, file: !75, line: 61, baseType: !63, size: 64, offset: 512)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !612, file: !75, line: 64, baseType: !63, size: 64, offset: 576)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !612, file: !75, line: 65, baseType: !63, size: 64, offset: 640)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !612, file: !75, line: 66, baseType: !63, size: 64, offset: 704)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !612, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !612, file: !75, line: 70, baseType: !611, size: 64, offset: 832)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !612, file: !75, line: 72, baseType: !67, size: 32, offset: 896)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !612, file: !75, line: 73, baseType: !67, size: 32, offset: 928)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !612, file: !75, line: 74, baseType: !96, size: 64, offset: 960)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !612, file: !75, line: 77, baseType: !99, size: 16, offset: 1024)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !612, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !612, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !612, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !612, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !612, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !612, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !612, file: !75, line: 93, baseType: !611, size: 64, offset: 1344)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !612, file: !75, line: 94, baseType: !119, size: 64, offset: 1408)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !612, file: !75, line: 95, baseType: !121, size: 64, offset: 1472)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !612, file: !75, line: 96, baseType: !67, size: 32, offset: 1536)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !612, file: !75, line: 98, baseType: !125, size: 160, offset: 1568)
!643 = !DISubprogram(name: "dup_safer", scope: !644, file: !644, line: 20, type: !550, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!644 = !DIFile(filename: "./lib/unistd-safer.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!645 = !DISubprogram(name: "rpl_fclose", scope: !176, file: !176, line: 672, type: !609, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!646 = !DISubprogram(name: "fdopen", scope: !70, file: !70, line: 279, type: !647, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!647 = !DISubroutineType(types: !648)
!648 = !{!611, !67, !65}
!649 = distinct !DICompileUnit(language: DW_LANG_C99, file: !650, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, retainedTypes: !651, splitDebugInlining: false, nameTableKind: None)
!650 = !DIFile(filename: "lib/dup-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!651 = !{!652}
!652 = !DISubprogram(name: "rpl_fcntl", scope: !653, file: !653, line: 588, type: !546, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!653 = !DIFile(filename: "./lib/fcntl.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!654 = distinct !DICompileUnit(language: DW_LANG_C99, file: !655, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !656, retainedTypes: !660, splitDebugInlining: false, nameTableKind: None)
!655 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!656 = !{!657}
!657 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !655, line: 40, baseType: !7, size: 32, elements: !658)
!658 = !{!659}
!659 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!660 = !{!59, !661, !119}
!661 = !DISubprogram(name: "fputs_unlocked", scope: !70, file: !70, line: 662, type: !662, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!662 = !DISubroutineType(types: !663)
!663 = !{!67, !65, !664}
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !666)
!666 = !{!667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !665, file: !75, line: 51, baseType: !67, size: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !665, file: !75, line: 54, baseType: !63, size: 64, offset: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !665, file: !75, line: 55, baseType: !63, size: 64, offset: 128)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !665, file: !75, line: 56, baseType: !63, size: 64, offset: 192)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !665, file: !75, line: 57, baseType: !63, size: 64, offset: 256)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !665, file: !75, line: 58, baseType: !63, size: 64, offset: 320)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !665, file: !75, line: 59, baseType: !63, size: 64, offset: 384)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !665, file: !75, line: 60, baseType: !63, size: 64, offset: 448)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !665, file: !75, line: 61, baseType: !63, size: 64, offset: 512)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !665, file: !75, line: 64, baseType: !63, size: 64, offset: 576)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !665, file: !75, line: 65, baseType: !63, size: 64, offset: 640)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !665, file: !75, line: 66, baseType: !63, size: 64, offset: 704)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !665, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !665, file: !75, line: 70, baseType: !664, size: 64, offset: 832)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !665, file: !75, line: 72, baseType: !67, size: 32, offset: 896)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !665, file: !75, line: 73, baseType: !67, size: 32, offset: 928)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !665, file: !75, line: 74, baseType: !96, size: 64, offset: 960)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !665, file: !75, line: 77, baseType: !99, size: 16, offset: 1024)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !665, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !665, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !665, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !665, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !665, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !665, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !665, file: !75, line: 93, baseType: !664, size: 64, offset: 1344)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !665, file: !75, line: 94, baseType: !119, size: 64, offset: 1408)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !665, file: !75, line: 95, baseType: !121, size: 64, offset: 1472)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !665, file: !75, line: 96, baseType: !67, size: 32, offset: 1536)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !665, file: !75, line: 98, baseType: !125, size: 160, offset: 1568)
!696 = distinct !DICompileUnit(language: DW_LANG_C99, file: !697, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !698, retainedTypes: !711, splitDebugInlining: false, nameTableKind: None)
!697 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!698 = !{!699}
!699 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !700, file: !433, line: 186, baseType: !7, size: 32, elements: !709)
!700 = distinct !DISubprogram(name: "x2nrealloc", scope: !433, file: !433, line: 174, type: !701, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !696, retainedNodes: !704)
!701 = !DISubroutineType(types: !702)
!702 = !{!119, !119, !703, !121}
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!704 = !{!705, !706, !707, !708}
!705 = !DILocalVariable(name: "p", arg: 1, scope: !700, file: !433, line: 174, type: !119)
!706 = !DILocalVariable(name: "pn", arg: 2, scope: !700, file: !433, line: 174, type: !703)
!707 = !DILocalVariable(name: "s", arg: 3, scope: !700, file: !433, line: 174, type: !121)
!708 = !DILocalVariable(name: "n", scope: !700, file: !433, line: 176, type: !121)
!709 = !{!710}
!710 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!711 = !{!121, !493, !490, !494, !63, !186, !119, !712, !715}
!712 = !DISubprogram(name: "xcalloc", scope: !433, file: !433, line: 57, type: !713, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!713 = !DISubroutineType(types: !714)
!714 = !{!119, !40, !40}
!715 = !DISubprogram(name: "rpl_calloc", scope: !716, file: !716, line: 688, type: !713, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!716 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!717 = distinct !DICompileUnit(language: DW_LANG_C99, file: !718, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, retainedTypes: !719, splitDebugInlining: false, nameTableKind: None)
!718 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!719 = !{!59, !171}
!720 = distinct !DICompileUnit(language: DW_LANG_C99, file: !721, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, retainedTypes: !722, splitDebugInlining: false, nameTableKind: None)
!721 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!722 = !{!119}
!723 = distinct !DICompileUnit(language: DW_LANG_C99, file: !724, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, retainedTypes: !725, splitDebugInlining: false, nameTableKind: None)
!724 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!725 = !{!726, !761, !762, !765}
!726 = !DISubprogram(name: "fileno", scope: !70, file: !70, line: 786, type: !727, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!727 = !DISubroutineType(types: !728)
!728 = !{!67, !729}
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !731)
!731 = !{!732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !730, file: !75, line: 51, baseType: !67, size: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !730, file: !75, line: 54, baseType: !63, size: 64, offset: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !730, file: !75, line: 55, baseType: !63, size: 64, offset: 128)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !730, file: !75, line: 56, baseType: !63, size: 64, offset: 192)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !730, file: !75, line: 57, baseType: !63, size: 64, offset: 256)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !730, file: !75, line: 58, baseType: !63, size: 64, offset: 320)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !730, file: !75, line: 59, baseType: !63, size: 64, offset: 384)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !730, file: !75, line: 60, baseType: !63, size: 64, offset: 448)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !730, file: !75, line: 61, baseType: !63, size: 64, offset: 512)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !730, file: !75, line: 64, baseType: !63, size: 64, offset: 576)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !730, file: !75, line: 65, baseType: !63, size: 64, offset: 640)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !730, file: !75, line: 66, baseType: !63, size: 64, offset: 704)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !730, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !730, file: !75, line: 70, baseType: !729, size: 64, offset: 832)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !730, file: !75, line: 72, baseType: !67, size: 32, offset: 896)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !730, file: !75, line: 73, baseType: !67, size: 32, offset: 928)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !730, file: !75, line: 74, baseType: !96, size: 64, offset: 960)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !730, file: !75, line: 77, baseType: !99, size: 16, offset: 1024)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !730, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !730, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !730, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !730, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !730, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !730, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !730, file: !75, line: 93, baseType: !729, size: 64, offset: 1344)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !730, file: !75, line: 94, baseType: !119, size: 64, offset: 1408)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !730, file: !75, line: 95, baseType: !121, size: 64, offset: 1472)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !730, file: !75, line: 96, baseType: !67, size: 32, offset: 1536)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !730, file: !75, line: 98, baseType: !125, size: 160, offset: 1568)
!761 = !DISubprogram(name: "fclose", scope: !70, file: !70, line: 213, type: !727, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!762 = !DISubprogram(name: "lseek", scope: !549, file: !549, line: 334, type: !763, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!763 = !DISubroutineType(types: !764)
!764 = !{!97, !67, !97, !67}
!765 = !DISubprogram(name: "rpl_fflush", scope: !176, file: !176, line: 718, type: !727, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!766 = distinct !DICompileUnit(language: DW_LANG_C99, file: !767, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, retainedTypes: !768, splitDebugInlining: false, nameTableKind: None)
!767 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!768 = !{!119, !769, !804}
!769 = !DISubprogram(name: "fflush", scope: !70, file: !70, line: 218, type: !770, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!770 = !DISubroutineType(types: !771)
!771 = !{!67, !772}
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !774)
!774 = !{!775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !773, file: !75, line: 51, baseType: !67, size: 32)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !773, file: !75, line: 54, baseType: !63, size: 64, offset: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !773, file: !75, line: 55, baseType: !63, size: 64, offset: 128)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !773, file: !75, line: 56, baseType: !63, size: 64, offset: 192)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !773, file: !75, line: 57, baseType: !63, size: 64, offset: 256)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !773, file: !75, line: 58, baseType: !63, size: 64, offset: 320)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !773, file: !75, line: 59, baseType: !63, size: 64, offset: 384)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !773, file: !75, line: 60, baseType: !63, size: 64, offset: 448)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !773, file: !75, line: 61, baseType: !63, size: 64, offset: 512)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !773, file: !75, line: 64, baseType: !63, size: 64, offset: 576)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !773, file: !75, line: 65, baseType: !63, size: 64, offset: 640)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !773, file: !75, line: 66, baseType: !63, size: 64, offset: 704)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !773, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !773, file: !75, line: 70, baseType: !772, size: 64, offset: 832)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !773, file: !75, line: 72, baseType: !67, size: 32, offset: 896)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !773, file: !75, line: 73, baseType: !67, size: 32, offset: 928)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !773, file: !75, line: 74, baseType: !96, size: 64, offset: 960)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !773, file: !75, line: 77, baseType: !99, size: 16, offset: 1024)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !773, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !773, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !773, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !773, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !773, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !773, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !773, file: !75, line: 93, baseType: !772, size: 64, offset: 1344)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !773, file: !75, line: 94, baseType: !119, size: 64, offset: 1408)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !773, file: !75, line: 95, baseType: !121, size: 64, offset: 1472)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !773, file: !75, line: 96, baseType: !67, size: 32, offset: 1536)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !773, file: !75, line: 98, baseType: !125, size: 160, offset: 1568)
!804 = !DISubprogram(name: "rpl_fseeko", scope: !176, file: !176, line: 1034, type: !805, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!805 = !DISubroutineType(types: !806)
!806 = !{!67, !772, !97, !67}
!807 = distinct !DICompileUnit(language: DW_LANG_C99, file: !808, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, retainedTypes: !809, splitDebugInlining: false, nameTableKind: None)
!808 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!809 = !{!119, !810, !762, !845}
!810 = !DISubprogram(name: "fileno", scope: !70, file: !70, line: 786, type: !811, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!811 = !DISubroutineType(types: !812)
!812 = !{!67, !813}
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !815)
!815 = !{!816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !814, file: !75, line: 51, baseType: !67, size: 32)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !814, file: !75, line: 54, baseType: !63, size: 64, offset: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !814, file: !75, line: 55, baseType: !63, size: 64, offset: 128)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !814, file: !75, line: 56, baseType: !63, size: 64, offset: 192)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !814, file: !75, line: 57, baseType: !63, size: 64, offset: 256)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !814, file: !75, line: 58, baseType: !63, size: 64, offset: 320)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !814, file: !75, line: 59, baseType: !63, size: 64, offset: 384)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !814, file: !75, line: 60, baseType: !63, size: 64, offset: 448)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !814, file: !75, line: 61, baseType: !63, size: 64, offset: 512)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !814, file: !75, line: 64, baseType: !63, size: 64, offset: 576)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !814, file: !75, line: 65, baseType: !63, size: 64, offset: 640)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !814, file: !75, line: 66, baseType: !63, size: 64, offset: 704)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !814, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !814, file: !75, line: 70, baseType: !813, size: 64, offset: 832)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !814, file: !75, line: 72, baseType: !67, size: 32, offset: 896)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !814, file: !75, line: 73, baseType: !67, size: 32, offset: 928)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !814, file: !75, line: 74, baseType: !96, size: 64, offset: 960)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !814, file: !75, line: 77, baseType: !99, size: 16, offset: 1024)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !814, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !814, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !814, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !814, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !814, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !814, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !814, file: !75, line: 93, baseType: !813, size: 64, offset: 1344)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !814, file: !75, line: 94, baseType: !119, size: 64, offset: 1408)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !814, file: !75, line: 95, baseType: !121, size: 64, offset: 1472)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !814, file: !75, line: 96, baseType: !67, size: 32, offset: 1536)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !814, file: !75, line: 98, baseType: !125, size: 160, offset: 1568)
!845 = !DISubprogram(name: "fseeko", scope: !70, file: !70, line: 707, type: !846, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!846 = !DISubroutineType(types: !847)
!847 = !{!67, !813, !97, !67}
!848 = distinct !DICompileUnit(language: DW_LANG_C99, file: !849, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, retainedTypes: !850, splitDebugInlining: false, nameTableKind: None)
!849 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!850 = !{!851, !121, !863}
!851 = !DISubprogram(name: "mbrtowc", scope: !477, file: !477, line: 296, type: !852, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!852 = !DISubroutineType(types: !853)
!853 = !{!40, !165, !65, !40, !854}
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !461, line: 13, size: 64, elements: !856)
!856 = !{!857, !858}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !855, file: !461, line: 15, baseType: !67, size: 32)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !855, file: !461, line: 20, baseType: !859, size: 32, offset: 32)
!859 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !855, file: !461, line: 16, size: 32, elements: !860)
!860 = !{!861, !862}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !859, file: !461, line: 18, baseType: !7, size: 32)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !859, file: !461, line: 19, baseType: !469, size: 32)
!863 = !DISubprogram(name: "hard_locale", scope: !864, file: !864, line: 26, type: !865, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!864 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!865 = !DISubroutineType(types: !866)
!866 = !{!204, !67}
!867 = distinct !DICompileUnit(language: DW_LANG_C99, file: !868, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, retainedTypes: !869, splitDebugInlining: false, nameTableKind: None)
!868 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!869 = !{!870}
!870 = !DISubprogram(name: "rpl_fclose", scope: !176, file: !176, line: 672, type: !871, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!871 = !DISubroutineType(types: !872)
!872 = !{!67, !873}
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !875)
!875 = !{!876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !874, file: !75, line: 51, baseType: !67, size: 32)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !874, file: !75, line: 54, baseType: !63, size: 64, offset: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !874, file: !75, line: 55, baseType: !63, size: 64, offset: 128)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !874, file: !75, line: 56, baseType: !63, size: 64, offset: 192)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !874, file: !75, line: 57, baseType: !63, size: 64, offset: 256)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !874, file: !75, line: 58, baseType: !63, size: 64, offset: 320)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !874, file: !75, line: 59, baseType: !63, size: 64, offset: 384)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !874, file: !75, line: 60, baseType: !63, size: 64, offset: 448)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !874, file: !75, line: 61, baseType: !63, size: 64, offset: 512)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !874, file: !75, line: 64, baseType: !63, size: 64, offset: 576)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !874, file: !75, line: 65, baseType: !63, size: 64, offset: 640)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !874, file: !75, line: 66, baseType: !63, size: 64, offset: 704)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !874, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !874, file: !75, line: 70, baseType: !873, size: 64, offset: 832)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !874, file: !75, line: 72, baseType: !67, size: 32, offset: 896)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !874, file: !75, line: 73, baseType: !67, size: 32, offset: 928)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !874, file: !75, line: 74, baseType: !96, size: 64, offset: 960)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !874, file: !75, line: 77, baseType: !99, size: 16, offset: 1024)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !874, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !874, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !874, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !874, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !874, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !874, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !874, file: !75, line: 93, baseType: !873, size: 64, offset: 1344)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !874, file: !75, line: 94, baseType: !119, size: 64, offset: 1408)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !874, file: !75, line: 95, baseType: !121, size: 64, offset: 1472)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !874, file: !75, line: 96, baseType: !67, size: 32, offset: 1536)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !874, file: !75, line: 98, baseType: !125, size: 160, offset: 1568)
!905 = distinct !DICompileUnit(language: DW_LANG_C99, file: !906, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, retainedTypes: !907, splitDebugInlining: false, nameTableKind: None)
!906 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!907 = !{!908}
!908 = !DISubprogram(name: "setlocale_null_r", scope: !909, file: !909, line: 64, type: !910, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!909 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!910 = !DISubroutineType(types: !911)
!911 = !{!67, !67, !63, !40}
!912 = distinct !DICompileUnit(language: DW_LANG_C99, file: !913, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !914, retainedTypes: !1301, splitDebugInlining: false, nameTableKind: None)
!913 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!914 = !{!915}
!915 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !916, line: 41, baseType: !7, size: 32, elements: !917)
!916 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
