; ModuleID = 'coreutils-8.32/src/mkdir.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.mkdir_options = type { i32 (i8*, i8*, i8*)*, i32, i32, i32, i8, i8* }
%struct.mode_change = type { i8, i8, i32, i32, i32 }
%struct.savewd = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [36 x i8] c"Usage: %s [OPTION]... DIRECTORY...\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 41, type: !216, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !43, globals: !215, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/mkdir.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !29}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !7, file: !6, line: 39, baseType: !21, size: 32, elements: !22)
!6 = !DIFile(filename: "./lib/savewd.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savewd", file: !6, line: 36, size: 64, elements: !8)
!8 = !{!9, !10}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !7, file: !6, line: 66, baseType: !5, size: 32)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !7, file: !6, line: 74, baseType: !11, size: 32, offset: 32)
!11 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !7, file: !6, line: 69, size: 32, elements: !12)
!12 = !{!13, !15, !16}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !11, file: !6, line: 71, baseType: !14, size: 32)
!14 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "errnum", scope: !11, file: !6, line: 72, baseType: !14, size: 32)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !11, file: !6, line: 73, baseType: !17, size: 32)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !18, line: 97, baseType: !19)
!18 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !20, line: 154, baseType: !14)
!20 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!21 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!22 = !{!23, !24, !25, !26, !27, !28}
!23 = !DIEnumerator(name: "INITIAL_STATE", value: 0, isUnsigned: true)
!24 = !DIEnumerator(name: "FD_STATE", value: 1, isUnsigned: true)
!25 = !DIEnumerator(name: "FD_POST_CHDIR_STATE", value: 2, isUnsigned: true)
!26 = !DIEnumerator(name: "FORKING_STATE", value: 3, isUnsigned: true)
!27 = !DIEnumerator(name: "ERROR_STATE", value: 4, isUnsigned: true)
!28 = !DIEnumerator(name: "FINAL_STATE", value: 5, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !30, line: 32, baseType: !21, size: 32, elements: !31)
!30 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!31 = !{!32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42}
!32 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!33 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!34 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!35 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!36 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!37 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!38 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!39 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!40 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!41 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!42 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!43 = !{!44, !53, !113, !117, !121, !124, !127, !134, !149, !48, !103, !153, !157, !161, !165, !171, !178, !181, !189, !192, !195, !199, !201, !203, !213}
!44 = !DISubprogram(name: "dcgettext", scope: !45, file: !45, line: 51, type: !46, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!45 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!46 = !DISubroutineType(types: !47)
!47 = !{!48, !50, !50, !14}
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!52 = !{}
!53 = !DISubprogram(name: "fputs_unlocked", scope: !54, file: !54, line: 662, type: !55, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!54 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!55 = !DISubroutineType(types: !56)
!56 = !{!14, !50, !57}
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !59, line: 49, size: 1728, elements: !60)
!59 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!60 = !{!61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !76, !77, !78, !79, !82, !84, !86, !90, !93, !95, !98, !101, !102, !104, !108, !109}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !58, file: !59, line: 51, baseType: !14, size: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !58, file: !59, line: 54, baseType: !48, size: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !58, file: !59, line: 55, baseType: !48, size: 64, offset: 128)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !58, file: !59, line: 56, baseType: !48, size: 64, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !58, file: !59, line: 57, baseType: !48, size: 64, offset: 256)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !58, file: !59, line: 58, baseType: !48, size: 64, offset: 320)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !58, file: !59, line: 59, baseType: !48, size: 64, offset: 384)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !58, file: !59, line: 60, baseType: !48, size: 64, offset: 448)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !58, file: !59, line: 61, baseType: !48, size: 64, offset: 512)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !58, file: !59, line: 64, baseType: !48, size: 64, offset: 576)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !58, file: !59, line: 65, baseType: !48, size: 64, offset: 640)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !58, file: !59, line: 66, baseType: !48, size: 64, offset: 704)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !58, file: !59, line: 68, baseType: !74, size: 64, offset: 768)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !59, line: 36, flags: DIFlagFwdDecl)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !58, file: !59, line: 70, baseType: !57, size: 64, offset: 832)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !58, file: !59, line: 72, baseType: !14, size: 32, offset: 896)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !58, file: !59, line: 73, baseType: !14, size: 32, offset: 928)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !58, file: !59, line: 74, baseType: !80, size: 64, offset: 960)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !20, line: 152, baseType: !81)
!81 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !58, file: !59, line: 77, baseType: !83, size: 16, offset: 1024)
!83 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !58, file: !59, line: 78, baseType: !85, size: 8, offset: 1040)
!85 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !58, file: !59, line: 79, baseType: !87, size: 8, offset: 1048)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 8, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 1)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !58, file: !59, line: 81, baseType: !91, size: 64, offset: 1088)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !59, line: 43, baseType: null)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !58, file: !59, line: 89, baseType: !94, size: 64, offset: 1152)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !20, line: 153, baseType: !81)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !58, file: !59, line: 91, baseType: !96, size: 64, offset: 1216)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !59, line: 37, flags: DIFlagFwdDecl)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !58, file: !59, line: 92, baseType: !99, size: 64, offset: 1280)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !59, line: 38, flags: DIFlagFwdDecl)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !58, file: !59, line: 93, baseType: !57, size: 64, offset: 1344)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !58, file: !59, line: 94, baseType: !103, size: 64, offset: 1408)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !58, file: !59, line: 95, baseType: !105, size: 64, offset: 1472)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !106, line: 46, baseType: !107)
!106 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!107 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !58, file: !59, line: 96, baseType: !14, size: 32, offset: 1536)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !58, file: !59, line: 98, baseType: !110, size: 160, offset: 1568)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 160, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 20)
!113 = !DISubprogram(name: "set_program_name", scope: !114, file: !114, line: 37, type: !115, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!114 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!115 = !DISubroutineType(types: !116)
!116 = !{null, !50}
!117 = !DISubprogram(name: "setlocale", scope: !118, file: !118, line: 122, type: !119, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!118 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!119 = !DISubroutineType(types: !120)
!120 = !{!48, !14, !50}
!121 = !DISubprogram(name: "bindtextdomain", scope: !45, file: !45, line: 86, type: !122, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!122 = !DISubroutineType(types: !123)
!123 = !{!48, !50, !50}
!124 = !DISubprogram(name: "textdomain", scope: !45, file: !45, line: 82, type: !125, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!125 = !DISubroutineType(types: !126)
!126 = !{!48, !50}
!127 = !DISubprogram(name: "atexit", scope: !128, file: !128, line: 595, type: !129, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!128 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!129 = !DISubroutineType(types: !130)
!130 = !{!14, !131}
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{null}
!134 = !DISubprogram(name: "getopt_long", scope: !135, file: !135, line: 66, type: !136, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!135 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!136 = !DISubroutineType(types: !137)
!137 = !{!14, !14, !138, !50, !140, !147}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !142)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !135, line: 50, size: 256, elements: !143)
!143 = !{!144, !145, !146, !148}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !142, file: !135, line: 52, baseType: !50, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !142, file: !135, line: 55, baseType: !14, size: 32, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !142, file: !135, line: 56, baseType: !147, size: 64, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !142, file: !135, line: 57, baseType: !14, size: 32, offset: 192)
!149 = !DISubprogram(name: "error", scope: !150, file: !150, line: 52, type: !151, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!150 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!151 = !DISubroutineType(types: !152)
!152 = !{null, !14, !14, !50, null}
!153 = !DISubprogram(name: "version_etc", scope: !154, file: !154, line: 69, type: !155, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!154 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!155 = !DISubroutineType(types: !156)
!156 = !{null, !57, !50, !50, !50, null}
!157 = !DISubprogram(name: "quote", scope: !158, file: !158, line: 44, type: !159, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!158 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!159 = !DISubroutineType(types: !160)
!160 = !{!50, !50}
!161 = !DISubprogram(name: "umask", scope: !162, file: !162, line: 308, type: !163, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!162 = !DIFile(filename: "/usr/include/sys/stat.h", directory: "")
!163 = !DISubroutineType(types: !164)
!164 = !{!21, !21}
!165 = !DISubprogram(name: "mode_compile", scope: !166, file: !166, line: 25, type: !167, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!166 = !DIFile(filename: "./lib/modechange.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!167 = !DISubroutineType(types: !168)
!168 = !{!169, !50}
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "mode_change", file: !166, line: 25, flags: DIFlagFwdDecl)
!171 = !DISubprogram(name: "mode_adjust", scope: !166, file: !166, line: 27, type: !172, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!172 = !DISubroutineType(types: !173)
!173 = !{!21, !21, !174, !21, !175, !177}
!174 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !170)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!178 = !DISubprogram(name: "free", scope: !128, file: !128, line: 565, type: !179, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!179 = !DISubroutineType(types: !180)
!180 = !{null, !103}
!181 = !DISubprogram(name: "savewd_process_files", scope: !6, file: !6, line: 147, type: !182, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!182 = !DISubroutineType(types: !183)
!183 = !{!14, !14, !184, !185, !103}
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{!14, !48, !188, !103}
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!189 = !DISubprogram(name: "quotearg_style", scope: !30, file: !30, line: 377, type: !190, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!190 = !DISubroutineType(types: !191)
!191 = !{!48, !29, !50}
!192 = !DISubprogram(name: "mkdir", scope: !162, file: !162, line: 317, type: !193, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!193 = !DISubroutineType(types: !194)
!194 = !{!14, !50, !21}
!195 = !DISubprogram(name: "prog_fprintf", scope: !196, file: !196, line: 22, type: !197, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!196 = !DIFile(filename: "src/prog-fprintf.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!197 = !DISubroutineType(types: !198)
!198 = !{null, !57, !50, null}
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !18, line: 79, baseType: !200)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !20, line: 146, baseType: !21)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !18, line: 64, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !20, line: 147, baseType: !21)
!203 = !DISubprogram(name: "make_dir_parents", scope: !204, file: !204, line: 25, type: !205, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!204 = !DIFile(filename: "./lib/mkdir-p.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!205 = !DISubroutineType(types: !206)
!206 = !{!174, !48, !188, !207, !103, !21, !210, !21, !21, !21, !174}
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{!14, !50, !50, !103}
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{null, !50, !103}
!213 = !DISubprogram(name: "last_component", scope: !214, file: !214, line: 46, type: !125, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!214 = !DIFile(filename: "./lib/dirname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!215 = !{!0}
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 1792, elements: !217)
!217 = !{!218}
!218 = !DISubrange(count: 7)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(name: "Version", scope: !221, file: !222, line: 2, type: !50, isLocal: false, isDefinition: true)
!221 = distinct !DICompileUnit(language: DW_LANG_C99, file: !222, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !52, globals: !223, splitDebugInlining: false, nameTableKind: None)
!222 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!223 = !{!219}
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(name: "file_name", scope: !226, file: !227, line: 46, type: !50, isLocal: true, isDefinition: true)
!226 = distinct !DICompileUnit(language: DW_LANG_C99, file: !227, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !52, retainedTypes: !228, globals: !266, splitDebugInlining: false, nameTableKind: None)
!227 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!228 = !{!229, !44, !265, !149}
!229 = !DISubprogram(name: "close_stream", scope: !230, file: !230, line: 2, type: !231, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!230 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!231 = !DISubroutineType(types: !232)
!232 = !{!14, !233}
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !59, line: 49, size: 1728, elements: !235)
!235 = !{!236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !234, file: !59, line: 51, baseType: !14, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !234, file: !59, line: 54, baseType: !48, size: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !234, file: !59, line: 55, baseType: !48, size: 64, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !234, file: !59, line: 56, baseType: !48, size: 64, offset: 192)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !234, file: !59, line: 57, baseType: !48, size: 64, offset: 256)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !234, file: !59, line: 58, baseType: !48, size: 64, offset: 320)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !234, file: !59, line: 59, baseType: !48, size: 64, offset: 384)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !234, file: !59, line: 60, baseType: !48, size: 64, offset: 448)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !234, file: !59, line: 61, baseType: !48, size: 64, offset: 512)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !234, file: !59, line: 64, baseType: !48, size: 64, offset: 576)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !234, file: !59, line: 65, baseType: !48, size: 64, offset: 640)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !234, file: !59, line: 66, baseType: !48, size: 64, offset: 704)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !234, file: !59, line: 68, baseType: !74, size: 64, offset: 768)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !234, file: !59, line: 70, baseType: !233, size: 64, offset: 832)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !234, file: !59, line: 72, baseType: !14, size: 32, offset: 896)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !234, file: !59, line: 73, baseType: !14, size: 32, offset: 928)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !234, file: !59, line: 74, baseType: !80, size: 64, offset: 960)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !234, file: !59, line: 77, baseType: !83, size: 16, offset: 1024)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !234, file: !59, line: 78, baseType: !85, size: 8, offset: 1040)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !234, file: !59, line: 79, baseType: !87, size: 8, offset: 1048)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !234, file: !59, line: 81, baseType: !91, size: 64, offset: 1088)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !234, file: !59, line: 89, baseType: !94, size: 64, offset: 1152)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !234, file: !59, line: 91, baseType: !96, size: 64, offset: 1216)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !234, file: !59, line: 92, baseType: !99, size: 64, offset: 1280)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !234, file: !59, line: 93, baseType: !233, size: 64, offset: 1344)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !234, file: !59, line: 94, baseType: !103, size: 64, offset: 1408)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !234, file: !59, line: 95, baseType: !105, size: 64, offset: 1472)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !234, file: !59, line: 96, baseType: !14, size: 32, offset: 1536)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !234, file: !59, line: 98, baseType: !110, size: 160, offset: 1568)
!265 = !DISubprogram(name: "quotearg_colon", scope: !30, file: !30, line: 391, type: !125, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!266 = !{!224, !267}
!267 = !DIGlobalVariableExpression(var: !268, expr: !DIExpression())
!268 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !226, file: !227, line: 56, type: !174, isLocal: true, isDefinition: true)
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(name: "exit_failure", scope: !271, file: !272, line: 24, type: !274, isLocal: false, isDefinition: true)
!271 = distinct !DICompileUnit(language: DW_LANG_C99, file: !272, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !52, globals: !273, splitDebugInlining: false, nameTableKind: None)
!272 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!273 = !{!269}
!274 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !14)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(name: "program_name", scope: !277, file: !278, line: 33, type: !50, isLocal: false, isDefinition: true)
!277 = distinct !DICompileUnit(language: DW_LANG_C99, file: !278, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !52, retainedTypes: !279, globals: !315, splitDebugInlining: false, nameTableKind: None)
!278 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!279 = !{!103, !280, !48}
!280 = !DISubprogram(name: "fputs", scope: !54, file: !54, line: 626, type: !281, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!281 = !DISubroutineType(types: !282)
!282 = !{!14, !50, !283}
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !59, line: 49, size: 1728, elements: !285)
!285 = !{!286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !284, file: !59, line: 51, baseType: !14, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !284, file: !59, line: 54, baseType: !48, size: 64, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !284, file: !59, line: 55, baseType: !48, size: 64, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !284, file: !59, line: 56, baseType: !48, size: 64, offset: 192)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !284, file: !59, line: 57, baseType: !48, size: 64, offset: 256)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !284, file: !59, line: 58, baseType: !48, size: 64, offset: 320)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !284, file: !59, line: 59, baseType: !48, size: 64, offset: 384)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !284, file: !59, line: 60, baseType: !48, size: 64, offset: 448)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !284, file: !59, line: 61, baseType: !48, size: 64, offset: 512)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !284, file: !59, line: 64, baseType: !48, size: 64, offset: 576)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !284, file: !59, line: 65, baseType: !48, size: 64, offset: 640)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !284, file: !59, line: 66, baseType: !48, size: 64, offset: 704)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !284, file: !59, line: 68, baseType: !74, size: 64, offset: 768)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !284, file: !59, line: 70, baseType: !283, size: 64, offset: 832)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !284, file: !59, line: 72, baseType: !14, size: 32, offset: 896)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !284, file: !59, line: 73, baseType: !14, size: 32, offset: 928)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !284, file: !59, line: 74, baseType: !80, size: 64, offset: 960)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !284, file: !59, line: 77, baseType: !83, size: 16, offset: 1024)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !284, file: !59, line: 78, baseType: !85, size: 8, offset: 1040)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !284, file: !59, line: 79, baseType: !87, size: 8, offset: 1048)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !284, file: !59, line: 81, baseType: !91, size: 64, offset: 1088)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !284, file: !59, line: 89, baseType: !94, size: 64, offset: 1152)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !284, file: !59, line: 91, baseType: !96, size: 64, offset: 1216)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !284, file: !59, line: 92, baseType: !99, size: 64, offset: 1280)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !284, file: !59, line: 93, baseType: !283, size: 64, offset: 1344)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !284, file: !59, line: 94, baseType: !103, size: 64, offset: 1408)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !284, file: !59, line: 95, baseType: !105, size: 64, offset: 1472)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !284, file: !59, line: 96, baseType: !14, size: 32, offset: 1536)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !284, file: !59, line: 98, baseType: !110, size: 160, offset: 1568)
!315 = !{!275}
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !318, file: !319, line: 85, type: !436, isLocal: false, isDefinition: true)
!318 = distinct !DICompileUnit(language: DW_LANG_C99, file: !319, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !320, retainedTypes: !341, globals: !409, splitDebugInlining: false, nameTableKind: None)
!319 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!320 = !{!29, !321, !326}
!321 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !30, line: 242, baseType: !21, size: 32, elements: !322)
!322 = !{!323, !324, !325}
!323 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!324 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!325 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!326 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !327, line: 46, baseType: !21, size: 32, elements: !328)
!327 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!328 = !{!329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340}
!329 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!330 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!331 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!332 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!333 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!334 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!335 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!336 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!337 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!338 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!339 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!340 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!341 = !{!342, !348, !178, !364, !14, !83, !367, !105, !384, !388, !44, !394, !398, !48, !402, !405, !406}
!342 = !DISubprogram(name: "xmemdup", scope: !343, file: !343, line: 62, type: !344, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!343 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!344 = !DISubroutineType(types: !345)
!345 = !{!103, !346, !107}
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!348 = !DISubprogram(name: "quotearg_alloc_mem", scope: !30, file: !30, line: 342, type: !349, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!349 = !DISubroutineType(types: !350)
!350 = !{!48, !50, !107, !351, !352}
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !354)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !319, line: 65, size: 448, elements: !355)
!355 = !{!356, !357, !358, !362, !363}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !354, file: !319, line: 68, baseType: !29, size: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !354, file: !319, line: 71, baseType: !14, size: 32, offset: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !354, file: !319, line: 75, baseType: !359, size: 256, offset: 64)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 256, elements: !360)
!360 = !{!361}
!361 = !DISubrange(count: 8)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !354, file: !319, line: 78, baseType: !50, size: 64, offset: 320)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !354, file: !319, line: 81, baseType: !50, size: 64, offset: 384)
!364 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !30, file: !30, line: 408, type: !365, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!365 = !DISubroutineType(types: !366)
!366 = !{!48, !14, !50, !50, !50, !107}
!367 = !DISubprogram(name: "rpl_mbrtowc", scope: !368, file: !368, line: 717, type: !369, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!368 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!369 = !DISubroutineType(types: !370)
!370 = !{!107, !147, !50, !107, !371}
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !373, line: 13, size: 64, elements: !374)
!373 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!374 = !{!375, !376}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !372, file: !373, line: 15, baseType: !14, size: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !372, file: !373, line: 20, baseType: !377, size: 32, offset: 32)
!377 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !372, file: !373, line: 16, size: 32, elements: !378)
!378 = !{!379, !380}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !377, file: !373, line: 18, baseType: !21, size: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !377, file: !373, line: 19, baseType: !381, size: 32)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 32, elements: !382)
!382 = !{!383}
!383 = !DISubrange(count: 4)
!384 = !DISubprogram(name: "iswprint", scope: !385, file: !385, line: 120, type: !386, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!385 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!386 = !DISubroutineType(types: !387)
!387 = !{!14, !21}
!388 = !DISubprogram(name: "mbsinit", scope: !389, file: !389, line: 292, type: !390, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!389 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!390 = !DISubroutineType(types: !391)
!391 = !{!14, !392}
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !372)
!394 = !DISubprogram(name: "locale_charset", scope: !395, file: !395, line: 35, type: !396, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!395 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!396 = !DISubroutineType(types: !397)
!397 = !{!50}
!398 = !DISubprogram(name: "c_strcasecmp", scope: !399, file: !399, line: 42, type: !400, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!399 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!400 = !DISubroutineType(types: !401)
!401 = !{!14, !50, !50}
!402 = !DISubprogram(name: "xmalloc", scope: !343, file: !343, line: 53, type: !403, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!403 = !DISubroutineType(types: !404)
!404 = !{!103, !107}
!405 = !DISubprogram(name: "xalloc_die", scope: !343, file: !343, line: 51, type: !132, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !52)
!406 = !DISubprogram(name: "xrealloc", scope: !343, file: !343, line: 59, type: !407, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!407 = !DISubroutineType(types: !408)
!408 = !{!103, !103, !107}
!409 = !{!316, !410, !416, !418, !420, !425, !432, !434}
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !318, file: !319, line: 101, type: !412, isLocal: false, isDefinition: true)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !413, size: 320, elements: !414)
!413 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!414 = !{!415}
!415 = !DISubrange(count: 10)
!416 = !DIGlobalVariableExpression(var: !417, expr: !DIExpression())
!417 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !318, file: !319, line: 1052, type: !354, isLocal: false, isDefinition: true)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !318, file: !319, line: 116, type: !354, isLocal: true, isDefinition: true)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(name: "slot0", scope: !318, file: !319, line: 842, type: !422, isLocal: true, isDefinition: true)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 2048, elements: !423)
!423 = !{!424}
!424 = !DISubrange(count: 256)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(name: "slotvec", scope: !318, file: !319, line: 845, type: !427, isLocal: true, isDefinition: true)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !319, line: 834, size: 128, elements: !429)
!429 = !{!430, !431}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !428, file: !319, line: 836, baseType: !105, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !428, file: !319, line: 837, baseType: !48, size: 64, offset: 64)
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(name: "nslots", scope: !318, file: !319, line: 843, type: !14, isLocal: true, isDefinition: true)
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(name: "slotvec0", scope: !318, file: !319, line: 844, type: !428, isLocal: true, isDefinition: true)
!436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !437, size: 704, elements: !438)
!437 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!438 = !{!439}
!439 = !DISubrange(count: 11)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !442, file: !443, line: 26, type: !445, isLocal: false, isDefinition: true)
!442 = distinct !DICompileUnit(language: DW_LANG_C99, file: !443, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !52, globals: !444, splitDebugInlining: false, nameTableKind: None)
!443 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!444 = !{!440}
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 376, elements: !446)
!446 = !{!447}
!447 = !DISubrange(count: 47)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "fmt", scope: !450, file: !451, line: 80, type: !515, isLocal: true, isDefinition: true)
!450 = distinct !DISubprogram(name: "lchmod", scope: !451, file: !451, line: 46, type: !452, scopeLine: 47, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !456, retainedNodes: !468)
!451 = !DIFile(filename: "lib/lchmod.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!452 = !DISubroutineType(types: !453)
!453 = !{!14, !50, !454}
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !18, line: 69, baseType: !455)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !20, line: 150, baseType: !21)
!456 = distinct !DICompileUnit(language: DW_LANG_C99, file: !451, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !52, retainedTypes: !457, globals: !467, splitDebugInlining: false, nameTableKind: None)
!457 = !{!458, !462, !466}
!458 = !DISubprogram(name: "open", scope: !459, file: !459, line: 196, type: !460, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!459 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
!460 = !DISubroutineType(types: !461)
!461 = !{!14, !50, !14, null}
!462 = !DISubprogram(name: "close", scope: !463, file: !463, line: 353, type: !464, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!463 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!464 = !DISubroutineType(types: !465)
!465 = !{!14, !14}
!466 = !DISubprogram(name: "chmod", scope: !162, file: !162, line: 280, type: !193, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!467 = !{!448}
!468 = !{!469, !470, !471, !472, !506, !509, !513, !514}
!469 = !DILocalVariable(name: "file", arg: 1, scope: !450, file: !451, line: 46, type: !50)
!470 = !DILocalVariable(name: "mode", arg: 2, scope: !450, file: !451, line: 46, type: !454)
!471 = !DILocalVariable(name: "fd", scope: !450, file: !451, line: 53, type: !14)
!472 = !DILocalVariable(name: "st", scope: !450, file: !451, line: 64, type: !473)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !474, line: 46, size: 1152, elements: !475)
!474 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "")
!475 = !{!476, !478, !480, !482, !483, !484, !485, !486, !487, !488, !490, !492, !500, !501, !502}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !473, file: !474, line: 48, baseType: !477, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !20, line: 145, baseType: !107)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !473, file: !474, line: 53, baseType: !479, size: 64, offset: 64)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !20, line: 148, baseType: !107)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !473, file: !474, line: 61, baseType: !481, size: 64, offset: 128)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !20, line: 151, baseType: !107)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !473, file: !474, line: 62, baseType: !455, size: 32, offset: 192)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !473, file: !474, line: 64, baseType: !200, size: 32, offset: 224)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !473, file: !474, line: 65, baseType: !202, size: 32, offset: 256)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !473, file: !474, line: 67, baseType: !14, size: 32, offset: 288)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !473, file: !474, line: 69, baseType: !477, size: 64, offset: 320)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !473, file: !474, line: 74, baseType: !80, size: 64, offset: 384)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !473, file: !474, line: 78, baseType: !489, size: 64, offset: 448)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !20, line: 174, baseType: !81)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !473, file: !474, line: 80, baseType: !491, size: 64, offset: 512)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !20, line: 179, baseType: !81)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !473, file: !474, line: 91, baseType: !493, size: 128, offset: 576)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !494, line: 10, size: 128, elements: !495)
!494 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!495 = !{!496, !498}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !493, file: !494, line: 12, baseType: !497, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !20, line: 160, baseType: !81)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !493, file: !494, line: 16, baseType: !499, size: 64, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !20, line: 196, baseType: !81)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !473, file: !474, line: 92, baseType: !493, size: 128, offset: 704)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !473, file: !474, line: 93, baseType: !493, size: 128, offset: 832)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !473, file: !474, line: 106, baseType: !503, size: 192, offset: 960)
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 192, elements: !504)
!504 = !{!505}
!505 = !DISubrange(count: 3)
!506 = !DILocalVariable(name: "stat_errno", scope: !507, file: !451, line: 67, type: !14)
!507 = distinct !DILexicalBlock(scope: !508, file: !451, line: 66, column: 5)
!508 = distinct !DILexicalBlock(scope: !450, file: !451, line: 65, column: 7)
!509 = !DILocalVariable(name: "buf", scope: !450, file: !451, line: 81, type: !510)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 208, elements: !511)
!511 = !{!512}
!512 = !DISubrange(count: 26)
!513 = !DILocalVariable(name: "chmod_result", scope: !450, file: !451, line: 83, type: !14)
!514 = !DILocalVariable(name: "chmod_errno", scope: !450, file: !451, line: 84, type: !14)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 136, elements: !516)
!516 = !{!517}
!517 = !DISubrange(count: 17)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !520, file: !521, line: 507, type: !14, isLocal: true, isDefinition: true)
!520 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !521, file: !521, line: 488, type: !522, scopeLine: 489, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !524, retainedNodes: !530)
!521 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!522 = !DISubroutineType(types: !523)
!523 = !{!14, !14, !14}
!524 = distinct !DICompileUnit(language: DW_LANG_C99, file: !521, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !52, retainedTypes: !525, globals: !529, splitDebugInlining: false, nameTableKind: None)
!525 = !{!526, !462}
!526 = !DISubprogram(name: "fcntl", scope: !459, file: !459, line: 176, type: !527, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!527 = !DISubroutineType(types: !528)
!528 = !{!14, !14, !14, null}
!529 = !{!518}
!530 = !{!531, !532, !533, !534, !537}
!531 = !DILocalVariable(name: "fd", arg: 1, scope: !520, file: !521, line: 488, type: !14)
!532 = !DILocalVariable(name: "target", arg: 2, scope: !520, file: !521, line: 488, type: !14)
!533 = !DILocalVariable(name: "result", scope: !520, file: !521, line: 490, type: !14)
!534 = !DILocalVariable(name: "flags", scope: !535, file: !521, line: 531, type: !14)
!535 = distinct !DILexicalBlock(scope: !536, file: !521, line: 530, column: 5)
!536 = distinct !DILexicalBlock(scope: !520, file: !521, line: 529, column: 7)
!537 = !DILocalVariable(name: "saved_errno", scope: !538, file: !521, line: 534, type: !14)
!538 = distinct !DILexicalBlock(scope: !539, file: !521, line: 533, column: 9)
!539 = distinct !DILexicalBlock(scope: !535, file: !521, line: 532, column: 11)
!540 = distinct !DICompileUnit(language: DW_LANG_C99, file: !541, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !52, retainedTypes: !542, splitDebugInlining: false, nameTableKind: None)
!541 = !DIFile(filename: "src/prog-fprintf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!542 = !{!543, !578}
!543 = !DISubprogram(name: "fputs_unlocked", scope: !54, file: !54, line: 662, type: !544, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!544 = !DISubroutineType(types: !545)
!545 = !{!14, !50, !546}
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !59, line: 49, size: 1728, elements: !548)
!548 = !{!549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !547, file: !59, line: 51, baseType: !14, size: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !547, file: !59, line: 54, baseType: !48, size: 64, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !547, file: !59, line: 55, baseType: !48, size: 64, offset: 128)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !547, file: !59, line: 56, baseType: !48, size: 64, offset: 192)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !547, file: !59, line: 57, baseType: !48, size: 64, offset: 256)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !547, file: !59, line: 58, baseType: !48, size: 64, offset: 320)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !547, file: !59, line: 59, baseType: !48, size: 64, offset: 384)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !547, file: !59, line: 60, baseType: !48, size: 64, offset: 448)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !547, file: !59, line: 61, baseType: !48, size: 64, offset: 512)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !547, file: !59, line: 64, baseType: !48, size: 64, offset: 576)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !547, file: !59, line: 65, baseType: !48, size: 64, offset: 640)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !547, file: !59, line: 66, baseType: !48, size: 64, offset: 704)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !547, file: !59, line: 68, baseType: !74, size: 64, offset: 768)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !547, file: !59, line: 70, baseType: !546, size: 64, offset: 832)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !547, file: !59, line: 72, baseType: !14, size: 32, offset: 896)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !547, file: !59, line: 73, baseType: !14, size: 32, offset: 928)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !547, file: !59, line: 74, baseType: !80, size: 64, offset: 960)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !547, file: !59, line: 77, baseType: !83, size: 16, offset: 1024)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !547, file: !59, line: 78, baseType: !85, size: 8, offset: 1040)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !547, file: !59, line: 79, baseType: !87, size: 8, offset: 1048)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !547, file: !59, line: 81, baseType: !91, size: 64, offset: 1088)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !547, file: !59, line: 89, baseType: !94, size: 64, offset: 1152)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !547, file: !59, line: 91, baseType: !96, size: 64, offset: 1216)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !547, file: !59, line: 92, baseType: !99, size: 64, offset: 1280)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !547, file: !59, line: 93, baseType: !546, size: 64, offset: 1344)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !547, file: !59, line: 94, baseType: !103, size: 64, offset: 1408)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !547, file: !59, line: 95, baseType: !105, size: 64, offset: 1472)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !547, file: !59, line: 96, baseType: !14, size: 32, offset: 1536)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !547, file: !59, line: 98, baseType: !110, size: 160, offset: 1568)
!578 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!579 = distinct !DICompileUnit(language: DW_LANG_C99, file: !580, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !52, splitDebugInlining: false, nameTableKind: None)
!580 = !DIFile(filename: "src/selinux.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!581 = distinct !DICompileUnit(language: DW_LANG_C99, file: !582, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !583, retainedTypes: !598, splitDebugInlining: false, nameTableKind: None)
!582 = !DIFile(filename: "lib/mkdir-p.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!583 = !{!584, !594}
!584 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !585, file: !6, line: 39, baseType: !21, size: 32, elements: !22)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savewd", file: !6, line: 36, size: 64, elements: !586)
!586 = !{!587, !588}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !585, file: !6, line: 66, baseType: !584, size: 32)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !585, file: !6, line: 74, baseType: !589, size: 32, offset: 32)
!589 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !585, file: !6, line: 69, size: 32, elements: !590)
!590 = !{!591, !592, !593}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !589, file: !6, line: 71, baseType: !14, size: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "errnum", scope: !589, file: !6, line: 72, baseType: !14, size: 32)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !589, file: !6, line: 73, baseType: !17, size: 32)
!594 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 86, baseType: !21, size: 32, elements: !595)
!595 = !{!596, !597}
!596 = !DIEnumerator(name: "SAVEWD_CHDIR_NOFOLLOW", value: 1, isUnsigned: true)
!597 = !DIEnumerator(name: "SAVEWD_CHDIR_SKIP_READABLE", value: 2, isUnsigned: true)
!598 = !{!599, !199, !201, !192, !44, !157, !149, !604, !607}
!599 = !DISubprogram(name: "mkancesdirs", scope: !600, file: !600, line: 8, type: !601, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!600 = !DIFile(filename: "./lib/mkancesdirs.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!601 = !DISubroutineType(types: !602)
!602 = !{!81, !48, !603, !207, !103}
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!604 = !DISubprogram(name: "savewd_chdir", scope: !6, file: !6, line: 111, type: !605, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!605 = !DISubroutineType(types: !606)
!606 = !{!14, !603, !50, !14, !147}
!607 = !DISubprogram(name: "dirchownmod", scope: !608, file: !608, line: 2, type: !609, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!608 = !DIFile(filename: "./lib/dirchownmod.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!609 = !DISubroutineType(types: !610)
!610 = !{!14, !14, !50, !21, !21, !21, !21, !21}
!611 = distinct !DICompileUnit(language: DW_LANG_C99, file: !612, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !613, retainedTypes: !620, splitDebugInlining: false, nameTableKind: None)
!612 = !DIFile(filename: "lib/modechange.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!613 = !{!614}
!614 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !612, line: 78, baseType: !21, size: 32, elements: !615)
!615 = !{!616, !617, !618, !619}
!616 = !DIEnumerator(name: "MODE_DONE", value: 0, isUnsigned: true)
!617 = !DIEnumerator(name: "MODE_ORDINARY_CHANGE", value: 1, isUnsigned: true)
!618 = !DIEnumerator(name: "MODE_X_IF_ANY_X", value: 2, isUnsigned: true)
!619 = !DIEnumerator(name: "MODE_COPY_EXISTING", value: 3, isUnsigned: true)
!620 = !{!178, !402, !105, !405}
!621 = distinct !DICompileUnit(language: DW_LANG_C99, file: !622, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !623, retainedTypes: !634, splitDebugInlining: false, nameTableKind: None)
!622 = !DIFile(filename: "lib/savewd.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!623 = !{!624, !594}
!624 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !625, file: !6, line: 39, baseType: !21, size: 32, elements: !22)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savewd", file: !6, line: 36, size: 64, elements: !626)
!626 = !{!627, !628}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !625, file: !6, line: 66, baseType: !624, size: 32)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !625, file: !6, line: 74, baseType: !629, size: 32, offset: 32)
!629 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !625, file: !6, line: 69, size: 32, elements: !630)
!630 = !{!631, !632, !633}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !629, file: !6, line: 71, baseType: !14, size: 32)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "errnum", scope: !629, file: !6, line: 72, baseType: !14, size: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !629, file: !6, line: 73, baseType: !17, size: 32)
!634 = !{!458, !635, !638, !462, !639, !643, !645, !647}
!635 = !DISubprogram(name: "chdir", scope: !463, file: !463, line: 497, type: !636, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!636 = !DISubroutineType(types: !637)
!637 = !{!14, !50}
!638 = !DISubprogram(name: "fchdir", scope: !463, file: !463, line: 501, type: !464, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!639 = !DISubprogram(name: "waitpid", scope: !640, file: !640, line: 111, type: !641, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!640 = !DIFile(filename: "/usr/include/sys/wait.h", directory: "")
!641 = !DISubroutineType(types: !642)
!642 = !{!14, !14, !147, !14}
!643 = !DISubprogram(name: "raise", scope: !644, file: !644, line: 123, type: !464, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!644 = !DIFile(filename: "/usr/include/signal.h", directory: "")
!645 = !DISubprogram(name: "open_safer", scope: !646, file: !646, line: 22, type: !460, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!646 = !DIFile(filename: "./lib/fcntl-safer.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!647 = !DISubprogram(name: "fork", scope: !463, file: !463, line: 756, type: !648, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!648 = !DISubroutineType(types: !649)
!649 = !{!14}
!650 = distinct !DICompileUnit(language: DW_LANG_C99, file: !651, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !652, retainedTypes: !656, splitDebugInlining: false, nameTableKind: None)
!651 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!652 = !{!653}
!653 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !651, line: 40, baseType: !21, size: 32, elements: !654)
!654 = !{!655}
!655 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!656 = !{!44, !657, !103}
!657 = !DISubprogram(name: "fputs_unlocked", scope: !54, file: !54, line: 662, type: !658, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!658 = !DISubroutineType(types: !659)
!659 = !{!14, !50, !660}
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !59, line: 49, size: 1728, elements: !662)
!662 = !{!663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !661, file: !59, line: 51, baseType: !14, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !661, file: !59, line: 54, baseType: !48, size: 64, offset: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !661, file: !59, line: 55, baseType: !48, size: 64, offset: 128)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !661, file: !59, line: 56, baseType: !48, size: 64, offset: 192)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !661, file: !59, line: 57, baseType: !48, size: 64, offset: 256)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !661, file: !59, line: 58, baseType: !48, size: 64, offset: 320)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !661, file: !59, line: 59, baseType: !48, size: 64, offset: 384)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !661, file: !59, line: 60, baseType: !48, size: 64, offset: 448)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !661, file: !59, line: 61, baseType: !48, size: 64, offset: 512)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !661, file: !59, line: 64, baseType: !48, size: 64, offset: 576)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !661, file: !59, line: 65, baseType: !48, size: 64, offset: 640)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !661, file: !59, line: 66, baseType: !48, size: 64, offset: 704)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !661, file: !59, line: 68, baseType: !74, size: 64, offset: 768)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !661, file: !59, line: 70, baseType: !660, size: 64, offset: 832)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !661, file: !59, line: 72, baseType: !14, size: 32, offset: 896)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !661, file: !59, line: 73, baseType: !14, size: 32, offset: 928)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !661, file: !59, line: 74, baseType: !80, size: 64, offset: 960)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !661, file: !59, line: 77, baseType: !83, size: 16, offset: 1024)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !661, file: !59, line: 78, baseType: !85, size: 8, offset: 1040)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !661, file: !59, line: 79, baseType: !87, size: 8, offset: 1048)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !661, file: !59, line: 81, baseType: !91, size: 64, offset: 1088)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !661, file: !59, line: 89, baseType: !94, size: 64, offset: 1152)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !661, file: !59, line: 91, baseType: !96, size: 64, offset: 1216)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !661, file: !59, line: 92, baseType: !99, size: 64, offset: 1280)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !661, file: !59, line: 93, baseType: !660, size: 64, offset: 1344)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !661, file: !59, line: 94, baseType: !103, size: 64, offset: 1408)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !661, file: !59, line: 95, baseType: !105, size: 64, offset: 1472)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !661, file: !59, line: 96, baseType: !14, size: 32, offset: 1536)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !661, file: !59, line: 98, baseType: !110, size: 160, offset: 1568)
!692 = distinct !DICompileUnit(language: DW_LANG_C99, file: !693, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !694, retainedTypes: !707, splitDebugInlining: false, nameTableKind: None)
!693 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!694 = !{!695}
!695 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !696, file: !343, line: 186, baseType: !21, size: 32, elements: !705)
!696 = distinct !DISubprogram(name: "x2nrealloc", scope: !343, file: !343, line: 174, type: !697, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !692, retainedNodes: !700)
!697 = !DISubroutineType(types: !698)
!698 = !{!103, !103, !699, !105}
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!700 = !{!701, !702, !703, !704}
!701 = !DILocalVariable(name: "p", arg: 1, scope: !696, file: !343, line: 174, type: !103)
!702 = !DILocalVariable(name: "pn", arg: 2, scope: !696, file: !343, line: 174, type: !699)
!703 = !DILocalVariable(name: "s", arg: 3, scope: !696, file: !343, line: 174, type: !105)
!704 = !DILocalVariable(name: "n", scope: !696, file: !343, line: 176, type: !105)
!705 = !{!706}
!706 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!707 = !{!105, !405, !402, !406, !48, !178, !103, !708, !711}
!708 = !DISubprogram(name: "xcalloc", scope: !343, file: !343, line: 57, type: !709, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!709 = !DISubroutineType(types: !710)
!710 = !{!103, !107, !107}
!711 = !DISubprogram(name: "rpl_calloc", scope: !712, file: !712, line: 688, type: !709, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!712 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!713 = distinct !DICompileUnit(language: DW_LANG_C99, file: !714, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !52, retainedTypes: !715, splitDebugInlining: false, nameTableKind: None)
!714 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!715 = !{!44, !149}
!716 = distinct !DICompileUnit(language: DW_LANG_C99, file: !717, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !52, retainedTypes: !718, splitDebugInlining: false, nameTableKind: None)
!717 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!718 = !{!103}
!719 = distinct !DICompileUnit(language: DW_LANG_C99, file: !720, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !52, retainedTypes: !721, splitDebugInlining: false, nameTableKind: None)
!720 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!721 = !{!722, !105, !734}
!722 = !DISubprogram(name: "mbrtowc", scope: !389, file: !389, line: 296, type: !723, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!723 = !DISubroutineType(types: !724)
!724 = !{!107, !147, !50, !107, !725}
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !373, line: 13, size: 64, elements: !727)
!727 = !{!728, !729}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !726, file: !373, line: 15, baseType: !14, size: 32)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !726, file: !373, line: 20, baseType: !730, size: 32, offset: 32)
!730 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !726, file: !373, line: 16, size: 32, elements: !731)
!731 = !{!732, !733}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !730, file: !373, line: 18, baseType: !21, size: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !730, file: !373, line: 19, baseType: !381, size: 32)
!734 = !DISubprogram(name: "hard_locale", scope: !735, file: !735, line: 26, type: !736, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!735 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!736 = !DISubroutineType(types: !737)
!737 = !{!174, !14}
!738 = distinct !DICompileUnit(language: DW_LANG_C99, file: !739, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !52, retainedTypes: !740, splitDebugInlining: false, nameTableKind: None)
!739 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!740 = !{!741}
!741 = !DISubprogram(name: "rpl_fclose", scope: !742, file: !742, line: 672, type: !743, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!742 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!743 = !DISubroutineType(types: !744)
!744 = !{!14, !745}
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !59, line: 49, size: 1728, elements: !747)
!747 = !{!748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !746, file: !59, line: 51, baseType: !14, size: 32)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !746, file: !59, line: 54, baseType: !48, size: 64, offset: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !746, file: !59, line: 55, baseType: !48, size: 64, offset: 128)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !746, file: !59, line: 56, baseType: !48, size: 64, offset: 192)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !746, file: !59, line: 57, baseType: !48, size: 64, offset: 256)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !746, file: !59, line: 58, baseType: !48, size: 64, offset: 320)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !746, file: !59, line: 59, baseType: !48, size: 64, offset: 384)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !746, file: !59, line: 60, baseType: !48, size: 64, offset: 448)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !746, file: !59, line: 61, baseType: !48, size: 64, offset: 512)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !746, file: !59, line: 64, baseType: !48, size: 64, offset: 576)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !746, file: !59, line: 65, baseType: !48, size: 64, offset: 640)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !746, file: !59, line: 66, baseType: !48, size: 64, offset: 704)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !746, file: !59, line: 68, baseType: !74, size: 64, offset: 768)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !746, file: !59, line: 70, baseType: !745, size: 64, offset: 832)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !746, file: !59, line: 72, baseType: !14, size: 32, offset: 896)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !746, file: !59, line: 73, baseType: !14, size: 32, offset: 928)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !746, file: !59, line: 74, baseType: !80, size: 64, offset: 960)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !746, file: !59, line: 77, baseType: !83, size: 16, offset: 1024)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !746, file: !59, line: 78, baseType: !85, size: 8, offset: 1040)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !746, file: !59, line: 79, baseType: !87, size: 8, offset: 1048)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !746, file: !59, line: 81, baseType: !91, size: 64, offset: 1088)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !746, file: !59, line: 89, baseType: !94, size: 64, offset: 1152)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !746, file: !59, line: 91, baseType: !96, size: 64, offset: 1216)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !746, file: !59, line: 92, baseType: !99, size: 64, offset: 1280)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !746, file: !59, line: 93, baseType: !745, size: 64, offset: 1344)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !746, file: !59, line: 94, baseType: !103, size: 64, offset: 1408)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !746, file: !59, line: 95, baseType: !105, size: 64, offset: 1472)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !746, file: !59, line: 96, baseType: !14, size: 32, offset: 1536)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !746, file: !59, line: 98, baseType: !110, size: 160, offset: 1568)
!777 = distinct !DICompileUnit(language: DW_LANG_C99, file: !778, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !52, retainedTypes: !779, splitDebugInlining: false, nameTableKind: None)
!778 = !DIFile(filename: "lib/open-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!779 = !{!458, !780}
!780 = !DISubprogram(name: "fd_safer", scope: !781, file: !781, line: 21, type: !464, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!781 = !DIFile(filename: "./lib/unistd-safer.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!782 = distinct !DICompileUnit(language: DW_LANG_C99, file: !783, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !52, retainedTypes: !784, splitDebugInlining: false, nameTableKind: None)
!783 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!784 = !{!785}
!785 = !DISubprogram(name: "setlocale_null_r", scope: !786, file: !786, line: 64, type: !787, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !52)
!786 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!787 = !DISubroutineType(types: !788)
!788 = !{!14, !14, !48, !107}
!789 = distinct !DICompileUnit(language: DW_LANG_C99, file: !790, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !791, retainedTypes: !1178, splitDebugInlining: false, nameTableKind: None)
!790 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!791 = !{!792}
!792 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !793, line: 41, baseType: !21, size: 32, elements: !794)
!793 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!794 = !{!795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177}
!795 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!796 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!797 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!798 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!799 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!800 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!801 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!802 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!803 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!804 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!805 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!806 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!807 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!808 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!809 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!810 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!811 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!812 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!813 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!814 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!815 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!816 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!817 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!818 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!819 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!820 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!821 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!822 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!823 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!824 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!825 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!826 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!827 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!828 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!829 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!830 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!831 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!832 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!833 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!834 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!835 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!836 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!837 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!838 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!839 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!840 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!841 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!842 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!843 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!844 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!845 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!846 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!847 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!884 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!885 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!886 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!887 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!894 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!895 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!896 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!898 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!899 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!900 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!901 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!902 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!903 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!904 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!905 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!906 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!907 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!908 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!909 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!910 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!911 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!912 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!913 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!914 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!915 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!916 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!917 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!918 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!919 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!920 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!921 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!922 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!923 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!924 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!925 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!926 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!927 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!928 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!929 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!930 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!931 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!932 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!933 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!934 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!935 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!936 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!937 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!938 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!939 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!940 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!941 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!942 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!943 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!944 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!945 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!946 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!947 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!948 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!949 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!950 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!951 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!952 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!953 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!954 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!955 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!956 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!957 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!958 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!959 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!960 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!961 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!962 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!963 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!964 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!965 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!966 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!967 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!968 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!969 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!970 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!971 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!972 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!973 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!974 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!975 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!976 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!977 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!978 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!979 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!980 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!981 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!982 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!983 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!984 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!985 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!986 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!987 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!988 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!989 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!990 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!991 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!992 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!993 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!994 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!995 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!996 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!997 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!998 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!999 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!1000 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!1001 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!1002 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!1003 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!1004 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!1005 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!1006 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
