source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.infomap = type { i8*, i8* }
%struct.mkdir_options = type { i32 (i8*, i8*, i8*)*, i32, i32, i32, i8, i8* }
%struct.mode_change = type { i8, i8, i32, i32, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.savewd = type { i32, %union.anon }
%struct.slotvec = type { i64, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [36 x i8] c"Usage: %s [OPTION]... DIRECTORY...\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 41, type: !52, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !43, globals: !51, nameTableKind: None)
!3 = !DIFile(filename: "src/mkdir.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !29}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !7, file: !6, line: 39, baseType: !21, size: 32, elements: !22)
!6 = !DIFile(filename: "./lib/savewd.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savewd", file: !6, line: 36, size: 64, elements: !8)
!8 = !{!9, !10}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !7, file: !6, line: 66, baseType: !5, size: 32)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !7, file: !6, line: 74, baseType: !11, size: 32, offset: 32)
!11 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !7, file: !6, line: 69, size: 32, elements: !12)
!12 = !{!13, !15, !16}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !11, file: !6, line: 71, baseType: !14, size: 32)
!14 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "errnum", scope: !11, file: !6, line: 72, baseType: !14, size: 32)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !11, file: !6, line: 73, baseType: !17, size: 32)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !18, line: 97, baseType: !19)
!18 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !20, line: 154, baseType: !14)
!20 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!21 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!22 = !{!23, !24, !25, !26, !27, !28}
!23 = !DIEnumerator(name: "INITIAL_STATE", value: 0, isUnsigned: true)
!24 = !DIEnumerator(name: "FD_STATE", value: 1, isUnsigned: true)
!25 = !DIEnumerator(name: "FD_POST_CHDIR_STATE", value: 2, isUnsigned: true)
!26 = !DIEnumerator(name: "FORKING_STATE", value: 3, isUnsigned: true)
!27 = !DIEnumerator(name: "ERROR_STATE", value: 4, isUnsigned: true)
!28 = !DIEnumerator(name: "FINAL_STATE", value: 5, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !30, line: 32, baseType: !21, size: 32, elements: !31)
!30 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!31 = !{!32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42}
!32 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!33 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!34 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!35 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!36 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!37 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!38 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!39 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!40 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!41 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!42 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!43 = !{!44, !46, !47, !49}
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !18, line: 79, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !20, line: 146, baseType: !21)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !18, line: 64, baseType: !50)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !20, line: 147, baseType: !21)
!51 = !{!0}
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 1792, elements: !64)
!53 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !55, line: 50, size: 256, elements: !56)
!55 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!56 = !{!57, !60, !61, !63}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !54, file: !55, line: 52, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !54, file: !55, line: 55, baseType: !14, size: 32, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !54, file: !55, line: 56, baseType: !62, size: 64, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !54, file: !55, line: 57, baseType: !14, size: 32, offset: 192)
!64 = !{!65}
!65 = !DISubrange(count: 7)
!66 = !DIGlobalVariableExpression(var: !67, expr: !DIExpression())
!67 = distinct !DIGlobalVariable(name: "Version", scope: !68, file: !69, line: 2, type: !58, isDefinition: true)
!68 = distinct !DICompileUnit(language: DW_LANG_C99, file: !69, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !70, globals: !71, nameTableKind: None)
!69 = !DIFile(filename: "src/version.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!70 = !{}
!71 = !{!66}
!72 = !DIGlobalVariableExpression(var: !73, expr: !DIExpression())
!73 = distinct !DIGlobalVariable(name: "file_name", scope: !74, file: !75, line: 46, type: !58, isLocal: true, isDefinition: true)
!74 = distinct !DICompileUnit(language: DW_LANG_C99, file: !75, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !70, globals: !76, nameTableKind: None)
!75 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!76 = !{!72, !77}
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !74, file: !75, line: 56, type: !79, isLocal: true, isDefinition: true)
!79 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!80 = !DIGlobalVariableExpression(var: !81, expr: !DIExpression())
!81 = distinct !DIGlobalVariable(name: "exit_failure", scope: !82, file: !83, line: 24, type: !85, isDefinition: true)
!82 = distinct !DICompileUnit(language: DW_LANG_C99, file: !83, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !70, globals: !84, nameTableKind: None)
!83 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!84 = !{!80}
!85 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !14)
!86 = !DIGlobalVariableExpression(var: !87, expr: !DIExpression())
!87 = distinct !DIGlobalVariable(name: "program_name", scope: !88, file: !89, line: 33, type: !58, isDefinition: true)
!88 = distinct !DICompileUnit(language: DW_LANG_C99, file: !89, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !70, retainedTypes: !90, globals: !91, nameTableKind: None)
!89 = !DIFile(filename: "lib/progname.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!90 = !{!46, !44}
!91 = !{!86}
!92 = !DIGlobalVariableExpression(var: !93, expr: !DIExpression())
!93 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !94, file: !95, line: 85, type: !159, isDefinition: true)
!94 = distinct !DICompileUnit(language: DW_LANG_C99, file: !95, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !96, retainedTypes: !117, globals: !122, nameTableKind: None)
!95 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!96 = !{!29, !97, !102}
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !30, line: 242, baseType: !21, size: 32, elements: !98)
!98 = !{!99, !100, !101}
!99 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!100 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!101 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!102 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !103, line: 46, baseType: !21, size: 32, elements: !104)
!103 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!104 = !{!105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116}
!105 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!106 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!107 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!108 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!109 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!110 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!111 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!112 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!113 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!114 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!115 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!116 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!117 = !{!14, !118, !119, !44}
!118 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !120, line: 46, baseType: !121)
!120 = !DIFile(filename: "/usr/lib/clang/12.0.1/include/stddef.h", directory: "")
!121 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!122 = !{!92, !123, !129, !141, !143, !148, !155, !157}
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !94, file: !95, line: 101, type: !125, isDefinition: true)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 320, elements: !127)
!126 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!127 = !{!128}
!128 = !DISubrange(count: 10)
!129 = !DIGlobalVariableExpression(var: !130, expr: !DIExpression())
!130 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !94, file: !95, line: 1052, type: !131, isDefinition: true)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !95, line: 65, size: 448, elements: !132)
!132 = !{!133, !134, !135, !139, !140}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !131, file: !95, line: 68, baseType: !29, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !131, file: !95, line: 71, baseType: !14, size: 32, offset: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !131, file: !95, line: 75, baseType: !136, size: 256, offset: 64)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 256, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 8)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !131, file: !95, line: 78, baseType: !58, size: 64, offset: 320)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !131, file: !95, line: 81, baseType: !58, size: 64, offset: 384)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !94, file: !95, line: 116, type: !131, isLocal: true, isDefinition: true)
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(name: "slot0", scope: !94, file: !95, line: 842, type: !145, isLocal: true, isDefinition: true)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 2048, elements: !146)
!146 = !{!147}
!147 = !DISubrange(count: 256)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(name: "slotvec", scope: !94, file: !95, line: 845, type: !150, isLocal: true, isDefinition: true)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !95, line: 834, size: 128, elements: !152)
!152 = !{!153, !154}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !151, file: !95, line: 836, baseType: !119, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !151, file: !95, line: 837, baseType: !44, size: 64, offset: 64)
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(name: "nslots", scope: !94, file: !95, line: 843, type: !14, isLocal: true, isDefinition: true)
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!158 = distinct !DIGlobalVariable(name: "slotvec0", scope: !94, file: !95, line: 844, type: !151, isLocal: true, isDefinition: true)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 704, elements: !161)
!160 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!161 = !{!162}
!162 = !DISubrange(count: 11)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !165, file: !166, line: 26, type: !168, isDefinition: true)
!165 = distinct !DICompileUnit(language: DW_LANG_C99, file: !166, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !70, globals: !167, nameTableKind: None)
!166 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!167 = !{!163}
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 376, elements: !169)
!169 = !{!170}
!170 = !DISubrange(count: 47)
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !173, file: !174, line: 507, type: !14, isLocal: true, isDefinition: true)
!173 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !174, file: !174, line: 488, type: !175, scopeLine: 489, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !177, retainedNodes: !179)
!174 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!175 = !DISubroutineType(types: !176)
!176 = !{!14, !14, !14}
!177 = distinct !DICompileUnit(language: DW_LANG_C99, file: !174, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !70, globals: !178, nameTableKind: None)
!178 = !{!171}
!179 = !{!180, !181, !182, !183, !186}
!180 = !DILocalVariable(name: "fd", arg: 1, scope: !173, file: !174, line: 488, type: !14)
!181 = !DILocalVariable(name: "target", arg: 2, scope: !173, file: !174, line: 488, type: !14)
!182 = !DILocalVariable(name: "result", scope: !173, file: !174, line: 490, type: !14)
!183 = !DILocalVariable(name: "flags", scope: !184, file: !174, line: 531, type: !14)
!184 = distinct !DILexicalBlock(scope: !185, file: !174, line: 530, column: 5)
!185 = distinct !DILexicalBlock(scope: !173, file: !174, line: 529, column: 7)
!186 = !DILocalVariable(name: "saved_errno", scope: !187, file: !174, line: 534, type: !14)
!187 = distinct !DILexicalBlock(scope: !188, file: !174, line: 533, column: 9)
!188 = distinct !DILexicalBlock(scope: !184, file: !174, line: 532, column: 11)
!189 = distinct !DICompileUnit(language: DW_LANG_C99, file: !190, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !70, retainedTypes: !191, nameTableKind: None)
!190 = !DIFile(filename: "src/prog-fprintf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!191 = !{!192}
!192 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!193 = distinct !DICompileUnit(language: DW_LANG_C99, file: !194, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !70, nameTableKind: None)
!194 = !DIFile(filename: "src/selinux.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!195 = distinct !DICompileUnit(language: DW_LANG_C99, file: !196, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !197, retainedTypes: !212, nameTableKind: None)
!196 = !DIFile(filename: "lib/mkdir-p.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!197 = !{!198, !208}
!198 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !199, file: !6, line: 39, baseType: !21, size: 32, elements: !22)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savewd", file: !6, line: 36, size: 64, elements: !200)
!200 = !{!201, !202}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !199, file: !6, line: 66, baseType: !198, size: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !199, file: !6, line: 74, baseType: !203, size: 32, offset: 32)
!203 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !199, file: !6, line: 69, size: 32, elements: !204)
!204 = !{!205, !206, !207}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !203, file: !6, line: 71, baseType: !14, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "errnum", scope: !203, file: !6, line: 72, baseType: !14, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !203, file: !6, line: 73, baseType: !17, size: 32)
!208 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 86, baseType: !21, size: 32, elements: !209)
!209 = !{!210, !211}
!210 = !DIEnumerator(name: "SAVEWD_CHDIR_NOFOLLOW", value: 1, isUnsigned: true)
!211 = !DIEnumerator(name: "SAVEWD_CHDIR_SKIP_READABLE", value: 2, isUnsigned: true)
!212 = !{!47, !49}
!213 = distinct !DICompileUnit(language: DW_LANG_C99, file: !214, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !215, retainedTypes: !222, nameTableKind: None)
!214 = !DIFile(filename: "lib/modechange.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!215 = !{!216}
!216 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !214, line: 78, baseType: !21, size: 32, elements: !217)
!217 = !{!218, !219, !220, !221}
!218 = !DIEnumerator(name: "MODE_DONE", value: 0, isUnsigned: true)
!219 = !DIEnumerator(name: "MODE_ORDINARY_CHANGE", value: 1, isUnsigned: true)
!220 = !DIEnumerator(name: "MODE_X_IF_ANY_X", value: 2, isUnsigned: true)
!221 = !DIEnumerator(name: "MODE_COPY_EXISTING", value: 3, isUnsigned: true)
!222 = !{!119}
!223 = distinct !DICompileUnit(language: DW_LANG_C99, file: !224, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !225, nameTableKind: None)
!224 = !DIFile(filename: "lib/savewd.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!225 = !{!226, !208}
!226 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !227, file: !6, line: 39, baseType: !21, size: 32, elements: !22)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savewd", file: !6, line: 36, size: 64, elements: !228)
!228 = !{!229, !230}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !227, file: !6, line: 66, baseType: !226, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !227, file: !6, line: 74, baseType: !231, size: 32, offset: 32)
!231 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !227, file: !6, line: 69, size: 32, elements: !232)
!232 = !{!233, !234, !235}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !231, file: !6, line: 71, baseType: !14, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "errnum", scope: !231, file: !6, line: 72, baseType: !14, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !231, file: !6, line: 73, baseType: !17, size: 32)
!236 = distinct !DICompileUnit(language: DW_LANG_C99, file: !237, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !238, retainedTypes: !242, nameTableKind: None)
!237 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!238 = !{!239}
!239 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !237, line: 40, baseType: !21, size: 32, elements: !240)
!240 = !{!241}
!241 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!242 = !{!46}
!243 = distinct !DICompileUnit(language: DW_LANG_C99, file: !244, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !245, retainedTypes: !259, nameTableKind: None)
!244 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!245 = !{!246}
!246 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !248, file: !247, line: 186, baseType: !21, size: 32, elements: !257)
!247 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!248 = distinct !DISubprogram(name: "x2nrealloc", scope: !247, file: !247, line: 174, type: !249, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !243, retainedNodes: !252)
!249 = !DISubroutineType(types: !250)
!250 = !{!46, !46, !251, !119}
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!252 = !{!253, !254, !255, !256}
!253 = !DILocalVariable(name: "p", arg: 1, scope: !248, file: !247, line: 174, type: !46)
!254 = !DILocalVariable(name: "pn", arg: 2, scope: !248, file: !247, line: 174, type: !251)
!255 = !DILocalVariable(name: "s", arg: 3, scope: !248, file: !247, line: 174, type: !119)
!256 = !DILocalVariable(name: "n", scope: !248, file: !247, line: 176, type: !119)
!257 = !{!258}
!258 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!259 = !{!119, !44, !46}
!260 = distinct !DICompileUnit(language: DW_LANG_C99, file: !261, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !70, nameTableKind: None)
!261 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!262 = distinct !DICompileUnit(language: DW_LANG_C99, file: !263, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !70, retainedTypes: !242, nameTableKind: None)
!263 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!264 = distinct !DICompileUnit(language: DW_LANG_C99, file: !265, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !70, retainedTypes: !222, nameTableKind: None)
!265 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!266 = distinct !DICompileUnit(language: DW_LANG_C99, file: !267, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !70, nameTableKind: None)
!267 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!268 = distinct !DICompileUnit(language: DW_LANG_C99, file: !269, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !70, nameTableKind: None)
!269 = !DIFile(filename: "lib/open-safer.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!270 = distinct !DICompileUnit(language: DW_LANG_C99, file: !271, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !70, nameTableKind: None)
!271 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!272 = distinct !DICompileUnit(language: DW_LANG_C99, file: !273, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !274, retainedTypes: !242, nameTableKind: None)
!273 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!274 = !{!275}
!275 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !276, line: 41, baseType: !21, size: 32, elements: !277)
!276 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!277 = !{!278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660}
!278 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!279 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!280 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!281 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!282 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!283 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!284 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!285 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!286 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!287 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!288 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!289 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!290 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!291 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!292 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!293 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!294 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!295 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!296 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!297 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!298 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!299 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!300 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!301 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!302 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!303 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!304 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!305 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!306 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!307 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!308 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!309 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!310 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!311 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!312 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!313 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!314 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!315 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!316 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!317 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!318 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!319 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!320 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!321 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!322 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!323 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!324 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!325 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!326 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!327 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!328 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!329 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!330 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!331 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!332 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!333 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!334 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!335 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!336 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!337 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!338 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!339 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!340 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!341 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!342 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!343 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!344 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!345 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!346 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!347 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!348 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!349 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!350 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!351 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!352 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!353 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!354 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!355 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!356 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!357 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!358 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!359 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!360 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!361 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!362 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!363 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!364 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!365 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!366 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!367 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!368 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!369 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!370 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!371 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!372 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!373 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!374 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!375 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!376 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!377 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!378 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!379 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!380 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!381 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!382 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!383 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!384 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!385 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!386 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!387 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!388 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!389 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!390 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!391 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!392 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!393 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!394 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!395 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!396 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!397 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!398 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!399 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!400 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!401 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!402 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!403 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!404 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!405 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!406 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!407 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!408 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!409 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!410 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!411 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!412 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!413 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!414 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!415 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!416 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!417 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!418 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!419 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!420 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!421 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!422 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!423 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!424 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!425 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!426 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!427 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!428 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!429 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!430 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!431 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!432 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!433 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!434 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!435 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!436 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!437 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!438 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!439 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!440 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!441 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!442 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!443 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!444 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!445 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!446 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!447 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!448 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!449 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!450 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!451 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!452 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!453 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!454 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!455 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!456 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!457 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!458 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!459 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!460 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!461 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!462 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!463 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!464 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!465 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!466 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!467 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!468 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!469 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!470 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!471 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!472 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!473 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!474 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!475 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!476 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!477 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!478 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!479 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!480 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!481 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!482 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!483 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!484 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!485 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!486 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!487 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!488 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!489 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!490 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!491 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!492 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!493 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!494 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!495 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!496 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!497 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!498 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!499 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!500 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!501 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!502 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!503 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!504 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!505 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!506 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!507 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!508 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!509 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!510 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!511 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!512 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!513 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!514 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!515 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!516 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!517 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!518 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!519 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!520 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!521 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!522 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!523 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!524 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!525 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!526 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!527 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!528 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!529 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!530 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!531 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!532 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!533 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!534 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!535 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!536 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!537 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!538 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!539 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!540 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!541 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!542 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!543 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!544 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!545 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!546 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!547 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!548 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!549 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!550 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!551 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!552 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!553 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!554 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!555 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!556 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!557 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!558 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!559 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!560 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!561 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!562 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!563 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!564 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!565 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!566 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!567 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!568 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!569 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!570 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!571 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!572 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!573 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!574 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!575 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!576 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!577 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!578 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!579 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!580 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!581 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!582 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!583 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!584 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!585 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!586 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!587 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!588 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!589 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!590 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!591 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!592 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!593 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!594 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!595 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!596 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!597 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!598 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!599 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!600 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!601 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!602 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!603 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!604 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!605 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!606 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!607 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!608 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!609 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!610 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!611 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!612 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!613 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!614 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!615 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!616 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!617 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!618 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!619 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!620 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!621 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!622 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!623 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!624 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!625 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!626 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!627 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!628 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!629 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!630 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!631 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!632 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!633 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!634 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!635 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!636 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!637 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!661 = distinct !DICompileUnit(language: DW_LANG_C99, file: !662, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !663, nameTableKind: None)
!662 = !DIFile(filename: "lib/mkancesdirs.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!663 = !{!664, !208}
!664 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !665, file: !6, line: 39, baseType: !21, size: 32, elements: !22)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savewd", file: !6, line: 36, size: 64, elements: !666)
!666 = !{!667, !668}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !665, file: !6, line: 66, baseType: !664, size: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !665, file: !6, line: 74, baseType: !669, size: 32, offset: 32)
!669 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !665, file: !6, line: 69, size: 32, elements: !670)
!670 = !{!671, !672, !673}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !669, file: !6, line: 71, baseType: !14, size: 32)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "errnum", scope: !669, file: !6, line: 72, baseType: !14, size: 32)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !669, file: !6, line: 73, baseType: !17, size: 32)
!674 = distinct !DICompileUnit(language: DW_LANG_C99, file: !675, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !70, retainedTypes: !676, nameTableKind: None)
!675 = !DIFile(filename: "lib/dirchownmod.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!676 = !{!47, !49, !677}
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !18, line: 69, baseType: !678)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !20, line: 150, baseType: !21)
!679 = distinct !DICompileUnit(language: DW_LANG_C99, file: !680, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !70, retainedTypes: !242, nameTableKind: None)
!680 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!681 = distinct !DICompileUnit(language: DW_LANG_C99, file: !682, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !70, nameTableKind: None)
!682 = !DIFile(filename: "lib/fd-safer.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!683 = distinct !DICompileUnit(language: DW_LANG_C99, file: !684, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !70, nameTableKind: None)
!684 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!685 = distinct !DICompileUnit(language: DW_LANG_C99, file: !686, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !70, retainedTypes: !242, nameTableKind: None)
!686 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!687 = distinct !DICompileUnit(language: DW_LANG_C99, file: !688, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !70, retainedTypes: !242, nameTableKind: None)
!688 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!689 = distinct !DICompileUnit(language: DW_LANG_C99, file: !690, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !70, nameTableKind: None)
!690 = !DIFile(filename: "lib/dup-safer.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!691 = !{!"clang version 12.0.1"}
!692 = !{i32 7, !"Dwarf Version", i32 4}
!693 = !{i32 2, !"Debug Info Version", i32 3}
!694 = !{i32 1, !"wchar_size", i32 4}
!695 = !{i32 7, !"PIC Level", i32 2}
!696 = !{i32 7, !"PIE Level", i32 2}
!697 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 53, type: !698, scopeLine: 54, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !700)
!698 = !DISubroutineType(types: !699)
!699 = !{null, !14}
!700 = !{!701}
!701 = !DILocalVariable(name: "status", arg: 1, scope: !697, file: !3, line: 53, type: !14)
!702 = !DILocation(scope: !697)
!703 = !DILocation(line: 55, column: 14, scope: !704)
!704 = distinct !DILexicalBlock(scope: !697, file: !3, line: 55, column: 7)
!705 = !DILocation(line: 55, column: 7, scope: !697)
!706 = !DILocation(line: 56, column: 5, scope: !707)
!707 = distinct !DILexicalBlock(scope: !704, file: !3, line: 56, column: 5)
!708 = !{!709, !709, i64 0}
!709 = !{!"any pointer", !710, i64 0}
!710 = !{!"omnipotent char", !711, i64 0}
!711 = !{!"Simple C/C++ TBAA"}
!712 = !DILocation(line: 59, column: 7, scope: !713)
!713 = distinct !DILexicalBlock(scope: !704, file: !3, line: 58, column: 5)
!714 = !DILocation(line: 60, column: 7, scope: !713)
!715 = !DILocation(line: 590, column: 3, scope: !716, inlinedAt: !720)
!716 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !717, file: !717, line: 588, type: !718, scopeLine: 589, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !70)
!717 = !DIFile(filename: "src/system.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!718 = !DISubroutineType(types: !719)
!719 = !{null}
!720 = distinct !DILocation(line: 64, column: 7, scope: !713)
!721 = !DILocation(line: 66, column: 7, scope: !713)
!722 = !DILocation(line: 71, column: 7, scope: !713)
!723 = !DILocation(line: 77, column: 7, scope: !713)
!724 = !DILocation(line: 78, column: 7, scope: !713)
!725 = !DILocalVariable(name: "program", arg: 1, scope: !726, file: !717, line: 634, type: !58)
!726 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !717, file: !717, line: 634, type: !727, scopeLine: 635, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !729)
!727 = !DISubroutineType(types: !728)
!728 = !{null, !58}
!729 = !{!725, !730, !737, !738, !740}
!730 = !DILocalVariable(name: "infomap", scope: !726, file: !717, line: 636, type: !731)
!731 = !DICompositeType(tag: DW_TAG_array_type, baseType: !732, size: 896, elements: !64)
!732 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !733)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !726, file: !717, line: 636, size: 128, elements: !734)
!734 = !{!735, !736}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !733, file: !717, line: 636, baseType: !58, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !733, file: !717, line: 636, baseType: !58, size: 64, offset: 64)
!737 = !DILocalVariable(name: "node", scope: !726, file: !717, line: 646, type: !58)
!738 = !DILocalVariable(name: "map_prog", scope: !726, file: !717, line: 647, type: !739)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!740 = !DILocalVariable(name: "lc_messages", scope: !726, file: !717, line: 659, type: !58)
!741 = !DILocation(scope: !726, inlinedAt: !742)
!742 = distinct !DILocation(line: 79, column: 7, scope: !713)
!743 = !DILocation(line: 636, column: 3, scope: !726, inlinedAt: !742)
!744 = !DILocation(line: 636, column: 67, scope: !726, inlinedAt: !742)
!745 = !DILocation(line: 647, column: 36, scope: !726, inlinedAt: !742)
!746 = !DILocation(line: 649, column: 3, scope: !726, inlinedAt: !742)
!747 = !DILocation(line: 649, column: 33, scope: !726, inlinedAt: !742)
!748 = !DILocation(line: 650, column: 13, scope: !726, inlinedAt: !742)
!749 = !DILocation(line: 649, column: 20, scope: !726, inlinedAt: !742)
!750 = !{!751, !709, i64 0}
!751 = !{!"infomap", !709, i64 0, !709, i64 8}
!752 = !DILocation(line: 649, column: 10, scope: !726, inlinedAt: !742)
!753 = !DILocation(line: 649, column: 28, scope: !726, inlinedAt: !742)
!754 = distinct !{!754, !746, !748, !755}
!755 = !{!"llvm.loop.mustprogress"}
!756 = !DILocation(line: 652, column: 17, scope: !757, inlinedAt: !742)
!757 = distinct !DILexicalBlock(scope: !726, file: !717, line: 652, column: 7)
!758 = !{!751, !709, i64 8}
!759 = !DILocation(line: 652, column: 7, scope: !757, inlinedAt: !742)
!760 = !DILocation(line: 652, column: 7, scope: !726, inlinedAt: !742)
!761 = !DILocation(line: 655, column: 3, scope: !726, inlinedAt: !742)
!762 = !DILocation(line: 659, column: 29, scope: !726, inlinedAt: !742)
!763 = !DILocation(line: 660, column: 7, scope: !764, inlinedAt: !742)
!764 = distinct !DILexicalBlock(scope: !726, file: !717, line: 660, column: 7)
!765 = !DILocation(line: 660, column: 19, scope: !764, inlinedAt: !742)
!766 = !DILocation(line: 660, column: 22, scope: !764, inlinedAt: !742)
!767 = !DILocation(line: 660, column: 7, scope: !726, inlinedAt: !742)
!768 = !DILocation(line: 666, column: 7, scope: !769, inlinedAt: !742)
!769 = distinct !DILexicalBlock(scope: !764, file: !717, line: 661, column: 5)
!770 = !DILocation(line: 668, column: 5, scope: !769, inlinedAt: !742)
!771 = !DILocation(line: 669, column: 3, scope: !726, inlinedAt: !742)
!772 = !DILocation(line: 671, column: 3, scope: !726, inlinedAt: !742)
!773 = !DILocation(line: 673, column: 1, scope: !726, inlinedAt: !742)
!774 = !DILocation(line: 81, column: 3, scope: !697)
!775 = !DISubprogram(name: "dcgettext", scope: !776, file: !776, line: 51, type: !777, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !70)
!776 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!777 = !DISubroutineType(types: !778)
!778 = !{!44, !58, !58, !14}
!779 = !DISubprogram(name: "fputs_unlocked", scope: !780, file: !780, line: 667, type: !781, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !70)
!780 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!781 = !DISubroutineType(types: !782)
!782 = !{!14, !58, !783}
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !785, line: 49, size: 1728, elements: !786)
!785 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!786 = !{!787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !802, !803, !804, !805, !808, !809, !811, !815, !818, !820, !823, !826, !827, !828, !829, !830}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !784, file: !785, line: 51, baseType: !14, size: 32)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !784, file: !785, line: 54, baseType: !44, size: 64, offset: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !784, file: !785, line: 55, baseType: !44, size: 64, offset: 128)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !784, file: !785, line: 56, baseType: !44, size: 64, offset: 192)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !784, file: !785, line: 57, baseType: !44, size: 64, offset: 256)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !784, file: !785, line: 58, baseType: !44, size: 64, offset: 320)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !784, file: !785, line: 59, baseType: !44, size: 64, offset: 384)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !784, file: !785, line: 60, baseType: !44, size: 64, offset: 448)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !784, file: !785, line: 61, baseType: !44, size: 64, offset: 512)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !784, file: !785, line: 64, baseType: !44, size: 64, offset: 576)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !784, file: !785, line: 65, baseType: !44, size: 64, offset: 640)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !784, file: !785, line: 66, baseType: !44, size: 64, offset: 704)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !784, file: !785, line: 68, baseType: !800, size: 64, offset: 768)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !785, line: 36, flags: DIFlagFwdDecl)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !784, file: !785, line: 70, baseType: !783, size: 64, offset: 832)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !784, file: !785, line: 72, baseType: !14, size: 32, offset: 896)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !784, file: !785, line: 73, baseType: !14, size: 32, offset: 928)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !784, file: !785, line: 74, baseType: !806, size: 64, offset: 960)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !20, line: 152, baseType: !807)
!807 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !784, file: !785, line: 77, baseType: !118, size: 16, offset: 1024)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !784, file: !785, line: 78, baseType: !810, size: 8, offset: 1040)
!810 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !784, file: !785, line: 79, baseType: !812, size: 8, offset: 1048)
!812 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 8, elements: !813)
!813 = !{!814}
!814 = !DISubrange(count: 1)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !784, file: !785, line: 81, baseType: !816, size: 64, offset: 1088)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !785, line: 43, baseType: null)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !784, file: !785, line: 89, baseType: !819, size: 64, offset: 1152)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !20, line: 153, baseType: !807)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !784, file: !785, line: 91, baseType: !821, size: 64, offset: 1216)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !785, line: 37, flags: DIFlagFwdDecl)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !784, file: !785, line: 92, baseType: !824, size: 64, offset: 1280)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !785, line: 38, flags: DIFlagFwdDecl)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !784, file: !785, line: 93, baseType: !783, size: 64, offset: 1344)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !784, file: !785, line: 94, baseType: !46, size: 64, offset: 1408)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !784, file: !785, line: 95, baseType: !119, size: 64, offset: 1472)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !784, file: !785, line: 96, baseType: !14, size: 32, offset: 1536)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !784, file: !785, line: 98, baseType: !831, size: 160, offset: 1568)
!831 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 160, elements: !832)
!832 = !{!833}
!833 = !DISubrange(count: 20)
!834 = !DISubprogram(name: "setlocale", scope: !835, file: !835, line: 122, type: !836, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !70)
!835 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!836 = !DISubroutineType(types: !837)
!837 = !{!44, !14, !58}
!838 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 189, type: !839, scopeLine: 190, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !842)
!839 = !DISubroutineType(types: !840)
!840 = !{!14, !14, !841}
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!842 = !{!843, !844, !845, !846, !847, !848, !860, !863, !866}
!843 = !DILocalVariable(name: "argc", arg: 1, scope: !838, file: !3, line: 189, type: !14)
!844 = !DILocalVariable(name: "argv", arg: 2, scope: !838, file: !3, line: 189, type: !841)
!845 = !DILocalVariable(name: "specified_mode", scope: !838, file: !3, line: 191, type: !58)
!846 = !DILocalVariable(name: "optc", scope: !838, file: !3, line: 192, type: !14)
!847 = !DILocalVariable(name: "scontext", scope: !838, file: !3, line: 193, type: !58)
!848 = !DILocalVariable(name: "options", scope: !838, file: !3, line: 194, type: !849)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mkdir_options", file: !3, line: 85, size: 256, elements: !850)
!850 = !{!851, !855, !856, !857, !858, !859}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "make_ancestor_function", scope: !849, file: !3, line: 89, baseType: !852, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DISubroutineType(types: !854)
!854 = !{!14, !58, !58, !46}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "umask_value", scope: !849, file: !3, line: 92, baseType: !677, size: 32, offset: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !849, file: !3, line: 95, baseType: !677, size: 32, offset: 96)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "mode_bits", scope: !849, file: !3, line: 98, baseType: !677, size: 32, offset: 128)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "set_security_context", scope: !849, file: !3, line: 101, baseType: !79, size: 8, offset: 160)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "created_directory_format", scope: !849, file: !3, line: 104, baseType: !58, size: 64, offset: 192)
!860 = !DILocalVariable(name: "ret", scope: !861, file: !3, line: 261, type: !14)
!861 = distinct !DILexicalBlock(scope: !862, file: !3, line: 260, column: 5)
!862 = distinct !DILexicalBlock(scope: !838, file: !3, line: 259, column: 7)
!863 = !DILocalVariable(name: "umask_value", scope: !864, file: !3, line: 276, type: !677)
!864 = distinct !DILexicalBlock(scope: !865, file: !3, line: 275, column: 5)
!865 = distinct !DILexicalBlock(scope: !838, file: !3, line: 274, column: 7)
!866 = !DILocalVariable(name: "change", scope: !867, file: !3, line: 282, type: !869)
!867 = distinct !DILexicalBlock(scope: !868, file: !3, line: 281, column: 9)
!868 = distinct !DILexicalBlock(scope: !864, file: !3, line: 280, column: 11)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DICompositeType(tag: DW_TAG_structure_type, name: "mode_change", file: !871, line: 25, flags: DIFlagFwdDecl)
!871 = !DIFile(filename: "./lib/modechange.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!872 = !DILocation(scope: !838)
!873 = !DILocation(line: 194, column: 3, scope: !838)
!874 = !DILocation(line: 194, column: 24, scope: !838)
!875 = !DILocation(line: 196, column: 11, scope: !838)
!876 = !DILocation(line: 196, column: 34, scope: !838)
!877 = !{!878, !709, i64 0}
!878 = !{!"mkdir_options", !709, i64 0, !879, i64 8, !879, i64 12, !879, i64 16, !880, i64 20, !709, i64 24}
!879 = !{!"int", !710, i64 0}
!880 = !{!"_Bool", !710, i64 0}
!881 = !DILocation(line: 197, column: 11, scope: !838)
!882 = !DILocation(line: 197, column: 16, scope: !838)
!883 = !{!878, !879, i64 12}
!884 = !DILocation(line: 198, column: 11, scope: !838)
!885 = !DILocation(line: 198, column: 21, scope: !838)
!886 = !{!878, !879, i64 16}
!887 = !DILocation(line: 199, column: 11, scope: !838)
!888 = !DILocation(line: 199, column: 36, scope: !838)
!889 = !{!878, !709, i64 24}
!890 = !DILocation(line: 200, column: 11, scope: !838)
!891 = !DILocation(line: 200, column: 32, scope: !838)
!892 = !{!878, !880, i64 20}
!893 = !DILocation(line: 203, column: 21, scope: !838)
!894 = !DILocation(line: 203, column: 3, scope: !838)
!895 = !DILocation(line: 204, column: 3, scope: !838)
!896 = !DILocation(line: 205, column: 3, scope: !838)
!897 = !DILocation(line: 206, column: 3, scope: !838)
!898 = !DILocation(line: 208, column: 3, scope: !838)
!899 = !DILocation(line: 210, column: 3, scope: !838)
!900 = !DILocation(line: 210, column: 18, scope: !838)
!901 = !DILocation(line: 215, column: 42, scope: !902)
!902 = distinct !DILexicalBlock(scope: !903, file: !3, line: 213, column: 9)
!903 = distinct !DILexicalBlock(scope: !838, file: !3, line: 211, column: 5)
!904 = !DILocation(line: 216, column: 11, scope: !902)
!905 = distinct !{!905, !899, !906, !755}
!906 = !DILocation(line: 248, column: 5, scope: !838)
!907 = !DILocation(line: 218, column: 28, scope: !902)
!908 = !DILocation(line: 219, column: 11, scope: !902)
!909 = !DILocation(line: 221, column: 46, scope: !902)
!910 = !DILocation(line: 221, column: 44, scope: !902)
!911 = !DILocation(line: 222, column: 11, scope: !902)
!912 = !DILocation(line: 236, column: 20, scope: !913)
!913 = distinct !DILexicalBlock(scope: !914, file: !3, line: 236, column: 20)
!914 = distinct !DILexicalBlock(scope: !915, file: !3, line: 229, column: 20)
!915 = distinct !DILexicalBlock(scope: !902, file: !3, line: 224, column: 15)
!916 = !DILocation(line: 236, column: 20, scope: !914)
!917 = !DILocation(line: 239, column: 22, scope: !918)
!918 = distinct !DILexicalBlock(scope: !913, file: !3, line: 237, column: 13)
!919 = !DILocation(line: 238, column: 15, scope: !918)
!920 = !DILocation(line: 241, column: 13, scope: !918)
!921 = !DILocation(line: 243, column: 9, scope: !902)
!922 = !DILocation(line: 244, column: 9, scope: !902)
!923 = !DILocation(line: 246, column: 11, scope: !902)
!924 = !DILocation(line: 250, column: 7, scope: !925)
!925 = distinct !DILexicalBlock(scope: !838, file: !3, line: 250, column: 7)
!926 = !{!879, !879, i64 0}
!927 = !DILocation(line: 250, column: 14, scope: !925)
!928 = !DILocation(line: 250, column: 7, scope: !838)
!929 = !DILocation(line: 252, column: 20, scope: !930)
!930 = distinct !DILexicalBlock(scope: !925, file: !3, line: 251, column: 5)
!931 = !DILocation(line: 252, column: 7, scope: !930)
!932 = !DILocation(line: 253, column: 7, scope: !930)
!933 = !DILocation(line: 274, column: 38, scope: !865)
!934 = !DILocation(line: 276, column: 28, scope: !864)
!935 = !DILocation(scope: !864)
!936 = !DILocation(line: 277, column: 7, scope: !864)
!937 = !DILocation(line: 278, column: 15, scope: !864)
!938 = !DILocation(line: 278, column: 27, scope: !864)
!939 = !{!878, !879, i64 8}
!940 = !DILocation(line: 280, column: 11, scope: !864)
!941 = !DILocation(line: 282, column: 40, scope: !867)
!942 = !DILocation(scope: !867)
!943 = !DILocation(line: 283, column: 16, scope: !944)
!944 = distinct !DILexicalBlock(scope: !867, file: !3, line: 283, column: 15)
!945 = !DILocation(line: 283, column: 15, scope: !867)
!946 = !DILocation(line: 284, column: 13, scope: !944)
!947 = !DILocation(line: 286, column: 26, scope: !867)
!948 = !DILocation(line: 286, column: 24, scope: !867)
!949 = !DILocation(line: 288, column: 17, scope: !867)
!950 = !DILocation(line: 288, column: 11, scope: !867)
!951 = !DILocation(line: 289, column: 9, scope: !867)
!952 = !DILocation(line: 291, column: 22, scope: !868)
!953 = !DILocation(line: 294, column: 39, scope: !838)
!954 = !DILocation(line: 294, column: 37, scope: !838)
!955 = !DILocation(line: 294, column: 52, scope: !838)
!956 = !DILocation(line: 294, column: 10, scope: !838)
!957 = !DILocation(line: 296, column: 1, scope: !838)
!958 = !DILocation(line: 294, column: 3, scope: !838)
!959 = !DISubprogram(name: "bindtextdomain", scope: !776, file: !776, line: 86, type: !960, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !70)
!960 = !DISubroutineType(types: !961)
!961 = !{!44, !58, !58}
!962 = !DISubprogram(name: "textdomain", scope: !776, file: !776, line: 82, type: !963, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !70)
!963 = !DISubroutineType(types: !964)
!964 = !{!44, !58}
!965 = !DISubprogram(name: "atexit", scope: !966, file: !966, line: 595, type: !967, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !70)
!966 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!967 = !DISubroutineType(types: !968)
!968 = !{!14, !969}
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!970 = !DISubprogram(name: "getopt_long", scope: !55, file: !55, line: 66, type: !971, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !70)
!971 = !DISubroutineType(types: !972)
!972 = !{!14, !14, !973, !58, !975, !62}
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!976 = distinct !DISubprogram(name: "make_ancestor", scope: !3, file: !3, line: 122, type: !853, scopeLine: 123, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !977)
!977 = !{!978, !979, !980, !981, !984, !985, !986, !987}
!978 = !DILocalVariable(name: "dir", arg: 1, scope: !976, file: !3, line: 122, type: !58)
!979 = !DILocalVariable(name: "component", arg: 2, scope: !976, file: !3, line: 122, type: !58)
!980 = !DILocalVariable(name: "options", arg: 3, scope: !976, file: !3, line: 122, type: !46)
!981 = !DILocalVariable(name: "o", scope: !976, file: !3, line: 124, type: !982)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !849)
!984 = !DILocalVariable(name: "user_wx", scope: !976, file: !3, line: 131, type: !677)
!985 = !DILocalVariable(name: "self_denying_umask", scope: !976, file: !3, line: 132, type: !79)
!986 = !DILocalVariable(name: "r", scope: !976, file: !3, line: 135, type: !14)
!987 = !DILocalVariable(name: "mkdir_errno", scope: !988, file: !3, line: 138, type: !14)
!988 = distinct !DILexicalBlock(scope: !989, file: !3, line: 137, column: 5)
!989 = distinct !DILexicalBlock(scope: !976, file: !3, line: 136, column: 7)
!990 = !DILocation(scope: !976)
!991 = !DILocation(line: 126, column: 10, scope: !992)
!992 = distinct !DILexicalBlock(scope: !976, file: !3, line: 126, column: 7)
!993 = !{i8 0, i8 2}
!994 = !DILocation(line: 126, column: 31, scope: !992)
!995 = !DILocalVariable(name: "path", arg: 1, scope: !996, file: !997, line: 44, type: !58)
!996 = distinct !DISubprogram(name: "defaultcon", scope: !997, file: !997, line: 44, type: !998, scopeLine: 45, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1000)
!997 = !DIFile(filename: "src/selinux.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!998 = !DISubroutineType(types: !999)
!999 = !{!14, !58, !677}
!1000 = !{!995, !1001}
!1001 = !DILocalVariable(name: "mode", arg: 2, scope: !996, file: !997, line: 44, type: !677)
!1002 = !DILocation(scope: !996, inlinedAt: !1003)
!1003 = distinct !DILocation(line: 126, column: 34, scope: !992)
!1004 = !DILocation(line: 45, column: 3, scope: !996, inlinedAt: !1003)
!1005 = !DILocation(line: 45, column: 9, scope: !996, inlinedAt: !1003)
!1006 = !DILocation(line: 126, column: 7, scope: !976)
!1007 = !DILocation(line: 132, column: 33, scope: !976)
!1008 = !DILocation(line: 132, column: 45, scope: !976)
!1009 = !DILocation(line: 132, column: 56, scope: !976)
!1010 = !DILocation(line: 133, column: 7, scope: !976)
!1011 = !DILocation(line: 135, column: 11, scope: !976)
!1012 = !DILocation(line: 136, column: 7, scope: !976)
!1013 = !DILocation(line: 134, column: 27, scope: !1014)
!1014 = distinct !DILexicalBlock(scope: !976, file: !3, line: 133, column: 7)
!1015 = !DILocation(line: 134, column: 5, scope: !1014)
!1016 = !DILocation(line: 138, column: 25, scope: !988)
!1017 = !DILocation(scope: !988)
!1018 = !DILocation(line: 139, column: 17, scope: !988)
!1019 = !DILocation(line: 139, column: 7, scope: !988)
!1020 = !DILocation(line: 140, column: 13, scope: !988)
!1021 = !DILocation(line: 141, column: 5, scope: !988)
!1022 = !DILocation(line: 142, column: 9, scope: !1023)
!1023 = distinct !DILexicalBlock(scope: !976, file: !3, line: 142, column: 7)
!1024 = !DILocation(line: 142, column: 7, scope: !976)
!1025 = !DILocation(line: 144, column: 15, scope: !1026)
!1026 = distinct !DILexicalBlock(scope: !1023, file: !3, line: 143, column: 5)
!1027 = !DILocation(line: 144, column: 38, scope: !1026)
!1028 = !DILocalVariable(name: "dir", arg: 1, scope: !1029, file: !3, line: 109, type: !58)
!1029 = distinct !DISubprogram(name: "announce_mkdir", scope: !3, file: !3, line: 109, type: !1030, scopeLine: 110, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1032)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{null, !58, !46}
!1032 = !{!1028, !1033, !1034}
!1033 = !DILocalVariable(name: "options", arg: 2, scope: !1029, file: !3, line: 109, type: !46)
!1034 = !DILocalVariable(name: "o", scope: !1029, file: !3, line: 111, type: !982)
!1035 = !DILocation(scope: !1029, inlinedAt: !1036)
!1036 = distinct !DILocation(line: 145, column: 7, scope: !1026)
!1037 = !DILocation(line: 112, column: 10, scope: !1038, inlinedAt: !1036)
!1038 = distinct !DILexicalBlock(scope: !1029, file: !3, line: 112, column: 7)
!1039 = !DILocation(line: 112, column: 7, scope: !1038, inlinedAt: !1036)
!1040 = !DILocation(line: 112, column: 7, scope: !1029, inlinedAt: !1036)
!1041 = !DILocation(line: 113, column: 19, scope: !1038, inlinedAt: !1036)
!1042 = !DILocation(line: 113, column: 56, scope: !1038, inlinedAt: !1036)
!1043 = !DILocation(line: 113, column: 5, scope: !1038, inlinedAt: !1036)
!1044 = !DILocation(line: 147, column: 3, scope: !976)
!1045 = !DISubprogram(name: "error", scope: !1046, file: !1046, line: 52, type: !1047, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !70)
!1046 = !DIFile(filename: "./lib/error.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1047 = !DISubroutineType(types: !1048)
!1048 = !{null, !14, !14, !58, null}
!1049 = !DISubprogram(name: "umask", scope: !1050, file: !1050, line: 308, type: !1051, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !70)
!1050 = !DIFile(filename: "/usr/include/sys/stat.h", directory: "")
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!21, !21}
!1053 = distinct !DISubprogram(name: "process_dir", scope: !3, file: !3, line: 152, type: !1054, scopeLine: 153, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1057)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{!14, !44, !1056, !46}
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!1057 = !{!1058, !1059, !1060, !1061, !1062}
!1058 = !DILocalVariable(name: "dir", arg: 1, scope: !1053, file: !3, line: 152, type: !44)
!1059 = !DILocalVariable(name: "wd", arg: 2, scope: !1053, file: !3, line: 152, type: !1056)
!1060 = !DILocalVariable(name: "options", arg: 3, scope: !1053, file: !3, line: 152, type: !46)
!1061 = !DILocalVariable(name: "o", scope: !1053, file: !3, line: 154, type: !982)
!1062 = !DILocalVariable(name: "ret", scope: !1053, file: !3, line: 165, type: !14)
!1063 = !DILocation(scope: !1053)
!1064 = !DILocation(line: 157, column: 10, scope: !1065)
!1065 = distinct !DILexicalBlock(scope: !1053, file: !3, line: 157, column: 7)
!1066 = !DILocation(line: 157, column: 7, scope: !1053)
!1067 = !DILocation(scope: !996, inlinedAt: !1068)
!1068 = distinct !DILocation(line: 159, column: 42, scope: !1069)
!1069 = distinct !DILexicalBlock(scope: !1070, file: !3, line: 159, column: 11)
!1070 = distinct !DILexicalBlock(scope: !1065, file: !3, line: 158, column: 5)
!1071 = !DILocation(line: 45, column: 3, scope: !996, inlinedAt: !1068)
!1072 = !DILocation(line: 45, column: 9, scope: !996, inlinedAt: !1068)
!1073 = !DILocation(line: 159, column: 11, scope: !1070)
!1074 = !DILocation(line: 165, column: 44, scope: !1053)
!1075 = !DILocation(line: 166, column: 35, scope: !1053)
!1076 = !DILocation(line: 167, column: 35, scope: !1053)
!1077 = !DILocation(line: 165, column: 14, scope: !1053)
!1078 = !DILocation(line: 176, column: 27, scope: !1079)
!1079 = distinct !DILexicalBlock(scope: !1053, file: !3, line: 176, column: 7)
!1080 = !DILocation(line: 176, column: 33, scope: !1079)
!1081 = !DILocation(line: 177, column: 7, scope: !1079)
!1082 = !DILocation(line: 177, column: 13, scope: !1079)
!1083 = !DILocation(line: 177, column: 10, scope: !1079)
!1084 = !DILocation(line: 176, column: 7, scope: !1053)
!1085 = !DILocalVariable(name: "path", arg: 1, scope: !1086, file: !997, line: 40, type: !58)
!1086 = distinct !DISubprogram(name: "restorecon", scope: !997, file: !997, line: 40, type: !1087, scopeLine: 41, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1089)
!1087 = !DISubroutineType(types: !1088)
!1088 = !{!79, !58, !79, !79}
!1089 = !{!1085, !1090, !1091}
!1090 = !DILocalVariable(name: "recurse", arg: 2, scope: !1086, file: !997, line: 40, type: !79)
!1091 = !DILocalVariable(name: "preserve", arg: 3, scope: !1086, file: !997, line: 40, type: !79)
!1092 = !DILocation(scope: !1086, inlinedAt: !1093)
!1093 = distinct !DILocation(line: 179, column: 13, scope: !1094)
!1094 = distinct !DILexicalBlock(scope: !1095, file: !3, line: 179, column: 11)
!1095 = distinct !DILexicalBlock(scope: !1079, file: !3, line: 178, column: 5)
!1096 = !DILocation(line: 41, column: 3, scope: !1086, inlinedAt: !1093)
!1097 = !DILocation(line: 41, column: 9, scope: !1086, inlinedAt: !1093)
!1098 = !DILocation(line: 179, column: 11, scope: !1095)
!1099 = !DILocation(line: 185, column: 3, scope: !1053)
!1100 = !DILocation(scope: !1029)
!1101 = !DILocation(line: 112, column: 10, scope: !1038)
!1102 = !DILocation(line: 112, column: 7, scope: !1038)
!1103 = !DILocation(line: 112, column: 7, scope: !1029)
!1104 = !DILocation(line: 113, column: 19, scope: !1038)
!1105 = !DILocation(line: 113, column: 56, scope: !1038)
!1106 = !DILocation(line: 113, column: 5, scope: !1038)
!1107 = !DILocation(line: 114, column: 1, scope: !1029)
!1108 = !DISubprogram(name: "mkdir", scope: !1050, file: !1050, line: 317, type: !1109, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !70)
!1109 = !DISubroutineType(types: !1110)
!1110 = !{!14, !58, !21}
!1111 = distinct !DISubprogram(name: "prog_fprintf", scope: !190, file: !190, line: 28, type: !1112, scopeLine: 29, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !189, retainedNodes: !1149)
!1112 = !DISubroutineType(types: !1113)
!1113 = !{null, !1114, !58, null}
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64)
!1115 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !1116, line: 7, baseType: !1117)
!1116 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "")
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !785, line: 49, size: 1728, elements: !1118)
!1118 = !{!1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1117, file: !785, line: 51, baseType: !14, size: 32)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1117, file: !785, line: 54, baseType: !44, size: 64, offset: 64)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1117, file: !785, line: 55, baseType: !44, size: 64, offset: 128)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1117, file: !785, line: 56, baseType: !44, size: 64, offset: 192)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1117, file: !785, line: 57, baseType: !44, size: 64, offset: 256)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1117, file: !785, line: 58, baseType: !44, size: 64, offset: 320)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1117, file: !785, line: 59, baseType: !44, size: 64, offset: 384)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1117, file: !785, line: 60, baseType: !44, size: 64, offset: 448)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1117, file: !785, line: 61, baseType: !44, size: 64, offset: 512)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1117, file: !785, line: 64, baseType: !44, size: 64, offset: 576)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1117, file: !785, line: 65, baseType: !44, size: 64, offset: 640)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1117, file: !785, line: 66, baseType: !44, size: 64, offset: 704)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1117, file: !785, line: 68, baseType: !800, size: 64, offset: 768)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1117, file: !785, line: 70, baseType: !1133, size: 64, offset: 832)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1117, file: !785, line: 72, baseType: !14, size: 32, offset: 896)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1117, file: !785, line: 73, baseType: !14, size: 32, offset: 928)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1117, file: !785, line: 74, baseType: !806, size: 64, offset: 960)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1117, file: !785, line: 77, baseType: !118, size: 16, offset: 1024)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1117, file: !785, line: 78, baseType: !810, size: 8, offset: 1040)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1117, file: !785, line: 79, baseType: !812, size: 8, offset: 1048)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1117, file: !785, line: 81, baseType: !816, size: 64, offset: 1088)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1117, file: !785, line: 89, baseType: !819, size: 64, offset: 1152)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1117, file: !785, line: 91, baseType: !821, size: 64, offset: 1216)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1117, file: !785, line: 92, baseType: !824, size: 64, offset: 1280)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1117, file: !785, line: 93, baseType: !1133, size: 64, offset: 1344)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1117, file: !785, line: 94, baseType: !46, size: 64, offset: 1408)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1117, file: !785, line: 95, baseType: !119, size: 64, offset: 1472)
