; ModuleID = 'coreutils-8.30/src/mkdir.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.mkdir_options = type { i32 (i8*, i8*, i8*)*, i32, i32, i32, i8, i8* }
%struct.mode_change = type { i8, i8, i32, i32, i32 }
%struct.savewd = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [36 x i8] c"Usage: %s [OPTION]... DIRECTORY...\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 41, type: !52, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !43, globals: !51)
!3 = !DIFile(filename: "src/mkdir.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!4 = !{!5, !20}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!9 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !22, file: !21, line: 39, baseType: !7, size: 32, elements: !36)
!21 = !DIFile(filename: "./lib/savewd.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savewd", file: !21, line: 36, size: 64, elements: !23)
!23 = !{!24, !25}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !22, file: !21, line: 66, baseType: !20, size: 32)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !22, file: !21, line: 74, baseType: !26, size: 32, offset: 32)
!26 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !22, file: !21, line: 69, size: 32, elements: !27)
!27 = !{!28, !30, !31}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !26, file: !21, line: 71, baseType: !29, size: 32)
!29 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "errnum", scope: !26, file: !21, line: 72, baseType: !29, size: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !26, file: !21, line: 73, baseType: !32, size: 32)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !33, line: 97, baseType: !34)
!33 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !35, line: 152, baseType: !29)
!35 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!36 = !{!37, !38, !39, !40, !41, !42}
!37 = !DIEnumerator(name: "INITIAL_STATE", value: 0, isUnsigned: true)
!38 = !DIEnumerator(name: "FD_STATE", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "FD_POST_CHDIR_STATE", value: 2, isUnsigned: true)
!40 = !DIEnumerator(name: "FORKING_STATE", value: 3, isUnsigned: true)
!41 = !DIEnumerator(name: "ERROR_STATE", value: 4, isUnsigned: true)
!42 = !DIEnumerator(name: "FINAL_STATE", value: 5, isUnsigned: true)
!43 = !{!44, !46, !47, !49}
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !33, line: 79, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !35, line: 144, baseType: !7)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !33, line: 64, baseType: !50)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !35, line: 145, baseType: !7)
!51 = !{!0}
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 1792, elements: !64)
!53 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !55, line: 50, size: 256, elements: !56)
!55 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!56 = !{!57, !60, !61, !63}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !54, file: !55, line: 52, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !54, file: !55, line: 55, baseType: !29, size: 32, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !54, file: !55, line: 56, baseType: !62, size: 64, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !54, file: !55, line: 57, baseType: !29, size: 32, offset: 192)
!64 = !{!65}
!65 = !DISubrange(count: 7)
!66 = !DIGlobalVariableExpression(var: !67, expr: !DIExpression())
!67 = distinct !DIGlobalVariable(name: "Version", scope: !68, file: !69, line: 2, type: !58, isLocal: false, isDefinition: true)
!68 = distinct !DICompileUnit(language: DW_LANG_C99, file: !69, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !70, globals: !71)
!69 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!70 = !{}
!71 = !{!66}
!72 = !DIGlobalVariableExpression(var: !73, expr: !DIExpression())
!73 = distinct !DIGlobalVariable(name: "file_name", scope: !74, file: !79, line: 46, type: !58, isLocal: true, isDefinition: true)
!74 = distinct !DICompileUnit(language: DW_LANG_C99, file: !75, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !70, globals: !76)
!75 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!76 = !{!72, !77}
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !74, file: !79, line: 56, type: !80, isLocal: true, isDefinition: true)
!79 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!80 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!81 = !DIGlobalVariableExpression(var: !82, expr: !DIExpression())
!82 = distinct !DIGlobalVariable(name: "exit_failure", scope: !83, file: !86, line: 24, type: !87, isLocal: false, isDefinition: true)
!83 = distinct !DICompileUnit(language: DW_LANG_C99, file: !84, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !70, globals: !85)
!84 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!85 = !{!81}
!86 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!87 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !29)
!88 = !DIGlobalVariableExpression(var: !89, expr: !DIExpression())
!89 = distinct !DIGlobalVariable(name: "program_name", scope: !90, file: !94, line: 33, type: !58, isLocal: false, isDefinition: true)
!90 = distinct !DICompileUnit(language: DW_LANG_C99, file: !91, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !70, retainedTypes: !92, globals: !93)
!91 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!92 = !{!46, !44}
!93 = !{!88}
!94 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!95 = !DIGlobalVariableExpression(var: !96, expr: !DIExpression())
!96 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !97, file: !128, line: 85, type: !163, isLocal: false, isDefinition: true)
!97 = distinct !DICompileUnit(language: DW_LANG_C99, file: !98, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !99, retainedTypes: !120, globals: !125)
!98 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!99 = !{!5, !100, !105}
!100 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, baseType: !7, size: 32, elements: !101)
!101 = !{!102, !103, !104}
!102 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!103 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!104 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!105 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !106, line: 46, baseType: !7, size: 32, elements: !107)
!106 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!107 = !{!108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119}
!108 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!109 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!110 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!111 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!112 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!113 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!114 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!115 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!116 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!117 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!118 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!119 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!120 = !{!29, !121, !122, !44}
!121 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !123, line: 62, baseType: !124)
!123 = !DIFile(filename: "/usr/lib/clang/7.0.0/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!124 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!125 = !{!95, !126, !133, !145, !147, !152, !159, !161}
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !97, file: !128, line: 101, type: !129, isLocal: false, isDefinition: true)
!128 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 320, elements: !131)
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!131 = !{!132}
!132 = !DISubrange(count: 10)
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !97, file: !128, line: 1052, type: !135, isLocal: false, isDefinition: true)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !128, line: 65, size: 448, elements: !136)
!136 = !{!137, !138, !139, !143, !144}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !135, file: !128, line: 68, baseType: !5, size: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !135, file: !128, line: 71, baseType: !29, size: 32, offset: 32)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !135, file: !128, line: 75, baseType: !140, size: 256, offset: 64)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !141)
!141 = !{!142}
!142 = !DISubrange(count: 8)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !135, file: !128, line: 78, baseType: !58, size: 64, offset: 320)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !135, file: !128, line: 81, baseType: !58, size: 64, offset: 384)
!145 = !DIGlobalVariableExpression(var: !146, expr: !DIExpression())
!146 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !97, file: !128, line: 116, type: !135, isLocal: true, isDefinition: true)
!147 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression())
!148 = distinct !DIGlobalVariable(name: "slot0", scope: !97, file: !128, line: 842, type: !149, isLocal: true, isDefinition: true)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 2048, elements: !150)
!150 = !{!151}
!151 = !DISubrange(count: 256)
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(name: "slotvec", scope: !97, file: !128, line: 845, type: !154, isLocal: true, isDefinition: true)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !128, line: 834, size: 128, elements: !156)
!156 = !{!157, !158}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !155, file: !128, line: 836, baseType: !122, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !155, file: !128, line: 837, baseType: !44, size: 64, offset: 64)
!159 = !DIGlobalVariableExpression(var: !160, expr: !DIExpression())
!160 = distinct !DIGlobalVariable(name: "nslots", scope: !97, file: !128, line: 843, type: !29, isLocal: true, isDefinition: true)
!161 = !DIGlobalVariableExpression(var: !162, expr: !DIExpression())
!162 = distinct !DIGlobalVariable(name: "slotvec0", scope: !97, file: !128, line: 844, type: !155, isLocal: true, isDefinition: true)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 704, elements: !165)
!164 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!165 = !{!166}
!166 = !DISubrange(count: 11)
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !169, file: !172, line: 26, type: !173, isLocal: false, isDefinition: true)
!169 = distinct !DICompileUnit(language: DW_LANG_C99, file: !170, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !70, globals: !171)
!170 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!171 = !{!167}
!172 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 376, elements: !174)
!174 = !{!175}
!175 = !DISubrange(count: 47)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !178, file: !179, line: 339, type: !29, isLocal: true, isDefinition: true)
!178 = distinct !DISubprogram(name: "rpl_fcntl", scope: !179, file: !179, line: 276, type: !180, isLocal: false, isDefinition: true, scopeLine: 277, flags: DIFlagPrototyped, isOptimized: true, unit: !182, retainedNodes: !185)
!179 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!180 = !DISubroutineType(types: !181)
!181 = !{!29, !29, !29, null}
!182 = distinct !DICompileUnit(language: DW_LANG_C99, file: !183, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !70, globals: !184)
!183 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!184 = !{!176}
!185 = !{!186, !187, !188, !201, !202, !205, !208, !211}
!186 = !DILocalVariable(name: "fd", arg: 1, scope: !178, file: !179, line: 276, type: !29)
!187 = !DILocalVariable(name: "action", arg: 2, scope: !178, file: !179, line: 276, type: !29)
!188 = !DILocalVariable(name: "arg", scope: !178, file: !179, line: 278, type: !189)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !190, line: 30, baseType: !191)
!190 = !DIFile(filename: "/usr/lib/clang/7.0.0/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !183, line: 278, baseType: !192)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 192, elements: !199)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !183, line: 278, size: 192, elements: !194)
!194 = !{!195, !196, !197, !198}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !193, file: !183, line: 278, baseType: !7, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !193, file: !183, line: 278, baseType: !7, size: 32, offset: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !193, file: !183, line: 278, baseType: !46, size: 64, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !193, file: !183, line: 278, baseType: !46, size: 64, offset: 128)
!199 = !{!200}
!200 = !DISubrange(count: 1)
!201 = !DILocalVariable(name: "result", scope: !178, file: !179, line: 279, type: !29)
!202 = !DILocalVariable(name: "target", scope: !203, file: !179, line: 326, type: !29)
!203 = distinct !DILexicalBlock(scope: !204, file: !179, line: 325, column: 7)
!204 = distinct !DILexicalBlock(scope: !178, file: !179, line: 282, column: 5)
!205 = !DILocalVariable(name: "flags", scope: !206, file: !179, line: 363, type: !29)
!206 = distinct !DILexicalBlock(scope: !207, file: !179, line: 362, column: 11)
!207 = distinct !DILexicalBlock(scope: !203, file: !179, line: 361, column: 13)
!208 = !DILocalVariable(name: "saved_errno", scope: !209, file: !179, line: 366, type: !29)
!209 = distinct !DILexicalBlock(scope: !210, file: !179, line: 365, column: 15)
!210 = distinct !DILexicalBlock(scope: !206, file: !179, line: 364, column: 17)
!211 = !DILocalVariable(name: "p", scope: !212, file: !179, line: 408, type: !46)
!212 = distinct !DILexicalBlock(scope: !204, file: !179, line: 406, column: 7)
!213 = distinct !DICompileUnit(language: DW_LANG_C99, file: !214, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !70, retainedTypes: !215)
!214 = !DIFile(filename: "src/prog-fprintf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!215 = !{!216}
!216 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!217 = distinct !DICompileUnit(language: DW_LANG_C99, file: !218, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !70)
!218 = !DIFile(filename: "src/selinux.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!219 = distinct !DICompileUnit(language: DW_LANG_C99, file: !220, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !221, retainedTypes: !236)
!220 = !DIFile(filename: "./lib/mkdir-p.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!221 = !{!222, !232}
!222 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !223, file: !21, line: 39, baseType: !7, size: 32, elements: !36)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savewd", file: !21, line: 36, size: 64, elements: !224)
!224 = !{!225, !226}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !223, file: !21, line: 66, baseType: !222, size: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !223, file: !21, line: 74, baseType: !227, size: 32, offset: 32)
!227 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !223, file: !21, line: 69, size: 32, elements: !228)
!228 = !{!229, !230, !231}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !227, file: !21, line: 71, baseType: !29, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "errnum", scope: !227, file: !21, line: 72, baseType: !29, size: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !227, file: !21, line: 73, baseType: !32, size: 32)
!232 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 86, baseType: !7, size: 32, elements: !233)
!233 = !{!234, !235}
!234 = !DIEnumerator(name: "SAVEWD_CHDIR_NOFOLLOW", value: 1, isUnsigned: true)
!235 = !DIEnumerator(name: "SAVEWD_CHDIR_SKIP_READABLE", value: 2, isUnsigned: true)
!236 = !{!47, !49}
!237 = distinct !DICompileUnit(language: DW_LANG_C99, file: !238, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !239, retainedTypes: !247)
!238 = !DIFile(filename: "./lib/modechange.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!239 = !{!240}
!240 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !241, line: 78, baseType: !7, size: 32, elements: !242)
!241 = !DIFile(filename: "lib/modechange.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!242 = !{!243, !244, !245, !246}
!243 = !DIEnumerator(name: "MODE_DONE", value: 0, isUnsigned: true)
!244 = !DIEnumerator(name: "MODE_ORDINARY_CHANGE", value: 1, isUnsigned: true)
!245 = !DIEnumerator(name: "MODE_X_IF_ANY_X", value: 2, isUnsigned: true)
!246 = !DIEnumerator(name: "MODE_COPY_EXISTING", value: 3, isUnsigned: true)
!247 = !{!122}
!248 = distinct !DICompileUnit(language: DW_LANG_C99, file: !249, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !250)
!249 = !DIFile(filename: "./lib/savewd.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!250 = !{!251, !232}
!251 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !252, file: !21, line: 39, baseType: !7, size: 32, elements: !36)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savewd", file: !21, line: 36, size: 64, elements: !253)
!253 = !{!254, !255}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !252, file: !21, line: 66, baseType: !251, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !252, file: !21, line: 74, baseType: !256, size: 32, offset: 32)
!256 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !252, file: !21, line: 69, size: 32, elements: !257)
!257 = !{!258, !259, !260}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !256, file: !21, line: 71, baseType: !29, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "errnum", scope: !256, file: !21, line: 72, baseType: !29, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !256, file: !21, line: 73, baseType: !32, size: 32)
!261 = distinct !DICompileUnit(language: DW_LANG_C99, file: !262, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !263, retainedTypes: !268)
!262 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!263 = !{!264}
!264 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !265, line: 41, baseType: !7, size: 32, elements: !266)
!265 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!266 = !{!267}
!267 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2018, isUnsigned: true)
!268 = !{!46}
!269 = distinct !DICompileUnit(language: DW_LANG_C99, file: !270, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !271, retainedTypes: !285)
!270 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!271 = !{!272}
!272 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !274, file: !273, line: 186, baseType: !7, size: 32, elements: !283)
!273 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!274 = distinct !DISubprogram(name: "x2nrealloc", scope: !273, file: !273, line: 174, type: !275, isLocal: false, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: true, unit: !269, retainedNodes: !278)
!275 = !DISubroutineType(types: !276)
!276 = !{!46, !46, !277, !122}
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!278 = !{!279, !280, !281, !282}
!279 = !DILocalVariable(name: "p", arg: 1, scope: !274, file: !273, line: 174, type: !46)
!280 = !DILocalVariable(name: "pn", arg: 2, scope: !274, file: !273, line: 174, type: !277)
!281 = !DILocalVariable(name: "s", arg: 3, scope: !274, file: !273, line: 174, type: !122)
!282 = !DILocalVariable(name: "n", scope: !274, file: !273, line: 176, type: !122)
!283 = !{!284}
!284 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!285 = !{!122, !44, !46}
!286 = distinct !DICompileUnit(language: DW_LANG_C99, file: !287, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !70)
!287 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!288 = distinct !DICompileUnit(language: DW_LANG_C99, file: !289, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !70, retainedTypes: !268)
!289 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!290 = distinct !DICompileUnit(language: DW_LANG_C99, file: !291, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !70, retainedTypes: !247)
!291 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!292 = distinct !DICompileUnit(language: DW_LANG_C99, file: !293, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !70)
!293 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!294 = distinct !DICompileUnit(language: DW_LANG_C99, file: !295, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !70)
!295 = !DIFile(filename: "./lib/open-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!296 = distinct !DICompileUnit(language: DW_LANG_C99, file: !297, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !70)
!297 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!298 = distinct !DICompileUnit(language: DW_LANG_C99, file: !299, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !300, retainedTypes: !268)
!299 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!300 = !{!301}
!301 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !302, line: 41, baseType: !7, size: 32, elements: !303)
!302 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!303 = !{!304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686}
!304 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!305 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!306 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!307 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!308 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!309 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!310 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!311 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!312 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!313 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!314 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!315 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!316 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!317 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!318 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!319 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!320 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!321 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!322 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!323 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!324 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!325 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!326 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!327 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!328 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!329 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!330 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!331 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!332 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!333 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!334 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!335 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!336 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!337 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!338 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!339 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!340 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!341 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!342 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!343 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!344 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!345 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!346 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!347 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!348 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!349 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!350 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!351 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!352 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!353 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!354 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!355 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!356 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!357 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!358 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!359 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!360 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!361 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!362 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!363 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!364 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!365 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!366 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!367 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!368 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!369 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!370 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!371 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!372 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!373 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!374 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!375 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!376 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!377 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!378 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!379 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!380 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!381 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!382 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!383 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!384 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!385 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!386 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!387 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!388 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!389 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!390 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!391 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!392 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!393 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!394 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!395 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!396 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!397 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!398 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!399 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!400 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!401 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!402 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!403 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!404 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!405 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!406 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!407 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!408 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!409 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!410 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!411 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!412 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!413 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!414 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!415 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!416 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!417 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!418 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!419 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!420 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!421 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!422 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!423 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!424 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!425 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!426 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!427 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!428 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!429 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!430 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!431 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!432 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!433 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!434 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!435 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!436 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!437 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!438 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!439 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!440 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!441 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!442 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!443 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!444 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!445 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!446 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!447 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!448 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!449 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!450 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!451 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!452 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!453 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!454 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!455 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!456 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!457 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!458 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!459 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!460 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!461 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!462 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!463 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!464 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!465 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!466 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!467 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!468 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!469 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!470 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!471 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!472 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!473 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!474 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!475 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!476 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!477 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!478 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!479 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!480 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!481 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!482 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!483 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!484 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!485 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!486 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!487 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!488 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!489 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!490 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!491 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!492 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!493 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!494 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!495 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!496 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!497 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!498 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!499 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!500 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!501 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!502 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!503 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!504 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!505 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!506 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!507 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!508 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!509 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!510 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!511 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!512 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!513 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!514 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!515 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!516 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!517 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!518 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!519 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!520 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!521 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!522 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!523 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!524 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!525 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!526 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!527 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!528 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!529 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!530 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!531 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!532 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!533 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!534 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!535 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!536 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!537 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!538 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!539 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!540 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!541 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!542 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!543 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!544 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!545 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!546 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!547 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!548 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!549 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!550 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!551 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!552 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!553 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!554 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!555 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!556 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!557 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!558 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!559 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!560 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!561 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!562 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!563 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!564 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!565 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!566 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!567 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!568 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!569 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!570 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!571 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!572 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!573 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!574 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!575 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!576 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!577 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!578 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!579 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!580 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!581 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!582 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!583 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!584 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!585 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!586 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!587 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!588 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!589 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!590 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!591 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!592 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!593 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!594 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!595 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!596 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!597 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!598 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!599 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!600 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!601 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!602 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!603 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!604 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!605 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!606 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!607 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!608 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!609 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!610 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!611 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!612 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!613 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!614 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!615 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!616 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!617 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!618 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!619 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!620 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!621 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!622 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!623 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!624 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!625 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!626 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!627 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!628 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!629 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!630 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!631 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!632 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!633 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!634 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!635 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!636 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!637 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!661 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!662 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!663 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!664 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!665 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!666 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!667 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!668 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!669 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!670 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!671 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!672 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!673 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!674 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!675 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!676 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!677 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!678 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!679 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!680 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!681 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!682 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!683 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!684 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!685 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!686 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!687 = distinct !DICompileUnit(language: DW_LANG_C99, file: !688, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !689)
!688 = !DIFile(filename: "./lib/mkancesdirs.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!689 = !{!690, !232}
!690 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !691, file: !21, line: 39, baseType: !7, size: 32, elements: !36)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savewd", file: !21, line: 36, size: 64, elements: !692)
!692 = !{!693, !694}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !691, file: !21, line: 66, baseType: !690, size: 32)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !691, file: !21, line: 74, baseType: !695, size: 32, offset: 32)
!695 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !691, file: !21, line: 69, size: 32, elements: !696)
!696 = !{!697, !698, !699}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !695, file: !21, line: 71, baseType: !29, size: 32)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "errnum", scope: !695, file: !21, line: 72, baseType: !29, size: 32)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !695, file: !21, line: 73, baseType: !32, size: 32)
!700 = distinct !DICompileUnit(language: DW_LANG_C99, file: !701, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !70, retainedTypes: !702)
!701 = !DIFile(filename: "./lib/dirchownmod.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!702 = !{!47, !49, !703}
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !33, line: 69, baseType: !704)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !35, line: 148, baseType: !7)
!705 = distinct !DICompileUnit(language: DW_LANG_C99, file: !706, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !70)
!706 = !DIFile(filename: "./lib/fd-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!707 = distinct !DICompileUnit(language: DW_LANG_C99, file: !708, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !70)
!708 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!709 = distinct !DICompileUnit(language: DW_LANG_C99, file: !710, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !70, retainedTypes: !268)
!710 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!711 = distinct !DICompileUnit(language: DW_LANG_C99, file: !712, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !70, retainedTypes: !268)
!712 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!713 = distinct !DICompileUnit(language: DW_LANG_C99, file: !714, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !70)
!714 = !DIFile(filename: "./lib/dup-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!715 = !{!"clang version 7.0.0 (tags/RELEASE_700/final)"}
!716 = !{i32 2, !"Dwarf Version", i32 4}
!717 = !{i32 2, !"Debug Info Version", i32 3}
!718 = !{i32 1, !"wchar_size", i32 4}
!719 = !{i32 7, !"PIC Level", i32 2}
!720 = !{i32 7, !"PIE Level", i32 2}
!721 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 53, type: !722, isLocal: false, isDefinition: true, scopeLine: 54, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, retainedNodes: !724)
!722 = !DISubroutineType(types: !723)
!723 = !{null, !29}
!724 = !{!725}
!725 = !DILocalVariable(name: "status", arg: 1, scope: !721, file: !3, line: 53, type: !29)
!726 = !DILocalVariable(name: "infomap", scope: !727, file: !728, line: 632, type: !742)
!727 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !728, file: !728, line: 630, type: !729, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !731)
!728 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!729 = !DISubroutineType(types: !730)
!730 = !{null, !58}
!731 = !{!732, !726, !733, !734, !741}
!732 = !DILocalVariable(name: "program", arg: 1, scope: !727, file: !728, line: 630, type: !58)
!733 = !DILocalVariable(name: "node", scope: !727, file: !728, line: 642, type: !58)
!734 = !DILocalVariable(name: "map_prog", scope: !727, file: !728, line: 643, type: !735)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !737)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !727, file: !728, line: 632, size: 128, elements: !738)
!738 = !{!739, !740}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !737, file: !728, line: 632, baseType: !58, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !737, file: !728, line: 632, baseType: !58, size: 64, offset: 64)
!741 = !DILocalVariable(name: "lc_messages", scope: !727, file: !728, line: 655, type: !58)
!742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !736, size: 896, elements: !64)
!743 = !DILocation(line: 632, column: 67, scope: !727, inlinedAt: !744)
!744 = distinct !DILocation(line: 79, column: 7, scope: !745)
!745 = distinct !DILexicalBlock(scope: !746, file: !3, line: 58, column: 5)
!746 = distinct !DILexicalBlock(scope: !721, file: !3, line: 55, column: 7)
!747 = !DILocation(line: 53, column: 12, scope: !721)
!748 = !DILocation(line: 55, column: 14, scope: !746)
!749 = !DILocation(line: 55, column: 7, scope: !721)
!750 = !DILocation(line: 56, column: 5, scope: !751)
!751 = distinct !DILexicalBlock(scope: !746, file: !3, line: 56, column: 5)
!752 = !{!753, !753, i64 0}
!753 = !{!"any pointer", !754, i64 0}
!754 = !{!"omnipotent char", !755, i64 0}
!755 = !{!"Simple C/C++ TBAA"}
!756 = !DILocation(line: 59, column: 7, scope: !745)
!757 = !DILocation(line: 60, column: 7, scope: !745)
!758 = !DILocation(line: 587, column: 3, scope: !759, inlinedAt: !762)
!759 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !728, file: !728, line: 585, type: !760, isLocal: true, isDefinition: true, scopeLine: 586, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !70)
!760 = !DISubroutineType(types: !761)
!761 = !{null}
!762 = distinct !DILocation(line: 64, column: 7, scope: !745)
!763 = !DILocation(line: 66, column: 7, scope: !745)
!764 = !DILocation(line: 71, column: 7, scope: !745)
!765 = !DILocation(line: 77, column: 7, scope: !745)
!766 = !DILocation(line: 78, column: 7, scope: !745)
!767 = !DILocation(line: 632, column: 3, scope: !727, inlinedAt: !744)
!768 = !DILocation(line: 643, column: 36, scope: !727, inlinedAt: !744)
!769 = !DILocation(line: 643, column: 25, scope: !727, inlinedAt: !744)
!770 = !DILocation(line: 645, column: 33, scope: !727, inlinedAt: !744)
!771 = !DILocation(line: 645, column: 3, scope: !727, inlinedAt: !744)
!772 = !DILocation(line: 646, column: 13, scope: !727, inlinedAt: !744)
!773 = !DILocation(line: 645, column: 20, scope: !727, inlinedAt: !744)
!774 = !{!775, !753, i64 0}
!775 = !{!"infomap", !753, i64 0, !753, i64 8}
!776 = !DILocation(line: 645, column: 10, scope: !727, inlinedAt: !744)
!777 = !DILocation(line: 645, column: 28, scope: !727, inlinedAt: !744)
!778 = distinct !{!778, !779, !780}
!779 = !DILocation(line: 645, column: 3, scope: !727)
!780 = !DILocation(line: 646, column: 13, scope: !727)
!781 = !DILocation(line: 648, column: 17, scope: !782, inlinedAt: !744)
!782 = distinct !DILexicalBlock(scope: !727, file: !728, line: 648, column: 7)
!783 = !{!775, !753, i64 8}
!784 = !DILocation(line: 648, column: 7, scope: !782, inlinedAt: !744)
!785 = !DILocation(line: 648, column: 7, scope: !727, inlinedAt: !744)
!786 = !DILocation(line: 642, column: 15, scope: !727, inlinedAt: !744)
!787 = !DILocation(line: 651, column: 3, scope: !727, inlinedAt: !744)
!788 = !DILocation(line: 655, column: 29, scope: !727, inlinedAt: !744)
!789 = !DILocation(line: 655, column: 15, scope: !727, inlinedAt: !744)
!790 = !DILocation(line: 656, column: 7, scope: !791, inlinedAt: !744)
!791 = distinct !DILexicalBlock(scope: !727, file: !728, line: 656, column: 7)
!792 = !DILocation(line: 656, column: 19, scope: !791, inlinedAt: !744)
!793 = !DILocation(line: 656, column: 22, scope: !791, inlinedAt: !744)
!794 = !DILocation(line: 656, column: 7, scope: !727, inlinedAt: !744)
!795 = !DILocation(line: 662, column: 7, scope: !796, inlinedAt: !744)
!796 = distinct !DILexicalBlock(scope: !791, file: !728, line: 657, column: 5)
!797 = !DILocation(line: 664, column: 5, scope: !796, inlinedAt: !744)
!798 = !DILocation(line: 665, column: 3, scope: !727, inlinedAt: !744)
!799 = !DILocation(line: 667, column: 3, scope: !727, inlinedAt: !744)
!800 = !DILocation(line: 669, column: 1, scope: !727, inlinedAt: !744)
!801 = !DILocation(line: 81, column: 3, scope: !721)
!802 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 189, type: !803, isLocal: false, isDefinition: true, scopeLine: 190, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !806)
!803 = !DISubroutineType(types: !804)
!804 = !{!29, !29, !805}
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!806 = !{!807, !808, !809, !810, !811, !812, !824, !827, !830}
!807 = !DILocalVariable(name: "argc", arg: 1, scope: !802, file: !3, line: 189, type: !29)
!808 = !DILocalVariable(name: "argv", arg: 2, scope: !802, file: !3, line: 189, type: !805)
!809 = !DILocalVariable(name: "specified_mode", scope: !802, file: !3, line: 191, type: !58)
!810 = !DILocalVariable(name: "optc", scope: !802, file: !3, line: 192, type: !29)
!811 = !DILocalVariable(name: "scontext", scope: !802, file: !3, line: 193, type: !58)
!812 = !DILocalVariable(name: "options", scope: !802, file: !3, line: 194, type: !813)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mkdir_options", file: !3, line: 85, size: 256, elements: !814)
!814 = !{!815, !819, !820, !821, !822, !823}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "make_ancestor_function", scope: !813, file: !3, line: 89, baseType: !816, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DISubroutineType(types: !818)
!818 = !{!29, !58, !58, !46}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "umask_value", scope: !813, file: !3, line: 92, baseType: !703, size: 32, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !813, file: !3, line: 95, baseType: !703, size: 32, offset: 96)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "mode_bits", scope: !813, file: !3, line: 98, baseType: !703, size: 32, offset: 128)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "set_security_context", scope: !813, file: !3, line: 101, baseType: !80, size: 8, offset: 160)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "created_directory_format", scope: !813, file: !3, line: 104, baseType: !58, size: 64, offset: 192)
!824 = !DILocalVariable(name: "ret", scope: !825, file: !3, line: 261, type: !29)
!825 = distinct !DILexicalBlock(scope: !826, file: !3, line: 260, column: 5)
!826 = distinct !DILexicalBlock(scope: !802, file: !3, line: 259, column: 7)
!827 = !DILocalVariable(name: "umask_value", scope: !828, file: !3, line: 276, type: !703)
!828 = distinct !DILexicalBlock(scope: !829, file: !3, line: 275, column: 5)
!829 = distinct !DILexicalBlock(scope: !802, file: !3, line: 274, column: 7)
!830 = !DILocalVariable(name: "change", scope: !831, file: !3, line: 282, type: !833)
!831 = distinct !DILexicalBlock(scope: !832, file: !3, line: 281, column: 9)
!832 = distinct !DILexicalBlock(scope: !828, file: !3, line: 280, column: 11)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DICompositeType(tag: DW_TAG_structure_type, name: "mode_change", file: !835, line: 25, flags: DIFlagFwdDecl)
!835 = !DIFile(filename: "./lib/modechange.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!836 = !DILocation(line: 189, column: 11, scope: !802)
!837 = !DILocation(line: 189, column: 24, scope: !802)
!838 = !DILocation(line: 191, column: 15, scope: !802)
!839 = !DILocation(line: 193, column: 15, scope: !802)
!840 = !DILocation(line: 194, column: 3, scope: !802)
!841 = !DILocation(line: 196, column: 11, scope: !802)
!842 = !DILocation(line: 196, column: 34, scope: !802)
!843 = !{!844, !753, i64 0}
!844 = !{!"mkdir_options", !753, i64 0, !845, i64 8, !845, i64 12, !845, i64 16, !846, i64 20, !753, i64 24}
!845 = !{!"int", !754, i64 0}
!846 = !{!"_Bool", !754, i64 0}
!847 = !DILocation(line: 197, column: 11, scope: !802)
!848 = !DILocation(line: 197, column: 16, scope: !802)
!849 = !{!844, !845, i64 12}
!850 = !DILocation(line: 198, column: 11, scope: !802)
!851 = !DILocation(line: 198, column: 21, scope: !802)
!852 = !{!844, !845, i64 16}
!853 = !DILocation(line: 199, column: 11, scope: !802)
!854 = !DILocation(line: 199, column: 36, scope: !802)
!855 = !{!844, !753, i64 24}
!856 = !DILocation(line: 200, column: 11, scope: !802)
!857 = !DILocation(line: 200, column: 32, scope: !802)
!858 = !{!844, !846, i64 20}
!859 = !DILocation(line: 203, column: 21, scope: !802)
!860 = !DILocation(line: 203, column: 3, scope: !802)
!861 = !DILocation(line: 204, column: 3, scope: !802)
!862 = !DILocation(line: 205, column: 3, scope: !802)
!863 = !DILocation(line: 206, column: 3, scope: !802)
!864 = !DILocation(line: 208, column: 3, scope: !802)
!865 = !DILocation(line: 210, column: 3, scope: !802)
!866 = !DILocation(line: 210, column: 18, scope: !802)
!867 = !DILocation(line: 192, column: 7, scope: !802)
!868 = !DILocation(line: 215, column: 42, scope: !869)
!869 = distinct !DILexicalBlock(scope: !870, file: !3, line: 213, column: 9)
!870 = distinct !DILexicalBlock(scope: !802, file: !3, line: 211, column: 5)
!871 = !DILocation(line: 216, column: 11, scope: !869)
!872 = distinct !{!872, !865, !873}
!873 = !DILocation(line: 248, column: 5, scope: !802)
!874 = !DILocation(line: 218, column: 28, scope: !869)
!875 = !DILocation(line: 219, column: 11, scope: !869)
!876 = !DILocation(line: 221, column: 46, scope: !869)
!877 = !DILocation(line: 221, column: 44, scope: !869)
!878 = !DILocation(line: 222, column: 11, scope: !869)
!879 = !DILocation(line: 0, scope: !880)
!880 = distinct !DILexicalBlock(scope: !881, file: !3, line: 236, column: 20)
!881 = distinct !DILexicalBlock(scope: !882, file: !3, line: 229, column: 20)
!882 = distinct !DILexicalBlock(scope: !869, file: !3, line: 224, column: 15)
!883 = !DILocation(line: 236, column: 20, scope: !880)
!884 = !DILocation(line: 236, column: 20, scope: !881)
!885 = !DILocation(line: 239, column: 22, scope: !886)
!886 = distinct !DILexicalBlock(scope: !880, file: !3, line: 237, column: 13)
!887 = !DILocation(line: 238, column: 15, scope: !886)
!888 = !DILocation(line: 241, column: 13, scope: !886)
!889 = !DILocation(line: 243, column: 9, scope: !869)
!890 = !DILocation(line: 244, column: 9, scope: !869)
!891 = !DILocation(line: 246, column: 11, scope: !869)
!892 = !DILocation(line: 250, column: 7, scope: !893)
!893 = distinct !DILexicalBlock(scope: !802, file: !3, line: 250, column: 7)
!894 = !{!845, !845, i64 0}
!895 = !DILocation(line: 250, column: 14, scope: !893)
!896 = !DILocation(line: 250, column: 7, scope: !802)
!897 = !DILocation(line: 252, column: 20, scope: !898)
!898 = distinct !DILexicalBlock(scope: !893, file: !3, line: 251, column: 5)
!899 = !DILocation(line: 252, column: 7, scope: !898)
!900 = !DILocation(line: 253, column: 7, scope: !898)
!901 = !DILocation(line: 274, column: 7, scope: !829)
!902 = !DILocation(line: 274, column: 41, scope: !829)
!903 = !DILocation(line: 274, column: 38, scope: !829)
!904 = !DILocation(line: 276, column: 28, scope: !828)
!905 = !DILocation(line: 276, column: 14, scope: !828)
!906 = !DILocation(line: 277, column: 7, scope: !828)
!907 = !DILocation(line: 278, column: 15, scope: !828)
!908 = !DILocation(line: 278, column: 27, scope: !828)
!909 = !{!844, !845, i64 8}
!910 = !DILocation(line: 280, column: 11, scope: !828)
!911 = !DILocation(line: 282, column: 40, scope: !831)
!912 = !DILocation(line: 282, column: 31, scope: !831)
!913 = !DILocation(line: 283, column: 16, scope: !914)
!914 = distinct !DILexicalBlock(scope: !831, file: !3, line: 283, column: 15)
!915 = !DILocation(line: 283, column: 15, scope: !831)
!916 = !DILocation(line: 284, column: 13, scope: !914)
!917 = !DILocation(line: 286, column: 26, scope: !831)
!918 = !DILocation(line: 286, column: 24, scope: !831)
!919 = !DILocation(line: 288, column: 17, scope: !831)
!920 = !DILocation(line: 288, column: 11, scope: !831)
!921 = !DILocation(line: 289, column: 9, scope: !831)
!922 = !DILocation(line: 291, column: 22, scope: !832)
!923 = !DILocation(line: 294, column: 39, scope: !802)
!924 = !DILocation(line: 294, column: 37, scope: !802)
!925 = !DILocation(line: 294, column: 52, scope: !802)
!926 = !DILocation(line: 294, column: 10, scope: !802)
!927 = !DILocation(line: 296, column: 1, scope: !802)
!928 = !DILocation(line: 294, column: 3, scope: !802)
!929 = distinct !DISubprogram(name: "make_ancestor", scope: !3, file: !3, line: 122, type: !817, isLocal: true, isDefinition: true, scopeLine: 123, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !930)
!930 = !{!931, !932, !933, !934, !937, !938, !939, !940}
!931 = !DILocalVariable(name: "dir", arg: 1, scope: !929, file: !3, line: 122, type: !58)
!932 = !DILocalVariable(name: "component", arg: 2, scope: !929, file: !3, line: 122, type: !58)
!933 = !DILocalVariable(name: "options", arg: 3, scope: !929, file: !3, line: 122, type: !46)
!934 = !DILocalVariable(name: "o", scope: !929, file: !3, line: 124, type: !935)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !813)
!937 = !DILocalVariable(name: "user_wx", scope: !929, file: !3, line: 131, type: !703)
!938 = !DILocalVariable(name: "self_denying_umask", scope: !929, file: !3, line: 132, type: !80)
!939 = !DILocalVariable(name: "r", scope: !929, file: !3, line: 135, type: !29)
!940 = !DILocalVariable(name: "mkdir_errno", scope: !941, file: !3, line: 138, type: !29)
!941 = distinct !DILexicalBlock(scope: !942, file: !3, line: 137, column: 5)
!942 = distinct !DILexicalBlock(scope: !929, file: !3, line: 136, column: 7)
!943 = !DILocation(line: 122, column: 28, scope: !929)
!944 = !DILocation(line: 122, column: 45, scope: !929)
!945 = !DILocation(line: 122, column: 62, scope: !929)
!946 = !DILocation(line: 124, column: 31, scope: !929)
!947 = !DILocation(line: 126, column: 10, scope: !948)
!948 = distinct !DILexicalBlock(scope: !929, file: !3, line: 126, column: 7)
!949 = !{i8 0, i8 2}
!950 = !DILocation(line: 126, column: 31, scope: !948)
!951 = !DILocalVariable(name: "path", arg: 1, scope: !952, file: !953, line: 44, type: !58)
!952 = distinct !DISubprogram(name: "defaultcon", scope: !953, file: !953, line: 44, type: !954, isLocal: true, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !956)
!953 = !DIFile(filename: "src/selinux.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!954 = !DISubroutineType(types: !955)
!955 = !{!29, !58, !703}
!956 = !{!951, !957}
!957 = !DILocalVariable(name: "mode", arg: 2, scope: !952, file: !953, line: 44, type: !703)
!958 = !DILocation(line: 44, column: 25, scope: !952, inlinedAt: !959)
!959 = distinct !DILocation(line: 126, column: 34, scope: !948)
!960 = !DILocation(line: 44, column: 38, scope: !952, inlinedAt: !959)
!961 = !DILocation(line: 45, column: 3, scope: !952, inlinedAt: !959)
!962 = !DILocation(line: 45, column: 9, scope: !952, inlinedAt: !959)
!963 = !DILocation(line: 126, column: 7, scope: !929)
!964 = !DILocation(line: 131, column: 10, scope: !929)
!965 = !DILocation(line: 132, column: 33, scope: !929)
!966 = !DILocation(line: 132, column: 45, scope: !929)
!967 = !DILocation(line: 132, column: 56, scope: !929)
!968 = !DILocation(line: 133, column: 7, scope: !929)
!969 = !DILocation(line: 135, column: 11, scope: !929)
!970 = !DILocation(line: 135, column: 7, scope: !929)
!971 = !DILocation(line: 134, column: 27, scope: !972)
!972 = distinct !DILexicalBlock(scope: !929, file: !3, line: 133, column: 7)
!973 = !DILocation(line: 134, column: 5, scope: !972)
!974 = !DILocation(line: 138, column: 25, scope: !941)
!975 = !DILocation(line: 138, column: 11, scope: !941)
!976 = !DILocation(line: 139, column: 17, scope: !941)
!977 = !DILocation(line: 139, column: 7, scope: !941)
!978 = !DILocation(line: 140, column: 13, scope: !941)
!979 = !DILocation(line: 141, column: 5, scope: !941)
!980 = !DILocation(line: 142, column: 9, scope: !981)
!981 = distinct !DILexicalBlock(scope: !929, file: !3, line: 142, column: 7)
!982 = !DILocation(line: 142, column: 7, scope: !929)
!983 = !DILocation(line: 144, column: 15, scope: !984)
!984 = distinct !DILexicalBlock(scope: !981, file: !3, line: 143, column: 5)
!985 = !DILocation(line: 144, column: 38, scope: !984)
!986 = !DILocalVariable(name: "dir", arg: 1, scope: !987, file: !3, line: 109, type: !58)
!987 = distinct !DISubprogram(name: "announce_mkdir", scope: !3, file: !3, line: 109, type: !988, isLocal: true, isDefinition: true, scopeLine: 110, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !990)
!988 = !DISubroutineType(types: !989)
!989 = !{null, !58, !46}
!990 = !{!986, !991, !992}
!991 = !DILocalVariable(name: "options", arg: 2, scope: !987, file: !3, line: 109, type: !46)
!992 = !DILocalVariable(name: "o", scope: !987, file: !3, line: 111, type: !935)
!993 = !DILocation(line: 109, column: 29, scope: !987, inlinedAt: !994)
!994 = distinct !DILocation(line: 145, column: 7, scope: !984)
!995 = !DILocation(line: 109, column: 40, scope: !987, inlinedAt: !994)
!996 = !DILocation(line: 111, column: 31, scope: !987, inlinedAt: !994)
!997 = !DILocation(line: 112, column: 10, scope: !998, inlinedAt: !994)
!998 = distinct !DILexicalBlock(scope: !987, file: !3, line: 112, column: 7)
!999 = !DILocation(line: 112, column: 7, scope: !998, inlinedAt: !994)
!1000 = !DILocation(line: 112, column: 7, scope: !987, inlinedAt: !994)
!1001 = !DILocation(line: 113, column: 19, scope: !998, inlinedAt: !994)
!1002 = !DILocation(line: 113, column: 56, scope: !998, inlinedAt: !994)
!1003 = !DILocation(line: 113, column: 5, scope: !998, inlinedAt: !994)
!1004 = !DILocation(line: 0, scope: !929)
!1005 = !DILocation(line: 147, column: 3, scope: !929)
!1006 = distinct !DISubprogram(name: "process_dir", scope: !3, file: !3, line: 152, type: !1007, isLocal: true, isDefinition: true, scopeLine: 153, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1010)
!1007 = !DISubroutineType(types: !1008)
!1008 = !{!29, !44, !1009, !46}
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!1010 = !{!1011, !1012, !1013, !1014, !1015}
!1011 = !DILocalVariable(name: "dir", arg: 1, scope: !1006, file: !3, line: 152, type: !44)
!1012 = !DILocalVariable(name: "wd", arg: 2, scope: !1006, file: !3, line: 152, type: !1009)
!1013 = !DILocalVariable(name: "options", arg: 3, scope: !1006, file: !3, line: 152, type: !46)
!1014 = !DILocalVariable(name: "o", scope: !1006, file: !3, line: 154, type: !935)
!1015 = !DILocalVariable(name: "ret", scope: !1006, file: !3, line: 165, type: !29)
!1016 = !DILocation(line: 152, column: 20, scope: !1006)
!1017 = !DILocation(line: 152, column: 40, scope: !1006)
!1018 = !DILocation(line: 152, column: 50, scope: !1006)
!1019 = !DILocation(line: 157, column: 10, scope: !1020)
!1020 = distinct !DILexicalBlock(scope: !1006, file: !3, line: 157, column: 7)
!1021 = !DILocation(line: 0, scope: !1022)
!1022 = distinct !DILexicalBlock(scope: !1023, file: !3, line: 159, column: 11)
!1023 = distinct !DILexicalBlock(scope: !1020, file: !3, line: 158, column: 5)
!1024 = !DILocation(line: 159, column: 13, scope: !1022)
!1025 = !DILocation(line: 157, column: 7, scope: !1006)
!1026 = !DILocation(line: 154, column: 31, scope: !1006)
!1027 = !DILocation(line: 44, column: 25, scope: !952, inlinedAt: !1028)
!1028 = distinct !DILocation(line: 159, column: 42, scope: !1022)
!1029 = !DILocation(line: 44, column: 38, scope: !952, inlinedAt: !1028)
!1030 = !DILocation(line: 45, column: 3, scope: !952, inlinedAt: !1028)
!1031 = !DILocation(line: 45, column: 9, scope: !952, inlinedAt: !1028)
!1032 = !DILocation(line: 159, column: 11, scope: !1023)
!1033 = !DILocation(line: 165, column: 44, scope: !1006)
!1034 = !DILocation(line: 166, column: 35, scope: !1006)
!1035 = !DILocation(line: 167, column: 35, scope: !1006)
!1036 = !DILocation(line: 165, column: 14, scope: !1006)
!1037 = !DILocation(line: 165, column: 7, scope: !1006)
!1038 = !DILocation(line: 176, column: 27, scope: !1039)
!1039 = distinct !DILexicalBlock(scope: !1006, file: !3, line: 176, column: 7)
!1040 = !DILocation(line: 176, column: 33, scope: !1039)
!1041 = !DILocation(line: 177, column: 7, scope: !1039)
!1042 = !DILocation(line: 177, column: 13, scope: !1039)
!1043 = !DILocation(line: 177, column: 10, scope: !1039)
!1044 = !DILocation(line: 176, column: 7, scope: !1006)
!1045 = !DILocalVariable(name: "path", arg: 1, scope: !1046, file: !953, line: 40, type: !58)
!1046 = distinct !DISubprogram(name: "restorecon", scope: !953, file: !953, line: 40, type: !1047, isLocal: true, isDefinition: true, scopeLine: 41, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1049)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!80, !58, !80, !80}
!1049 = !{!1045, !1050, !1051}
!1050 = !DILocalVariable(name: "recurse", arg: 2, scope: !1046, file: !953, line: 40, type: !80)
!1051 = !DILocalVariable(name: "preserve", arg: 3, scope: !1046, file: !953, line: 40, type: !80)
!1052 = !DILocation(line: 40, column: 25, scope: !1046, inlinedAt: !1053)
!1053 = distinct !DILocation(line: 179, column: 13, scope: !1054)
!1054 = distinct !DILexicalBlock(scope: !1055, file: !3, line: 179, column: 11)
!1055 = distinct !DILexicalBlock(scope: !1039, file: !3, line: 178, column: 5)
!1056 = !DILocation(line: 40, column: 36, scope: !1046, inlinedAt: !1053)
!1057 = !DILocation(line: 40, column: 50, scope: !1046, inlinedAt: !1053)
!1058 = !DILocation(line: 41, column: 3, scope: !1046, inlinedAt: !1053)
!1059 = !DILocation(line: 41, column: 9, scope: !1046, inlinedAt: !1053)
!1060 = !DILocation(line: 179, column: 11, scope: !1055)
!1061 = !DILocation(line: 185, column: 3, scope: !1006)
!1062 = !DILocation(line: 109, column: 29, scope: !987)
!1063 = !DILocation(line: 109, column: 40, scope: !987)
!1064 = !DILocation(line: 111, column: 31, scope: !987)
!1065 = !DILocation(line: 112, column: 10, scope: !998)
!1066 = !DILocation(line: 112, column: 7, scope: !998)
!1067 = !DILocation(line: 112, column: 7, scope: !987)
!1068 = !DILocation(line: 113, column: 19, scope: !998)
!1069 = !DILocation(line: 113, column: 56, scope: !998)
!1070 = !DILocation(line: 113, column: 5, scope: !998)
!1071 = !DILocation(line: 114, column: 1, scope: !987)
!1072 = distinct !DISubprogram(name: "prog_fprintf", scope: !214, file: !214, line: 28, type: !1073, isLocal: false, isDefinition: true, scopeLine: 29, flags: DIFlagPrototyped, isOptimized: true, unit: !213, retainedNodes: !1127)
!1073 = !DISubroutineType(types: !1074)
!1074 = !{null, !1075, !58, null}
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64)
!1076 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !1077, line: 7, baseType: !1078)
!1077 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!1078 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !1079, line: 49, size: 1728, elements: !1080)
!1079 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!1080 = !{!1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1096, !1098, !1099, !1100, !1103, !1104, !1106, !1108, !1111, !1113, !1116, !1119, !1120, !1121, !1122, !1123}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1078, file: !1079, line: 51, baseType: !29, size: 32)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1078, file: !1079, line: 54, baseType: !44, size: 64, offset: 64)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1078, file: !1079, line: 55, baseType: !44, size: 64, offset: 128)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1078, file: !1079, line: 56, baseType: !44, size: 64, offset: 192)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1078, file: !1079, line: 57, baseType: !44, size: 64, offset: 256)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1078, file: !1079, line: 58, baseType: !44, size: 64, offset: 320)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1078, file: !1079, line: 59, baseType: !44, size: 64, offset: 384)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1078, file: !1079, line: 60, baseType: !44, size: 64, offset: 448)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1078, file: !1079, line: 61, baseType: !44, size: 64, offset: 512)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1078, file: !1079, line: 64, baseType: !44, size: 64, offset: 576)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1078, file: !1079, line: 65, baseType: !44, size: 64, offset: 640)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1078, file: !1079, line: 66, baseType: !44, size: 64, offset: 704)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1078, file: !1079, line: 68, baseType: !1094, size: 64, offset: 768)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64)
!1095 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !1079, line: 36, flags: DIFlagFwdDecl)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1078, file: !1079, line: 70, baseType: !1097, size: 64, offset: 832)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1078, file: !1079, line: 72, baseType: !29, size: 32, offset: 896)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1078, file: !1079, line: 73, baseType: !29, size: 32, offset: 928)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1078, file: !1079, line: 74, baseType: !1101, size: 64, offset: 960)
!1101 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !35, line: 150, baseType: !1102)
!1102 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1078, file: !1079, line: 77, baseType: !121, size: 16, offset: 1024)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1078, file: !1079, line: 78, baseType: !1105, size: 8, offset: 1040)
!1105 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1078, file: !1079, line: 79, baseType: !1107, size: 8, offset: 1048)
!1107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 8, elements: !199)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1078, file: !1079, line: 81, baseType: !1109, size: 64, offset: 1088)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64)
!1110 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !1079, line: 43, baseType: null)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1078, file: !1079, line: 89, baseType: !1112, size: 64, offset: 1152)
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !35, line: 151, baseType: !1102)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1078, file: !1079, line: 91, baseType: !1114, size: 64, offset: 1216)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64)
!1115 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !1079, line: 37, flags: DIFlagFwdDecl)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1078, file: !1079, line: 92, baseType: !1117, size: 64, offset: 1280)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64)
!1118 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !1079, line: 38, flags: DIFlagFwdDecl)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1078, file: !1079, line: 93, baseType: !1097, size: 64, offset: 1344)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1078, file: !1079, line: 94, baseType: !46, size: 64, offset: 1408)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1078, file: !1079, line: 95, baseType: !122, size: 64, offset: 1472)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1078, file: !1079, line: 96, baseType: !29, size: 32, offset: 1536)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1078, file: !1079, line: 98, baseType: !1124, size: 160, offset: 1568)
!1124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 160, elements: !1125)
!1125 = !{!1126}
!1126 = !DISubrange(count: 20)
!1127 = !{!1128, !1129, !1130}
!1128 = !DILocalVariable(name: "fp", arg: 1, scope: !1072, file: !214, line: 28, type: !1075)
!1129 = !DILocalVariable(name: "fmt", arg: 2, scope: !1072, file: !214, line: 28, type: !58)
!1130 = !DILocalVariable(name: "ap", scope: !1072, file: !214, line: 30, type: !1131)
!1131 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !1132, line: 52, baseType: !1133)
!1132 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!1133 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !190, line: 48, baseType: !1134)
!1134 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !214, line: 30, baseType: !1135)
!1135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1136, size: 192, elements: !199)
!1136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !214, line: 30, size: 192, elements: !1137)
!1137 = !{!1138, !1139, !1140, !1141}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !1136, file: !214, line: 30, baseType: !7, size: 32)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !1136, file: !214, line: 30, baseType: !7, size: 32, offset: 32)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !1136, file: !214, line: 30, baseType: !46, size: 64, offset: 64)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !1136, file: !214, line: 30, baseType: !46, size: 64, offset: 128)
!1142 = !DILocation(line: 28, column: 21, scope: !1072)
!1143 = !DILocation(line: 28, column: 37, scope: !1072)
!1144 = !DILocation(line: 30, column: 3, scope: !1072)
!1145 = !DILocation(line: 30, column: 11, scope: !1072)
!1146 = !DILocation(line: 31, column: 3, scope: !1072)
!1147 = !DILocation(line: 32, column: 3, scope: !1072)
!1148 = !DILocation(line: 33, column: 3, scope: !1072)
!1149 = !DILocalVariable(name: "__stream", arg: 1, scope: !1150, file: !1151, line: 127, type: !1154)
