; ModuleID = 'coreutils-8.32/src/mkfifo.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.mode_change = type { i8, i8, i32, i32, i32 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [31 x i8] c"Usage: %s [OPTION]... NAME...\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 38, type: !25, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !20, globals: !24, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/mkfifo.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!9 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!20 = !{!21, !23}
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!24 = !{!0}
!25 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 1280, elements: !38)
!26 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !28, line: 50, size: 256, elements: !29)
!28 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!29 = !{!30, !33, !35, !37}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !27, file: !28, line: 52, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !27, file: !28, line: 55, baseType: !34, size: 32, offset: 64)
!34 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !27, file: !28, line: 56, baseType: !36, size: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !27, file: !28, line: 57, baseType: !34, size: 32, offset: 192)
!38 = !{!39}
!39 = !DISubrange(count: 5)
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(name: "Version", scope: !42, file: !43, line: 2, type: !31, isLocal: false, isDefinition: true)
!42 = distinct !DICompileUnit(language: DW_LANG_C99, file: !43, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !44, globals: !45, splitDebugInlining: false, nameTableKind: None)
!43 = !DIFile(filename: "src/version.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!44 = !{}
!45 = !{!40}
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "file_name", scope: !48, file: !49, line: 46, type: !31, isLocal: true, isDefinition: true)
!48 = distinct !DICompileUnit(language: DW_LANG_C99, file: !49, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !44, globals: !50, splitDebugInlining: false, nameTableKind: None)
!49 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!50 = !{!46, !51}
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !48, file: !49, line: 56, type: !53, isLocal: true, isDefinition: true)
!53 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!54 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression())
!55 = distinct !DIGlobalVariable(name: "exit_failure", scope: !56, file: !57, line: 24, type: !59, isLocal: false, isDefinition: true)
!56 = distinct !DICompileUnit(language: DW_LANG_C99, file: !57, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !44, globals: !58, splitDebugInlining: false, nameTableKind: None)
!57 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!58 = !{!54}
!59 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !34)
!60 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression())
!61 = distinct !DIGlobalVariable(name: "program_name", scope: !62, file: !63, line: 33, type: !31, isLocal: false, isDefinition: true)
!62 = distinct !DICompileUnit(language: DW_LANG_C99, file: !63, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !44, retainedTypes: !64, globals: !65, splitDebugInlining: false, nameTableKind: None)
!63 = !DIFile(filename: "lib/progname.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!64 = !{!23, !21}
!65 = !{!60}
!66 = !DIGlobalVariableExpression(var: !67, expr: !DIExpression())
!67 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !68, file: !69, line: 85, type: !133, isLocal: false, isDefinition: true)
!68 = distinct !DICompileUnit(language: DW_LANG_C99, file: !69, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !70, retainedTypes: !91, globals: !96, splitDebugInlining: false, nameTableKind: None)
!69 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!70 = !{!5, !71, !76}
!71 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, baseType: !7, size: 32, elements: !72)
!72 = !{!73, !74, !75}
!73 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!74 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!75 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!76 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !77, line: 46, baseType: !7, size: 32, elements: !78)
!77 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!78 = !{!79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90}
!79 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!80 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!81 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!82 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!83 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!84 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!85 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!86 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!87 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!88 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!89 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!90 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!91 = !{!34, !92, !93, !21}
!92 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !94, line: 46, baseType: !95)
!94 = !DIFile(filename: "/usr/lib/clang/12.0.1/include/stddef.h", directory: "")
!95 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!96 = !{!66, !97, !103, !115, !117, !122, !129, !131}
!97 = !DIGlobalVariableExpression(var: !98, expr: !DIExpression())
!98 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !68, file: !69, line: 101, type: !99, isLocal: false, isDefinition: true)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 320, elements: !101)
!100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!101 = !{!102}
!102 = !DISubrange(count: 10)
!103 = !DIGlobalVariableExpression(var: !104, expr: !DIExpression())
!104 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !68, file: !69, line: 1052, type: !105, isLocal: false, isDefinition: true)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !69, line: 65, size: 448, elements: !106)
!106 = !{!107, !108, !109, !113, !114}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !105, file: !69, line: 68, baseType: !5, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !105, file: !69, line: 71, baseType: !34, size: 32, offset: 32)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !105, file: !69, line: 75, baseType: !110, size: 256, offset: 64)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 8)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !105, file: !69, line: 78, baseType: !31, size: 64, offset: 320)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !105, file: !69, line: 81, baseType: !31, size: 64, offset: 384)
!115 = !DIGlobalVariableExpression(var: !116, expr: !DIExpression())
!116 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !68, file: !69, line: 116, type: !105, isLocal: true, isDefinition: true)
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(name: "slot0", scope: !68, file: !69, line: 842, type: !119, isLocal: true, isDefinition: true)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2048, elements: !120)
!120 = !{!121}
!121 = !DISubrange(count: 256)
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(name: "slotvec", scope: !68, file: !69, line: 845, type: !124, isLocal: true, isDefinition: true)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !69, line: 834, size: 128, elements: !126)
!126 = !{!127, !128}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !125, file: !69, line: 836, baseType: !93, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !125, file: !69, line: 837, baseType: !21, size: 64, offset: 64)
!129 = !DIGlobalVariableExpression(var: !130, expr: !DIExpression())
!130 = distinct !DIGlobalVariable(name: "nslots", scope: !68, file: !69, line: 843, type: !34, isLocal: true, isDefinition: true)
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "slotvec0", scope: !68, file: !69, line: 844, type: !125, isLocal: true, isDefinition: true)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 704, elements: !135)
!134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!135 = !{!136}
!136 = !DISubrange(count: 11)
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !139, file: !140, line: 26, type: !142, isLocal: false, isDefinition: true)
!139 = distinct !DICompileUnit(language: DW_LANG_C99, file: !140, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !44, globals: !141, splitDebugInlining: false, nameTableKind: None)
!140 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!141 = !{!137}
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 376, elements: !143)
!143 = !{!144}
!144 = !DISubrange(count: 47)
!145 = distinct !DICompileUnit(language: DW_LANG_C99, file: !146, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !44, splitDebugInlining: false, nameTableKind: None)
!146 = !DIFile(filename: "src/selinux.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!147 = distinct !DICompileUnit(language: DW_LANG_C99, file: !148, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !149, retainedTypes: !156, splitDebugInlining: false, nameTableKind: None)
!148 = !DIFile(filename: "lib/modechange.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!149 = !{!150}
!150 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !148, line: 78, baseType: !7, size: 32, elements: !151)
!151 = !{!152, !153, !154, !155}
!152 = !DIEnumerator(name: "MODE_DONE", value: 0, isUnsigned: true)
!153 = !DIEnumerator(name: "MODE_ORDINARY_CHANGE", value: 1, isUnsigned: true)
!154 = !DIEnumerator(name: "MODE_X_IF_ANY_X", value: 2, isUnsigned: true)
!155 = !DIEnumerator(name: "MODE_COPY_EXISTING", value: 3, isUnsigned: true)
!156 = !{!93}
!157 = distinct !DICompileUnit(language: DW_LANG_C99, file: !158, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !159, retainedTypes: !163, splitDebugInlining: false, nameTableKind: None)
!158 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!159 = !{!160}
!160 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !158, line: 40, baseType: !7, size: 32, elements: !161)
!161 = !{!162}
!162 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!163 = !{!23}
!164 = distinct !DICompileUnit(language: DW_LANG_C99, file: !165, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !166, retainedTypes: !180, splitDebugInlining: false, nameTableKind: None)
!165 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!166 = !{!167}
!167 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !169, file: !168, line: 186, baseType: !7, size: 32, elements: !178)
!168 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!169 = distinct !DISubprogram(name: "x2nrealloc", scope: !168, file: !168, line: 174, type: !170, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !164, retainedNodes: !173)
!170 = !DISubroutineType(types: !171)
!171 = !{!23, !23, !172, !93}
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!173 = !{!174, !175, !176, !177}
!174 = !DILocalVariable(name: "p", arg: 1, scope: !169, file: !168, line: 174, type: !23)
!175 = !DILocalVariable(name: "pn", arg: 2, scope: !169, file: !168, line: 174, type: !172)
!176 = !DILocalVariable(name: "s", arg: 3, scope: !169, file: !168, line: 174, type: !93)
!177 = !DILocalVariable(name: "n", scope: !169, file: !168, line: 176, type: !93)
!178 = !{!179}
!179 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!180 = !{!93, !21, !23}
!181 = distinct !DICompileUnit(language: DW_LANG_C99, file: !182, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !44, splitDebugInlining: false, nameTableKind: None)
!182 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!183 = distinct !DICompileUnit(language: DW_LANG_C99, file: !184, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !44, retainedTypes: !163, splitDebugInlining: false, nameTableKind: None)
!184 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!185 = distinct !DICompileUnit(language: DW_LANG_C99, file: !186, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !44, retainedTypes: !156, splitDebugInlining: false, nameTableKind: None)
!186 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!187 = distinct !DICompileUnit(language: DW_LANG_C99, file: !188, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !44, splitDebugInlining: false, nameTableKind: None)
!188 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!189 = distinct !DICompileUnit(language: DW_LANG_C99, file: !190, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !44, splitDebugInlining: false, nameTableKind: None)
!190 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!191 = distinct !DICompileUnit(language: DW_LANG_C99, file: !192, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !193, retainedTypes: !163, splitDebugInlining: false, nameTableKind: None)
!192 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!193 = !{!194}
!194 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !195, line: 41, baseType: !7, size: 32, elements: !196)
!195 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!196 = !{!197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579}
!197 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!198 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!199 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!200 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!201 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!202 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!203 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!204 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!205 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!206 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!207 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!208 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!209 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!210 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!211 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!212 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!213 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!214 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!215 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!216 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!217 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!218 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!219 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!220 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!221 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!222 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!223 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!224 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!225 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!226 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!227 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!228 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!229 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!230 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!231 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!232 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!233 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!234 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!235 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!236 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!237 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!238 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!239 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!240 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!241 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!242 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!243 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!244 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!245 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!246 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!247 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!248 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!249 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!250 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!251 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!252 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!253 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!254 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!255 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!256 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!257 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!258 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!259 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!260 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!261 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!262 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!263 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!264 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!265 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!266 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!267 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!268 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!269 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!270 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!271 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!272 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!273 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!274 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!275 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!276 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!277 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!278 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!279 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!280 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!281 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!282 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!283 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!284 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!285 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!286 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!287 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!288 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!289 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!290 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!291 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!292 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!293 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!294 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!295 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!296 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!297 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!298 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!299 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!300 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!301 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!302 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!303 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!304 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!305 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!306 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!307 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!308 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!309 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!310 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!311 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!312 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!313 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!314 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!315 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!316 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!317 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!318 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!319 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!320 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!321 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!322 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!323 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!324 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!325 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!326 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!327 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!328 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!329 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!330 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!331 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!332 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!333 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!334 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!335 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!336 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!337 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!338 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!339 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!340 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!341 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!342 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!343 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!344 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!345 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!346 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!347 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!348 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!349 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!350 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!351 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!352 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!353 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!354 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!355 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!356 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!357 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!358 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!359 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!360 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!361 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!362 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!363 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!364 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!365 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!366 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!367 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!368 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!369 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!370 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!371 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!372 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!373 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!374 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!375 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!376 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!377 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!378 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!379 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!380 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!381 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!382 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!383 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!384 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!385 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!386 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!387 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!388 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!389 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!390 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!391 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!392 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!393 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!394 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!395 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!396 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!397 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!398 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!399 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!400 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!401 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!402 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!403 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!404 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!405 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!406 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!407 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!408 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!409 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!410 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!411 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!412 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!413 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!414 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!415 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!416 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!417 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!418 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!419 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!420 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!421 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!422 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!423 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!424 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!425 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!426 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!427 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!428 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!429 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!430 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!431 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!432 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!433 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!434 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!435 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!436 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!437 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!438 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!439 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!440 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!441 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!442 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!443 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!444 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!445 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!446 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!447 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!448 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!449 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!450 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!451 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!452 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!453 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!454 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!455 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!456 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!457 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!458 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!459 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!460 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!461 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!462 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!463 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!464 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!465 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!466 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!467 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!468 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!469 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!470 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!471 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!472 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!473 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!474 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!475 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!476 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!477 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!478 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!479 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!480 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!481 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!482 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!483 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!484 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!485 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!486 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!487 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!488 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!489 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!490 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!491 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!492 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!493 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!494 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!495 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!496 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!497 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!498 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!499 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!500 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!501 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!502 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!503 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!504 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!505 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!506 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!507 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!508 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!509 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!510 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!511 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!512 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!513 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!514 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!515 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!516 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!517 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!518 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!519 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!520 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!521 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!522 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!523 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!524 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!525 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!526 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!527 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!528 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!529 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!530 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!531 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!532 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!533 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!534 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!535 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!536 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!537 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!538 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!539 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!540 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!541 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!542 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!543 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!544 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!545 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!546 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!547 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!548 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!549 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!550 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!551 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!552 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!553 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!554 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!555 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!556 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!557 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!558 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!559 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!560 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!561 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!562 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!563 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!564 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!565 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!566 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!567 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!568 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!569 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!570 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!571 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!572 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!573 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!574 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!575 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!576 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!577 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!578 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!579 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!580 = distinct !DICompileUnit(language: DW_LANG_C99, file: !581, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !44, retainedTypes: !163, splitDebugInlining: false, nameTableKind: None)
!581 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!582 = distinct !DICompileUnit(language: DW_LANG_C99, file: !583, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !44, splitDebugInlining: false, nameTableKind: None)
!583 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!584 = distinct !DICompileUnit(language: DW_LANG_C99, file: !585, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !44, retainedTypes: !163, splitDebugInlining: false, nameTableKind: None)
!585 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!586 = distinct !DICompileUnit(language: DW_LANG_C99, file: !587, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !44, retainedTypes: !163, splitDebugInlining: false, nameTableKind: None)
!587 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!588 = !{!"clang version 12.0.1"}
!589 = !{i32 7, !"Dwarf Version", i32 4}
!590 = !{i32 2, !"Debug Info Version", i32 3}
!591 = !{i32 1, !"wchar_size", i32 4}
!592 = !{i32 7, !"PIC Level", i32 2}
!593 = !{i32 7, !"PIE Level", i32 2}
!594 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 48, type: !595, scopeLine: 49, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !597)
!595 = !DISubroutineType(types: !596)
!596 = !{null, !34}
!597 = !{!598}
!598 = !DILocalVariable(name: "status", arg: 1, scope: !594, file: !3, line: 48, type: !34)
!599 = !DILocation(line: 0, scope: !594)
!600 = !DILocation(line: 50, column: 14, scope: !601)
!601 = distinct !DILexicalBlock(scope: !594, file: !3, line: 50, column: 7)
!602 = !DILocation(line: 50, column: 7, scope: !594)
!603 = !DILocation(line: 51, column: 5, scope: !604)
!604 = distinct !DILexicalBlock(scope: !601, file: !3, line: 51, column: 5)
!605 = !{!606, !606, i64 0}
!606 = !{!"any pointer", !607, i64 0}
!607 = !{!"omnipotent char", !608, i64 0}
!608 = !{!"Simple C/C++ TBAA"}
!609 = !DILocation(line: 54, column: 7, scope: !610)
!610 = distinct !DILexicalBlock(scope: !601, file: !3, line: 53, column: 5)
!611 = !DILocation(line: 55, column: 7, scope: !610)
!612 = !DILocation(line: 590, column: 3, scope: !613, inlinedAt: !617)
!613 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !614, file: !614, line: 588, type: !615, scopeLine: 589, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !44)
!614 = !DIFile(filename: "src/system.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!615 = !DISubroutineType(types: !616)
!616 = !{null}
!617 = distinct !DILocation(line: 59, column: 7, scope: !610)
!618 = !DILocation(line: 61, column: 7, scope: !610)
!619 = !DILocation(line: 64, column: 7, scope: !610)
!620 = !DILocation(line: 69, column: 7, scope: !610)
!621 = !DILocation(line: 70, column: 7, scope: !610)
!622 = !DILocalVariable(name: "program", arg: 1, scope: !623, file: !614, line: 634, type: !31)
!623 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !614, file: !614, line: 634, type: !624, scopeLine: 635, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !626)
!624 = !DISubroutineType(types: !625)
!625 = !{null, !31}
!626 = !{!622, !627, !636, !637, !639}
!627 = !DILocalVariable(name: "infomap", scope: !623, file: !614, line: 636, type: !628)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !629, size: 896, elements: !634)
!629 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !630)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !623, file: !614, line: 636, size: 128, elements: !631)
!631 = !{!632, !633}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !630, file: !614, line: 636, baseType: !31, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !630, file: !614, line: 636, baseType: !31, size: 64, offset: 64)
!634 = !{!635}
!635 = !DISubrange(count: 7)
!636 = !DILocalVariable(name: "node", scope: !623, file: !614, line: 646, type: !31)
!637 = !DILocalVariable(name: "map_prog", scope: !623, file: !614, line: 647, type: !638)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!639 = !DILocalVariable(name: "lc_messages", scope: !623, file: !614, line: 659, type: !31)
!640 = !DILocation(line: 0, scope: !623, inlinedAt: !641)
!641 = distinct !DILocation(line: 71, column: 7, scope: !610)
!642 = !DILocation(line: 636, column: 3, scope: !623, inlinedAt: !641)
!643 = !DILocation(line: 636, column: 67, scope: !623, inlinedAt: !641)
!644 = !DILocation(line: 647, column: 36, scope: !623, inlinedAt: !641)
!645 = !DILocation(line: 649, column: 3, scope: !623, inlinedAt: !641)
!646 = !DILocation(line: 649, column: 33, scope: !623, inlinedAt: !641)
!647 = !DILocation(line: 650, column: 13, scope: !623, inlinedAt: !641)
!648 = !DILocation(line: 649, column: 20, scope: !623, inlinedAt: !641)
!649 = !{!650, !606, i64 0}
!650 = !{!"infomap", !606, i64 0, !606, i64 8}
!651 = !DILocation(line: 649, column: 10, scope: !623, inlinedAt: !641)
!652 = !DILocation(line: 649, column: 28, scope: !623, inlinedAt: !641)
!653 = distinct !{!653, !645, !647, !654}
!654 = !{!"llvm.loop.mustprogress"}
!655 = !DILocation(line: 652, column: 17, scope: !656, inlinedAt: !641)
!656 = distinct !DILexicalBlock(scope: !623, file: !614, line: 652, column: 7)
!657 = !{!650, !606, i64 8}
!658 = !DILocation(line: 652, column: 7, scope: !656, inlinedAt: !641)
!659 = !DILocation(line: 652, column: 7, scope: !623, inlinedAt: !641)
!660 = !DILocation(line: 655, column: 3, scope: !623, inlinedAt: !641)
!661 = !DILocation(line: 659, column: 29, scope: !623, inlinedAt: !641)
!662 = !DILocation(line: 660, column: 7, scope: !663, inlinedAt: !641)
!663 = distinct !DILexicalBlock(scope: !623, file: !614, line: 660, column: 7)
!664 = !DILocation(line: 660, column: 19, scope: !663, inlinedAt: !641)
!665 = !DILocation(line: 660, column: 22, scope: !663, inlinedAt: !641)
!666 = !DILocation(line: 660, column: 7, scope: !623, inlinedAt: !641)
!667 = !DILocation(line: 666, column: 7, scope: !668, inlinedAt: !641)
!668 = distinct !DILexicalBlock(scope: !663, file: !614, line: 661, column: 5)
!669 = !DILocation(line: 668, column: 5, scope: !668, inlinedAt: !641)
!670 = !DILocation(line: 669, column: 3, scope: !623, inlinedAt: !641)
!671 = !DILocation(line: 671, column: 3, scope: !623, inlinedAt: !641)
!672 = !DILocation(line: 673, column: 1, scope: !623, inlinedAt: !641)
!673 = !DILocation(line: 73, column: 3, scope: !594)
!674 = !DISubprogram(name: "dcgettext", scope: !675, file: !675, line: 51, type: !676, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!675 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!676 = !DISubroutineType(types: !677)
!677 = !{!21, !31, !31, !34}
!678 = !DISubprogram(name: "fputs_unlocked", scope: !679, file: !679, line: 667, type: !680, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!679 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!680 = !DISubroutineType(types: !681)
!681 = !{!34, !31, !682}
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !684, line: 49, size: 1728, elements: !685)
!684 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!685 = !{!686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !701, !702, !703, !704, !708, !709, !711, !715, !718, !720, !723, !726, !727, !728, !729, !730}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !683, file: !684, line: 51, baseType: !34, size: 32)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !683, file: !684, line: 54, baseType: !21, size: 64, offset: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !683, file: !684, line: 55, baseType: !21, size: 64, offset: 128)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !683, file: !684, line: 56, baseType: !21, size: 64, offset: 192)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !683, file: !684, line: 57, baseType: !21, size: 64, offset: 256)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !683, file: !684, line: 58, baseType: !21, size: 64, offset: 320)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !683, file: !684, line: 59, baseType: !21, size: 64, offset: 384)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !683, file: !684, line: 60, baseType: !21, size: 64, offset: 448)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !683, file: !684, line: 61, baseType: !21, size: 64, offset: 512)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !683, file: !684, line: 64, baseType: !21, size: 64, offset: 576)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !683, file: !684, line: 65, baseType: !21, size: 64, offset: 640)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !683, file: !684, line: 66, baseType: !21, size: 64, offset: 704)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !683, file: !684, line: 68, baseType: !699, size: 64, offset: 768)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !684, line: 36, flags: DIFlagFwdDecl)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !683, file: !684, line: 70, baseType: !682, size: 64, offset: 832)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !683, file: !684, line: 72, baseType: !34, size: 32, offset: 896)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !683, file: !684, line: 73, baseType: !34, size: 32, offset: 928)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !683, file: !684, line: 74, baseType: !705, size: 64, offset: 960)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !706, line: 152, baseType: !707)
!706 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!707 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !683, file: !684, line: 77, baseType: !92, size: 16, offset: 1024)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !683, file: !684, line: 78, baseType: !710, size: 8, offset: 1040)
!710 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !683, file: !684, line: 79, baseType: !712, size: 8, offset: 1048)
!712 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 8, elements: !713)
!713 = !{!714}
!714 = !DISubrange(count: 1)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !683, file: !684, line: 81, baseType: !716, size: 64, offset: 1088)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !684, line: 43, baseType: null)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !683, file: !684, line: 89, baseType: !719, size: 64, offset: 1152)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !706, line: 153, baseType: !707)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !683, file: !684, line: 91, baseType: !721, size: 64, offset: 1216)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !684, line: 37, flags: DIFlagFwdDecl)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !683, file: !684, line: 92, baseType: !724, size: 64, offset: 1280)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !684, line: 38, flags: DIFlagFwdDecl)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !683, file: !684, line: 93, baseType: !682, size: 64, offset: 1344)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !683, file: !684, line: 94, baseType: !23, size: 64, offset: 1408)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !683, file: !684, line: 95, baseType: !93, size: 64, offset: 1472)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !683, file: !684, line: 96, baseType: !34, size: 32, offset: 1536)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !683, file: !684, line: 98, baseType: !731, size: 160, offset: 1568)
!731 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 160, elements: !732)
!732 = !{!733}
!733 = !DISubrange(count: 20)
!734 = !DISubprogram(name: "setlocale", scope: !735, file: !735, line: 122, type: !736, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!735 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!736 = !DISubroutineType(types: !737)
!737 = !{!21, !34, !31}
!738 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 77, type: !739, scopeLine: 78, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !742)
!739 = !DISubroutineType(types: !740)
!740 = !{!34, !34, !741}
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!742 = !{!743, !744, !745, !749, !750, !751, !752, !753, !754, !757, !760}
!743 = !DILocalVariable(name: "argc", arg: 1, scope: !738, file: !3, line: 77, type: !34)
!744 = !DILocalVariable(name: "argv", arg: 2, scope: !738, file: !3, line: 77, type: !741)
!745 = !DILocalVariable(name: "newmode", scope: !738, file: !3, line: 79, type: !746)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !747, line: 69, baseType: !748)
!747 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !706, line: 150, baseType: !7)
!749 = !DILocalVariable(name: "specified_mode", scope: !738, file: !3, line: 80, type: !31)
!750 = !DILocalVariable(name: "exit_status", scope: !738, file: !3, line: 81, type: !34)
!751 = !DILocalVariable(name: "optc", scope: !738, file: !3, line: 82, type: !34)
!752 = !DILocalVariable(name: "scontext", scope: !738, file: !3, line: 83, type: !31)
!753 = !DILocalVariable(name: "set_security_context", scope: !738, file: !3, line: 84, type: !53)
!754 = !DILocalVariable(name: "ret", scope: !755, file: !3, line: 136, type: !34)
!755 = distinct !DILexicalBlock(scope: !756, file: !3, line: 135, column: 5)
!756 = distinct !DILexicalBlock(scope: !738, file: !3, line: 134, column: 7)
!757 = !DILocalVariable(name: "umask_value", scope: !758, file: !3, line: 151, type: !746)
!758 = distinct !DILexicalBlock(scope: !759, file: !3, line: 150, column: 5)
!759 = distinct !DILexicalBlock(scope: !738, file: !3, line: 149, column: 7)
!760 = !DILocalVariable(name: "change", scope: !758, file: !3, line: 152, type: !761)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DICompositeType(tag: DW_TAG_structure_type, name: "mode_change", file: !763, line: 25, flags: DIFlagFwdDecl)
!763 = !DIFile(filename: "./lib/modechange.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!764 = !DILocation(line: 0, scope: !738)
!765 = !DILocation(line: 87, column: 21, scope: !738)
!766 = !DILocation(line: 87, column: 3, scope: !738)
!767 = !DILocation(line: 88, column: 3, scope: !738)
!768 = !DILocation(line: 89, column: 3, scope: !738)
!769 = !DILocation(line: 90, column: 3, scope: !738)
!770 = !DILocation(line: 92, column: 3, scope: !738)
!771 = !DILocation(line: 94, column: 3, scope: !738)
!772 = !DILocation(line: 94, column: 18, scope: !738)
!773 = !DILocation(line: 99, column: 28, scope: !774)
!774 = distinct !DILexicalBlock(scope: !775, file: !3, line: 97, column: 9)
!775 = distinct !DILexicalBlock(scope: !738, file: !3, line: 95, column: 5)
!776 = !DILocation(line: 100, column: 11, scope: !774)
!777 = distinct !{!777, !771, !778, !654}
!778 = !DILocation(line: 126, column: 5, scope: !738)
!779 = !DILocation(line: 114, column: 20, scope: !780)
!780 = distinct !DILexicalBlock(scope: !781, file: !3, line: 114, column: 20)
!781 = distinct !DILexicalBlock(scope: !782, file: !3, line: 107, column: 20)
!782 = distinct !DILexicalBlock(scope: !774, file: !3, line: 102, column: 15)
!783 = !DILocation(line: 114, column: 20, scope: !781)
!784 = !DILocation(line: 117, column: 22, scope: !785)
!785 = distinct !DILexicalBlock(scope: !780, file: !3, line: 115, column: 13)
!786 = !DILocation(line: 116, column: 15, scope: !785)
!787 = !DILocation(line: 119, column: 13, scope: !785)
!788 = !DILocation(line: 121, column: 9, scope: !774)
!789 = !DILocation(line: 122, column: 9, scope: !774)
!790 = !DILocation(line: 124, column: 11, scope: !774)
!791 = !DILocation(line: 128, column: 7, scope: !792)
!792 = distinct !DILexicalBlock(scope: !738, file: !3, line: 128, column: 7)
!793 = !{!794, !794, i64 0}
!794 = !{!"int", !607, i64 0}
!795 = !DILocation(line: 128, column: 14, scope: !792)
!796 = !DILocation(line: 128, column: 7, scope: !738)
!797 = !DILocation(line: 130, column: 20, scope: !798)
!798 = distinct !DILexicalBlock(scope: !792, file: !3, line: 129, column: 5)
!799 = !DILocation(line: 130, column: 7, scope: !798)
!800 = !DILocation(line: 131, column: 7, scope: !798)
!801 = !DILocation(line: 149, column: 7, scope: !759)
!802 = !DILocation(line: 149, column: 7, scope: !738)
!803 = !DILocation(line: 152, column: 36, scope: !758)
!804 = !DILocation(line: 0, scope: !758)
!805 = !DILocation(line: 153, column: 12, scope: !806)
!806 = distinct !DILexicalBlock(scope: !758, file: !3, line: 153, column: 11)
!807 = !DILocation(line: 153, column: 11, scope: !758)
!808 = !DILocation(line: 154, column: 9, scope: !806)
!809 = !DILocation(line: 155, column: 21, scope: !758)
!810 = !DILocation(line: 156, column: 7, scope: !758)
!811 = !DILocation(line: 157, column: 17, scope: !758)
!812 = !DILocation(line: 158, column: 13, scope: !758)
!813 = !DILocation(line: 158, column: 7, scope: !758)
!814 = !DILocation(line: 159, column: 19, scope: !815)
!815 = distinct !DILexicalBlock(scope: !758, file: !3, line: 159, column: 11)
!816 = !DILocation(line: 159, column: 11, scope: !758)
!817 = !DILocation(line: 164, column: 10, scope: !818)
!818 = distinct !DILexicalBlock(scope: !819, file: !3, line: 164, column: 3)
!819 = distinct !DILexicalBlock(scope: !738, file: !3, line: 164, column: 3)
!820 = !DILocation(line: 160, column: 9, scope: !815)
!821 = !DILocation(line: 164, column: 17, scope: !818)
!822 = !DILocation(line: 164, column: 3, scope: !819)
!823 = !DILocation(line: 168, column: 19, scope: !824)
!824 = distinct !DILexicalBlock(scope: !825, file: !3, line: 168, column: 11)
!825 = distinct !DILexicalBlock(scope: !818, file: !3, line: 165, column: 5)
!826 = !DILocation(line: 168, column: 11, scope: !824)
!827 = !DILocation(line: 168, column: 42, scope: !824)
!828 = !DILocation(line: 168, column: 11, scope: !825)
!829 = !DILocation(line: 170, column: 21, scope: !830)
!830 = distinct !DILexicalBlock(scope: !824, file: !3, line: 169, column: 9)
!831 = !DILocation(line: 170, column: 28, scope: !830)
!832 = !DILocation(line: 170, column: 56, scope: !830)
!833 = !DILocation(line: 170, column: 11, scope: !830)
!834 = !DILocation(line: 172, column: 9, scope: !830)
!835 = !DILocation(line: 173, column: 31, scope: !836)
!836 = distinct !DILexicalBlock(scope: !824, file: !3, line: 173, column: 16)
!837 = !DILocation(line: 173, column: 47, scope: !836)
!838 = !DILocation(line: 173, column: 42, scope: !836)
!839 = !DILocation(line: 173, column: 34, scope: !836)
!840 = !DILocation(line: 173, column: 65, scope: !836)
!841 = !DILocation(line: 173, column: 16, scope: !824)
!842 = !DILocation(line: 175, column: 21, scope: !843)
!843 = distinct !DILexicalBlock(scope: !836, file: !3, line: 174, column: 9)
!844 = !DILocation(line: 175, column: 28, scope: !843)
!845 = !DILocation(line: 176, column: 18, scope: !843)
!846 = !DILocation(line: 175, column: 11, scope: !843)
!847 = !DILocation(line: 178, column: 9, scope: !843)
!848 = !DILocation(line: 164, column: 25, scope: !818)
!849 = distinct !{!849, !822, !850, !654}
!850 = !DILocation(line: 179, column: 5, scope: !819)
!851 = !DILocation(line: 181, column: 3, scope: !738)
!852 = !DISubprogram(name: "bindtextdomain", scope: !675, file: !675, line: 86, type: !853, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!853 = !DISubroutineType(types: !854)
!854 = !{!21, !31, !31}
!855 = !DISubprogram(name: "textdomain", scope: !675, file: !675, line: 82, type: !856, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!856 = !DISubroutineType(types: !857)
!857 = !{!21, !31}
!858 = !DISubprogram(name: "atexit", scope: !859, file: !859, line: 595, type: !860, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!859 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!860 = !DISubroutineType(types: !861)
!861 = !{!34, !862}
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!863 = !DISubprogram(name: "getopt_long", scope: !28, file: !28, line: 66, type: !864, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!864 = !DISubroutineType(types: !865)
!865 = !{!34, !34, !866, !31, !868, !36}
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!869 = !DISubprogram(name: "error", scope: !870, file: !870, line: 52, type: !871, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!870 = !DIFile(filename: "./lib/error.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!871 = !DISubroutineType(types: !872)
!872 = !{null, !34, !34, !31, null}
!873 = !DISubprogram(name: "umask", scope: !874, file: !874, line: 308, type: !875, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!874 = !DIFile(filename: "/usr/include/sys/stat.h", directory: "")
!875 = !DISubroutineType(types: !876)
!876 = !{!7, !7}
!877 = !DISubprogram(name: "mkfifo", scope: !874, file: !874, line: 346, type: !878, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!878 = !DISubroutineType(types: !879)
!879 = !{!34, !31, !7}
!880 = !DISubprogram(name: "lchmod", scope: !874, file: !874, line: 287, type: !878, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !44)
!881 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !49, file: !49, line: 51, type: !624, scopeLine: 52, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !48, retainedNodes: !882)
!882 = !{!883}
!883 = !DILocalVariable(name: "file", arg: 1, scope: !881, file: !49, line: 51, type: !31)
!884 = !DILocation(line: 0, scope: !881)
!885 = !DILocation(line: 53, column: 13, scope: !881)
!886 = !DILocation(line: 54, column: 1, scope: !881)
!887 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !49, file: !49, line: 88, type: !888, scopeLine: 89, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !48, retainedNodes: !890)
!888 = !DISubroutineType(types: !889)
!889 = !{null, !53}
!890 = !{!891}
!891 = !DILocalVariable(name: "ignore", arg: 1, scope: !887, file: !49, line: 88, type: !53)
!892 = !DILocation(line: 0, scope: !887)
!893 = !DILocation(line: 90, column: 16, scope: !887)
!894 = !{!895, !895, i64 0}
!895 = !{!"_Bool", !607, i64 0}
!896 = !DILocation(line: 91, column: 1, scope: !887)
!897 = distinct !DISubprogram(name: "close_stdout", scope: !49, file: !49, line: 117, type: !615, scopeLine: 118, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !48, retainedNodes: !898)
!898 = !{!899}
!899 = !DILocalVariable(name: "write_error", scope: !900, file: !49, line: 122, type: !31)
!900 = distinct !DILexicalBlock(scope: !901, file: !49, line: 121, column: 5)
!901 = distinct !DILexicalBlock(scope: !897, file: !49, line: 119, column: 7)
!902 = !DILocation(line: 119, column: 21, scope: !901)
!903 = !DILocation(line: 119, column: 7, scope: !901)
!904 = !DILocation(line: 119, column: 29, scope: !901)
!905 = !DILocation(line: 120, column: 7, scope: !901)
!906 = !DILocation(line: 120, column: 12, scope: !901)
!907 = !{i8 0, i8 2}
!908 = !DILocation(line: 120, column: 25, scope: !901)
!909 = !DILocation(line: 120, column: 28, scope: !901)
!910 = !DILocation(line: 120, column: 34, scope: !901)
!911 = !DILocation(line: 119, column: 7, scope: !897)
!912 = !DILocation(line: 122, column: 33, scope: !900)
!913 = !DILocation(line: 0, scope: !900)
!914 = !DILocation(line: 123, column: 11, scope: !915)
!915 = distinct !DILexicalBlock(scope: !900, file: !49, line: 123, column: 11)
!916 = !DILocation(line: 0, scope: !915)
!917 = !DILocation(line: 123, column: 11, scope: !900)
!918 = !DILocation(line: 124, column: 36, scope: !915)
!919 = !DILocation(line: 124, column: 9, scope: !915)
!920 = !DILocation(line: 127, column: 9, scope: !915)
!921 = !DILocation(line: 129, column: 14, scope: !900)
!922 = !DILocation(line: 129, column: 7, scope: !900)
!923 = !DILocation(line: 134, column: 42, scope: !924)
!924 = distinct !DILexicalBlock(scope: !897, file: !49, line: 134, column: 7)
!925 = !DILocation(line: 134, column: 28, scope: !924)
!926 = !DILocation(line: 134, column: 50, scope: !924)
!927 = !DILocation(line: 134, column: 7, scope: !897)
!928 = !DILocation(line: 135, column: 12, scope: !924)
!929 = !DILocation(line: 135, column: 5, scope: !924)
!930 = !DILocation(line: 136, column: 1, scope: !897)
!931 = distinct !DISubprogram(name: "mode_compile", scope: !148, file: !148, line: 134, type: !932, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !147, retainedNodes: !942)
!932 = !DISubroutineType(types: !933)
!933 = !{!934, !31}
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mode_change", file: !148, line: 98, size: 128, elements: !936)
!936 = !{!937, !938, !939, !940, !941}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !935, file: !148, line: 100, baseType: !22, size: 8)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !935, file: !148, line: 101, baseType: !22, size: 8, offset: 8)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "affected", scope: !935, file: !148, line: 102, baseType: !746, size: 32, offset: 32)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !935, file: !148, line: 103, baseType: !746, size: 32, offset: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "mentioned", scope: !935, file: !148, line: 104, baseType: !746, size: 32, offset: 96)
!942 = !{!943, !944, !945, !946, !947, !950, !951, !952, !954, !958, !960, !961, !962, !963, !964, !967, !968, !969}
!943 = !DILocalVariable(name: "mode_string", arg: 1, scope: !931, file: !148, line: 134, type: !31)
!944 = !DILocalVariable(name: "mc", scope: !931, file: !148, line: 137, type: !934)
!945 = !DILocalVariable(name: "used", scope: !931, file: !148, line: 138, type: !93)
!946 = !DILocalVariable(name: "p", scope: !931, file: !148, line: 139, type: !31)
!947 = !DILocalVariable(name: "octal_mode", scope: !948, file: !148, line: 143, type: !7)
!948 = distinct !DILexicalBlock(scope: !949, file: !148, line: 142, column: 5)
!949 = distinct !DILexicalBlock(scope: !931, file: !148, line: 141, column: 7)
!950 = !DILocalVariable(name: "mode", scope: !948, file: !148, line: 144, type: !746)
!951 = !DILocalVariable(name: "mentioned", scope: !948, file: !148, line: 145, type: !746)
!952 = !DILocalVariable(name: "needed", scope: !953, file: !148, line: 168, type: !93)
!953 = distinct !DILexicalBlock(scope: !931, file: !148, line: 167, column: 3)
!954 = !DILocalVariable(name: "affected", scope: !955, file: !148, line: 179, type: !746)
!955 = distinct !DILexicalBlock(scope: !956, file: !148, line: 177, column: 5)
!956 = distinct !DILexicalBlock(scope: !957, file: !148, line: 176, column: 3)
!957 = distinct !DILexicalBlock(scope: !931, file: !148, line: 176, column: 3)
!958 = !DILocalVariable(name: "op", scope: !959, file: !148, line: 206, type: !22)
!959 = distinct !DILexicalBlock(scope: !955, file: !148, line: 205, column: 9)
!960 = !DILocalVariable(name: "value", scope: !959, file: !148, line: 207, type: !746)
!961 = !DILocalVariable(name: "mentioned", scope: !959, file: !148, line: 208, type: !746)
!962 = !DILocalVariable(name: "flag", scope: !959, file: !148, line: 209, type: !22)
!963 = !DILocalVariable(name: "change", scope: !959, file: !148, line: 210, type: !934)
!964 = !DILocalVariable(name: "octal_mode", scope: !965, file: !148, line: 217, type: !7)
!965 = distinct !DILexicalBlock(scope: !966, file: !148, line: 216, column: 15)
!966 = distinct !DILexicalBlock(scope: !959, file: !148, line: 213, column: 13)
!967 = !DILabel(scope: !955, name: "no_more_affected", file: !148, line: 202)
!968 = !DILabel(scope: !966, name: "no_more_values", file: !148, line: 284)
!969 = !DILabel(scope: !931, name: "invalid", file: !148, line: 307)
!970 = !DILocation(line: 0, scope: !931)
!971 = !DILocation(line: 141, column: 14, scope: !949)
!972 = !{!607, !607, i64 0}
!973 = !DILocation(line: 141, column: 27, scope: !949)
!974 = !DILocation(line: 150, column: 41, scope: !975)
!975 = distinct !DILexicalBlock(scope: !948, file: !148, line: 149, column: 9)
!976 = !DILocation(line: 0, scope: !948)
!977 = !DILocation(line: 150, column: 26, scope: !975)
!978 = !DILocation(line: 150, column: 43, scope: !975)
!979 = !DILocation(line: 150, column: 39, scope: !975)
!980 = !DILocation(line: 150, column: 46, scope: !975)
!981 = !DILocation(line: 151, column: 20, scope: !982)
!982 = distinct !DILexicalBlock(scope: !975, file: !148, line: 151, column: 15)
!983 = !DILocation(line: 151, column: 15, scope: !975)
!984 = !DILocation(line: 154, column: 21, scope: !948)
!985 = !DILocation(line: 154, column: 24, scope: !948)
!986 = distinct !{!986, !987, !988, !654}
!987 = !DILocation(line: 148, column: 7, scope: !948)
!988 = !DILocation(line: 154, column: 35, scope: !948)
!989 = !DILocation(line: 156, column: 11, scope: !990)
!990 = distinct !DILexicalBlock(scope: !948, file: !148, line: 156, column: 11)
!991 = !DILocation(line: 156, column: 11, scope: !948)
!992 = !DILocation(line: 160, column: 22, scope: !948)
!993 = !DILocation(line: 160, column: 36, scope: !948)
!994 = !DILocation(line: 160, column: 20, scope: !948)
!995 = !DILocalVariable(name: "new_mode", arg: 1, scope: !996, file: !148, line: 112, type: !746)
!996 = distinct !DISubprogram(name: "make_node_op_equals", scope: !148, file: !148, line: 112, type: !997, scopeLine: 113, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !147, retainedNodes: !999)
!997 = !DISubroutineType(types: !998)
!998 = !{!934, !746, !746}
!999 = !{!995, !1000, !1001}
!1000 = !DILocalVariable(name: "mentioned", arg: 2, scope: !996, file: !148, line: 112, type: !746)
!1001 = !DILocalVariable(name: "p", scope: !996, file: !148, line: 114, type: !934)
!1002 = !DILocation(line: 0, scope: !996, inlinedAt: !1003)
!1003 = distinct !DILocation(line: 163, column: 14, scope: !948)
!1004 = !DILocation(line: 114, column: 27, scope: !996, inlinedAt: !1003)
!1005 = !DILocation(line: 115, column: 9, scope: !996, inlinedAt: !1003)
!1006 = !{!1007, !607, i64 0}
!1007 = !{!"mode_change", !607, i64 0, !607, i64 1, !794, i64 4, !794, i64 8, !794, i64 12}
!1008 = !DILocation(line: 116, column: 6, scope: !996, inlinedAt: !1003)
!1009 = !DILocation(line: 116, column: 11, scope: !996, inlinedAt: !1003)
!1010 = !{!1007, !607, i64 1}
!1011 = !DILocation(line: 117, column: 6, scope: !996, inlinedAt: !1003)
!1012 = !DILocation(line: 117, column: 15, scope: !996, inlinedAt: !1003)
!1013 = !{!1007, !794, i64 4}
!1014 = !DILocation(line: 118, column: 6, scope: !996, inlinedAt: !1003)
!1015 = !DILocation(line: 118, column: 12, scope: !996, inlinedAt: !1003)
!1016 = !{!1007, !794, i64 8}
!1017 = !DILocation(line: 119, column: 6, scope: !996, inlinedAt: !1003)
!1018 = !DILocation(line: 119, column: 16, scope: !996, inlinedAt: !1003)
!1019 = !{!1007, !794, i64 12}
!1020 = !DILocation(line: 120, column: 8, scope: !996, inlinedAt: !1003)
!1021 = !DILocation(line: 120, column: 13, scope: !996, inlinedAt: !1003)
!1022 = !DILocation(line: 163, column: 7, scope: !948)
!1023 = !DILocation(line: 169, column: 27, scope: !1024)
!1024 = distinct !DILexicalBlock(scope: !1025, file: !148, line: 169, column: 5)
!1025 = distinct !DILexicalBlock(scope: !953, file: !148, line: 169, column: 5)
!1026 = !DILocation(line: 0, scope: !1025)
!1027 = !DILocation(line: 0, scope: !953)
!1028 = !DILocation(line: 169, column: 5, scope: !1025)
!1029 = !DILocation(line: 170, column: 41, scope: !1024)
!1030 = !DILocation(line: 170, column: 14, scope: !1024)
!1031 = !DILocation(line: 169, column: 32, scope: !1024)
!1032 = !DILocation(line: 169, column: 5, scope: !1024)
!1033 = distinct !{!1033, !1028, !1034, !654}
!1034 = !DILocation(line: 170, column: 53, scope: !1025)
!1035 = !DILocalVariable(name: "n", arg: 1, scope: !1036, file: !168, line: 99, type: !93)
!1036 = distinct !DISubprogram(name: "xnmalloc", scope: !168, file: !168, line: 99, type: !1037, scopeLine: 100, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !147, retainedNodes: !1039)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{!23, !93, !93}
!1039 = !{!1035, !1040}
!1040 = !DILocalVariable(name: "s", arg: 2, scope: !1036, file: !168, line: 99, type: !93)
!1041 = !DILocation(line: 0, scope: !1036, inlinedAt: !1042)
!1042 = distinct !DILocation(line: 171, column: 10, scope: !953)
!1043 = !DILocation(line: 101, column: 7, scope: !1044, inlinedAt: !1042)
!1044 = distinct !DILexicalBlock(scope: !1036, file: !168, line: 101, column: 7)
!1045 = !DILocation(line: 101, column: 7, scope: !1036, inlinedAt: !1042)
!1046 = !DILocation(line: 102, column: 5, scope: !1044, inlinedAt: !1042)
!1047 = !DILocation(line: 103, column: 21, scope: !1036, inlinedAt: !1042)
!1048 = !DILocation(line: 103, column: 10, scope: !1036, inlinedAt: !1042)
!1049 = !DILocation(line: 171, column: 10, scope: !953)
!1050 = !DILocation(line: 176, column: 8, scope: !957)
!1051 = !DILocation(line: 0, scope: !957)
!1052 = !DILocation(line: 138, column: 10, scope: !931)
!1053 = !DILocation(line: 0, scope: !959)
!1054 = !DILocation(line: 0, scope: !955)
!1055 = !DILocation(line: 182, column: 7, scope: !955)
!1056 = !DILocation(line: 183, column: 17, scope: !1057)
!1057 = distinct !DILexicalBlock(scope: !1058, file: !148, line: 182, column: 7)
!1058 = distinct !DILexicalBlock(scope: !955, file: !148, line: 182, column: 7)
!1059 = !DILocation(line: 183, column: 9, scope: !1057)
!1060 = !DILocation(line: 212, column: 11, scope: !959)
!1061 = !DILocation(line: 192, column: 13, scope: !1062)
!1062 = distinct !DILexicalBlock(scope: !1057, file: !148, line: 184, column: 11)
!1063 = !DILocation(line: 195, column: 13, scope: !1062)
!1064 = !DILocation(line: 198, column: 13, scope: !1062)
!1065 = !DILocation(line: 0, scope: !1062)
!1066 = !DILocation(line: 182, column: 16, scope: !1057)
!1067 = !DILocation(line: 182, column: 7, scope: !1057)
!1068 = distinct !{!1068, !1069, !1070}
!1069 = !DILocation(line: 182, column: 7, scope: !1058)
!1070 = !DILocation(line: 201, column: 11, scope: !1058)
!1071 = !DILocation(line: 206, column: 21, scope: !959)
!1072 = !DILocation(line: 179, column: 14, scope: !955)
!1073 = !DILocation(line: 206, column: 23, scope: !959)
!1074 = !DILocation(line: 212, column: 19, scope: !959)
!1075 = !DILocation(line: 219, column: 17, scope: !965)
!1076 = !DILocation(line: 221, column: 51, scope: !1077)
!1077 = distinct !DILexicalBlock(scope: !965, file: !148, line: 220, column: 19)
!1078 = !DILocation(line: 0, scope: !965)
!1079 = !DILocation(line: 221, column: 36, scope: !1077)
!1080 = !DILocation(line: 221, column: 53, scope: !1077)
!1081 = !DILocation(line: 221, column: 49, scope: !1077)
!1082 = !DILocation(line: 221, column: 56, scope: !1077)
!1083 = !DILocation(line: 222, column: 30, scope: !1084)
!1084 = distinct !DILexicalBlock(scope: !1077, file: !148, line: 222, column: 25)
!1085 = !DILocation(line: 222, column: 25, scope: !1077)
!1086 = !DILocation(line: 225, column: 31, scope: !965)
!1087 = !DILocation(line: 225, column: 34, scope: !965)
!1088 = distinct !{!1088, !1075, !1089, !654}
!1089 = !DILocation(line: 225, column: 45, scope: !965)
!1090 = !DILocation(line: 227, column: 21, scope: !1091)
!1091 = distinct !DILexicalBlock(scope: !965, file: !148, line: 227, column: 21)
!1092 = !DILocation(line: 227, column: 30, scope: !1091)
!1093 = !DILocation(line: 227, column: 37, scope: !1091)
!1094 = !DILocation(line: 239, column: 16, scope: !966)
!1095 = !DILocation(line: 240, column: 15, scope: !966)
!1096 = !DILocation(line: 245, column: 16, scope: !966)
!1097 = !DILocation(line: 246, column: 15, scope: !966)
!1098 = !DILocation(line: 251, column: 16, scope: !966)
!1099 = !DILocation(line: 252, column: 15, scope: !966)
!1100 = !DILocation(line: 259, column: 25, scope: !1101)
!1101 = distinct !DILexicalBlock(scope: !1102, file: !148, line: 258, column: 15)
!1102 = distinct !DILexicalBlock(scope: !966, file: !148, line: 258, column: 15)
!1103 = !DILocation(line: 0, scope: !966)
!1104 = !DILocation(line: 256, column: 20, scope: !966)
!1105 = !DILocation(line: 259, column: 17, scope: !1101)
!1106 = !DILocation(line: 262, column: 27, scope: !1107)
!1107 = distinct !DILexicalBlock(scope: !1101, file: !148, line: 260, column: 19)
!1108 = !DILocation(line: 263, column: 21, scope: !1107)
!1109 = !DILocation(line: 265, column: 27, scope: !1107)
!1110 = !DILocation(line: 266, column: 21, scope: !1107)
!1111 = !DILocation(line: 268, column: 27, scope: !1107)
!1112 = !DILocation(line: 269, column: 21, scope: !1107)
!1113 = !DILocation(line: 275, column: 27, scope: !1107)
!1114 = !DILocation(line: 276, column: 21, scope: !1107)
!1115 = !DILocation(line: 279, column: 27, scope: !1107)
!1116 = !DILocation(line: 280, column: 21, scope: !1107)
!1117 = !DILocation(line: 258, column: 24, scope: !1101)
!1118 = !DILocation(line: 258, column: 15, scope: !1101)
!1119 = distinct !{!1119, !1120, !1121}
!1120 = !DILocation(line: 258, column: 15, scope: !1102)
!1121 = !DILocation(line: 283, column: 19, scope: !1102)
!1122 = !DILocation(line: 208, column: 18, scope: !959)
!1123 = !DILocation(line: 287, column: 28, scope: !959)
!1124 = !DILocation(line: 288, column: 19, scope: !959)
!1125 = !DILocation(line: 288, column: 22, scope: !959)
!1126 = !DILocation(line: 289, column: 19, scope: !959)
!1127 = !DILocation(line: 289, column: 24, scope: !959)
!1128 = !DILocation(line: 290, column: 19, scope: !959)
!1129 = !DILocation(line: 290, column: 28, scope: !959)
!1130 = !DILocation(line: 291, column: 19, scope: !959)
!1131 = !DILocation(line: 291, column: 25, scope: !959)
!1132 = !DILocation(line: 293, column: 14, scope: !959)
!1133 = !DILocation(line: 292, column: 19, scope: !959)
!1134 = !DILocation(line: 292, column: 29, scope: !959)
!1135 = !DILocation(line: 295, column: 14, scope: !955)
!1136 = !DILocation(line: 295, column: 24, scope: !955)
!1137 = !DILocation(line: 176, column: 28, scope: !956)
!1138 = !DILocation(line: 176, column: 3, scope: !956)
!1139 = distinct !{!1139, !1140, !1141}
!1140 = !DILocation(line: 176, column: 3, scope: !957)
!1141 = !DILocation(line: 299, column: 5, scope: !957)
!1142 = !DILocation(line: 303, column: 16, scope: !1143)
!1143 = distinct !DILexicalBlock(scope: !1144, file: !148, line: 302, column: 5)
!1144 = distinct !DILexicalBlock(scope: !931, file: !148, line: 301, column: 7)
!1145 = !DILocation(line: 303, column: 21, scope: !1143)
!1146 = !DILocation(line: 304, column: 7, scope: !1143)
!1147 = !DILocation(line: 307, column: 1, scope: !931)
!1148 = !DILocation(line: 308, column: 3, scope: !931)
!1149 = !DILocation(line: 309, column: 3, scope: !931)
!1150 = !DILocation(line: 310, column: 1, scope: !931)
!1151 = distinct !DISubprogram(name: "mode_create_from_ref", scope: !148, file: !148, line: 316, type: !932, scopeLine: 317, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !147, retainedNodes: !1152)
!1152 = !{!1153, !1154}
!1153 = !DILocalVariable(name: "ref_file", arg: 1, scope: !1151, file: !148, line: 316, type: !31)
!1154 = !DILocalVariable(name: "ref_stats", scope: !1151, file: !148, line: 318, type: !1155)
!1155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !1156, line: 26, size: 1152, elements: !1157)
!1156 = !DIFile(filename: "/usr/include/bits/struct_stat.h", directory: "")
!1157 = !{!1158, !1160, !1162, !1164, !1165, !1167, !1169, !1170, !1171, !1172, !1174, !1176, !1184, !1185, !1186}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1155, file: !1156, line: 28, baseType: !1159, size: 64)
!1159 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !706, line: 145, baseType: !95)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1155, file: !1156, line: 33, baseType: !1161, size: 64, offset: 64)
!1161 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !706, line: 148, baseType: !95)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1155, file: !1156, line: 41, baseType: !1163, size: 64, offset: 128)
!1163 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !706, line: 151, baseType: !95)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1155, file: !1156, line: 42, baseType: !748, size: 32, offset: 192)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1155, file: !1156, line: 44, baseType: !1166, size: 32, offset: 224)
!1166 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !706, line: 146, baseType: !7)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1155, file: !1156, line: 45, baseType: !1168, size: 32, offset: 256)
!1168 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !706, line: 147, baseType: !7)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !1155, file: !1156, line: 47, baseType: !34, size: 32, offset: 288)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1155, file: !1156, line: 49, baseType: !1159, size: 64, offset: 320)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1155, file: !1156, line: 54, baseType: !705, size: 64, offset: 384)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1155, file: !1156, line: 58, baseType: !1173, size: 64, offset: 448)
!1173 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !706, line: 175, baseType: !707)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1155, file: !1156, line: 60, baseType: !1175, size: 64, offset: 512)
!1175 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !706, line: 180, baseType: !707)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1155, file: !1156, line: 71, baseType: !1177, size: 128, offset: 576)
!1177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !1178, line: 10, size: 128, elements: !1179)
!1178 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!1179 = !{!1180, !1182}
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1177, file: !1178, line: 12, baseType: !1181, size: 64)
!1181 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !706, line: 160, baseType: !707)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1177, file: !1178, line: 16, baseType: !1183, size: 64, offset: 64)
!1183 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !706, line: 197, baseType: !707)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !1155, file: !1156, line: 72, baseType: !1177, size: 128, offset: 704)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !1155, file: !1156, line: 73, baseType: !1177, size: 128, offset: 832)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !1155, file: !1156, line: 86, baseType: !1187, size: 192, offset: 960)
!1187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1183, size: 192, elements: !1188)
!1188 = !{!1189}
!1189 = !DISubrange(count: 3)
!1190 = !DILocation(line: 0, scope: !1151)
!1191 = !DILocation(line: 318, column: 3, scope: !1151)
!1192 = !DILocation(line: 318, column: 15, scope: !1151)
!1193 = !DILocation(line: 320, column: 7, scope: !1194)
!1194 = distinct !DILexicalBlock(scope: !1151, file: !148, line: 320, column: 7)
!1195 = !DILocation(line: 320, column: 35, scope: !1194)
!1196 = !DILocation(line: 320, column: 7, scope: !1151)
!1197 = !DILocation(line: 322, column: 41, scope: !1151)
!1198 = !{!1199, !794, i64 24}
!1199 = !{!"stat", !1200, i64 0, !1200, i64 8, !1200, i64 16, !794, i64 24, !794, i64 28, !794, i64 32, !794, i64 36, !1200, i64 40, !1200, i64 48, !1200, i64 56, !1200, i64 64, !1201, i64 72, !1201, i64 88, !1201, i64 104, !607, i64 120}
!1200 = !{!"long", !607, i64 0}
!1201 = !{!"timespec", !1200, i64 0, !1200, i64 8}
!1202 = !DILocation(line: 0, scope: !996, inlinedAt: !1203)
!1203 = distinct !DILocation(line: 322, column: 10, scope: !1151)
!1204 = !DILocation(line: 114, column: 27, scope: !996, inlinedAt: !1203)
!1205 = !DILocation(line: 115, column: 9, scope: !996, inlinedAt: !1203)
!1206 = !DILocation(line: 116, column: 6, scope: !996, inlinedAt: !1203)
!1207 = !DILocation(line: 116, column: 11, scope: !996, inlinedAt: !1203)
