source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.infomap = type { i8*, i8* }
%struct.mode_change = type { i8, i8, i32, i32, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [31 x i8] c"Usage: %s [OPTION]... NAME...\0A\00", align 1
@.str.2 = private unnamed_addr constant [50 x i8] c"Create named pipes (FIFOs) with the given NAMEs.\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 38, type: !169, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !20, globals: !168, nameTableKind: None)
!3 = !DIFile(filename: "src/mkfifo.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!9 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!20 = !{!21, !31, !92, !96, !100, !103, !106, !113, !128, !25, !82, !132, !136, !140, !146, !150, !157, !160, !163, !166}
!21 = !DISubprogram(name: "dcgettext", scope: !22, file: !22, line: 51, type: !23, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!22 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!23 = !DISubroutineType(types: !24)
!24 = !{!25, !27, !27, !29}
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!29 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!30 = !{}
!31 = !DISubprogram(name: "fputs_unlocked", scope: !32, file: !32, line: 662, type: !33, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!32 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!33 = !DISubroutineType(types: !34)
!34 = !{!29, !27, !35}
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !37, line: 49, size: 1728, elements: !38)
!37 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!38 = !{!39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !54, !55, !56, !57, !61, !63, !65, !69, !72, !74, !77, !80, !81, !83, !87, !88}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !36, file: !37, line: 51, baseType: !29, size: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !36, file: !37, line: 54, baseType: !25, size: 64, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !36, file: !37, line: 55, baseType: !25, size: 64, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !36, file: !37, line: 56, baseType: !25, size: 64, offset: 192)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !36, file: !37, line: 57, baseType: !25, size: 64, offset: 256)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !36, file: !37, line: 58, baseType: !25, size: 64, offset: 320)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !36, file: !37, line: 59, baseType: !25, size: 64, offset: 384)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !36, file: !37, line: 60, baseType: !25, size: 64, offset: 448)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !36, file: !37, line: 61, baseType: !25, size: 64, offset: 512)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !36, file: !37, line: 64, baseType: !25, size: 64, offset: 576)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !36, file: !37, line: 65, baseType: !25, size: 64, offset: 640)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !36, file: !37, line: 66, baseType: !25, size: 64, offset: 704)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !36, file: !37, line: 68, baseType: !52, size: 64, offset: 768)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !37, line: 36, flags: DIFlagFwdDecl)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !36, file: !37, line: 70, baseType: !35, size: 64, offset: 832)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !36, file: !37, line: 72, baseType: !29, size: 32, offset: 896)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !36, file: !37, line: 73, baseType: !29, size: 32, offset: 928)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !36, file: !37, line: 74, baseType: !58, size: 64, offset: 960)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !59, line: 152, baseType: !60)
!59 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!60 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !36, file: !37, line: 77, baseType: !62, size: 16, offset: 1024)
!62 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !36, file: !37, line: 78, baseType: !64, size: 8, offset: 1040)
!64 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !36, file: !37, line: 79, baseType: !66, size: 8, offset: 1048)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 8, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 1)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !36, file: !37, line: 81, baseType: !70, size: 64, offset: 1088)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !37, line: 43, baseType: null)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !36, file: !37, line: 89, baseType: !73, size: 64, offset: 1152)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !59, line: 153, baseType: !60)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !36, file: !37, line: 91, baseType: !75, size: 64, offset: 1216)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !37, line: 37, flags: DIFlagFwdDecl)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !36, file: !37, line: 92, baseType: !78, size: 64, offset: 1280)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !37, line: 38, flags: DIFlagFwdDecl)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !36, file: !37, line: 93, baseType: !35, size: 64, offset: 1344)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !36, file: !37, line: 94, baseType: !82, size: 64, offset: 1408)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !36, file: !37, line: 95, baseType: !84, size: 64, offset: 1472)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !85, line: 46, baseType: !86)
!85 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!86 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !36, file: !37, line: 96, baseType: !29, size: 32, offset: 1536)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !36, file: !37, line: 98, baseType: !89, size: 160, offset: 1568)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 160, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: 20)
!92 = !DISubprogram(name: "set_program_name", scope: !93, file: !93, line: 37, type: !94, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!93 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!94 = !DISubroutineType(types: !95)
!95 = !{null, !27}
!96 = !DISubprogram(name: "setlocale", scope: !97, file: !97, line: 122, type: !98, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!97 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!98 = !DISubroutineType(types: !99)
!99 = !{!25, !29, !27}
!100 = !DISubprogram(name: "bindtextdomain", scope: !22, file: !22, line: 86, type: !101, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!101 = !DISubroutineType(types: !102)
!102 = !{!25, !27, !27}
!103 = !DISubprogram(name: "textdomain", scope: !22, file: !22, line: 82, type: !104, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!104 = !DISubroutineType(types: !105)
!105 = !{!25, !27}
!106 = !DISubprogram(name: "atexit", scope: !107, file: !107, line: 595, type: !108, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!107 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!108 = !DISubroutineType(types: !109)
!109 = !{!29, !110}
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{null}
!113 = !DISubprogram(name: "getopt_long", scope: !114, file: !114, line: 66, type: !115, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!114 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!115 = !DISubroutineType(types: !116)
!116 = !{!29, !29, !117, !27, !119, !126}
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !114, line: 50, size: 256, elements: !122)
!122 = !{!123, !124, !125, !127}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !121, file: !114, line: 52, baseType: !27, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !121, file: !114, line: 55, baseType: !29, size: 32, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !121, file: !114, line: 56, baseType: !126, size: 64, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !121, file: !114, line: 57, baseType: !29, size: 32, offset: 192)
!128 = !DISubprogram(name: "error", scope: !129, file: !129, line: 52, type: !130, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!129 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!130 = !DISubroutineType(types: !131)
!131 = !{null, !29, !29, !27, null}
!132 = !DISubprogram(name: "version_etc", scope: !133, file: !133, line: 69, type: !134, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!133 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!134 = !DISubroutineType(types: !135)
!135 = !{null, !35, !27, !27, !27, null}
!136 = !DISubprogram(name: "quote", scope: !137, file: !137, line: 44, type: !138, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!137 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!138 = !DISubroutineType(types: !139)
!139 = !{!27, !27}
!140 = !DISubprogram(name: "mode_compile", scope: !141, file: !141, line: 25, type: !142, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!141 = !DIFile(filename: "./lib/modechange.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!142 = !DISubroutineType(types: !143)
!143 = !{!144, !27}
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "mode_change", file: !141, line: 25, flags: DIFlagFwdDecl)
!146 = !DISubprogram(name: "umask", scope: !147, file: !147, line: 308, type: !148, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!147 = !DIFile(filename: "/usr/include/sys/stat.h", directory: "")
!148 = !DISubroutineType(types: !149)
!149 = !{!7, !7}
!150 = !DISubprogram(name: "mode_adjust", scope: !141, file: !141, line: 27, type: !151, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!151 = !DISubroutineType(types: !152)
!152 = !{!7, !7, !153, !7, !154, !156}
!153 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !145)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!157 = !DISubprogram(name: "free", scope: !107, file: !107, line: 565, type: !158, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!158 = !DISubroutineType(types: !159)
!159 = !{null, !82}
!160 = !DISubprogram(name: "mkfifo", scope: !147, file: !147, line: 346, type: !161, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!161 = !DISubroutineType(types: !162)
!162 = !{!29, !27, !7}
!163 = !DISubprogram(name: "quotearg_style", scope: !6, file: !6, line: 377, type: !164, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!164 = !DISubroutineType(types: !165)
!165 = !{!25, !5, !27}
!166 = !DISubprogram(name: "lchmod", scope: !167, file: !167, line: 993, type: !161, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!167 = !DIFile(filename: "./lib/sys/stat.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!168 = !{!0}
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 1280, elements: !170)
!170 = !{!171}
!171 = !DISubrange(count: 5)
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(name: "Version", scope: !174, file: !175, line: 2, type: !27, isDefinition: true)
!174 = distinct !DICompileUnit(language: DW_LANG_C99, file: !175, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !30, globals: !176, nameTableKind: None)
!175 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!176 = !{!172}
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "file_name", scope: !179, file: !180, line: 46, type: !27, isLocal: true, isDefinition: true)
!179 = distinct !DICompileUnit(language: DW_LANG_C99, file: !180, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !30, retainedTypes: !181, globals: !219, nameTableKind: None)
!180 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!181 = !{!182, !21, !218, !128}
!182 = !DISubprogram(name: "close_stream", scope: !183, file: !183, line: 2, type: !184, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!183 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!184 = !DISubroutineType(types: !185)
!185 = !{!29, !186}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !37, line: 49, size: 1728, elements: !188)
!188 = !{!189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !187, file: !37, line: 51, baseType: !29, size: 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !187, file: !37, line: 54, baseType: !25, size: 64, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !187, file: !37, line: 55, baseType: !25, size: 64, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !187, file: !37, line: 56, baseType: !25, size: 64, offset: 192)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !187, file: !37, line: 57, baseType: !25, size: 64, offset: 256)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !187, file: !37, line: 58, baseType: !25, size: 64, offset: 320)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !187, file: !37, line: 59, baseType: !25, size: 64, offset: 384)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !187, file: !37, line: 60, baseType: !25, size: 64, offset: 448)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !187, file: !37, line: 61, baseType: !25, size: 64, offset: 512)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !187, file: !37, line: 64, baseType: !25, size: 64, offset: 576)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !187, file: !37, line: 65, baseType: !25, size: 64, offset: 640)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !187, file: !37, line: 66, baseType: !25, size: 64, offset: 704)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !187, file: !37, line: 68, baseType: !52, size: 64, offset: 768)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !187, file: !37, line: 70, baseType: !186, size: 64, offset: 832)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !187, file: !37, line: 72, baseType: !29, size: 32, offset: 896)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !187, file: !37, line: 73, baseType: !29, size: 32, offset: 928)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !187, file: !37, line: 74, baseType: !58, size: 64, offset: 960)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !187, file: !37, line: 77, baseType: !62, size: 16, offset: 1024)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !187, file: !37, line: 78, baseType: !64, size: 8, offset: 1040)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !187, file: !37, line: 79, baseType: !66, size: 8, offset: 1048)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !187, file: !37, line: 81, baseType: !70, size: 64, offset: 1088)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !187, file: !37, line: 89, baseType: !73, size: 64, offset: 1152)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !187, file: !37, line: 91, baseType: !75, size: 64, offset: 1216)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !187, file: !37, line: 92, baseType: !78, size: 64, offset: 1280)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !187, file: !37, line: 93, baseType: !186, size: 64, offset: 1344)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !187, file: !37, line: 94, baseType: !82, size: 64, offset: 1408)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !187, file: !37, line: 95, baseType: !84, size: 64, offset: 1472)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !187, file: !37, line: 96, baseType: !29, size: 32, offset: 1536)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !187, file: !37, line: 98, baseType: !89, size: 160, offset: 1568)
!218 = !DISubprogram(name: "quotearg_colon", scope: !6, file: !6, line: 391, type: !104, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!219 = !{!177, !220}
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !179, file: !180, line: 56, type: !153, isLocal: true, isDefinition: true)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(name: "exit_failure", scope: !224, file: !225, line: 24, type: !227, isDefinition: true)
!224 = distinct !DICompileUnit(language: DW_LANG_C99, file: !225, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !30, globals: !226, nameTableKind: None)
!225 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!226 = !{!222}
!227 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !29)
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(name: "program_name", scope: !230, file: !231, line: 33, type: !27, isDefinition: true)
!230 = distinct !DICompileUnit(language: DW_LANG_C99, file: !231, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !30, retainedTypes: !232, globals: !268, nameTableKind: None)
!231 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!232 = !{!82, !233, !25}
!233 = !DISubprogram(name: "fputs", scope: !32, file: !32, line: 626, type: !234, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!234 = !DISubroutineType(types: !235)
!235 = !{!29, !27, !236}
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !37, line: 49, size: 1728, elements: !238)
!238 = !{!239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !237, file: !37, line: 51, baseType: !29, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !237, file: !37, line: 54, baseType: !25, size: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !237, file: !37, line: 55, baseType: !25, size: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !237, file: !37, line: 56, baseType: !25, size: 64, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !237, file: !37, line: 57, baseType: !25, size: 64, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !237, file: !37, line: 58, baseType: !25, size: 64, offset: 320)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !237, file: !37, line: 59, baseType: !25, size: 64, offset: 384)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !237, file: !37, line: 60, baseType: !25, size: 64, offset: 448)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !237, file: !37, line: 61, baseType: !25, size: 64, offset: 512)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !237, file: !37, line: 64, baseType: !25, size: 64, offset: 576)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !237, file: !37, line: 65, baseType: !25, size: 64, offset: 640)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !237, file: !37, line: 66, baseType: !25, size: 64, offset: 704)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !237, file: !37, line: 68, baseType: !52, size: 64, offset: 768)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !237, file: !37, line: 70, baseType: !236, size: 64, offset: 832)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !237, file: !37, line: 72, baseType: !29, size: 32, offset: 896)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !237, file: !37, line: 73, baseType: !29, size: 32, offset: 928)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !237, file: !37, line: 74, baseType: !58, size: 64, offset: 960)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !237, file: !37, line: 77, baseType: !62, size: 16, offset: 1024)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !237, file: !37, line: 78, baseType: !64, size: 8, offset: 1040)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !237, file: !37, line: 79, baseType: !66, size: 8, offset: 1048)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !237, file: !37, line: 81, baseType: !70, size: 64, offset: 1088)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !237, file: !37, line: 89, baseType: !73, size: 64, offset: 1152)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !237, file: !37, line: 91, baseType: !75, size: 64, offset: 1216)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !237, file: !37, line: 92, baseType: !78, size: 64, offset: 1280)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !237, file: !37, line: 93, baseType: !236, size: 64, offset: 1344)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !237, file: !37, line: 94, baseType: !82, size: 64, offset: 1408)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !237, file: !37, line: 95, baseType: !84, size: 64, offset: 1472)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !237, file: !37, line: 96, baseType: !29, size: 32, offset: 1536)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !237, file: !37, line: 98, baseType: !89, size: 160, offset: 1568)
!268 = !{!228}
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !271, file: !272, line: 85, type: !389, isDefinition: true)
!271 = distinct !DICompileUnit(language: DW_LANG_C99, file: !272, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !273, retainedTypes: !294, globals: !362, nameTableKind: None)
!272 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!273 = !{!5, !274, !279}
!274 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, baseType: !7, size: 32, elements: !275)
!275 = !{!276, !277, !278}
!276 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!277 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!278 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!279 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !280, line: 46, baseType: !7, size: 32, elements: !281)
!280 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!281 = !{!282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293}
!282 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!283 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!284 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!285 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!286 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!287 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!288 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!289 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!290 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!291 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!292 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!293 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!294 = !{!295, !301, !157, !317, !29, !62, !320, !84, !337, !341, !21, !347, !351, !25, !355, !358, !359}
!295 = !DISubprogram(name: "xmemdup", scope: !296, file: !296, line: 62, type: !297, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!296 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!297 = !DISubroutineType(types: !298)
!298 = !{!82, !299, !86}
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!301 = !DISubprogram(name: "quotearg_alloc_mem", scope: !6, file: !6, line: 342, type: !302, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!302 = !DISubroutineType(types: !303)
!303 = !{!25, !27, !86, !304, !305}
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !307)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !272, line: 65, size: 448, elements: !308)
!308 = !{!309, !310, !311, !315, !316}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !307, file: !272, line: 68, baseType: !5, size: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !307, file: !272, line: 71, baseType: !29, size: 32, offset: 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !307, file: !272, line: 75, baseType: !312, size: 256, offset: 64)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !313)
!313 = !{!314}
!314 = !DISubrange(count: 8)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !307, file: !272, line: 78, baseType: !27, size: 64, offset: 320)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !307, file: !272, line: 81, baseType: !27, size: 64, offset: 384)
!317 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !6, file: !6, line: 408, type: !318, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!318 = !DISubroutineType(types: !319)
!319 = !{!25, !29, !27, !27, !27, !86}
!320 = !DISubprogram(name: "rpl_mbrtowc", scope: !321, file: !321, line: 717, type: !322, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!321 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!322 = !DISubroutineType(types: !323)
!323 = !{!86, !126, !27, !86, !324}
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !326, line: 13, size: 64, elements: !327)
!326 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!327 = !{!328, !329}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !325, file: !326, line: 15, baseType: !29, size: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !325, file: !326, line: 20, baseType: !330, size: 32, offset: 32)
!330 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !325, file: !326, line: 16, size: 32, elements: !331)
!331 = !{!332, !333}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !330, file: !326, line: 18, baseType: !7, size: 32)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !330, file: !326, line: 19, baseType: !334, size: 32)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 32, elements: !335)
!335 = !{!336}
!336 = !DISubrange(count: 4)
!337 = !DISubprogram(name: "iswprint", scope: !338, file: !338, line: 120, type: !339, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!338 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!339 = !DISubroutineType(types: !340)
!340 = !{!29, !7}
!341 = !DISubprogram(name: "mbsinit", scope: !342, file: !342, line: 292, type: !343, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!342 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!343 = !DISubroutineType(types: !344)
!344 = !{!29, !345}
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !325)
!347 = !DISubprogram(name: "locale_charset", scope: !348, file: !348, line: 35, type: !349, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!348 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!349 = !DISubroutineType(types: !350)
!350 = !{!27}
!351 = !DISubprogram(name: "c_strcasecmp", scope: !352, file: !352, line: 42, type: !353, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!352 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!353 = !DISubroutineType(types: !354)
!354 = !{!29, !27, !27}
!355 = !DISubprogram(name: "xmalloc", scope: !296, file: !296, line: 53, type: !356, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!356 = !DISubroutineType(types: !357)
!357 = !{!82, !86}
!358 = !DISubprogram(name: "xalloc_die", scope: !296, file: !296, line: 51, type: !111, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !30)
!359 = !DISubprogram(name: "xrealloc", scope: !296, file: !296, line: 59, type: !360, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!360 = !DISubroutineType(types: !361)
!361 = !{!82, !82, !86}
!362 = !{!269, !363, !369, !371, !373, !378, !385, !387}
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !271, file: !272, line: 101, type: !365, isDefinition: true)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 320, elements: !367)
!366 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!367 = !{!368}
!368 = !DISubrange(count: 10)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !271, file: !272, line: 1052, type: !307, isDefinition: true)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !271, file: !272, line: 116, type: !307, isLocal: true, isDefinition: true)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "slot0", scope: !271, file: !272, line: 842, type: !375, isLocal: true, isDefinition: true)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 2048, elements: !376)
!376 = !{!377}
!377 = !DISubrange(count: 256)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(name: "slotvec", scope: !271, file: !272, line: 845, type: !380, isLocal: true, isDefinition: true)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !272, line: 834, size: 128, elements: !382)
!382 = !{!383, !384}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !381, file: !272, line: 836, baseType: !84, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !381, file: !272, line: 837, baseType: !25, size: 64, offset: 64)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "nslots", scope: !271, file: !272, line: 843, type: !29, isLocal: true, isDefinition: true)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "slotvec0", scope: !271, file: !272, line: 844, type: !381, isLocal: true, isDefinition: true)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 704, elements: !391)
!390 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!391 = !{!392}
!392 = !DISubrange(count: 11)
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !395, file: !396, line: 26, type: !398, isDefinition: true)
!395 = distinct !DICompileUnit(language: DW_LANG_C99, file: !396, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !30, globals: !397, nameTableKind: None)
!396 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!397 = !{!393}
!398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 376, elements: !399)
!399 = !{!400}
!400 = !DISubrange(count: 47)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "fmt", scope: !403, file: !404, line: 80, type: !471, isLocal: true, isDefinition: true)
!403 = distinct !DISubprogram(name: "lchmod", scope: !404, file: !404, line: 46, type: !405, scopeLine: 47, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !410, retainedNodes: !422)
!404 = !DIFile(filename: "lib/lchmod.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!405 = !DISubroutineType(types: !406)
!406 = !{!29, !27, !407}
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !408, line: 69, baseType: !409)
!408 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !59, line: 150, baseType: !7)
!410 = distinct !DICompileUnit(language: DW_LANG_C99, file: !404, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !30, retainedTypes: !411, globals: !421, nameTableKind: None)
!411 = !{!412, !416, !420}
!412 = !DISubprogram(name: "open", scope: !413, file: !413, line: 196, type: !414, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!413 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
!414 = !DISubroutineType(types: !415)
!415 = !{!29, !27, !29, null}
!416 = !DISubprogram(name: "close", scope: !417, file: !417, line: 353, type: !418, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!417 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!418 = !DISubroutineType(types: !419)
!419 = !{!29, !29}
!420 = !DISubprogram(name: "chmod", scope: !147, file: !147, line: 280, type: !161, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!421 = !{!401}
!422 = !{!423, !424, !425, !426, !462, !465, !469, !470}
!423 = !DILocalVariable(name: "file", arg: 1, scope: !403, file: !404, line: 46, type: !27)
!424 = !DILocalVariable(name: "mode", arg: 2, scope: !403, file: !404, line: 46, type: !407)
!425 = !DILocalVariable(name: "fd", scope: !403, file: !404, line: 53, type: !29)
!426 = !DILocalVariable(name: "st", scope: !403, file: !404, line: 64, type: !427)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !428, line: 46, size: 1152, elements: !429)
!428 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "")
!429 = !{!430, !432, !434, !436, !437, !439, !441, !442, !443, !444, !446, !448, !456, !457, !458}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !427, file: !428, line: 48, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !59, line: 145, baseType: !86)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !427, file: !428, line: 53, baseType: !433, size: 64, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !59, line: 148, baseType: !86)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !427, file: !428, line: 61, baseType: !435, size: 64, offset: 128)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !59, line: 151, baseType: !86)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !427, file: !428, line: 62, baseType: !409, size: 32, offset: 192)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !427, file: !428, line: 64, baseType: !438, size: 32, offset: 224)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !59, line: 146, baseType: !7)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !427, file: !428, line: 65, baseType: !440, size: 32, offset: 256)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !59, line: 147, baseType: !7)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !427, file: !428, line: 67, baseType: !29, size: 32, offset: 288)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !427, file: !428, line: 69, baseType: !431, size: 64, offset: 320)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !427, file: !428, line: 74, baseType: !58, size: 64, offset: 384)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !427, file: !428, line: 78, baseType: !445, size: 64, offset: 448)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !59, line: 174, baseType: !60)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !427, file: !428, line: 80, baseType: !447, size: 64, offset: 512)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !59, line: 179, baseType: !60)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !427, file: !428, line: 91, baseType: !449, size: 128, offset: 576)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !450, line: 10, size: 128, elements: !451)
!450 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!451 = !{!452, !454}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !449, file: !450, line: 12, baseType: !453, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !59, line: 160, baseType: !60)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !449, file: !450, line: 16, baseType: !455, size: 64, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !59, line: 196, baseType: !60)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !427, file: !428, line: 92, baseType: !449, size: 128, offset: 704)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !427, file: !428, line: 93, baseType: !449, size: 128, offset: 832)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !427, file: !428, line: 106, baseType: !459, size: 192, offset: 960)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !455, size: 192, elements: !460)
!460 = !{!461}
!461 = !DISubrange(count: 3)
!462 = !DILocalVariable(name: "stat_errno", scope: !463, file: !404, line: 67, type: !29)
!463 = distinct !DILexicalBlock(scope: !464, file: !404, line: 66, column: 5)
!464 = distinct !DILexicalBlock(scope: !403, file: !404, line: 65, column: 7)
!465 = !DILocalVariable(name: "buf", scope: !403, file: !404, line: 81, type: !466)
!466 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 208, elements: !467)
!467 = !{!468}
!468 = !DISubrange(count: 26)
!469 = !DILocalVariable(name: "chmod_result", scope: !403, file: !404, line: 83, type: !29)
!470 = !DILocalVariable(name: "chmod_errno", scope: !403, file: !404, line: 84, type: !29)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 136, elements: !472)
!472 = !{!473}
!473 = !DISubrange(count: 17)
!474 = distinct !DICompileUnit(language: DW_LANG_C99, file: !475, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !30, nameTableKind: None)
!475 = !DIFile(filename: "src/selinux.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!476 = distinct !DICompileUnit(language: DW_LANG_C99, file: !477, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !478, retainedTypes: !485, nameTableKind: None)
!477 = !DIFile(filename: "lib/modechange.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!478 = !{!479}
!479 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !477, line: 78, baseType: !7, size: 32, elements: !480)
!480 = !{!481, !482, !483, !484}
!481 = !DIEnumerator(name: "MODE_DONE", value: 0, isUnsigned: true)
!482 = !DIEnumerator(name: "MODE_ORDINARY_CHANGE", value: 1, isUnsigned: true)
!483 = !DIEnumerator(name: "MODE_X_IF_ANY_X", value: 2, isUnsigned: true)
!484 = !DIEnumerator(name: "MODE_COPY_EXISTING", value: 3, isUnsigned: true)
!485 = !{!157, !355, !84, !358}
!486 = distinct !DICompileUnit(language: DW_LANG_C99, file: !487, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !488, retainedTypes: !492, nameTableKind: None)
!487 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!488 = !{!489}
!489 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !487, line: 40, baseType: !7, size: 32, elements: !490)
!490 = !{!491}
!491 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!492 = !{!21, !493, !82}
!493 = !DISubprogram(name: "fputs_unlocked", scope: !32, file: !32, line: 662, type: !494, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!494 = !DISubroutineType(types: !495)
!495 = !{!29, !27, !496}
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !37, line: 49, size: 1728, elements: !498)
!498 = !{!499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !497, file: !37, line: 51, baseType: !29, size: 32)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !497, file: !37, line: 54, baseType: !25, size: 64, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !497, file: !37, line: 55, baseType: !25, size: 64, offset: 128)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !497, file: !37, line: 56, baseType: !25, size: 64, offset: 192)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !497, file: !37, line: 57, baseType: !25, size: 64, offset: 256)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !497, file: !37, line: 58, baseType: !25, size: 64, offset: 320)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !497, file: !37, line: 59, baseType: !25, size: 64, offset: 384)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !497, file: !37, line: 60, baseType: !25, size: 64, offset: 448)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !497, file: !37, line: 61, baseType: !25, size: 64, offset: 512)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !497, file: !37, line: 64, baseType: !25, size: 64, offset: 576)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !497, file: !37, line: 65, baseType: !25, size: 64, offset: 640)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !497, file: !37, line: 66, baseType: !25, size: 64, offset: 704)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !497, file: !37, line: 68, baseType: !52, size: 64, offset: 768)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !497, file: !37, line: 70, baseType: !496, size: 64, offset: 832)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !497, file: !37, line: 72, baseType: !29, size: 32, offset: 896)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !497, file: !37, line: 73, baseType: !29, size: 32, offset: 928)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !497, file: !37, line: 74, baseType: !58, size: 64, offset: 960)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !497, file: !37, line: 77, baseType: !62, size: 16, offset: 1024)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !497, file: !37, line: 78, baseType: !64, size: 8, offset: 1040)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !497, file: !37, line: 79, baseType: !66, size: 8, offset: 1048)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !497, file: !37, line: 81, baseType: !70, size: 64, offset: 1088)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !497, file: !37, line: 89, baseType: !73, size: 64, offset: 1152)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !497, file: !37, line: 91, baseType: !75, size: 64, offset: 1216)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !497, file: !37, line: 92, baseType: !78, size: 64, offset: 1280)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !497, file: !37, line: 93, baseType: !496, size: 64, offset: 1344)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !497, file: !37, line: 94, baseType: !82, size: 64, offset: 1408)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !497, file: !37, line: 95, baseType: !84, size: 64, offset: 1472)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !497, file: !37, line: 96, baseType: !29, size: 32, offset: 1536)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !497, file: !37, line: 98, baseType: !89, size: 160, offset: 1568)
!528 = distinct !DICompileUnit(language: DW_LANG_C99, file: !529, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !530, retainedTypes: !543, nameTableKind: None)
!529 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!530 = !{!531}
!531 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !532, file: !296, line: 186, baseType: !7, size: 32, elements: !541)
!532 = distinct !DISubprogram(name: "x2nrealloc", scope: !296, file: !296, line: 174, type: !533, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !528, retainedNodes: !536)
!533 = !DISubroutineType(types: !534)
!534 = !{!82, !82, !535, !84}
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!536 = !{!537, !538, !539, !540}
!537 = !DILocalVariable(name: "p", arg: 1, scope: !532, file: !296, line: 174, type: !82)
!538 = !DILocalVariable(name: "pn", arg: 2, scope: !532, file: !296, line: 174, type: !535)
!539 = !DILocalVariable(name: "s", arg: 3, scope: !532, file: !296, line: 174, type: !84)
!540 = !DILocalVariable(name: "n", scope: !532, file: !296, line: 176, type: !84)
!541 = !{!542}
!542 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!543 = !{!84, !358, !355, !359, !25, !157, !82, !544, !547}
!544 = !DISubprogram(name: "xcalloc", scope: !296, file: !296, line: 57, type: !545, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!545 = !DISubroutineType(types: !546)
!546 = !{!82, !86, !86}
!547 = !DISubprogram(name: "rpl_calloc", scope: !548, file: !548, line: 688, type: !545, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!548 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!549 = distinct !DICompileUnit(language: DW_LANG_C99, file: !550, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !30, retainedTypes: !551, nameTableKind: None)
!550 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!551 = !{!21, !128}
!552 = distinct !DICompileUnit(language: DW_LANG_C99, file: !553, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !30, retainedTypes: !554, nameTableKind: None)
!553 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!554 = !{!82}
!555 = distinct !DICompileUnit(language: DW_LANG_C99, file: !556, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !30, retainedTypes: !557, nameTableKind: None)
!556 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!557 = !{!558, !84, !570}
!558 = !DISubprogram(name: "mbrtowc", scope: !342, file: !342, line: 296, type: !559, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!559 = !DISubroutineType(types: !560)
!560 = !{!86, !126, !27, !86, !561}
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !326, line: 13, size: 64, elements: !563)
!563 = !{!564, !565}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !562, file: !326, line: 15, baseType: !29, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !562, file: !326, line: 20, baseType: !566, size: 32, offset: 32)
!566 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !562, file: !326, line: 16, size: 32, elements: !567)
!567 = !{!568, !569}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !566, file: !326, line: 18, baseType: !7, size: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !566, file: !326, line: 19, baseType: !334, size: 32)
!570 = !DISubprogram(name: "hard_locale", scope: !571, file: !571, line: 26, type: !572, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!571 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!572 = !DISubroutineType(types: !573)
!573 = !{!153, !29}
!574 = distinct !DICompileUnit(language: DW_LANG_C99, file: !575, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !30, retainedTypes: !576, nameTableKind: None)
!575 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!576 = !{!577}
!577 = !DISubprogram(name: "rpl_fclose", scope: !578, file: !578, line: 672, type: !579, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!578 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!579 = !DISubroutineType(types: !580)
!580 = !{!29, !581}
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !37, line: 49, size: 1728, elements: !583)
!583 = !{!584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !582, file: !37, line: 51, baseType: !29, size: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !582, file: !37, line: 54, baseType: !25, size: 64, offset: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !582, file: !37, line: 55, baseType: !25, size: 64, offset: 128)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !582, file: !37, line: 56, baseType: !25, size: 64, offset: 192)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !582, file: !37, line: 57, baseType: !25, size: 64, offset: 256)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !582, file: !37, line: 58, baseType: !25, size: 64, offset: 320)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !582, file: !37, line: 59, baseType: !25, size: 64, offset: 384)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !582, file: !37, line: 60, baseType: !25, size: 64, offset: 448)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !582, file: !37, line: 61, baseType: !25, size: 64, offset: 512)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !582, file: !37, line: 64, baseType: !25, size: 64, offset: 576)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !582, file: !37, line: 65, baseType: !25, size: 64, offset: 640)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !582, file: !37, line: 66, baseType: !25, size: 64, offset: 704)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !582, file: !37, line: 68, baseType: !52, size: 64, offset: 768)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !582, file: !37, line: 70, baseType: !581, size: 64, offset: 832)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !582, file: !37, line: 72, baseType: !29, size: 32, offset: 896)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !582, file: !37, line: 73, baseType: !29, size: 32, offset: 928)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !582, file: !37, line: 74, baseType: !58, size: 64, offset: 960)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !582, file: !37, line: 77, baseType: !62, size: 16, offset: 1024)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !582, file: !37, line: 78, baseType: !64, size: 8, offset: 1040)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !582, file: !37, line: 79, baseType: !66, size: 8, offset: 1048)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !582, file: !37, line: 81, baseType: !70, size: 64, offset: 1088)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !582, file: !37, line: 89, baseType: !73, size: 64, offset: 1152)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !582, file: !37, line: 91, baseType: !75, size: 64, offset: 1216)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !582, file: !37, line: 92, baseType: !78, size: 64, offset: 1280)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !582, file: !37, line: 93, baseType: !581, size: 64, offset: 1344)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !582, file: !37, line: 94, baseType: !82, size: 64, offset: 1408)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !582, file: !37, line: 95, baseType: !84, size: 64, offset: 1472)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !582, file: !37, line: 96, baseType: !29, size: 32, offset: 1536)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !582, file: !37, line: 98, baseType: !89, size: 160, offset: 1568)
!613 = distinct !DICompileUnit(language: DW_LANG_C99, file: !614, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !30, retainedTypes: !615, nameTableKind: None)
!614 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!615 = !{!616}
!616 = !DISubprogram(name: "setlocale_null_r", scope: !617, file: !617, line: 64, type: !618, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!617 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!618 = !DISubroutineType(types: !619)
!619 = !{!29, !29, !25, !86}
!620 = distinct !DICompileUnit(language: DW_LANG_C99, file: !621, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !622, retainedTypes: !1009, nameTableKind: None)
!621 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!622 = !{!623}
!623 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !624, line: 41, baseType: !7, size: 32, elements: !625)
!624 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!625 = !{!626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008}
!626 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!627 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!628 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!629 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!630 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!631 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!632 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!633 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!634 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!635 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!636 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!637 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!638 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!639 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!640 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!641 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!642 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!643 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!644 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!645 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!646 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!647 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!648 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!649 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!650 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!651 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!652 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!653 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!654 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!655 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!656 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!657 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!658 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!659 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!660 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!661 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!662 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!663 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!664 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!665 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!666 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!667 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!668 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!669 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!670 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!671 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!672 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!673 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!674 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!675 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!676 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!677 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!678 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!679 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!680 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!681 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!682 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!683 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!684 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!685 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!686 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!687 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!688 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!689 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!690 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!691 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!692 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!693 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!694 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!695 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!696 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!697 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!698 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!699 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!700 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!701 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!702 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!703 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!704 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!705 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!706 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!707 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!708 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!709 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!710 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!711 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!712 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!713 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!714 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!715 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!716 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!717 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!719 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!720 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!721 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!722 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!723 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!724 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!725 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!726 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!727 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!728 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!729 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!730 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!731 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!732 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!733 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!734 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!735 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!736 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!737 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!738 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!739 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!740 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!741 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!742 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!743 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!744 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!745 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!746 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!747 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!748 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!749 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!750 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!751 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!752 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!753 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!754 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!755 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!756 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!757 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!758 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!759 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!760 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!761 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!762 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!763 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!764 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!765 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!766 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!767 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!768 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!769 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!770 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!771 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!772 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!773 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!774 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!779 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!780 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!781 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!782 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!783 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!784 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!785 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!786 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!787 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!788 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!789 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!790 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!791 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!793 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!794 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!795 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!796 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!797 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!798 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!799 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!800 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!801 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!802 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!803 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!804 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!805 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!806 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!807 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!808 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!809 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!810 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!812 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!813 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!814 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!815 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!816 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!817 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!818 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!819 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!820 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!821 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!822 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!823 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!824 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!825 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!826 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!827 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!828 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!829 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!830 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!831 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!832 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!833 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!834 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!835 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!836 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!837 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!838 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!839 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!840 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!841 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!842 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!843 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!844 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!845 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!846 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!847 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!884 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!885 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!886 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!887 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!894 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!895 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!896 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!897 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!898 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!899 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!900 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!901 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!902 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!903 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!904 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!905 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!906 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!907 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!908 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!909 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!910 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!911 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!912 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!913 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!914 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!915 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!916 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!917 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!918 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!919 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!920 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!921 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!922 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!923 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!924 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!925 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!926 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!927 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!928 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!929 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!930 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!931 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!932 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!933 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!934 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!935 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!936 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!937 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!938 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!939 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!940 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!941 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!942 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!943 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!944 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!945 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!946 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!947 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!948 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!949 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!950 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!951 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!952 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!953 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!954 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!955 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!956 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!957 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!958 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!959 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!960 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!961 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!962 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!963 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!964 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!965 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!966 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!967 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!968 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!969 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!970 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!971 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!972 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!973 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!974 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!975 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!976 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!977 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!978 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!979 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!980 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!981 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!982 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!983 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!984 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!985 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!986 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!987 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!988 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!989 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!990 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!991 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!992 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!993 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!994 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!995 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!996 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!997 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!998 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!999 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!1000 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!1001 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!1002 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!1003 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!1004 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!1005 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!1006 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!1007 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!1008 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!1009 = !{!1010, !82}
!1010 = !DISubprogram(name: "nl_langinfo", scope: !624, file: !624, line: 661, type: !1011, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!25, !29}
!1013 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1014, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !30, retainedTypes: !1015, nameTableKind: None)
!1014 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1015 = !{!82, !96}
!1016 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1017, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !30, retainedTypes: !1018, nameTableKind: None)
!1017 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1018 = !{!1019, !1054, !1055, !1058}
!1019 = !DISubprogram(name: "fileno", scope: !32, file: !32, line: 786, type: !1020, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !30)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!29, !1022}
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !37, line: 49, size: 1728, elements: !1024)
!1024 = !{!1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1023, file: !37, line: 51, baseType: !29, size: 32)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1023, file: !37, line: 54, baseType: !25, size: 64, offset: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1023, file: !37, line: 55, baseType: !25, size: 64, offset: 128)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1023, file: !37, line: 56, baseType: !25, size: 64, offset: 192)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1023, file: !37, line: 57, baseType: !25, size: 64, offset: 256)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1023, file: !37, line: 58, baseType: !25, size: 64, offset: 320)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1023, file: !37, line: 59, baseType: !25, size: 64, offset: 384)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1023, file: !37, line: 60, baseType: !25, size: 64, offset: 448)
