; ModuleID = 'coreutils-8.32/src/mknod.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.mode_change = type { i8, i8, i32, i32, i32 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [47 x i8] c"Usage: %s [OPTION]... NAME TYPE [MAJOR MINOR]\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 39, type: !188, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !28, globals: !187, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/mknod.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !14}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !6, line: 25, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "LONGINT_OK", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "LONGINT_INVALID", value: 4, isUnsigned: true)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !15, line: 32, baseType: !7, size: 32, elements: !16)
!15 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27}
!17 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!18 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!19 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!20 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!21 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!22 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!23 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!24 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!25 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!26 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!27 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!28 = !{!29, !39, !100, !104, !108, !111, !114, !121, !136, !33, !90, !140, !144, !150, !154, !161, !164, !168, !7, !173, !176, !179, !182, !184, !175}
!29 = !DISubprogram(name: "dcgettext", scope: !30, file: !30, line: 51, type: !31, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !38)
!30 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!31 = !DISubroutineType(types: !32)
!32 = !{!33, !35, !35, !37}
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!37 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!38 = !{}
!39 = !DISubprogram(name: "fputs_unlocked", scope: !40, file: !40, line: 662, type: !41, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !38)
!40 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!41 = !DISubroutineType(types: !42)
!42 = !{!37, !35, !43}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !45, line: 49, size: 1728, elements: !46)
!45 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!46 = !{!47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !62, !63, !64, !65, !69, !71, !73, !77, !80, !82, !85, !88, !89, !91, !95, !96}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !44, file: !45, line: 51, baseType: !37, size: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !44, file: !45, line: 54, baseType: !33, size: 64, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !44, file: !45, line: 55, baseType: !33, size: 64, offset: 128)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !44, file: !45, line: 56, baseType: !33, size: 64, offset: 192)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !44, file: !45, line: 57, baseType: !33, size: 64, offset: 256)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !44, file: !45, line: 58, baseType: !33, size: 64, offset: 320)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !44, file: !45, line: 59, baseType: !33, size: 64, offset: 384)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !44, file: !45, line: 60, baseType: !33, size: 64, offset: 448)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !44, file: !45, line: 61, baseType: !33, size: 64, offset: 512)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !44, file: !45, line: 64, baseType: !33, size: 64, offset: 576)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !44, file: !45, line: 65, baseType: !33, size: 64, offset: 640)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !44, file: !45, line: 66, baseType: !33, size: 64, offset: 704)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !44, file: !45, line: 68, baseType: !60, size: 64, offset: 768)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !45, line: 36, flags: DIFlagFwdDecl)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !44, file: !45, line: 70, baseType: !43, size: 64, offset: 832)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !44, file: !45, line: 72, baseType: !37, size: 32, offset: 896)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !44, file: !45, line: 73, baseType: !37, size: 32, offset: 928)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !44, file: !45, line: 74, baseType: !66, size: 64, offset: 960)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !67, line: 152, baseType: !68)
!67 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!68 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !44, file: !45, line: 77, baseType: !70, size: 16, offset: 1024)
!70 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !44, file: !45, line: 78, baseType: !72, size: 8, offset: 1040)
!72 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !44, file: !45, line: 79, baseType: !74, size: 8, offset: 1048)
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 8, elements: !75)
!75 = !{!76}
!76 = !DISubrange(count: 1)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !44, file: !45, line: 81, baseType: !78, size: 64, offset: 1088)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !45, line: 43, baseType: null)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !44, file: !45, line: 89, baseType: !81, size: 64, offset: 1152)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !67, line: 153, baseType: !68)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !44, file: !45, line: 91, baseType: !83, size: 64, offset: 1216)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !45, line: 37, flags: DIFlagFwdDecl)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !44, file: !45, line: 92, baseType: !86, size: 64, offset: 1280)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !45, line: 38, flags: DIFlagFwdDecl)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !44, file: !45, line: 93, baseType: !43, size: 64, offset: 1344)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !44, file: !45, line: 94, baseType: !90, size: 64, offset: 1408)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !44, file: !45, line: 95, baseType: !92, size: 64, offset: 1472)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !93, line: 46, baseType: !94)
!93 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!94 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !44, file: !45, line: 96, baseType: !37, size: 32, offset: 1536)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !44, file: !45, line: 98, baseType: !97, size: 160, offset: 1568)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 160, elements: !98)
!98 = !{!99}
!99 = !DISubrange(count: 20)
!100 = !DISubprogram(name: "set_program_name", scope: !101, file: !101, line: 37, type: !102, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !38)
!101 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!102 = !DISubroutineType(types: !103)
!103 = !{null, !35}
!104 = !DISubprogram(name: "setlocale", scope: !105, file: !105, line: 122, type: !106, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !38)
!105 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!106 = !DISubroutineType(types: !107)
!107 = !{!33, !37, !35}
!108 = !DISubprogram(name: "bindtextdomain", scope: !30, file: !30, line: 86, type: !109, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !38)
!109 = !DISubroutineType(types: !110)
!110 = !{!33, !35, !35}
!111 = !DISubprogram(name: "textdomain", scope: !30, file: !30, line: 82, type: !112, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !38)
!112 = !DISubroutineType(types: !113)
!113 = !{!33, !35}
!114 = !DISubprogram(name: "atexit", scope: !115, file: !115, line: 595, type: !116, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !38)
!115 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!116 = !DISubroutineType(types: !117)
!117 = !{!37, !118}
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{null}
!121 = !DISubprogram(name: "getopt_long", scope: !122, file: !122, line: 66, type: !123, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !38)
!122 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!123 = !DISubroutineType(types: !124)
!124 = !{!37, !37, !125, !35, !127, !134}
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !129)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !122, line: 50, size: 256, elements: !130)
!130 = !{!131, !132, !133, !135}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !129, file: !122, line: 52, baseType: !35, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !129, file: !122, line: 55, baseType: !37, size: 32, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !129, file: !122, line: 56, baseType: !134, size: 64, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !129, file: !122, line: 57, baseType: !37, size: 32, offset: 192)
!136 = !DISubprogram(name: "error", scope: !137, file: !137, line: 52, type: !138, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !38)
!137 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!138 = !DISubroutineType(types: !139)
!139 = !{null, !37, !37, !35, null}
!140 = !DISubprogram(name: "version_etc", scope: !141, file: !141, line: 69, type: !142, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !38)
!141 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!142 = !DISubroutineType(types: !143)
!143 = !{null, !43, !35, !35, !35, null}
!144 = !DISubprogram(name: "mode_compile", scope: !145, file: !145, line: 25, type: !146, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !38)
!145 = !DIFile(filename: "./lib/modechange.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!146 = !DISubroutineType(types: !147)
!147 = !{!148, !35}
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "mode_change", file: !145, line: 25, flags: DIFlagFwdDecl)
!150 = !DISubprogram(name: "umask", scope: !151, file: !151, line: 308, type: !152, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !38)
!151 = !DIFile(filename: "/usr/include/sys/stat.h", directory: "")
!152 = !DISubroutineType(types: !153)
!153 = !{!7, !7}
!154 = !DISubprogram(name: "mode_adjust", scope: !145, file: !145, line: 27, type: !155, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !38)
!155 = !DISubroutineType(types: !156)
!156 = !{!7, !7, !157, !7, !158, !160}
!157 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !149)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!161 = !DISubprogram(name: "free", scope: !115, file: !115, line: 565, type: !162, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !38)
!162 = !DISubroutineType(types: !163)
!163 = !{null, !90}
!164 = !DISubprogram(name: "quote", scope: !165, file: !165, line: 44, type: !166, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !38)
!165 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!166 = !DISubroutineType(types: !167)
!167 = !{!35, !35}
!168 = !DISubprogram(name: "xstrtoumax", scope: !6, file: !6, line: 48, type: !169, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !38)
!169 = !DISubroutineType(types: !170)
!170 = !{!5, !35, !171, !37, !172, !35}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !174, line: 59, baseType: !175)
!174 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !67, line: 145, baseType: !94)
!176 = !DISubprogram(name: "quotearg_n_style_colon", scope: !15, file: !15, line: 397, type: !177, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !38)
!177 = !DISubroutineType(types: !178)
!178 = !{!33, !37, !14, !35}
!179 = !DISubprogram(name: "mkfifo", scope: !151, file: !151, line: 346, type: !180, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !38)
!180 = !DISubroutineType(types: !181)
!181 = !{!37, !35, !7}
!182 = !DISubprogram(name: "lchmod", scope: !183, file: !183, line: 993, type: !180, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !38)
!183 = !DIFile(filename: "./lib/sys/stat.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!184 = !DISubprogram(name: "quotearg_style", scope: !15, file: !15, line: 377, type: !185, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !38)
!185 = !DISubroutineType(types: !186)
!186 = !{!33, !14, !35}
!187 = !{!0}
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 1280, elements: !189)
!189 = !{!190}
!190 = !DISubrange(count: 5)
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(name: "Version", scope: !193, file: !194, line: 2, type: !35, isLocal: false, isDefinition: true)
!193 = distinct !DICompileUnit(language: DW_LANG_C99, file: !194, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !38, globals: !195, splitDebugInlining: false, nameTableKind: None)
!194 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!195 = !{!191}
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "file_name", scope: !198, file: !199, line: 46, type: !35, isLocal: true, isDefinition: true)
!198 = distinct !DICompileUnit(language: DW_LANG_C99, file: !199, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !38, retainedTypes: !200, globals: !238, splitDebugInlining: false, nameTableKind: None)
!199 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!200 = !{!201, !29, !237, !136}
!201 = !DISubprogram(name: "close_stream", scope: !202, file: !202, line: 2, type: !203, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !38)
!202 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!203 = !DISubroutineType(types: !204)
!204 = !{!37, !205}
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !45, line: 49, size: 1728, elements: !207)
!207 = !{!208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !206, file: !45, line: 51, baseType: !37, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !206, file: !45, line: 54, baseType: !33, size: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !206, file: !45, line: 55, baseType: !33, size: 64, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !206, file: !45, line: 56, baseType: !33, size: 64, offset: 192)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !206, file: !45, line: 57, baseType: !33, size: 64, offset: 256)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !206, file: !45, line: 58, baseType: !33, size: 64, offset: 320)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !206, file: !45, line: 59, baseType: !33, size: 64, offset: 384)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !206, file: !45, line: 60, baseType: !33, size: 64, offset: 448)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !206, file: !45, line: 61, baseType: !33, size: 64, offset: 512)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !206, file: !45, line: 64, baseType: !33, size: 64, offset: 576)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !206, file: !45, line: 65, baseType: !33, size: 64, offset: 640)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !206, file: !45, line: 66, baseType: !33, size: 64, offset: 704)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !206, file: !45, line: 68, baseType: !60, size: 64, offset: 768)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !206, file: !45, line: 70, baseType: !205, size: 64, offset: 832)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !206, file: !45, line: 72, baseType: !37, size: 32, offset: 896)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !206, file: !45, line: 73, baseType: !37, size: 32, offset: 928)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !206, file: !45, line: 74, baseType: !66, size: 64, offset: 960)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !206, file: !45, line: 77, baseType: !70, size: 16, offset: 1024)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !206, file: !45, line: 78, baseType: !72, size: 8, offset: 1040)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !206, file: !45, line: 79, baseType: !74, size: 8, offset: 1048)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !206, file: !45, line: 81, baseType: !78, size: 64, offset: 1088)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !206, file: !45, line: 89, baseType: !81, size: 64, offset: 1152)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !206, file: !45, line: 91, baseType: !83, size: 64, offset: 1216)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !206, file: !45, line: 92, baseType: !86, size: 64, offset: 1280)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !206, file: !45, line: 93, baseType: !205, size: 64, offset: 1344)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !206, file: !45, line: 94, baseType: !90, size: 64, offset: 1408)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !206, file: !45, line: 95, baseType: !92, size: 64, offset: 1472)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !206, file: !45, line: 96, baseType: !37, size: 32, offset: 1536)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !206, file: !45, line: 98, baseType: !97, size: 160, offset: 1568)
!237 = !DISubprogram(name: "quotearg_colon", scope: !15, file: !15, line: 391, type: !112, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !38)
!238 = !{!196, !239}
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !198, file: !199, line: 56, type: !157, isLocal: true, isDefinition: true)
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(name: "exit_failure", scope: !243, file: !244, line: 24, type: !246, isLocal: false, isDefinition: true)
!243 = distinct !DICompileUnit(language: DW_LANG_C99, file: !244, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !38, globals: !245, splitDebugInlining: false, nameTableKind: None)
!244 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!245 = !{!241}
!246 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !37)
!247 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression())
!248 = distinct !DIGlobalVariable(name: "program_name", scope: !249, file: !250, line: 33, type: !35, isLocal: false, isDefinition: true)
!249 = distinct !DICompileUnit(language: DW_LANG_C99, file: !250, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !38, retainedTypes: !251, globals: !287, splitDebugInlining: false, nameTableKind: None)
!250 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!251 = !{!90, !252, !33}
!252 = !DISubprogram(name: "fputs", scope: !40, file: !40, line: 626, type: !253, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !38)
!253 = !DISubroutineType(types: !254)
!254 = !{!37, !35, !255}
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !45, line: 49, size: 1728, elements: !257)
!257 = !{!258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !256, file: !45, line: 51, baseType: !37, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !256, file: !45, line: 54, baseType: !33, size: 64, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !256, file: !45, line: 55, baseType: !33, size: 64, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !256, file: !45, line: 56, baseType: !33, size: 64, offset: 192)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !256, file: !45, line: 57, baseType: !33, size: 64, offset: 256)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !256, file: !45, line: 58, baseType: !33, size: 64, offset: 320)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !256, file: !45, line: 59, baseType: !33, size: 64, offset: 384)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !256, file: !45, line: 60, baseType: !33, size: 64, offset: 448)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !256, file: !45, line: 61, baseType: !33, size: 64, offset: 512)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !256, file: !45, line: 64, baseType: !33, size: 64, offset: 576)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !256, file: !45, line: 65, baseType: !33, size: 64, offset: 640)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !256, file: !45, line: 66, baseType: !33, size: 64, offset: 704)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !256, file: !45, line: 68, baseType: !60, size: 64, offset: 768)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !256, file: !45, line: 70, baseType: !255, size: 64, offset: 832)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !256, file: !45, line: 72, baseType: !37, size: 32, offset: 896)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !256, file: !45, line: 73, baseType: !37, size: 32, offset: 928)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !256, file: !45, line: 74, baseType: !66, size: 64, offset: 960)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !256, file: !45, line: 77, baseType: !70, size: 16, offset: 1024)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !256, file: !45, line: 78, baseType: !72, size: 8, offset: 1040)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !256, file: !45, line: 79, baseType: !74, size: 8, offset: 1048)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !256, file: !45, line: 81, baseType: !78, size: 64, offset: 1088)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !256, file: !45, line: 89, baseType: !81, size: 64, offset: 1152)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !256, file: !45, line: 91, baseType: !83, size: 64, offset: 1216)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !256, file: !45, line: 92, baseType: !86, size: 64, offset: 1280)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !256, file: !45, line: 93, baseType: !255, size: 64, offset: 1344)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !256, file: !45, line: 94, baseType: !90, size: 64, offset: 1408)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !256, file: !45, line: 95, baseType: !92, size: 64, offset: 1472)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !256, file: !45, line: 96, baseType: !37, size: 32, offset: 1536)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !256, file: !45, line: 98, baseType: !97, size: 160, offset: 1568)
!287 = !{!247}
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !290, file: !291, line: 85, type: !407, isLocal: false, isDefinition: true)
!290 = distinct !DICompileUnit(language: DW_LANG_C99, file: !291, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !292, retainedTypes: !313, globals: !380, splitDebugInlining: false, nameTableKind: None)
!291 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!292 = !{!14, !293, !298}
!293 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !15, line: 242, baseType: !7, size: 32, elements: !294)
!294 = !{!295, !296, !297}
!295 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!296 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!297 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!298 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !299, line: 46, baseType: !7, size: 32, elements: !300)
!299 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!300 = !{!301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312}
!301 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!302 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!303 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!304 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!305 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!306 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!307 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!308 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!309 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!310 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!311 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!312 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!313 = !{!314, !320, !161, !335, !37, !70, !338, !92, !355, !359, !29, !365, !369, !33, !373, !376, !377}
!314 = !DISubprogram(name: "xmemdup", scope: !315, file: !315, line: 62, type: !316, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !38)
!315 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!316 = !DISubroutineType(types: !317)
!317 = !{!90, !318, !94}
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!320 = !DISubprogram(name: "quotearg_alloc_mem", scope: !15, file: !15, line: 342, type: !321, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !38)
!321 = !DISubroutineType(types: !322)
!322 = !{!33, !35, !94, !172, !323}
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !325)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !291, line: 65, size: 448, elements: !326)
!326 = !{!327, !328, !329, !333, !334}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !325, file: !291, line: 68, baseType: !14, size: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !325, file: !291, line: 71, baseType: !37, size: 32, offset: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !325, file: !291, line: 75, baseType: !330, size: 256, offset: 64)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !331)
!331 = !{!332}
!332 = !DISubrange(count: 8)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !325, file: !291, line: 78, baseType: !35, size: 64, offset: 320)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !325, file: !291, line: 81, baseType: !35, size: 64, offset: 384)
!335 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !15, file: !15, line: 408, type: !336, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !38)
!336 = !DISubroutineType(types: !337)
!337 = !{!33, !37, !35, !35, !35, !94}
!338 = !DISubprogram(name: "rpl_mbrtowc", scope: !339, file: !339, line: 717, type: !340, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !38)
!339 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!340 = !DISubroutineType(types: !341)
!341 = !{!94, !134, !35, !94, !342}
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !344, line: 13, size: 64, elements: !345)
!344 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!345 = !{!346, !347}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !343, file: !344, line: 15, baseType: !37, size: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !343, file: !344, line: 20, baseType: !348, size: 32, offset: 32)
!348 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !343, file: !344, line: 16, size: 32, elements: !349)
!349 = !{!350, !351}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !348, file: !344, line: 18, baseType: !7, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !348, file: !344, line: 19, baseType: !352, size: 32)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 32, elements: !353)
!353 = !{!354}
!354 = !DISubrange(count: 4)
!355 = !DISubprogram(name: "iswprint", scope: !356, file: !356, line: 120, type: !357, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !38)
!356 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!357 = !DISubroutineType(types: !358)
!358 = !{!37, !7}
!359 = !DISubprogram(name: "mbsinit", scope: !360, file: !360, line: 292, type: !361, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !38)
!360 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!361 = !DISubroutineType(types: !362)
!362 = !{!37, !363}
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !343)
!365 = !DISubprogram(name: "locale_charset", scope: !366, file: !366, line: 35, type: !367, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !38)
!366 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!367 = !DISubroutineType(types: !368)
!368 = !{!35}
!369 = !DISubprogram(name: "c_strcasecmp", scope: !370, file: !370, line: 42, type: !371, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !38)
!370 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!371 = !DISubroutineType(types: !372)
!372 = !{!37, !35, !35}
!373 = !DISubprogram(name: "xmalloc", scope: !315, file: !315, line: 53, type: !374, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !38)
!374 = !DISubroutineType(types: !375)
!375 = !{!90, !94}
!376 = !DISubprogram(name: "xalloc_die", scope: !315, file: !315, line: 51, type: !119, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !38)
!377 = !DISubprogram(name: "xrealloc", scope: !315, file: !315, line: 59, type: !378, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !38)
!378 = !DISubroutineType(types: !379)
!379 = !{!90, !90, !94}
!380 = !{!288, !381, !387, !389, !391, !396, !403, !405}
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !290, file: !291, line: 101, type: !383, isLocal: false, isDefinition: true)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, size: 320, elements: !385)
!384 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!385 = !{!386}
!386 = !DISubrange(count: 10)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !290, file: !291, line: 1052, type: !325, isLocal: false, isDefinition: true)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !290, file: !291, line: 116, type: !325, isLocal: true, isDefinition: true)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "slot0", scope: !290, file: !291, line: 842, type: !393, isLocal: true, isDefinition: true)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 2048, elements: !394)
!394 = !{!395}
!395 = !DISubrange(count: 256)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(name: "slotvec", scope: !290, file: !291, line: 845, type: !398, isLocal: true, isDefinition: true)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !291, line: 834, size: 128, elements: !400)
!400 = !{!401, !402}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !399, file: !291, line: 836, baseType: !92, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !399, file: !291, line: 837, baseType: !33, size: 64, offset: 64)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(name: "nslots", scope: !290, file: !291, line: 843, type: !37, isLocal: true, isDefinition: true)
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(name: "slotvec0", scope: !290, file: !291, line: 844, type: !399, isLocal: true, isDefinition: true)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !408, size: 704, elements: !409)
!408 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!409 = !{!410}
!410 = !DISubrange(count: 11)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !413, file: !414, line: 26, type: !416, isLocal: false, isDefinition: true)
!413 = distinct !DICompileUnit(language: DW_LANG_C99, file: !414, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !38, globals: !415, splitDebugInlining: false, nameTableKind: None)
!414 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!415 = !{!411}
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 376, elements: !417)
!417 = !{!418}
!418 = !DISubrange(count: 47)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(name: "fmt", scope: !421, file: !422, line: 80, type: !487, isLocal: true, isDefinition: true)
!421 = distinct !DISubprogram(name: "lchmod", scope: !422, file: !422, line: 46, type: !423, scopeLine: 47, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !427, retainedNodes: !439)
!422 = !DIFile(filename: "lib/lchmod.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!423 = !DISubroutineType(types: !424)
!424 = !{!37, !35, !425}
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !174, line: 69, baseType: !426)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !67, line: 150, baseType: !7)
!427 = distinct !DICompileUnit(language: DW_LANG_C99, file: !422, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !38, retainedTypes: !428, globals: !438, splitDebugInlining: false, nameTableKind: None)
!428 = !{!429, !433, !437}
!429 = !DISubprogram(name: "open", scope: !430, file: !430, line: 196, type: !431, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !38)
!430 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
!431 = !DISubroutineType(types: !432)
!432 = !{!37, !35, !37, null}
!433 = !DISubprogram(name: "close", scope: !434, file: !434, line: 353, type: !435, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !38)
!434 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!435 = !DISubroutineType(types: !436)
!436 = !{!37, !37}
!437 = !DISubprogram(name: "chmod", scope: !151, file: !151, line: 280, type: !180, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !38)
!438 = !{!419}
!439 = !{!440, !441, !442, !443, !478, !481, !485, !486}
!440 = !DILocalVariable(name: "file", arg: 1, scope: !421, file: !422, line: 46, type: !35)
!441 = !DILocalVariable(name: "mode", arg: 2, scope: !421, file: !422, line: 46, type: !425)
!442 = !DILocalVariable(name: "fd", scope: !421, file: !422, line: 53, type: !37)
!443 = !DILocalVariable(name: "st", scope: !421, file: !422, line: 64, type: !444)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !445, line: 46, size: 1152, elements: !446)
!445 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "")
!446 = !{!447, !448, !450, !452, !453, !455, !457, !458, !459, !460, !462, !464, !472, !473, !474}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !444, file: !445, line: 48, baseType: !175, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !444, file: !445, line: 53, baseType: !449, size: 64, offset: 64)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !67, line: 148, baseType: !94)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !444, file: !445, line: 61, baseType: !451, size: 64, offset: 128)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !67, line: 151, baseType: !94)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !444, file: !445, line: 62, baseType: !426, size: 32, offset: 192)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !444, file: !445, line: 64, baseType: !454, size: 32, offset: 224)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !67, line: 146, baseType: !7)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !444, file: !445, line: 65, baseType: !456, size: 32, offset: 256)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !67, line: 147, baseType: !7)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !444, file: !445, line: 67, baseType: !37, size: 32, offset: 288)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !444, file: !445, line: 69, baseType: !175, size: 64, offset: 320)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !444, file: !445, line: 74, baseType: !66, size: 64, offset: 384)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !444, file: !445, line: 78, baseType: !461, size: 64, offset: 448)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !67, line: 174, baseType: !68)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !444, file: !445, line: 80, baseType: !463, size: 64, offset: 512)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !67, line: 179, baseType: !68)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !444, file: !445, line: 91, baseType: !465, size: 128, offset: 576)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !466, line: 10, size: 128, elements: !467)
!466 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!467 = !{!468, !470}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !465, file: !466, line: 12, baseType: !469, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !67, line: 160, baseType: !68)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !465, file: !466, line: 16, baseType: !471, size: 64, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !67, line: 196, baseType: !68)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !444, file: !445, line: 92, baseType: !465, size: 128, offset: 704)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !444, file: !445, line: 93, baseType: !465, size: 128, offset: 832)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !444, file: !445, line: 106, baseType: !475, size: 192, offset: 960)
!475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !471, size: 192, elements: !476)
!476 = !{!477}
!477 = !DISubrange(count: 3)
!478 = !DILocalVariable(name: "stat_errno", scope: !479, file: !422, line: 67, type: !37)
!479 = distinct !DILexicalBlock(scope: !480, file: !422, line: 66, column: 5)
!480 = distinct !DILexicalBlock(scope: !421, file: !422, line: 65, column: 7)
!481 = !DILocalVariable(name: "buf", scope: !421, file: !422, line: 81, type: !482)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 208, elements: !483)
!483 = !{!484}
!484 = !DISubrange(count: 26)
!485 = !DILocalVariable(name: "chmod_result", scope: !421, file: !422, line: 83, type: !37)
!486 = !DILocalVariable(name: "chmod_errno", scope: !421, file: !422, line: 84, type: !37)
!487 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 136, elements: !488)
!488 = !{!489}
!489 = !DISubrange(count: 17)
!490 = distinct !DICompileUnit(language: DW_LANG_C99, file: !491, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !38, splitDebugInlining: false, nameTableKind: None)
!491 = !DIFile(filename: "src/selinux.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!492 = distinct !DICompileUnit(language: DW_LANG_C99, file: !493, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !494, retainedTypes: !501, splitDebugInlining: false, nameTableKind: None)
!493 = !DIFile(filename: "lib/modechange.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!494 = !{!495}
!495 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !493, line: 78, baseType: !7, size: 32, elements: !496)
!496 = !{!497, !498, !499, !500}
!497 = !DIEnumerator(name: "MODE_DONE", value: 0, isUnsigned: true)
!498 = !DIEnumerator(name: "MODE_ORDINARY_CHANGE", value: 1, isUnsigned: true)
!499 = !DIEnumerator(name: "MODE_X_IF_ANY_X", value: 2, isUnsigned: true)
!500 = !DIEnumerator(name: "MODE_COPY_EXISTING", value: 3, isUnsigned: true)
!501 = !{!161, !373, !92, !376}
!502 = distinct !DICompileUnit(language: DW_LANG_C99, file: !503, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !504, retainedTypes: !508, splitDebugInlining: false, nameTableKind: None)
!503 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!504 = !{!505}
!505 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !503, line: 40, baseType: !7, size: 32, elements: !506)
!506 = !{!507}
!507 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!508 = !{!29, !509, !90}
!509 = !DISubprogram(name: "fputs_unlocked", scope: !40, file: !40, line: 662, type: !510, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !38)
!510 = !DISubroutineType(types: !511)
!511 = !{!37, !35, !512}
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !45, line: 49, size: 1728, elements: !514)
!514 = !{!515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !513, file: !45, line: 51, baseType: !37, size: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !513, file: !45, line: 54, baseType: !33, size: 64, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !513, file: !45, line: 55, baseType: !33, size: 64, offset: 128)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !513, file: !45, line: 56, baseType: !33, size: 64, offset: 192)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !513, file: !45, line: 57, baseType: !33, size: 64, offset: 256)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !513, file: !45, line: 58, baseType: !33, size: 64, offset: 320)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !513, file: !45, line: 59, baseType: !33, size: 64, offset: 384)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !513, file: !45, line: 60, baseType: !33, size: 64, offset: 448)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !513, file: !45, line: 61, baseType: !33, size: 64, offset: 512)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !513, file: !45, line: 64, baseType: !33, size: 64, offset: 576)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !513, file: !45, line: 65, baseType: !33, size: 64, offset: 640)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !513, file: !45, line: 66, baseType: !33, size: 64, offset: 704)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !513, file: !45, line: 68, baseType: !60, size: 64, offset: 768)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !513, file: !45, line: 70, baseType: !512, size: 64, offset: 832)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !513, file: !45, line: 72, baseType: !37, size: 32, offset: 896)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !513, file: !45, line: 73, baseType: !37, size: 32, offset: 928)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !513, file: !45, line: 74, baseType: !66, size: 64, offset: 960)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !513, file: !45, line: 77, baseType: !70, size: 16, offset: 1024)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !513, file: !45, line: 78, baseType: !72, size: 8, offset: 1040)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !513, file: !45, line: 79, baseType: !74, size: 8, offset: 1048)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !513, file: !45, line: 81, baseType: !78, size: 64, offset: 1088)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !513, file: !45, line: 89, baseType: !81, size: 64, offset: 1152)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !513, file: !45, line: 91, baseType: !83, size: 64, offset: 1216)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !513, file: !45, line: 92, baseType: !86, size: 64, offset: 1280)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !513, file: !45, line: 93, baseType: !512, size: 64, offset: 1344)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !513, file: !45, line: 94, baseType: !90, size: 64, offset: 1408)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !513, file: !45, line: 95, baseType: !92, size: 64, offset: 1472)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !513, file: !45, line: 96, baseType: !37, size: 32, offset: 1536)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !513, file: !45, line: 98, baseType: !97, size: 160, offset: 1568)
!544 = distinct !DICompileUnit(language: DW_LANG_C99, file: !545, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !546, retainedTypes: !559, splitDebugInlining: false, nameTableKind: None)
!545 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!546 = !{!547}
!547 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !548, file: !315, line: 186, baseType: !7, size: 32, elements: !557)
!548 = distinct !DISubprogram(name: "x2nrealloc", scope: !315, file: !315, line: 174, type: !549, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !544, retainedNodes: !552)
!549 = !DISubroutineType(types: !550)
!550 = !{!90, !90, !551, !92}
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!552 = !{!553, !554, !555, !556}
!553 = !DILocalVariable(name: "p", arg: 1, scope: !548, file: !315, line: 174, type: !90)
!554 = !DILocalVariable(name: "pn", arg: 2, scope: !548, file: !315, line: 174, type: !551)
!555 = !DILocalVariable(name: "s", arg: 3, scope: !548, file: !315, line: 174, type: !92)
!556 = !DILocalVariable(name: "n", scope: !548, file: !315, line: 176, type: !92)
!557 = !{!558}
!558 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!559 = !{!92, !376, !373, !377, !33, !161, !90, !560, !563}
!560 = !DISubprogram(name: "xcalloc", scope: !315, file: !315, line: 57, type: !561, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !38)
!561 = !DISubroutineType(types: !562)
!562 = !{!90, !94, !94}
!563 = !DISubprogram(name: "rpl_calloc", scope: !564, file: !564, line: 688, type: !561, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !38)
!564 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!565 = distinct !DICompileUnit(language: DW_LANG_C99, file: !566, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !38, retainedTypes: !567, splitDebugInlining: false, nameTableKind: None)
!566 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!567 = !{!29, !136}
!568 = distinct !DICompileUnit(language: DW_LANG_C99, file: !569, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !570, retainedTypes: !571, splitDebugInlining: false, nameTableKind: None)
!569 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!570 = !{!5, !298}
!571 = !{!37, !70}
!572 = distinct !DICompileUnit(language: DW_LANG_C99, file: !573, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !38, retainedTypes: !574, splitDebugInlining: false, nameTableKind: None)
!573 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!574 = !{!90}
!575 = distinct !DICompileUnit(language: DW_LANG_C99, file: !576, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !38, retainedTypes: !577, splitDebugInlining: false, nameTableKind: None)
!576 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!577 = !{!578, !92, !590}
!578 = !DISubprogram(name: "mbrtowc", scope: !360, file: !360, line: 296, type: !579, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !38)
!579 = !DISubroutineType(types: !580)
!580 = !{!94, !134, !35, !94, !581}
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !344, line: 13, size: 64, elements: !583)
!583 = !{!584, !585}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !582, file: !344, line: 15, baseType: !37, size: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !582, file: !344, line: 20, baseType: !586, size: 32, offset: 32)
!586 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !582, file: !344, line: 16, size: 32, elements: !587)
!587 = !{!588, !589}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !586, file: !344, line: 18, baseType: !7, size: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !586, file: !344, line: 19, baseType: !352, size: 32)
!590 = !DISubprogram(name: "hard_locale", scope: !591, file: !591, line: 26, type: !592, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !38)
!591 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!592 = !DISubroutineType(types: !593)
!593 = !{!157, !37}
!594 = distinct !DICompileUnit(language: DW_LANG_C99, file: !595, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !38, retainedTypes: !596, splitDebugInlining: false, nameTableKind: None)
!595 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!596 = !{!597}
!597 = !DISubprogram(name: "rpl_fclose", scope: !598, file: !598, line: 672, type: !599, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !38)
!598 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!599 = !DISubroutineType(types: !600)
!600 = !{!37, !601}
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !45, line: 49, size: 1728, elements: !603)
!603 = !{!604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !602, file: !45, line: 51, baseType: !37, size: 32)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !602, file: !45, line: 54, baseType: !33, size: 64, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !602, file: !45, line: 55, baseType: !33, size: 64, offset: 128)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !602, file: !45, line: 56, baseType: !33, size: 64, offset: 192)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !602, file: !45, line: 57, baseType: !33, size: 64, offset: 256)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !602, file: !45, line: 58, baseType: !33, size: 64, offset: 320)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !602, file: !45, line: 59, baseType: !33, size: 64, offset: 384)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !602, file: !45, line: 60, baseType: !33, size: 64, offset: 448)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !602, file: !45, line: 61, baseType: !33, size: 64, offset: 512)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !602, file: !45, line: 64, baseType: !33, size: 64, offset: 576)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !602, file: !45, line: 65, baseType: !33, size: 64, offset: 640)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !602, file: !45, line: 66, baseType: !33, size: 64, offset: 704)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !602, file: !45, line: 68, baseType: !60, size: 64, offset: 768)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !602, file: !45, line: 70, baseType: !601, size: 64, offset: 832)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !602, file: !45, line: 72, baseType: !37, size: 32, offset: 896)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !602, file: !45, line: 73, baseType: !37, size: 32, offset: 928)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !602, file: !45, line: 74, baseType: !66, size: 64, offset: 960)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !602, file: !45, line: 77, baseType: !70, size: 16, offset: 1024)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !602, file: !45, line: 78, baseType: !72, size: 8, offset: 1040)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !602, file: !45, line: 79, baseType: !74, size: 8, offset: 1048)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !602, file: !45, line: 81, baseType: !78, size: 64, offset: 1088)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !602, file: !45, line: 89, baseType: !81, size: 64, offset: 1152)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !602, file: !45, line: 91, baseType: !83, size: 64, offset: 1216)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !602, file: !45, line: 92, baseType: !86, size: 64, offset: 1280)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !602, file: !45, line: 93, baseType: !601, size: 64, offset: 1344)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !602, file: !45, line: 94, baseType: !90, size: 64, offset: 1408)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !602, file: !45, line: 95, baseType: !92, size: 64, offset: 1472)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !602, file: !45, line: 96, baseType: !37, size: 32, offset: 1536)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !602, file: !45, line: 98, baseType: !97, size: 160, offset: 1568)
!633 = distinct !DICompileUnit(language: DW_LANG_C99, file: !634, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !38, retainedTypes: !635, splitDebugInlining: false, nameTableKind: None)
!634 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!635 = !{!636}
!636 = !DISubprogram(name: "setlocale_null_r", scope: !637, file: !637, line: 64, type: !638, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !38)
!637 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!638 = !DISubroutineType(types: !639)
!639 = !{!37, !37, !33, !94}
!640 = distinct !DICompileUnit(language: DW_LANG_C99, file: !641, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !642, retainedTypes: !1029, splitDebugInlining: false, nameTableKind: None)
!641 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!642 = !{!643}
!643 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !644, line: 41, baseType: !7, size: 32, elements: !645)
!644 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!645 = !{!646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028}
!646 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!647 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!648 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!649 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!650 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!651 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!652 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!653 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!654 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!655 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!656 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!657 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!658 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!659 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!660 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!661 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!662 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!663 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!664 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!665 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!666 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!667 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!668 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!669 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!670 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!671 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!672 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!673 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!674 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!675 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!676 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!677 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!678 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!679 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!680 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!681 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!682 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!683 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!684 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!685 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!686 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!687 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!688 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!689 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!690 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!691 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!692 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!693 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!694 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!695 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!696 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!697 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!698 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!699 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!700 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!701 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!702 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!703 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!704 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!705 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!706 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!707 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!708 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!709 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!710 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!711 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!712 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!713 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!714 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!715 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!716 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!717 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!719 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!720 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!721 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!722 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!723 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!724 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!725 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!726 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!727 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!728 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!729 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!730 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!731 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!732 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!733 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!734 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!735 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!736 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!737 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!738 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!739 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!740 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!741 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!742 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!743 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!744 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!745 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!746 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!747 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!748 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!749 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!750 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!751 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!752 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!753 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!754 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!755 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!756 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!757 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!758 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!759 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!760 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!761 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!762 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!763 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!764 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!765 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!766 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!767 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!768 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!769 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!770 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!771 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!772 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!773 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!774 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!779 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!780 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!781 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!782 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!783 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!784 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!785 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!786 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!787 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!788 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!789 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!790 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!791 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!793 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!794 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!795 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!796 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!797 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!798 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!799 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!800 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!801 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!802 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!803 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!804 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!805 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!806 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!807 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!808 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!809 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!810 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!812 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!813 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!814 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!815 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!816 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!817 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!818 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!819 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!820 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!821 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!822 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!823 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!824 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!825 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!826 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!827 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!828 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!829 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!830 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!831 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!832 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!833 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!834 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!835 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!836 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!837 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!838 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!839 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!840 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!841 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!842 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!843 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!844 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!845 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!846 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!847 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!884 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!885 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!886 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!887 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!894 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!895 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!896 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!898 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!899 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!900 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!901 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!902 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!903 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!904 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!905 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!906 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!907 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!908 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!909 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!910 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!911 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!912 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!913 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!914 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!915 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!916 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!917 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!918 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!919 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!920 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!921 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!922 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!923 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!924 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!925 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!926 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!927 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!928 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!929 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!930 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!931 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!932 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!933 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!934 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!935 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!936 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!937 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!938 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!939 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!940 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!941 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!942 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!943 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!944 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!945 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!946 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!947 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!948 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!949 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!950 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!951 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!952 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!953 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!954 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!955 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!956 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!957 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!958 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!959 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!960 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!961 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!962 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!963 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!964 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!965 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!966 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!967 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!968 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!969 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!970 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!971 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!972 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!973 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!974 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!975 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!976 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!977 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!978 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!979 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!980 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!981 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!982 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!983 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!984 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!985 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!986 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!987 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!988 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!989 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!990 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!991 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!992 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!993 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!994 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!995 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!996 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!997 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!998 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!999 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!1000 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!1001 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!1002 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!1003 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!1004 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!1005 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!1006 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!1007 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!1008 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!1009 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!1010 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!1011 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!1012 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!1013 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!1014 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!1015 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!1016 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!1017 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!1018 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!1019 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!1020 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!1021 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!1022 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!1023 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!1024 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!1025 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!1026 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!1027 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!1028 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!1029 = !{!1030, !90}
!1030 = !DISubprogram(name: "nl_langinfo", scope: !644, file: !644, line: 661, type: !1031, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !38)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!33, !37}
!1033 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1034, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !38, retainedTypes: !1035, splitDebugInlining: false, nameTableKind: None)
!1034 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1035 = !{!90, !104}
!1036 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1037, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !38, retainedTypes: !1038, splitDebugInlining: false, nameTableKind: None)
