source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.infomap = type { i8*, i8* }
%struct.isaac = type { i64, %struct.isaac_state, %union.anon.0 }
%struct.isaac_state = type { [256 x i64], i64, i64, i64 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.randint_source = type { %struct.randread_source*, i64, i64 }
%struct.randread_source = type { %struct._IO_FILE*, void (i8*)*, i8*, %union.anon.35 }
%struct.slotvec = type { i64, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%union.anon = type { i32 }
%union.anon.0 = type { [256 x i64] }
%union.anon.35 = type { %struct.isaac }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 48, type: !164, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !158, nameTableKind: None)
!3 = !DIFile(filename: "src/mktemp.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{}
!5 = !{!6, !15, !76, !80, !84, !87, !90, !97, !10, !66, !112, !116, !120, !124, !126, !128, !129, !134, !137, !141, !144, !148, !149, !151, !154}
!6 = !DISubprogram(name: "dcgettext", scope: !7, file: !7, line: 51, type: !8, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!7 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!8 = !DISubroutineType(types: !9)
!9 = !{!10, !12, !12, !14}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!14 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!15 = !DISubprogram(name: "fputs_unlocked", scope: !16, file: !16, line: 662, type: !17, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!16 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!17 = !DISubroutineType(types: !18)
!18 = !{!14, !12, !19}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !22)
!21 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!22 = !{!23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !38, !39, !40, !41, !45, !47, !49, !53, !56, !58, !61, !64, !65, !67, !71, !72}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !20, file: !21, line: 51, baseType: !14, size: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !20, file: !21, line: 54, baseType: !10, size: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !20, file: !21, line: 55, baseType: !10, size: 64, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !20, file: !21, line: 56, baseType: !10, size: 64, offset: 192)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !20, file: !21, line: 57, baseType: !10, size: 64, offset: 256)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !20, file: !21, line: 58, baseType: !10, size: 64, offset: 320)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !20, file: !21, line: 59, baseType: !10, size: 64, offset: 384)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !20, file: !21, line: 60, baseType: !10, size: 64, offset: 448)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !20, file: !21, line: 61, baseType: !10, size: 64, offset: 512)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !20, file: !21, line: 64, baseType: !10, size: 64, offset: 576)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !20, file: !21, line: 65, baseType: !10, size: 64, offset: 640)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !20, file: !21, line: 66, baseType: !10, size: 64, offset: 704)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !20, file: !21, line: 68, baseType: !36, size: 64, offset: 768)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !21, line: 36, flags: DIFlagFwdDecl)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !20, file: !21, line: 70, baseType: !19, size: 64, offset: 832)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !20, file: !21, line: 72, baseType: !14, size: 32, offset: 896)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !20, file: !21, line: 73, baseType: !14, size: 32, offset: 928)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !20, file: !21, line: 74, baseType: !42, size: 64, offset: 960)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !43, line: 152, baseType: !44)
!43 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!44 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !20, file: !21, line: 77, baseType: !46, size: 16, offset: 1024)
!46 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !20, file: !21, line: 78, baseType: !48, size: 8, offset: 1040)
!48 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !20, file: !21, line: 79, baseType: !50, size: 8, offset: 1048)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 8, elements: !51)
!51 = !{!52}
!52 = !DISubrange(count: 1)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !20, file: !21, line: 81, baseType: !54, size: 64, offset: 1088)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !21, line: 43, baseType: null)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !20, file: !21, line: 89, baseType: !57, size: 64, offset: 1152)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !43, line: 153, baseType: !44)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !20, file: !21, line: 91, baseType: !59, size: 64, offset: 1216)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !21, line: 37, flags: DIFlagFwdDecl)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !20, file: !21, line: 92, baseType: !62, size: 64, offset: 1280)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !21, line: 38, flags: DIFlagFwdDecl)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !20, file: !21, line: 93, baseType: !19, size: 64, offset: 1344)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !20, file: !21, line: 94, baseType: !66, size: 64, offset: 1408)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !20, file: !21, line: 95, baseType: !68, size: 64, offset: 1472)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !69, line: 46, baseType: !70)
!69 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!70 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !20, file: !21, line: 96, baseType: !14, size: 32, offset: 1536)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !20, file: !21, line: 98, baseType: !73, size: 160, offset: 1568)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 160, elements: !74)
!74 = !{!75}
!75 = !DISubrange(count: 20)
!76 = !DISubprogram(name: "set_program_name", scope: !77, file: !77, line: 37, type: !78, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!77 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!78 = !DISubroutineType(types: !79)
!79 = !{null, !12}
!80 = !DISubprogram(name: "setlocale", scope: !81, file: !81, line: 122, type: !82, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!81 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!82 = !DISubroutineType(types: !83)
!83 = !{!10, !14, !12}
!84 = !DISubprogram(name: "bindtextdomain", scope: !7, file: !7, line: 86, type: !85, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!85 = !DISubroutineType(types: !86)
!86 = !{!10, !12, !12}
!87 = !DISubprogram(name: "textdomain", scope: !7, file: !7, line: 82, type: !88, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!88 = !DISubroutineType(types: !89)
!89 = !{!10, !12}
!90 = !DISubprogram(name: "atexit", scope: !91, file: !91, line: 595, type: !92, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!91 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!92 = !DISubroutineType(types: !93)
!93 = !{!14, !94}
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DISubroutineType(types: !96)
!96 = !{null}
!97 = !DISubprogram(name: "getopt_long", scope: !98, file: !98, line: 66, type: !99, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!98 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!99 = !DISubroutineType(types: !100)
!100 = !{!14, !14, !101, !12, !103, !110}
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !105)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !98, line: 50, size: 256, elements: !106)
!106 = !{!107, !108, !109, !111}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !105, file: !98, line: 52, baseType: !12, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !105, file: !98, line: 55, baseType: !14, size: 32, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !105, file: !98, line: 56, baseType: !110, size: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !105, file: !98, line: 57, baseType: !14, size: 32, offset: 192)
!112 = !DISubprogram(name: "version_etc", scope: !113, file: !113, line: 69, type: !114, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!113 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!114 = !DISubroutineType(types: !115)
!115 = !{null, !19, !12, !12, !12, null}
!116 = !DISubprogram(name: "error", scope: !117, file: !117, line: 52, type: !118, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!117 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!118 = !DISubroutineType(types: !119)
!119 = !{null, !14, !14, !12, null}
!120 = !DISubprogram(name: "quote", scope: !121, file: !121, line: 44, type: !122, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!121 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!122 = !DISubroutineType(types: !123)
!123 = !{!12, !12}
!124 = !DISubprogram(name: "xstrdup", scope: !125, file: !125, line: 64, type: !88, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!125 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!126 = !DISubprogram(name: "last_component", scope: !127, file: !127, line: 46, type: !88, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!127 = !DIFile(filename: "./lib/dirname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!128 = !DISubprogram(name: "getenv", scope: !91, file: !91, line: 634, type: !88, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!129 = !DISubprogram(name: "file_name_concat", scope: !130, file: !130, line: 22, type: !131, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!130 = !DIFile(filename: "./lib/filenamecat.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!131 = !DISubroutineType(types: !132)
!132 = !{!10, !12, !12, !133}
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!134 = !DISubprogram(name: "free", scope: !91, file: !91, line: 565, type: !135, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!135 = !DISubroutineType(types: !136)
!136 = !{null, !66}
!137 = !DISubprogram(name: "close", scope: !138, file: !138, line: 353, type: !139, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!138 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!139 = !DISubroutineType(types: !140)
!140 = !{!14, !14}
!141 = !DISubprogram(name: "puts", scope: !16, file: !16, line: 632, type: !142, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!142 = !DISubroutineType(types: !143)
!143 = !{!14, !12}
!144 = !DISubprogram(name: "close_stream", scope: !145, file: !145, line: 2, type: !146, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!145 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!146 = !DISubroutineType(types: !147)
!147 = !{!14, !19}
!148 = !DISubprogram(name: "remove", scope: !16, file: !16, line: 146, type: !142, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!149 = !DISubprogram(name: "close_stdout", scope: !150, file: !150, line: 30, type: !95, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!150 = !DIFile(filename: "./lib/closeout.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!151 = !DISubprogram(name: "xmalloc", scope: !125, file: !125, line: 53, type: !152, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!152 = !DISubroutineType(types: !153)
!153 = !{!66, !70}
!154 = !DISubprogram(name: "gen_tempname_len", scope: !155, file: !155, line: 53, type: !156, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!155 = !DIFile(filename: "./lib/tempname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!156 = !DISubroutineType(types: !157)
!157 = !{!14, !10, !14, !14, !14, !70}
!158 = !{!159, !0, !162}
!159 = !DIGlobalVariableExpression(var: !160, expr: !DIExpression())
!160 = distinct !DIGlobalVariable(name: "stdout_closed", scope: !2, file: !3, line: 130, type: !161, isLocal: true, isDefinition: true)
!161 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(name: "default_template", scope: !2, file: !3, line: 39, type: !12, isLocal: true, isDefinition: true)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 2048, elements: !165)
!165 = !{!166}
!166 = !DISubrange(count: 8)
!167 = !DIGlobalVariableExpression(var: !160, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "Version", scope: !170, file: !171, line: 2, type: !12, isDefinition: true)
!170 = distinct !DICompileUnit(language: DW_LANG_C99, file: !171, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, globals: !172, nameTableKind: None)
!171 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!172 = !{!168}
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(name: "file_name", scope: !175, file: !176, line: 46, type: !12, isLocal: true, isDefinition: true)
!175 = distinct !DICompileUnit(language: DW_LANG_C99, file: !176, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !177, globals: !215, nameTableKind: None)
!176 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!177 = !{!178, !6, !213, !116}
!178 = !DISubprogram(name: "close_stream", scope: !145, file: !145, line: 2, type: !179, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!179 = !DISubroutineType(types: !180)
!180 = !{!14, !181}
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !183)
!183 = !{!184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !182, file: !21, line: 51, baseType: !14, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !182, file: !21, line: 54, baseType: !10, size: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !182, file: !21, line: 55, baseType: !10, size: 64, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !182, file: !21, line: 56, baseType: !10, size: 64, offset: 192)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !182, file: !21, line: 57, baseType: !10, size: 64, offset: 256)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !182, file: !21, line: 58, baseType: !10, size: 64, offset: 320)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !182, file: !21, line: 59, baseType: !10, size: 64, offset: 384)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !182, file: !21, line: 60, baseType: !10, size: 64, offset: 448)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !182, file: !21, line: 61, baseType: !10, size: 64, offset: 512)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !182, file: !21, line: 64, baseType: !10, size: 64, offset: 576)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !182, file: !21, line: 65, baseType: !10, size: 64, offset: 640)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !182, file: !21, line: 66, baseType: !10, size: 64, offset: 704)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !182, file: !21, line: 68, baseType: !36, size: 64, offset: 768)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !182, file: !21, line: 70, baseType: !181, size: 64, offset: 832)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !182, file: !21, line: 72, baseType: !14, size: 32, offset: 896)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !182, file: !21, line: 73, baseType: !14, size: 32, offset: 928)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !182, file: !21, line: 74, baseType: !42, size: 64, offset: 960)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !182, file: !21, line: 77, baseType: !46, size: 16, offset: 1024)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !182, file: !21, line: 78, baseType: !48, size: 8, offset: 1040)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !182, file: !21, line: 79, baseType: !50, size: 8, offset: 1048)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !182, file: !21, line: 81, baseType: !54, size: 64, offset: 1088)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !182, file: !21, line: 89, baseType: !57, size: 64, offset: 1152)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !182, file: !21, line: 91, baseType: !59, size: 64, offset: 1216)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !182, file: !21, line: 92, baseType: !62, size: 64, offset: 1280)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !182, file: !21, line: 93, baseType: !181, size: 64, offset: 1344)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !182, file: !21, line: 94, baseType: !66, size: 64, offset: 1408)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !182, file: !21, line: 95, baseType: !68, size: 64, offset: 1472)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !182, file: !21, line: 96, baseType: !14, size: 32, offset: 1536)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !182, file: !21, line: 98, baseType: !73, size: 160, offset: 1568)
!213 = !DISubprogram(name: "quotearg_colon", scope: !214, file: !214, line: 391, type: !88, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!214 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!215 = !{!173, !216}
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !175, file: !176, line: 56, type: !161, isLocal: true, isDefinition: true)
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(name: "exit_failure", scope: !220, file: !221, line: 24, type: !223, isDefinition: true)
!220 = distinct !DICompileUnit(language: DW_LANG_C99, file: !221, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, globals: !222, nameTableKind: None)
!221 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!222 = !{!218}
!223 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !14)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(name: "program_name", scope: !226, file: !227, line: 33, type: !12, isDefinition: true)
!226 = distinct !DICompileUnit(language: DW_LANG_C99, file: !227, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !228, globals: !264, nameTableKind: None)
!227 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!228 = !{!66, !229, !10}
!229 = !DISubprogram(name: "fputs", scope: !16, file: !16, line: 626, type: !230, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!230 = !DISubroutineType(types: !231)
!231 = !{!14, !12, !232}
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !234)
!234 = !{!235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !233, file: !21, line: 51, baseType: !14, size: 32)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !233, file: !21, line: 54, baseType: !10, size: 64, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !233, file: !21, line: 55, baseType: !10, size: 64, offset: 128)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !233, file: !21, line: 56, baseType: !10, size: 64, offset: 192)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !233, file: !21, line: 57, baseType: !10, size: 64, offset: 256)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !233, file: !21, line: 58, baseType: !10, size: 64, offset: 320)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !233, file: !21, line: 59, baseType: !10, size: 64, offset: 384)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !233, file: !21, line: 60, baseType: !10, size: 64, offset: 448)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !233, file: !21, line: 61, baseType: !10, size: 64, offset: 512)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !233, file: !21, line: 64, baseType: !10, size: 64, offset: 576)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !233, file: !21, line: 65, baseType: !10, size: 64, offset: 640)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !233, file: !21, line: 66, baseType: !10, size: 64, offset: 704)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !233, file: !21, line: 68, baseType: !36, size: 64, offset: 768)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !233, file: !21, line: 70, baseType: !232, size: 64, offset: 832)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !233, file: !21, line: 72, baseType: !14, size: 32, offset: 896)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !233, file: !21, line: 73, baseType: !14, size: 32, offset: 928)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !233, file: !21, line: 74, baseType: !42, size: 64, offset: 960)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !233, file: !21, line: 77, baseType: !46, size: 16, offset: 1024)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !233, file: !21, line: 78, baseType: !48, size: 8, offset: 1040)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !233, file: !21, line: 79, baseType: !50, size: 8, offset: 1048)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !233, file: !21, line: 81, baseType: !54, size: 64, offset: 1088)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !233, file: !21, line: 89, baseType: !57, size: 64, offset: 1152)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !233, file: !21, line: 91, baseType: !59, size: 64, offset: 1216)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !233, file: !21, line: 92, baseType: !62, size: 64, offset: 1280)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !233, file: !21, line: 93, baseType: !232, size: 64, offset: 1344)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !233, file: !21, line: 94, baseType: !66, size: 64, offset: 1408)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !233, file: !21, line: 95, baseType: !68, size: 64, offset: 1472)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !233, file: !21, line: 96, baseType: !14, size: 32, offset: 1536)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !233, file: !21, line: 98, baseType: !73, size: 160, offset: 1568)
!264 = !{!224}
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !267, file: !268, line: 85, type: !393, isDefinition: true)
!267 = distinct !DICompileUnit(language: DW_LANG_C99, file: !268, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !269, retainedTypes: !304, globals: !366, nameTableKind: None)
!268 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!269 = !{!270, !284, !289}
!270 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !214, line: 32, baseType: !271, size: 32, elements: !272)
!271 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!272 = !{!273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283}
!273 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!274 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!275 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!276 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!277 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!278 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!279 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!280 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!281 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!282 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!283 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!284 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !214, line: 242, baseType: !271, size: 32, elements: !285)
!285 = !{!286, !287, !288}
!286 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!287 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!288 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!289 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !290, line: 46, baseType: !271, size: 32, elements: !291)
!290 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!291 = !{!292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303}
!292 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!293 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!294 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!295 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!296 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!297 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!298 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!299 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!300 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!301 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!302 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!303 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!304 = !{!305, !310, !134, !324, !14, !46, !327, !68, !344, !348, !6, !354, !358, !10, !151, !362, !363}
!305 = !DISubprogram(name: "xmemdup", scope: !125, file: !125, line: 62, type: !306, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!306 = !DISubroutineType(types: !307)
!307 = !{!66, !308, !70}
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!310 = !DISubprogram(name: "quotearg_alloc_mem", scope: !214, file: !214, line: 342, type: !311, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!311 = !DISubroutineType(types: !312)
!312 = !{!10, !12, !70, !313, !314}
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !316)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !268, line: 65, size: 448, elements: !317)
!317 = !{!318, !319, !320, !322, !323}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !316, file: !268, line: 68, baseType: !270, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !316, file: !268, line: 71, baseType: !14, size: 32, offset: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !316, file: !268, line: 75, baseType: !321, size: 256, offset: 64)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 256, elements: !165)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !316, file: !268, line: 78, baseType: !12, size: 64, offset: 320)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !316, file: !268, line: 81, baseType: !12, size: 64, offset: 384)
!324 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !214, file: !214, line: 408, type: !325, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!325 = !DISubroutineType(types: !326)
!326 = !{!10, !14, !12, !12, !12, !70}
!327 = !DISubprogram(name: "rpl_mbrtowc", scope: !328, file: !328, line: 717, type: !329, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!328 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!329 = !DISubroutineType(types: !330)
!330 = !{!70, !110, !12, !70, !331}
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !333, line: 13, size: 64, elements: !334)
!333 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!334 = !{!335, !336}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !332, file: !333, line: 15, baseType: !14, size: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !332, file: !333, line: 20, baseType: !337, size: 32, offset: 32)
!337 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !332, file: !333, line: 16, size: 32, elements: !338)
!338 = !{!339, !340}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !337, file: !333, line: 18, baseType: !271, size: 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !337, file: !333, line: 19, baseType: !341, size: 32)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 32, elements: !342)
!342 = !{!343}
!343 = !DISubrange(count: 4)
!344 = !DISubprogram(name: "iswprint", scope: !345, file: !345, line: 120, type: !346, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!345 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!346 = !DISubroutineType(types: !347)
!347 = !{!14, !271}
!348 = !DISubprogram(name: "mbsinit", scope: !349, file: !349, line: 292, type: !350, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!349 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!350 = !DISubroutineType(types: !351)
!351 = !{!14, !352}
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !332)
!354 = !DISubprogram(name: "locale_charset", scope: !355, file: !355, line: 35, type: !356, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!355 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!356 = !DISubroutineType(types: !357)
!357 = !{!12}
!358 = !DISubprogram(name: "c_strcasecmp", scope: !359, file: !359, line: 42, type: !360, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!359 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!360 = !DISubroutineType(types: !361)
!361 = !{!14, !12, !12}
!362 = !DISubprogram(name: "xalloc_die", scope: !125, file: !125, line: 51, type: !95, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !4)
!363 = !DISubprogram(name: "xrealloc", scope: !125, file: !125, line: 59, type: !364, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!364 = !DISubroutineType(types: !365)
!365 = !{!66, !66, !70}
!366 = !{!265, !367, !373, !375, !377, !382, !389, !391}
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !267, file: !268, line: 101, type: !369, isDefinition: true)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !370, size: 320, elements: !371)
!370 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !270)
!371 = !{!372}
!372 = !DISubrange(count: 10)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !267, file: !268, line: 1052, type: !316, isDefinition: true)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !267, file: !268, line: 116, type: !316, isLocal: true, isDefinition: true)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "slot0", scope: !267, file: !268, line: 842, type: !379, isLocal: true, isDefinition: true)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 2048, elements: !380)
!380 = !{!381}
!381 = !DISubrange(count: 256)
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(name: "slotvec", scope: !267, file: !268, line: 845, type: !384, isLocal: true, isDefinition: true)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !268, line: 834, size: 128, elements: !386)
!386 = !{!387, !388}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !385, file: !268, line: 836, baseType: !68, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !385, file: !268, line: 837, baseType: !10, size: 64, offset: 64)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "nslots", scope: !267, file: !268, line: 843, type: !14, isLocal: true, isDefinition: true)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "slotvec0", scope: !267, file: !268, line: 844, type: !385, isLocal: true, isDefinition: true)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !394, size: 704, elements: !395)
!394 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!395 = !{!396}
!396 = !DISubrange(count: 11)
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(name: "letters", scope: !399, file: !400, line: 184, type: !423, isLocal: true, isDefinition: true)
!399 = distinct !DICompileUnit(language: DW_LANG_C99, file: !400, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !401, globals: !422, nameTableKind: None)
!400 = !DIFile(filename: "lib/tempname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!401 = !{!402, !408, !411, !414, !418}
!402 = !DISubprogram(name: "randint_all_new", scope: !403, file: !403, line: 36, type: !404, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!403 = !DIFile(filename: "./lib/randint.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!404 = !DISubroutineType(types: !405)
!405 = !{!406, !12, !70}
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DICompositeType(tag: DW_TAG_structure_type, name: "randint_source", file: !403, line: 33, flags: DIFlagFwdDecl)
!408 = !DISubprogram(name: "randint_genmax", scope: !403, file: !403, line: 39, type: !409, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!409 = !DISubroutineType(types: !410)
!410 = !{!70, !406, !70}
!411 = !DISubprogram(name: "randint_all_free", scope: !403, file: !403, line: 50, type: !412, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!412 = !DISubroutineType(types: !413)
!413 = !{!14, !406}
!414 = !DISubprogram(name: "open", scope: !415, file: !415, line: 196, type: !416, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!415 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
!416 = !DISubroutineType(types: !417)
!417 = !{!14, !12, !14, null}
!418 = !DISubprogram(name: "mkdir", scope: !419, file: !419, line: 317, type: !420, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!419 = !DIFile(filename: "/usr/include/sys/stat.h", directory: "")
!420 = !DISubroutineType(types: !421)
!421 = !{!14, !12, !271}
!422 = !{!397}
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 504, elements: !424)
!424 = !{!425}
!425 = !DISubrange(count: 63)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !428, file: !429, line: 26, type: !431, isDefinition: true)
!428 = distinct !DICompileUnit(language: DW_LANG_C99, file: !429, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, globals: !430, nameTableKind: None)
!429 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!430 = !{!426}
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 376, elements: !432)
!432 = !{!433}
!433 = !DISubrange(count: 47)
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !436, file: !437, line: 507, type: !14, isLocal: true, isDefinition: true)
!436 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !437, file: !437, line: 488, type: !438, scopeLine: 489, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !440, retainedNodes: !446)
!437 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!438 = !DISubroutineType(types: !439)
!439 = !{!14, !14, !14}
!440 = distinct !DICompileUnit(language: DW_LANG_C99, file: !437, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !441, globals: !445, nameTableKind: None)
!441 = !{!442, !137}
!442 = !DISubprogram(name: "fcntl", scope: !415, file: !415, line: 176, type: !443, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!443 = !DISubroutineType(types: !444)
!444 = !{!14, !14, !14, null}
!445 = !{!434}
!446 = !{!447, !448, !449, !450, !453}
!447 = !DILocalVariable(name: "fd", arg: 1, scope: !436, file: !437, line: 488, type: !14)
!448 = !DILocalVariable(name: "target", arg: 2, scope: !436, file: !437, line: 488, type: !14)
!449 = !DILocalVariable(name: "result", scope: !436, file: !437, line: 490, type: !14)
!450 = !DILocalVariable(name: "flags", scope: !451, file: !437, line: 531, type: !14)
!451 = distinct !DILexicalBlock(scope: !452, file: !437, line: 530, column: 5)
!452 = distinct !DILexicalBlock(scope: !436, file: !437, line: 529, column: 7)
!453 = !DILocalVariable(name: "saved_errno", scope: !454, file: !437, line: 534, type: !14)
!454 = distinct !DILexicalBlock(scope: !455, file: !437, line: 533, column: 9)
!455 = distinct !DILexicalBlock(scope: !451, file: !437, line: 532, column: 11)
!456 = distinct !DICompileUnit(language: DW_LANG_C99, file: !457, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !458, nameTableKind: None)
!457 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!458 = !{!459}
!459 = !DISubprogram(name: "rpl_fclose", scope: !460, file: !460, line: 672, type: !461, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!460 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!461 = !DISubroutineType(types: !462)
!462 = !{!14, !463}
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !465)
!465 = !{!466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !464, file: !21, line: 51, baseType: !14, size: 32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !464, file: !21, line: 54, baseType: !10, size: 64, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !464, file: !21, line: 55, baseType: !10, size: 64, offset: 128)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !464, file: !21, line: 56, baseType: !10, size: 64, offset: 192)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !464, file: !21, line: 57, baseType: !10, size: 64, offset: 256)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !464, file: !21, line: 58, baseType: !10, size: 64, offset: 320)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !464, file: !21, line: 59, baseType: !10, size: 64, offset: 384)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !464, file: !21, line: 60, baseType: !10, size: 64, offset: 448)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !464, file: !21, line: 61, baseType: !10, size: 64, offset: 512)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !464, file: !21, line: 64, baseType: !10, size: 64, offset: 576)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !464, file: !21, line: 65, baseType: !10, size: 64, offset: 640)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !464, file: !21, line: 66, baseType: !10, size: 64, offset: 704)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !464, file: !21, line: 68, baseType: !36, size: 64, offset: 768)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !464, file: !21, line: 70, baseType: !463, size: 64, offset: 832)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !464, file: !21, line: 72, baseType: !14, size: 32, offset: 896)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !464, file: !21, line: 73, baseType: !14, size: 32, offset: 928)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !464, file: !21, line: 74, baseType: !42, size: 64, offset: 960)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !464, file: !21, line: 77, baseType: !46, size: 16, offset: 1024)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !464, file: !21, line: 78, baseType: !48, size: 8, offset: 1040)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !464, file: !21, line: 79, baseType: !50, size: 8, offset: 1048)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !464, file: !21, line: 81, baseType: !54, size: 64, offset: 1088)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !464, file: !21, line: 89, baseType: !57, size: 64, offset: 1152)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !464, file: !21, line: 91, baseType: !59, size: 64, offset: 1216)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !464, file: !21, line: 92, baseType: !62, size: 64, offset: 1280)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !464, file: !21, line: 93, baseType: !463, size: 64, offset: 1344)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !464, file: !21, line: 94, baseType: !66, size: 64, offset: 1408)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !464, file: !21, line: 95, baseType: !68, size: 64, offset: 1472)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !464, file: !21, line: 96, baseType: !14, size: 32, offset: 1536)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !464, file: !21, line: 98, baseType: !73, size: 160, offset: 1568)
!495 = distinct !DICompileUnit(language: DW_LANG_C99, file: !496, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !497, nameTableKind: None)
!496 = !DIFile(filename: "lib/basename-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!497 = !{!10}
!498 = distinct !DICompileUnit(language: DW_LANG_C99, file: !499, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !500, nameTableKind: None)
!499 = !DIFile(filename: "lib/filenamecat.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!500 = !{!501, !66, !362}
!501 = !DISubprogram(name: "mfile_name_concat", scope: !130, file: !130, line: 26, type: !131, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!502 = distinct !DICompileUnit(language: DW_LANG_C99, file: !503, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !504, nameTableKind: None)
!503 = !DIFile(filename: "lib/filenamecat-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!504 = !{!126, !505, !66}
!505 = !DISubprogram(name: "base_len", scope: !127, file: !127, line: 44, type: !506, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!506 = !DISubroutineType(types: !507)
!507 = !{!70, !12}
!508 = distinct !DICompileUnit(language: DW_LANG_C99, file: !509, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !510, retainedTypes: !514, nameTableKind: None)
!509 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!510 = !{!511}
!511 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !509, line: 40, baseType: !271, size: 32, elements: !512)
!512 = !{!513}
!513 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!514 = !{!6, !515, !66}
!515 = !DISubprogram(name: "fputs_unlocked", scope: !16, file: !16, line: 662, type: !516, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!516 = !DISubroutineType(types: !517)
!517 = !{!14, !12, !518}
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !520)
!520 = !{!521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !519, file: !21, line: 51, baseType: !14, size: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !519, file: !21, line: 54, baseType: !10, size: 64, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !519, file: !21, line: 55, baseType: !10, size: 64, offset: 128)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !519, file: !21, line: 56, baseType: !10, size: 64, offset: 192)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !519, file: !21, line: 57, baseType: !10, size: 64, offset: 256)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !519, file: !21, line: 58, baseType: !10, size: 64, offset: 320)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !519, file: !21, line: 59, baseType: !10, size: 64, offset: 384)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !519, file: !21, line: 60, baseType: !10, size: 64, offset: 448)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !519, file: !21, line: 61, baseType: !10, size: 64, offset: 512)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !519, file: !21, line: 64, baseType: !10, size: 64, offset: 576)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !519, file: !21, line: 65, baseType: !10, size: 64, offset: 640)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !519, file: !21, line: 66, baseType: !10, size: 64, offset: 704)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !519, file: !21, line: 68, baseType: !36, size: 64, offset: 768)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !519, file: !21, line: 70, baseType: !518, size: 64, offset: 832)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !519, file: !21, line: 72, baseType: !14, size: 32, offset: 896)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !519, file: !21, line: 73, baseType: !14, size: 32, offset: 928)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !519, file: !21, line: 74, baseType: !42, size: 64, offset: 960)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !519, file: !21, line: 77, baseType: !46, size: 16, offset: 1024)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !519, file: !21, line: 78, baseType: !48, size: 8, offset: 1040)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !519, file: !21, line: 79, baseType: !50, size: 8, offset: 1048)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !519, file: !21, line: 81, baseType: !54, size: 64, offset: 1088)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !519, file: !21, line: 89, baseType: !57, size: 64, offset: 1152)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !519, file: !21, line: 91, baseType: !59, size: 64, offset: 1216)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !519, file: !21, line: 92, baseType: !62, size: 64, offset: 1280)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !519, file: !21, line: 93, baseType: !518, size: 64, offset: 1344)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !519, file: !21, line: 94, baseType: !66, size: 64, offset: 1408)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !519, file: !21, line: 95, baseType: !68, size: 64, offset: 1472)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !519, file: !21, line: 96, baseType: !14, size: 32, offset: 1536)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !519, file: !21, line: 98, baseType: !73, size: 160, offset: 1568)
!550 = distinct !DICompileUnit(language: DW_LANG_C99, file: !551, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !552, retainedTypes: !565, nameTableKind: None)
!551 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!552 = !{!553}
!553 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !554, file: !125, line: 186, baseType: !271, size: 32, elements: !563)
!554 = distinct !DISubprogram(name: "x2nrealloc", scope: !125, file: !125, line: 174, type: !555, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !550, retainedNodes: !558)
!555 = !DISubroutineType(types: !556)
!556 = !{!66, !66, !557, !68}
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!558 = !{!559, !560, !561, !562}
!559 = !DILocalVariable(name: "p", arg: 1, scope: !554, file: !125, line: 174, type: !66)
!560 = !DILocalVariable(name: "pn", arg: 2, scope: !554, file: !125, line: 174, type: !557)
!561 = !DILocalVariable(name: "s", arg: 3, scope: !554, file: !125, line: 174, type: !68)
!562 = !DILocalVariable(name: "n", scope: !554, file: !125, line: 176, type: !68)
!563 = !{!564}
!564 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!565 = !{!68, !362, !151, !363, !10, !134, !66, !566, !569}
!566 = !DISubprogram(name: "xcalloc", scope: !125, file: !125, line: 57, type: !567, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!567 = !DISubroutineType(types: !568)
!568 = !{!66, !70, !70}
!569 = !DISubprogram(name: "rpl_calloc", scope: !570, file: !570, line: 688, type: !567, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!570 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!571 = distinct !DICompileUnit(language: DW_LANG_C99, file: !572, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !573, nameTableKind: None)
!572 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!573 = !{!6, !116}
!574 = distinct !DICompileUnit(language: DW_LANG_C99, file: !575, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !576, nameTableKind: None)
!575 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!576 = !{!66}
!577 = distinct !DICompileUnit(language: DW_LANG_C99, file: !578, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !579, nameTableKind: None)
!578 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!579 = !{!580, !615, !616, !619}
!580 = !DISubprogram(name: "fileno", scope: !16, file: !16, line: 786, type: !581, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!581 = !DISubroutineType(types: !582)
!582 = !{!14, !583}
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !585)
!585 = !{!586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !584, file: !21, line: 51, baseType: !14, size: 32)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !584, file: !21, line: 54, baseType: !10, size: 64, offset: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !584, file: !21, line: 55, baseType: !10, size: 64, offset: 128)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !584, file: !21, line: 56, baseType: !10, size: 64, offset: 192)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !584, file: !21, line: 57, baseType: !10, size: 64, offset: 256)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !584, file: !21, line: 58, baseType: !10, size: 64, offset: 320)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !584, file: !21, line: 59, baseType: !10, size: 64, offset: 384)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !584, file: !21, line: 60, baseType: !10, size: 64, offset: 448)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !584, file: !21, line: 61, baseType: !10, size: 64, offset: 512)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !584, file: !21, line: 64, baseType: !10, size: 64, offset: 576)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !584, file: !21, line: 65, baseType: !10, size: 64, offset: 640)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !584, file: !21, line: 66, baseType: !10, size: 64, offset: 704)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !584, file: !21, line: 68, baseType: !36, size: 64, offset: 768)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !584, file: !21, line: 70, baseType: !583, size: 64, offset: 832)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !584, file: !21, line: 72, baseType: !14, size: 32, offset: 896)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !584, file: !21, line: 73, baseType: !14, size: 32, offset: 928)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !584, file: !21, line: 74, baseType: !42, size: 64, offset: 960)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !584, file: !21, line: 77, baseType: !46, size: 16, offset: 1024)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !584, file: !21, line: 78, baseType: !48, size: 8, offset: 1040)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !584, file: !21, line: 79, baseType: !50, size: 8, offset: 1048)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !584, file: !21, line: 81, baseType: !54, size: 64, offset: 1088)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !584, file: !21, line: 89, baseType: !57, size: 64, offset: 1152)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !584, file: !21, line: 91, baseType: !59, size: 64, offset: 1216)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !584, file: !21, line: 92, baseType: !62, size: 64, offset: 1280)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !584, file: !21, line: 93, baseType: !583, size: 64, offset: 1344)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !584, file: !21, line: 94, baseType: !66, size: 64, offset: 1408)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !584, file: !21, line: 95, baseType: !68, size: 64, offset: 1472)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !584, file: !21, line: 96, baseType: !14, size: 32, offset: 1536)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !584, file: !21, line: 98, baseType: !73, size: 160, offset: 1568)
!615 = !DISubprogram(name: "fclose", scope: !16, file: !16, line: 213, type: !581, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!616 = !DISubprogram(name: "lseek", scope: !138, file: !138, line: 334, type: !617, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!617 = !DISubroutineType(types: !618)
!618 = !{!44, !14, !44, !14}
!619 = !DISubprogram(name: "rpl_fflush", scope: !460, file: !460, line: 718, type: !581, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!620 = distinct !DICompileUnit(language: DW_LANG_C99, file: !621, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !622, nameTableKind: None)
!621 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!622 = !{!66, !623, !658}
!623 = !DISubprogram(name: "fflush", scope: !16, file: !16, line: 218, type: !624, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!624 = !DISubroutineType(types: !625)
!625 = !{!14, !626}
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !628)
!628 = !{!629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !627, file: !21, line: 51, baseType: !14, size: 32)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !627, file: !21, line: 54, baseType: !10, size: 64, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !627, file: !21, line: 55, baseType: !10, size: 64, offset: 128)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !627, file: !21, line: 56, baseType: !10, size: 64, offset: 192)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !627, file: !21, line: 57, baseType: !10, size: 64, offset: 256)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !627, file: !21, line: 58, baseType: !10, size: 64, offset: 320)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !627, file: !21, line: 59, baseType: !10, size: 64, offset: 384)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !627, file: !21, line: 60, baseType: !10, size: 64, offset: 448)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !627, file: !21, line: 61, baseType: !10, size: 64, offset: 512)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !627, file: !21, line: 64, baseType: !10, size: 64, offset: 576)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !627, file: !21, line: 65, baseType: !10, size: 64, offset: 640)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !627, file: !21, line: 66, baseType: !10, size: 64, offset: 704)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !627, file: !21, line: 68, baseType: !36, size: 64, offset: 768)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !627, file: !21, line: 70, baseType: !626, size: 64, offset: 832)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !627, file: !21, line: 72, baseType: !14, size: 32, offset: 896)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !627, file: !21, line: 73, baseType: !14, size: 32, offset: 928)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !627, file: !21, line: 74, baseType: !42, size: 64, offset: 960)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !627, file: !21, line: 77, baseType: !46, size: 16, offset: 1024)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !627, file: !21, line: 78, baseType: !48, size: 8, offset: 1040)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !627, file: !21, line: 79, baseType: !50, size: 8, offset: 1048)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !627, file: !21, line: 81, baseType: !54, size: 64, offset: 1088)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !627, file: !21, line: 89, baseType: !57, size: 64, offset: 1152)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !627, file: !21, line: 91, baseType: !59, size: 64, offset: 1216)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !627, file: !21, line: 92, baseType: !62, size: 64, offset: 1280)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !627, file: !21, line: 93, baseType: !626, size: 64, offset: 1344)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !627, file: !21, line: 94, baseType: !66, size: 64, offset: 1408)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !627, file: !21, line: 95, baseType: !68, size: 64, offset: 1472)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !627, file: !21, line: 96, baseType: !14, size: 32, offset: 1536)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !627, file: !21, line: 98, baseType: !73, size: 160, offset: 1568)
!658 = !DISubprogram(name: "rpl_fseeko", scope: !460, file: !460, line: 1034, type: !659, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!659 = !DISubroutineType(types: !660)
!660 = !{!14, !626, !44, !14}
!661 = distinct !DICompileUnit(language: DW_LANG_C99, file: !662, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !663, nameTableKind: None)
!662 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!663 = !{!66, !664, !616, !699}
!664 = !DISubprogram(name: "fileno", scope: !16, file: !16, line: 786, type: !665, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!665 = !DISubroutineType(types: !666)
!666 = !{!14, !667}
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !21, line: 49, size: 1728, elements: !669)
!669 = !{!670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !668, file: !21, line: 51, baseType: !14, size: 32)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !668, file: !21, line: 54, baseType: !10, size: 64, offset: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !668, file: !21, line: 55, baseType: !10, size: 64, offset: 128)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !668, file: !21, line: 56, baseType: !10, size: 64, offset: 192)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !668, file: !21, line: 57, baseType: !10, size: 64, offset: 256)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !668, file: !21, line: 58, baseType: !10, size: 64, offset: 320)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !668, file: !21, line: 59, baseType: !10, size: 64, offset: 384)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !668, file: !21, line: 60, baseType: !10, size: 64, offset: 448)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !668, file: !21, line: 61, baseType: !10, size: 64, offset: 512)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !668, file: !21, line: 64, baseType: !10, size: 64, offset: 576)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !668, file: !21, line: 65, baseType: !10, size: 64, offset: 640)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !668, file: !21, line: 66, baseType: !10, size: 64, offset: 704)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !668, file: !21, line: 68, baseType: !36, size: 64, offset: 768)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !668, file: !21, line: 70, baseType: !667, size: 64, offset: 832)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !668, file: !21, line: 72, baseType: !14, size: 32, offset: 896)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !668, file: !21, line: 73, baseType: !14, size: 32, offset: 928)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !668, file: !21, line: 74, baseType: !42, size: 64, offset: 960)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !668, file: !21, line: 77, baseType: !46, size: 16, offset: 1024)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !668, file: !21, line: 78, baseType: !48, size: 8, offset: 1040)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !668, file: !21, line: 79, baseType: !50, size: 8, offset: 1048)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !668, file: !21, line: 81, baseType: !54, size: 64, offset: 1088)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !668, file: !21, line: 89, baseType: !57, size: 64, offset: 1152)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !668, file: !21, line: 91, baseType: !59, size: 64, offset: 1216)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !668, file: !21, line: 92, baseType: !62, size: 64, offset: 1280)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !668, file: !21, line: 93, baseType: !667, size: 64, offset: 1344)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !668, file: !21, line: 94, baseType: !66, size: 64, offset: 1408)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !668, file: !21, line: 95, baseType: !68, size: 64, offset: 1472)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !668, file: !21, line: 96, baseType: !14, size: 32, offset: 1536)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !668, file: !21, line: 98, baseType: !73, size: 160, offset: 1568)
!699 = !DISubprogram(name: "fseeko", scope: !16, file: !16, line: 707, type: !700, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!700 = !DISubroutineType(types: !701)
!701 = !{!14, !667, !44, !14}
!702 = distinct !DICompileUnit(language: DW_LANG_C99, file: !703, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !704, nameTableKind: None)
!703 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!704 = !{!705, !68, !717}
!705 = !DISubprogram(name: "mbrtowc", scope: !349, file: !349, line: 296, type: !706, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!706 = !DISubroutineType(types: !707)
!707 = !{!70, !110, !12, !70, !708}
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !333, line: 13, size: 64, elements: !710)
!710 = !{!711, !712}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !709, file: !333, line: 15, baseType: !14, size: 32)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !709, file: !333, line: 20, baseType: !713, size: 32, offset: 32)
!713 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !709, file: !333, line: 16, size: 32, elements: !714)
!714 = !{!715, !716}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !713, file: !333, line: 18, baseType: !271, size: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !713, file: !333, line: 19, baseType: !341, size: 32)
!717 = !DISubprogram(name: "hard_locale", scope: !718, file: !718, line: 26, type: !719, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!718 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!719 = !DISubroutineType(types: !720)
!720 = !{!161, !14}
!721 = distinct !DICompileUnit(language: DW_LANG_C99, file: !722, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !723, nameTableKind: None)
!722 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!723 = !{!724}
!724 = !DISubprogram(name: "setlocale_null_r", scope: !725, file: !725, line: 64, type: !726, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !4)
!725 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!726 = !DISubroutineType(types: !727)
!727 = !{!14, !14, !10, !70}
!728 = distinct !DICompileUnit(language: DW_LANG_C99, file: !729, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !730, retainedTypes: !1117, nameTableKind: None)
!729 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!730 = !{!731}
!731 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !732, line: 41, baseType: !271, size: 32, elements: !733)
!732 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!733 = !{!734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116}
!734 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!735 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!736 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!737 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!738 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!739 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!740 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!741 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!742 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!743 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!744 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!745 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!746 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!747 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!748 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!749 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!750 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!751 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!752 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!753 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!754 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!755 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!756 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!757 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!758 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!759 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!760 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!761 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!762 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!763 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!764 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!765 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!766 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!767 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!768 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!769 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!770 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!771 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!772 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!773 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!774 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!775 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!776 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!777 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!778 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!779 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!780 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!781 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!782 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!783 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!784 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!785 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!786 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!787 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!788 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!789 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!790 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!791 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!793 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!794 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!795 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!796 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!797 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!798 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!799 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!800 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!801 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!802 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!803 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!804 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!805 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!806 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!807 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!808 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!809 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!810 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!812 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!813 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!814 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!815 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!816 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!817 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!818 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!819 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!820 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!821 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!822 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!823 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!824 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!825 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!826 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!827 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!828 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!829 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!830 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!831 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!832 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!833 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!834 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!835 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!836 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!837 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!838 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!839 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!840 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!841 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!842 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!843 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!844 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!845 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!846 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!847 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!848 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!849 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!850 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!851 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!852 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!853 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!854 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!855 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!856 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!884 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!885 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!886 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!887 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!894 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!895 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!896 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!898 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!899 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!900 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!901 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!902 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!903 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!904 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!905 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!906 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!907 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!908 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!909 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!910 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!911 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!912 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!913 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!914 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!915 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!916 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!917 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!918 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!919 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!920 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!921 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!922 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!923 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!924 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!925 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!926 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!927 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!928 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!929 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!930 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!931 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!932 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!933 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!934 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!935 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!936 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!937 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!938 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!939 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!940 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!941 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!942 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!943 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!944 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!945 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!946 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!947 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!948 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!949 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!950 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!951 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!952 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!953 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!954 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!955 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!956 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!957 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!958 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!959 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!960 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!961 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!962 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!963 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!964 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!965 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!966 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!967 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!968 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!969 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!970 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!971 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!972 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!973 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!974 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!975 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
