source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.Active_dir = type { i64, i64, %struct._ftsent* }
%struct.FTS = type { %struct._ftsent*, %struct._ftsent*, %struct._ftsent**, i64, i8*, i32, i32, i64, i64, i32 (%struct._ftsent**, %struct._ftsent**)*, i32, %struct.hash_table*, %union.anon, %struct.I_ring }
%struct.F_triple = type { i8*, i64, i64 }
%struct.I_ring = type { [4 x i32], i32, i32, i32, i8 }
%struct.Src_to_dest = type { i64, i64, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__acl_entry_ext = type opaque
%struct.__acl_ext = type opaque
%struct.__dirstream = type opaque
%struct.__fsid_t = type { [2 x i32] }
%struct.__mbstate_t = type { i32, %union.anon.56 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct._ftsent = type { %struct._ftsent*, %struct._ftsent*, %struct._ftsent*, %struct.__dirstream*, i64, i8*, i8*, i8*, i32, i32, i64, %struct.FTS*, i64, i64, i64, i16, i16, i16, [1 x %struct.stat], [0 x i8] }

!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "backup_type", file: !6, line: 28, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/backupfile.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "no_backups", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "simple_backups", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "numbered_existing_backups", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "numbered_backups", value: 3, isUnsigned: true)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Dereference_symlink", file: !14, line: 69, baseType: !7, size: 32, elements: !15)
!14 = !DIFile(filename: "src/copy.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!15 = !{!16, !17, !18, !19}
!16 = !DIEnumerator(name: "DEREF_UNDEFINED", value: 1, isUnsigned: true)
!17 = !DIEnumerator(name: "DEREF_NEVER", value: 2, isUnsigned: true)
!18 = !DIEnumerator(name: "DEREF_COMMAND_LINE_ARGUMENTS", value: 3, isUnsigned: true)
!19 = !DIEnumerator(name: "DEREF_ALWAYS", value: 4, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Interactive", file: !14, line: 60, baseType: !7, size: 32, elements: !21)
!21 = !{!22, !23, !24, !25}
!22 = !DIEnumerator(name: "I_ALWAYS_YES", value: 1, isUnsigned: true)
!23 = !DIEnumerator(name: "I_ALWAYS_NO", value: 2, isUnsigned: true)
!24 = !DIEnumerator(name: "I_ASK_USER", value: 3, isUnsigned: true)
!25 = !DIEnumerator(name: "I_UNSPECIFIED", value: 4, isUnsigned: true)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Sparse_type", file: !14, line: 26, baseType: !7, size: 32, elements: !27)
!27 = !{!28, !29, !30, !31}
!28 = !DIEnumerator(name: "SPARSE_UNUSED", value: 0, isUnsigned: true)
!29 = !DIEnumerator(name: "SPARSE_NEVER", value: 1, isUnsigned: true)
!30 = !DIEnumerator(name: "SPARSE_AUTO", value: 2, isUnsigned: true)
!31 = !DIEnumerator(name: "SPARSE_ALWAYS", value: 3, isUnsigned: true)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Reflink_type", file: !14, line: 47, baseType: !7, size: 32, elements: !33)
!33 = !{!34, !35, !36}
!34 = !DIEnumerator(name: "REFLINK_NEVER", value: 0, isUnsigned: true)
!35 = !DIEnumerator(name: "REFLINK_AUTO", value: 1, isUnsigned: true)
!36 = !DIEnumerator(name: "REFLINK_ALWAYS", value: 2, isUnsigned: true)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !38, line: 32, baseType: !7, size: 32, elements: !39)
!38 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!39 = !{!40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50}
!40 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!41 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!42 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!43 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!44 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!45 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!46 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!47 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!48 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!49 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!50 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rm_interactive", file: !52, line: 23, baseType: !7, size: 32, elements: !53)
!52 = !DIFile(filename: "src/remove.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!53 = !{!54, !55, !56}
!54 = !DIEnumerator(name: "RMI_ALWAYS", value: 3, isUnsigned: true)
!55 = !DIEnumerator(name: "RMI_SOMETIMES", value: 4, isUnsigned: true)
!56 = !DIEnumerator(name: "RMI_NEVER", value: 5, isUnsigned: true)
!57 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RM_status", file: !52, line: 78, baseType: !7, size: 32, elements: !58)
!58 = !{!59, !60, !61, !62}
!59 = !DIEnumerator(name: "RM_OK", value: 2, isUnsigned: true)
!60 = !DIEnumerator(name: "RM_USER_DECLINED", value: 3, isUnsigned: true)
!61 = !DIEnumerator(name: "RM_ERROR", value: 4, isUnsigned: true)
!62 = !DIEnumerator(name: "RM_NONEMPTY_DIR", value: 5, isUnsigned: true)
!63 = !{!64, !66}
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!67 = !{!68, !0, !71}
!68 = !DIGlobalVariableExpression(var: !69, expr: !DIExpression())
!69 = distinct !DIGlobalVariable(name: "remove_trailing_slashes", scope: !2, file: !3, line: 54, type: !70, isLocal: true, isDefinition: true)
!70 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(name: "dev_ino_buf", scope: !73, file: !3, line: 96, type: !86, isLocal: true, isDefinition: true)
!73 = distinct !DISubprogram(name: "rm_option_init", scope: !3, file: !3, line: 75, type: !74, isLocal: true, isDefinition: true, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !102)
!74 = !DISubroutineType(types: !75)
!75 = !{null, !76}
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rm_options", file: !52, line: 32, size: 256, elements: !78)
!78 = !{!79, !80, !81, !82, !83, !84, !98, !99, !100, !101}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_missing_files", scope: !77, file: !52, line: 35, baseType: !70, size: 8)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !77, file: !52, line: 38, baseType: !51, size: 32, offset: 32)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "one_file_system", scope: !77, file: !52, line: 47, baseType: !70, size: 8, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !77, file: !52, line: 50, baseType: !70, size: 8, offset: 72)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "remove_empty_directories", scope: !77, file: !52, line: 53, baseType: !70, size: 8, offset: 80)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "root_dev_ino", scope: !77, file: !52, line: 57, baseType: !85, size: 64, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !87, line: 7, size: 128, elements: !88)
!87 = !DIFile(filename: "./lib/dev-ino.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!88 = !{!89, !95}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !86, file: !87, line: 9, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !91, line: 47, baseType: !92)
!91 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !93, line: 146, baseType: !94)
!93 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!94 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !86, file: !87, line: 10, baseType: !96, size: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !91, line: 59, baseType: !97)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !93, line: 143, baseType: !94)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_all_root", scope: !77, file: !52, line: 61, baseType: !70, size: 8, offset: 192)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_tty", scope: !77, file: !52, line: 64, baseType: !70, size: 8, offset: 200)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !77, file: !52, line: 67, baseType: !70, size: 8, offset: 208)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "require_restore_cwd", scope: !77, file: !52, line: 75, baseType: !70, size: 8, offset: 216)
!102 = !{!103}
!103 = !DILocalVariable(name: "x", arg: 1, scope: !73, file: !3, line: 75, type: !76)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 3584, elements: !117)
!105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !106)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !107, line: 50, size: 256, elements: !108)
!107 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!108 = !{!109, !112, !114, !116}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !106, file: !107, line: 52, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !106, file: !107, line: 55, baseType: !113, size: 32, offset: 64)
!113 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !106, file: !107, line: 56, baseType: !115, size: 64, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !106, file: !107, line: 57, baseType: !113, size: 32, offset: 192)
!117 = !{!118}
!118 = !DISubrange(count: 14)
!119 = !DIGlobalVariableExpression(var: !69, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(name: "top_level_src_name", scope: !122, file: !123, line: 147, type: !110, isLocal: true, isDefinition: true)
!122 = distinct !DICompileUnit(language: DW_LANG_C99, file: !123, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !124, retainedTypes: !149, globals: !159)
!123 = !DIFile(filename: "src/copy.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!124 = !{!5, !13, !20, !26, !32, !37, !125, !129, !136, !145}
!125 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !126, line: 27, baseType: !7, size: 32, elements: !127)
!126 = !DIFile(filename: "./lib/utimecmp.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!127 = !{!128}
!128 = !DIEnumerator(name: "UTIMECMP_TRUNCATE_SOURCE", value: 1, isUnsigned: true)
!129 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "savedir_option", file: !130, line: 26, baseType: !7, size: 32, elements: !131)
!130 = !DIFile(filename: "./lib/savedir.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!131 = !{!132, !133, !134, !135}
!132 = !DIEnumerator(name: "SAVEDIR_SORT_NONE", value: 0, isUnsigned: true)
!133 = !DIEnumerator(name: "SAVEDIR_SORT_NAME", value: 1, isUnsigned: true)
!134 = !DIEnumerator(name: "SAVEDIR_SORT_INODE", value: 2, isUnsigned: true)
!135 = !DIEnumerator(name: "SAVEDIR_SORT_FASTREAD", value: 2, isUnsigned: true)
!136 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !137, line: 45, baseType: !7, size: 32, elements: !138)
!137 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!138 = !{!139, !140, !141, !142, !143, !144}
!139 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0, isUnsigned: true)
!140 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2, isUnsigned: true)
!141 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5, isUnsigned: true)
!142 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4, isUnsigned: true)
!143 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3, isUnsigned: true)
!144 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1, isUnsigned: true)
!145 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !146, line: 73, baseType: !7, size: 32, elements: !147)
!146 = !DIFile(filename: "src/ioblksize.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!147 = !{!148}
!148 = !DIEnumerator(name: "IO_BUFSIZE", value: 131072, isUnsigned: true)
!149 = !{!150, !66, !7, !64, !94, !152, !153, !155}
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !91, line: 69, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !93, line: 148, baseType: !7)
!152 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !154, line: 62, baseType: !94)
!154 = !DIFile(filename: "/usr/lib/clang/7.0.0/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !156, line: 63, baseType: !157)
!156 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !93, line: 150, baseType: !158)
!158 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!159 = !{!160, !120, !166, !168, !178, !180}
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "mask", scope: !162, file: !123, line: 3050, type: !150, isLocal: true, isDefinition: true)
!162 = distinct !DISubprogram(name: "cached_umask", scope: !123, file: !123, line: 3048, type: !163, isDefinition: true, scopeLine: 3049, flags: DIFlagPrototyped, isOptimized: true, unit: !122, retainedNodes: !165)
!163 = !DISubroutineType(types: !164)
!164 = !{!150}
!165 = !{}
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "top_level_dst_name", scope: !122, file: !123, line: 148, type: !110, isLocal: true, isDefinition: true)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "zeros", scope: !170, file: !123, line: 351, type: !64, isLocal: true, isDefinition: true)
!170 = distinct !DISubprogram(name: "write_zeros", scope: !123, file: !123, line: 349, type: !171, isLocal: true, isDefinition: true, scopeLine: 350, flags: DIFlagPrototyped, isOptimized: true, unit: !122, retainedNodes: !173)
!171 = !DISubroutineType(types: !172)
!172 = !{!70, !113, !155}
!173 = !{!174, !175, !176}
!174 = !DILocalVariable(name: "fd", arg: 1, scope: !170, file: !123, line: 349, type: !113)
!175 = !DILocalVariable(name: "n_bytes", arg: 2, scope: !170, file: !123, line: 349, type: !155)
!176 = !DILocalVariable(name: "n", scope: !177, file: !123, line: 370, type: !153)
!177 = distinct !DILexicalBlock(scope: !170, file: !123, line: 369, column: 5)
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(name: "nz", scope: !170, file: !123, line: 352, type: !153, isLocal: true, isDefinition: true)
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(name: "fallback", scope: !170, file: !123, line: 359, type: !182, isLocal: true, isDefinition: true)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 8192, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 1024)
!185 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 18446744073709421568, DW_OP_mul, DW_OP_constu, 131072, DW_OP_plus, DW_OP_stack_value))
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "src_to_dest", scope: !188, file: !189, line: 45, type: !195, isLocal: true, isDefinition: true)
!188 = distinct !DICompileUnit(language: DW_LANG_C99, file: !189, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !165, retainedTypes: !190, globals: !194)
!189 = !DIFile(filename: "src/cp-hash.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!190 = !{!66, !64, !191}
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !192, line: 102, baseType: !193)
!192 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !93, line: 72, baseType: !94)
!194 = !{!186}
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !197, line: 69, baseType: !198)
!197 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !197, line: 67, flags: DIFlagFwdDecl)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(name: "simple_pattern", scope: !201, file: !202, line: 38, type: !211, isLocal: true, isDefinition: true)
!201 = distinct !DICompileUnit(language: DW_LANG_C99, file: !202, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !203, globals: !210)
!202 = !DIFile(filename: "src/force-link.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!203 = !{!204, !207}
!204 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !202, line: 39, baseType: !7, size: 32, elements: !205)
!205 = !{!206}
!206 = !DIEnumerator(name: "x_suffix_len", value: 6, isUnsigned: true)
!207 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !202, line: 44, baseType: !7, size: 32, elements: !208)
!208 = !{!209}
!209 = !DIEnumerator(name: "smallsize", value: 256, isUnsigned: true)
!210 = !{!199}
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 72, elements: !212)
!212 = !{!213}
!213 = !DISubrange(count: 9)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(name: "Version", scope: !216, file: !217, line: 2, type: !110, isDefinition: true)
!216 = distinct !DICompileUnit(language: DW_LANG_C99, file: !217, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !165, globals: !218)
!217 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!218 = !{!214}
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(name: "simple_backup_suffix", scope: !221, file: !225, line: 79, type: !110, isDefinition: true)
!221 = distinct !DICompileUnit(language: DW_LANG_C99, file: !222, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !223, retainedTypes: !283, globals: !284)
!222 = !DIFile(filename: "./lib/backupfile.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!223 = !{!5, !224, !253, !259}
!224 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !226, file: !225, line: 304, baseType: !7, size: 32, elements: !251)
!225 = !DIFile(filename: "lib/backupfile.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!226 = distinct !DISubprogram(name: "backupfile_internal", scope: !225, file: !225, line: 292, type: !227, isDefinition: true, scopeLine: 293, flags: DIFlagPrototyped, isOptimized: true, unit: !221, retainedNodes: !229)
!227 = !DISubroutineType(types: !228)
!228 = !{!64, !110, !5, !70}
!229 = !{!230, !231, !232, !233, !235, !236, !237, !238, !241, !242, !247, !249, !250}
!230 = !DILocalVariable(name: "file", arg: 1, scope: !226, file: !225, line: 292, type: !110)
!231 = !DILocalVariable(name: "backup_type", arg: 2, scope: !226, file: !225, line: 292, type: !5)
!232 = !DILocalVariable(name: "rename", arg: 3, scope: !226, file: !225, line: 292, type: !70)
!233 = !DILocalVariable(name: "base_offset", scope: !226, file: !225, line: 294, type: !234)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !154, line: 51, baseType: !158)
!235 = !DILocalVariable(name: "filelen", scope: !226, file: !225, line: 295, type: !153)
!236 = !DILocalVariable(name: "simple_backup_suffix_size", scope: !226, file: !225, line: 302, type: !153)
!237 = !DILocalVariable(name: "backup_suffix_size_guess", scope: !226, file: !225, line: 303, type: !153)
!238 = !DILocalVariable(name: "ssize", scope: !226, file: !225, line: 308, type: !239)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !91, line: 108, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !93, line: 191, baseType: !158)
!241 = !DILocalVariable(name: "s", scope: !226, file: !225, line: 309, type: !64)
!242 = !DILocalVariable(name: "dirp", scope: !226, file: !225, line: 313, type: !243)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !245, line: 127, baseType: !246)
!245 = !DIFile(filename: "/usr/include/dirent.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !245, line: 127, flags: DIFlagFwdDecl)
!247 = !DILocalVariable(name: "sdir", scope: !248, file: !225, line: 349, type: !113)
!248 = distinct !DILexicalBlock(scope: !226, file: !225, line: 315, column: 5)
!249 = !DILocalVariable(name: "flags", scope: !248, file: !225, line: 355, type: !7)
!250 = !DILocalVariable(name: "e", scope: !248, file: !225, line: 358, type: !113)
!251 = !{!252}
!252 = !DIEnumerator(name: "GUESS", value: 9, isUnsigned: true)
!253 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "numbered_backup_result", file: !225, line: 152, baseType: !7, size: 32, elements: !254)
!254 = !{!255, !256, !257, !258}
!255 = !DIEnumerator(name: "BACKUP_IS_SAME_LENGTH", value: 0, isUnsigned: true)
!256 = !DIEnumerator(name: "BACKUP_IS_LONGER", value: 1, isUnsigned: true)
!257 = !DIEnumerator(name: "BACKUP_IS_NEW", value: 2, isUnsigned: true)
!258 = !DIEnumerator(name: "BACKUP_NOMEM", value: 3, isUnsigned: true)
!259 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !260, line: 24, baseType: !7, size: 32, elements: !261)
!260 = !DIFile(filename: "/usr/include/bits/confname.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!261 = !{!262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282}
!262 = !DIEnumerator(name: "_PC_LINK_MAX", value: 0, isUnsigned: true)
!263 = !DIEnumerator(name: "_PC_MAX_CANON", value: 1, isUnsigned: true)
!264 = !DIEnumerator(name: "_PC_MAX_INPUT", value: 2, isUnsigned: true)
!265 = !DIEnumerator(name: "_PC_NAME_MAX", value: 3, isUnsigned: true)
!266 = !DIEnumerator(name: "_PC_PATH_MAX", value: 4, isUnsigned: true)
!267 = !DIEnumerator(name: "_PC_PIPE_BUF", value: 5, isUnsigned: true)
!268 = !DIEnumerator(name: "_PC_CHOWN_RESTRICTED", value: 6, isUnsigned: true)
!269 = !DIEnumerator(name: "_PC_NO_TRUNC", value: 7, isUnsigned: true)
!270 = !DIEnumerator(name: "_PC_VDISABLE", value: 8, isUnsigned: true)
!271 = !DIEnumerator(name: "_PC_SYNC_IO", value: 9, isUnsigned: true)
!272 = !DIEnumerator(name: "_PC_ASYNC_IO", value: 10, isUnsigned: true)
!273 = !DIEnumerator(name: "_PC_PRIO_IO", value: 11, isUnsigned: true)
!274 = !DIEnumerator(name: "_PC_SOCK_MAXBUF", value: 12, isUnsigned: true)
!275 = !DIEnumerator(name: "_PC_FILESIZEBITS", value: 13, isUnsigned: true)
!276 = !DIEnumerator(name: "_PC_REC_INCR_XFER_SIZE", value: 14, isUnsigned: true)
!277 = !DIEnumerator(name: "_PC_REC_MAX_XFER_SIZE", value: 15, isUnsigned: true)
!278 = !DIEnumerator(name: "_PC_REC_MIN_XFER_SIZE", value: 16, isUnsigned: true)
!279 = !DIEnumerator(name: "_PC_REC_XFER_ALIGN", value: 17, isUnsigned: true)
!280 = !DIEnumerator(name: "_PC_ALLOC_SIZE_MIN", value: 18, isUnsigned: true)
!281 = !DIEnumerator(name: "_PC_SYMLINK_MAX", value: 19, isUnsigned: true)
!282 = !DIEnumerator(name: "_PC_2_SYMLINKS", value: 20, isUnsigned: true)
!283 = !{!66, !7, !153}
!284 = !{!219}
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(name: "backup_args", scope: !287, file: !294, line: 40, type: !299, isLocal: true, isDefinition: true)
!287 = distinct !DICompileUnit(language: DW_LANG_C99, file: !288, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !289, retainedTypes: !290, globals: !291)
!288 = !DIFile(filename: "./lib/backup-find.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!289 = !{!5}
!290 = !{!110}
!291 = !{!292, !285}
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(name: "backup_types", scope: !287, file: !294, line: 51, type: !295, isLocal: true, isDefinition: true)
!294 = !DIFile(filename: "lib/backup-find.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !296, size: 256, elements: !297)
!296 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!297 = !{!298}
!298 = !DISubrange(count: 8)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !300, size: 576, elements: !212)
!300 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(name: "file_name", scope: !303, file: !306, line: 37, type: !110, isLocal: true, isDefinition: true)
!303 = distinct !DICompileUnit(language: DW_LANG_C99, file: !304, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !165, globals: !305)
!304 = !DIFile(filename: "./lib/closein.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!305 = !{!301}
!306 = !DIFile(filename: "lib/closein.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(name: "file_name", scope: !309, file: !314, line: 46, type: !110, isLocal: true, isDefinition: true)
!309 = distinct !DICompileUnit(language: DW_LANG_C99, file: !310, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !165, globals: !311)
!310 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!311 = !{!307, !312}
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !309, file: !314, line: 56, type: !70, isLocal: true, isDefinition: true)
!314 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(name: "exit_failure", scope: !317, file: !320, line: 24, type: !321, isDefinition: true)
!317 = distinct !DICompileUnit(language: DW_LANG_C99, file: !318, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !165, globals: !319)
!318 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!319 = !{!315}
!320 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!321 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !113)
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(name: "default_tuning", scope: !324, file: !328, line: 130, type: !329, isLocal: true, isDefinition: true)
!324 = distinct !DICompileUnit(language: DW_LANG_C99, file: !325, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !165, retainedTypes: !326, globals: !327)
!325 = !DIFile(filename: "./lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!326 = !{!94, !66, !153}
!327 = !{!322}
!328 = !DIFile(filename: "lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!329 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !330)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !197, line: 65, baseType: !331)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !197, line: 53, size: 160, elements: !332)
!332 = !{!333, !335, !336, !337, !338}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !331, file: !197, line: 58, baseType: !334, size: 32)
!334 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !331, file: !197, line: 59, baseType: !334, size: 32, offset: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !331, file: !197, line: 60, baseType: !334, size: 32, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !331, file: !197, line: 61, baseType: !334, size: 32, offset: 96)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !331, file: !197, line: 62, baseType: !70, size: 8, offset: 128)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "program_name", scope: !341, file: !345, line: 33, type: !110, isDefinition: true)
!341 = distinct !DICompileUnit(language: DW_LANG_C99, file: !342, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !165, retainedTypes: !343, globals: !344)
!342 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!343 = !{!66, !64}
!344 = !{!339}
!345 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !348, file: !376, line: 85, type: !409, isDefinition: true)
!348 = distinct !DICompileUnit(language: DW_LANG_C99, file: !349, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !350, retainedTypes: !371, globals: !373)
!349 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!350 = !{!37, !351, !356}
!351 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !38, line: 242, baseType: !7, size: 32, elements: !352)
!352 = !{!353, !354, !355}
!353 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!354 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!355 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!356 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !357, line: 46, baseType: !7, size: 32, elements: !358)
!357 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!358 = !{!359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370}
!359 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!360 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!361 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!362 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!363 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!364 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!365 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!366 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!367 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!368 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!369 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!370 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!371 = !{!113, !372, !153, !64}
!372 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!373 = !{!346, !374, !381, !391, !393, !398, !405, !407}
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !348, file: !376, line: 101, type: !377, isDefinition: true)
!376 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !378, size: 320, elements: !379)
!378 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!379 = !{!380}
!380 = !DISubrange(count: 10)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !348, file: !376, line: 1052, type: !383, isDefinition: true)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !376, line: 65, size: 448, elements: !384)
!384 = !{!385, !386, !387, !389, !390}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !383, file: !376, line: 68, baseType: !37, size: 32)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !383, file: !376, line: 71, baseType: !113, size: 32, offset: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !383, file: !376, line: 75, baseType: !388, size: 256, offset: 64)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !297)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !383, file: !376, line: 78, baseType: !110, size: 64, offset: 320)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !383, file: !376, line: 81, baseType: !110, size: 64, offset: 384)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !348, file: !376, line: 116, type: !383, isLocal: true, isDefinition: true)
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(name: "slot0", scope: !348, file: !376, line: 842, type: !395, isLocal: true, isDefinition: true)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 2048, elements: !396)
!396 = !{!397}
!397 = !DISubrange(count: 256)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "slotvec", scope: !348, file: !376, line: 845, type: !400, isLocal: true, isDefinition: true)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !376, line: 834, size: 128, elements: !402)
!402 = !{!403, !404}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !401, file: !376, line: 836, baseType: !153, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !401, file: !376, line: 837, baseType: !64, size: 64, offset: 64)
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(name: "nslots", scope: !348, file: !376, line: 843, type: !113, isLocal: true, isDefinition: true)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(name: "slotvec0", scope: !348, file: !376, line: 844, type: !401, isLocal: true, isDefinition: true)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !300, size: 704, elements: !410)
!410 = !{!411}
!411 = !DISubrange(count: 11)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(name: "comparison_function_table", scope: !414, file: !432, line: 74, type: !433, isLocal: true, isDefinition: true)
!414 = distinct !DICompileUnit(language: DW_LANG_C99, file: !415, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !416, retainedTypes: !430, globals: !431)
!415 = !DIFile(filename: "./lib/savedir.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!416 = !{!129, !417}
!417 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !419, file: !418, line: 186, baseType: !7, size: 32, elements: !428)
!418 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!419 = distinct !DISubprogram(name: "x2nrealloc", scope: !418, file: !418, line: 174, type: !420, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: true, unit: !414, retainedNodes: !423)
!420 = !DISubroutineType(types: !421)
!421 = !{!66, !66, !422, !153}
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!423 = !{!424, !425, !426, !427}
!424 = !DILocalVariable(name: "p", arg: 1, scope: !419, file: !418, line: 174, type: !66)
!425 = !DILocalVariable(name: "pn", arg: 2, scope: !419, file: !418, line: 174, type: !422)
!426 = !DILocalVariable(name: "s", arg: 3, scope: !419, file: !418, line: 174, type: !153)
!427 = !DILocalVariable(name: "n", scope: !419, file: !418, line: 176, type: !153)
!428 = !{!429}
!429 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!430 = !{!66, !153}
!431 = !{!412}
!432 = !DIFile(filename: "lib/savedir.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 192, elements: !441)
!434 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !435)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "comparison_function", file: !432, line: 72, baseType: !436)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DISubroutineType(types: !438)
!438 = !{!113, !439, !439}
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!441 = !{!442}
!442 = !DISubrange(count: 3)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(name: "letters", scope: !445, file: !448, line: 184, type: !449, isLocal: true, isDefinition: true)
!445 = distinct !DICompileUnit(language: DW_LANG_C99, file: !446, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !165, globals: !447)
!446 = !DIFile(filename: "./lib/tempname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!447 = !{!443}
!448 = !DIFile(filename: "lib/tempname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 504, elements: !450)
!450 = !{!451}
!451 = !DISubrange(count: 63)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(name: "ht", scope: !454, file: !455, line: 163, type: !195, isLocal: true, isDefinition: true)
!454 = distinct !DISubprogram(name: "utimecmpat", scope: !455, file: !455, line: 132, type: !456, isDefinition: true, scopeLine: 136, flags: DIFlagPrototyped, isOptimized: true, unit: !491, retainedNodes: !506)
!455 = !DIFile(filename: "lib/utimecmp.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!456 = !DISubroutineType(types: !457)
!457 = !{!113, !113, !110, !458, !458, !113}
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !460)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !461, line: 46, size: 1152, elements: !462)
!461 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!462 = !{!463, !464, !465, !467, !468, !470, !472, !473, !474, !475, !477, !479, !487, !488, !489}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !460, file: !461, line: 48, baseType: !97, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !460, file: !461, line: 53, baseType: !92, size: 64, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !460, file: !461, line: 61, baseType: !466, size: 64, offset: 128)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !93, line: 149, baseType: !94)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !460, file: !461, line: 62, baseType: !151, size: 32, offset: 192)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !460, file: !461, line: 64, baseType: !469, size: 32, offset: 224)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !93, line: 144, baseType: !7)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !460, file: !461, line: 65, baseType: !471, size: 32, offset: 256)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !93, line: 145, baseType: !7)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !460, file: !461, line: 67, baseType: !113, size: 32, offset: 288)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !460, file: !461, line: 69, baseType: !97, size: 64, offset: 320)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !460, file: !461, line: 74, baseType: !157, size: 64, offset: 384)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !460, file: !461, line: 78, baseType: !476, size: 64, offset: 448)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !93, line: 172, baseType: !158)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !460, file: !461, line: 80, baseType: !478, size: 64, offset: 512)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !93, line: 177, baseType: !158)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !460, file: !461, line: 91, baseType: !480, size: 128, offset: 576)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !481, line: 9, size: 128, elements: !482)
!481 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!482 = !{!483, !485}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !480, file: !481, line: 11, baseType: !484, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !93, line: 158, baseType: !158)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !480, file: !481, line: 12, baseType: !486, size: 64, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !93, line: 194, baseType: !158)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !460, file: !461, line: 92, baseType: !480, size: 128, offset: 704)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !460, file: !461, line: 93, baseType: !480, size: 128, offset: 832)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !460, file: !461, line: 106, baseType: !490, size: 192, offset: 960)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !486, size: 192, elements: !441)
!491 = distinct !DICompileUnit(language: DW_LANG_C99, file: !492, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !493, globals: !497)
!492 = !DIFile(filename: "./lib/utimecmp.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!493 = !{!125, !494}
!494 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !455, line: 49, baseType: !7, size: 32, elements: !495)
!495 = !{!496}
!496 = !DIEnumerator(name: "SYSCALL_RESOLUTION", value: 1, isUnsigned: true)
!497 = !{!452, !498}
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(name: "new_dst_res", scope: !454, file: !455, line: 166, type: !500, isLocal: true, isDefinition: true)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fs_res", file: !455, line: 66, size: 128, elements: !502)
!502 = !{!503, !504, !505}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !501, file: !455, line: 69, baseType: !96, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "resolution", scope: !501, file: !455, line: 76, baseType: !113, size: 32, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "exact", scope: !501, file: !455, line: 80, baseType: !70, size: 8, offset: 96)
!506 = !{!507, !508, !509, !510, !511, !512, !515, !516, !517, !518, !521, !522, !523, !526, !527, !528, !529, !530, !531, !533, !536, !537, !538, !539, !545, !546, !548, !550, !552}
!507 = !DILocalVariable(name: "dfd", arg: 1, scope: !454, file: !455, line: 132, type: !113)
!508 = !DILocalVariable(name: "dst_name", arg: 2, scope: !454, file: !455, line: 132, type: !110)
!509 = !DILocalVariable(name: "dst_stat", arg: 3, scope: !454, file: !455, line: 133, type: !458)
!510 = !DILocalVariable(name: "src_stat", arg: 4, scope: !454, file: !455, line: 134, type: !458)
!511 = !DILocalVariable(name: "options", arg: 5, scope: !454, file: !455, line: 135, type: !113)
!512 = !DILocalVariable(name: "dst_s", scope: !454, file: !455, line: 153, type: !513)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !514, line: 7, baseType: !484)
!514 = !DIFile(filename: "/usr/include/bits/types/time_t.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!515 = !DILocalVariable(name: "src_s", scope: !454, file: !455, line: 154, type: !513)
!516 = !DILocalVariable(name: "dst_ns", scope: !454, file: !455, line: 155, type: !113)
!517 = !DILocalVariable(name: "src_ns", scope: !454, file: !455, line: 156, type: !113)
!518 = !DILocalVariable(name: "dst_res", scope: !519, file: !455, line: 167, type: !500)
!519 = distinct !DILexicalBlock(scope: !520, file: !455, line: 159, column: 5)
!520 = distinct !DILexicalBlock(scope: !454, file: !455, line: 158, column: 7)
!521 = !DILocalVariable(name: "tmp_dst_res", scope: !519, file: !455, line: 168, type: !501)
!522 = !DILocalVariable(name: "res", scope: !519, file: !455, line: 171, type: !113)
!523 = !DILocalVariable(name: "dst_a_s", scope: !524, file: !455, line: 262, type: !513)
!524 = distinct !DILexicalBlock(scope: !525, file: !455, line: 258, column: 9)
!525 = distinct !DILexicalBlock(scope: !519, file: !455, line: 257, column: 11)
!526 = !DILocalVariable(name: "dst_c_s", scope: !524, file: !455, line: 263, type: !513)
!527 = !DILocalVariable(name: "dst_m_s", scope: !524, file: !455, line: 264, type: !513)
!528 = !DILocalVariable(name: "dst_a_ns", scope: !524, file: !455, line: 265, type: !113)
!529 = !DILocalVariable(name: "dst_c_ns", scope: !524, file: !455, line: 266, type: !113)
!530 = !DILocalVariable(name: "dst_m_ns", scope: !524, file: !455, line: 267, type: !113)
!531 = !DILocalVariable(name: "odd_second", scope: !532, file: !455, line: 276, type: !70)
!532 = distinct !DILexicalBlock(scope: !524, file: !455, line: 275, column: 11)
!533 = !DILocalVariable(name: "a", scope: !534, file: !455, line: 285, type: !113)
!534 = distinct !DILexicalBlock(scope: !535, file: !455, line: 284, column: 15)
!535 = distinct !DILexicalBlock(scope: !532, file: !455, line: 278, column: 17)
!536 = !DILocalVariable(name: "c", scope: !534, file: !455, line: 286, type: !113)
!537 = !DILocalVariable(name: "m", scope: !534, file: !455, line: 287, type: !113)
!538 = !DILocalVariable(name: "SR10", scope: !534, file: !455, line: 291, type: !113)
!539 = !DILocalVariable(name: "timespec", scope: !540, file: !455, line: 313, type: !542)
!540 = distinct !DILexicalBlock(scope: !541, file: !455, line: 312, column: 13)
!541 = distinct !DILexicalBlock(scope: !524, file: !455, line: 311, column: 15)
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !480, size: 256, elements: !543)
!543 = !{!544}
!544 = !DISubrange(count: 2)
!545 = !DILocalVariable(name: "dst_status", scope: !540, file: !455, line: 314, type: !460)
!546 = !DILocalVariable(name: "s", scope: !547, file: !455, line: 324, type: !513)
!547 = distinct !DILexicalBlock(scope: !540, file: !455, line: 323, column: 15)
!548 = !DILocalVariable(name: "stat_result", scope: !549, file: !455, line: 348, type: !113)
!549 = distinct !DILexicalBlock(scope: !540, file: !455, line: 347, column: 15)
!550 = !DILocalVariable(name: "old_res", scope: !551, file: !455, line: 369, type: !113)
!551 = distinct !DILexicalBlock(scope: !540, file: !455, line: 368, column: 15)
!552 = !DILocalVariable(name: "a", scope: !551, file: !455, line: 370, type: !113)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(name: "utimensat_works_really", scope: !555, file: !565, line: 75, type: !113, isLocal: true, isDefinition: true)
!555 = distinct !DICompileUnit(language: DW_LANG_C99, file: !556, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !557, globals: !562)
!556 = !DIFile(filename: "./lib/utimens.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!557 = !{!558}
!558 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !559, line: 41, baseType: !7, size: 32, elements: !560)
!559 = !DIFile(filename: "./lib/timespec.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!560 = !{!561}
!561 = !DIEnumerator(name: "TIMESPEC_RESOLUTION", value: 1000000000, isUnsigned: true)
!562 = !{!553, !563}
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(name: "lutimensat_works_really", scope: !555, file: !565, line: 76, type: !113, isLocal: true, isDefinition: true)
!565 = !DIFile(filename: "lib/utimens.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !568, file: !571, line: 26, type: !572, isDefinition: true)
!568 = distinct !DICompileUnit(language: DW_LANG_C99, file: !569, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !165, globals: !570)
!569 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!570 = !{!566}
!571 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 376, elements: !573)
!573 = !{!574}
!574 = !DISubrange(count: 47)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!576 = distinct !DIGlobalVariable(name: "initialized", scope: !577, file: !578, line: 34, type: !70, isLocal: true, isDefinition: true)
!577 = distinct !DISubprogram(name: "can_write_any_file", scope: !578, file: !578, line: 32, type: !579, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: true, unit: !581, retainedNodes: !587)
!578 = !DIFile(filename: "lib/write-any-file.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!579 = !DISubroutineType(types: !580)
!580 = !{!70}
!581 = distinct !DICompileUnit(language: DW_LANG_C99, file: !582, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !165, globals: !583)
!582 = !DIFile(filename: "./lib/write-any-file.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!583 = !{!584, !585}
!584 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(name: "can_write", scope: !577, file: !578, line: 35, type: !70, isLocal: true, isDefinition: true)
!587 = !{!588}
!588 = !DILocalVariable(name: "can", scope: !589, file: !578, line: 39, type: !70)
!589 = distinct !DILexicalBlock(scope: !590, file: !578, line: 38, column: 5)
!590 = distinct !DILexicalBlock(scope: !577, file: !578, line: 37, column: 7)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !593, file: !594, line: 339, type: !113, isLocal: true, isDefinition: true)
!593 = distinct !DISubprogram(name: "rpl_fcntl", scope: !594, file: !594, line: 276, type: !595, isDefinition: true, scopeLine: 277, flags: DIFlagPrototyped, isOptimized: true, unit: !597, retainedNodes: !600)
!594 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!595 = !DISubroutineType(types: !596)
!596 = !{!113, !113, !113, null}
!597 = distinct !DICompileUnit(language: DW_LANG_C99, file: !598, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !165, globals: !599)
!598 = !DIFile(filename: "./lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!599 = !{!591}
!600 = !{!601, !602, !603, !616, !617, !620, !623, !626}
!601 = !DILocalVariable(name: "fd", arg: 1, scope: !593, file: !594, line: 276, type: !113)
!602 = !DILocalVariable(name: "action", arg: 2, scope: !593, file: !594, line: 276, type: !113)
!603 = !DILocalVariable(name: "arg", scope: !593, file: !594, line: 278, type: !604)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !605, line: 30, baseType: !606)
!605 = !DIFile(filename: "/usr/lib/clang/7.0.0/include/stdarg.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !598, line: 278, baseType: !607)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !608, size: 192, elements: !614)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !598, line: 278, size: 192, elements: !609)
!609 = !{!610, !611, !612, !613}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !608, file: !598, line: 278, baseType: !7, size: 32)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !608, file: !598, line: 278, baseType: !7, size: 32, offset: 32)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !608, file: !598, line: 278, baseType: !66, size: 64, offset: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !608, file: !598, line: 278, baseType: !66, size: 64, offset: 128)
!614 = !{!615}
!615 = !DISubrange(count: 1)
!616 = !DILocalVariable(name: "result", scope: !593, file: !594, line: 279, type: !113)
!617 = !DILocalVariable(name: "target", scope: !618, file: !594, line: 326, type: !113)
!618 = distinct !DILexicalBlock(scope: !619, file: !594, line: 325, column: 7)
!619 = distinct !DILexicalBlock(scope: !593, file: !594, line: 282, column: 5)
!620 = !DILocalVariable(name: "flags", scope: !621, file: !594, line: 363, type: !113)
!621 = distinct !DILexicalBlock(scope: !622, file: !594, line: 362, column: 11)
!622 = distinct !DILexicalBlock(scope: !618, file: !594, line: 361, column: 13)
!623 = !DILocalVariable(name: "saved_errno", scope: !624, file: !594, line: 366, type: !113)
!624 = distinct !DILexicalBlock(scope: !625, file: !594, line: 365, column: 15)
!625 = distinct !DILexicalBlock(scope: !621, file: !594, line: 364, column: 17)
!626 = !DILocalVariable(name: "p", scope: !627, file: !594, line: 408, type: !66)
!627 = distinct !DILexicalBlock(scope: !619, file: !594, line: 406, column: 7)
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !630, file: !635, line: 69, type: !636, isDefinition: true)
!630 = distinct !DICompileUnit(language: DW_LANG_C99, file: !631, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !632, retainedTypes: !633, globals: !634)
!631 = !DIFile(filename: "./lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!632 = !{!37}
!633 = !{!66, !152}
!634 = !{!628}
!635 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !637, line: 55, baseType: !638)
!637 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DISubroutineType(types: !640)
!640 = !{null}
!641 = distinct !DICompileUnit(language: DW_LANG_C99, file: !642, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !643, retainedTypes: !664)
!642 = !DIFile(filename: "src/remove.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!643 = !{!57, !51, !37, !644, !649, !653}
!644 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ternary", file: !642, line: 35, baseType: !7, size: 32, elements: !645)
!645 = !{!646, !647, !648}
!646 = !DIEnumerator(name: "T_UNKNOWN", value: 2, isUnsigned: true)
!647 = !DIEnumerator(name: "T_NO", value: 3, isUnsigned: true)
!648 = !DIEnumerator(name: "T_YES", value: 4, isUnsigned: true)
!649 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Prompt_action", file: !642, line: 46, baseType: !7, size: 32, elements: !650)
!650 = !{!651, !652}
!651 = !DIEnumerator(name: "PA_DESCEND_INTO_DIR", value: 2, isUnsigned: true)
!652 = !DIEnumerator(name: "PA_REMOVE_DIR", value: 3, isUnsigned: true)
!653 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !245, line: 97, baseType: !7, size: 32, elements: !654)
!654 = !{!655, !656, !657, !658, !659, !660, !661, !662, !663}
!655 = !DIEnumerator(name: "DT_UNKNOWN", value: 0, isUnsigned: true)
!656 = !DIEnumerator(name: "DT_FIFO", value: 1, isUnsigned: true)
!657 = !DIEnumerator(name: "DT_CHR", value: 2, isUnsigned: true)
!658 = !DIEnumerator(name: "DT_DIR", value: 4, isUnsigned: true)
!659 = !DIEnumerator(name: "DT_BLK", value: 6, isUnsigned: true)
!660 = !DIEnumerator(name: "DT_REG", value: 8, isUnsigned: true)
!661 = !DIEnumerator(name: "DT_LNK", value: 10, isUnsigned: true)
!662 = !DIEnumerator(name: "DT_SOCK", value: 12, isUnsigned: true)
!663 = !DIEnumerator(name: "DT_WHT", value: 14, isUnsigned: true)
!664 = !{!66, !113}
!665 = distinct !DICompileUnit(language: DW_LANG_C99, file: !666, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !667, retainedTypes: !748)
!666 = !DIFile(filename: "src/extent-scan.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!667 = !{!668}
!668 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !669, file: !666, line: 97, baseType: !7, size: 32, elements: !746)
!669 = distinct !DISubprogram(name: "extent_scan_read", scope: !666, file: !666, line: 87, type: !670, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: true, unit: !665, retainedNodes: !690)
!670 = !DISubroutineType(types: !671)
!671 = !{!70, !672}
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extent_scan", file: !674, line: 36, size: 384, elements: !675)
!674 = !DIFile(filename: "src/extent-scan.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!675 = !{!676, !677, !679, !680, !681, !682, !683}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !673, file: !674, line: 39, baseType: !113, size: 32)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "scan_start", scope: !673, file: !674, line: 42, baseType: !678, size: 64, offset: 64)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !91, line: 85, baseType: !157)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "fm_flags", scope: !673, file: !674, line: 45, baseType: !7, size: 32, offset: 128)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "ei_count", scope: !673, file: !674, line: 48, baseType: !153, size: 64, offset: 192)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "initial_scan_failed", scope: !673, file: !674, line: 52, baseType: !70, size: 8, offset: 256)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "hit_final_extent", scope: !673, file: !674, line: 55, baseType: !70, size: 8, offset: 264)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "ext_info", scope: !673, file: !674, line: 58, baseType: !684, size: 64, offset: 320)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extent_info", file: !674, line: 23, size: 192, elements: !686)
!686 = !{!687, !688, !689}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "ext_logical", scope: !685, file: !674, line: 26, baseType: !678, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "ext_length", scope: !685, file: !674, line: 29, baseType: !678, size: 64, offset: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "ext_flags", scope: !685, file: !674, line: 32, baseType: !7, size: 32, offset: 128)
!690 = !{!691, !692, !693, !694, !731, !733, !735, !737, !738, !745}
!691 = !DILocalVariable(name: "scan", arg: 1, scope: !669, file: !666, line: 87, type: !672)
!692 = !DILocalVariable(name: "si", scope: !669, file: !666, line: 89, type: !7)
!693 = !DILocalVariable(name: "last_ei", scope: !669, file: !666, line: 90, type: !684)
!694 = !DILocalVariable(name: "fiemap_buf", scope: !695, file: !666, line: 94, type: !696)
!695 = distinct !DILexicalBlock(scope: !669, file: !666, line: 93, column: 5)
!696 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !669, file: !666, line: 94, size: 32768, elements: !697)
!697 = !{!698, !727}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !696, file: !666, line: 94, baseType: !699, size: 256)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fiemap", file: !700, line: 35, size: 256, elements: !701)
!700 = !DIFile(filename: "src/fiemap.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!701 = !{!702, !706, !707, !710, !711, !712, !713}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "fm_start", scope: !699, file: !700, line: 38, baseType: !703, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !704, line: 27, baseType: !705)
!704 = !DIFile(filename: "/usr/include/bits/stdint-uintn.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !93, line: 44, baseType: !94)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "fm_length", scope: !699, file: !700, line: 41, baseType: !703, size: 64, offset: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "fm_flags", scope: !699, file: !700, line: 44, baseType: !708, size: 32, offset: 128)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !704, line: 26, baseType: !709)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !93, line: 41, baseType: !7)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "fm_mapped_extents", scope: !699, file: !700, line: 47, baseType: !708, size: 32, offset: 160)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "fm_extent_count", scope: !699, file: !700, line: 50, baseType: !708, size: 32, offset: 192)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "fm_reserved", scope: !699, file: !700, line: 52, baseType: !708, size: 32, offset: 224)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "fm_extents", scope: !699, file: !700, line: 59, baseType: !714, offset: 256)
!714 = !DICompositeType(tag: DW_TAG_array_type, baseType: !715, elements: !725)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fiemap_extent", file: !700, line: 14, size: 448, elements: !716)
!716 = !{!717, !718, !719, !720, !722, !723}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "fe_logical", scope: !715, file: !700, line: 18, baseType: !703, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "fe_physical", scope: !715, file: !700, line: 22, baseType: !703, size: 64, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "fe_length", scope: !715, file: !700, line: 25, baseType: !703, size: 64, offset: 128)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "fe_reserved64", scope: !715, file: !700, line: 27, baseType: !721, size: 128, offset: 192)
!721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !703, size: 128, elements: !543)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "fe_flags", scope: !715, file: !700, line: 30, baseType: !708, size: 32, offset: 320)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "fe_reserved", scope: !715, file: !700, line: 32, baseType: !724, size: 96, offset: 352)
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !708, size: 96, elements: !441)
!725 = !{!726}
!726 = !DISubrange(count: 0)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !696, file: !666, line: 94, baseType: !728, size: 32768)
!728 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 32768, elements: !729)
!729 = !{!730}
!730 = !DISubrange(count: 4096)
!731 = !DILocalVariable(name: "fiemap", scope: !695, file: !666, line: 95, type: !732)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!733 = !DILocalVariable(name: "fm_extents", scope: !695, file: !666, line: 96, type: !734)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!735 = !DILocalVariable(name: "prev_idx", scope: !736, file: !666, line: 131, type: !153)
!736 = distinct !DILexicalBlock(scope: !695, file: !666, line: 128, column: 7)
!737 = !DILocalVariable(name: "i", scope: !695, file: !666, line: 137, type: !7)
!738 = !DILocalVariable(name: "new_logical", scope: !739, file: !666, line: 163, type: !703)
!739 = distinct !DILexicalBlock(scope: !740, file: !666, line: 158, column: 13)
!740 = distinct !DILexicalBlock(scope: !741, file: !666, line: 155, column: 20)
!741 = distinct !DILexicalBlock(scope: !742, file: !666, line: 145, column: 15)
!742 = distinct !DILexicalBlock(scope: !743, file: !666, line: 139, column: 9)
!743 = distinct !DILexicalBlock(scope: !744, file: !666, line: 138, column: 7)
!744 = distinct !DILexicalBlock(scope: !695, file: !666, line: 138, column: 7)
!745 = !DILocalVariable(name: "length_adjust", scope: !739, file: !666, line: 164, type: !703)
!746 = !{!747}
!747 = !DIEnumerator(name: "count", value: 72, isUnsigned: true)
!748 = !{!678, !153}
!749 = distinct !DICompileUnit(language: DW_LANG_C99, file: !750, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !165)
!750 = !DIFile(filename: "src/selinux.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!751 = distinct !DICompileUnit(language: DW_LANG_C99, file: !752, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !165)
!752 = !DIFile(filename: "./lib/copy-acl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!753 = distinct !DICompileUnit(language: DW_LANG_C99, file: !754, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !165)
!754 = !DIFile(filename: "./lib/set-acl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!755 = distinct !DICompileUnit(language: DW_LANG_C99, file: !756, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !165, retainedTypes: !757)
!756 = !DIFile(filename: "./lib/areadlink-with-size.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!757 = !{!66}
!758 = distinct !DICompileUnit(language: DW_LANG_C99, file: !759, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !289)
!759 = !DIFile(filename: "./lib/backup-rename.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!760 = distinct !DICompileUnit(language: DW_LANG_C99, file: !761, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !165)
!761 = !DIFile(filename: "./lib/buffer-lcm.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!762 = distinct !DICompileUnit(language: DW_LANG_C99, file: !763, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !165)
!763 = !DIFile(filename: "./lib/opendir-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!764 = distinct !DICompileUnit(language: DW_LANG_C99, file: !765, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !165)
!765 = !DIFile(filename: "./lib/dirname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!766 = distinct !DICompileUnit(language: DW_LANG_C99, file: !767, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !165)
!767 = !DIFile(filename: "./lib/dirname-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!768 = distinct !DICompileUnit(language: DW_LANG_C99, file: !769, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !165, retainedTypes: !770)
!769 = !DIFile(filename: "./lib/basename-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!770 = !{!64}
!771 = distinct !DICompileUnit(language: DW_LANG_C99, file: !772, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !165)
!772 = !DIFile(filename: "./lib/stripslash.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!773 = distinct !DICompileUnit(language: DW_LANG_C99, file: !774, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !775)
!774 = !DIFile(filename: "./lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!775 = !{!136}
!776 = distinct !DICompileUnit(language: DW_LANG_C99, file: !777, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !165)
!777 = !DIFile(filename: "./lib/open-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!778 = distinct !DICompileUnit(language: DW_LANG_C99, file: !779, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !165, retainedTypes: !343)
!779 = !DIFile(filename: "./lib/file-set.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!780 = distinct !DICompileUnit(language: DW_LANG_C99, file: !781, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !165)
!781 = !DIFile(filename: "./lib/file-type.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!782 = distinct !DICompileUnit(language: DW_LANG_C99, file: !783, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !165)
!783 = !DIFile(filename: "./lib/filemode.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!784 = distinct !DICompileUnit(language: DW_LANG_C99, file: !785, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !165, retainedTypes: !757)
!785 = !DIFile(filename: "./lib/filenamecat.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!786 = distinct !DICompileUnit(language: DW_LANG_C99, file: !787, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !165, retainedTypes: !757)
!787 = !DIFile(filename: "./lib/filenamecat-lgpl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!788 = distinct !DICompileUnit(language: DW_LANG_C99, file: !789, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !165, retainedTypes: !790)
!789 = !DIFile(filename: "./lib/full-write.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!790 = !{!110, !153}
!791 = distinct !DICompileUnit(language: DW_LANG_C99, file: !792, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !165)
!792 = !DIFile(filename: "./lib/hash-triple.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!793 = distinct !DICompileUnit(language: DW_LANG_C99, file: !794, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !165)
!794 = !DIFile(filename: "./lib/qcopy-acl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!795 = distinct !DICompileUnit(language: DW_LANG_C99, file: !796, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !165)
!796 = !DIFile(filename: "./lib/qset-acl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!797 = distinct !DICompileUnit(language: DW_LANG_C99, file: !798, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !165, retainedTypes: !770)
!798 = !DIFile(filename: "./lib/renameat2.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!799 = distinct !DICompileUnit(language: DW_LANG_C99, file: !800, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !165)
!800 = !DIFile(filename: "./lib/root-dev-ino.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!801 = distinct !DICompileUnit(language: DW_LANG_C99, file: !802, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !803)
!802 = !DIFile(filename: "./lib/safe-write.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!803 = !{!804}
!804 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !805, line: 40, baseType: !7, size: 32, elements: !806)
!805 = !DIFile(filename: "./lib/sys-limits.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!806 = !{!807}
!807 = !DIEnumerator(name: "SYS_BUFSIZE_MAX", value: 2146435072, isUnsigned: true)
!808 = distinct !DICompileUnit(language: DW_LANG_C99, file: !809, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !165)
!809 = !DIFile(filename: "./lib/same.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!810 = distinct !DICompileUnit(language: DW_LANG_C99, file: !811, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !165)
!811 = !DIFile(filename: "./lib/fd-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!812 = distinct !DICompileUnit(language: DW_LANG_C99, file: !813, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !165)
!813 = !DIFile(filename: "./lib/verror.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!814 = distinct !DICompileUnit(language: DW_LANG_C99, file: !815, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !816, retainedTypes: !757)
!815 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!816 = !{!817}
!817 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !818, line: 41, baseType: !7, size: 32, elements: !819)
!818 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!819 = !{!820}
!820 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2018, isUnsigned: true)
!821 = distinct !DICompileUnit(language: DW_LANG_C99, file: !822, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !823, retainedTypes: !831)
!822 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!823 = !{!824}
!824 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !825, file: !418, line: 186, baseType: !7, size: 32, elements: !428)
!825 = distinct !DISubprogram(name: "x2nrealloc", scope: !418, file: !418, line: 174, type: !420, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: true, unit: !821, retainedNodes: !826)
!826 = !{!827, !828, !829, !830}
!827 = !DILocalVariable(name: "p", arg: 1, scope: !825, file: !418, line: 174, type: !66)
!828 = !DILocalVariable(name: "pn", arg: 2, scope: !825, file: !418, line: 174, type: !422)
!829 = !DILocalVariable(name: "s", arg: 3, scope: !825, file: !418, line: 174, type: !153)
!830 = !DILocalVariable(name: "n", scope: !825, file: !418, line: 176, type: !153)
!831 = !{!153, !64, !66}
!832 = distinct !DICompileUnit(language: DW_LANG_C99, file: !833, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !165)
!833 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!834 = distinct !DICompileUnit(language: DW_LANG_C99, file: !835, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !165, retainedTypes: !757)
!835 = !DIFile(filename: "./lib/xfts.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!836 = distinct !DICompileUnit(language: DW_LANG_C99, file: !837, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !165, retainedTypes: !770)
!837 = !DIFile(filename: "./lib/xvasprintf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!838 = distinct !DICompileUnit(language: DW_LANG_C99, file: !839, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !165)
!839 = !DIFile(filename: "./lib/yesno.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!840 = distinct !DICompileUnit(language: DW_LANG_C99, file: !841, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !165, retainedTypes: !757)
!841 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!842 = distinct !DICompileUnit(language: DW_LANG_C99, file: !843, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !165, retainedTypes: !757)
!843 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!844 = distinct !DICompileUnit(language: DW_LANG_C99, file: !845, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !165)
!845 = !DIFile(filename: "./lib/freadahead.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!846 = distinct !DICompileUnit(language: DW_LANG_C99, file: !847, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !165, retainedTypes: !757)
!847 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!848 = distinct !DICompileUnit(language: DW_LANG_C99, file: !849, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !850, retainedTypes: !983)
!849 = !DIFile(filename: "./lib/fts.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!850 = !{!851, !856, !861, !974, !977, !653, !980}
!851 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Fts_stat", file: !852, line: 155, baseType: !7, size: 32, elements: !853)
!852 = !DIFile(filename: "lib/fts.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!853 = !{!854, !855}
!854 = !DIEnumerator(name: "FTS_NO_STAT_REQUIRED", value: 1, isUnsigned: true)
!855 = !DIEnumerator(name: "FTS_STAT_REQUIRED", value: 2, isUnsigned: true)
!856 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "leaf_optimization", file: !852, line: 669, baseType: !7, size: 32, elements: !857)
!857 = !{!858, !859, !860}
!858 = !DIEnumerator(name: "NO_LEAF_OPTIMIZATION", value: 0, isUnsigned: true)
!859 = !DIEnumerator(name: "OK_LEAF_OPTIMIZATION", value: 1, isUnsigned: true)
!860 = !DIEnumerator(name: "NOSTAT_LEAF_OPTIMIZATION", value: 2, isUnsigned: true)
!861 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !863, file: !862, line: 54, baseType: !7, size: 32, elements: !972)
!862 = !DIFile(filename: "./lib/fts-cycle.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!863 = distinct !DISubprogram(name: "setup_dir", scope: !862, file: !862, line: 50, type: !864, isLocal: true, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: true, unit: !848, retainedNodes: !970)
!864 = !DISubroutineType(types: !865)
!865 = !{!70, !866}
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !868, line: 199, baseType: !869)
!868 = !DIFile(filename: "./lib/fts_.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !868, line: 80, size: 1024, elements: !870)
!870 = !{!871, !921, !922, !924, !925, !926, !927, !928, !929, !930, !937, !938, !941, !957}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !869, file: !868, line: 81, baseType: !872, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !868, line: 201, size: 2112, elements: !874)
!874 = !{!875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !891, !892, !893, !894, !917}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !873, file: !868, line: 202, baseType: !872, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !873, file: !868, line: 203, baseType: !872, size: 64, offset: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !873, file: !868, line: 204, baseType: !872, size: 64, offset: 128)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !873, file: !868, line: 205, baseType: !243, size: 64, offset: 192)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !873, file: !868, line: 208, baseType: !158, size: 64, offset: 256)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !873, file: !868, line: 209, baseType: !66, size: 64, offset: 320)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !873, file: !868, line: 210, baseType: !64, size: 64, offset: 384)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !873, file: !868, line: 211, baseType: !64, size: 64, offset: 448)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !873, file: !868, line: 212, baseType: !113, size: 32, offset: 512)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !873, file: !868, line: 213, baseType: !113, size: 32, offset: 544)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !873, file: !868, line: 214, baseType: !153, size: 64, offset: 576)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !873, file: !868, line: 216, baseType: !866, size: 64, offset: 640)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !873, file: !868, line: 220, baseType: !234, size: 64, offset: 704)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !873, file: !868, line: 222, baseType: !153, size: 64, offset: 768)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "fts_n_dirs_remaining", scope: !873, file: !868, line: 227, baseType: !890, size: 64, offset: 832)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !91, line: 74, baseType: !466)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !873, file: !868, line: 243, baseType: !372, size: 16, offset: 896)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !873, file: !868, line: 247, baseType: !372, size: 16, offset: 912)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !873, file: !868, line: 253, baseType: !372, size: 16, offset: 928)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !873, file: !868, line: 255, baseType: !895, size: 1152, offset: 960)
!895 = !DICompositeType(tag: DW_TAG_array_type, baseType: !896, size: 1152, elements: !614)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !461, line: 46, size: 1152, elements: !897)
!897 = !{!898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !914, !915, !916}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !896, file: !461, line: 48, baseType: !97, size: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !896, file: !461, line: 53, baseType: !92, size: 64, offset: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !896, file: !461, line: 61, baseType: !466, size: 64, offset: 128)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !896, file: !461, line: 62, baseType: !151, size: 32, offset: 192)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !896, file: !461, line: 64, baseType: !469, size: 32, offset: 224)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !896, file: !461, line: 65, baseType: !471, size: 32, offset: 256)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !896, file: !461, line: 67, baseType: !113, size: 32, offset: 288)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !896, file: !461, line: 69, baseType: !97, size: 64, offset: 320)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !896, file: !461, line: 74, baseType: !157, size: 64, offset: 384)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !896, file: !461, line: 78, baseType: !476, size: 64, offset: 448)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !896, file: !461, line: 80, baseType: !478, size: 64, offset: 512)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !896, file: !461, line: 91, baseType: !910, size: 128, offset: 576)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !481, line: 9, size: 128, elements: !911)
!911 = !{!912, !913}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !910, file: !481, line: 11, baseType: !484, size: 64)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !910, file: !481, line: 12, baseType: !486, size: 64, offset: 64)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !896, file: !461, line: 92, baseType: !910, size: 128, offset: 704)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !896, file: !461, line: 93, baseType: !910, size: 128, offset: 832)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !896, file: !461, line: 106, baseType: !490, size: 192, offset: 960)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "fts_name", scope: !873, file: !868, line: 256, baseType: !918, offset: 2112)
!918 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, elements: !919)
!919 = !{!920}
!920 = !DISubrange(count: -1)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "fts_child", scope: !869, file: !868, line: 82, baseType: !872, size: 64, offset: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "fts_array", scope: !869, file: !868, line: 83, baseType: !923, size: 64, offset: 128)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !869, file: !868, line: 84, baseType: !96, size: 64, offset: 192)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !869, file: !868, line: 85, baseType: !64, size: 64, offset: 256)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "fts_rfd", scope: !869, file: !868, line: 86, baseType: !113, size: 32, offset: 320)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cwd_fd", scope: !869, file: !868, line: 87, baseType: !113, size: 32, offset: 352)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !869, file: !868, line: 89, baseType: !153, size: 64, offset: 384)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "fts_nitems", scope: !869, file: !868, line: 90, baseType: !153, size: 64, offset: 448)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "fts_compar", scope: !869, file: !868, line: 91, baseType: !931, size: 64, offset: 512)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DISubroutineType(types: !933)
!933 = !{!113, !934, !934}
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !873)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "fts_options", scope: !869, file: !868, line: 162, baseType: !113, size: 32, offset: 576)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "fts_leaf_optimization_works_ht", scope: !869, file: !868, line: 171, baseType: !939, size: 64, offset: 640)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !868, line: 171, flags: DIFlagFwdDecl)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !869, file: !868, line: 193, baseType: !942, size: 64, offset: 704)
!942 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !869, file: !868, line: 173, size: 64, elements: !943)
!943 = !{!944, !945}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !942, file: !868, line: 186, baseType: !939, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !942, file: !868, line: 192, baseType: !946, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cycle_check_state", file: !948, line: 28, size: 256, elements: !949)
!948 = !DIFile(filename: "./lib/cycle-check.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!949 = !{!950, !955, !956}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "dev_ino", scope: !947, file: !948, line: 30, baseType: !951, size: 128)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !87, line: 7, size: 128, elements: !952)
!952 = !{!953, !954}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !951, file: !87, line: 9, baseType: !90, size: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !951, file: !87, line: 10, baseType: !96, size: 64, offset: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "chdir_counter", scope: !947, file: !948, line: 31, baseType: !191, size: 64, offset: 128)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !947, file: !948, line: 32, baseType: !113, size: 32, offset: 192)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fd_ring", scope: !869, file: !868, line: 198, baseType: !958, size: 256, offset: 768)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "I_ring", file: !959, line: 39, baseType: !960)
!959 = !DIFile(filename: "./lib/i-ring.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "I_ring", file: !959, line: 31, size: 256, elements: !961)
!961 = !{!962, !966, !967, !968, !969}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "ir_data", scope: !960, file: !959, line: 33, baseType: !963, size: 128)
!963 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 128, elements: !964)
!964 = !{!965}
!965 = !DISubrange(count: 4)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "ir_default_val", scope: !960, file: !959, line: 34, baseType: !113, size: 32, offset: 128)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "ir_front", scope: !960, file: !959, line: 35, baseType: !7, size: 32, offset: 160)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "ir_back", scope: !960, file: !959, line: 36, baseType: !7, size: 32, offset: 192)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "ir_empty", scope: !960, file: !959, line: 37, baseType: !70, size: 8, offset: 224)
!970 = !{!971}
!971 = !DILocalVariable(name: "fts", arg: 1, scope: !863, file: !862, line: 50, type: !866)
!972 = !{!973}
!973 = !DIEnumerator(name: "HT_INITIAL_SIZE", value: 31, isUnsigned: true)
!974 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !852, line: 712, baseType: !7, size: 32, elements: !975)
!975 = !{!976}
!976 = !DIEnumerator(name: "DEV_TYPE_HT_INITIAL_SIZE", value: 13, isUnsigned: true)
!977 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !852, line: 666, baseType: !7, size: 32, elements: !978)
!978 = !{!979}
!979 = !DIEnumerator(name: "MIN_DIR_NLINK", value: 2, isUnsigned: true)
!980 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !852, line: 150, baseType: !7, size: 32, elements: !981)
!981 = !{!982}
!982 = !DIEnumerator(name: "_FTS_INODE_SORT_DIR_ENTRIES_THRESHOLD", value: 10000, isUnsigned: true)
!983 = !{!66, !890, !191, !64, !158, !436, !984}
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !987)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTSENT", file: !868, line: 257, baseType: !873)
!988 = distinct !DICompileUnit(language: DW_LANG_C99, file: !989, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !165, retainedTypes: !990)
!989 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!990 = !{!153}
!991 = distinct !DICompileUnit(language: DW_LANG_C99, file: !992, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !165)
!992 = !DIFile(filename: "./lib/acl-internal.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!993 = distinct !DICompileUnit(language: DW_LANG_C99, file: !994, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !165, retainedTypes: !757)
!994 = !DIFile(filename: "./lib/get-permissions.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!995 = distinct !DICompileUnit(language: DW_LANG_C99, file: !996, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !165, retainedTypes: !757)
!996 = !DIFile(filename: "./lib/set-permissions.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!997 = distinct !DICompileUnit(language: DW_LANG_C99, file: !998, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !165)
!998 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!999 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1000, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !165)
!1000 = !DIFile(filename: "./lib/cycle-check.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
