source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.Active_dir = type { i64, i64, %struct._ftsent* }
%struct.FTS = type { %struct._ftsent*, %struct._ftsent*, %struct._ftsent**, i64, i8*, i32, i32, i64, i64, i32 (%struct._ftsent**, %struct._ftsent**)*, i32, %struct.hash_table*, %union.anon, %struct.I_ring }
%struct.F_triple = type { i8*, i64, i64 }
%struct.I_ring = type { [4 x i32], i32, i32, i32, i8 }
%struct.Src_to_dest = type { i64, i64, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__acl_entry_ext = type opaque
%struct.__acl_ext = type opaque
%struct.__dirstream = type opaque
%struct.__fsid_t = type { [2 x i32] }
%struct.__mbstate_t = type { i32, %union.anon.56 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct._ftsent = type { %struct._ftsent*, %struct._ftsent*, %struct._ftsent*, %struct.__dirstream*, i64, i8*, i8*, i8*, i32, i32, i64, %struct.FTS*, i64, i64, i64, i16, i16, i16, [1 x %struct.stat], [0 x i8] }

!6 = !DIFile(filename: "./lib/backupfile.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "no_backups", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "simple_backups", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "numbered_existing_backups", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "numbered_backups", value: 3, isUnsigned: true)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Dereference_symlink", file: !14, line: 69, baseType: !7, size: 32, elements: !15)
!14 = !DIFile(filename: "src/copy.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!15 = !{!16, !17, !18, !19}
!16 = !DIEnumerator(name: "DEREF_UNDEFINED", value: 1, isUnsigned: true)
!17 = !DIEnumerator(name: "DEREF_NEVER", value: 2, isUnsigned: true)
!18 = !DIEnumerator(name: "DEREF_COMMAND_LINE_ARGUMENTS", value: 3, isUnsigned: true)
!19 = !DIEnumerator(name: "DEREF_ALWAYS", value: 4, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Interactive", file: !14, line: 60, baseType: !7, size: 32, elements: !21)
!21 = !{!22, !23, !24, !25}
!22 = !DIEnumerator(name: "I_ALWAYS_YES", value: 1, isUnsigned: true)
!23 = !DIEnumerator(name: "I_ALWAYS_NO", value: 2, isUnsigned: true)
!24 = !DIEnumerator(name: "I_ASK_USER", value: 3, isUnsigned: true)
!25 = !DIEnumerator(name: "I_UNSPECIFIED", value: 4, isUnsigned: true)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Sparse_type", file: !14, line: 26, baseType: !7, size: 32, elements: !27)
!27 = !{!28, !29, !30, !31}
!28 = !DIEnumerator(name: "SPARSE_UNUSED", value: 0, isUnsigned: true)
!29 = !DIEnumerator(name: "SPARSE_NEVER", value: 1, isUnsigned: true)
!30 = !DIEnumerator(name: "SPARSE_AUTO", value: 2, isUnsigned: true)
!31 = !DIEnumerator(name: "SPARSE_ALWAYS", value: 3, isUnsigned: true)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Reflink_type", file: !14, line: 47, baseType: !7, size: 32, elements: !33)
!33 = !{!34, !35, !36}
!34 = !DIEnumerator(name: "REFLINK_NEVER", value: 0, isUnsigned: true)
!35 = !DIEnumerator(name: "REFLINK_AUTO", value: 1, isUnsigned: true)
!36 = !DIEnumerator(name: "REFLINK_ALWAYS", value: 2, isUnsigned: true)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !38, line: 32, baseType: !7, size: 32, elements: !39)
!38 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!39 = !{!40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50}
!40 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!41 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!42 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!43 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!44 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!45 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!46 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!47 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!48 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!49 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!50 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rm_interactive", file: !52, line: 23, baseType: !7, size: 32, elements: !53)
!52 = !DIFile(filename: "src/remove.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!53 = !{!54, !55, !56}
!54 = !DIEnumerator(name: "RMI_ALWAYS", value: 3, isUnsigned: true)
!55 = !DIEnumerator(name: "RMI_SOMETIMES", value: 4, isUnsigned: true)
!56 = !DIEnumerator(name: "RMI_NEVER", value: 5, isUnsigned: true)
!57 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RM_status", file: !52, line: 78, baseType: !7, size: 32, elements: !58)
!58 = !{!59, !60, !61, !62}
!59 = !DIEnumerator(name: "RM_OK", value: 2, isUnsigned: true)
!60 = !DIEnumerator(name: "RM_USER_DECLINED", value: 3, isUnsigned: true)
!61 = !DIEnumerator(name: "RM_ERROR", value: 4, isUnsigned: true)
!62 = !DIEnumerator(name: "RM_NONEMPTY_DIR", value: 5, isUnsigned: true)
!63 = !{!64, !66}
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!67 = !{!68, !0, !71}
!68 = !DIGlobalVariableExpression(var: !69, expr: !DIExpression())
!69 = distinct !DIGlobalVariable(name: "remove_trailing_slashes", scope: !2, file: !3, line: 54, type: !70, isLocal: true, isDefinition: true)
!70 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(name: "dev_ino_buf", scope: !73, file: !3, line: 96, type: !86, isLocal: true, isDefinition: true)
!73 = distinct !DISubprogram(name: "rm_option_init", scope: !3, file: !3, line: 75, type: !74, scopeLine: 76, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !102)
!74 = !DISubroutineType(types: !75)
!75 = !{null, !76}
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rm_options", file: !52, line: 32, size: 256, elements: !78)
!78 = !{!79, !80, !81, !82, !83, !84, !98, !99, !100, !101}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_missing_files", scope: !77, file: !52, line: 35, baseType: !70, size: 8)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !77, file: !52, line: 38, baseType: !51, size: 32, offset: 32)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "one_file_system", scope: !77, file: !52, line: 47, baseType: !70, size: 8, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !77, file: !52, line: 50, baseType: !70, size: 8, offset: 72)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "remove_empty_directories", scope: !77, file: !52, line: 53, baseType: !70, size: 8, offset: 80)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "root_dev_ino", scope: !77, file: !52, line: 57, baseType: !85, size: 64, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !87, line: 7, size: 128, elements: !88)
!87 = !DIFile(filename: "./lib/dev-ino.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!88 = !{!89, !95}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !86, file: !87, line: 9, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !91, line: 47, baseType: !92)
!91 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !93, line: 148, baseType: !94)
!93 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!94 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !86, file: !87, line: 10, baseType: !96, size: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !91, line: 59, baseType: !97)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !93, line: 145, baseType: !94)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_all_root", scope: !77, file: !52, line: 61, baseType: !70, size: 8, offset: 192)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_tty", scope: !77, file: !52, line: 64, baseType: !70, size: 8, offset: 200)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !77, file: !52, line: 67, baseType: !70, size: 8, offset: 208)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "require_restore_cwd", scope: !77, file: !52, line: 75, baseType: !70, size: 8, offset: 216)
!102 = !{!103}
!103 = !DILocalVariable(name: "x", arg: 1, scope: !73, file: !3, line: 75, type: !76)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 3584, elements: !117)
!105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !106)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !107, line: 50, size: 256, elements: !108)
!107 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!108 = !{!109, !112, !114, !116}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !106, file: !107, line: 52, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !106, file: !107, line: 55, baseType: !113, size: 32, offset: 64)
!113 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !106, file: !107, line: 56, baseType: !115, size: 64, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !106, file: !107, line: 57, baseType: !113, size: 32, offset: 192)
!117 = !{!118}
!118 = !DISubrange(count: 14)
!119 = !DIGlobalVariableExpression(var: !69, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(name: "top_level_src_name", scope: !122, file: !123, line: 147, type: !110, isLocal: true, isDefinition: true)
!122 = distinct !DICompileUnit(language: DW_LANG_C99, file: !123, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !124, retainedTypes: !149, globals: !155, nameTableKind: None)
!123 = !DIFile(filename: "src/copy.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!124 = !{!5, !13, !20, !26, !32, !37, !125, !129, !136, !145}
!125 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !126, line: 27, baseType: !7, size: 32, elements: !127)
!126 = !DIFile(filename: "./lib/utimecmp.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!127 = !{!128}
!128 = !DIEnumerator(name: "UTIMECMP_TRUNCATE_SOURCE", value: 1, isUnsigned: true)
!129 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "savedir_option", file: !130, line: 26, baseType: !7, size: 32, elements: !131)
!130 = !DIFile(filename: "./lib/savedir.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!131 = !{!132, !133, !134, !135}
!132 = !DIEnumerator(name: "SAVEDIR_SORT_NONE", value: 0, isUnsigned: true)
!133 = !DIEnumerator(name: "SAVEDIR_SORT_NAME", value: 1, isUnsigned: true)
!134 = !DIEnumerator(name: "SAVEDIR_SORT_INODE", value: 2, isUnsigned: true)
!135 = !DIEnumerator(name: "SAVEDIR_SORT_FASTREAD", value: 2, isUnsigned: true)
!136 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !137, line: 45, baseType: !7, size: 32, elements: !138)
!137 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!138 = !{!139, !140, !141, !142, !143, !144}
!139 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0, isUnsigned: true)
!140 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2, isUnsigned: true)
!141 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5, isUnsigned: true)
!142 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4, isUnsigned: true)
!143 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3, isUnsigned: true)
!144 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1, isUnsigned: true)
!145 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !146, line: 73, baseType: !7, size: 32, elements: !147)
!146 = !DIFile(filename: "src/ioblksize.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!147 = !{!148}
!148 = !DIEnumerator(name: "IO_BUFSIZE", value: 131072, isUnsigned: true)
!149 = !{!150, !66, !7, !64, !94, !152, !153}
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !91, line: 69, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !93, line: 150, baseType: !7)
!152 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !154, line: 46, baseType: !94)
!154 = !DIFile(filename: "/usr/lib/clang/12.0.1/include/stddef.h", directory: "")
!155 = !{!156, !120, !162, !164, !178, !180}
!156 = !DIGlobalVariableExpression(var: !157, expr: !DIExpression())
!157 = distinct !DIGlobalVariable(name: "mask", scope: !158, file: !123, line: 3087, type: !150, isLocal: true, isDefinition: true)
!158 = distinct !DISubprogram(name: "cached_umask", scope: !123, file: !123, line: 3085, type: !159, scopeLine: 3086, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !122, retainedNodes: !161)
!159 = !DISubroutineType(types: !160)
!160 = !{!150}
!161 = !{}
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(name: "top_level_dst_name", scope: !122, file: !123, line: 148, type: !110, isLocal: true, isDefinition: true)
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(name: "zeros", scope: !166, file: !123, line: 385, type: !64, isLocal: true, isDefinition: true)
!166 = distinct !DISubprogram(name: "write_zeros", scope: !123, file: !123, line: 383, type: !167, scopeLine: 384, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !122, retainedNodes: !173)
!167 = !DISubroutineType(types: !168)
!168 = !{!70, !113, !169}
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !170, line: 63, baseType: !171)
!170 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !93, line: 152, baseType: !172)
!172 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!173 = !{!174, !175, !176}
!174 = !DILocalVariable(name: "fd", arg: 1, scope: !166, file: !123, line: 383, type: !113)
!175 = !DILocalVariable(name: "n_bytes", arg: 2, scope: !166, file: !123, line: 383, type: !169)
!176 = !DILocalVariable(name: "n", scope: !177, file: !123, line: 404, type: !153)
!177 = distinct !DILexicalBlock(scope: !166, file: !123, line: 403, column: 5)
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(name: "nz", scope: !166, file: !123, line: 386, type: !153, isLocal: true, isDefinition: true)
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(name: "fallback", scope: !166, file: !123, line: 393, type: !182, isLocal: true, isDefinition: true)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 8192, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 1024)
!185 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709421568, DW_OP_mul, DW_OP_constu, 131072, DW_OP_plus, DW_OP_stack_value))
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "src_to_dest", scope: !188, file: !189, line: 45, type: !195, isLocal: true, isDefinition: true)
!188 = distinct !DICompileUnit(language: DW_LANG_C99, file: !189, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !161, retainedTypes: !190, globals: !194, nameTableKind: None)
!189 = !DIFile(filename: "src/cp-hash.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!190 = !{!66, !64, !191}
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !192, line: 102, baseType: !193)
!192 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !93, line: 73, baseType: !94)
!194 = !{!186}
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !197, line: 69, baseType: !198)
!197 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !197, line: 67, flags: DIFlagFwdDecl)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(name: "simple_pattern", scope: !201, file: !202, line: 38, type: !211, isLocal: true, isDefinition: true)
!201 = distinct !DICompileUnit(language: DW_LANG_C99, file: !202, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !203, globals: !210, nameTableKind: None)
!202 = !DIFile(filename: "src/force-link.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!203 = !{!204, !207}
!204 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !202, line: 39, baseType: !7, size: 32, elements: !205)
!205 = !{!206}
!206 = !DIEnumerator(name: "x_suffix_len", value: 6, isUnsigned: true)
!207 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !202, line: 44, baseType: !7, size: 32, elements: !208)
!208 = !{!209}
!209 = !DIEnumerator(name: "smallsize", value: 256, isUnsigned: true)
!210 = !{!199}
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 72, elements: !212)
!212 = !{!213}
!213 = !DISubrange(count: 9)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(name: "Version", scope: !216, file: !217, line: 2, type: !110, isDefinition: true)
!216 = distinct !DICompileUnit(language: DW_LANG_C99, file: !217, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !161, globals: !218, nameTableKind: None)
!217 = !DIFile(filename: "src/version.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!218 = !{!214}
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(name: "simple_backup_suffix", scope: !221, file: !222, line: 82, type: !110, isDefinition: true)
!221 = distinct !DICompileUnit(language: DW_LANG_C99, file: !222, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !223, retainedTypes: !284, globals: !285, nameTableKind: None)
!222 = !DIFile(filename: "lib/backupfile.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!223 = !{!5, !224, !254, !260}
!224 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !225, file: !222, line: 327, baseType: !7, size: 32, elements: !252)
!225 = distinct !DISubprogram(name: "backupfile_internal", scope: !222, file: !222, line: 314, type: !226, scopeLine: 316, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !221, retainedNodes: !228)
!226 = !DISubroutineType(types: !227)
!227 = !{!64, !113, !110, !5, !70}
!228 = !{!229, !230, !231, !232, !233, !235, !236, !237, !238, !241, !242, !247, !248, !249, !251}
!229 = !DILocalVariable(name: "dir_fd", arg: 1, scope: !225, file: !222, line: 314, type: !113)
!230 = !DILocalVariable(name: "file", arg: 2, scope: !225, file: !222, line: 314, type: !110)
!231 = !DILocalVariable(name: "backup_type", arg: 3, scope: !225, file: !222, line: 315, type: !5)
!232 = !DILocalVariable(name: "rename", arg: 4, scope: !225, file: !222, line: 315, type: !70)
!233 = !DILocalVariable(name: "base_offset", scope: !225, file: !222, line: 317, type: !234)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !154, line: 35, baseType: !172)
!235 = !DILocalVariable(name: "filelen", scope: !225, file: !222, line: 318, type: !153)
!236 = !DILocalVariable(name: "simple_backup_suffix_size", scope: !225, file: !222, line: 325, type: !153)
!237 = !DILocalVariable(name: "backup_suffix_size_guess", scope: !225, file: !222, line: 326, type: !153)
!238 = !DILocalVariable(name: "ssize", scope: !225, file: !222, line: 331, type: !239)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !91, line: 108, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !93, line: 194, baseType: !172)
!241 = !DILocalVariable(name: "s", scope: !225, file: !222, line: 332, type: !64)
!242 = !DILocalVariable(name: "dirp", scope: !225, file: !222, line: 336, type: !243)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !245, line: 127, baseType: !246)
!245 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !245, line: 127, flags: DIFlagFwdDecl)
!247 = !DILocalVariable(name: "sdir", scope: !225, file: !222, line: 337, type: !113)
!248 = !DILocalVariable(name: "base_max", scope: !225, file: !222, line: 338, type: !153)
!249 = !DILocalVariable(name: "flags", scope: !250, file: !222, line: 380, type: !7)
!250 = distinct !DILexicalBlock(scope: !225, file: !222, line: 340, column: 5)
!251 = !DILocalVariable(name: "e", scope: !250, file: !222, line: 383, type: !113)
!252 = !{!253}
!253 = !DIEnumerator(name: "GUESS", value: 9, isUnsigned: true)
!254 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "numbered_backup_result", file: !222, line: 172, baseType: !7, size: 32, elements: !255)
!255 = !{!256, !257, !258, !259}
!256 = !DIEnumerator(name: "BACKUP_IS_SAME_LENGTH", value: 0, isUnsigned: true)
!257 = !DIEnumerator(name: "BACKUP_IS_LONGER", value: 1, isUnsigned: true)
!258 = !DIEnumerator(name: "BACKUP_IS_NEW", value: 2, isUnsigned: true)
!259 = !DIEnumerator(name: "BACKUP_NOMEM", value: 3, isUnsigned: true)
!260 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !261, line: 24, baseType: !7, size: 32, elements: !262)
!261 = !DIFile(filename: "/usr/include/bits/confname.h", directory: "")
!262 = !{!263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283}
!263 = !DIEnumerator(name: "_PC_LINK_MAX", value: 0, isUnsigned: true)
!264 = !DIEnumerator(name: "_PC_MAX_CANON", value: 1, isUnsigned: true)
!265 = !DIEnumerator(name: "_PC_MAX_INPUT", value: 2, isUnsigned: true)
!266 = !DIEnumerator(name: "_PC_NAME_MAX", value: 3, isUnsigned: true)
!267 = !DIEnumerator(name: "_PC_PATH_MAX", value: 4, isUnsigned: true)
!268 = !DIEnumerator(name: "_PC_PIPE_BUF", value: 5, isUnsigned: true)
!269 = !DIEnumerator(name: "_PC_CHOWN_RESTRICTED", value: 6, isUnsigned: true)
!270 = !DIEnumerator(name: "_PC_NO_TRUNC", value: 7, isUnsigned: true)
!271 = !DIEnumerator(name: "_PC_VDISABLE", value: 8, isUnsigned: true)
!272 = !DIEnumerator(name: "_PC_SYNC_IO", value: 9, isUnsigned: true)
!273 = !DIEnumerator(name: "_PC_ASYNC_IO", value: 10, isUnsigned: true)
!274 = !DIEnumerator(name: "_PC_PRIO_IO", value: 11, isUnsigned: true)
!275 = !DIEnumerator(name: "_PC_SOCK_MAXBUF", value: 12, isUnsigned: true)
!276 = !DIEnumerator(name: "_PC_FILESIZEBITS", value: 13, isUnsigned: true)
!277 = !DIEnumerator(name: "_PC_REC_INCR_XFER_SIZE", value: 14, isUnsigned: true)
!278 = !DIEnumerator(name: "_PC_REC_MAX_XFER_SIZE", value: 15, isUnsigned: true)
!279 = !DIEnumerator(name: "_PC_REC_MIN_XFER_SIZE", value: 16, isUnsigned: true)
!280 = !DIEnumerator(name: "_PC_REC_XFER_ALIGN", value: 17, isUnsigned: true)
!281 = !DIEnumerator(name: "_PC_ALLOC_SIZE_MIN", value: 18, isUnsigned: true)
!282 = !DIEnumerator(name: "_PC_SYMLINK_MAX", value: 19, isUnsigned: true)
!283 = !DIEnumerator(name: "_PC_2_SYMLINKS", value: 20, isUnsigned: true)
!284 = !{!66, !7, !153}
!285 = !{!219}
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(name: "backup_args", scope: !288, file: !289, line: 42, type: !301, isLocal: true, isDefinition: true)
!288 = distinct !DICompileUnit(language: DW_LANG_C99, file: !289, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !290, retainedTypes: !291, globals: !294, nameTableKind: None)
!289 = !DIFile(filename: "lib/backup-find.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!290 = !{!5}
!291 = !{!292}
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!294 = !{!295, !286}
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "backup_types", scope: !288, file: !289, line: 53, type: !297, isLocal: true, isDefinition: true)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !298, size: 256, elements: !299)
!298 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!299 = !{!300}
!300 = !DISubrange(count: 8)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !302, size: 576, elements: !212)
!302 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "file_name", scope: !305, file: !306, line: 37, type: !110, isLocal: true, isDefinition: true)
!305 = distinct !DICompileUnit(language: DW_LANG_C99, file: !306, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !161, globals: !307, nameTableKind: None)
!306 = !DIFile(filename: "lib/closein.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!307 = !{!303}
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(name: "file_name", scope: !310, file: !311, line: 46, type: !110, isLocal: true, isDefinition: true)
!310 = distinct !DICompileUnit(language: DW_LANG_C99, file: !311, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !161, globals: !312, nameTableKind: None)
!311 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!312 = !{!308, !313}
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !310, file: !311, line: 56, type: !70, isLocal: true, isDefinition: true)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(name: "exit_failure", scope: !317, file: !318, line: 24, type: !320, isDefinition: true)
!317 = distinct !DICompileUnit(language: DW_LANG_C99, file: !318, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !161, globals: !319, nameTableKind: None)
!318 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!319 = !{!315}
!320 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !113)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(name: "default_tuning", scope: !323, file: !324, line: 130, type: !327, isLocal: true, isDefinition: true)
!323 = distinct !DICompileUnit(language: DW_LANG_C99, file: !324, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !161, retainedTypes: !325, globals: !326, nameTableKind: None)
!324 = !DIFile(filename: "lib/hash.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!325 = !{!94, !66, !153}
!326 = !{!321}
!327 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !328)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !197, line: 65, baseType: !329)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !197, line: 53, size: 160, elements: !330)
!330 = !{!331, !333, !334, !335, !336}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !329, file: !197, line: 58, baseType: !332, size: 32)
!332 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !329, file: !197, line: 59, baseType: !332, size: 32, offset: 32)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !329, file: !197, line: 60, baseType: !332, size: 32, offset: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !329, file: !197, line: 61, baseType: !332, size: 32, offset: 96)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !329, file: !197, line: 62, baseType: !70, size: 8, offset: 128)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(name: "program_name", scope: !339, file: !340, line: 33, type: !110, isDefinition: true)
!339 = distinct !DICompileUnit(language: DW_LANG_C99, file: !340, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !161, retainedTypes: !341, globals: !342, nameTableKind: None)
!340 = !DIFile(filename: "lib/progname.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!341 = !{!66, !64}
!342 = !{!337}
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !345, file: !346, line: 85, type: !405, isDefinition: true)
!345 = distinct !DICompileUnit(language: DW_LANG_C99, file: !346, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !347, retainedTypes: !368, globals: !370, nameTableKind: None)
!346 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!347 = !{!37, !348, !353}
!348 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !38, line: 242, baseType: !7, size: 32, elements: !349)
!349 = !{!350, !351, !352}
!350 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!351 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!352 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!353 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !354, line: 46, baseType: !7, size: 32, elements: !355)
!354 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!355 = !{!356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367}
!356 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!357 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!358 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!359 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!360 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!361 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!362 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!363 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!364 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!365 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!366 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!367 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!368 = !{!113, !369, !153, !64}
!369 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!370 = !{!343, !371, !377, !387, !389, !394, !401, !403}
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !345, file: !346, line: 101, type: !373, isDefinition: true)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !374, size: 320, elements: !375)
!374 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!375 = !{!376}
!376 = !DISubrange(count: 10)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !345, file: !346, line: 1052, type: !379, isDefinition: true)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !346, line: 65, size: 448, elements: !380)
!380 = !{!381, !382, !383, !385, !386}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !379, file: !346, line: 68, baseType: !37, size: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !379, file: !346, line: 71, baseType: !113, size: 32, offset: 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !379, file: !346, line: 75, baseType: !384, size: 256, offset: 64)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !299)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !379, file: !346, line: 78, baseType: !110, size: 64, offset: 320)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !379, file: !346, line: 81, baseType: !110, size: 64, offset: 384)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !345, file: !346, line: 116, type: !379, isLocal: true, isDefinition: true)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "slot0", scope: !345, file: !346, line: 842, type: !391, isLocal: true, isDefinition: true)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 2048, elements: !392)
!392 = !{!393}
!393 = !DISubrange(count: 256)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(name: "slotvec", scope: !345, file: !346, line: 845, type: !396, isLocal: true, isDefinition: true)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !346, line: 834, size: 128, elements: !398)
!398 = !{!399, !400}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !397, file: !346, line: 836, baseType: !153, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !397, file: !346, line: 837, baseType: !64, size: 64, offset: 64)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "nslots", scope: !345, file: !346, line: 843, type: !113, isLocal: true, isDefinition: true)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(name: "slotvec0", scope: !345, file: !346, line: 844, type: !397, isLocal: true, isDefinition: true)
!405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !302, size: 704, elements: !406)
!406 = !{!407}
!407 = !DISubrange(count: 11)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(name: "comparison_function_table", scope: !410, file: !411, line: 74, type: !428, isLocal: true, isDefinition: true)
!410 = distinct !DICompileUnit(language: DW_LANG_C99, file: !411, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !412, retainedTypes: !426, globals: !427, nameTableKind: None)
!411 = !DIFile(filename: "lib/savedir.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!412 = !{!129, !413}
!413 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !415, file: !414, line: 186, baseType: !7, size: 32, elements: !424)
!414 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!415 = distinct !DISubprogram(name: "x2nrealloc", scope: !414, file: !414, line: 174, type: !416, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !410, retainedNodes: !419)
!416 = !DISubroutineType(types: !417)
!417 = !{!66, !66, !418, !153}
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!419 = !{!420, !421, !422, !423}
!420 = !DILocalVariable(name: "p", arg: 1, scope: !415, file: !414, line: 174, type: !66)
!421 = !DILocalVariable(name: "pn", arg: 2, scope: !415, file: !414, line: 174, type: !418)
!422 = !DILocalVariable(name: "s", arg: 3, scope: !415, file: !414, line: 174, type: !153)
!423 = !DILocalVariable(name: "n", scope: !415, file: !414, line: 176, type: !153)
!424 = !{!425}
!425 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!426 = !{!66, !153}
!427 = !{!408}
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !429, size: 192, elements: !434)
!429 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !430)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "comparison_function", file: !411, line: 72, baseType: !431)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{!113, !292, !292}
!434 = !{!435}
!435 = !DISubrange(count: 3)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(name: "letters", scope: !438, file: !439, line: 184, type: !441, isLocal: true, isDefinition: true)
!438 = distinct !DICompileUnit(language: DW_LANG_C99, file: !439, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !161, globals: !440, nameTableKind: None)
!439 = !DIFile(filename: "lib/tempname.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!440 = !{!436}
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 504, elements: !442)
!442 = !{!443}
!443 = !DISubrange(count: 63)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "ht", scope: !446, file: !447, line: 163, type: !195, isLocal: true, isDefinition: true)
!446 = distinct !DISubprogram(name: "utimecmpat", scope: !447, file: !447, line: 132, type: !448, scopeLine: 136, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !483, retainedNodes: !497)
!447 = !DIFile(filename: "lib/utimecmp.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!448 = !DISubroutineType(types: !449)
!449 = !{!113, !113, !110, !450, !450, !113}
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !452)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !453, line: 26, size: 1152, elements: !454)
!453 = !DIFile(filename: "/usr/include/bits/struct_stat.h", directory: "")
!454 = !{!455, !456, !457, !459, !460, !462, !464, !465, !466, !467, !469, !471, !479, !480, !481}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !452, file: !453, line: 28, baseType: !97, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !452, file: !453, line: 33, baseType: !92, size: 64, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !452, file: !453, line: 41, baseType: !458, size: 64, offset: 128)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !93, line: 151, baseType: !94)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !452, file: !453, line: 42, baseType: !151, size: 32, offset: 192)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !452, file: !453, line: 44, baseType: !461, size: 32, offset: 224)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !93, line: 146, baseType: !7)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !452, file: !453, line: 45, baseType: !463, size: 32, offset: 256)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !93, line: 147, baseType: !7)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !452, file: !453, line: 47, baseType: !113, size: 32, offset: 288)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !452, file: !453, line: 49, baseType: !97, size: 64, offset: 320)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !452, file: !453, line: 54, baseType: !171, size: 64, offset: 384)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !452, file: !453, line: 58, baseType: !468, size: 64, offset: 448)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !93, line: 175, baseType: !172)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !452, file: !453, line: 60, baseType: !470, size: 64, offset: 512)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !93, line: 180, baseType: !172)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !452, file: !453, line: 71, baseType: !472, size: 128, offset: 576)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !473, line: 10, size: 128, elements: !474)
!473 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!474 = !{!475, !477}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !472, file: !473, line: 12, baseType: !476, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !93, line: 160, baseType: !172)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !472, file: !473, line: 16, baseType: !478, size: 64, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !93, line: 197, baseType: !172)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !452, file: !453, line: 72, baseType: !472, size: 128, offset: 704)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !452, file: !453, line: 73, baseType: !472, size: 128, offset: 832)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !452, file: !453, line: 86, baseType: !482, size: 192, offset: 960)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !478, size: 192, elements: !434)
!483 = distinct !DICompileUnit(language: DW_LANG_C99, file: !447, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !484, globals: !488, nameTableKind: None)
!484 = !{!125, !485}
!485 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !447, line: 49, baseType: !7, size: 32, elements: !486)
!486 = !{!487}
!487 = !DIEnumerator(name: "SYSCALL_RESOLUTION", value: 1, isUnsigned: true)
!488 = !{!444, !489}
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(name: "new_dst_res", scope: !446, file: !447, line: 166, type: !491, isLocal: true, isDefinition: true)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fs_res", file: !447, line: 66, size: 128, elements: !493)
!493 = !{!494, !495, !496}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !492, file: !447, line: 69, baseType: !96, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "resolution", scope: !492, file: !447, line: 76, baseType: !113, size: 32, offset: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "exact", scope: !492, file: !447, line: 80, baseType: !70, size: 8, offset: 96)
!497 = !{!498, !499, !500, !501, !502, !503, !506, !507, !508, !509, !512, !513, !514, !517, !518, !519, !520, !521, !522, !524, !527, !528, !529, !530, !536, !537, !539, !541, !543, !544}
!498 = !DILocalVariable(name: "dfd", arg: 1, scope: !446, file: !447, line: 132, type: !113)
!499 = !DILocalVariable(name: "dst_name", arg: 2, scope: !446, file: !447, line: 132, type: !110)
!500 = !DILocalVariable(name: "dst_stat", arg: 3, scope: !446, file: !447, line: 133, type: !450)
!501 = !DILocalVariable(name: "src_stat", arg: 4, scope: !446, file: !447, line: 134, type: !450)
!502 = !DILocalVariable(name: "options", arg: 5, scope: !446, file: !447, line: 135, type: !113)
!503 = !DILocalVariable(name: "dst_s", scope: !446, file: !447, line: 153, type: !504)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !505, line: 7, baseType: !476)
!505 = !DIFile(filename: "/usr/include/bits/types/time_t.h", directory: "")
!506 = !DILocalVariable(name: "src_s", scope: !446, file: !447, line: 154, type: !504)
!507 = !DILocalVariable(name: "dst_ns", scope: !446, file: !447, line: 155, type: !113)
!508 = !DILocalVariable(name: "src_ns", scope: !446, file: !447, line: 156, type: !113)
!509 = !DILocalVariable(name: "dst_res", scope: !510, file: !447, line: 167, type: !491)
!510 = distinct !DILexicalBlock(scope: !511, file: !447, line: 159, column: 5)
!511 = distinct !DILexicalBlock(scope: !446, file: !447, line: 158, column: 7)
!512 = !DILocalVariable(name: "tmp_dst_res", scope: !510, file: !447, line: 168, type: !492)
!513 = !DILocalVariable(name: "res", scope: !510, file: !447, line: 171, type: !113)
!514 = !DILocalVariable(name: "dst_a_s", scope: !515, file: !447, line: 262, type: !504)
!515 = distinct !DILexicalBlock(scope: !516, file: !447, line: 258, column: 9)
!516 = distinct !DILexicalBlock(scope: !510, file: !447, line: 257, column: 11)
!517 = !DILocalVariable(name: "dst_c_s", scope: !515, file: !447, line: 263, type: !504)
!518 = !DILocalVariable(name: "dst_m_s", scope: !515, file: !447, line: 264, type: !504)
!519 = !DILocalVariable(name: "dst_a_ns", scope: !515, file: !447, line: 265, type: !113)
!520 = !DILocalVariable(name: "dst_c_ns", scope: !515, file: !447, line: 266, type: !113)
!521 = !DILocalVariable(name: "dst_m_ns", scope: !515, file: !447, line: 267, type: !113)
!522 = !DILocalVariable(name: "odd_second", scope: !523, file: !447, line: 276, type: !70)
!523 = distinct !DILexicalBlock(scope: !515, file: !447, line: 275, column: 11)
!524 = !DILocalVariable(name: "a", scope: !525, file: !447, line: 285, type: !113)
!525 = distinct !DILexicalBlock(scope: !526, file: !447, line: 284, column: 15)
!526 = distinct !DILexicalBlock(scope: !523, file: !447, line: 278, column: 17)
!527 = !DILocalVariable(name: "c", scope: !525, file: !447, line: 286, type: !113)
!528 = !DILocalVariable(name: "m", scope: !525, file: !447, line: 287, type: !113)
!529 = !DILocalVariable(name: "SR10", scope: !525, file: !447, line: 291, type: !113)
!530 = !DILocalVariable(name: "timespec", scope: !531, file: !447, line: 313, type: !533)
!531 = distinct !DILexicalBlock(scope: !532, file: !447, line: 312, column: 13)
!532 = distinct !DILexicalBlock(scope: !515, file: !447, line: 311, column: 15)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !472, size: 256, elements: !534)
!534 = !{!535}
!535 = !DISubrange(count: 2)
!536 = !DILocalVariable(name: "dst_status", scope: !531, file: !447, line: 314, type: !452)
!537 = !DILocalVariable(name: "s", scope: !538, file: !447, line: 324, type: !504)
!538 = distinct !DILexicalBlock(scope: !531, file: !447, line: 323, column: 15)
!539 = !DILocalVariable(name: "stat_result", scope: !540, file: !447, line: 348, type: !113)
!540 = distinct !DILexicalBlock(scope: !531, file: !447, line: 347, column: 15)
!541 = !DILocalVariable(name: "old_res", scope: !542, file: !447, line: 369, type: !113)
!542 = distinct !DILexicalBlock(scope: !531, file: !447, line: 368, column: 15)
!543 = !DILocalVariable(name: "a", scope: !542, file: !447, line: 370, type: !113)
!544 = !DILabel(scope: !545, name: "low_memory", file: !447, line: 211)
!545 = distinct !DILexicalBlock(scope: !546, file: !447, line: 210, column: 9)
!546 = distinct !DILexicalBlock(scope: !510, file: !447, line: 187, column: 11)
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(name: "utimensat_works_really", scope: !549, file: !550, line: 75, type: !113, isLocal: true, isDefinition: true)
!549 = distinct !DICompileUnit(language: DW_LANG_C99, file: !550, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !551, globals: !556, nameTableKind: None)
!550 = !DIFile(filename: "lib/utimens.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!551 = !{!552}
!552 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !553, line: 42, baseType: !7, size: 32, elements: !554)
!553 = !DIFile(filename: "./lib/timespec.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!554 = !{!555}
!555 = !DIEnumerator(name: "TIMESPEC_HZ", value: 1000000000, isUnsigned: true)
!556 = !{!547, !557}
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(name: "lutimensat_works_really", scope: !549, file: !550, line: 76, type: !113, isLocal: true, isDefinition: true)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !561, file: !562, line: 26, type: !564, isDefinition: true)
!561 = distinct !DICompileUnit(language: DW_LANG_C99, file: !562, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !161, globals: !563, nameTableKind: None)
!562 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!563 = !{!559}
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 376, elements: !565)
!565 = !{!566}
!566 = !DISubrange(count: 47)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!568 = distinct !DIGlobalVariable(name: "initialized", scope: !569, file: !570, line: 34, type: !70, isLocal: true, isDefinition: true)
!569 = distinct !DISubprogram(name: "can_write_any_file", scope: !570, file: !570, line: 32, type: !571, scopeLine: 33, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !573, retainedNodes: !578)
!570 = !DIFile(filename: "lib/write-any-file.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!571 = !DISubroutineType(types: !572)
!572 = !{!70}
!573 = distinct !DICompileUnit(language: DW_LANG_C99, file: !570, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !161, globals: !574, nameTableKind: None)
!574 = !{!575, !576}
!575 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(name: "can_write", scope: !569, file: !570, line: 35, type: !70, isLocal: true, isDefinition: true)
!578 = !{!579}
!579 = !DILocalVariable(name: "can", scope: !580, file: !570, line: 39, type: !70)
!580 = distinct !DILexicalBlock(scope: !581, file: !570, line: 38, column: 5)
!581 = distinct !DILexicalBlock(scope: !569, file: !570, line: 37, column: 7)
!582 = !DIGlobalVariableExpression(var: !583, expr: !DIExpression())
!583 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !584, file: !585, line: 67, type: !589, isDefinition: true)
!584 = distinct !DICompileUnit(language: DW_LANG_C99, file: !585, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !586, retainedTypes: !587, globals: !588, nameTableKind: None)
!585 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!586 = !{!37}
!587 = !{!66, !110, !152}
!588 = !{!582}
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !590, line: 61, baseType: !591)
!590 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DISubroutineType(types: !593)
!593 = !{null}
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !596, file: !597, line: 507, type: !113, isLocal: true, isDefinition: true)
!596 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !597, file: !597, line: 488, type: !598, scopeLine: 489, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !600, retainedNodes: !602)
!597 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!598 = !DISubroutineType(types: !599)
!599 = !{!113, !113, !113}
!600 = distinct !DICompileUnit(language: DW_LANG_C99, file: !597, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !161, globals: !601, nameTableKind: None)
!601 = !{!594}
!602 = !{!603, !604, !605, !606, !609}
!603 = !DILocalVariable(name: "fd", arg: 1, scope: !596, file: !597, line: 488, type: !113)
!604 = !DILocalVariable(name: "target", arg: 2, scope: !596, file: !597, line: 488, type: !113)
!605 = !DILocalVariable(name: "result", scope: !596, file: !597, line: 490, type: !113)
!606 = !DILocalVariable(name: "flags", scope: !607, file: !597, line: 531, type: !113)
!607 = distinct !DILexicalBlock(scope: !608, file: !597, line: 530, column: 5)
!608 = distinct !DILexicalBlock(scope: !596, file: !597, line: 529, column: 7)
!609 = !DILocalVariable(name: "saved_errno", scope: !610, file: !597, line: 534, type: !113)
!610 = distinct !DILexicalBlock(scope: !611, file: !597, line: 533, column: 9)
!611 = distinct !DILexicalBlock(scope: !607, file: !597, line: 532, column: 11)
!612 = distinct !DICompileUnit(language: DW_LANG_C99, file: !613, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !614, retainedTypes: !635, nameTableKind: None)
!613 = !DIFile(filename: "src/remove.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!614 = !{!57, !51, !37, !615, !620, !624}
!615 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ternary", file: !613, line: 35, baseType: !7, size: 32, elements: !616)
!616 = !{!617, !618, !619}
!617 = !DIEnumerator(name: "T_UNKNOWN", value: 2, isUnsigned: true)
!618 = !DIEnumerator(name: "T_NO", value: 3, isUnsigned: true)
!619 = !DIEnumerator(name: "T_YES", value: 4, isUnsigned: true)
!620 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Prompt_action", file: !613, line: 46, baseType: !7, size: 32, elements: !621)
!621 = !{!622, !623}
!622 = !DIEnumerator(name: "PA_DESCEND_INTO_DIR", value: 2, isUnsigned: true)
!623 = !DIEnumerator(name: "PA_REMOVE_DIR", value: 3, isUnsigned: true)
!624 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !245, line: 97, baseType: !7, size: 32, elements: !625)
!625 = !{!626, !627, !628, !629, !630, !631, !632, !633, !634}
!626 = !DIEnumerator(name: "DT_UNKNOWN", value: 0, isUnsigned: true)
!627 = !DIEnumerator(name: "DT_FIFO", value: 1, isUnsigned: true)
!628 = !DIEnumerator(name: "DT_CHR", value: 2, isUnsigned: true)
!629 = !DIEnumerator(name: "DT_DIR", value: 4, isUnsigned: true)
!630 = !DIEnumerator(name: "DT_BLK", value: 6, isUnsigned: true)
!631 = !DIEnumerator(name: "DT_REG", value: 8, isUnsigned: true)
!632 = !DIEnumerator(name: "DT_LNK", value: 10, isUnsigned: true)
!633 = !DIEnumerator(name: "DT_SOCK", value: 12, isUnsigned: true)
!634 = !DIEnumerator(name: "DT_WHT", value: 14, isUnsigned: true)
!635 = !{!66, !113}
!636 = distinct !DICompileUnit(language: DW_LANG_C99, file: !637, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !638, retainedTypes: !719, nameTableKind: None)
!637 = !DIFile(filename: "src/extent-scan.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!638 = !{!639}
!639 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !640, file: !637, line: 98, baseType: !7, size: 32, elements: !717)
!640 = distinct !DISubprogram(name: "extent_scan_read", scope: !637, file: !637, line: 87, type: !641, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !636, retainedNodes: !661)
!641 = !DISubroutineType(types: !642)
!642 = !{!70, !643}
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extent_scan", file: !645, line: 36, size: 384, elements: !646)
!645 = !DIFile(filename: "src/extent-scan.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!646 = !{!647, !648, !650, !651, !652, !653, !654}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !644, file: !645, line: 39, baseType: !113, size: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "scan_start", scope: !644, file: !645, line: 42, baseType: !649, size: 64, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !91, line: 85, baseType: !171)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "fm_flags", scope: !644, file: !645, line: 45, baseType: !7, size: 32, offset: 128)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "ei_count", scope: !644, file: !645, line: 48, baseType: !153, size: 64, offset: 192)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "initial_scan_failed", scope: !644, file: !645, line: 52, baseType: !70, size: 8, offset: 256)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "hit_final_extent", scope: !644, file: !645, line: 55, baseType: !70, size: 8, offset: 264)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "ext_info", scope: !644, file: !645, line: 58, baseType: !655, size: 64, offset: 320)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extent_info", file: !645, line: 23, size: 192, elements: !657)
!657 = !{!658, !659, !660}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "ext_logical", scope: !656, file: !645, line: 26, baseType: !649, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "ext_length", scope: !656, file: !645, line: 29, baseType: !649, size: 64, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "ext_flags", scope: !656, file: !645, line: 32, baseType: !7, size: 32, offset: 128)
!661 = !{!662, !663, !664, !665, !702, !704, !706, !708, !709, !716}
!662 = !DILocalVariable(name: "scan", arg: 1, scope: !640, file: !637, line: 87, type: !643)
!663 = !DILocalVariable(name: "si", scope: !640, file: !637, line: 89, type: !7)
!664 = !DILocalVariable(name: "last_ei", scope: !640, file: !637, line: 90, type: !655)
!665 = !DILocalVariable(name: "fiemap_buf", scope: !666, file: !637, line: 94, type: !667)
!666 = distinct !DILexicalBlock(scope: !640, file: !637, line: 93, column: 5)
!667 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !640, file: !637, line: 94, size: 32768, elements: !668)
!668 = !{!669, !698}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !667, file: !637, line: 94, baseType: !670, size: 256)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fiemap", file: !671, line: 35, size: 256, elements: !672)
!671 = !DIFile(filename: "src/fiemap.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!672 = !{!673, !677, !678, !681, !682, !683, !684}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "fm_start", scope: !670, file: !671, line: 38, baseType: !674, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !675, line: 27, baseType: !676)
!675 = !DIFile(filename: "/usr/include/bits/stdint-uintn.h", directory: "")
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !93, line: 45, baseType: !94)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "fm_length", scope: !670, file: !671, line: 41, baseType: !674, size: 64, offset: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "fm_flags", scope: !670, file: !671, line: 44, baseType: !679, size: 32, offset: 128)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !675, line: 26, baseType: !680)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !93, line: 42, baseType: !7)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "fm_mapped_extents", scope: !670, file: !671, line: 47, baseType: !679, size: 32, offset: 160)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "fm_extent_count", scope: !670, file: !671, line: 50, baseType: !679, size: 32, offset: 192)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "fm_reserved", scope: !670, file: !671, line: 52, baseType: !679, size: 32, offset: 224)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "fm_extents", scope: !670, file: !671, line: 55, baseType: !685, offset: 256)
!685 = !DICompositeType(tag: DW_TAG_array_type, baseType: !686, elements: !696)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fiemap_extent", file: !671, line: 14, size: 448, elements: !687)
!687 = !{!688, !689, !690, !691, !693, !694}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "fe_logical", scope: !686, file: !671, line: 18, baseType: !674, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "fe_physical", scope: !686, file: !671, line: 22, baseType: !674, size: 64, offset: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "fe_length", scope: !686, file: !671, line: 25, baseType: !674, size: 64, offset: 128)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "fe_reserved64", scope: !686, file: !671, line: 27, baseType: !692, size: 128, offset: 192)
!692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !674, size: 128, elements: !534)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "fe_flags", scope: !686, file: !671, line: 30, baseType: !679, size: 32, offset: 320)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "fe_reserved", scope: !686, file: !671, line: 32, baseType: !695, size: 96, offset: 352)
!695 = !DICompositeType(tag: DW_TAG_array_type, baseType: !679, size: 96, elements: !434)
!696 = !{!697}
!697 = !DISubrange(count: -1)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !667, file: !637, line: 94, baseType: !699, size: 32768)
!699 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 32768, elements: !700)
!700 = !{!701}
!701 = !DISubrange(count: 4096)
!702 = !DILocalVariable(name: "fiemap", scope: !666, file: !637, line: 95, type: !703)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!704 = !DILocalVariable(name: "fm_extents", scope: !666, file: !637, line: 96, type: !705)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!706 = !DILocalVariable(name: "prev_idx", scope: !707, file: !637, line: 132, type: !153)
!707 = distinct !DILexicalBlock(scope: !666, file: !637, line: 129, column: 7)
!708 = !DILocalVariable(name: "i", scope: !666, file: !637, line: 138, type: !7)
!709 = !DILocalVariable(name: "new_logical", scope: !710, file: !637, line: 164, type: !674)
!710 = distinct !DILexicalBlock(scope: !711, file: !637, line: 159, column: 13)
!711 = distinct !DILexicalBlock(scope: !712, file: !637, line: 156, column: 20)
!712 = distinct !DILexicalBlock(scope: !713, file: !637, line: 146, column: 15)
!713 = distinct !DILexicalBlock(scope: !714, file: !637, line: 140, column: 9)
!714 = distinct !DILexicalBlock(scope: !715, file: !637, line: 139, column: 7)
!715 = distinct !DILexicalBlock(scope: !666, file: !637, line: 139, column: 7)
!716 = !DILocalVariable(name: "length_adjust", scope: !710, file: !637, line: 165, type: !674)
!717 = !{!718}
!718 = !DIEnumerator(name: "count", value: 72, isUnsigned: true)
!719 = !{!649, !153}
!720 = distinct !DICompileUnit(language: DW_LANG_C99, file: !721, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !161, nameTableKind: None)
!721 = !DIFile(filename: "src/selinux.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!722 = distinct !DICompileUnit(language: DW_LANG_C99, file: !723, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !161, nameTableKind: None)
!723 = !DIFile(filename: "lib/copy-acl.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!724 = distinct !DICompileUnit(language: DW_LANG_C99, file: !725, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !161, nameTableKind: None)
!725 = !DIFile(filename: "lib/set-acl.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!726 = distinct !DICompileUnit(language: DW_LANG_C99, file: !727, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !728, retainedTypes: !760, nameTableKind: None)
!727 = !DIFile(filename: "lib/areadlink-with-size.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!728 = !{!729}
!729 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !730, file: !727, line: 64, baseType: !7, size: 32, elements: !758)
!730 = distinct !DISubprogram(name: "areadlink_with_size", scope: !727, file: !727, line: 53, type: !731, scopeLine: 54, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !726, retainedNodes: !733)
!731 = !DISubroutineType(types: !732)
!732 = !{!64, !110, !153}
!733 = !{!734, !735, !736, !737, !738, !739, !740, !742, !743, !747, !748, !749, !752}
!734 = !DILocalVariable(name: "file", arg: 1, scope: !730, file: !727, line: 53, type: !110)
!735 = !DILocalVariable(name: "size", arg: 2, scope: !730, file: !727, line: 53, type: !153)
!736 = !DILocalVariable(name: "symlink_max", scope: !730, file: !727, line: 58, type: !153)
!737 = !DILocalVariable(name: "INITIAL_LIMIT_BOUND", scope: !730, file: !727, line: 59, type: !153)
!738 = !DILocalVariable(name: "initial_limit", scope: !730, file: !727, line: 60, type: !153)
!739 = !DILocalVariable(name: "buf_size", scope: !730, file: !727, line: 67, type: !153)
!740 = !DILocalVariable(name: "r", scope: !741, file: !727, line: 72, type: !239)
!741 = distinct !DILexicalBlock(scope: !730, file: !727, line: 71, column: 5)
!742 = !DILocalVariable(name: "link_length", scope: !741, file: !727, line: 73, type: !153)
!743 = !DILocalVariable(name: "stackbuf", scope: !741, file: !727, line: 74, type: !744)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 1024, elements: !745)
!745 = !{!746}
!746 = !DISubrange(count: 128)
!747 = !DILocalVariable(name: "buf", scope: !741, file: !727, line: 75, type: !64)
!748 = !DILocalVariable(name: "buffer", scope: !741, file: !727, line: 76, type: !64)
!749 = !DILocalVariable(name: "saved_errno", scope: !750, file: !727, line: 92, type: !113)
!750 = distinct !DILexicalBlock(scope: !751, file: !727, line: 91, column: 9)
!751 = distinct !DILexicalBlock(scope: !741, file: !727, line: 90, column: 11)
!752 = !DILocalVariable(name: "shrinked_buffer", scope: !753, file: !727, line: 110, type: !64)
!753 = distinct !DILexicalBlock(scope: !754, file: !727, line: 108, column: 13)
!754 = distinct !DILexicalBlock(scope: !755, file: !727, line: 107, column: 20)
!755 = distinct !DILexicalBlock(scope: !756, file: !727, line: 101, column: 15)
!756 = distinct !DILexicalBlock(scope: !757, file: !727, line: 99, column: 9)
!757 = distinct !DILexicalBlock(scope: !741, file: !727, line: 98, column: 11)
!758 = !{!759}
!759 = !DIEnumerator(name: "stackbuf_size", value: 128, isUnsigned: true)
!760 = !{!66}
!761 = distinct !DICompileUnit(language: DW_LANG_C99, file: !762, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !290, nameTableKind: None)
!762 = !DIFile(filename: "lib/backup-rename.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!763 = distinct !DICompileUnit(language: DW_LANG_C99, file: !764, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !161, nameTableKind: None)
!764 = !DIFile(filename: "lib/buffer-lcm.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!765 = distinct !DICompileUnit(language: DW_LANG_C99, file: !766, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !161, nameTableKind: None)
!766 = !DIFile(filename: "lib/dirname.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!767 = distinct !DICompileUnit(language: DW_LANG_C99, file: !768, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !161, nameTableKind: None)
!768 = !DIFile(filename: "lib/dirname-lgpl.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!769 = distinct !DICompileUnit(language: DW_LANG_C99, file: !770, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !161, retainedTypes: !771, nameTableKind: None)
!770 = !DIFile(filename: "lib/basename-lgpl.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!771 = !{!64}
!772 = distinct !DICompileUnit(language: DW_LANG_C99, file: !773, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !161, nameTableKind: None)
!773 = !DIFile(filename: "lib/stripslash.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!774 = distinct !DICompileUnit(language: DW_LANG_C99, file: !775, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !776, nameTableKind: None)
!775 = !DIFile(filename: "lib/fadvise.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!776 = !{!136}
!777 = distinct !DICompileUnit(language: DW_LANG_C99, file: !778, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !161, nameTableKind: None)
!778 = !DIFile(filename: "lib/open-safer.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!779 = distinct !DICompileUnit(language: DW_LANG_C99, file: !780, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !161, retainedTypes: !341, nameTableKind: None)
!780 = !DIFile(filename: "lib/file-set.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!781 = distinct !DICompileUnit(language: DW_LANG_C99, file: !782, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !161, nameTableKind: None)
!782 = !DIFile(filename: "lib/file-type.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!783 = distinct !DICompileUnit(language: DW_LANG_C99, file: !784, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !161, nameTableKind: None)
!784 = !DIFile(filename: "lib/filemode.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!785 = distinct !DICompileUnit(language: DW_LANG_C99, file: !786, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !161, retainedTypes: !760, nameTableKind: None)
!786 = !DIFile(filename: "lib/filenamecat.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!787 = distinct !DICompileUnit(language: DW_LANG_C99, file: !788, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !161, retainedTypes: !760, nameTableKind: None)
!788 = !DIFile(filename: "lib/filenamecat-lgpl.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!789 = distinct !DICompileUnit(language: DW_LANG_C99, file: !790, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !161, retainedTypes: !791, nameTableKind: None)
!790 = !DIFile(filename: "lib/full-write.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!791 = !{!110, !153}
!792 = distinct !DICompileUnit(language: DW_LANG_C99, file: !793, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !161, nameTableKind: None)
!793 = !DIFile(filename: "lib/hash-triple.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!794 = distinct !DICompileUnit(language: DW_LANG_C99, file: !795, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !161, nameTableKind: None)
!795 = !DIFile(filename: "lib/opendirat.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!796 = distinct !DICompileUnit(language: DW_LANG_C99, file: !797, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !161, nameTableKind: None)
!797 = !DIFile(filename: "lib/qcopy-acl.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!798 = distinct !DICompileUnit(language: DW_LANG_C99, file: !799, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !161, nameTableKind: None)
!799 = !DIFile(filename: "lib/qset-acl.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!800 = distinct !DICompileUnit(language: DW_LANG_C99, file: !801, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !161, retainedTypes: !771, nameTableKind: None)
!801 = !DIFile(filename: "lib/renameatu.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!802 = distinct !DICompileUnit(language: DW_LANG_C99, file: !803, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !161, nameTableKind: None)
!803 = !DIFile(filename: "lib/root-dev-ino.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!804 = distinct !DICompileUnit(language: DW_LANG_C99, file: !805, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !806, nameTableKind: None)
!805 = !DIFile(filename: "lib/safe-write.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!806 = !{!807}
!807 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !808, line: 40, baseType: !7, size: 32, elements: !809)
!808 = !DIFile(filename: "./lib/sys-limits.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!809 = !{!810}
!810 = !DIEnumerator(name: "SYS_BUFSIZE_MAX", value: 2146435072, isUnsigned: true)
!811 = distinct !DICompileUnit(language: DW_LANG_C99, file: !812, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !161, nameTableKind: None)
!812 = !DIFile(filename: "lib/same.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!813 = distinct !DICompileUnit(language: DW_LANG_C99, file: !814, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !161, nameTableKind: None)
!814 = !DIFile(filename: "lib/fd-safer.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!815 = distinct !DICompileUnit(language: DW_LANG_C99, file: !816, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !161, nameTableKind: None)
!816 = !DIFile(filename: "lib/verror.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!817 = distinct !DICompileUnit(language: DW_LANG_C99, file: !818, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !819, retainedTypes: !760, nameTableKind: None)
!818 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!819 = !{!820}
!820 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !818, line: 40, baseType: !7, size: 32, elements: !821)
!821 = !{!822}
!822 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!823 = distinct !DICompileUnit(language: DW_LANG_C99, file: !824, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !825, retainedTypes: !833, nameTableKind: None)
!824 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!825 = !{!826}
!826 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !827, file: !414, line: 186, baseType: !7, size: 32, elements: !424)
!827 = distinct !DISubprogram(name: "x2nrealloc", scope: !414, file: !414, line: 174, type: !416, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !823, retainedNodes: !828)
!828 = !{!829, !830, !831, !832}
!829 = !DILocalVariable(name: "p", arg: 1, scope: !827, file: !414, line: 174, type: !66)
!830 = !DILocalVariable(name: "pn", arg: 2, scope: !827, file: !414, line: 174, type: !418)
!831 = !DILocalVariable(name: "s", arg: 3, scope: !827, file: !414, line: 174, type: !153)
!832 = !DILocalVariable(name: "n", scope: !827, file: !414, line: 176, type: !153)
!833 = !{!153, !64, !66}
!834 = distinct !DICompileUnit(language: DW_LANG_C99, file: !835, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !161, nameTableKind: None)
!835 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!836 = distinct !DICompileUnit(language: DW_LANG_C99, file: !837, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !161, retainedTypes: !760, nameTableKind: None)
!837 = !DIFile(filename: "lib/xfts.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!838 = distinct !DICompileUnit(language: DW_LANG_C99, file: !839, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !161, retainedTypes: !771, nameTableKind: None)
!839 = !DIFile(filename: "lib/xvasprintf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!840 = distinct !DICompileUnit(language: DW_LANG_C99, file: !841, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !161, nameTableKind: None)
!841 = !DIFile(filename: "lib/yesno.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!842 = distinct !DICompileUnit(language: DW_LANG_C99, file: !843, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !161, retainedTypes: !760, nameTableKind: None)
!843 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!844 = distinct !DICompileUnit(language: DW_LANG_C99, file: !845, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !161, retainedTypes: !760, nameTableKind: None)
!845 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!846 = distinct !DICompileUnit(language: DW_LANG_C99, file: !847, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !161, nameTableKind: None)
!847 = !DIFile(filename: "lib/freadahead.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!848 = distinct !DICompileUnit(language: DW_LANG_C99, file: !849, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !161, retainedTypes: !760, nameTableKind: None)
!849 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!850 = distinct !DICompileUnit(language: DW_LANG_C99, file: !851, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !852, retainedTypes: !984, nameTableKind: None)
!851 = !DIFile(filename: "lib/fts.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!852 = !{!853, !857, !862, !975, !978, !624, !981}
!853 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Fts_stat", file: !851, line: 156, baseType: !7, size: 32, elements: !854)
!854 = !{!855, !856}
!855 = !DIEnumerator(name: "FTS_NO_STAT_REQUIRED", value: 1, isUnsigned: true)
!856 = !DIEnumerator(name: "FTS_STAT_REQUIRED", value: 2, isUnsigned: true)
!857 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "leaf_optimization", file: !851, line: 643, baseType: !7, size: 32, elements: !858)
!858 = !{!859, !860, !861}
!859 = !DIEnumerator(name: "NO_LEAF_OPTIMIZATION", value: 0, isUnsigned: true)
!860 = !DIEnumerator(name: "OK_LEAF_OPTIMIZATION", value: 1, isUnsigned: true)
!861 = !DIEnumerator(name: "NOSTAT_LEAF_OPTIMIZATION", value: 2, isUnsigned: true)
!862 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !864, file: !863, line: 54, baseType: !7, size: 32, elements: !973)
!863 = !DIFile(filename: "./lib/fts-cycle.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!864 = distinct !DISubprogram(name: "setup_dir", scope: !863, file: !863, line: 50, type: !865, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !850, retainedNodes: !971)
!865 = !DISubroutineType(types: !866)
!866 = !{!70, !867}
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !869, line: 197, baseType: !870)
!869 = !DIFile(filename: "./lib/fts_.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !869, line: 80, size: 1024, elements: !871)
!871 = !{!872, !922, !923, !925, !926, !927, !928, !929, !930, !931, !938, !939, !942, !958}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !870, file: !869, line: 81, baseType: !873, size: 64)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !869, line: 199, size: 2112, elements: !875)
!875 = !{!876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !892, !893, !894, !895, !920}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !874, file: !869, line: 200, baseType: !873, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !874, file: !869, line: 201, baseType: !873, size: 64, offset: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !874, file: !869, line: 202, baseType: !873, size: 64, offset: 128)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !874, file: !869, line: 203, baseType: !243, size: 64, offset: 192)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !874, file: !869, line: 206, baseType: !172, size: 64, offset: 256)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !874, file: !869, line: 207, baseType: !66, size: 64, offset: 320)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !874, file: !869, line: 208, baseType: !64, size: 64, offset: 384)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !874, file: !869, line: 209, baseType: !64, size: 64, offset: 448)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !874, file: !869, line: 210, baseType: !113, size: 32, offset: 512)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !874, file: !869, line: 211, baseType: !113, size: 32, offset: 544)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !874, file: !869, line: 212, baseType: !153, size: 64, offset: 576)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !874, file: !869, line: 214, baseType: !867, size: 64, offset: 640)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !874, file: !869, line: 218, baseType: !234, size: 64, offset: 704)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !874, file: !869, line: 220, baseType: !153, size: 64, offset: 768)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "fts_n_dirs_remaining", scope: !874, file: !869, line: 225, baseType: !891, size: 64, offset: 832)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "nlink_t", file: !91, line: 74, baseType: !458)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !874, file: !869, line: 241, baseType: !369, size: 16, offset: 896)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !874, file: !869, line: 245, baseType: !369, size: 16, offset: 912)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !874, file: !869, line: 251, baseType: !369, size: 16, offset: 928)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !874, file: !869, line: 253, baseType: !896, size: 1152, offset: 960)
!896 = !DICompositeType(tag: DW_TAG_array_type, baseType: !897, size: 1152, elements: !918)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !453, line: 26, size: 1152, elements: !898)
!898 = !{!899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !915, !916, !917}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !897, file: !453, line: 28, baseType: !97, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !897, file: !453, line: 33, baseType: !92, size: 64, offset: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !897, file: !453, line: 41, baseType: !458, size: 64, offset: 128)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !897, file: !453, line: 42, baseType: !151, size: 32, offset: 192)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !897, file: !453, line: 44, baseType: !461, size: 32, offset: 224)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !897, file: !453, line: 45, baseType: !463, size: 32, offset: 256)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !897, file: !453, line: 47, baseType: !113, size: 32, offset: 288)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !897, file: !453, line: 49, baseType: !97, size: 64, offset: 320)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !897, file: !453, line: 54, baseType: !171, size: 64, offset: 384)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !897, file: !453, line: 58, baseType: !468, size: 64, offset: 448)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !897, file: !453, line: 60, baseType: !470, size: 64, offset: 512)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !897, file: !453, line: 71, baseType: !911, size: 128, offset: 576)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !473, line: 10, size: 128, elements: !912)
!912 = !{!913, !914}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !911, file: !473, line: 12, baseType: !476, size: 64)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !911, file: !473, line: 16, baseType: !478, size: 64, offset: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !897, file: !453, line: 72, baseType: !911, size: 128, offset: 704)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !897, file: !453, line: 73, baseType: !911, size: 128, offset: 832)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !897, file: !453, line: 86, baseType: !482, size: 192, offset: 960)
!918 = !{!919}
!919 = !DISubrange(count: 1)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "fts_name", scope: !874, file: !869, line: 254, baseType: !921, offset: 2112)
!921 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, elements: !696)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "fts_child", scope: !870, file: !869, line: 82, baseType: !873, size: 64, offset: 64)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "fts_array", scope: !870, file: !869, line: 83, baseType: !924, size: 64, offset: 128)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !870, file: !869, line: 84, baseType: !96, size: 64, offset: 192)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !870, file: !869, line: 85, baseType: !64, size: 64, offset: 256)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "fts_rfd", scope: !870, file: !869, line: 86, baseType: !113, size: 32, offset: 320)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cwd_fd", scope: !870, file: !869, line: 87, baseType: !113, size: 32, offset: 352)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !870, file: !869, line: 89, baseType: !153, size: 64, offset: 384)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "fts_nitems", scope: !870, file: !869, line: 90, baseType: !153, size: 64, offset: 448)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "fts_compar", scope: !870, file: !869, line: 91, baseType: !932, size: 64, offset: 512)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DISubroutineType(types: !934)
!934 = !{!113, !935, !935}
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !874)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "fts_options", scope: !870, file: !869, line: 160, baseType: !113, size: 32, offset: 576)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "fts_leaf_optimization_works_ht", scope: !870, file: !869, line: 169, baseType: !940, size: 64, offset: 640)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !869, line: 169, flags: DIFlagFwdDecl)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !870, file: !869, line: 191, baseType: !943, size: 64, offset: 704)
!943 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !870, file: !869, line: 171, size: 64, elements: !944)
!944 = !{!945, !946}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !943, file: !869, line: 184, baseType: !940, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !943, file: !869, line: 190, baseType: !947, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cycle_check_state", file: !949, line: 28, size: 256, elements: !950)
!949 = !DIFile(filename: "./lib/cycle-check.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!950 = !{!951, !956, !957}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "dev_ino", scope: !948, file: !949, line: 30, baseType: !952, size: 128)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !87, line: 7, size: 128, elements: !953)
!953 = !{!954, !955}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !952, file: !87, line: 9, baseType: !90, size: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !952, file: !87, line: 10, baseType: !96, size: 64, offset: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "chdir_counter", scope: !948, file: !949, line: 31, baseType: !191, size: 64, offset: 128)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !948, file: !949, line: 32, baseType: !113, size: 32, offset: 192)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fd_ring", scope: !870, file: !869, line: 196, baseType: !959, size: 256, offset: 768)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "I_ring", file: !960, line: 39, baseType: !961)
!960 = !DIFile(filename: "./lib/i-ring.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "I_ring", file: !960, line: 31, size: 256, elements: !962)
!962 = !{!963, !967, !968, !969, !970}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "ir_data", scope: !961, file: !960, line: 33, baseType: !964, size: 128)
!964 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 128, elements: !965)
!965 = !{!966}
!966 = !DISubrange(count: 4)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "ir_default_val", scope: !961, file: !960, line: 34, baseType: !113, size: 32, offset: 128)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "ir_front", scope: !961, file: !960, line: 35, baseType: !7, size: 32, offset: 160)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "ir_back", scope: !961, file: !960, line: 36, baseType: !7, size: 32, offset: 192)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "ir_empty", scope: !961, file: !960, line: 37, baseType: !70, size: 8, offset: 224)
!971 = !{!972}
!972 = !DILocalVariable(name: "fts", arg: 1, scope: !864, file: !863, line: 50, type: !867)
!973 = !{!974}
!974 = !DIEnumerator(name: "HT_INITIAL_SIZE", value: 31, isUnsigned: true)
!975 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !851, line: 686, baseType: !7, size: 32, elements: !976)
!976 = !{!977}
!977 = !DIEnumerator(name: "DEV_TYPE_HT_INITIAL_SIZE", value: 13, isUnsigned: true)
!978 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !851, line: 640, baseType: !7, size: 32, elements: !979)
!979 = !{!980}
!980 = !DIEnumerator(name: "MIN_DIR_NLINK", value: 2, isUnsigned: true)
!981 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !851, line: 151, baseType: !7, size: 32, elements: !982)
!982 = !{!983}
!983 = !DIEnumerator(name: "_FTS_INODE_SORT_DIR_ENTRIES_THRESHOLD", value: 10000, isUnsigned: true)
!984 = !{!66, !891, !191, !64, !172, !431, !985}
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !988)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTSENT", file: !869, line: 255, baseType: !874)
!989 = distinct !DICompileUnit(language: DW_LANG_C99, file: !990, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !161, retainedTypes: !991, nameTableKind: None)
!990 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!991 = !{!153}
!992 = distinct !DICompileUnit(language: DW_LANG_C99, file: !993, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !161, nameTableKind: None)
!993 = !DIFile(filename: "lib/acl-internal.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!994 = distinct !DICompileUnit(language: DW_LANG_C99, file: !995, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !161, retainedTypes: !760, nameTableKind: None)
!995 = !DIFile(filename: "lib/get-permissions.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!996 = distinct !DICompileUnit(language: DW_LANG_C99, file: !997, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !161, retainedTypes: !760, nameTableKind: None)
!997 = !DIFile(filename: "lib/set-permissions.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!998 = distinct !DICompileUnit(language: DW_LANG_C99, file: !999, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !161, nameTableKind: None)
!999 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1000 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1001, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !161, nameTableKind: None)
!1001 = !DIFile(filename: "lib/cycle-check.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1002 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1003, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !161, nameTableKind: None)
!1003 = !DIFile(filename: "lib/opendir-safer.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1004 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1005, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !161, nameTableKind: None)
!1005 = !DIFile(filename: "lib/gettime.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1006 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1007, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !161, nameTableKind: None)
!1007 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1008 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1009, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !161, nameTableKind: None)
!1009 = !DIFile(filename: "lib/hash-pjw.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1010 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1011, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !1012, nameTableKind: None)
!1011 = !DIFile(filename: "lib/i-ring.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
