; ModuleID = 'coreutils-8.32/src/mv.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.timespec = type { i64, i64 }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.hash_entry = type { i8*, %struct.hash_entry* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.fs_res = type { i64, i32, i8 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.cp_options = type { i32, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i32, i32, %struct.hash_table*, %struct.hash_table* }

!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "no_backups", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "simple_backups", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "numbered_existing_backups", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "numbered_backups", value: 3, isUnsigned: true)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Dereference_symlink", file: !14, line: 69, baseType: !7, size: 32, elements: !15)
!14 = !DIFile(filename: "src/copy.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!15 = !{!16, !17, !18, !19}
!16 = !DIEnumerator(name: "DEREF_UNDEFINED", value: 1, isUnsigned: true)
!17 = !DIEnumerator(name: "DEREF_NEVER", value: 2, isUnsigned: true)
!18 = !DIEnumerator(name: "DEREF_COMMAND_LINE_ARGUMENTS", value: 3, isUnsigned: true)
!19 = !DIEnumerator(name: "DEREF_ALWAYS", value: 4, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Interactive", file: !14, line: 60, baseType: !7, size: 32, elements: !21)
!21 = !{!22, !23, !24, !25}
!22 = !DIEnumerator(name: "I_ALWAYS_YES", value: 1, isUnsigned: true)
!23 = !DIEnumerator(name: "I_ALWAYS_NO", value: 2, isUnsigned: true)
!24 = !DIEnumerator(name: "I_ASK_USER", value: 3, isUnsigned: true)
!25 = !DIEnumerator(name: "I_UNSPECIFIED", value: 4, isUnsigned: true)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Sparse_type", file: !14, line: 26, baseType: !7, size: 32, elements: !27)
!27 = !{!28, !29, !30, !31}
!28 = !DIEnumerator(name: "SPARSE_UNUSED", value: 0, isUnsigned: true)
!29 = !DIEnumerator(name: "SPARSE_NEVER", value: 1, isUnsigned: true)
!30 = !DIEnumerator(name: "SPARSE_AUTO", value: 2, isUnsigned: true)
!31 = !DIEnumerator(name: "SPARSE_ALWAYS", value: 3, isUnsigned: true)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Reflink_type", file: !14, line: 47, baseType: !7, size: 32, elements: !33)
!33 = !{!34, !35, !36}
!34 = !DIEnumerator(name: "REFLINK_NEVER", value: 0, isUnsigned: true)
!35 = !DIEnumerator(name: "REFLINK_AUTO", value: 1, isUnsigned: true)
!36 = !DIEnumerator(name: "REFLINK_ALWAYS", value: 2, isUnsigned: true)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !38, line: 32, baseType: !7, size: 32, elements: !39)
!38 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!39 = !{!40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50}
!40 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!41 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!42 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!43 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!44 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!45 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!46 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!47 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!48 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!49 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!50 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rm_interactive", file: !52, line: 23, baseType: !7, size: 32, elements: !53)
!52 = !DIFile(filename: "src/remove.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!53 = !{!54, !55, !56}
!54 = !DIEnumerator(name: "RMI_ALWAYS", value: 3, isUnsigned: true)
!55 = !DIEnumerator(name: "RMI_SOMETIMES", value: 4, isUnsigned: true)
!56 = !DIEnumerator(name: "RMI_NEVER", value: 5, isUnsigned: true)
!57 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RM_status", file: !52, line: 78, baseType: !7, size: 32, elements: !58)
!58 = !{!59, !60, !61, !62}
!59 = !DIEnumerator(name: "RM_OK", value: 2, isUnsigned: true)
!60 = !DIEnumerator(name: "RM_USER_DECLINED", value: 3, isUnsigned: true)
!61 = !DIEnumerator(name: "RM_ERROR", value: 4, isUnsigned: true)
!62 = !DIEnumerator(name: "RM_NONEMPTY_DIR", value: 5, isUnsigned: true)
!63 = !{!64, !74, !135, !139, !143, !146, !149, !156, !171, !175, !68, !125, !178, !182, !186, !189, !190, !192, !245, !246, !250, !254, !255, !260, !263, !269, !296}
!64 = !DISubprogram(name: "dcgettext", scope: !65, file: !65, line: 51, type: !66, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!65 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!66 = !DISubroutineType(types: !67)
!67 = !{!68, !70, !70, !72}
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!72 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!73 = !{}
!74 = !DISubprogram(name: "fputs_unlocked", scope: !75, file: !75, line: 662, type: !76, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!75 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!76 = !DISubroutineType(types: !77)
!77 = !{!72, !70, !78}
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !80, line: 49, size: 1728, elements: !81)
!80 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!81 = !{!82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !97, !98, !99, !100, !104, !106, !108, !112, !115, !117, !120, !123, !124, !126, !130, !131}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !79, file: !80, line: 51, baseType: !72, size: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !79, file: !80, line: 54, baseType: !68, size: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !79, file: !80, line: 55, baseType: !68, size: 64, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !79, file: !80, line: 56, baseType: !68, size: 64, offset: 192)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !79, file: !80, line: 57, baseType: !68, size: 64, offset: 256)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !79, file: !80, line: 58, baseType: !68, size: 64, offset: 320)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !79, file: !80, line: 59, baseType: !68, size: 64, offset: 384)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !79, file: !80, line: 60, baseType: !68, size: 64, offset: 448)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !79, file: !80, line: 61, baseType: !68, size: 64, offset: 512)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !79, file: !80, line: 64, baseType: !68, size: 64, offset: 576)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !79, file: !80, line: 65, baseType: !68, size: 64, offset: 640)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !79, file: !80, line: 66, baseType: !68, size: 64, offset: 704)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !79, file: !80, line: 68, baseType: !95, size: 64, offset: 768)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !80, line: 36, flags: DIFlagFwdDecl)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !79, file: !80, line: 70, baseType: !78, size: 64, offset: 832)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !79, file: !80, line: 72, baseType: !72, size: 32, offset: 896)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !79, file: !80, line: 73, baseType: !72, size: 32, offset: 928)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !79, file: !80, line: 74, baseType: !101, size: 64, offset: 960)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !102, line: 152, baseType: !103)
!102 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!103 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !79, file: !80, line: 77, baseType: !105, size: 16, offset: 1024)
!105 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !79, file: !80, line: 78, baseType: !107, size: 8, offset: 1040)
!107 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !79, file: !80, line: 79, baseType: !109, size: 8, offset: 1048)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 8, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 1)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !79, file: !80, line: 81, baseType: !113, size: 64, offset: 1088)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !80, line: 43, baseType: null)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !79, file: !80, line: 89, baseType: !116, size: 64, offset: 1152)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !102, line: 153, baseType: !103)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !79, file: !80, line: 91, baseType: !118, size: 64, offset: 1216)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !80, line: 37, flags: DIFlagFwdDecl)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !79, file: !80, line: 92, baseType: !121, size: 64, offset: 1280)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !80, line: 38, flags: DIFlagFwdDecl)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !79, file: !80, line: 93, baseType: !78, size: 64, offset: 1344)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !79, file: !80, line: 94, baseType: !125, size: 64, offset: 1408)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !79, file: !80, line: 95, baseType: !127, size: 64, offset: 1472)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !128, line: 46, baseType: !129)
!128 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!129 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !79, file: !80, line: 96, baseType: !72, size: 32, offset: 1536)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !79, file: !80, line: 98, baseType: !132, size: 160, offset: 1568)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 160, elements: !133)
!133 = !{!134}
!134 = !DISubrange(count: 20)
!135 = !DISubprogram(name: "set_program_name", scope: !136, file: !136, line: 37, type: !137, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!136 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!137 = !DISubroutineType(types: !138)
!138 = !{null, !70}
!139 = !DISubprogram(name: "setlocale", scope: !140, file: !140, line: 122, type: !141, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!140 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!141 = !DISubroutineType(types: !142)
!142 = !{!68, !72, !70}
!143 = !DISubprogram(name: "bindtextdomain", scope: !65, file: !65, line: 86, type: !144, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!144 = !DISubroutineType(types: !145)
!145 = !{!68, !70, !70}
!146 = !DISubprogram(name: "textdomain", scope: !65, file: !65, line: 82, type: !147, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!147 = !DISubroutineType(types: !148)
!148 = !{!68, !70}
!149 = !DISubprogram(name: "atexit", scope: !150, file: !150, line: 595, type: !151, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!150 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!151 = !DISubroutineType(types: !152)
!152 = !{!72, !153}
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DISubroutineType(types: !155)
!155 = !{null}
!156 = !DISubprogram(name: "getopt_long", scope: !157, file: !157, line: 66, type: !158, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!157 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!158 = !DISubroutineType(types: !159)
!159 = !{!72, !72, !160, !70, !162, !169}
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !164)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !157, line: 50, size: 256, elements: !165)
!165 = !{!166, !167, !168, !170}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !164, file: !157, line: 52, baseType: !70, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !164, file: !157, line: 55, baseType: !72, size: 32, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !164, file: !157, line: 56, baseType: !169, size: 64, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !164, file: !157, line: 57, baseType: !72, size: 32, offset: 192)
!171 = !DISubprogram(name: "error", scope: !172, file: !172, line: 52, type: !173, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!172 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!173 = !DISubroutineType(types: !174)
!174 = !{null, !72, !72, !70, null}
!175 = !DISubprogram(name: "quotearg_style", scope: !38, file: !38, line: 377, type: !176, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!176 = !DISubroutineType(types: !177)
!177 = !{!68, !37, !70}
!178 = !DISubprogram(name: "version_etc", scope: !179, file: !179, line: 69, type: !180, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!179 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!180 = !DISubroutineType(types: !181)
!181 = !{null, !78, !70, !70, !70, null}
!182 = !DISubprogram(name: "renameatu", scope: !183, file: !183, line: 28, type: !184, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!183 = !DIFile(filename: "./lib/renameatu.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!184 = !DISubroutineType(types: !185)
!185 = !{!72, !72, !70, !72, !70, !7}
!186 = !DISubprogram(name: "xget_version", scope: !6, file: !6, line: 55, type: !187, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!187 = !DISubroutineType(types: !188)
!188 = !{!5, !70, !70}
!189 = !DISubprogram(name: "set_simple_backup_suffix", scope: !6, file: !6, line: 51, type: !137, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!190 = !DISubprogram(name: "hash_init", scope: !191, file: !191, line: 1, type: !154, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!191 = !DIFile(filename: "src/cp-hash.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!192 = !DISubprogram(name: "dest_info_init", scope: !14, file: !14, line: 300, type: !193, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!193 = !DISubroutineType(types: !194)
!194 = !{null, !195}
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cp_options", file: !14, line: 98, size: 640, elements: !197)
!197 = !{!198, !199, !200, !201, !202, !206, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !244}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "backup_type", scope: !196, file: !14, line: 100, baseType: !5, size: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "dereference", scope: !196, file: !14, line: 103, baseType: !13, size: 32, offset: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !196, file: !14, line: 108, baseType: !20, size: 32, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_mode", scope: !196, file: !14, line: 111, baseType: !26, size: 32, offset: 96)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !196, file: !14, line: 115, baseType: !203, size: 32, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !204, line: 69, baseType: !205)
!204 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !102, line: 150, baseType: !7)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "copy_as_regular", scope: !196, file: !14, line: 119, baseType: !207, size: 8, offset: 160)
!207 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_before_opening", scope: !196, file: !14, line: 123, baseType: !207, size: 8, offset: 168)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_after_failed_open", scope: !196, file: !14, line: 130, baseType: !207, size: 8, offset: 176)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "hard_link", scope: !196, file: !14, line: 134, baseType: !207, size: 8, offset: 184)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "move_mode", scope: !196, file: !14, line: 138, baseType: !207, size: 8, offset: 192)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "install_mode", scope: !196, file: !14, line: 141, baseType: !207, size: 8, offset: 200)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "chown_privileges", scope: !196, file: !14, line: 145, baseType: !207, size: 8, offset: 208)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "owner_privileges", scope: !196, file: !14, line: 152, baseType: !207, size: 8, offset: 216)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "one_file_system", scope: !196, file: !14, line: 156, baseType: !207, size: 8, offset: 224)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_ownership", scope: !196, file: !14, line: 160, baseType: !207, size: 8, offset: 232)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_mode", scope: !196, file: !14, line: 161, baseType: !207, size: 8, offset: 240)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_timestamps", scope: !196, file: !14, line: 162, baseType: !207, size: 8, offset: 248)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "explicit_no_preserve_mode", scope: !196, file: !14, line: 163, baseType: !207, size: 8, offset: 256)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "set_security_context", scope: !196, file: !14, line: 166, baseType: !207, size: 8, offset: 264)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_links", scope: !196, file: !14, line: 178, baseType: !207, size: 8, offset: 272)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "data_copy_required", scope: !196, file: !14, line: 182, baseType: !207, size: 8, offset: 280)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve", scope: !196, file: !14, line: 188, baseType: !207, size: 8, offset: 288)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_security_context", scope: !196, file: !14, line: 192, baseType: !207, size: 8, offset: 296)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_context", scope: !196, file: !14, line: 201, baseType: !207, size: 8, offset: 304)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_xattr", scope: !196, file: !14, line: 205, baseType: !207, size: 8, offset: 312)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_xattr", scope: !196, file: !14, line: 214, baseType: !207, size: 8, offset: 320)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "reduce_diagnostics", scope: !196, file: !14, line: 223, baseType: !207, size: 8, offset: 328)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !196, file: !14, line: 227, baseType: !207, size: 8, offset: 336)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "set_mode", scope: !196, file: !14, line: 231, baseType: !207, size: 8, offset: 344)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "symbolic_link", scope: !196, file: !14, line: 235, baseType: !207, size: 8, offset: 352)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !196, file: !14, line: 239, baseType: !207, size: 8, offset: 360)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !196, file: !14, line: 242, baseType: !207, size: 8, offset: 368)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_tty", scope: !196, file: !14, line: 245, baseType: !207, size: 8, offset: 376)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "open_dangling_dest_symlink", scope: !196, file: !14, line: 250, baseType: !207, size: 8, offset: 384)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "last_file", scope: !196, file: !14, line: 254, baseType: !207, size: 8, offset: 392)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "rename_errno", scope: !196, file: !14, line: 259, baseType: !72, size: 32, offset: 416)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "reflink_mode", scope: !196, file: !14, line: 262, baseType: !32, size: 32, offset: 448)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "dest_info", scope: !196, file: !14, line: 273, baseType: !240, size: 64, offset: 512)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !242, line: 69, baseType: !243)
!242 = !DIFile(filename: "./lib/hash.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !242, line: 67, flags: DIFlagFwdDecl)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "src_info", scope: !196, file: !14, line: 276, baseType: !240, size: 64, offset: 576)
!245 = !DISubprogram(name: "cp_options_default", scope: !14, file: !14, line: 303, type: !193, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!246 = !DISubprogram(name: "isatty", scope: !247, file: !247, line: 779, type: !248, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!247 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!248 = !DISubroutineType(types: !249)
!249 = !{!72, !72}
!250 = !DISubprogram(name: "strip_trailing_slashes", scope: !251, file: !251, line: 48, type: !252, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!251 = !DIFile(filename: "./lib/dirname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!252 = !DISubroutineType(types: !253)
!253 = !{!207, !68}
!254 = !DISubprogram(name: "last_component", scope: !251, file: !251, line: 46, type: !147, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!255 = !DISubprogram(name: "file_name_concat", scope: !256, file: !256, line: 22, type: !257, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!256 = !DIFile(filename: "./lib/filenamecat.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!257 = !DISubroutineType(types: !258)
!258 = !{!68, !70, !70, !259}
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!260 = !DISubprogram(name: "free", scope: !150, file: !150, line: 565, type: !261, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!261 = !DISubroutineType(types: !262)
!262 = !{null, !125}
!263 = !DISubprogram(name: "copy", scope: !14, file: !14, line: 288, type: !264, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!264 = !DISubroutineType(types: !265)
!265 = !{!207, !70, !70, !207, !266, !268, !268}
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !196)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!269 = !DISubprogram(name: "rm", scope: !52, file: !52, line: 99, type: !270, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!270 = !DISubroutineType(types: !271)
!271 = !{!57, !160, !272}
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !274)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rm_options", file: !52, line: 32, size: 256, elements: !275)
!275 = !{!276, !277, !278, !279, !280, !281, !292, !293, !294, !295}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_missing_files", scope: !274, file: !52, line: 35, baseType: !207, size: 8)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !274, file: !52, line: 38, baseType: !51, size: 32, offset: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "one_file_system", scope: !274, file: !52, line: 47, baseType: !207, size: 8, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !274, file: !52, line: 50, baseType: !207, size: 8, offset: 72)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "remove_empty_directories", scope: !274, file: !52, line: 53, baseType: !207, size: 8, offset: 80)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "root_dev_ino", scope: !274, file: !52, line: 57, baseType: !282, size: 64, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !284, line: 7, size: 128, elements: !285)
!284 = !DIFile(filename: "./lib/dev-ino.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!285 = !{!286, !289}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !283, file: !284, line: 9, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !204, line: 47, baseType: !288)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !102, line: 148, baseType: !129)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !283, file: !284, line: 10, baseType: !290, size: 64, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !204, line: 59, baseType: !291)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !102, line: 145, baseType: !129)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_all_root", scope: !274, file: !52, line: 61, baseType: !207, size: 8, offset: 192)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_tty", scope: !274, file: !52, line: 64, baseType: !207, size: 8, offset: 200)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !274, file: !52, line: 67, baseType: !207, size: 8, offset: 208)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "require_restore_cwd", scope: !274, file: !52, line: 75, baseType: !207, size: 8, offset: 216)
!296 = !DISubprogram(name: "get_root_dev_ino", scope: !297, file: !297, line: 25, type: !298, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!297 = !DIFile(filename: "./lib/root-dev-ino.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!298 = !DISubroutineType(types: !299)
!299 = !{!282, !282}
!300 = !{!301, !0, !303}
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(name: "remove_trailing_slashes", scope: !2, file: !3, line: 54, type: !207, isLocal: true, isDefinition: true)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "dev_ino_buf", scope: !305, file: !3, line: 96, type: !283, isLocal: true, isDefinition: true)
!305 = distinct !DISubprogram(name: "rm_option_init", scope: !3, file: !3, line: 75, type: !306, scopeLine: 76, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !309)
!306 = !DISubroutineType(types: !307)
!307 = !{null, !308}
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!309 = !{!310}
!310 = !DILocalVariable(name: "x", arg: 1, scope: !305, file: !3, line: 75, type: !308)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 3584, elements: !312)
!312 = !{!313}
!313 = !DISubrange(count: 14)
!314 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(name: "top_level_src_name", scope: !317, file: !318, line: 147, type: !70, isLocal: true, isDefinition: true)
!317 = distinct !DICompileUnit(language: DW_LANG_C99, file: !318, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !319, retainedTypes: !344, globals: !619, splitDebugInlining: false, nameTableKind: None)
!318 = !DIFile(filename: "src/copy.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!319 = !{!5, !13, !20, !26, !32, !37, !320, !324, !331, !340}
!320 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !321, line: 27, baseType: !7, size: 32, elements: !322)
!321 = !DIFile(filename: "./lib/utimecmp.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!322 = !{!323}
!323 = !DIEnumerator(name: "UTIMECMP_TRUNCATE_SOURCE", value: 1, isUnsigned: true)
!324 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "savedir_option", file: !325, line: 26, baseType: !7, size: 32, elements: !326)
!325 = !DIFile(filename: "./lib/savedir.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!326 = !{!327, !328, !329, !330}
!327 = !DIEnumerator(name: "SAVEDIR_SORT_NONE", value: 0, isUnsigned: true)
!328 = !DIEnumerator(name: "SAVEDIR_SORT_NAME", value: 1, isUnsigned: true)
!329 = !DIEnumerator(name: "SAVEDIR_SORT_INODE", value: 2, isUnsigned: true)
!330 = !DIEnumerator(name: "SAVEDIR_SORT_FASTREAD", value: 2, isUnsigned: true)
!331 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !332, line: 45, baseType: !7, size: 32, elements: !333)
!332 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!333 = !{!334, !335, !336, !337, !338, !339}
!334 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0, isUnsigned: true)
!335 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2, isUnsigned: true)
!336 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5, isUnsigned: true)
!337 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4, isUnsigned: true)
!338 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3, isUnsigned: true)
!339 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1, isUnsigned: true)
!340 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !341, line: 73, baseType: !7, size: 32, elements: !342)
!341 = !DIFile(filename: "src/ioblksize.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!342 = !{!343}
!343 = !DIEnumerator(name: "IO_BUFSIZE", value: 131072, isUnsigned: true)
!344 = !{!64, !345, !171, !175, !349, !352, !375, !203, !378, !125, !7, !182, !382, !423, !426, !429, !432, !254, !433, !68, !260, !436, !439, !442, !446, !449, !452, !453, !456, !458, !459, !463, !464, !468, !471, !477, !481, !484, !485, !488, !492, !495, !129, !499, !501, !505, !506, !255, !509, !513, !127, !516, !519, !523, !526, !529, !530, !534, !555, !558, !561, !565, !569, !573, !576, !577, !578, !581, !604, !607, !618}
!345 = !DISubprogram(name: "quote", scope: !346, file: !346, line: 44, type: !347, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!346 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!347 = !DISubroutineType(types: !348)
!348 = !{!70, !70}
!349 = !DISubprogram(name: "quotearg_n_style", scope: !38, file: !38, line: 368, type: !350, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!350 = !DISubroutineType(types: !351)
!351 = !{!68, !72, !37, !70}
!352 = !DISubprogram(name: "hash_initialize", scope: !242, file: !242, line: 89, type: !353, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!353 = !DISubroutineType(types: !354)
!354 = !{!355, !129, !356, !366, !371, !374}
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !358)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !242, line: 53, size: 160, elements: !359)
!359 = !{!360, !362, !363, !364, !365}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !358, file: !242, line: 58, baseType: !361, size: 32)
!361 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !358, file: !242, line: 59, baseType: !361, size: 32, offset: 32)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !358, file: !242, line: 60, baseType: !361, size: 32, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !358, file: !242, line: 61, baseType: !361, size: 32, offset: 96)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !358, file: !242, line: 62, baseType: !207, size: 8, offset: 128)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DISubroutineType(types: !368)
!368 = !{!129, !369, !129}
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DISubroutineType(types: !373)
!373 = !{!207, !369, !369}
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!375 = !DISubprogram(name: "geteuid", scope: !247, file: !247, line: 678, type: !376, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!376 = !DISubroutineType(types: !377)
!377 = !{!7}
!378 = !DISubprogram(name: "umask", scope: !379, file: !379, line: 308, type: !380, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!379 = !DIFile(filename: "/usr/include/sys/stat.h", directory: "")
!380 = !DISubroutineType(types: !381)
!381 = !{!7, !7}
!382 = !DISubprogram(name: "seen_file", scope: !383, file: !383, line: 14, type: !384, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!383 = !DIFile(filename: "./lib/file-set.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!384 = !DISubroutineType(types: !385)
!385 = !{!207, !386, !70, !388}
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !243)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !390)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !391, line: 46, size: 1152, elements: !392)
!391 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "")
!392 = !{!393, !394, !395, !397, !398, !400, !402, !403, !404, !405, !407, !409, !417, !418, !419}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !390, file: !391, line: 48, baseType: !291, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !390, file: !391, line: 53, baseType: !288, size: 64, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !390, file: !391, line: 61, baseType: !396, size: 64, offset: 128)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !102, line: 151, baseType: !129)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !390, file: !391, line: 62, baseType: !205, size: 32, offset: 192)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !390, file: !391, line: 64, baseType: !399, size: 32, offset: 224)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !102, line: 146, baseType: !7)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !390, file: !391, line: 65, baseType: !401, size: 32, offset: 256)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !102, line: 147, baseType: !7)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !390, file: !391, line: 67, baseType: !72, size: 32, offset: 288)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !390, file: !391, line: 69, baseType: !291, size: 64, offset: 320)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !390, file: !391, line: 74, baseType: !101, size: 64, offset: 384)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !390, file: !391, line: 78, baseType: !406, size: 64, offset: 448)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !102, line: 174, baseType: !103)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !390, file: !391, line: 80, baseType: !408, size: 64, offset: 512)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !102, line: 179, baseType: !103)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !390, file: !391, line: 91, baseType: !410, size: 128, offset: 576)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !411, line: 10, size: 128, elements: !412)
!411 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!412 = !{!413, !415}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !410, file: !411, line: 12, baseType: !414, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !102, line: 160, baseType: !103)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !410, file: !411, line: 16, baseType: !416, size: 64, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !102, line: 196, baseType: !103)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !390, file: !391, line: 92, baseType: !410, size: 128, offset: 704)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !390, file: !391, line: 93, baseType: !410, size: 128, offset: 832)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !390, file: !391, line: 106, baseType: !420, size: 192, offset: 960)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !416, size: 192, elements: !421)
!421 = !{!422}
!422 = !DISubrange(count: 3)
!423 = !DISubprogram(name: "record_file", scope: !383, file: !383, line: 7, type: !424, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!424 = !DISubroutineType(types: !425)
!425 = !{null, !355, !70, !388}
!426 = !DISubprogram(name: "utimecmp", scope: !321, file: !321, line: 35, type: !427, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!427 = !DISubroutineType(types: !428)
!428 = !{!72, !70, !388, !388, !72}
!429 = !DISubprogram(name: "remember_copied", scope: !191, file: !191, line: 4, type: !430, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!430 = !DISubroutineType(types: !431)
!431 = !{!68, !70, !129, !129}
!432 = !DISubprogram(name: "quotearg_n_style_colon", scope: !38, file: !38, line: 397, type: !350, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!433 = !DISubprogram(name: "backup_file_rename", scope: !6, file: !6, line: 52, type: !434, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!434 = !DISubroutineType(types: !435)
!435 = !{!68, !72, !70, !5}
!436 = !DISubprogram(name: "unlink", scope: !247, file: !247, line: 825, type: !437, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!437 = !DISubroutineType(types: !438)
!438 = !{!72, !70}
!439 = !DISubprogram(name: "src_to_dest_lookup", scope: !191, file: !191, line: 5, type: !440, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!440 = !DISubroutineType(types: !441)
!441 = !{!68, !129, !129}
!442 = !DISubprogram(name: "same_name", scope: !443, file: !443, line: 23, type: !444, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!443 = !DIFile(filename: "./lib/same.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!444 = !DISubroutineType(types: !445)
!445 = !{!207, !70, !70}
!446 = !DISubprogram(name: "rename", scope: !75, file: !75, line: 148, type: !447, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!447 = !DISubroutineType(types: !448)
!448 = !{!72, !70, !70}
!449 = !DISubprogram(name: "forget_created", scope: !191, file: !191, line: 3, type: !450, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!450 = !DISubroutineType(types: !451)
!451 = !{null, !129, !129}
!452 = !DISubprogram(name: "rmdir", scope: !247, file: !247, line: 834, type: !437, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!453 = !DISubprogram(name: "mkdir", scope: !379, file: !379, line: 317, type: !454, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!454 = !DISubroutineType(types: !455)
!455 = !{!72, !70, !7}
!456 = !DISubprogram(name: "lchmod", scope: !457, file: !457, line: 993, type: !454, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!457 = !DIFile(filename: "./lib/sys/stat.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!458 = !DISubprogram(name: "dir_name", scope: !251, file: !251, line: 40, type: !147, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!459 = !DISubprogram(name: "force_symlinkat", scope: !460, file: !460, line: 2, type: !461, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!460 = !DIFile(filename: "src/force-link.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!461 = !DISubroutineType(types: !462)
!462 = !{!72, !70, !72, !70, !207, !72}
!463 = !DISubprogram(name: "mkfifo", scope: !379, file: !379, line: 346, type: !454, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!464 = !DISubprogram(name: "areadlink_with_size", scope: !465, file: !465, line: 24, type: !466, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!465 = !DIFile(filename: "./lib/areadlink.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!466 = !DISubroutineType(types: !467)
!467 = !{!68, !70, !129}
!468 = !DISubprogram(name: "lchown", scope: !247, file: !247, line: 483, type: !469, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!469 = !DISubroutineType(types: !470)
!470 = !{!72, !70, !7, !7}
!471 = !DISubprogram(name: "utimens", scope: !472, file: !472, line: 22, type: !473, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!472 = !DIFile(filename: "./lib/utimens.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!473 = !DISubroutineType(types: !474)
!474 = !{!72, !70, !475}
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !410)
!477 = !DISubprogram(name: "copy_acl", scope: !478, file: !478, line: 32, type: !479, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!478 = !DIFile(filename: "./lib/acl.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!479 = !DISubroutineType(types: !480)
!480 = !{!72, !70, !72, !70, !72, !7}
!481 = !DISubprogram(name: "set_acl", scope: !478, file: !478, line: 30, type: !482, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!482 = !DISubroutineType(types: !483)
!483 = !{!72, !70, !72, !7}
!484 = !DISubprogram(name: "canonicalize_file_name", scope: !150, file: !150, line: 790, type: !147, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!485 = !DISubprogram(name: "force_linkat", scope: !460, file: !460, line: 1, type: !486, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!486 = !DISubroutineType(types: !487)
!487 = !{!72, !72, !70, !72, !70, !72, !207, !72}
!488 = !DISubprogram(name: "can_write_any_file", scope: !489, file: !489, line: 2, type: !490, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!489 = !DIFile(filename: "./lib/write-any-file.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!490 = !DISubroutineType(types: !491)
!491 = !{!207}
!492 = !DISubprogram(name: "euidaccess", scope: !247, file: !247, line: 292, type: !493, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!493 = !DISubroutineType(types: !494)
!494 = !{!72, !70, !72}
!495 = !DISubprogram(name: "strmode", scope: !496, file: !496, line: 35, type: !497, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!496 = !DIFile(filename: "./lib/filemode.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!497 = !DISubroutineType(types: !498)
!498 = !{null, !7, !68}
!499 = !DISubprogram(name: "yesno", scope: !500, file: !500, line: 22, type: !490, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!500 = !DIFile(filename: "./lib/yesno.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!501 = !DISubprogram(name: "xmalloc", scope: !502, file: !502, line: 53, type: !503, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!502 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!503 = !DISubroutineType(types: !504)
!504 = !{!125, !129}
!505 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!506 = !DISubprogram(name: "savedir", scope: !325, file: !325, line: 39, type: !507, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!507 = !DISubroutineType(types: !508)
!508 = !{!68, !70, !324}
!509 = !DISubprogram(name: "open_safer", scope: !510, file: !510, line: 22, type: !511, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!510 = !DIFile(filename: "./lib/fcntl-safer.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!511 = !DISubroutineType(types: !512)
!512 = !{!72, !70, !72, null}
!513 = !DISubprogram(name: "getpagesize", scope: !247, file: !247, line: 976, type: !514, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!514 = !DISubroutineType(types: !515)
!515 = !{!72}
!516 = !DISubprogram(name: "fdadvise", scope: !332, file: !332, line: 71, type: !517, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!517 = !DISubroutineType(types: !518)
!518 = !{null, !72, !103, !103, !331}
!519 = !DISubprogram(name: "buffer_lcm", scope: !520, file: !520, line: 2, type: !521, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!520 = !DIFile(filename: "./lib/buffer-lcm.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!521 = !DISubroutineType(types: !522)
!522 = !{!129, !129, !129, !129}
!523 = !DISubprogram(name: "ftruncate", scope: !247, file: !247, line: 1014, type: !524, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!524 = !DISubroutineType(types: !525)
!525 = !{!72, !72, !103}
!526 = !DISubprogram(name: "fdutimens", scope: !472, file: !472, line: 21, type: !527, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!527 = !DISubroutineType(types: !528)
!528 = !{!72, !72, !70, !475}
!529 = !DISubprogram(name: "close", scope: !247, file: !247, line: 353, type: !248, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!530 = !DISubprogram(name: "ioctl", scope: !531, file: !531, line: 41, type: !532, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!531 = !DIFile(filename: "/usr/include/sys/ioctl.h", directory: "")
!532 = !DISubroutineType(types: !533)
!533 = !{!72, !72, !129, null}
!534 = !DISubprogram(name: "extent_scan_init", scope: !535, file: !535, line: 61, type: !536, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!535 = !DIFile(filename: "src/extent-scan.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!536 = !DISubroutineType(types: !537)
!537 = !{null, !72, !538}
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extent_scan", file: !535, line: 36, size: 384, elements: !540)
!540 = !{!541, !542, !544, !545, !546, !547, !548}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !539, file: !535, line: 39, baseType: !72, size: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "scan_start", scope: !539, file: !535, line: 42, baseType: !543, size: 64, offset: 64)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !75, line: 63, baseType: !101)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "fm_flags", scope: !539, file: !535, line: 45, baseType: !7, size: 32, offset: 128)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "ei_count", scope: !539, file: !535, line: 48, baseType: !127, size: 64, offset: 192)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "initial_scan_failed", scope: !539, file: !535, line: 52, baseType: !207, size: 8, offset: 256)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "hit_final_extent", scope: !539, file: !535, line: 55, baseType: !207, size: 8, offset: 264)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "ext_info", scope: !539, file: !535, line: 58, baseType: !549, size: 64, offset: 320)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "extent_info", file: !535, line: 23, size: 192, elements: !551)
!551 = !{!552, !553, !554}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "ext_logical", scope: !550, file: !535, line: 26, baseType: !543, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "ext_length", scope: !550, file: !535, line: 29, baseType: !543, size: 64, offset: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "ext_flags", scope: !550, file: !535, line: 32, baseType: !7, size: 32, offset: 128)
!555 = !DISubprogram(name: "extent_scan_read", scope: !535, file: !535, line: 63, type: !556, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!556 = !DISubroutineType(types: !557)
!557 = !{!207, !538}
!558 = !DISubprogram(name: "lseek", scope: !247, file: !247, line: 334, type: !559, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!559 = !DISubroutineType(types: !560)
!560 = !{!103, !72, !103, !72}
!561 = !DISubprogram(name: "rpl_calloc", scope: !562, file: !562, line: 688, type: !563, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!562 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!563 = !DISubroutineType(types: !564)
!564 = !{!125, !129, !129}
!565 = !DISubprogram(name: "full_write", scope: !566, file: !566, line: 29, type: !567, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!566 = !DIFile(filename: "./lib/full-write.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!567 = !DISubroutineType(types: !568)
!568 = !{!129, !72, !369, !129}
!569 = !DISubprogram(name: "fallocate", scope: !570, file: !570, line: 413, type: !571, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!570 = !DIFile(filename: "/usr/include/bits/fcntl-linux.h", directory: "")
!571 = !DISubroutineType(types: !572)
!572 = !{!72, !72, !72, !103, !103}
!573 = !DISubprogram(name: "fchmod", scope: !379, file: !379, line: 293, type: !574, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!574 = !DISubroutineType(types: !575)
!575 = !{!72, !72, !7}
!576 = !DISubprogram(name: "lutimens", scope: !472, file: !472, line: 23, type: !473, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!577 = !DISubprogram(name: "qset_acl", scope: !478, file: !478, line: 29, type: !482, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!578 = !DISubprogram(name: "fchown", scope: !247, file: !247, line: 478, type: !579, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!579 = !DISubroutineType(types: !580)
!580 = !{!72, !72, !7, !7}
!581 = !DISubprogram(name: "attr_copy_fd", scope: !582, file: !582, line: 30, type: !583, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!582 = !DIFile(filename: "/usr/include/attr/libattr.h", directory: "")
!583 = !DISubroutineType(types: !584)
!584 = !{!72, !70, !72, !70, !72, !585, !588}
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DISubroutineType(types: !587)
!587 = !{!72, !70, !588}
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "error_context", file: !590, line: 25, size: 192, elements: !591)
!590 = !DIFile(filename: "/usr/include/attr/error_context.h", directory: "")
!591 = !{!592, !596, !600}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !589, file: !590, line: 27, baseType: !593, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DISubroutineType(types: !595)
!595 = !{null, !588, !70, null}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "quote", scope: !589, file: !590, line: 30, baseType: !597, size: 64, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DISubroutineType(types: !599)
!599 = !{!70, !588, !70}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "quote_free", scope: !589, file: !590, line: 33, baseType: !601, size: 64, offset: 128)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DISubroutineType(types: !603)
!603 = !{null, !588, !70}
!604 = !DISubprogram(name: "attr_copy_file", scope: !582, file: !582, line: 27, type: !605, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!605 = !DISubroutineType(types: !606)
!606 = !{!72, !70, !70, !585, !588}
!607 = !DISubprogram(name: "verror", scope: !608, file: !608, line: 34, type: !609, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!608 = !DIFile(filename: "./lib/verror.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!609 = !DISubroutineType(types: !610)
!610 = !{null, !72, !72, !70, !611}
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !318, line: 657, size: 192, elements: !613)
!613 = !{!614, !615, !616, !617}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !612, file: !318, line: 657, baseType: !7, size: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !612, file: !318, line: 657, baseType: !7, size: 32, offset: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !612, file: !318, line: 657, baseType: !125, size: 64, offset: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !612, file: !318, line: 657, baseType: !125, size: 64, offset: 128)
!618 = !DISubprogram(name: "attr_copy_check_permissions", scope: !582, file: !582, line: 35, type: !586, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!619 = !{!620, !315, !625, !627, !637, !639}
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(name: "mask", scope: !622, file: !318, line: 3087, type: !203, isLocal: true, isDefinition: true)
!622 = distinct !DISubprogram(name: "cached_umask", scope: !318, file: !318, line: 3085, type: !623, scopeLine: 3086, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !317, retainedNodes: !73)
!623 = !DISubroutineType(types: !624)
!624 = !{!203}
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(name: "top_level_dst_name", scope: !317, file: !318, line: 148, type: !70, isLocal: true, isDefinition: true)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(name: "zeros", scope: !629, file: !318, line: 385, type: !68, isLocal: true, isDefinition: true)
!629 = distinct !DISubprogram(name: "write_zeros", scope: !318, file: !318, line: 383, type: !630, scopeLine: 384, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !317, retainedNodes: !632)
!630 = !DISubroutineType(types: !631)
!631 = !{!207, !72, !543}
!632 = !{!633, !634, !635}
!633 = !DILocalVariable(name: "fd", arg: 1, scope: !629, file: !318, line: 383, type: !72)
!634 = !DILocalVariable(name: "n_bytes", arg: 2, scope: !629, file: !318, line: 383, type: !543)
!635 = !DILocalVariable(name: "n", scope: !636, file: !318, line: 404, type: !127)
!636 = distinct !DILexicalBlock(scope: !629, file: !318, line: 403, column: 5)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(name: "nz", scope: !629, file: !318, line: 386, type: !127, isLocal: true, isDefinition: true)
!639 = !DIGlobalVariableExpression(var: !640, expr: !DIExpression())
!640 = distinct !DIGlobalVariable(name: "fallback", scope: !629, file: !318, line: 393, type: !641, isLocal: true, isDefinition: true)
!641 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 8192, elements: !642)
!642 = !{!643}
!643 = !DISubrange(count: 1024)
!644 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709421568, DW_OP_mul, DW_OP_constu, 131072, DW_OP_plus, DW_OP_stack_value))
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(name: "src_to_dest", scope: !647, file: !648, line: 45, type: !240, isLocal: true, isDefinition: true)
!647 = distinct !DICompileUnit(language: DW_LANG_C99, file: !648, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !73, retainedTypes: !649, globals: !677, splitDebugInlining: false, nameTableKind: None)
!648 = !DIFile(filename: "src/cp-hash.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!649 = !{!650, !653, !501, !656, !657, !125, !658, !68, !659, !671, !260, !674}
!650 = !DISubprogram(name: "hash_delete", scope: !242, file: !242, line: 104, type: !651, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!651 = !DISubroutineType(types: !652)
!652 = !{!125, !355, !369}
!653 = !DISubprogram(name: "hash_lookup", scope: !242, file: !242, line: 78, type: !654, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!654 = !DISubroutineType(types: !655)
!655 = !{!125, !386, !369}
!656 = !DISubprogram(name: "xstrdup", scope: !502, file: !502, line: 64, type: !147, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!657 = !DISubprogram(name: "hash_insert", scope: !242, file: !242, line: 100, type: !651, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!658 = !DISubprogram(name: "xalloc_die", scope: !502, file: !502, line: 51, type: !154, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !73)
!659 = !DISubprogram(name: "hash_initialize", scope: !242, file: !242, line: 89, type: !660, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!660 = !DISubroutineType(types: !661)
!661 = !{!355, !129, !662, !366, !371, !374}
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !664)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !242, line: 53, size: 160, elements: !665)
!665 = !{!666, !667, !668, !669, !670}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !664, file: !242, line: 58, baseType: !361, size: 32)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !664, file: !242, line: 59, baseType: !361, size: 32, offset: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !664, file: !242, line: 60, baseType: !361, size: 32, offset: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !664, file: !242, line: 61, baseType: !361, size: 32, offset: 96)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !664, file: !242, line: 62, baseType: !207, size: 8, offset: 128)
!671 = !DISubprogram(name: "hash_free", scope: !242, file: !242, line: 96, type: !672, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!672 = !DISubroutineType(types: !673)
!673 = !{null, !355}
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !675, line: 102, baseType: !676)
!675 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !102, line: 73, baseType: !129)
!677 = !{!645}
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(name: "simple_pattern", scope: !680, file: !681, line: 38, type: !710, isLocal: true, isDefinition: true)
!680 = distinct !DICompileUnit(language: DW_LANG_C99, file: !681, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !682, retainedTypes: !689, globals: !709, splitDebugInlining: false, nameTableKind: None)
!681 = !DIFile(filename: "src/force-link.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!682 = !{!683, !686}
!683 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !681, line: 39, baseType: !7, size: 32, elements: !684)
!684 = !{!685}
!685 = !DIEnumerator(name: "x_suffix_len", value: 6, isUnsigned: true)
!686 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !681, line: 44, baseType: !7, size: 32, elements: !687)
!687 = !{!688}
!688 = !DIEnumerator(name: "smallsize", value: 256, isUnsigned: true)
!689 = !{!690, !693, !700, !703, !260, !706, !254}
!690 = !DISubprogram(name: "linkat", scope: !247, file: !247, line: 795, type: !691, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!691 = !DISubroutineType(types: !692)
!692 = !{!72, !72, !70, !72, !70, !72}
!693 = !DISubprogram(name: "try_tempname_len", scope: !694, file: !694, line: 62, type: !695, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!694 = !DIFile(filename: "./lib/tempname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!695 = !DISubroutineType(types: !696)
!696 = !{!72, !68, !72, !125, !697, !129}
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DISubroutineType(types: !699)
!699 = !{!72, !68, !125}
!700 = !DISubprogram(name: "renameat", scope: !75, file: !75, line: 152, type: !701, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!701 = !DISubroutineType(types: !702)
!702 = !{!72, !72, !70, !72, !70}
!703 = !DISubprogram(name: "unlinkat", scope: !247, file: !247, line: 829, type: !704, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!704 = !DISubroutineType(types: !705)
!705 = !{!72, !72, !70, !72}
!706 = !DISubprogram(name: "symlinkat", scope: !247, file: !247, line: 815, type: !707, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!707 = !DISubroutineType(types: !708)
!708 = !{!72, !70, !72, !70}
!709 = !{!678}
!710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 72, elements: !711)
!711 = !{!712}
!712 = !DISubrange(count: 9)
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(name: "Version", scope: !715, file: !716, line: 2, type: !70, isLocal: false, isDefinition: true)
!715 = distinct !DICompileUnit(language: DW_LANG_C99, file: !716, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !73, globals: !717, splitDebugInlining: false, nameTableKind: None)
!716 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!717 = !{!713}
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(name: "simple_backup_suffix", scope: !720, file: !721, line: 82, type: !70, isLocal: false, isDefinition: true)
!720 = distinct !DICompileUnit(language: DW_LANG_C99, file: !721, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !722, retainedTypes: !783, globals: !820, splitDebugInlining: false, nameTableKind: None)
!721 = !DIFile(filename: "lib/backupfile.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!722 = !{!5, !723, !753, !759}
!723 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !724, file: !721, line: 327, baseType: !7, size: 32, elements: !751)
!724 = distinct !DISubprogram(name: "backupfile_internal", scope: !721, file: !721, line: 314, type: !725, scopeLine: 316, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !720, retainedNodes: !727)
!725 = !DISubroutineType(types: !726)
!726 = !{!68, !72, !70, !5, !207}
!727 = !{!728, !729, !730, !731, !732, !734, !735, !736, !737, !740, !741, !746, !747, !748, !750}
!728 = !DILocalVariable(name: "dir_fd", arg: 1, scope: !724, file: !721, line: 314, type: !72)
!729 = !DILocalVariable(name: "file", arg: 2, scope: !724, file: !721, line: 314, type: !70)
!730 = !DILocalVariable(name: "backup_type", arg: 3, scope: !724, file: !721, line: 315, type: !5)
!731 = !DILocalVariable(name: "rename", arg: 4, scope: !724, file: !721, line: 315, type: !207)
!732 = !DILocalVariable(name: "base_offset", scope: !724, file: !721, line: 317, type: !733)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !128, line: 35, baseType: !103)
!734 = !DILocalVariable(name: "filelen", scope: !724, file: !721, line: 318, type: !127)
!735 = !DILocalVariable(name: "simple_backup_suffix_size", scope: !724, file: !721, line: 325, type: !127)
!736 = !DILocalVariable(name: "backup_suffix_size_guess", scope: !724, file: !721, line: 326, type: !127)
!737 = !DILocalVariable(name: "ssize", scope: !724, file: !721, line: 331, type: !738)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !204, line: 108, baseType: !739)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !102, line: 193, baseType: !103)
!740 = !DILocalVariable(name: "s", scope: !724, file: !721, line: 332, type: !68)
!741 = !DILocalVariable(name: "dirp", scope: !724, file: !721, line: 336, type: !742)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !744, line: 127, baseType: !745)
!744 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!745 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !744, line: 127, flags: DIFlagFwdDecl)
!746 = !DILocalVariable(name: "sdir", scope: !724, file: !721, line: 337, type: !72)
!747 = !DILocalVariable(name: "base_max", scope: !724, file: !721, line: 338, type: !127)
!748 = !DILocalVariable(name: "flags", scope: !749, file: !721, line: 380, type: !7)
!749 = distinct !DILexicalBlock(scope: !724, file: !721, line: 340, column: 5)
!750 = !DILocalVariable(name: "e", scope: !749, file: !721, line: 383, type: !72)
!751 = !{!752}
!752 = !DIEnumerator(name: "GUESS", value: 9, isUnsigned: true)
!753 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "numbered_backup_result", file: !721, line: 172, baseType: !7, size: 32, elements: !754)
!754 = !{!755, !756, !757, !758}
!755 = !DIEnumerator(name: "BACKUP_IS_SAME_LENGTH", value: 0, isUnsigned: true)
!756 = !DIEnumerator(name: "BACKUP_IS_LONGER", value: 1, isUnsigned: true)
!757 = !DIEnumerator(name: "BACKUP_IS_NEW", value: 2, isUnsigned: true)
!758 = !DIEnumerator(name: "BACKUP_NOMEM", value: 3, isUnsigned: true)
!759 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !760, line: 24, baseType: !7, size: 32, elements: !761)
!760 = !DIFile(filename: "/usr/include/bits/confname.h", directory: "")
!761 = !{!762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782}
!762 = !DIEnumerator(name: "_PC_LINK_MAX", value: 0, isUnsigned: true)
!763 = !DIEnumerator(name: "_PC_MAX_CANON", value: 1, isUnsigned: true)
!764 = !DIEnumerator(name: "_PC_MAX_INPUT", value: 2, isUnsigned: true)
!765 = !DIEnumerator(name: "_PC_NAME_MAX", value: 3, isUnsigned: true)
!766 = !DIEnumerator(name: "_PC_PATH_MAX", value: 4, isUnsigned: true)
!767 = !DIEnumerator(name: "_PC_PIPE_BUF", value: 5, isUnsigned: true)
!768 = !DIEnumerator(name: "_PC_CHOWN_RESTRICTED", value: 6, isUnsigned: true)
!769 = !DIEnumerator(name: "_PC_NO_TRUNC", value: 7, isUnsigned: true)
!770 = !DIEnumerator(name: "_PC_VDISABLE", value: 8, isUnsigned: true)
!771 = !DIEnumerator(name: "_PC_SYNC_IO", value: 9, isUnsigned: true)
!772 = !DIEnumerator(name: "_PC_ASYNC_IO", value: 10, isUnsigned: true)
!773 = !DIEnumerator(name: "_PC_PRIO_IO", value: 11, isUnsigned: true)
!774 = !DIEnumerator(name: "_PC_SOCK_MAXBUF", value: 12, isUnsigned: true)
!775 = !DIEnumerator(name: "_PC_FILESIZEBITS", value: 13, isUnsigned: true)
!776 = !DIEnumerator(name: "_PC_REC_INCR_XFER_SIZE", value: 14, isUnsigned: true)
!777 = !DIEnumerator(name: "_PC_REC_MAX_XFER_SIZE", value: 15, isUnsigned: true)
!778 = !DIEnumerator(name: "_PC_REC_MIN_XFER_SIZE", value: 16, isUnsigned: true)
!779 = !DIEnumerator(name: "_PC_REC_XFER_ALIGN", value: 17, isUnsigned: true)
!780 = !DIEnumerator(name: "_PC_ALLOC_SIZE_MIN", value: 18, isUnsigned: true)
!781 = !DIEnumerator(name: "_PC_SYMLINK_MAX", value: 19, isUnsigned: true)
!782 = !DIEnumerator(name: "_PC_2_SYMLINKS", value: 20, isUnsigned: true)
!783 = !{!784, !254, !785, !260, !182, !789, !792, !795, !799, !125, !7, !127, !814, !817}
!784 = !DISubprogram(name: "getenv", scope: !150, file: !150, line: 634, type: !147, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!785 = !DISubprogram(name: "closedir", scope: !744, file: !744, line: 149, type: !786, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!786 = !DISubroutineType(types: !787)
!787 = !{!72, !788}
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!789 = !DISubprogram(name: "base_len", scope: !251, file: !251, line: 44, type: !790, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!790 = !DISubroutineType(types: !791)
!791 = !{!129, !70}
!792 = !DISubprogram(name: "rewinddir", scope: !744, file: !744, line: 209, type: !793, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!793 = !DISubroutineType(types: !794)
!794 = !{null, !788}
!795 = !DISubprogram(name: "opendirat", scope: !796, file: !796, line: 2, type: !797, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!796 = !DIFile(filename: "./lib/opendirat.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!797 = !DISubroutineType(types: !798)
!798 = !{!788, !72, !70, !72, !169}
!799 = !DISubprogram(name: "readdir", scope: !744, file: !744, line: 162, type: !800, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!800 = !DISubroutineType(types: !801)
!801 = !{!802, !788}
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !804, line: 22, size: 2240, elements: !805)
!804 = !DIFile(filename: "/usr/include/bits/dirent.h", directory: "")
!805 = !{!806, !807, !808, !809, !810}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !803, file: !804, line: 25, baseType: !288, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !803, file: !804, line: 26, baseType: !101, size: 64, offset: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !803, file: !804, line: 31, baseType: !105, size: 16, offset: 128)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !803, file: !804, line: 32, baseType: !505, size: 8, offset: 144)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !803, file: !804, line: 33, baseType: !811, size: 2048, offset: 152)
!811 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 2048, elements: !812)
!812 = !{!813}
!813 = !DISubrange(count: 256)
!814 = !DISubprogram(name: "pathconf", scope: !247, file: !247, line: 612, type: !815, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!815 = !DISubroutineType(types: !816)
!816 = !{!103, !70, !72}
!817 = !DISubprogram(name: "fpathconf", scope: !247, file: !247, line: 616, type: !818, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!818 = !DISubroutineType(types: !819)
!819 = !{!103, !72, !72}
!820 = !{!718}
!821 = !DIGlobalVariableExpression(var: !822, expr: !DIExpression())
!822 = distinct !DIGlobalVariable(name: "backup_args", scope: !823, file: !824, line: 42, type: !836, isLocal: true, isDefinition: true)
!823 = distinct !DICompileUnit(language: DW_LANG_C99, file: !824, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !825, retainedTypes: !826, globals: !829, splitDebugInlining: false, nameTableKind: None)
!824 = !DIFile(filename: "lib/backup-find.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!825 = !{!5}
!826 = !{!827, !658, !369, !784}
!827 = !DISubprogram(name: "backupfile_internal", scope: !828, file: !828, line: 3, type: !725, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!828 = !DIFile(filename: "./lib/backup-internal.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!829 = !{!830, !821}
!830 = !DIGlobalVariableExpression(var: !831, expr: !DIExpression())
!831 = distinct !DIGlobalVariable(name: "backup_types", scope: !823, file: !824, line: 53, type: !832, isLocal: true, isDefinition: true)
!832 = !DICompositeType(tag: DW_TAG_array_type, baseType: !833, size: 256, elements: !834)
!833 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!834 = !{!835}
!835 = !DISubrange(count: 8)
!836 = !DICompositeType(tag: DW_TAG_array_type, baseType: !837, size: 576, elements: !711)
!837 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !70)
!838 = !DIGlobalVariableExpression(var: !839, expr: !DIExpression())
!839 = distinct !DIGlobalVariable(name: "file_name", scope: !840, file: !841, line: 37, type: !70, isLocal: true, isDefinition: true)
!840 = distinct !DICompileUnit(language: DW_LANG_C99, file: !841, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !73, retainedTypes: !842, globals: !891, splitDebugInlining: false, nameTableKind: None)
!841 = !DIFile(filename: "lib/closein.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!842 = !{!843, !879, !883, !886, !64, !888, !171, !889}
!843 = !DISubprogram(name: "freadahead", scope: !844, file: !844, line: 41, type: !845, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!844 = !DIFile(filename: "./lib/freadahead.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!845 = !DISubroutineType(types: !846)
!846 = !{!129, !847}
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !80, line: 49, size: 1728, elements: !849)
!849 = !{!850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !848, file: !80, line: 51, baseType: !72, size: 32)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !848, file: !80, line: 54, baseType: !68, size: 64, offset: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !848, file: !80, line: 55, baseType: !68, size: 64, offset: 128)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !848, file: !80, line: 56, baseType: !68, size: 64, offset: 192)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !848, file: !80, line: 57, baseType: !68, size: 64, offset: 256)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !848, file: !80, line: 58, baseType: !68, size: 64, offset: 320)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !848, file: !80, line: 59, baseType: !68, size: 64, offset: 384)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !848, file: !80, line: 60, baseType: !68, size: 64, offset: 448)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !848, file: !80, line: 61, baseType: !68, size: 64, offset: 512)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !848, file: !80, line: 64, baseType: !68, size: 64, offset: 576)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !848, file: !80, line: 65, baseType: !68, size: 64, offset: 640)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !848, file: !80, line: 66, baseType: !68, size: 64, offset: 704)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !848, file: !80, line: 68, baseType: !95, size: 64, offset: 768)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !848, file: !80, line: 70, baseType: !847, size: 64, offset: 832)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !848, file: !80, line: 72, baseType: !72, size: 32, offset: 896)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !848, file: !80, line: 73, baseType: !72, size: 32, offset: 928)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !848, file: !80, line: 74, baseType: !101, size: 64, offset: 960)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !848, file: !80, line: 77, baseType: !105, size: 16, offset: 1024)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !848, file: !80, line: 78, baseType: !107, size: 8, offset: 1040)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !848, file: !80, line: 79, baseType: !109, size: 8, offset: 1048)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !848, file: !80, line: 81, baseType: !113, size: 64, offset: 1088)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !848, file: !80, line: 89, baseType: !116, size: 64, offset: 1152)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !848, file: !80, line: 91, baseType: !118, size: 64, offset: 1216)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !848, file: !80, line: 92, baseType: !121, size: 64, offset: 1280)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !848, file: !80, line: 93, baseType: !847, size: 64, offset: 1344)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !848, file: !80, line: 94, baseType: !125, size: 64, offset: 1408)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !848, file: !80, line: 95, baseType: !127, size: 64, offset: 1472)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !848, file: !80, line: 96, baseType: !72, size: 32, offset: 1536)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !848, file: !80, line: 98, baseType: !132, size: 160, offset: 1568)
!879 = !DISubprogram(name: "rpl_fseeko", scope: !880, file: !880, line: 1034, type: !881, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!880 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!881 = !DISubroutineType(types: !882)
!882 = !{!72, !847, !103, !72}
!883 = !DISubprogram(name: "rpl_fflush", scope: !880, file: !880, line: 718, type: !884, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!884 = !DISubroutineType(types: !885)
!885 = !{!72, !847}
!886 = !DISubprogram(name: "close_stream", scope: !887, file: !887, line: 2, type: !884, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!887 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!888 = !DISubprogram(name: "quotearg_colon", scope: !38, file: !38, line: 391, type: !147, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!889 = !DISubprogram(name: "close_stdout", scope: !890, file: !890, line: 30, type: !154, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!890 = !DIFile(filename: "./lib/closeout.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!891 = !{!838}
!892 = !DIGlobalVariableExpression(var: !893, expr: !DIExpression())
!893 = distinct !DIGlobalVariable(name: "file_name", scope: !894, file: !895, line: 46, type: !70, isLocal: true, isDefinition: true)
!894 = distinct !DICompileUnit(language: DW_LANG_C99, file: !895, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !73, retainedTypes: !896, globals: !932, splitDebugInlining: false, nameTableKind: None)
!895 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!896 = !{!897, !64, !888, !171}
!897 = !DISubprogram(name: "close_stream", scope: !887, file: !887, line: 2, type: !898, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!898 = !DISubroutineType(types: !899)
!899 = !{!72, !900}
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !80, line: 49, size: 1728, elements: !902)
!902 = !{!903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !901, file: !80, line: 51, baseType: !72, size: 32)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !901, file: !80, line: 54, baseType: !68, size: 64, offset: 64)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !901, file: !80, line: 55, baseType: !68, size: 64, offset: 128)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !901, file: !80, line: 56, baseType: !68, size: 64, offset: 192)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !901, file: !80, line: 57, baseType: !68, size: 64, offset: 256)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !901, file: !80, line: 58, baseType: !68, size: 64, offset: 320)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !901, file: !80, line: 59, baseType: !68, size: 64, offset: 384)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !901, file: !80, line: 60, baseType: !68, size: 64, offset: 448)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !901, file: !80, line: 61, baseType: !68, size: 64, offset: 512)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !901, file: !80, line: 64, baseType: !68, size: 64, offset: 576)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !901, file: !80, line: 65, baseType: !68, size: 64, offset: 640)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !901, file: !80, line: 66, baseType: !68, size: 64, offset: 704)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !901, file: !80, line: 68, baseType: !95, size: 64, offset: 768)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !901, file: !80, line: 70, baseType: !900, size: 64, offset: 832)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !901, file: !80, line: 72, baseType: !72, size: 32, offset: 896)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !901, file: !80, line: 73, baseType: !72, size: 32, offset: 928)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !901, file: !80, line: 74, baseType: !101, size: 64, offset: 960)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !901, file: !80, line: 77, baseType: !105, size: 16, offset: 1024)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !901, file: !80, line: 78, baseType: !107, size: 8, offset: 1040)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !901, file: !80, line: 79, baseType: !109, size: 8, offset: 1048)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !901, file: !80, line: 81, baseType: !113, size: 64, offset: 1088)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !901, file: !80, line: 89, baseType: !116, size: 64, offset: 1152)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !901, file: !80, line: 91, baseType: !118, size: 64, offset: 1216)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !901, file: !80, line: 92, baseType: !121, size: 64, offset: 1280)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !901, file: !80, line: 93, baseType: !900, size: 64, offset: 1344)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !901, file: !80, line: 94, baseType: !125, size: 64, offset: 1408)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !901, file: !80, line: 95, baseType: !127, size: 64, offset: 1472)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !901, file: !80, line: 96, baseType: !72, size: 32, offset: 1536)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !901, file: !80, line: 98, baseType: !132, size: 160, offset: 1568)
!932 = !{!892, !933}
!933 = !DIGlobalVariableExpression(var: !934, expr: !DIExpression())
!934 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !894, file: !895, line: 56, type: !207, isLocal: true, isDefinition: true)
!935 = !DIGlobalVariableExpression(var: !936, expr: !DIExpression())
!936 = distinct !DIGlobalVariable(name: "exit_failure", scope: !937, file: !938, line: 24, type: !940, isLocal: false, isDefinition: true)
!937 = distinct !DICompileUnit(language: DW_LANG_C99, file: !938, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !73, globals: !939, splitDebugInlining: false, nameTableKind: None)
!938 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!939 = !{!935}
!940 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !72)
!941 = !DIGlobalVariableExpression(var: !942, expr: !DIExpression())
!942 = distinct !DIGlobalVariable(name: "default_tuning", scope: !943, file: !944, line: 130, type: !947, isLocal: true, isDefinition: true)
!943 = distinct !DICompileUnit(language: DW_LANG_C99, file: !944, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !73, retainedTypes: !945, globals: !946, splitDebugInlining: false, nameTableKind: None)
!944 = !DIFile(filename: "lib/hash.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!945 = !{!129, !125, !561, !260, !127}
!946 = !{!941}
!947 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !948)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !242, line: 65, baseType: !949)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !242, line: 53, size: 160, elements: !950)
!950 = !{!951, !952, !953, !954, !955}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !949, file: !242, line: 58, baseType: !361, size: 32)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !949, file: !242, line: 59, baseType: !361, size: 32, offset: 32)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !949, file: !242, line: 60, baseType: !361, size: 32, offset: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !949, file: !242, line: 61, baseType: !361, size: 32, offset: 96)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !949, file: !242, line: 62, baseType: !207, size: 8, offset: 128)
!956 = !DIGlobalVariableExpression(var: !957, expr: !DIExpression())
!957 = distinct !DIGlobalVariable(name: "program_name", scope: !958, file: !959, line: 33, type: !70, isLocal: false, isDefinition: true)
!958 = distinct !DICompileUnit(language: DW_LANG_C99, file: !959, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !73, retainedTypes: !960, globals: !996, splitDebugInlining: false, nameTableKind: None)
!959 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!960 = !{!125, !961, !68}
!961 = !DISubprogram(name: "fputs", scope: !75, file: !75, line: 626, type: !962, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !73)
!962 = !DISubroutineType(types: !963)
!963 = !{!72, !70, !964}
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !80, line: 49, size: 1728, elements: !966)
!966 = !{!967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !965, file: !80, line: 51, baseType: !72, size: 32)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !965, file: !80, line: 54, baseType: !68, size: 64, offset: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !965, file: !80, line: 55, baseType: !68, size: 64, offset: 128)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !965, file: !80, line: 56, baseType: !68, size: 64, offset: 192)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !965, file: !80, line: 57, baseType: !68, size: 64, offset: 256)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !965, file: !80, line: 58, baseType: !68, size: 64, offset: 320)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !965, file: !80, line: 59, baseType: !68, size: 64, offset: 384)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !965, file: !80, line: 60, baseType: !68, size: 64, offset: 448)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !965, file: !80, line: 61, baseType: !68, size: 64, offset: 512)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !965, file: !80, line: 64, baseType: !68, size: 64, offset: 576)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !965, file: !80, line: 65, baseType: !68, size: 64, offset: 640)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !965, file: !80, line: 66, baseType: !68, size: 64, offset: 704)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !965, file: !80, line: 68, baseType: !95, size: 64, offset: 768)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !965, file: !80, line: 70, baseType: !964, size: 64, offset: 832)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !965, file: !80, line: 72, baseType: !72, size: 32, offset: 896)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !965, file: !80, line: 73, baseType: !72, size: 32, offset: 928)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !965, file: !80, line: 74, baseType: !101, size: 64, offset: 960)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !965, file: !80, line: 77, baseType: !105, size: 16, offset: 1024)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !965, file: !80, line: 78, baseType: !107, size: 8, offset: 1040)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !965, file: !80, line: 79, baseType: !109, size: 8, offset: 1048)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !965, file: !80, line: 81, baseType: !113, size: 64, offset: 1088)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !965, file: !80, line: 89, baseType: !116, size: 64, offset: 1152)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !965, file: !80, line: 91, baseType: !118, size: 64, offset: 1216)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !965, file: !80, line: 92, baseType: !121, size: 64, offset: 1280)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !965, file: !80, line: 93, baseType: !964, size: 64, offset: 1344)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !965, file: !80, line: 94, baseType: !125, size: 64, offset: 1408)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !965, file: !80, line: 95, baseType: !127, size: 64, offset: 1472)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !965, file: !80, line: 96, baseType: !72, size: 32, offset: 1536)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !965, file: !80, line: 98, baseType: !132, size: 160, offset: 1568)
!996 = !{!956}
!997 = !DIGlobalVariableExpression(var: !998, expr: !DIExpression())
!998 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !999, file: !1000, line: 85, type: !1103, isLocal: false, isDefinition: true)
!999 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1000, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1001, retainedTypes: !1022, globals: !1079, splitDebugInlining: false, nameTableKind: None)
!1000 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1001 = !{!37, !1002, !1007}
!1002 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !38, line: 242, baseType: !7, size: 32, elements: !1003)
!1003 = !{!1004, !1005, !1006}
!1004 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!1005 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!1006 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!1007 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1008, line: 46, baseType: !7, size: 32, elements: !1009)
!1008 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!1009 = !{!1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021}
!1010 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!1011 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!1012 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!1013 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!1014 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!1015 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
