; ModuleID = 'coreutils-8.32/src/nice.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [39 x i8] c"Usage: %s [OPTION] [COMMAND [ARG]...]\0A\00", align 1
@.str.2 = private unnamed_addr constant [222 x i8] c"Run COMMAND with an adjusted niceness, which affects process scheduling.\0AWith no COMMAND, print the current niceness.  Niceness values range from\0A%d (most favorable to the process) to %d (least favorable to the process).\0A\00", align 1

!3 = !DIFile(filename: "src/nice.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !13, !21, !57}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 87, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "EXIT_TIMEDOUT", value: 124, isUnsigned: true)
!10 = !DIEnumerator(name: "EXIT_CANCELED", value: 125, isUnsigned: true)
!11 = !DIEnumerator(name: "EXIT_CANNOT_INVOKE", value: 126, isUnsigned: true)
!12 = !DIEnumerator(name: "EXIT_ENOENT", value: 127, isUnsigned: true)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !14, line: 25, baseType: !7, size: 32, elements: !15)
!14 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!15 = !{!16, !17, !18, !19, !20}
!16 = !DIEnumerator(name: "LONGINT_OK", value: 0, isUnsigned: true)
!17 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3, isUnsigned: true)
!20 = !DIEnumerator(name: "LONGINT_INVALID", value: 4, isUnsigned: true)
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !22, file: !3, line: 170, baseType: !25, size: 32, elements: !54)
!22 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 101, type: !23, scopeLine: 102, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !29)
!23 = !DISubroutineType(types: !24)
!24 = !{!25, !25, !26}
!25 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!29 = !{!30, !31, !32, !33, !34, !37, !39, !40, !44, !47, !48, !49, !53}
!30 = !DILocalVariable(name: "argc", arg: 1, scope: !22, file: !3, line: 101, type: !25)
!31 = !DILocalVariable(name: "argv", arg: 2, scope: !22, file: !3, line: 101, type: !26)
!32 = !DILocalVariable(name: "current_niceness", scope: !22, file: !3, line: 103, type: !25)
!33 = !DILocalVariable(name: "adjustment", scope: !22, file: !3, line: 104, type: !25)
!34 = !DILocalVariable(name: "adjustment_given", scope: !22, file: !3, line: 105, type: !35)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!37 = !DILocalVariable(name: "ok", scope: !22, file: !3, line: 106, type: !38)
!38 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!39 = !DILocalVariable(name: "i", scope: !22, file: !3, line: 107, type: !25)
!40 = !DILocalVariable(name: "s", scope: !41, file: !3, line: 120, type: !35)
!41 = distinct !DILexicalBlock(scope: !42, file: !3, line: 119, column: 5)
!42 = distinct !DILexicalBlock(scope: !43, file: !3, line: 118, column: 3)
!43 = distinct !DILexicalBlock(scope: !22, file: !3, line: 118, column: 3)
!44 = !DILocalVariable(name: "c", scope: !45, file: !3, line: 129, type: !25)
!45 = distinct !DILexicalBlock(scope: !46, file: !3, line: 128, column: 9)
!46 = distinct !DILexicalBlock(scope: !41, file: !3, line: 122, column: 11)
!47 = !DILocalVariable(name: "fake_argc", scope: !45, file: !3, line: 130, type: !25)
!48 = !DILocalVariable(name: "fake_argv", scope: !45, file: !3, line: 131, type: !26)
!49 = !DILocalVariable(name: "tmp", scope: !50, file: !3, line: 171, type: !52)
!50 = distinct !DILexicalBlock(scope: !51, file: !3, line: 166, column: 5)
!51 = distinct !DILexicalBlock(scope: !22, file: !3, line: 165, column: 7)
!52 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!53 = !DILocalVariable(name: "exit_status", scope: !22, file: !3, line: 218, type: !25)
!54 = !{!55, !56}
!55 = !DIEnumerator(name: "MIN_ADJUSTMENT", value: -39)
!56 = !DIEnumerator(name: "MAX_ADJUSTMENT", value: 39)
!57 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__priority_which", file: !58, line: 187, baseType: !7, size: 32, elements: !59)
!58 = !DIFile(filename: "/usr/include/bits/resource.h", directory: "")
!59 = !{!60, !61, !62}
!60 = !DIEnumerator(name: "PRIO_PROCESS", value: 0, isUnsigned: true)
!61 = !DIEnumerator(name: "PRIO_PGRP", value: 1, isUnsigned: true)
!62 = !DIEnumerator(name: "PRIO_USER", value: 2, isUnsigned: true)
!63 = !{!64, !69, !129, !133, !137, !140, !143, !7, !150, !27, !119, !165, !169, !173, !177, !181, !185, !188}
!64 = !DISubprogram(name: "dcgettext", scope: !65, file: !65, line: 51, type: !66, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!65 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!66 = !DISubroutineType(types: !67)
!67 = !{!27, !35, !35, !25}
!68 = !{}
!69 = !DISubprogram(name: "fputs_unlocked", scope: !70, file: !70, line: 662, type: !71, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!70 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!71 = !DISubroutineType(types: !72)
!72 = !{!25, !35, !73}
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !76)
!75 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!76 = !{!77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !92, !93, !94, !95, !98, !100, !102, !106, !109, !111, !114, !117, !118, !120, !124, !125}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !74, file: !75, line: 51, baseType: !25, size: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !74, file: !75, line: 54, baseType: !27, size: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !74, file: !75, line: 55, baseType: !27, size: 64, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !74, file: !75, line: 56, baseType: !27, size: 64, offset: 192)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !74, file: !75, line: 57, baseType: !27, size: 64, offset: 256)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !74, file: !75, line: 58, baseType: !27, size: 64, offset: 320)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !74, file: !75, line: 59, baseType: !27, size: 64, offset: 384)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !74, file: !75, line: 60, baseType: !27, size: 64, offset: 448)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !74, file: !75, line: 61, baseType: !27, size: 64, offset: 512)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !74, file: !75, line: 64, baseType: !27, size: 64, offset: 576)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !74, file: !75, line: 65, baseType: !27, size: 64, offset: 640)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !74, file: !75, line: 66, baseType: !27, size: 64, offset: 704)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !74, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !75, line: 36, flags: DIFlagFwdDecl)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !74, file: !75, line: 70, baseType: !73, size: 64, offset: 832)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !74, file: !75, line: 72, baseType: !25, size: 32, offset: 896)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !74, file: !75, line: 73, baseType: !25, size: 32, offset: 928)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !74, file: !75, line: 74, baseType: !96, size: 64, offset: 960)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !97, line: 152, baseType: !52)
!97 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !74, file: !75, line: 77, baseType: !99, size: 16, offset: 1024)
!99 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !74, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!101 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !74, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 8, elements: !104)
!104 = !{!105}
!105 = !DISubrange(count: 1)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !74, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !75, line: 43, baseType: null)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !74, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !97, line: 153, baseType: !52)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !74, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !75, line: 37, flags: DIFlagFwdDecl)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !74, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !75, line: 38, flags: DIFlagFwdDecl)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !74, file: !75, line: 93, baseType: !73, size: 64, offset: 1344)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !74, file: !75, line: 94, baseType: !119, size: 64, offset: 1408)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !74, file: !75, line: 95, baseType: !121, size: 64, offset: 1472)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !122, line: 46, baseType: !123)
!122 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!123 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !74, file: !75, line: 96, baseType: !25, size: 32, offset: 1536)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !74, file: !75, line: 98, baseType: !126, size: 160, offset: 1568)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 160, elements: !127)
!127 = !{!128}
!128 = !DISubrange(count: 20)
!129 = !DISubprogram(name: "set_program_name", scope: !130, file: !130, line: 37, type: !131, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!130 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!131 = !DISubroutineType(types: !132)
!132 = !{null, !35}
!133 = !DISubprogram(name: "setlocale", scope: !134, file: !134, line: 122, type: !135, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!134 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!135 = !DISubroutineType(types: !136)
!136 = !{!27, !25, !35}
!137 = !DISubprogram(name: "bindtextdomain", scope: !65, file: !65, line: 86, type: !138, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!138 = !DISubroutineType(types: !139)
!139 = !{!27, !35, !35}
!140 = !DISubprogram(name: "textdomain", scope: !65, file: !65, line: 82, type: !141, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!141 = !DISubroutineType(types: !142)
!142 = !{!27, !35}
!143 = !DISubprogram(name: "atexit", scope: !144, file: !144, line: 595, type: !145, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!144 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!145 = !DISubroutineType(types: !146)
!146 = !{!25, !147}
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{null}
!150 = !DISubprogram(name: "getopt_long", scope: !151, file: !151, line: 66, type: !152, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!151 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!152 = !DISubroutineType(types: !153)
!153 = !{!25, !25, !154, !35, !156, !163}
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !158)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !151, line: 50, size: 256, elements: !159)
!159 = !{!160, !161, !162, !164}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !158, file: !151, line: 52, baseType: !35, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !158, file: !151, line: 55, baseType: !25, size: 32, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !158, file: !151, line: 56, baseType: !163, size: 64, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !158, file: !151, line: 57, baseType: !25, size: 32, offset: 192)
!165 = !DISubprogram(name: "version_etc", scope: !166, file: !166, line: 69, type: !167, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!166 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!167 = !DISubroutineType(types: !168)
!168 = !{null, !73, !35, !35, !35, null}
!169 = !DISubprogram(name: "xstrtol", scope: !14, file: !14, line: 43, type: !170, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!170 = !DISubroutineType(types: !171)
!171 = !{!13, !35, !26, !25, !172, !35}
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!173 = !DISubprogram(name: "quote", scope: !174, file: !174, line: 44, type: !175, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!174 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!175 = !DISubroutineType(types: !176)
!176 = !{!35, !35}
!177 = !DISubprogram(name: "error", scope: !178, file: !178, line: 52, type: !179, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!178 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!179 = !DISubroutineType(types: !180)
!180 = !{null, !25, !25, !35, null}
!181 = !DISubprogram(name: "getpriority", scope: !182, file: !182, line: 93, type: !183, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!182 = !DIFile(filename: "/usr/include/sys/resource.h", directory: "")
!183 = !DISubroutineType(types: !184)
!184 = !{!25, !57, !7}
!185 = !DISubprogram(name: "setpriority", scope: !182, file: !182, line: 97, type: !186, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!186 = !DISubroutineType(types: !187)
!187 = !{!25, !57, !7, !25}
!188 = !DISubprogram(name: "execvp", scope: !189, file: !189, line: 578, type: !190, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!189 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!190 = !DISubroutineType(types: !191)
!191 = !{!25, !35, !154}
!192 = !{!0}
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !157, size: 1024, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 4)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "Version", scope: !198, file: !199, line: 2, type: !35, isLocal: false, isDefinition: true)
!198 = distinct !DICompileUnit(language: DW_LANG_C99, file: !199, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, globals: !200, splitDebugInlining: false, nameTableKind: None)
!199 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!200 = !{!196}
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "file_name", scope: !203, file: !204, line: 46, type: !35, isLocal: true, isDefinition: true)
!203 = distinct !DICompileUnit(language: DW_LANG_C99, file: !204, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, retainedTypes: !205, globals: !244, splitDebugInlining: false, nameTableKind: None)
!204 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!205 = !{!206, !64, !242, !177}
!206 = !DISubprogram(name: "close_stream", scope: !207, file: !207, line: 2, type: !208, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!207 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!208 = !DISubroutineType(types: !209)
!209 = !{!25, !210}
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !212)
!212 = !{!213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !211, file: !75, line: 51, baseType: !25, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !211, file: !75, line: 54, baseType: !27, size: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !211, file: !75, line: 55, baseType: !27, size: 64, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !211, file: !75, line: 56, baseType: !27, size: 64, offset: 192)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !211, file: !75, line: 57, baseType: !27, size: 64, offset: 256)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !211, file: !75, line: 58, baseType: !27, size: 64, offset: 320)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !211, file: !75, line: 59, baseType: !27, size: 64, offset: 384)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !211, file: !75, line: 60, baseType: !27, size: 64, offset: 448)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !211, file: !75, line: 61, baseType: !27, size: 64, offset: 512)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !211, file: !75, line: 64, baseType: !27, size: 64, offset: 576)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !211, file: !75, line: 65, baseType: !27, size: 64, offset: 640)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !211, file: !75, line: 66, baseType: !27, size: 64, offset: 704)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !211, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !211, file: !75, line: 70, baseType: !210, size: 64, offset: 832)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !211, file: !75, line: 72, baseType: !25, size: 32, offset: 896)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !211, file: !75, line: 73, baseType: !25, size: 32, offset: 928)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !211, file: !75, line: 74, baseType: !96, size: 64, offset: 960)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !211, file: !75, line: 77, baseType: !99, size: 16, offset: 1024)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !211, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !211, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !211, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !211, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !211, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !211, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !211, file: !75, line: 93, baseType: !210, size: 64, offset: 1344)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !211, file: !75, line: 94, baseType: !119, size: 64, offset: 1408)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !211, file: !75, line: 95, baseType: !121, size: 64, offset: 1472)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !211, file: !75, line: 96, baseType: !25, size: 32, offset: 1536)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !211, file: !75, line: 98, baseType: !126, size: 160, offset: 1568)
!242 = !DISubprogram(name: "quotearg_colon", scope: !243, file: !243, line: 391, type: !141, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!243 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!244 = !{!201, !245}
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !203, file: !204, line: 56, type: !38, isLocal: true, isDefinition: true)
!247 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression())
!248 = distinct !DIGlobalVariable(name: "exit_failure", scope: !249, file: !250, line: 24, type: !252, isLocal: false, isDefinition: true)
!249 = distinct !DICompileUnit(language: DW_LANG_C99, file: !250, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, globals: !251, splitDebugInlining: false, nameTableKind: None)
!250 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!251 = !{!247}
!252 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !25)
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(name: "program_name", scope: !255, file: !256, line: 33, type: !35, isLocal: false, isDefinition: true)
!255 = distinct !DICompileUnit(language: DW_LANG_C99, file: !256, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, retainedTypes: !257, globals: !293, splitDebugInlining: false, nameTableKind: None)
!256 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!257 = !{!119, !258, !27}
!258 = !DISubprogram(name: "fputs", scope: !70, file: !70, line: 626, type: !259, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!259 = !DISubroutineType(types: !260)
!260 = !{!25, !35, !261}
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !263)
!263 = !{!264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !262, file: !75, line: 51, baseType: !25, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !262, file: !75, line: 54, baseType: !27, size: 64, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !262, file: !75, line: 55, baseType: !27, size: 64, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !262, file: !75, line: 56, baseType: !27, size: 64, offset: 192)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !262, file: !75, line: 57, baseType: !27, size: 64, offset: 256)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !262, file: !75, line: 58, baseType: !27, size: 64, offset: 320)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !262, file: !75, line: 59, baseType: !27, size: 64, offset: 384)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !262, file: !75, line: 60, baseType: !27, size: 64, offset: 448)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !262, file: !75, line: 61, baseType: !27, size: 64, offset: 512)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !262, file: !75, line: 64, baseType: !27, size: 64, offset: 576)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !262, file: !75, line: 65, baseType: !27, size: 64, offset: 640)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !262, file: !75, line: 66, baseType: !27, size: 64, offset: 704)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !262, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !262, file: !75, line: 70, baseType: !261, size: 64, offset: 832)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !262, file: !75, line: 72, baseType: !25, size: 32, offset: 896)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !262, file: !75, line: 73, baseType: !25, size: 32, offset: 928)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !262, file: !75, line: 74, baseType: !96, size: 64, offset: 960)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !262, file: !75, line: 77, baseType: !99, size: 16, offset: 1024)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !262, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !262, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !262, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !262, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !262, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !262, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !262, file: !75, line: 93, baseType: !261, size: 64, offset: 1344)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !262, file: !75, line: 94, baseType: !119, size: 64, offset: 1408)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !262, file: !75, line: 95, baseType: !121, size: 64, offset: 1472)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !262, file: !75, line: 96, baseType: !25, size: 32, offset: 1536)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !262, file: !75, line: 98, baseType: !126, size: 160, offset: 1568)
!293 = !{!253}
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !296, file: !297, line: 85, type: !428, isLocal: false, isDefinition: true)
!296 = distinct !DICompileUnit(language: DW_LANG_C99, file: !297, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !298, retainedTypes: !332, globals: !401, splitDebugInlining: false, nameTableKind: None)
!297 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!298 = !{!299, !312, !317}
!299 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !243, line: 32, baseType: !7, size: 32, elements: !300)
!300 = !{!301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311}
!301 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!302 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!303 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!304 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!305 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!306 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!307 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!308 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!309 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!310 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!311 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!312 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !243, line: 242, baseType: !7, size: 32, elements: !313)
!313 = !{!314, !315, !316}
!314 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!315 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!316 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!317 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !318, line: 46, baseType: !7, size: 32, elements: !319)
!318 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!319 = !{!320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331}
!320 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!321 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!322 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!323 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!324 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!325 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!326 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!327 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!328 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!329 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!330 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!331 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!332 = !{!333, !339, !355, !358, !25, !99, !361, !121, !376, !380, !64, !386, !390, !27, !394, !397, !398}
!333 = !DISubprogram(name: "xmemdup", scope: !334, file: !334, line: 62, type: !335, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!334 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!335 = !DISubroutineType(types: !336)
!336 = !{!119, !337, !123}
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!339 = !DISubprogram(name: "quotearg_alloc_mem", scope: !243, file: !243, line: 342, type: !340, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!340 = !DISubroutineType(types: !341)
!341 = !{!27, !35, !123, !342, !343}
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !345)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !297, line: 65, size: 448, elements: !346)
!346 = !{!347, !348, !349, !353, !354}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !345, file: !297, line: 68, baseType: !299, size: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !345, file: !297, line: 71, baseType: !25, size: 32, offset: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !345, file: !297, line: 75, baseType: !350, size: 256, offset: 64)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !351)
!351 = !{!352}
!352 = !DISubrange(count: 8)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !345, file: !297, line: 78, baseType: !35, size: 64, offset: 320)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !345, file: !297, line: 81, baseType: !35, size: 64, offset: 384)
!355 = !DISubprogram(name: "free", scope: !144, file: !144, line: 565, type: !356, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!356 = !DISubroutineType(types: !357)
!357 = !{null, !119}
!358 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !243, file: !243, line: 408, type: !359, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!359 = !DISubroutineType(types: !360)
!360 = !{!27, !25, !35, !35, !35, !123}
!361 = !DISubprogram(name: "rpl_mbrtowc", scope: !362, file: !362, line: 717, type: !363, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!362 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!363 = !DISubroutineType(types: !364)
!364 = !{!123, !163, !35, !123, !365}
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !367, line: 13, size: 64, elements: !368)
!367 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!368 = !{!369, !370}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !366, file: !367, line: 15, baseType: !25, size: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !366, file: !367, line: 20, baseType: !371, size: 32, offset: 32)
!371 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !366, file: !367, line: 16, size: 32, elements: !372)
!372 = !{!373, !374}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !371, file: !367, line: 18, baseType: !7, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !371, file: !367, line: 19, baseType: !375, size: 32)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 32, elements: !194)
!376 = !DISubprogram(name: "iswprint", scope: !377, file: !377, line: 120, type: !378, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!377 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!378 = !DISubroutineType(types: !379)
!379 = !{!25, !7}
!380 = !DISubprogram(name: "mbsinit", scope: !381, file: !381, line: 292, type: !382, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!381 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!382 = !DISubroutineType(types: !383)
!383 = !{!25, !384}
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !366)
!386 = !DISubprogram(name: "locale_charset", scope: !387, file: !387, line: 35, type: !388, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!387 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!388 = !DISubroutineType(types: !389)
!389 = !{!35}
!390 = !DISubprogram(name: "c_strcasecmp", scope: !391, file: !391, line: 42, type: !392, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!391 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!392 = !DISubroutineType(types: !393)
!393 = !{!25, !35, !35}
!394 = !DISubprogram(name: "xmalloc", scope: !334, file: !334, line: 53, type: !395, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!395 = !DISubroutineType(types: !396)
!396 = !{!119, !123}
!397 = !DISubprogram(name: "xalloc_die", scope: !334, file: !334, line: 51, type: !148, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !68)
!398 = !DISubprogram(name: "xrealloc", scope: !334, file: !334, line: 59, type: !399, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!399 = !DISubroutineType(types: !400)
!400 = !{!119, !119, !123}
!401 = !{!294, !402, !408, !410, !412, !417, !424, !426}
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !296, file: !297, line: 101, type: !404, isLocal: false, isDefinition: true)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !405, size: 320, elements: !406)
!405 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !299)
!406 = !{!407}
!407 = !DISubrange(count: 10)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !296, file: !297, line: 1052, type: !345, isLocal: false, isDefinition: true)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !296, file: !297, line: 116, type: !345, isLocal: true, isDefinition: true)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(name: "slot0", scope: !296, file: !297, line: 842, type: !414, isLocal: true, isDefinition: true)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 2048, elements: !415)
!415 = !{!416}
!416 = !DISubrange(count: 256)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(name: "slotvec", scope: !296, file: !297, line: 845, type: !419, isLocal: true, isDefinition: true)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !297, line: 834, size: 128, elements: !421)
!421 = !{!422, !423}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !420, file: !297, line: 836, baseType: !121, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !420, file: !297, line: 837, baseType: !27, size: 64, offset: 64)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(name: "nslots", scope: !296, file: !297, line: 843, type: !25, isLocal: true, isDefinition: true)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(name: "slotvec0", scope: !296, file: !297, line: 844, type: !420, isLocal: true, isDefinition: true)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !429, size: 704, elements: !430)
!429 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!430 = !{!431}
!431 = !DISubrange(count: 11)
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !434, file: !435, line: 26, type: !437, isLocal: false, isDefinition: true)
!434 = distinct !DICompileUnit(language: DW_LANG_C99, file: !435, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, globals: !436, splitDebugInlining: false, nameTableKind: None)
!435 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!436 = !{!432}
!437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 376, elements: !438)
!438 = !{!439}
!439 = !DISubrange(count: 47)
!440 = distinct !DICompileUnit(language: DW_LANG_C99, file: !441, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !442, retainedTypes: !446, splitDebugInlining: false, nameTableKind: None)
!441 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!442 = !{!443}
!443 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !441, line: 40, baseType: !7, size: 32, elements: !444)
!444 = !{!445}
!445 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!446 = !{!64, !447, !119}
!447 = !DISubprogram(name: "fputs_unlocked", scope: !70, file: !70, line: 662, type: !448, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!448 = !DISubroutineType(types: !449)
!449 = !{!25, !35, !450}
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !452)
!452 = !{!453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !451, file: !75, line: 51, baseType: !25, size: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !451, file: !75, line: 54, baseType: !27, size: 64, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !451, file: !75, line: 55, baseType: !27, size: 64, offset: 128)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !451, file: !75, line: 56, baseType: !27, size: 64, offset: 192)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !451, file: !75, line: 57, baseType: !27, size: 64, offset: 256)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !451, file: !75, line: 58, baseType: !27, size: 64, offset: 320)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !451, file: !75, line: 59, baseType: !27, size: 64, offset: 384)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !451, file: !75, line: 60, baseType: !27, size: 64, offset: 448)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !451, file: !75, line: 61, baseType: !27, size: 64, offset: 512)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !451, file: !75, line: 64, baseType: !27, size: 64, offset: 576)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !451, file: !75, line: 65, baseType: !27, size: 64, offset: 640)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !451, file: !75, line: 66, baseType: !27, size: 64, offset: 704)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !451, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !451, file: !75, line: 70, baseType: !450, size: 64, offset: 832)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !451, file: !75, line: 72, baseType: !25, size: 32, offset: 896)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !451, file: !75, line: 73, baseType: !25, size: 32, offset: 928)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !451, file: !75, line: 74, baseType: !96, size: 64, offset: 960)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !451, file: !75, line: 77, baseType: !99, size: 16, offset: 1024)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !451, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !451, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !451, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !451, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !451, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !451, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !451, file: !75, line: 93, baseType: !450, size: 64, offset: 1344)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !451, file: !75, line: 94, baseType: !119, size: 64, offset: 1408)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !451, file: !75, line: 95, baseType: !121, size: 64, offset: 1472)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !451, file: !75, line: 96, baseType: !25, size: 32, offset: 1536)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !451, file: !75, line: 98, baseType: !126, size: 160, offset: 1568)
!482 = distinct !DICompileUnit(language: DW_LANG_C99, file: !483, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !484, retainedTypes: !497, splitDebugInlining: false, nameTableKind: None)
!483 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!484 = !{!485}
!485 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !486, file: !334, line: 186, baseType: !7, size: 32, elements: !495)
!486 = distinct !DISubprogram(name: "x2nrealloc", scope: !334, file: !334, line: 174, type: !487, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !482, retainedNodes: !490)
!487 = !DISubroutineType(types: !488)
!488 = !{!119, !119, !489, !121}
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!490 = !{!491, !492, !493, !494}
!491 = !DILocalVariable(name: "p", arg: 1, scope: !486, file: !334, line: 174, type: !119)
!492 = !DILocalVariable(name: "pn", arg: 2, scope: !486, file: !334, line: 174, type: !489)
!493 = !DILocalVariable(name: "s", arg: 3, scope: !486, file: !334, line: 174, type: !121)
!494 = !DILocalVariable(name: "n", scope: !486, file: !334, line: 176, type: !121)
!495 = !{!496}
!496 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!497 = !{!121, !397, !394, !398, !27, !355, !119, !498, !501}
!498 = !DISubprogram(name: "xcalloc", scope: !334, file: !334, line: 57, type: !499, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!499 = !DISubroutineType(types: !500)
!500 = !{!119, !123, !123}
!501 = !DISubprogram(name: "rpl_calloc", scope: !502, file: !502, line: 688, type: !499, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!502 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!503 = distinct !DICompileUnit(language: DW_LANG_C99, file: !504, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, retainedTypes: !505, splitDebugInlining: false, nameTableKind: None)
!504 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!505 = !{!64, !177}
!506 = distinct !DICompileUnit(language: DW_LANG_C99, file: !507, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !508, splitDebugInlining: false, nameTableKind: None)
!507 = !DIFile(filename: "lib/xstrtol.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!508 = !{!13}
!509 = distinct !DICompileUnit(language: DW_LANG_C99, file: !510, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, retainedTypes: !511, splitDebugInlining: false, nameTableKind: None)
!510 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!511 = !{!119}
!512 = distinct !DICompileUnit(language: DW_LANG_C99, file: !513, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, retainedTypes: !514, splitDebugInlining: false, nameTableKind: None)
!513 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!514 = !{!515, !121, !527}
!515 = !DISubprogram(name: "mbrtowc", scope: !381, file: !381, line: 296, type: !516, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!516 = !DISubroutineType(types: !517)
!517 = !{!123, !163, !35, !123, !518}
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !367, line: 13, size: 64, elements: !520)
!520 = !{!521, !522}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !519, file: !367, line: 15, baseType: !25, size: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !519, file: !367, line: 20, baseType: !523, size: 32, offset: 32)
!523 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !519, file: !367, line: 16, size: 32, elements: !524)
!524 = !{!525, !526}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !523, file: !367, line: 18, baseType: !7, size: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !523, file: !367, line: 19, baseType: !375, size: 32)
!527 = !DISubprogram(name: "hard_locale", scope: !528, file: !528, line: 26, type: !529, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!528 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!529 = !DISubroutineType(types: !530)
!530 = !{!38, !25}
!531 = distinct !DICompileUnit(language: DW_LANG_C99, file: !532, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, retainedTypes: !533, splitDebugInlining: false, nameTableKind: None)
!532 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!533 = !{!534}
!534 = !DISubprogram(name: "rpl_fclose", scope: !535, file: !535, line: 672, type: !536, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!535 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!536 = !DISubroutineType(types: !537)
!537 = !{!25, !538}
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !540)
!540 = !{!541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !539, file: !75, line: 51, baseType: !25, size: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !539, file: !75, line: 54, baseType: !27, size: 64, offset: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !539, file: !75, line: 55, baseType: !27, size: 64, offset: 128)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !539, file: !75, line: 56, baseType: !27, size: 64, offset: 192)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !539, file: !75, line: 57, baseType: !27, size: 64, offset: 256)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !539, file: !75, line: 58, baseType: !27, size: 64, offset: 320)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !539, file: !75, line: 59, baseType: !27, size: 64, offset: 384)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !539, file: !75, line: 60, baseType: !27, size: 64, offset: 448)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !539, file: !75, line: 61, baseType: !27, size: 64, offset: 512)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !539, file: !75, line: 64, baseType: !27, size: 64, offset: 576)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !539, file: !75, line: 65, baseType: !27, size: 64, offset: 640)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !539, file: !75, line: 66, baseType: !27, size: 64, offset: 704)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !539, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !539, file: !75, line: 70, baseType: !538, size: 64, offset: 832)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !539, file: !75, line: 72, baseType: !25, size: 32, offset: 896)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !539, file: !75, line: 73, baseType: !25, size: 32, offset: 928)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !539, file: !75, line: 74, baseType: !96, size: 64, offset: 960)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !539, file: !75, line: 77, baseType: !99, size: 16, offset: 1024)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !539, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !539, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !539, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !539, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !539, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !539, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !539, file: !75, line: 93, baseType: !538, size: 64, offset: 1344)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !539, file: !75, line: 94, baseType: !119, size: 64, offset: 1408)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !539, file: !75, line: 95, baseType: !121, size: 64, offset: 1472)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !539, file: !75, line: 96, baseType: !25, size: 32, offset: 1536)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !539, file: !75, line: 98, baseType: !126, size: 160, offset: 1568)
!570 = distinct !DICompileUnit(language: DW_LANG_C99, file: !571, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, retainedTypes: !572, splitDebugInlining: false, nameTableKind: None)
!571 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!572 = !{!573}
!573 = !DISubprogram(name: "setlocale_null_r", scope: !574, file: !574, line: 64, type: !575, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!574 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!575 = !DISubroutineType(types: !576)
!576 = !{!25, !25, !27, !123}
!577 = distinct !DICompileUnit(language: DW_LANG_C99, file: !578, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !579, retainedTypes: !966, splitDebugInlining: false, nameTableKind: None)
!578 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!579 = !{!580}
!580 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !581, line: 41, baseType: !7, size: 32, elements: !582)
!581 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!582 = !{!583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965}
!583 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!584 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!585 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!586 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!587 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!588 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!589 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!590 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!591 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!592 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!593 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!594 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!595 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!596 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!597 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!598 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!599 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!600 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!601 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!602 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!603 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!604 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!605 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!606 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!607 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!608 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!609 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!610 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!611 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!612 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!613 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!614 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!615 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!616 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!617 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!618 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!619 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!620 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!621 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!622 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!623 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!624 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!625 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!626 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!627 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!628 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!629 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!630 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!631 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!632 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!633 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!634 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!635 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!636 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!637 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!661 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!662 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!663 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!664 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!665 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!666 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!667 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!668 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!669 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!670 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!671 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!672 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!673 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!674 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!675 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!676 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!677 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!678 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!679 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!680 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!681 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!682 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!683 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!684 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!685 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!686 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!687 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!688 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!689 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!690 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!691 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!692 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!693 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!694 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!695 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!696 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!697 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!698 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!699 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!700 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!701 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!702 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!703 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!704 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!705 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!706 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!707 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!708 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!709 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!710 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!711 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!712 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!713 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!714 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!715 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!716 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!717 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!719 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!720 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!721 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!722 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!723 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!724 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!725 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!726 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!727 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!728 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!729 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!730 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!731 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!732 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!733 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!734 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!735 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!736 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!737 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!738 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!739 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!740 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!741 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!742 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!743 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!744 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!745 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!746 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!747 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!748 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!749 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!750 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!751 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!752 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!753 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!754 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!755 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!756 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!757 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!758 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!759 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!760 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!761 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!762 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!763 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!764 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!765 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!766 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!767 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!768 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!769 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!770 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!771 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!772 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!773 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!774 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!778 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!779 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!780 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!781 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!782 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!783 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!784 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!785 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!786 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!787 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!788 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!789 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!790 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!791 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!793 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!794 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!795 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!796 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!797 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!798 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!799 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!800 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!801 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!802 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!803 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!804 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!805 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!806 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!807 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!808 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!809 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!810 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!812 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!813 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!814 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!815 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!816 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!817 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!818 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!819 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!820 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!821 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!822 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!823 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!824 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!825 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!826 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!827 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!828 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!829 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!830 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!831 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!832 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!833 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!834 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!835 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!836 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!837 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!838 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!839 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!840 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!841 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!842 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!843 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!844 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!845 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!846 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!847 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!851 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!852 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!853 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!854 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!855 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!856 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!857 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!858 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!859 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!860 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!861 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!862 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!863 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!864 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!865 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!867 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!868 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!869 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!870 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!871 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!872 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!884 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!885 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!886 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!887 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!894 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!895 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!896 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!898 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!899 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!900 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!901 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!902 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!903 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!904 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!905 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!906 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!907 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!908 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!909 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!910 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!911 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!912 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!913 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!914 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!915 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!916 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!917 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!918 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!919 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!920 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!921 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!922 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!923 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!924 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!925 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!926 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!927 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!928 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!929 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!930 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!931 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!932 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!933 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!934 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!935 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!936 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!937 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!938 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!939 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!940 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!941 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!942 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!943 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!944 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!945 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!946 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!947 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!948 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!949 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!950 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!951 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!952 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!953 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!954 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!955 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!956 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!957 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!958 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!959 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!960 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!961 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!962 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!963 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!964 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!965 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!966 = !{!967, !119}
!967 = !DISubprogram(name: "nl_langinfo", scope: !581, file: !581, line: 661, type: !968, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!968 = !DISubroutineType(types: !969)
!969 = !{!27, !25}
!970 = distinct !DICompileUnit(language: DW_LANG_C99, file: !971, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, retainedTypes: !972, splitDebugInlining: false, nameTableKind: None)
!971 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!972 = !{!119, !133}
!973 = distinct !DICompileUnit(language: DW_LANG_C99, file: !974, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, retainedTypes: !975, splitDebugInlining: false, nameTableKind: None)
!974 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!975 = !{!976, !1011, !1012, !1015}
!976 = !DISubprogram(name: "fileno", scope: !70, file: !70, line: 786, type: !977, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!977 = !DISubroutineType(types: !978)
!978 = !{!25, !979}
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !981)
!981 = !{!982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !980, file: !75, line: 51, baseType: !25, size: 32)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !980, file: !75, line: 54, baseType: !27, size: 64, offset: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !980, file: !75, line: 55, baseType: !27, size: 64, offset: 128)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !980, file: !75, line: 56, baseType: !27, size: 64, offset: 192)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !980, file: !75, line: 57, baseType: !27, size: 64, offset: 256)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !980, file: !75, line: 58, baseType: !27, size: 64, offset: 320)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !980, file: !75, line: 59, baseType: !27, size: 64, offset: 384)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !980, file: !75, line: 60, baseType: !27, size: 64, offset: 448)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !980, file: !75, line: 61, baseType: !27, size: 64, offset: 512)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !980, file: !75, line: 64, baseType: !27, size: 64, offset: 576)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !980, file: !75, line: 65, baseType: !27, size: 64, offset: 640)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !980, file: !75, line: 66, baseType: !27, size: 64, offset: 704)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !980, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !980, file: !75, line: 70, baseType: !979, size: 64, offset: 832)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !980, file: !75, line: 72, baseType: !25, size: 32, offset: 896)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !980, file: !75, line: 73, baseType: !25, size: 32, offset: 928)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !980, file: !75, line: 74, baseType: !96, size: 64, offset: 960)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !980, file: !75, line: 77, baseType: !99, size: 16, offset: 1024)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !980, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !980, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !980, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !980, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !980, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !980, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !980, file: !75, line: 93, baseType: !979, size: 64, offset: 1344)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !980, file: !75, line: 94, baseType: !119, size: 64, offset: 1408)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !980, file: !75, line: 95, baseType: !121, size: 64, offset: 1472)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !980, file: !75, line: 96, baseType: !25, size: 32, offset: 1536)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !980, file: !75, line: 98, baseType: !126, size: 160, offset: 1568)
!1011 = !DISubprogram(name: "fclose", scope: !70, file: !70, line: 213, type: !977, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!1012 = !DISubprogram(name: "lseek", scope: !189, file: !189, line: 334, type: !1013, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!52, !25, !52, !25}
!1015 = !DISubprogram(name: "rpl_fflush", scope: !535, file: !535, line: 718, type: !977, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!1016 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1017, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, retainedTypes: !1018, splitDebugInlining: false, nameTableKind: None)
!1017 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1018 = !{!119, !1019, !1054}
!1019 = !DISubprogram(name: "fflush", scope: !70, file: !70, line: 218, type: !1020, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!25, !1022}
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !1024)
!1024 = !{!1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1023, file: !75, line: 51, baseType: !25, size: 32)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1023, file: !75, line: 54, baseType: !27, size: 64, offset: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1023, file: !75, line: 55, baseType: !27, size: 64, offset: 128)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1023, file: !75, line: 56, baseType: !27, size: 64, offset: 192)
