; ModuleID = 'coreutils-8.32/src/nl.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.re_pattern_buffer = type { %struct.re_dfa_t*, i64, i64, i64, i8*, i8*, i64, i8 }
%struct.re_dfa_t = type { %struct.re_token_t*, i64, i64, i64*, i64*, %struct.re_node_set*, %struct.re_node_set*, %struct.re_node_set*, %struct.re_state_table_entry*, %struct.re_dfastate_t*, %struct.re_dfastate_t*, %struct.re_dfastate_t*, %struct.re_dfastate_t*, %struct.bin_tree_t*, %struct.bin_tree_storage_t*, i64*, i32, i64, i64, i64, i64, i64, i8, i32, [4 x i64], i64, i64* }
%struct.re_token_t = type { %union.anon.35, i24 }
%union.anon.35 = type { i64* }
%struct.re_node_set = type { i64, i64, i64* }
%struct.re_state_table_entry = type { i64, i64, %struct.re_dfastate_t** }
%struct.re_dfastate_t = type { i64, %struct.re_node_set, %struct.re_node_set, %struct.re_node_set, %struct.re_node_set*, %struct.re_dfastate_t**, %struct.re_dfastate_t**, i8 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 147, type: !284, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !35, globals: !235, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/nl.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !20, !29}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!9 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 45, baseType: !7, size: 32, elements: !22)
!21 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!22 = !{!23, !24, !25, !26, !27, !28}
!23 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0, isUnsigned: true)
!24 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2, isUnsigned: true)
!25 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5, isUnsigned: true)
!26 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4, isUnsigned: true)
!27 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3, isUnsigned: true)
!28 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "section", file: !3, line: 61, baseType: !7, size: 32, elements: !30)
!30 = !{!31, !32, !33, !34}
!31 = !DIEnumerator(name: "Header", value: 0, isUnsigned: true)
!32 = !DIEnumerator(name: "Body", value: 1, isUnsigned: true)
!33 = !DIEnumerator(name: "Footer", value: 2, isUnsigned: true)
!34 = !DIEnumerator(name: "Text", value: 3, isUnsigned: true)
!35 = !{!36, !46, !107, !111, !115, !118, !121, !128, !143, !147, !151, !40, !97, !155, !159, !163, !173, !101, !177, !204, !207, !210, !213, !195, !216, !99, !42, !230}
!36 = !DISubprogram(name: "dcgettext", scope: !37, file: !37, line: 51, type: !38, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!37 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!38 = !DISubroutineType(types: !39)
!39 = !{!40, !42, !42, !44}
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!44 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!45 = !{}
!46 = !DISubprogram(name: "fputs_unlocked", scope: !47, file: !47, line: 662, type: !48, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!47 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!48 = !DISubroutineType(types: !49)
!49 = !{!44, !42, !50}
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !52, line: 49, size: 1728, elements: !53)
!52 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!53 = !{!54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !69, !70, !71, !72, !76, !78, !80, !84, !87, !89, !92, !95, !96, !98, !102, !103}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !51, file: !52, line: 51, baseType: !44, size: 32)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !51, file: !52, line: 54, baseType: !40, size: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !51, file: !52, line: 55, baseType: !40, size: 64, offset: 128)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !51, file: !52, line: 56, baseType: !40, size: 64, offset: 192)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !51, file: !52, line: 57, baseType: !40, size: 64, offset: 256)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !51, file: !52, line: 58, baseType: !40, size: 64, offset: 320)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !51, file: !52, line: 59, baseType: !40, size: 64, offset: 384)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !51, file: !52, line: 60, baseType: !40, size: 64, offset: 448)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !51, file: !52, line: 61, baseType: !40, size: 64, offset: 512)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !51, file: !52, line: 64, baseType: !40, size: 64, offset: 576)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !51, file: !52, line: 65, baseType: !40, size: 64, offset: 640)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !51, file: !52, line: 66, baseType: !40, size: 64, offset: 704)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !51, file: !52, line: 68, baseType: !67, size: 64, offset: 768)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !52, line: 36, flags: DIFlagFwdDecl)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !51, file: !52, line: 70, baseType: !50, size: 64, offset: 832)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !51, file: !52, line: 72, baseType: !44, size: 32, offset: 896)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !51, file: !52, line: 73, baseType: !44, size: 32, offset: 928)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !51, file: !52, line: 74, baseType: !73, size: 64, offset: 960)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !74, line: 152, baseType: !75)
!74 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!75 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !51, file: !52, line: 77, baseType: !77, size: 16, offset: 1024)
!77 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !51, file: !52, line: 78, baseType: !79, size: 8, offset: 1040)
!79 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !51, file: !52, line: 79, baseType: !81, size: 8, offset: 1048)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 8, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 1)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !51, file: !52, line: 81, baseType: !85, size: 64, offset: 1088)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !52, line: 43, baseType: null)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !51, file: !52, line: 89, baseType: !88, size: 64, offset: 1152)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !74, line: 153, baseType: !75)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !51, file: !52, line: 91, baseType: !90, size: 64, offset: 1216)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !52, line: 37, flags: DIFlagFwdDecl)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !51, file: !52, line: 92, baseType: !93, size: 64, offset: 1280)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !52, line: 38, flags: DIFlagFwdDecl)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !51, file: !52, line: 93, baseType: !50, size: 64, offset: 1344)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !51, file: !52, line: 94, baseType: !97, size: 64, offset: 1408)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !51, file: !52, line: 95, baseType: !99, size: 64, offset: 1472)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !100, line: 46, baseType: !101)
!100 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!101 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !51, file: !52, line: 96, baseType: !44, size: 32, offset: 1536)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !51, file: !52, line: 98, baseType: !104, size: 160, offset: 1568)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 160, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 20)
!107 = !DISubprogram(name: "set_program_name", scope: !108, file: !108, line: 37, type: !109, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!108 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!109 = !DISubroutineType(types: !110)
!110 = !{null, !42}
!111 = !DISubprogram(name: "setlocale", scope: !112, file: !112, line: 122, type: !113, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!112 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!113 = !DISubroutineType(types: !114)
!114 = !{!40, !44, !42}
!115 = !DISubprogram(name: "bindtextdomain", scope: !37, file: !37, line: 86, type: !116, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!116 = !DISubroutineType(types: !117)
!117 = !{!40, !42, !42}
!118 = !DISubprogram(name: "textdomain", scope: !37, file: !37, line: 82, type: !119, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!119 = !DISubroutineType(types: !120)
!120 = !{!40, !42}
!121 = !DISubprogram(name: "atexit", scope: !122, file: !122, line: 595, type: !123, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!122 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!123 = !DISubroutineType(types: !124)
!124 = !{!44, !125}
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{null}
!128 = !DISubprogram(name: "getopt_long", scope: !129, file: !129, line: 66, type: !130, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!129 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!130 = !DISubroutineType(types: !131)
!131 = !{!44, !44, !132, !42, !134, !141}
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !136)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !129, line: 50, size: 256, elements: !137)
!137 = !{!138, !139, !140, !142}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !136, file: !129, line: 52, baseType: !42, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !136, file: !129, line: 55, baseType: !44, size: 32, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !136, file: !129, line: 56, baseType: !141, size: 64, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !136, file: !129, line: 57, baseType: !44, size: 32, offset: 192)
!143 = !DISubprogram(name: "quote", scope: !144, file: !144, line: 44, type: !145, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!144 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!145 = !DISubroutineType(types: !146)
!146 = !{!42, !42}
!147 = !DISubprogram(name: "error", scope: !148, file: !148, line: 52, type: !149, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!148 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!149 = !DISubroutineType(types: !150)
!150 = !{null, !44, !44, !42, null}
!151 = !DISubprogram(name: "xdectoimax", scope: !152, file: !152, line: 30, type: !153, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!152 = !DIFile(filename: "./lib/xdectoint.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!153 = !DISubroutineType(types: !154)
!154 = !{!75, !42, !75, !75, !42, !42, !44}
!155 = !DISubprogram(name: "version_etc", scope: !156, file: !156, line: 69, type: !157, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!156 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!157 = !DISubroutineType(types: !158)
!158 = !{null, !50, !42, !42, !42, null}
!159 = !DISubprogram(name: "xmalloc", scope: !160, file: !160, line: 53, type: !161, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!160 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!161 = !DISubroutineType(types: !162)
!162 = !{!97, !101}
!163 = !DISubprogram(name: "initbuffer", scope: !164, file: !164, line: 34, type: !165, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!164 = !DIFile(filename: "./lib/linebuffer.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!165 = !DISubroutineType(types: !166)
!166 = !{null, !167}
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "linebuffer", file: !164, line: 26, size: 192, elements: !169)
!169 = !{!170, !171, !172}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !168, file: !164, line: 28, baseType: !99, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !168, file: !164, line: 29, baseType: !99, size: 64, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !168, file: !164, line: 30, baseType: !40, size: 64, offset: 128)
!173 = !DISubprogram(name: "rpl_fclose", scope: !174, file: !174, line: 672, type: !175, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!174 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!175 = !DISubroutineType(types: !176)
!176 = !{!44, !50}
!177 = !DISubprogram(name: "rpl_re_compile_pattern", scope: !178, file: !178, line: 538, type: !179, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!178 = !DIFile(filename: "./lib/regex.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!179 = !DISubroutineType(types: !180)
!180 = !{!42, !42, !101, !181}
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_pattern_buffer", file: !178, line: 413, size: 512, elements: !183)
!183 = !{!184, !187, !189, !190, !192, !193, !196, !197, !198, !199, !200, !201, !202, !203}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !182, file: !178, line: 417, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "re_dfa_t", file: !178, line: 417, flags: DIFlagFwdDecl)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !182, file: !178, line: 420, baseType: !188, size: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "__re_long_size_t", file: !178, line: 49, baseType: !99)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !182, file: !178, line: 423, baseType: !188, size: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "syntax", scope: !182, file: !178, line: 426, baseType: !191, size: 64, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_syntax_t", file: !178, line: 72, baseType: !101)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap", scope: !182, file: !178, line: 431, baseType: !40, size: 64, offset: 256)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "translate", scope: !182, file: !178, line: 437, baseType: !194, size: 64, offset: 320)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "re_nsub", scope: !182, file: !178, line: 440, baseType: !99, size: 64, offset: 384)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_null", scope: !182, file: !178, line: 446, baseType: !7, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "regs_allocated", scope: !182, file: !178, line: 457, baseType: !7, size: 2, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap_accurate", scope: !182, file: !178, line: 461, baseType: !7, size: 1, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "no_sub", scope: !182, file: !178, line: 465, baseType: !7, size: 1, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "not_bol", scope: !182, file: !178, line: 469, baseType: !7, size: 1, offset: 453, flags: DIFlagBitField, extraData: i64 448)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "not_eol", scope: !182, file: !178, line: 472, baseType: !7, size: 1, offset: 454, flags: DIFlagBitField, extraData: i64 448)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "newline_anchor", scope: !182, file: !178, line: 475, baseType: !7, size: 1, offset: 455, flags: DIFlagBitField, extraData: i64 448)
!204 = !DISubprogram(name: "quotearg_n_style_colon", scope: !6, file: !6, line: 397, type: !205, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!205 = !DISubroutineType(types: !206)
!206 = !{!40, !44, !5, !42}
!207 = !DISubprogram(name: "fadvise", scope: !21, file: !21, line: 72, type: !208, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!208 = !DISubroutineType(types: !209)
!209 = !{null, !50, !20}
!210 = !DISubprogram(name: "clearerr_unlocked", scope: !47, file: !47, line: 765, type: !211, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!211 = !DISubroutineType(types: !212)
!212 = !{null, !50}
!213 = !DISubprogram(name: "readlinebuffer", scope: !164, file: !164, line: 48, type: !214, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!214 = !DISubroutineType(types: !215)
!215 = !{!167, !167, !50}
!216 = !DISubprogram(name: "rpl_re_search", scope: !178, file: !178, line: 553, type: !217, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!217 = !DISubroutineType(types: !218)
!218 = !{!75, !181, !42, !75, !75, !75, !219}
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_registers", file: !178, line: 497, size: 192, elements: !221)
!221 = !{!222, !224, !229}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "num_regs", scope: !220, file: !178, line: 499, baseType: !223, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "__re_size_t", file: !178, line: 45, baseType: !99)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !220, file: !178, line: 500, baseType: !225, size: 64, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "regoff_t", file: !178, line: 486, baseType: !227)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !47, line: 77, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !74, line: 193, baseType: !75)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !220, file: !178, line: 501, baseType: !225, size: 64, offset: 128)
!230 = !DISubprogram(name: "fwrite_unlocked", scope: !47, file: !47, line: 675, type: !231, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!231 = !DISubroutineType(types: !232)
!232 = !{!101, !233, !101, !101, !50}
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!235 = !{!236, !238, !240, !242, !244, !249, !251, !253, !255, !257, !259, !261, !266, !267, !272, !274, !276, !278, !280, !282, !285, !287, !289, !291, !296, !298, !303, !305, !307, !312, !314, !316, !318, !320, !322}
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(name: "current_type", scope: !2, file: !3, line: 76, type: !42, isLocal: true, isDefinition: true)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(name: "body_regex", scope: !2, file: !3, line: 79, type: !182, isLocal: true, isDefinition: true)
!240 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!241 = distinct !DIGlobalVariable(name: "header_regex", scope: !2, file: !3, line: 82, type: !182, isLocal: true, isDefinition: true)
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(name: "footer_regex", scope: !2, file: !3, line: 85, type: !182, isLocal: true, isDefinition: true)
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(name: "body_fastmap", scope: !2, file: !3, line: 88, type: !246, isLocal: true, isDefinition: true)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 2048, elements: !247)
!247 = !{!248}
!248 = !DISubrange(count: 256)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(name: "header_fastmap", scope: !2, file: !3, line: 89, type: !246, isLocal: true, isDefinition: true)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(name: "footer_fastmap", scope: !2, file: !3, line: 90, type: !246, isLocal: true, isDefinition: true)
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(name: "header_del_len", scope: !2, file: !3, line: 105, type: !99, isLocal: true, isDefinition: true)
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "body_del_len", scope: !2, file: !3, line: 111, type: !99, isLocal: true, isDefinition: true)
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "footer_del_len", scope: !2, file: !3, line: 117, type: !99, isLocal: true, isDefinition: true)
!259 = !DIGlobalVariableExpression(var: !260, expr: !DIExpression())
!260 = distinct !DIGlobalVariable(name: "line_buf", scope: !2, file: !3, line: 120, type: !168, isLocal: true, isDefinition: true)
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(name: "line_no", scope: !2, file: !3, line: 144, type: !263, isLocal: true, isDefinition: true)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !264, line: 101, baseType: !265)
!264 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !74, line: 72, baseType: !75)
!266 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!267 = !DIGlobalVariableExpression(var: !268, expr: !DIExpression())
!268 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 149, type: !269, isLocal: true, isDefinition: true)
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 3584, elements: !270)
!270 = !{!271}
!271 = !DISubrange(count: 14)
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(name: "header_type", scope: !2, file: !3, line: 70, type: !42, isLocal: true, isDefinition: true)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(name: "body_type", scope: !2, file: !3, line: 67, type: !42, isLocal: true, isDefinition: true)
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(name: "footer_type", scope: !2, file: !3, line: 73, type: !42, isLocal: true, isDefinition: true)
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(name: "starting_line_number", scope: !2, file: !3, line: 126, type: !263, isLocal: true, isDefinition: true)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "page_incr", scope: !2, file: !3, line: 129, type: !263, isLocal: true, isDefinition: true)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "reset_numbers", scope: !2, file: !3, line: 132, type: !284, isLocal: true, isDefinition: true)
!284 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(name: "blank_join", scope: !2, file: !3, line: 135, type: !263, isLocal: true, isDefinition: true)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(name: "separator_str", scope: !2, file: !3, line: 96, type: !42, isLocal: true, isDefinition: true)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(name: "lineno_width", scope: !2, file: !3, line: 138, type: !44, isLocal: true, isDefinition: true)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "FORMAT_LEFT", scope: !2, file: !3, line: 54, type: !293, isLocal: true, isDefinition: true)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 64, elements: !294)
!294 = !{!295}
!295 = !DISubrange(count: 8)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "lineno_format", scope: !2, file: !3, line: 141, type: !42, isLocal: true, isDefinition: true)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "FORMAT_RIGHT_NOLZ", scope: !2, file: !3, line: 48, type: !300, isLocal: true, isDefinition: true)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 56, elements: !301)
!301 = !{!302}
!302 = !DISubrange(count: 7)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "FORMAT_RIGHT_LZ", scope: !2, file: !3, line: 51, type: !293, isLocal: true, isDefinition: true)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(name: "section_del", scope: !2, file: !3, line: 99, type: !42, isLocal: true, isDefinition: true)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(name: "DEFAULT_SECTION_DELIMITERS", scope: !2, file: !3, line: 57, type: !309, isLocal: true, isDefinition: true)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 24, elements: !310)
!310 = !{!311}
!311 = !DISubrange(count: 3)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(name: "header_del", scope: !2, file: !3, line: 102, type: !40, isLocal: true, isDefinition: true)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "body_del", scope: !2, file: !3, line: 108, type: !40, isLocal: true, isDefinition: true)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "footer_del", scope: !2, file: !3, line: 114, type: !40, isLocal: true, isDefinition: true)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "print_no_line_fmt", scope: !2, file: !3, line: 123, type: !40, isLocal: true, isDefinition: true)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "current_regex", scope: !2, file: !3, line: 93, type: !181, isLocal: true, isDefinition: true)
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(name: "blank_lines", scope: !324, file: !3, line: 325, type: !263, isLocal: true, isDefinition: true)
!324 = distinct !DISubprogram(name: "proc_text", scope: !3, file: !3, line: 323, type: !126, scopeLine: 324, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !325)
!325 = !{!326, !328, !332}
!326 = !DILocalVariable(name: "__ptr", scope: !327, file: !3, line: 368, type: !42)
!327 = distinct !DILexicalBlock(scope: !324, file: !3, line: 368, column: 3)
!328 = !DILocalVariable(name: "__stream", scope: !327, file: !3, line: 368, type: !329)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !331, line: 7, baseType: !51)
!331 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "")
!332 = !DILocalVariable(name: "__cnt", scope: !327, file: !3, line: 368, type: !99)
!333 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "Version", scope: !336, file: !337, line: 2, type: !42, isLocal: false, isDefinition: true)
!336 = distinct !DICompileUnit(language: DW_LANG_C99, file: !337, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !45, globals: !338, splitDebugInlining: false, nameTableKind: None)
!337 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!338 = !{!334}
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "file_name", scope: !341, file: !342, line: 46, type: !42, isLocal: true, isDefinition: true)
!341 = distinct !DICompileUnit(language: DW_LANG_C99, file: !342, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !45, retainedTypes: !343, globals: !381, splitDebugInlining: false, nameTableKind: None)
!342 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!343 = !{!344, !36, !380, !147}
!344 = !DISubprogram(name: "close_stream", scope: !345, file: !345, line: 2, type: !346, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!345 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!346 = !DISubroutineType(types: !347)
!347 = !{!44, !348}
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !52, line: 49, size: 1728, elements: !350)
!350 = !{!351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !349, file: !52, line: 51, baseType: !44, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !349, file: !52, line: 54, baseType: !40, size: 64, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !349, file: !52, line: 55, baseType: !40, size: 64, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !349, file: !52, line: 56, baseType: !40, size: 64, offset: 192)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !349, file: !52, line: 57, baseType: !40, size: 64, offset: 256)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !349, file: !52, line: 58, baseType: !40, size: 64, offset: 320)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !349, file: !52, line: 59, baseType: !40, size: 64, offset: 384)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !349, file: !52, line: 60, baseType: !40, size: 64, offset: 448)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !349, file: !52, line: 61, baseType: !40, size: 64, offset: 512)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !349, file: !52, line: 64, baseType: !40, size: 64, offset: 576)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !349, file: !52, line: 65, baseType: !40, size: 64, offset: 640)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !349, file: !52, line: 66, baseType: !40, size: 64, offset: 704)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !349, file: !52, line: 68, baseType: !67, size: 64, offset: 768)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !349, file: !52, line: 70, baseType: !348, size: 64, offset: 832)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !349, file: !52, line: 72, baseType: !44, size: 32, offset: 896)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !349, file: !52, line: 73, baseType: !44, size: 32, offset: 928)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !349, file: !52, line: 74, baseType: !73, size: 64, offset: 960)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !349, file: !52, line: 77, baseType: !77, size: 16, offset: 1024)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !349, file: !52, line: 78, baseType: !79, size: 8, offset: 1040)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !349, file: !52, line: 79, baseType: !81, size: 8, offset: 1048)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !349, file: !52, line: 81, baseType: !85, size: 64, offset: 1088)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !349, file: !52, line: 89, baseType: !88, size: 64, offset: 1152)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !349, file: !52, line: 91, baseType: !90, size: 64, offset: 1216)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !349, file: !52, line: 92, baseType: !93, size: 64, offset: 1280)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !349, file: !52, line: 93, baseType: !348, size: 64, offset: 1344)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !349, file: !52, line: 94, baseType: !97, size: 64, offset: 1408)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !349, file: !52, line: 95, baseType: !99, size: 64, offset: 1472)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !349, file: !52, line: 96, baseType: !44, size: 32, offset: 1536)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !349, file: !52, line: 98, baseType: !104, size: 160, offset: 1568)
!380 = !DISubprogram(name: "quotearg_colon", scope: !6, file: !6, line: 391, type: !119, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!381 = !{!339, !382}
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !341, file: !342, line: 56, type: !284, isLocal: true, isDefinition: true)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(name: "exit_failure", scope: !386, file: !387, line: 24, type: !389, isLocal: false, isDefinition: true)
!386 = distinct !DICompileUnit(language: DW_LANG_C99, file: !387, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !45, globals: !388, splitDebugInlining: false, nameTableKind: None)
!387 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!388 = !{!384}
!389 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !44)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(name: "program_name", scope: !392, file: !393, line: 33, type: !42, isLocal: false, isDefinition: true)
!392 = distinct !DICompileUnit(language: DW_LANG_C99, file: !393, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !45, retainedTypes: !394, globals: !430, splitDebugInlining: false, nameTableKind: None)
!393 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!394 = !{!97, !395, !40}
!395 = !DISubprogram(name: "fputs", scope: !47, file: !47, line: 626, type: !396, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!396 = !DISubroutineType(types: !397)
!397 = !{!44, !42, !398}
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !52, line: 49, size: 1728, elements: !400)
!400 = !{!401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !399, file: !52, line: 51, baseType: !44, size: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !399, file: !52, line: 54, baseType: !40, size: 64, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !399, file: !52, line: 55, baseType: !40, size: 64, offset: 128)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !399, file: !52, line: 56, baseType: !40, size: 64, offset: 192)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !399, file: !52, line: 57, baseType: !40, size: 64, offset: 256)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !399, file: !52, line: 58, baseType: !40, size: 64, offset: 320)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !399, file: !52, line: 59, baseType: !40, size: 64, offset: 384)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !399, file: !52, line: 60, baseType: !40, size: 64, offset: 448)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !399, file: !52, line: 61, baseType: !40, size: 64, offset: 512)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !399, file: !52, line: 64, baseType: !40, size: 64, offset: 576)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !399, file: !52, line: 65, baseType: !40, size: 64, offset: 640)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !399, file: !52, line: 66, baseType: !40, size: 64, offset: 704)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !399, file: !52, line: 68, baseType: !67, size: 64, offset: 768)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !399, file: !52, line: 70, baseType: !398, size: 64, offset: 832)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !399, file: !52, line: 72, baseType: !44, size: 32, offset: 896)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !399, file: !52, line: 73, baseType: !44, size: 32, offset: 928)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !399, file: !52, line: 74, baseType: !73, size: 64, offset: 960)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !399, file: !52, line: 77, baseType: !77, size: 16, offset: 1024)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !399, file: !52, line: 78, baseType: !79, size: 8, offset: 1040)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !399, file: !52, line: 79, baseType: !81, size: 8, offset: 1048)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !399, file: !52, line: 81, baseType: !85, size: 64, offset: 1088)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !399, file: !52, line: 89, baseType: !88, size: 64, offset: 1152)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !399, file: !52, line: 91, baseType: !90, size: 64, offset: 1216)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !399, file: !52, line: 92, baseType: !93, size: 64, offset: 1280)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !399, file: !52, line: 93, baseType: !398, size: 64, offset: 1344)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !399, file: !52, line: 94, baseType: !97, size: 64, offset: 1408)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !399, file: !52, line: 95, baseType: !99, size: 64, offset: 1472)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !399, file: !52, line: 96, baseType: !44, size: 32, offset: 1536)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !399, file: !52, line: 98, baseType: !104, size: 160, offset: 1568)
!430 = !{!390}
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !433, file: !434, line: 85, type: !543, isLocal: false, isDefinition: true)
!433 = distinct !DICompileUnit(language: DW_LANG_C99, file: !434, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !435, retainedTypes: !456, globals: !519, splitDebugInlining: false, nameTableKind: None)
!434 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!435 = !{!5, !436, !441}
!436 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, baseType: !7, size: 32, elements: !437)
!437 = !{!438, !439, !440}
!438 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!439 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!440 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!441 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !442, line: 46, baseType: !7, size: 32, elements: !443)
!442 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!443 = !{!444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455}
!444 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!445 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!446 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!447 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!448 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!449 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!450 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!451 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!452 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!453 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!454 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!455 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!456 = !{!457, !460, !474, !477, !44, !77, !480, !99, !497, !501, !36, !507, !511, !40, !159, !515, !516}
!457 = !DISubprogram(name: "xmemdup", scope: !160, file: !160, line: 62, type: !458, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!458 = !DISubroutineType(types: !459)
!459 = !{!97, !233, !101}
!460 = !DISubprogram(name: "quotearg_alloc_mem", scope: !6, file: !6, line: 342, type: !461, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!461 = !DISubroutineType(types: !462)
!462 = !{!40, !42, !101, !463, !464}
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !466)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !434, line: 65, size: 448, elements: !467)
!467 = !{!468, !469, !470, !472, !473}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !466, file: !434, line: 68, baseType: !5, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !466, file: !434, line: 71, baseType: !44, size: 32, offset: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !466, file: !434, line: 75, baseType: !471, size: 256, offset: 64)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !294)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !466, file: !434, line: 78, baseType: !42, size: 64, offset: 320)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !466, file: !434, line: 81, baseType: !42, size: 64, offset: 384)
!474 = !DISubprogram(name: "free", scope: !122, file: !122, line: 565, type: !475, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!475 = !DISubroutineType(types: !476)
!476 = !{null, !97}
!477 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !6, file: !6, line: 408, type: !478, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!478 = !DISubroutineType(types: !479)
!479 = !{!40, !44, !42, !42, !42, !101}
!480 = !DISubprogram(name: "rpl_mbrtowc", scope: !481, file: !481, line: 717, type: !482, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!481 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!482 = !DISubroutineType(types: !483)
!483 = !{!101, !141, !42, !101, !484}
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !486, line: 13, size: 64, elements: !487)
!486 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!487 = !{!488, !489}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !485, file: !486, line: 15, baseType: !44, size: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !485, file: !486, line: 20, baseType: !490, size: 32, offset: 32)
!490 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !485, file: !486, line: 16, size: 32, elements: !491)
!491 = !{!492, !493}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !490, file: !486, line: 18, baseType: !7, size: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !490, file: !486, line: 19, baseType: !494, size: 32)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 32, elements: !495)
!495 = !{!496}
!496 = !DISubrange(count: 4)
!497 = !DISubprogram(name: "iswprint", scope: !498, file: !498, line: 120, type: !499, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!498 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!499 = !DISubroutineType(types: !500)
!500 = !{!44, !7}
!501 = !DISubprogram(name: "mbsinit", scope: !502, file: !502, line: 292, type: !503, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!502 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!503 = !DISubroutineType(types: !504)
!504 = !{!44, !505}
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !485)
!507 = !DISubprogram(name: "locale_charset", scope: !508, file: !508, line: 35, type: !509, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!508 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!509 = !DISubroutineType(types: !510)
!510 = !{!42}
!511 = !DISubprogram(name: "c_strcasecmp", scope: !512, file: !512, line: 42, type: !513, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!512 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!513 = !DISubroutineType(types: !514)
!514 = !{!44, !42, !42}
!515 = !DISubprogram(name: "xalloc_die", scope: !160, file: !160, line: 51, type: !126, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !45)
!516 = !DISubprogram(name: "xrealloc", scope: !160, file: !160, line: 59, type: !517, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!517 = !DISubroutineType(types: !518)
!518 = !{!97, !97, !101}
!519 = !{!431, !520, !526, !528, !530, !532, !539, !541}
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !433, file: !434, line: 101, type: !522, isLocal: false, isDefinition: true)
!522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !523, size: 320, elements: !524)
!523 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!524 = !{!525}
!525 = !DISubrange(count: 10)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !433, file: !434, line: 1052, type: !466, isLocal: false, isDefinition: true)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !433, file: !434, line: 116, type: !466, isLocal: true, isDefinition: true)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(name: "slot0", scope: !433, file: !434, line: 842, type: !246, isLocal: true, isDefinition: true)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(name: "slotvec", scope: !433, file: !434, line: 845, type: !534, isLocal: true, isDefinition: true)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !434, line: 834, size: 128, elements: !536)
!536 = !{!537, !538}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !535, file: !434, line: 836, baseType: !99, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !535, file: !434, line: 837, baseType: !40, size: 64, offset: 64)
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(name: "nslots", scope: !433, file: !434, line: 843, type: !44, isLocal: true, isDefinition: true)
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(name: "slotvec0", scope: !433, file: !434, line: 844, type: !535, isLocal: true, isDefinition: true)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !544, size: 704, elements: !545)
!544 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!545 = !{!546}
!546 = !DISubrange(count: 11)
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !549, file: !550, line: 26, type: !552, isLocal: false, isDefinition: true)
!549 = distinct !DICompileUnit(language: DW_LANG_C99, file: !550, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !45, globals: !551, splitDebugInlining: false, nameTableKind: None)
!550 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!551 = !{!547}
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 376, elements: !553)
!553 = !{!554}
!554 = !DISubrange(count: 47)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(name: "rpl_re_syntax_options", scope: !557, file: !1321, line: 243, type: !191, isLocal: false, isDefinition: true)
!557 = distinct !DICompileUnit(language: DW_LANG_C99, file: !558, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !559, retainedTypes: !1022, globals: !1318, splitDebugInlining: false, nameTableKind: None)
!558 = !DIFile(filename: "lib/regex.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!559 = !{!560, !573, !609, !629, !441, !1015}
!560 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !561, line: 206, baseType: !7, size: 32, elements: !562)
!561 = !DIFile(filename: "./lib/regex_internal.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!562 = !{!563, !564, !565, !566, !567, !568, !569, !570, !571, !572}
!563 = !DIEnumerator(name: "INSIDE_WORD", value: 5, isUnsigned: true)
!564 = !DIEnumerator(name: "WORD_FIRST", value: 6, isUnsigned: true)
!565 = !DIEnumerator(name: "WORD_LAST", value: 9, isUnsigned: true)
!566 = !DIEnumerator(name: "INSIDE_NOTWORD", value: 10, isUnsigned: true)
!567 = !DIEnumerator(name: "LINE_FIRST", value: 16, isUnsigned: true)
!568 = !DIEnumerator(name: "LINE_LAST", value: 32, isUnsigned: true)
!569 = !DIEnumerator(name: "BUF_FIRST", value: 64, isUnsigned: true)
!570 = !DIEnumerator(name: "BUF_LAST", value: 128, isUnsigned: true)
!571 = !DIEnumerator(name: "WORD_DELIM", value: 256, isUnsigned: true)
!572 = !DIEnumerator(name: "NOT_WORD_DELIM", value: 512, isUnsigned: true)
!573 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !561, line: 227, baseType: !7, size: 32, elements: !574)
!574 = !{!575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608}
!575 = !DIEnumerator(name: "NON_TYPE", value: 0, isUnsigned: true)
!576 = !DIEnumerator(name: "CHARACTER", value: 1, isUnsigned: true)
!577 = !DIEnumerator(name: "END_OF_RE", value: 2, isUnsigned: true)
!578 = !DIEnumerator(name: "SIMPLE_BRACKET", value: 3, isUnsigned: true)
!579 = !DIEnumerator(name: "OP_BACK_REF", value: 4, isUnsigned: true)
!580 = !DIEnumerator(name: "OP_PERIOD", value: 5, isUnsigned: true)
!581 = !DIEnumerator(name: "COMPLEX_BRACKET", value: 6, isUnsigned: true)
!582 = !DIEnumerator(name: "OP_UTF8_PERIOD", value: 7, isUnsigned: true)
!583 = !DIEnumerator(name: "OP_OPEN_SUBEXP", value: 8, isUnsigned: true)
!584 = !DIEnumerator(name: "OP_CLOSE_SUBEXP", value: 9, isUnsigned: true)
!585 = !DIEnumerator(name: "OP_ALT", value: 10, isUnsigned: true)
!586 = !DIEnumerator(name: "OP_DUP_ASTERISK", value: 11, isUnsigned: true)
!587 = !DIEnumerator(name: "ANCHOR", value: 12, isUnsigned: true)
!588 = !DIEnumerator(name: "CONCAT", value: 16, isUnsigned: true)
!589 = !DIEnumerator(name: "SUBEXP", value: 17, isUnsigned: true)
!590 = !DIEnumerator(name: "OP_DUP_PLUS", value: 18, isUnsigned: true)
!591 = !DIEnumerator(name: "OP_DUP_QUESTION", value: 19, isUnsigned: true)
!592 = !DIEnumerator(name: "OP_OPEN_BRACKET", value: 20, isUnsigned: true)
!593 = !DIEnumerator(name: "OP_CLOSE_BRACKET", value: 21, isUnsigned: true)
!594 = !DIEnumerator(name: "OP_CHARSET_RANGE", value: 22, isUnsigned: true)
!595 = !DIEnumerator(name: "OP_OPEN_DUP_NUM", value: 23, isUnsigned: true)
!596 = !DIEnumerator(name: "OP_CLOSE_DUP_NUM", value: 24, isUnsigned: true)
!597 = !DIEnumerator(name: "OP_NON_MATCH_LIST", value: 25, isUnsigned: true)
!598 = !DIEnumerator(name: "OP_OPEN_COLL_ELEM", value: 26, isUnsigned: true)
!599 = !DIEnumerator(name: "OP_CLOSE_COLL_ELEM", value: 27, isUnsigned: true)
!600 = !DIEnumerator(name: "OP_OPEN_EQUIV_CLASS", value: 28, isUnsigned: true)
!601 = !DIEnumerator(name: "OP_CLOSE_EQUIV_CLASS", value: 29, isUnsigned: true)
!602 = !DIEnumerator(name: "OP_OPEN_CHAR_CLASS", value: 30, isUnsigned: true)
!603 = !DIEnumerator(name: "OP_CLOSE_CHAR_CLASS", value: 31, isUnsigned: true)
!604 = !DIEnumerator(name: "OP_WORD", value: 32, isUnsigned: true)
!605 = !DIEnumerator(name: "OP_NOTWORD", value: 33, isUnsigned: true)
!606 = !DIEnumerator(name: "OP_SPACE", value: 34, isUnsigned: true)
!607 = !DIEnumerator(name: "OP_NOTSPACE", value: 35, isUnsigned: true)
!608 = !DIEnumerator(name: "BACK_SLASH", value: 36, isUnsigned: true)
!609 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !178, line: 346, baseType: !44, size: 32, elements: !610)
!610 = !{!611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628}
!611 = !DIEnumerator(name: "_REG_ENOSYS", value: -1)
!612 = !DIEnumerator(name: "_REG_NOERROR", value: 0)
!613 = !DIEnumerator(name: "_REG_NOMATCH", value: 1)
!614 = !DIEnumerator(name: "_REG_BADPAT", value: 2)
!615 = !DIEnumerator(name: "_REG_ECOLLATE", value: 3)
!616 = !DIEnumerator(name: "_REG_ECTYPE", value: 4)
!617 = !DIEnumerator(name: "_REG_EESCAPE", value: 5)
!618 = !DIEnumerator(name: "_REG_ESUBREG", value: 6)
!619 = !DIEnumerator(name: "_REG_EBRACK", value: 7)
!620 = !DIEnumerator(name: "_REG_EPAREN", value: 8)
!621 = !DIEnumerator(name: "_REG_EBRACE", value: 9)
!622 = !DIEnumerator(name: "_REG_BADBR", value: 10)
!623 = !DIEnumerator(name: "_REG_ERANGE", value: 11)
!624 = !DIEnumerator(name: "_REG_ESPACE", value: 12)
!625 = !DIEnumerator(name: "_REG_BADRPT", value: 13)
!626 = !DIEnumerator(name: "_REG_EEND", value: 14)
!627 = !DIEnumerator(name: "_REG_ESIZE", value: 15)
!628 = !DIEnumerator(name: "_REG_ERPAREN", value: 16)
!629 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !630, line: 41, baseType: !7, size: 32, elements: !631)
!630 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!631 = !{!632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014}
!632 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!633 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!634 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!635 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!636 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!637 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!638 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!639 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!640 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!641 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!642 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!643 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!644 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!645 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!646 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!647 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!648 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!649 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!650 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!651 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!652 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!653 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!654 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!655 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!656 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!657 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!658 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!659 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!660 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!661 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!662 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!663 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!664 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!665 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!666 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!667 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!668 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!669 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!670 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!671 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!672 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!673 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!674 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!675 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!676 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!677 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!678 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!679 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!680 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!681 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!682 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!683 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!684 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!685 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!686 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!687 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!688 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!689 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!690 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!691 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!692 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!693 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!694 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!695 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!696 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!697 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!698 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!699 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!700 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!701 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!702 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!703 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!704 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!705 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!706 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!707 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!708 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!709 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!710 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!711 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!712 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!713 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!714 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!715 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!716 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!717 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!719 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!720 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!721 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!722 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!723 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!724 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!725 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!726 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!727 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!728 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!729 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!730 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!731 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!732 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!733 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!734 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!735 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!736 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!737 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!738 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!739 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!740 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!741 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!742 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!743 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!744 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!745 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!746 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!747 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!748 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!749 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!750 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!751 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!752 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!753 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!754 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!755 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!756 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!757 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!758 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!759 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!760 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!761 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!762 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!763 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!764 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!765 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!766 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!767 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!768 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!769 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!770 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!771 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!772 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!773 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!774 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!779 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!780 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!781 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!782 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!783 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!784 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!785 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!786 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!787 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!788 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!789 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!790 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!791 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!793 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!794 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!795 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!796 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!797 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!798 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!799 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!800 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!801 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!802 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!803 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!804 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!805 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!806 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!807 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!808 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!809 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!810 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!812 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!813 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!814 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!815 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!816 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!817 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!818 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!819 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!820 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!821 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!822 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!823 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!824 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!825 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!826 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!827 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!828 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!829 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!830 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!831 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!832 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!833 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!834 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!835 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!836 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!837 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!838 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!839 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!840 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!841 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!842 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!843 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!844 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!845 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!846 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!847 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!884 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!885 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!886 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!887 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!894 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!895 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!896 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!898 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!899 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!900 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!901 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!902 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!903 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!904 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!905 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!906 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!907 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!908 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!909 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!910 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!911 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!912 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!913 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!914 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!915 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!916 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!917 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!918 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!919 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!920 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!921 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!922 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!923 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!924 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!925 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!926 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!927 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!928 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!929 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!930 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!931 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!932 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!933 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!934 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!935 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!936 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!937 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!938 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!939 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!940 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!941 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!942 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!943 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!944 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!945 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!946 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!947 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!948 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!949 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!950 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!951 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!952 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!953 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!954 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!955 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!956 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!957 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!958 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!959 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!960 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!961 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!962 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!963 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!964 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!965 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!966 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!967 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!968 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!969 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!970 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!971 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!972 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!973 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!974 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!975 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!976 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!977 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!978 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!979 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!980 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!981 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!982 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!983 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!984 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!985 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!986 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!987 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!988 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!989 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!990 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!991 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!992 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!993 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!994 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!995 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!996 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!997 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!998 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!999 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!1000 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!1001 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!1002 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!1003 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!1004 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!1005 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!1006 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!1007 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!1008 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!1009 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!1010 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!1011 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!1012 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!1013 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!1014 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!1015 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !561, line: 699, baseType: !7, size: 32, elements: !1016)
!1016 = !{!1017, !1018, !1019, !1020, !1021}
!1017 = !DIEnumerator(name: "SB_CHAR", value: 0, isUnsigned: true)
!1018 = !DIEnumerator(name: "MB_CHAR", value: 1, isUnsigned: true)
!1019 = !DIEnumerator(name: "EQUIV_CLASS", value: 2, isUnsigned: true)
!1020 = !DIEnumerator(name: "COLL_SYM", value: 3, isUnsigned: true)
!1021 = !DIEnumerator(name: "CHAR_CLASS", value: 4, isUnsigned: true)
!1022 = !{!101, !44, !36, !40, !97, !474, !42, !1023, !1035, !99, !1038, !194, !1039, !1044, !1177, !1181, !1053, !1184, !1186, !1092, !1189, !1062, !1194, !1195, !77, !1187, !1149, !1056, !1061, !1066, !1196, !1199, !1095, !1200, !1112, !1111, !1219, !1225, !195, !223, !1226, !1235, !1261, !1253, !1264, !1311}
!1023 = !DISubprogram(name: "rpl_mbrtowc", scope: !481, file: !481, line: 717, type: !1024, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!101, !141, !42, !101, !1026}
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !486, line: 13, size: 64, elements: !1028)
!1028 = !{!1029, !1030}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1027, file: !486, line: 15, baseType: !44, size: 32)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1027, file: !486, line: 20, baseType: !1031, size: 32, offset: 32)
!1031 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1027, file: !486, line: 16, size: 32, elements: !1032)
!1032 = !{!1033, !1034}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1031, file: !486, line: 18, baseType: !7, size: 32)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1031, file: !486, line: 19, baseType: !494, size: 32)
!1035 = !DISubprogram(name: "towlower", scope: !498, file: !498, line: 166, type: !1036, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!7, !7}
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitset_word_t", file: !561, line: 182, baseType: !101)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "re_dfa_t", file: !561, line: 416, baseType: !1041)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_dfa_t", file: !561, line: 645, size: 1856, elements: !1042)
!1042 = !{!1043, !1089, !1090, !1091, !1093, !1094, !1102, !1103, !1104, !1131, !1132, !1133, !1134, !1135, !1148, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1175, !1176}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !1041, file: !561, line: 647, baseType: !1044, size: 64)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64)
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "re_token_t", file: !561, line: 353, baseType: !1046)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !561, line: 326, size: 128, elements: !1047)
!1047 = !{!1048, !1081, !1083, !1084, !1085, !1086, !1087, !1088}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "opr", scope: !1046, file: !561, line: 337, baseType: !1049, size: 64)
!1049 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1046, file: !561, line: 328, size: 64, elements: !1050)
!1050 = !{!1051, !1052, !1055, !1078, !1079}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !1049, file: !561, line: 330, baseType: !195, size: 8)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "sbcset", scope: !1049, file: !561, line: 331, baseType: !1053, size: 64)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "re_bitset_ptr_t", file: !561, line: 192, baseType: !1054)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "mbcset", scope: !1049, file: !561, line: 333, baseType: !1056, size: 64)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64)
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "re_charset_t", file: !561, line: 323, baseType: !1058)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !561, line: 279, size: 640, elements: !1059)
!1059 = !{!1060, !1063, !1064, !1065, !1068, !1069, !1074, !1075, !1076, !1077}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "mbchars", scope: !1058, file: !561, line: 282, baseType: !1061, size: 64)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !100, line: 74, baseType: !44)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "range_starts", scope: !1058, file: !561, line: 299, baseType: !1061, size: 64, offset: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "range_ends", scope: !1058, file: !561, line: 300, baseType: !1061, size: 64, offset: 128)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "char_classes", scope: !1058, file: !561, line: 304, baseType: !1066, size: 64, offset: 192)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = !DIDerivedType(tag: DW_TAG_typedef, name: "wctype_t", file: !498, line: 38, baseType: !101)
