source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.re_pattern_buffer = type { %struct.re_dfa_t*, i64, i64, i64, i8*, i8*, i64, i8 }
%struct.re_dfa_t = type opaque
%struct.linebuffer = type { i64, i64, i8* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.re_registers = type { i32, i32*, i32* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [FILE]...\0A\00", align 1
@.str.2 = private unnamed_addr constant [62 x i8] c"Write each FILE to standard output, with line numbers added.\0A\00", align 1
@stdout = external local_unnamed_addr global %struct._IO_FILE*, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 147, type: !134, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !35, globals: !41)
!3 = !DIFile(filename: "src/nl.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!4 = !{!5, !20, !29}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!9 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 45, baseType: !7, size: 32, elements: !22)
!21 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!22 = !{!23, !24, !25, !26, !27, !28}
!23 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0, isUnsigned: true)
!24 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2, isUnsigned: true)
!25 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5, isUnsigned: true)
!26 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4, isUnsigned: true)
!27 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3, isUnsigned: true)
!28 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "section", file: !3, line: 61, baseType: !7, size: 32, elements: !30)
!30 = !{!31, !32, !33, !34}
!31 = !DIEnumerator(name: "Header", value: 0, isUnsigned: true)
!32 = !DIEnumerator(name: "Body", value: 1, isUnsigned: true)
!33 = !DIEnumerator(name: "Footer", value: 2, isUnsigned: true)
!34 = !DIEnumerator(name: "Text", value: 3, isUnsigned: true)
!35 = !{!36, !38, !39, !40}
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!39 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!40 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!41 = !{!42, !46, !72, !74, !76, !81, !83, !85, !87, !89, !91, !99, !106, !107, !122, !124, !126, !128, !130, !132, !135, !137, !139, !141, !146, !148, !153, !155, !157, !162, !164, !166, !168, !170, !173}
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(name: "current_type", scope: !2, file: !3, line: 76, type: !44, isLocal: true, isDefinition: true)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "body_regex", scope: !2, file: !3, line: 79, type: !48, isLocal: true, isDefinition: true)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_pattern_buffer", file: !49, line: 414, size: 512, elements: !50)
!49 = !DIFile(filename: "./lib/regex.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!50 = !{!51, !54, !56, !57, !59, !60, !62, !65, !66, !67, !68, !69, !70, !71}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !48, file: !49, line: 418, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "re_dfa_t", file: !49, line: 418, flags: DIFlagFwdDecl)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !48, file: !49, line: 421, baseType: !55, size: 64, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "__re_long_size_t", file: !49, line: 57, baseType: !39)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !48, file: !49, line: 424, baseType: !55, size: 64, offset: 128)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "syntax", scope: !48, file: !49, line: 427, baseType: !58, size: 64, offset: 192)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_syntax_t", file: !49, line: 73, baseType: !39)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap", scope: !48, file: !49, line: 432, baseType: !36, size: 64, offset: 256)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "translate", scope: !48, file: !49, line: 438, baseType: !61, size: 64, offset: 320)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "re_nsub", scope: !48, file: !49, line: 441, baseType: !63, size: 64, offset: 384)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !64, line: 62, baseType: !39)
!64 = !DIFile(filename: "/usr/lib/clang/7.0.0/include/stddef.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!65 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_null", scope: !48, file: !49, line: 447, baseType: !7, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "regs_allocated", scope: !48, file: !49, line: 458, baseType: !7, size: 2, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap_accurate", scope: !48, file: !49, line: 462, baseType: !7, size: 1, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "no_sub", scope: !48, file: !49, line: 466, baseType: !7, size: 1, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "not_bol", scope: !48, file: !49, line: 470, baseType: !7, size: 1, offset: 453, flags: DIFlagBitField, extraData: i64 448)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "not_eol", scope: !48, file: !49, line: 473, baseType: !7, size: 1, offset: 454, flags: DIFlagBitField, extraData: i64 448)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "newline_anchor", scope: !48, file: !49, line: 476, baseType: !7, size: 1, offset: 455, flags: DIFlagBitField, extraData: i64 448)
!72 = !DIGlobalVariableExpression(var: !73, expr: !DIExpression())
!73 = distinct !DIGlobalVariable(name: "header_regex", scope: !2, file: !3, line: 82, type: !48, isLocal: true, isDefinition: true)
!74 = !DIGlobalVariableExpression(var: !75, expr: !DIExpression())
!75 = distinct !DIGlobalVariable(name: "footer_regex", scope: !2, file: !3, line: 85, type: !48, isLocal: true, isDefinition: true)
!76 = !DIGlobalVariableExpression(var: !77, expr: !DIExpression())
!77 = distinct !DIGlobalVariable(name: "body_fastmap", scope: !2, file: !3, line: 88, type: !78, isLocal: true, isDefinition: true)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 2048, elements: !79)
!79 = !{!80}
!80 = !DISubrange(count: 256)
!81 = !DIGlobalVariableExpression(var: !82, expr: !DIExpression())
!82 = distinct !DIGlobalVariable(name: "header_fastmap", scope: !2, file: !3, line: 89, type: !78, isLocal: true, isDefinition: true)
!83 = !DIGlobalVariableExpression(var: !84, expr: !DIExpression())
!84 = distinct !DIGlobalVariable(name: "footer_fastmap", scope: !2, file: !3, line: 90, type: !78, isLocal: true, isDefinition: true)
!85 = !DIGlobalVariableExpression(var: !86, expr: !DIExpression())
!86 = distinct !DIGlobalVariable(name: "header_del_len", scope: !2, file: !3, line: 105, type: !63, isLocal: true, isDefinition: true)
!87 = !DIGlobalVariableExpression(var: !88, expr: !DIExpression())
!88 = distinct !DIGlobalVariable(name: "body_del_len", scope: !2, file: !3, line: 111, type: !63, isLocal: true, isDefinition: true)
!89 = !DIGlobalVariableExpression(var: !90, expr: !DIExpression())
!90 = distinct !DIGlobalVariable(name: "footer_del_len", scope: !2, file: !3, line: 117, type: !63, isLocal: true, isDefinition: true)
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "line_buf", scope: !2, file: !3, line: 120, type: !93, isLocal: true, isDefinition: true)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "linebuffer", file: !94, line: 26, size: 192, elements: !95)
!94 = !DIFile(filename: "./lib/linebuffer.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!95 = !{!96, !97, !98}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !93, file: !94, line: 28, baseType: !63, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !93, file: !94, line: 29, baseType: !63, size: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !93, file: !94, line: 30, baseType: !36, size: 64, offset: 128)
!99 = !DIGlobalVariableExpression(var: !100, expr: !DIExpression())
!100 = distinct !DIGlobalVariable(name: "line_no", scope: !2, file: !3, line: 144, type: !101, isLocal: true, isDefinition: true)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !102, line: 101, baseType: !103)
!102 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !104, line: 71, baseType: !105)
!104 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!105 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!106 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!107 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression())
!108 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 149, type: !109, isLocal: true, isDefinition: true)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 3584, elements: !120)
!110 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !111)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !112, line: 50, size: 256, elements: !113)
!112 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!113 = !{!114, !115, !117, !119}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !111, file: !112, line: 52, baseType: !44, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !111, file: !112, line: 55, baseType: !116, size: 32, offset: 64)
!116 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !111, file: !112, line: 56, baseType: !118, size: 64, offset: 128)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !111, file: !112, line: 57, baseType: !116, size: 32, offset: 192)
!120 = !{!121}
!121 = !DISubrange(count: 14)
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(name: "header_type", scope: !2, file: !3, line: 70, type: !44, isLocal: true, isDefinition: true)
!124 = !DIGlobalVariableExpression(var: !125, expr: !DIExpression())
!125 = distinct !DIGlobalVariable(name: "body_type", scope: !2, file: !3, line: 67, type: !44, isLocal: true, isDefinition: true)
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(name: "footer_type", scope: !2, file: !3, line: 73, type: !44, isLocal: true, isDefinition: true)
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(name: "starting_line_number", scope: !2, file: !3, line: 126, type: !101, isLocal: true, isDefinition: true)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(name: "page_incr", scope: !2, file: !3, line: 129, type: !101, isLocal: true, isDefinition: true)
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(name: "reset_numbers", scope: !2, file: !3, line: 132, type: !134, isLocal: true, isDefinition: true)
!134 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!135 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression())
!136 = distinct !DIGlobalVariable(name: "blank_join", scope: !2, file: !3, line: 135, type: !101, isLocal: true, isDefinition: true)
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(name: "separator_str", scope: !2, file: !3, line: 96, type: !44, isLocal: true, isDefinition: true)
!139 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression())
!140 = distinct !DIGlobalVariable(name: "lineno_width", scope: !2, file: !3, line: 138, type: !116, isLocal: true, isDefinition: true)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(name: "FORMAT_LEFT", scope: !2, file: !3, line: 54, type: !143, isLocal: true, isDefinition: true)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 64, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: 8)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(name: "lineno_format", scope: !2, file: !3, line: 141, type: !44, isLocal: true, isDefinition: true)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(name: "FORMAT_RIGHT_NOLZ", scope: !2, file: !3, line: 48, type: !150, isLocal: true, isDefinition: true)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 56, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 7)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "FORMAT_RIGHT_LZ", scope: !2, file: !3, line: 51, type: !143, isLocal: true, isDefinition: true)
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(name: "section_del", scope: !2, file: !3, line: 99, type: !44, isLocal: true, isDefinition: true)
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!158 = distinct !DIGlobalVariable(name: "DEFAULT_SECTION_DELIMITERS", scope: !2, file: !3, line: 57, type: !159, isLocal: true, isDefinition: true)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 24, elements: !160)
!160 = !{!161}
!161 = !DISubrange(count: 3)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(name: "header_del", scope: !2, file: !3, line: 102, type: !36, isLocal: true, isDefinition: true)
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(name: "body_del", scope: !2, file: !3, line: 108, type: !36, isLocal: true, isDefinition: true)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "footer_del", scope: !2, file: !3, line: 114, type: !36, isLocal: true, isDefinition: true)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "print_no_line_fmt", scope: !2, file: !3, line: 123, type: !36, isLocal: true, isDefinition: true)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "current_regex", scope: !2, file: !3, line: 93, type: !172, isLocal: true, isDefinition: true)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(name: "blank_lines", scope: !175, file: !3, line: 329, type: !101, isLocal: true, isDefinition: true)
!175 = distinct !DISubprogram(name: "proc_text", scope: !3, file: !3, line: 327, type: !176, isLocal: true, isDefinition: true, scopeLine: 328, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !178)
!176 = !DISubroutineType(types: !177)
!177 = !{null}
!178 = !{}
!179 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(name: "Version", scope: !182, file: !183, line: 2, type: !44, isDefinition: true)
!182 = distinct !DICompileUnit(language: DW_LANG_C99, file: !183, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !178, globals: !184)
!183 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!184 = !{!180}
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "file_name", scope: !187, file: !192, line: 46, type: !44, isLocal: true, isDefinition: true)
!187 = distinct !DICompileUnit(language: DW_LANG_C99, file: !188, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !178, globals: !189)
!188 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!189 = !{!185, !190}
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !187, file: !192, line: 56, type: !134, isLocal: true, isDefinition: true)
!192 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(name: "exit_failure", scope: !195, file: !198, line: 24, type: !199, isDefinition: true)
!195 = distinct !DICompileUnit(language: DW_LANG_C99, file: !196, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !178, globals: !197)
!196 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!197 = !{!193}
!198 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!199 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !116)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(name: "program_name", scope: !202, file: !206, line: 33, type: !44, isDefinition: true)
!202 = distinct !DICompileUnit(language: DW_LANG_C99, file: !203, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !178, retainedTypes: !204, globals: !205)
!203 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!204 = !{!38, !36}
!205 = !{!200}
!206 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !209, file: !237, line: 85, type: !267, isDefinition: true)
!209 = distinct !DICompileUnit(language: DW_LANG_C99, file: !210, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !211, retainedTypes: !232, globals: !234)
!210 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!211 = !{!5, !212, !217}
!212 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, baseType: !7, size: 32, elements: !213)
!213 = !{!214, !215, !216}
!214 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!215 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!216 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!217 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !218, line: 46, baseType: !7, size: 32, elements: !219)
!218 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!219 = !{!220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231}
!220 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!221 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!222 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!223 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!224 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!225 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!226 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!227 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!228 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!229 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!230 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!231 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!232 = !{!116, !233, !63, !36}
!233 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!234 = !{!207, !235, !242, !252, !254, !256, !263, !265}
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !209, file: !237, line: 101, type: !238, isDefinition: true)
!237 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 320, elements: !240)
!239 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!240 = !{!241}
!241 = !DISubrange(count: 10)
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !209, file: !237, line: 1052, type: !244, isDefinition: true)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !237, line: 65, size: 448, elements: !245)
!245 = !{!246, !247, !248, !250, !251}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !244, file: !237, line: 68, baseType: !5, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !244, file: !237, line: 71, baseType: !116, size: 32, offset: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !244, file: !237, line: 75, baseType: !249, size: 256, offset: 64)
!249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !144)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !244, file: !237, line: 78, baseType: !44, size: 64, offset: 320)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !244, file: !237, line: 81, baseType: !44, size: 64, offset: 384)
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !209, file: !237, line: 116, type: !244, isLocal: true, isDefinition: true)
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(name: "slot0", scope: !209, file: !237, line: 842, type: !78, isLocal: true, isDefinition: true)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(name: "slotvec", scope: !209, file: !237, line: 845, type: !258, isLocal: true, isDefinition: true)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !237, line: 834, size: 128, elements: !260)
!260 = !{!261, !262}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !259, file: !237, line: 836, baseType: !63, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !259, file: !237, line: 837, baseType: !36, size: 64, offset: 64)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(name: "nslots", scope: !209, file: !237, line: 843, type: !116, isLocal: true, isDefinition: true)
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(name: "slotvec0", scope: !209, file: !237, line: 844, type: !259, isLocal: true, isDefinition: true)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !268, size: 704, elements: !269)
!268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!269 = !{!270}
!270 = !DISubrange(count: 11)
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !273, file: !276, line: 26, type: !277, isDefinition: true)
!273 = distinct !DICompileUnit(language: DW_LANG_C99, file: !274, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !178, globals: !275)
!274 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!275 = !{!271}
!276 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 376, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 47)
!280 = distinct !DICompileUnit(language: DW_LANG_C99, file: !281, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !282)
!281 = !DIFile(filename: "./lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!282 = !{!20}
!283 = distinct !DICompileUnit(language: DW_LANG_C99, file: !284, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !178, retainedTypes: !285)
!284 = !DIFile(filename: "./lib/linebuffer.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!285 = !{!61}
!286 = distinct !DICompileUnit(language: DW_LANG_C99, file: !287, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !288, retainedTypes: !293)
!287 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!288 = !{!289}
!289 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !290, line: 41, baseType: !7, size: 32, elements: !291)
!290 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!291 = !{!292}
!292 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2018, isUnsigned: true)
!293 = !{!38}
!294 = distinct !DICompileUnit(language: DW_LANG_C99, file: !295, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !296, retainedTypes: !310)
!295 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!296 = !{!297}
!297 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !299, file: !298, line: 186, baseType: !7, size: 32, elements: !308)
!298 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!299 = distinct !DISubprogram(name: "x2nrealloc", scope: !298, file: !298, line: 174, type: !300, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: true, unit: !294, retainedNodes: !303)
!300 = !DISubroutineType(types: !301)
!301 = !{!38, !38, !302, !63}
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!303 = !{!304, !305, !306, !307}
!304 = !DILocalVariable(name: "p", arg: 1, scope: !299, file: !298, line: 174, type: !38)
!305 = !DILocalVariable(name: "pn", arg: 2, scope: !299, file: !298, line: 174, type: !302)
!306 = !DILocalVariable(name: "s", arg: 3, scope: !299, file: !298, line: 174, type: !63)
!307 = !DILocalVariable(name: "n", scope: !299, file: !298, line: 176, type: !63)
!308 = !{!309}
!309 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!310 = !{!63, !36, !38}
!311 = distinct !DICompileUnit(language: DW_LANG_C99, file: !312, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !178)
!312 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!313 = distinct !DICompileUnit(language: DW_LANG_C99, file: !314, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !315)
!314 = !DIFile(filename: "./lib/xdectoimax.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!315 = !{!316}
!316 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !317, line: 26, baseType: !7, size: 32, elements: !318)
!317 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!318 = !{!319, !320, !321, !322, !323}
!319 = !DIEnumerator(name: "LONGINT_OK", value: 0, isUnsigned: true)
!320 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1, isUnsigned: true)
!321 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2, isUnsigned: true)
!322 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3, isUnsigned: true)
!323 = !DIEnumerator(name: "LONGINT_INVALID", value: 4, isUnsigned: true)
!324 = distinct !DICompileUnit(language: DW_LANG_C99, file: !325, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !315)
!325 = !DIFile(filename: "./lib/xstrtoimax.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!326 = distinct !DICompileUnit(language: DW_LANG_C99, file: !327, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !178, retainedTypes: !293)
!327 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!328 = distinct !DICompileUnit(language: DW_LANG_C99, file: !329, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !178)
!329 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!330 = distinct !DICompileUnit(language: DW_LANG_C99, file: !331, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !178, retainedTypes: !293)
!331 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!332 = distinct !DICompileUnit(language: DW_LANG_C99, file: !333, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !178, retainedTypes: !293)
!333 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!334 = distinct !DICompileUnit(language: DW_LANG_C99, file: !335, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !178, retainedTypes: !336)
!335 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!336 = !{!63}
!337 = distinct !DICompileUnit(language: DW_LANG_C99, file: !338, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !178)
!338 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!339 = distinct !DICompileUnit(language: DW_LANG_C99, file: !340, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !178)
!340 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!341 = distinct !DICompileUnit(language: DW_LANG_C99, file: !342, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !343, retainedTypes: !293)
!342 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!343 = !{!344}
!344 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !345, line: 41, baseType: !7, size: 32, elements: !346)
!345 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!346 = !{!347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729}
!347 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!348 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!349 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!350 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!351 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!352 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!353 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!354 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!355 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!356 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!357 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!358 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!359 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!360 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!361 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!362 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!363 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!364 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!365 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!366 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!367 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!368 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!369 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!370 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!371 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!372 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!373 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!374 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!375 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!376 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!377 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!378 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!379 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!380 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!381 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!382 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!383 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!384 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!385 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!386 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!387 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!388 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!389 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!390 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!391 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!392 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!393 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!394 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!395 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!396 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!397 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!398 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!399 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!400 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!401 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!402 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!403 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!404 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!405 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!406 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!407 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!408 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!409 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!410 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!411 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!412 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!413 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!414 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!415 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!416 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!417 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!418 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!419 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!420 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!421 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!422 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!423 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!424 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!425 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!426 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!427 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!428 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!429 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!430 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!431 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!432 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!433 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!434 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!435 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!436 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!437 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!438 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!439 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!440 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!441 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!442 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!443 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!444 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!445 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!446 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!447 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!448 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!449 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!450 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!451 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!452 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!453 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!454 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!455 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!456 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!457 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!458 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!459 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!460 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!461 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!462 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!463 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!464 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!465 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!466 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!467 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!468 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!469 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!470 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!471 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!472 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!473 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!474 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!475 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!476 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!477 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!478 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!479 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!480 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!481 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!482 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!483 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!484 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!485 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!486 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!487 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!488 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!489 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!490 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!491 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!492 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!493 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!494 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!495 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!496 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!497 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!498 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!499 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!500 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!501 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!502 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!503 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!504 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!505 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!506 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!507 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!508 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!509 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!510 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!511 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!512 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!513 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!514 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!515 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!516 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!517 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!518 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!519 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!520 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!521 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!522 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!523 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!524 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!525 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!526 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!527 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!528 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!529 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!530 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!531 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!532 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!533 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!534 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!535 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!536 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!537 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!538 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!539 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!540 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!541 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!542 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!543 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!544 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!545 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!546 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!547 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!548 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!549 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!550 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!551 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!552 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!553 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!554 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!555 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!556 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!557 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!558 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!559 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!560 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!561 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!562 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!563 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!564 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!565 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!566 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!567 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!568 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!569 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!570 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!571 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!572 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!573 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!574 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!575 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!576 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!577 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!578 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!579 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!580 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!581 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!582 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!583 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!584 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!585 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!586 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!587 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!588 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!589 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!590 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!591 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!592 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!593 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!594 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!595 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!596 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!597 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!598 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!599 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!600 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!601 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!602 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!603 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!604 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!605 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!606 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!607 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!608 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!609 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!610 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!611 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!612 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!613 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!614 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!615 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!616 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!617 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!618 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!619 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!620 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!621 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!622 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!623 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!624 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!625 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!626 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!627 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!628 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!629 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!630 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!631 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!632 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!633 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!634 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!635 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!636 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!637 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!661 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!662 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!663 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!664 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!665 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!666 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!667 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!668 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!669 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!670 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!671 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!672 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!673 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!674 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!675 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!676 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!677 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!678 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!679 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!680 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!681 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!682 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!683 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!684 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!685 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!686 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!687 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!688 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!689 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!690 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!691 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!692 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!693 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!694 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!695 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!696 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!697 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!698 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!699 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!700 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!701 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!702 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!703 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!704 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!705 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!706 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!707 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!708 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!709 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!710 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!711 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!712 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!713 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!714 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!715 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!716 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!717 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!719 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!720 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!721 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!722 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!723 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!724 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!725 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!726 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!727 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!728 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!729 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!730 = !{!"clang version 7.0.0 (tags/RELEASE_700/final)"}
!731 = !{i32 2, !"Dwarf Version", i32 4}
!732 = !{i32 2, !"Debug Info Version", i32 3}
!733 = !{i32 1, !"wchar_size", i32 4}
!734 = !{i32 7, !"PIC Level", i32 2}
!735 = !{i32 7, !"PIE Level", i32 2}
!736 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 170, type: !737, isDefinition: true, scopeLine: 171, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, retainedNodes: !739)
!737 = !DISubroutineType(types: !738)
!738 = !{null, !116}
!739 = !{!740}
!740 = !DILocalVariable(name: "status", arg: 1, scope: !736, file: !3, line: 170, type: !116)
!741 = !DILocalVariable(name: "infomap", scope: !742, file: !743, line: 632, type: !757)
!742 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !743, file: !743, line: 630, type: !744, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !746)
!743 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!744 = !DISubroutineType(types: !745)
!745 = !{null, !44}
!746 = !{!747, !741, !748, !749, !756}
!747 = !DILocalVariable(name: "program", arg: 1, scope: !742, file: !743, line: 630, type: !44)
!748 = !DILocalVariable(name: "node", scope: !742, file: !743, line: 642, type: !44)
!749 = !DILocalVariable(name: "map_prog", scope: !742, file: !743, line: 643, type: !750)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !752)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !742, file: !743, line: 632, size: 128, elements: !753)
!753 = !{!754, !755}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !752, file: !743, line: 632, baseType: !44, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !752, file: !743, line: 632, baseType: !44, size: 64, offset: 64)
!756 = !DILocalVariable(name: "lc_messages", scope: !742, file: !743, line: 655, type: !44)
!757 = !DICompositeType(tag: DW_TAG_array_type, baseType: !751, size: 896, elements: !151)
!758 = !DILocation(line: 632, column: 67, scope: !742, inlinedAt: !759)
!759 = distinct !DILocation(line: 232, column: 7, scope: !760)
!760 = distinct !DILexicalBlock(scope: !761, file: !3, line: 175, column: 5)
!761 = distinct !DILexicalBlock(scope: !736, file: !3, line: 172, column: 7)
!762 = !DILocation(line: 170, column: 12, scope: !736)
!763 = !DILocation(line: 172, column: 14, scope: !761)
!764 = !DILocation(line: 172, column: 7, scope: !736)
!765 = !DILocation(line: 173, column: 5, scope: !766)
!766 = distinct !DILexicalBlock(scope: !761, file: !3, line: 173, column: 5)
!767 = !{!768, !768, i64 0}
!768 = !{!"any pointer", !769, i64 0}
!769 = !{!"omnipotent char", !770, i64 0}
!770 = !{!"Simple C/C++ TBAA"}
!771 = !DILocation(line: 176, column: 7, scope: !760)
!772 = !DILocation(line: 180, column: 7, scope: !760)
!773 = !DILocation(line: 580, column: 3, scope: !774, inlinedAt: !775)
!774 = distinct !DISubprogram(name: "emit_stdin_note", scope: !743, file: !743, line: 578, type: !176, isLocal: true, isDefinition: true, scopeLine: 579, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !178)
!775 = distinct !DILocation(line: 184, column: 7, scope: !760)
!776 = !DILocation(line: 587, column: 3, scope: !777, inlinedAt: !778)
!777 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !743, file: !743, line: 585, type: !176, isLocal: true, isDefinition: true, scopeLine: 586, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !178)
!778 = distinct !DILocation(line: 185, column: 7, scope: !760)
!779 = !DILocation(line: 187, column: 7, scope: !760)
!780 = !DILocation(line: 192, column: 7, scope: !760)
!781 = !DILocation(line: 200, column: 7, scope: !760)
!782 = !DILocation(line: 204, column: 7, scope: !760)
!783 = !DILocation(line: 205, column: 7, scope: !760)
!784 = !DILocation(line: 206, column: 7, scope: !760)
!785 = !DILocation(line: 213, column: 7, scope: !760)
!786 = !DILocation(line: 223, column: 7, scope: !760)
!787 = !DILocation(line: 632, column: 3, scope: !742, inlinedAt: !759)
!788 = !DILocation(line: 643, column: 36, scope: !742, inlinedAt: !759)
!789 = !DILocation(line: 643, column: 25, scope: !742, inlinedAt: !759)
!790 = !DILocation(line: 645, column: 33, scope: !742, inlinedAt: !759)
!791 = !DILocation(line: 645, column: 3, scope: !742, inlinedAt: !759)
!792 = !DILocation(line: 646, column: 13, scope: !742, inlinedAt: !759)
!793 = !DILocation(line: 645, column: 20, scope: !742, inlinedAt: !759)
!794 = !{!795, !768, i64 0}
!795 = !{!"infomap", !768, i64 0, !768, i64 8}
!796 = !DILocation(line: 645, column: 10, scope: !742, inlinedAt: !759)
!797 = !DILocation(line: 645, column: 28, scope: !742, inlinedAt: !759)
!798 = distinct !{!798, !799, !800}
!799 = !DILocation(line: 645, column: 3, scope: !742)
!800 = !DILocation(line: 646, column: 13, scope: !742)
!801 = !DILocation(line: 648, column: 17, scope: !802, inlinedAt: !759)
!802 = distinct !DILexicalBlock(scope: !742, file: !743, line: 648, column: 7)
!803 = !{!795, !768, i64 8}
!804 = !DILocation(line: 648, column: 7, scope: !802, inlinedAt: !759)
!805 = !DILocation(line: 648, column: 7, scope: !742, inlinedAt: !759)
!806 = !DILocation(line: 642, column: 15, scope: !742, inlinedAt: !759)
!807 = !DILocation(line: 651, column: 3, scope: !742, inlinedAt: !759)
!808 = !DILocation(line: 655, column: 29, scope: !742, inlinedAt: !759)
!809 = !DILocation(line: 655, column: 15, scope: !742, inlinedAt: !759)
!810 = !DILocation(line: 656, column: 7, scope: !811, inlinedAt: !759)
!811 = distinct !DILexicalBlock(scope: !742, file: !743, line: 656, column: 7)
!812 = !DILocation(line: 656, column: 19, scope: !811, inlinedAt: !759)
!813 = !DILocation(line: 656, column: 22, scope: !811, inlinedAt: !759)
!814 = !DILocation(line: 656, column: 7, scope: !742, inlinedAt: !759)
!815 = !DILocation(line: 662, column: 7, scope: !816, inlinedAt: !759)
!816 = distinct !DILexicalBlock(scope: !811, file: !743, line: 657, column: 5)
!817 = !DILocation(line: 664, column: 5, scope: !816, inlinedAt: !759)
!818 = !DILocation(line: 665, column: 3, scope: !742, inlinedAt: !759)
!819 = !DILocation(line: 667, column: 3, scope: !742, inlinedAt: !759)
!820 = !DILocation(line: 669, column: 1, scope: !742, inlinedAt: !759)
!821 = !DILocation(line: 234, column: 3, scope: !736)
!822 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 464, type: !823, isDefinition: true, scopeLine: 465, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !826)
!823 = !DISubroutineType(types: !824)
!824 = !{!116, !116, !825}
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!826 = !{!827, !828, !829, !830, !831}
!827 = !DILocalVariable(name: "argc", arg: 1, scope: !822, file: !3, line: 464, type: !116)
!828 = !DILocalVariable(name: "argv", arg: 2, scope: !822, file: !3, line: 464, type: !825)
!829 = !DILocalVariable(name: "c", scope: !822, file: !3, line: 466, type: !116)
!830 = !DILocalVariable(name: "len", scope: !822, file: !3, line: 467, type: !63)
!831 = !DILocalVariable(name: "ok", scope: !822, file: !3, line: 468, type: !134)
!832 = !DILocation(line: 464, column: 11, scope: !822)
!833 = !DILocation(line: 464, column: 24, scope: !822)
!834 = !DILocation(line: 468, column: 8, scope: !822)
!835 = !DILocation(line: 471, column: 21, scope: !822)
!836 = !DILocation(line: 471, column: 3, scope: !822)
!837 = !DILocation(line: 472, column: 3, scope: !822)
!838 = !DILocation(line: 473, column: 3, scope: !822)
!839 = !DILocation(line: 474, column: 3, scope: !822)
!840 = !DILocation(line: 476, column: 3, scope: !822)
!841 = !DILocation(line: 480, column: 3, scope: !822)
!842 = !DILocation(scope: !843)
!843 = distinct !DILexicalBlock(scope: !844, file: !3, line: 484, column: 9)
!844 = distinct !DILexicalBlock(scope: !822, file: !3, line: 482, column: 5)
!845 = !DILocation(line: 480, column: 15, scope: !822)
!846 = !DILocation(line: 466, column: 7, scope: !822)
!847 = distinct !{!847, !841, !848}
!848 = !DILocation(line: 555, column: 5, scope: !822)
!849 = !DILocation(line: 486, column: 17, scope: !850)
!850 = distinct !DILexicalBlock(scope: !843, file: !3, line: 486, column: 15)
!851 = !DILocation(line: 486, column: 15, scope: !843)
!852 = !DILocation(line: 488, column: 28, scope: !853)
!853 = distinct !DILexicalBlock(scope: !850, file: !3, line: 487, column: 13)
!854 = !DILocation(line: 489, column: 29, scope: !853)
!855 = !DILocation(line: 489, column: 22, scope: !853)
!856 = !DILocation(line: 488, column: 15, scope: !853)
!857 = !DILocation(line: 491, column: 13, scope: !853)
!858 = !DILocation(line: 494, column: 17, scope: !859)
!859 = distinct !DILexicalBlock(scope: !843, file: !3, line: 494, column: 15)
!860 = !DILocation(line: 494, column: 15, scope: !843)
!861 = !DILocation(line: 496, column: 28, scope: !862)
!862 = distinct !DILexicalBlock(scope: !859, file: !3, line: 495, column: 13)
!863 = !DILocation(line: 497, column: 29, scope: !862)
!864 = !DILocation(line: 497, column: 22, scope: !862)
!865 = !DILocation(line: 496, column: 15, scope: !862)
!866 = !DILocation(line: 499, column: 13, scope: !862)
!867 = !DILocation(line: 502, column: 17, scope: !868)
!868 = distinct !DILexicalBlock(scope: !843, file: !3, line: 502, column: 15)
!869 = !DILocation(line: 502, column: 15, scope: !843)
!870 = !DILocation(line: 504, column: 28, scope: !871)
!871 = distinct !DILexicalBlock(scope: !868, file: !3, line: 503, column: 13)
!872 = !DILocation(line: 505, column: 29, scope: !871)
!873 = !DILocation(line: 505, column: 22, scope: !871)
!874 = !DILocation(line: 504, column: 15, scope: !871)
!875 = !DILocation(line: 507, column: 13, scope: !871)
!876 = !DILocation(line: 510, column: 46, scope: !843)
!877 = !DILocation(line: 511, column: 46, scope: !843)
!878 = !DILocation(line: 510, column: 34, scope: !843)
!879 = !DILocation(line: 510, column: 32, scope: !843)
!880 = !{!881, !881, i64 0}
!881 = !{!"long", !769, i64 0}
!882 = !DILocation(line: 513, column: 11, scope: !843)
!883 = !DILocation(line: 515, column: 35, scope: !843)
!884 = !DILocation(line: 516, column: 35, scope: !843)
!885 = !DILocation(line: 515, column: 23, scope: !843)
!886 = !DILocation(line: 515, column: 21, scope: !843)
!887 = !DILocation(line: 517, column: 11, scope: !843)
!888 = !DILocation(line: 520, column: 11, scope: !843)
!889 = !DILocation(line: 522, column: 36, scope: !843)
!890 = !DILocation(line: 523, column: 36, scope: !843)
!891 = !DILocation(line: 522, column: 24, scope: !843)
!892 = !DILocation(line: 522, column: 22, scope: !843)
!893 = !DILocation(line: 524, column: 11, scope: !843)
!894 = !DILocation(line: 526, column: 27, scope: !843)
!895 = !DILocation(line: 526, column: 25, scope: !843)
!896 = !DILocation(line: 527, column: 11, scope: !843)
!897 = !DILocation(line: 529, column: 38, scope: !843)
!898 = !DILocation(line: 530, column: 38, scope: !843)
!899 = !DILocation(line: 529, column: 26, scope: !843)
!900 = !DILocation(line: 529, column: 24, scope: !843)
!901 = !{!902, !902, i64 0}
!902 = !{!"int", !769, i64 0}
!903 = !DILocation(line: 531, column: 11, scope: !843)
!904 = !DILocation(line: 533, column: 15, scope: !905)
!905 = distinct !DILexicalBlock(scope: !843, file: !3, line: 533, column: 15)
!906 = !DILocation(line: 533, column: 15, scope: !843)
!907 = !DILocation(line: 534, column: 27, scope: !905)
!908 = !DILocation(line: 534, column: 13, scope: !905)
!909 = !DILocation(line: 535, column: 20, scope: !910)
!910 = distinct !DILexicalBlock(scope: !905, file: !3, line: 535, column: 20)
!911 = !DILocation(line: 535, column: 20, scope: !905)
!912 = !DILocation(line: 536, column: 27, scope: !910)
!913 = !DILocation(line: 536, column: 13, scope: !910)
!914 = !DILocation(line: 537, column: 20, scope: !915)
!915 = distinct !DILexicalBlock(scope: !910, file: !3, line: 537, column: 20)
!916 = !DILocation(line: 537, column: 20, scope: !910)
!917 = !DILocation(line: 538, column: 27, scope: !915)
!918 = !DILocation(line: 538, column: 13, scope: !915)
!919 = !DILocation(line: 541, column: 28, scope: !920)
!920 = distinct !DILexicalBlock(scope: !915, file: !3, line: 540, column: 13)
!921 = !DILocation(line: 542, column: 29, scope: !920)
!922 = !DILocation(line: 542, column: 22, scope: !920)
!923 = !DILocation(line: 541, column: 15, scope: !920)
!924 = !DILocation(line: 547, column: 25, scope: !843)
!925 = !DILocation(line: 547, column: 23, scope: !843)
!926 = !DILocation(line: 548, column: 11, scope: !843)
!927 = !DILocation(line: 549, column: 9, scope: !843)
!928 = !DILocation(line: 550, column: 9, scope: !843)
!929 = !DILocation(line: 557, column: 8, scope: !930)
!930 = distinct !DILexicalBlock(scope: !822, file: !3, line: 557, column: 7)
!931 = !DILocation(line: 557, column: 7, scope: !822)
!932 = !DILocation(line: 558, column: 5, scope: !930)
!933 = !DILocation(line: 561, column: 17, scope: !822)
!934 = !DILocation(line: 561, column: 9, scope: !822)
!935 = !DILocation(line: 467, column: 10, scope: !822)
!936 = !DILocation(line: 563, column: 24, scope: !822)
!937 = !DILocation(line: 563, column: 18, scope: !822)
!938 = !DILocation(line: 564, column: 40, scope: !822)
!939 = !DILocation(line: 564, column: 16, scope: !822)
!940 = !DILocation(line: 564, column: 14, scope: !822)
!941 = !DILocation(line: 565, column: 39, scope: !822)
!942 = !DILocalVariable(name: "__dest", arg: 1, scope: !943, file: !944, line: 95, type: !947)
!943 = distinct !DISubprogram(name: "stpcpy", scope: !944, file: !944, line: 95, type: !945, isDefinition: true, scopeLine: 96, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !949)
!944 = !DIFile(filename: "/usr/include/bits/string_fortified.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!945 = !DISubroutineType(types: !946)
!946 = !{!36, !947, !948}
!947 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !36)
!948 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !44)
!949 = !{!942, !950}
!950 = !DILocalVariable(name: "__src", arg: 2, scope: !943, file: !944, line: 95, type: !948)
!951 = !DILocation(line: 95, column: 1, scope: !943, inlinedAt: !952)
!952 = distinct !DILocation(line: 565, column: 19, scope: !822)
!953 = !DILocation(line: 97, column: 49, scope: !943, inlinedAt: !952)
!954 = !DILocation(line: 97, column: 10, scope: !943, inlinedAt: !952)
!955 = !DILocation(line: 565, column: 53, scope: !822)
!956 = !DILocation(line: 95, column: 1, scope: !943, inlinedAt: !957)
!957 = distinct !DILocation(line: 565, column: 11, scope: !822)
!958 = !DILocation(line: 97, column: 49, scope: !943, inlinedAt: !957)
!959 = !DILocation(line: 97, column: 10, scope: !943, inlinedAt: !957)
!960 = !DILocation(line: 565, column: 67, scope: !822)
!961 = !DILocation(line: 95, column: 1, scope: !943, inlinedAt: !962)
!962 = distinct !DILocation(line: 565, column: 3, scope: !822)
!963 = !DILocation(line: 97, column: 49, scope: !943, inlinedAt: !962)
!964 = !DILocation(line: 97, column: 10, scope: !943, inlinedAt: !962)
!965 = !DILocation(line: 567, column: 22, scope: !822)
!966 = !DILocation(line: 567, column: 16, scope: !822)
!967 = !DILocation(line: 568, column: 36, scope: !822)
!968 = !DILocation(line: 568, column: 14, scope: !822)
!969 = !DILocation(line: 568, column: 12, scope: !822)
!970 = !DILocation(line: 569, column: 29, scope: !822)
!971 = !DILocation(line: 95, column: 1, scope: !943, inlinedAt: !972)
!972 = distinct !DILocation(line: 569, column: 11, scope: !822)
!973 = !DILocation(line: 97, column: 49, scope: !943, inlinedAt: !972)
!974 = !DILocation(line: 97, column: 10, scope: !943, inlinedAt: !972)
!975 = !DILocation(line: 569, column: 43, scope: !822)
!976 = !DILocation(line: 95, column: 1, scope: !943, inlinedAt: !977)
!977 = distinct !DILocation(line: 569, column: 3, scope: !822)
!978 = !DILocation(line: 97, column: 49, scope: !943, inlinedAt: !977)
!979 = !DILocation(line: 97, column: 10, scope: !943, inlinedAt: !977)
!980 = !DILocation(line: 571, column: 18, scope: !822)
!981 = !DILocation(line: 572, column: 40, scope: !822)
!982 = !DILocation(line: 572, column: 16, scope: !822)
!983 = !DILocation(line: 572, column: 14, scope: !822)
!984 = !DILocation(line: 573, column: 23, scope: !822)
!985 = !DILocation(line: 95, column: 1, scope: !943, inlinedAt: !986)
!986 = distinct !DILocation(line: 573, column: 3, scope: !822)
!987 = !DILocation(line: 97, column: 49, scope: !943, inlinedAt: !986)
!988 = !DILocation(line: 97, column: 10, scope: !943, inlinedAt: !986)
!989 = !DILocation(line: 576, column: 3, scope: !822)
!990 = !DILocation(line: 579, column: 17, scope: !822)
!991 = !DILocation(line: 579, column: 9, scope: !822)
!992 = !DILocation(line: 580, column: 32, scope: !822)
!993 = !DILocation(line: 580, column: 45, scope: !822)
!994 = !DILocation(line: 580, column: 51, scope: !822)
!995 = !DILocation(line: 580, column: 23, scope: !822)
!996 = !DILocation(line: 580, column: 21, scope: !822)
!997 = !DILocation(line: 581, column: 35, scope: !822)
!998 = !DILocation(line: 581, column: 48, scope: !822)
!999 = !DILocation(line: 581, column: 3, scope: !822)
!1000 = !DILocation(line: 582, column: 3, scope: !822)
!1001 = !DILocation(line: 582, column: 41, scope: !822)
!1002 = !{!769, !769, i64 0}
!1003 = !DILocation(line: 584, column: 13, scope: !822)
!1004 = !DILocation(line: 584, column: 11, scope: !822)
!1005 = !DILocation(line: 585, column: 18, scope: !822)
!1006 = !DILocation(line: 585, column: 16, scope: !822)
!1007 = !DILocation(line: 586, column: 17, scope: !822)
!1008 = !DILocation(line: 590, column: 7, scope: !1009)
!1009 = distinct !DILexicalBlock(scope: !822, file: !3, line: 590, column: 7)
!1010 = !DILocation(line: 590, column: 14, scope: !1009)
!1011 = !DILocation(line: 590, column: 7, scope: !822)
!1012 = !DILocation(line: 593, column: 19, scope: !1013)
!1013 = distinct !DILexicalBlock(scope: !1014, file: !3, line: 593, column: 5)
!1014 = distinct !DILexicalBlock(scope: !1009, file: !3, line: 593, column: 5)
!1015 = !DILocation(line: 593, column: 5, scope: !1014)
!1016 = !DILocation(line: 591, column: 10, scope: !1009)
!1017 = !DILocation(line: 591, column: 8, scope: !1009)
!1018 = !DILocation(line: 591, column: 5, scope: !1009)
!1019 = !DILocation(line: 594, column: 22, scope: !1013)
!1020 = !DILocation(line: 594, column: 13, scope: !1013)
!1021 = !DILocation(line: 594, column: 10, scope: !1013)
!1022 = !DILocation(line: 593, column: 33, scope: !1013)
!1023 = distinct !{!1023, !1015, !1024}
!1024 = !DILocation(line: 594, column: 34, scope: !1014)
!1025 = !DILocation(scope: !822)
!1026 = !DILocation(line: 596, column: 23, scope: !1027)
!1027 = distinct !DILexicalBlock(scope: !822, file: !3, line: 596, column: 7)
!1028 = !DILocation(line: 596, column: 34, scope: !1027)
!1029 = !DILocation(line: 596, column: 26, scope: !1027)
!1030 = !DILocation(line: 596, column: 41, scope: !1027)
!1031 = !DILocation(line: 596, column: 7, scope: !822)
!1032 = !DILocation(line: 597, column: 5, scope: !1027)
!1033 = !DILocation(line: 599, column: 10, scope: !822)
!1034 = !DILocation(line: 599, column: 3, scope: !822)
!1035 = distinct !DISubprogram(name: "build_type_arg", scope: !3, file: !3, line: 241, type: !1036, isLocal: true, isDefinition: true, scopeLine: 243, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1039)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!134, !1038, !172, !36}
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!1039 = !{!1040, !1041, !1042, !1043, !1044}
!1040 = !DILocalVariable(name: "typep", arg: 1, scope: !1035, file: !3, line: 241, type: !1038)
!1041 = !DILocalVariable(name: "regexp", arg: 2, scope: !1035, file: !3, line: 242, type: !172)
!1042 = !DILocalVariable(name: "fastmap", arg: 3, scope: !1035, file: !3, line: 242, type: !36)
!1043 = !DILocalVariable(name: "errmsg", scope: !1035, file: !3, line: 244, type: !44)
!1044 = !DILocalVariable(name: "rval", scope: !1035, file: !3, line: 245, type: !134)
!1045 = !DILocation(line: 241, column: 30, scope: !1035)
!1046 = !DILocation(line: 242, column: 43, scope: !1035)
!1047 = !DILocation(line: 242, column: 57, scope: !1035)
!1048 = !DILocation(line: 245, column: 8, scope: !1035)
!1049 = !DILocation(line: 247, column: 12, scope: !1035)
!1050 = !DILocation(line: 247, column: 11, scope: !1035)
!1051 = !DILocation(line: 247, column: 3, scope: !1035)
!1052 = !DILocation(line: 252, column: 14, scope: !1053)
!1053 = distinct !DILexicalBlock(scope: !1035, file: !3, line: 248, column: 5)
!1054 = !DILocation(line: 253, column: 7, scope: !1053)
!1055 = !DILocation(line: 255, column: 22, scope: !1053)
!1056 = !DILocation(line: 255, column: 14, scope: !1053)
!1057 = !DILocation(line: 258, column: 15, scope: !1053)
!1058 = !DILocation(line: 258, column: 23, scope: !1053)
!1059 = !DILocation(line: 257, column: 25, scope: !1053)
!1060 = !{!1061, !768, i64 32}
!1061 = !{!"re_pattern_buffer", !768, i64 0, !881, i64 8, !881, i64 16, !881, i64 24, !768, i64 32, !768, i64 40, !881, i64 48, !902, i64 56, !902, i64 56, !902, i64 56, !902, i64 56, !902, i64 56, !902, i64 56, !902, i64 56}
!1062 = !DILocation(line: 259, column: 15, scope: !1053)
!1063 = !DILocation(line: 259, column: 25, scope: !1053)
!1064 = !{!1061, !768, i64 40}
!1065 = !DILocation(line: 260, column: 25, scope: !1053)
!1066 = !DILocation(line: 262, column: 36, scope: !1053)
!1067 = !DILocation(line: 262, column: 44, scope: !1053)
!1068 = !DILocation(line: 262, column: 16, scope: !1053)
!1069 = !DILocation(line: 244, column: 15, scope: !1035)
!1070 = !DILocation(line: 263, column: 11, scope: !1071)
!1071 = distinct !DILexicalBlock(scope: !1053, file: !3, line: 263, column: 11)
!1072 = !DILocation(line: 263, column: 11, scope: !1053)
!1073 = !DILocation(line: 264, column: 9, scope: !1071)
!1074 = !DILocation(line: 270, column: 3, scope: !1035)
!1075 = distinct !DISubprogram(name: "nl_file", scope: !3, file: !3, line: 425, type: !1076, isLocal: true, isDefinition: true, scopeLine: 426, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1078)
!1076 = !DISubroutineType(types: !1077)
!1077 = !{!134, !44}
!1078 = !{!1079, !1080}
!1079 = !DILocalVariable(name: "file", arg: 1, scope: !1075, file: !3, line: 425, type: !44)
!1080 = !DILocalVariable(name: "stream", scope: !1075, file: !3, line: 427, type: !1081)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !1083, line: 7, baseType: !1084)
!1083 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!1084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !1085, line: 49, size: 1728, elements: !1086)
!1085 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!1086 = !{!1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1102, !1104, !1105, !1106, !1108, !1109, !1111, !1115, !1118, !1120, !1123, !1126, !1127, !1128, !1129, !1130}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1084, file: !1085, line: 51, baseType: !116, size: 32)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1084, file: !1085, line: 54, baseType: !36, size: 64, offset: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1084, file: !1085, line: 55, baseType: !36, size: 64, offset: 128)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1084, file: !1085, line: 56, baseType: !36, size: 64, offset: 192)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1084, file: !1085, line: 57, baseType: !36, size: 64, offset: 256)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1084, file: !1085, line: 58, baseType: !36, size: 64, offset: 320)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1084, file: !1085, line: 59, baseType: !36, size: 64, offset: 384)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1084, file: !1085, line: 60, baseType: !36, size: 64, offset: 448)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1084, file: !1085, line: 61, baseType: !36, size: 64, offset: 512)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1084, file: !1085, line: 64, baseType: !36, size: 64, offset: 576)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1084, file: !1085, line: 65, baseType: !36, size: 64, offset: 640)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1084, file: !1085, line: 66, baseType: !36, size: 64, offset: 704)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1084, file: !1085, line: 68, baseType: !1100, size: 64, offset: 768)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64)
!1101 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !1085, line: 36, flags: DIFlagFwdDecl)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1084, file: !1085, line: 70, baseType: !1103, size: 64, offset: 832)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1084, file: !1085, line: 72, baseType: !116, size: 32, offset: 896)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1084, file: !1085, line: 73, baseType: !116, size: 32, offset: 928)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1084, file: !1085, line: 74, baseType: !1107, size: 64, offset: 960)
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !104, line: 150, baseType: !105)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1084, file: !1085, line: 77, baseType: !233, size: 16, offset: 1024)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1084, file: !1085, line: 78, baseType: !1110, size: 8, offset: 1040)
!1110 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1084, file: !1085, line: 79, baseType: !1112, size: 8, offset: 1048)
!1112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 8, elements: !1113)
!1113 = !{!1114}
!1114 = !DISubrange(count: 1)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1084, file: !1085, line: 81, baseType: !1116, size: 64, offset: 1088)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64)
!1117 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !1085, line: 43, baseType: null)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1084, file: !1085, line: 89, baseType: !1119, size: 64, offset: 1152)
!1119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !104, line: 151, baseType: !105)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1084, file: !1085, line: 91, baseType: !1121, size: 64, offset: 1216)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64)
!1122 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !1085, line: 37, flags: DIFlagFwdDecl)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1084, file: !1085, line: 92, baseType: !1124, size: 64, offset: 1280)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64)
!1125 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !1085, line: 38, flags: DIFlagFwdDecl)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1084, file: !1085, line: 93, baseType: !1103, size: 64, offset: 1344)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1084, file: !1085, line: 94, baseType: !38, size: 64, offset: 1408)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1084, file: !1085, line: 95, baseType: !63, size: 64, offset: 1472)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1084, file: !1085, line: 96, baseType: !116, size: 32, offset: 1536)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1084, file: !1085, line: 98, baseType: !1131, size: 160, offset: 1568)
!1131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 160, elements: !1132)
!1132 = !{!1133}
!1133 = !DISubrange(count: 20)
!1134 = !DILocation(line: 425, column: 22, scope: !1075)
!1135 = !DILocation(line: 429, column: 7, scope: !1136)
!1136 = distinct !DILexicalBlock(scope: !1075, file: !3, line: 429, column: 7)
!1137 = !DILocation(line: 429, column: 7, scope: !1075)
!1138 = !DILocation(line: 432, column: 16, scope: !1139)
!1139 = distinct !DILexicalBlock(scope: !1136, file: !3, line: 430, column: 5)
!1140 = !DILocation(line: 427, column: 9, scope: !1075)
!1141 = !DILocation(line: 433, column: 5, scope: !1139)
!1142 = !DILocation(line: 436, column: 16, scope: !1143)
!1143 = distinct !DILexicalBlock(scope: !1136, file: !3, line: 435, column: 5)
!1144 = !DILocation(line: 437, column: 18, scope: !1145)
!1145 = distinct !DILexicalBlock(scope: !1143, file: !3, line: 437, column: 11)
!1146 = !DILocation(line: 437, column: 11, scope: !1143)
!1147 = !DILocation(line: 439, column: 21, scope: !1148)
!1148 = distinct !DILexicalBlock(scope: !1145, file: !3, line: 438, column: 9)
!1149 = !DILocation(line: 439, column: 34, scope: !1148)
!1150 = !DILocation(line: 439, column: 11, scope: !1148)
!1151 = !DILocation(line: 440, column: 11, scope: !1148)
!1152 = !DILocation(scope: !1143)
!1153 = !DILocation(line: 444, column: 3, scope: !1075)
!1154 = !DILocalVariable(name: "fp", arg: 1, scope: !1155, file: !3, line: 399, type: !1081)
!1155 = distinct !DISubprogram(name: "process_file", scope: !3, file: !3, line: 399, type: !1156, isLocal: true, isDefinition: true, scopeLine: 400, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1158)
!1156 = !DISubroutineType(types: !1157)
!1157 = !{null, !1081}
!1158 = !{!1154}
!1159 = !DILocation(line: 399, column: 21, scope: !1155, inlinedAt: !1160)
!1160 = distinct !DILocation(line: 446, column: 3, scope: !1075)
!1161 = !DILocation(line: 401, column: 10, scope: !1155, inlinedAt: !1160)
!1162 = !DILocation(line: 401, column: 3, scope: !1155, inlinedAt: !1160)
!1163 = !DILocation(line: 380, column: 25, scope: !1164, inlinedAt: !1169)
!1164 = distinct !DISubprogram(name: "check_section", scope: !3, file: !3, line: 378, type: !1165, isLocal: true, isDefinition: true, scopeLine: 379, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1167)
!1165 = !DISubroutineType(types: !1166)
!1166 = !{!29}
!1167 = !{!1168}
!1168 = !DILocalVariable(name: "len", scope: !1164, file: !3, line: 380, type: !63)
!1169 = distinct !DILocation(line: 403, column: 15, scope: !1170, inlinedAt: !1160)
!1170 = distinct !DILexicalBlock(scope: !1155, file: !3, line: 402, column: 5)
!1171 = !{!1172, !881, i64 8}
!1172 = !{!"linebuffer", !881, i64 0, !881, i64 8, !768, i64 16}
