; ModuleID = 'coreutils-8.32/src/nproc.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.cpu_set_t = type { [16 x i64] }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [23 x i8] c"Usage: %s [OPTION]...\0A\00", align 1
@.str.2 = private unnamed_addr constant [128 x i8] c"Print the number of processing units available to the current process,\0Awhich may be less than the number of online processors\0A\0A\00", align 1
@stdout = external local_unnamed_addr global %struct._IO_FILE*, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 41, type: !140, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !12, globals: !139, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/nproc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nproc_query", file: !6, line: 32, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/nproc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "NPROC_ALL", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "NPROC_CURRENT", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "NPROC_CURRENT_OVERRIDABLE", value: 2, isUnsigned: true)
!12 = !{!13, !23, !84, !88, !92, !95, !98, !105, !17, !74, !120, !124, !128, !132, !136}
!13 = !DISubprogram(name: "dcgettext", scope: !14, file: !14, line: 51, type: !15, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !22)
!14 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!15 = !DISubroutineType(types: !16)
!16 = !{!17, !19, !19, !21}
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!21 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!22 = !{}
!23 = !DISubprogram(name: "fputs_unlocked", scope: !24, file: !24, line: 662, type: !25, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !22)
!24 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!25 = !DISubroutineType(types: !26)
!26 = !{!21, !19, !27}
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !29, line: 49, size: 1728, elements: !30)
!29 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!30 = !{!31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !46, !47, !48, !49, !53, !55, !57, !61, !64, !66, !69, !72, !73, !75, !79, !80}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !28, file: !29, line: 51, baseType: !21, size: 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !28, file: !29, line: 54, baseType: !17, size: 64, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !28, file: !29, line: 55, baseType: !17, size: 64, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !28, file: !29, line: 56, baseType: !17, size: 64, offset: 192)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !28, file: !29, line: 57, baseType: !17, size: 64, offset: 256)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !28, file: !29, line: 58, baseType: !17, size: 64, offset: 320)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !28, file: !29, line: 59, baseType: !17, size: 64, offset: 384)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !28, file: !29, line: 60, baseType: !17, size: 64, offset: 448)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !28, file: !29, line: 61, baseType: !17, size: 64, offset: 512)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !28, file: !29, line: 64, baseType: !17, size: 64, offset: 576)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !28, file: !29, line: 65, baseType: !17, size: 64, offset: 640)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !28, file: !29, line: 66, baseType: !17, size: 64, offset: 704)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !28, file: !29, line: 68, baseType: !44, size: 64, offset: 768)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !29, line: 36, flags: DIFlagFwdDecl)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !28, file: !29, line: 70, baseType: !27, size: 64, offset: 832)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !28, file: !29, line: 72, baseType: !21, size: 32, offset: 896)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !28, file: !29, line: 73, baseType: !21, size: 32, offset: 928)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !28, file: !29, line: 74, baseType: !50, size: 64, offset: 960)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !51, line: 152, baseType: !52)
!51 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!52 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !28, file: !29, line: 77, baseType: !54, size: 16, offset: 1024)
!54 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !28, file: !29, line: 78, baseType: !56, size: 8, offset: 1040)
!56 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !28, file: !29, line: 79, baseType: !58, size: 8, offset: 1048)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 8, elements: !59)
!59 = !{!60}
!60 = !DISubrange(count: 1)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !28, file: !29, line: 81, baseType: !62, size: 64, offset: 1088)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !29, line: 43, baseType: null)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !28, file: !29, line: 89, baseType: !65, size: 64, offset: 1152)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !51, line: 153, baseType: !52)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !28, file: !29, line: 91, baseType: !67, size: 64, offset: 1216)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !29, line: 37, flags: DIFlagFwdDecl)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !28, file: !29, line: 92, baseType: !70, size: 64, offset: 1280)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !29, line: 38, flags: DIFlagFwdDecl)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !28, file: !29, line: 93, baseType: !27, size: 64, offset: 1344)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !28, file: !29, line: 94, baseType: !74, size: 64, offset: 1408)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !28, file: !29, line: 95, baseType: !76, size: 64, offset: 1472)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !77, line: 46, baseType: !78)
!77 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!78 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !28, file: !29, line: 96, baseType: !21, size: 32, offset: 1536)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !28, file: !29, line: 98, baseType: !81, size: 160, offset: 1568)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 160, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 20)
!84 = !DISubprogram(name: "set_program_name", scope: !85, file: !85, line: 37, type: !86, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !22)
!85 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!86 = !DISubroutineType(types: !87)
!87 = !{null, !19}
!88 = !DISubprogram(name: "setlocale", scope: !89, file: !89, line: 122, type: !90, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !22)
!89 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!90 = !DISubroutineType(types: !91)
!91 = !{!17, !21, !19}
!92 = !DISubprogram(name: "bindtextdomain", scope: !14, file: !14, line: 86, type: !93, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !22)
!93 = !DISubroutineType(types: !94)
!94 = !{!17, !19, !19}
!95 = !DISubprogram(name: "textdomain", scope: !14, file: !14, line: 82, type: !96, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !22)
!96 = !DISubroutineType(types: !97)
!97 = !{!17, !19}
!98 = !DISubprogram(name: "atexit", scope: !99, file: !99, line: 595, type: !100, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !22)
!99 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!100 = !DISubroutineType(types: !101)
!101 = !{!21, !102}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{null}
!105 = !DISubprogram(name: "getopt_long", scope: !106, file: !106, line: 66, type: !107, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !22)
!106 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!107 = !DISubroutineType(types: !108)
!108 = !{!21, !21, !109, !19, !111, !118}
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !113)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !106, line: 50, size: 256, elements: !114)
!114 = !{!115, !116, !117, !119}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !113, file: !106, line: 52, baseType: !19, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !113, file: !106, line: 55, baseType: !21, size: 32, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !113, file: !106, line: 56, baseType: !118, size: 64, offset: 128)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !113, file: !106, line: 57, baseType: !21, size: 32, offset: 192)
!120 = !DISubprogram(name: "version_etc", scope: !121, file: !121, line: 69, type: !122, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !22)
!121 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!122 = !DISubroutineType(types: !123)
!123 = !{null, !27, !19, !19, !19, null}
!124 = !DISubprogram(name: "xdectoumax", scope: !125, file: !125, line: 31, type: !126, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !22)
!125 = !DIFile(filename: "./lib/xdectoint.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!126 = !DISubroutineType(types: !127)
!127 = !{!78, !19, !78, !78, !19, !19, !21}
!128 = !DISubprogram(name: "quote", scope: !129, file: !129, line: 44, type: !130, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !22)
!129 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!130 = !DISubroutineType(types: !131)
!131 = !{!19, !19}
!132 = !DISubprogram(name: "error", scope: !133, file: !133, line: 52, type: !134, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !22)
!133 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!134 = !DISubroutineType(types: !135)
!135 = !{null, !21, !21, !19, null}
!136 = !DISubprogram(name: "num_processors", scope: !6, file: !6, line: 42, type: !137, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !22)
!137 = !DISubroutineType(types: !138)
!138 = !{!78, !5}
!139 = !{!0}
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 1280, elements: !141)
!141 = !{!142}
!142 = !DISubrange(count: 5)
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(name: "Version", scope: !145, file: !146, line: 2, type: !19, isLocal: false, isDefinition: true)
!145 = distinct !DICompileUnit(language: DW_LANG_C99, file: !146, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !22, globals: !147, splitDebugInlining: false, nameTableKind: None)
!146 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!147 = !{!143}
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(name: "file_name", scope: !150, file: !151, line: 46, type: !19, isLocal: true, isDefinition: true)
!150 = distinct !DICompileUnit(language: DW_LANG_C99, file: !151, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !22, retainedTypes: !152, globals: !191, splitDebugInlining: false, nameTableKind: None)
!151 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!152 = !{!153, !13, !189, !132}
!153 = !DISubprogram(name: "close_stream", scope: !154, file: !154, line: 2, type: !155, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !22)
!154 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!155 = !DISubroutineType(types: !156)
!156 = !{!21, !157}
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !29, line: 49, size: 1728, elements: !159)
!159 = !{!160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !158, file: !29, line: 51, baseType: !21, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !158, file: !29, line: 54, baseType: !17, size: 64, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !158, file: !29, line: 55, baseType: !17, size: 64, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !158, file: !29, line: 56, baseType: !17, size: 64, offset: 192)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !158, file: !29, line: 57, baseType: !17, size: 64, offset: 256)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !158, file: !29, line: 58, baseType: !17, size: 64, offset: 320)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !158, file: !29, line: 59, baseType: !17, size: 64, offset: 384)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !158, file: !29, line: 60, baseType: !17, size: 64, offset: 448)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !158, file: !29, line: 61, baseType: !17, size: 64, offset: 512)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !158, file: !29, line: 64, baseType: !17, size: 64, offset: 576)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !158, file: !29, line: 65, baseType: !17, size: 64, offset: 640)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !158, file: !29, line: 66, baseType: !17, size: 64, offset: 704)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !158, file: !29, line: 68, baseType: !44, size: 64, offset: 768)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !158, file: !29, line: 70, baseType: !157, size: 64, offset: 832)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !158, file: !29, line: 72, baseType: !21, size: 32, offset: 896)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !158, file: !29, line: 73, baseType: !21, size: 32, offset: 928)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !158, file: !29, line: 74, baseType: !50, size: 64, offset: 960)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !158, file: !29, line: 77, baseType: !54, size: 16, offset: 1024)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !158, file: !29, line: 78, baseType: !56, size: 8, offset: 1040)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !158, file: !29, line: 79, baseType: !58, size: 8, offset: 1048)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !158, file: !29, line: 81, baseType: !62, size: 64, offset: 1088)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !158, file: !29, line: 89, baseType: !65, size: 64, offset: 1152)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !158, file: !29, line: 91, baseType: !67, size: 64, offset: 1216)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !158, file: !29, line: 92, baseType: !70, size: 64, offset: 1280)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !158, file: !29, line: 93, baseType: !157, size: 64, offset: 1344)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !158, file: !29, line: 94, baseType: !74, size: 64, offset: 1408)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !158, file: !29, line: 95, baseType: !76, size: 64, offset: 1472)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !158, file: !29, line: 96, baseType: !21, size: 32, offset: 1536)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !158, file: !29, line: 98, baseType: !81, size: 160, offset: 1568)
!189 = !DISubprogram(name: "quotearg_colon", scope: !190, file: !190, line: 391, type: !96, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !22)
!190 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!191 = !{!148, !192}
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !150, file: !151, line: 56, type: !194, isLocal: true, isDefinition: true)
!194 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "exit_failure", scope: !197, file: !198, line: 24, type: !200, isLocal: false, isDefinition: true)
!197 = distinct !DICompileUnit(language: DW_LANG_C99, file: !198, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !22, globals: !199, splitDebugInlining: false, nameTableKind: None)
!198 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!199 = !{!195}
!200 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !21)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "program_name", scope: !203, file: !204, line: 33, type: !19, isLocal: false, isDefinition: true)
!203 = distinct !DICompileUnit(language: DW_LANG_C99, file: !204, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !22, retainedTypes: !205, globals: !241, splitDebugInlining: false, nameTableKind: None)
!204 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!205 = !{!74, !206, !17}
!206 = !DISubprogram(name: "fputs", scope: !24, file: !24, line: 626, type: !207, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !22)
!207 = !DISubroutineType(types: !208)
!208 = !{!21, !19, !209}
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !29, line: 49, size: 1728, elements: !211)
!211 = !{!212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !210, file: !29, line: 51, baseType: !21, size: 32)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !210, file: !29, line: 54, baseType: !17, size: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !210, file: !29, line: 55, baseType: !17, size: 64, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !210, file: !29, line: 56, baseType: !17, size: 64, offset: 192)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !210, file: !29, line: 57, baseType: !17, size: 64, offset: 256)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !210, file: !29, line: 58, baseType: !17, size: 64, offset: 320)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !210, file: !29, line: 59, baseType: !17, size: 64, offset: 384)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !210, file: !29, line: 60, baseType: !17, size: 64, offset: 448)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !210, file: !29, line: 61, baseType: !17, size: 64, offset: 512)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !210, file: !29, line: 64, baseType: !17, size: 64, offset: 576)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !210, file: !29, line: 65, baseType: !17, size: 64, offset: 640)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !210, file: !29, line: 66, baseType: !17, size: 64, offset: 704)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !210, file: !29, line: 68, baseType: !44, size: 64, offset: 768)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !210, file: !29, line: 70, baseType: !209, size: 64, offset: 832)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !210, file: !29, line: 72, baseType: !21, size: 32, offset: 896)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !210, file: !29, line: 73, baseType: !21, size: 32, offset: 928)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !210, file: !29, line: 74, baseType: !50, size: 64, offset: 960)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !210, file: !29, line: 77, baseType: !54, size: 16, offset: 1024)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !210, file: !29, line: 78, baseType: !56, size: 8, offset: 1040)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !210, file: !29, line: 79, baseType: !58, size: 8, offset: 1048)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !210, file: !29, line: 81, baseType: !62, size: 64, offset: 1088)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !210, file: !29, line: 89, baseType: !65, size: 64, offset: 1152)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !210, file: !29, line: 91, baseType: !67, size: 64, offset: 1216)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !210, file: !29, line: 92, baseType: !70, size: 64, offset: 1280)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !210, file: !29, line: 93, baseType: !209, size: 64, offset: 1344)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !210, file: !29, line: 94, baseType: !74, size: 64, offset: 1408)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !210, file: !29, line: 95, baseType: !76, size: 64, offset: 1472)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !210, file: !29, line: 96, baseType: !21, size: 32, offset: 1536)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !210, file: !29, line: 98, baseType: !81, size: 160, offset: 1568)
!241 = !{!201}
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !244, file: !245, line: 85, type: !378, isLocal: false, isDefinition: true)
!244 = distinct !DICompileUnit(language: DW_LANG_C99, file: !245, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !246, retainedTypes: !280, globals: !351, splitDebugInlining: false, nameTableKind: None)
!245 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!246 = !{!247, !260, !265}
!247 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !190, line: 32, baseType: !7, size: 32, elements: !248)
!248 = !{!249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259}
!249 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!250 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!251 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!252 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!253 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!254 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!255 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!256 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!257 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!258 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!259 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!260 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !190, line: 242, baseType: !7, size: 32, elements: !261)
!261 = !{!262, !263, !264}
!262 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!263 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!264 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!265 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !266, line: 46, baseType: !7, size: 32, elements: !267)
!266 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!267 = !{!268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279}
!268 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!269 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!270 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!271 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!272 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!273 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!274 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!275 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!276 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!277 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!278 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!279 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!280 = !{!281, !287, !303, !306, !21, !54, !309, !76, !326, !330, !13, !336, !340, !17, !344, !347, !348}
!281 = !DISubprogram(name: "xmemdup", scope: !282, file: !282, line: 62, type: !283, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !22)
!282 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!283 = !DISubroutineType(types: !284)
!284 = !{!74, !285, !78}
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!287 = !DISubprogram(name: "quotearg_alloc_mem", scope: !190, file: !190, line: 342, type: !288, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !22)
!288 = !DISubroutineType(types: !289)
!289 = !{!17, !19, !78, !290, !291}
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !293)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !245, line: 65, size: 448, elements: !294)
!294 = !{!295, !296, !297, !301, !302}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !293, file: !245, line: 68, baseType: !247, size: 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !293, file: !245, line: 71, baseType: !21, size: 32, offset: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !293, file: !245, line: 75, baseType: !298, size: 256, offset: 64)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !299)
!299 = !{!300}
!300 = !DISubrange(count: 8)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !293, file: !245, line: 78, baseType: !19, size: 64, offset: 320)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !293, file: !245, line: 81, baseType: !19, size: 64, offset: 384)
!303 = !DISubprogram(name: "free", scope: !99, file: !99, line: 565, type: !304, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !22)
!304 = !DISubroutineType(types: !305)
!305 = !{null, !74}
!306 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !190, file: !190, line: 408, type: !307, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !22)
!307 = !DISubroutineType(types: !308)
!308 = !{!17, !21, !19, !19, !19, !78}
!309 = !DISubprogram(name: "rpl_mbrtowc", scope: !310, file: !310, line: 717, type: !311, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !22)
!310 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!311 = !DISubroutineType(types: !312)
!312 = !{!78, !118, !19, !78, !313}
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !315, line: 13, size: 64, elements: !316)
!315 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!316 = !{!317, !318}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !314, file: !315, line: 15, baseType: !21, size: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !314, file: !315, line: 20, baseType: !319, size: 32, offset: 32)
!319 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !314, file: !315, line: 16, size: 32, elements: !320)
!320 = !{!321, !322}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !319, file: !315, line: 18, baseType: !7, size: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !319, file: !315, line: 19, baseType: !323, size: 32)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 32, elements: !324)
!324 = !{!325}
!325 = !DISubrange(count: 4)
!326 = !DISubprogram(name: "iswprint", scope: !327, file: !327, line: 120, type: !328, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !22)
!327 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!328 = !DISubroutineType(types: !329)
!329 = !{!21, !7}
!330 = !DISubprogram(name: "mbsinit", scope: !331, file: !331, line: 292, type: !332, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !22)
!331 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!332 = !DISubroutineType(types: !333)
!333 = !{!21, !334}
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !314)
!336 = !DISubprogram(name: "locale_charset", scope: !337, file: !337, line: 35, type: !338, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !22)
!337 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!338 = !DISubroutineType(types: !339)
!339 = !{!19}
!340 = !DISubprogram(name: "c_strcasecmp", scope: !341, file: !341, line: 42, type: !342, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !22)
!341 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!342 = !DISubroutineType(types: !343)
!343 = !{!21, !19, !19}
!344 = !DISubprogram(name: "xmalloc", scope: !282, file: !282, line: 53, type: !345, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !22)
!345 = !DISubroutineType(types: !346)
!346 = !{!74, !78}
!347 = !DISubprogram(name: "xalloc_die", scope: !282, file: !282, line: 51, type: !103, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !22)
!348 = !DISubprogram(name: "xrealloc", scope: !282, file: !282, line: 59, type: !349, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !22)
!349 = !DISubroutineType(types: !350)
!350 = !{!74, !74, !78}
!351 = !{!242, !352, !358, !360, !362, !367, !374, !376}
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !244, file: !245, line: 101, type: !354, isLocal: false, isDefinition: true)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !355, size: 320, elements: !356)
!355 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !247)
!356 = !{!357}
!357 = !DISubrange(count: 10)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !244, file: !245, line: 1052, type: !293, isLocal: false, isDefinition: true)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !244, file: !245, line: 116, type: !293, isLocal: true, isDefinition: true)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "slot0", scope: !244, file: !245, line: 842, type: !364, isLocal: true, isDefinition: true)
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 2048, elements: !365)
!365 = !{!366}
!366 = !DISubrange(count: 256)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "slotvec", scope: !244, file: !245, line: 845, type: !369, isLocal: true, isDefinition: true)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !245, line: 834, size: 128, elements: !371)
!371 = !{!372, !373}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !370, file: !245, line: 836, baseType: !76, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !370, file: !245, line: 837, baseType: !17, size: 64, offset: 64)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(name: "nslots", scope: !244, file: !245, line: 843, type: !21, isLocal: true, isDefinition: true)
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(name: "slotvec0", scope: !244, file: !245, line: 844, type: !370, isLocal: true, isDefinition: true)
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !379, size: 704, elements: !380)
!379 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!380 = !{!381}
!381 = !DISubrange(count: 11)
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !384, file: !385, line: 26, type: !387, isLocal: false, isDefinition: true)
!384 = distinct !DICompileUnit(language: DW_LANG_C99, file: !385, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !22, globals: !386, splitDebugInlining: false, nameTableKind: None)
!385 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!386 = !{!382}
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 376, elements: !388)
!388 = !{!389}
!389 = !DISubrange(count: 47)
!390 = distinct !DICompileUnit(language: DW_LANG_C99, file: !391, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !392, retainedTypes: !611, splitDebugInlining: false, nameTableKind: None)
!391 = !DIFile(filename: "lib/nproc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!392 = !{!5, !393}
!393 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !394, line: 71, baseType: !7, size: 32, elements: !395)
!394 = !DIFile(filename: "/usr/include/bits/confname.h", directory: "")
!395 = !{!396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610}
!396 = !DIEnumerator(name: "_SC_ARG_MAX", value: 0, isUnsigned: true)
!397 = !DIEnumerator(name: "_SC_CHILD_MAX", value: 1, isUnsigned: true)
!398 = !DIEnumerator(name: "_SC_CLK_TCK", value: 2, isUnsigned: true)
!399 = !DIEnumerator(name: "_SC_NGROUPS_MAX", value: 3, isUnsigned: true)
!400 = !DIEnumerator(name: "_SC_OPEN_MAX", value: 4, isUnsigned: true)
!401 = !DIEnumerator(name: "_SC_STREAM_MAX", value: 5, isUnsigned: true)
!402 = !DIEnumerator(name: "_SC_TZNAME_MAX", value: 6, isUnsigned: true)
!403 = !DIEnumerator(name: "_SC_JOB_CONTROL", value: 7, isUnsigned: true)
!404 = !DIEnumerator(name: "_SC_SAVED_IDS", value: 8, isUnsigned: true)
!405 = !DIEnumerator(name: "_SC_REALTIME_SIGNALS", value: 9, isUnsigned: true)
!406 = !DIEnumerator(name: "_SC_PRIORITY_SCHEDULING", value: 10, isUnsigned: true)
!407 = !DIEnumerator(name: "_SC_TIMERS", value: 11, isUnsigned: true)
!408 = !DIEnumerator(name: "_SC_ASYNCHRONOUS_IO", value: 12, isUnsigned: true)
!409 = !DIEnumerator(name: "_SC_PRIORITIZED_IO", value: 13, isUnsigned: true)
!410 = !DIEnumerator(name: "_SC_SYNCHRONIZED_IO", value: 14, isUnsigned: true)
!411 = !DIEnumerator(name: "_SC_FSYNC", value: 15, isUnsigned: true)
!412 = !DIEnumerator(name: "_SC_MAPPED_FILES", value: 16, isUnsigned: true)
!413 = !DIEnumerator(name: "_SC_MEMLOCK", value: 17, isUnsigned: true)
!414 = !DIEnumerator(name: "_SC_MEMLOCK_RANGE", value: 18, isUnsigned: true)
!415 = !DIEnumerator(name: "_SC_MEMORY_PROTECTION", value: 19, isUnsigned: true)
!416 = !DIEnumerator(name: "_SC_MESSAGE_PASSING", value: 20, isUnsigned: true)
!417 = !DIEnumerator(name: "_SC_SEMAPHORES", value: 21, isUnsigned: true)
!418 = !DIEnumerator(name: "_SC_SHARED_MEMORY_OBJECTS", value: 22, isUnsigned: true)
!419 = !DIEnumerator(name: "_SC_AIO_LISTIO_MAX", value: 23, isUnsigned: true)
!420 = !DIEnumerator(name: "_SC_AIO_MAX", value: 24, isUnsigned: true)
!421 = !DIEnumerator(name: "_SC_AIO_PRIO_DELTA_MAX", value: 25, isUnsigned: true)
!422 = !DIEnumerator(name: "_SC_DELAYTIMER_MAX", value: 26, isUnsigned: true)
!423 = !DIEnumerator(name: "_SC_MQ_OPEN_MAX", value: 27, isUnsigned: true)
!424 = !DIEnumerator(name: "_SC_MQ_PRIO_MAX", value: 28, isUnsigned: true)
!425 = !DIEnumerator(name: "_SC_VERSION", value: 29, isUnsigned: true)
!426 = !DIEnumerator(name: "_SC_PAGESIZE", value: 30, isUnsigned: true)
!427 = !DIEnumerator(name: "_SC_RTSIG_MAX", value: 31, isUnsigned: true)
!428 = !DIEnumerator(name: "_SC_SEM_NSEMS_MAX", value: 32, isUnsigned: true)
!429 = !DIEnumerator(name: "_SC_SEM_VALUE_MAX", value: 33, isUnsigned: true)
!430 = !DIEnumerator(name: "_SC_SIGQUEUE_MAX", value: 34, isUnsigned: true)
!431 = !DIEnumerator(name: "_SC_TIMER_MAX", value: 35, isUnsigned: true)
!432 = !DIEnumerator(name: "_SC_BC_BASE_MAX", value: 36, isUnsigned: true)
!433 = !DIEnumerator(name: "_SC_BC_DIM_MAX", value: 37, isUnsigned: true)
!434 = !DIEnumerator(name: "_SC_BC_SCALE_MAX", value: 38, isUnsigned: true)
!435 = !DIEnumerator(name: "_SC_BC_STRING_MAX", value: 39, isUnsigned: true)
!436 = !DIEnumerator(name: "_SC_COLL_WEIGHTS_MAX", value: 40, isUnsigned: true)
!437 = !DIEnumerator(name: "_SC_EQUIV_CLASS_MAX", value: 41, isUnsigned: true)
!438 = !DIEnumerator(name: "_SC_EXPR_NEST_MAX", value: 42, isUnsigned: true)
!439 = !DIEnumerator(name: "_SC_LINE_MAX", value: 43, isUnsigned: true)
!440 = !DIEnumerator(name: "_SC_RE_DUP_MAX", value: 44, isUnsigned: true)
!441 = !DIEnumerator(name: "_SC_CHARCLASS_NAME_MAX", value: 45, isUnsigned: true)
!442 = !DIEnumerator(name: "_SC_2_VERSION", value: 46, isUnsigned: true)
!443 = !DIEnumerator(name: "_SC_2_C_BIND", value: 47, isUnsigned: true)
!444 = !DIEnumerator(name: "_SC_2_C_DEV", value: 48, isUnsigned: true)
!445 = !DIEnumerator(name: "_SC_2_FORT_DEV", value: 49, isUnsigned: true)
!446 = !DIEnumerator(name: "_SC_2_FORT_RUN", value: 50, isUnsigned: true)
!447 = !DIEnumerator(name: "_SC_2_SW_DEV", value: 51, isUnsigned: true)
!448 = !DIEnumerator(name: "_SC_2_LOCALEDEF", value: 52, isUnsigned: true)
!449 = !DIEnumerator(name: "_SC_PII", value: 53, isUnsigned: true)
!450 = !DIEnumerator(name: "_SC_PII_XTI", value: 54, isUnsigned: true)
!451 = !DIEnumerator(name: "_SC_PII_SOCKET", value: 55, isUnsigned: true)
!452 = !DIEnumerator(name: "_SC_PII_INTERNET", value: 56, isUnsigned: true)
!453 = !DIEnumerator(name: "_SC_PII_OSI", value: 57, isUnsigned: true)
!454 = !DIEnumerator(name: "_SC_POLL", value: 58, isUnsigned: true)
!455 = !DIEnumerator(name: "_SC_SELECT", value: 59, isUnsigned: true)
!456 = !DIEnumerator(name: "_SC_UIO_MAXIOV", value: 60, isUnsigned: true)
!457 = !DIEnumerator(name: "_SC_IOV_MAX", value: 60, isUnsigned: true)
!458 = !DIEnumerator(name: "_SC_PII_INTERNET_STREAM", value: 61, isUnsigned: true)
!459 = !DIEnumerator(name: "_SC_PII_INTERNET_DGRAM", value: 62, isUnsigned: true)
!460 = !DIEnumerator(name: "_SC_PII_OSI_COTS", value: 63, isUnsigned: true)
!461 = !DIEnumerator(name: "_SC_PII_OSI_CLTS", value: 64, isUnsigned: true)
!462 = !DIEnumerator(name: "_SC_PII_OSI_M", value: 65, isUnsigned: true)
!463 = !DIEnumerator(name: "_SC_T_IOV_MAX", value: 66, isUnsigned: true)
!464 = !DIEnumerator(name: "_SC_THREADS", value: 67, isUnsigned: true)
!465 = !DIEnumerator(name: "_SC_THREAD_SAFE_FUNCTIONS", value: 68, isUnsigned: true)
!466 = !DIEnumerator(name: "_SC_GETGR_R_SIZE_MAX", value: 69, isUnsigned: true)
!467 = !DIEnumerator(name: "_SC_GETPW_R_SIZE_MAX", value: 70, isUnsigned: true)
!468 = !DIEnumerator(name: "_SC_LOGIN_NAME_MAX", value: 71, isUnsigned: true)
!469 = !DIEnumerator(name: "_SC_TTY_NAME_MAX", value: 72, isUnsigned: true)
!470 = !DIEnumerator(name: "_SC_THREAD_DESTRUCTOR_ITERATIONS", value: 73, isUnsigned: true)
!471 = !DIEnumerator(name: "_SC_THREAD_KEYS_MAX", value: 74, isUnsigned: true)
!472 = !DIEnumerator(name: "_SC_THREAD_STACK_MIN", value: 75, isUnsigned: true)
!473 = !DIEnumerator(name: "_SC_THREAD_THREADS_MAX", value: 76, isUnsigned: true)
!474 = !DIEnumerator(name: "_SC_THREAD_ATTR_STACKADDR", value: 77, isUnsigned: true)
!475 = !DIEnumerator(name: "_SC_THREAD_ATTR_STACKSIZE", value: 78, isUnsigned: true)
!476 = !DIEnumerator(name: "_SC_THREAD_PRIORITY_SCHEDULING", value: 79, isUnsigned: true)
!477 = !DIEnumerator(name: "_SC_THREAD_PRIO_INHERIT", value: 80, isUnsigned: true)
!478 = !DIEnumerator(name: "_SC_THREAD_PRIO_PROTECT", value: 81, isUnsigned: true)
!479 = !DIEnumerator(name: "_SC_THREAD_PROCESS_SHARED", value: 82, isUnsigned: true)
!480 = !DIEnumerator(name: "_SC_NPROCESSORS_CONF", value: 83, isUnsigned: true)
!481 = !DIEnumerator(name: "_SC_NPROCESSORS_ONLN", value: 84, isUnsigned: true)
!482 = !DIEnumerator(name: "_SC_PHYS_PAGES", value: 85, isUnsigned: true)
!483 = !DIEnumerator(name: "_SC_AVPHYS_PAGES", value: 86, isUnsigned: true)
!484 = !DIEnumerator(name: "_SC_ATEXIT_MAX", value: 87, isUnsigned: true)
!485 = !DIEnumerator(name: "_SC_PASS_MAX", value: 88, isUnsigned: true)
!486 = !DIEnumerator(name: "_SC_XOPEN_VERSION", value: 89, isUnsigned: true)
!487 = !DIEnumerator(name: "_SC_XOPEN_XCU_VERSION", value: 90, isUnsigned: true)
!488 = !DIEnumerator(name: "_SC_XOPEN_UNIX", value: 91, isUnsigned: true)
!489 = !DIEnumerator(name: "_SC_XOPEN_CRYPT", value: 92, isUnsigned: true)
!490 = !DIEnumerator(name: "_SC_XOPEN_ENH_I18N", value: 93, isUnsigned: true)
!491 = !DIEnumerator(name: "_SC_XOPEN_SHM", value: 94, isUnsigned: true)
!492 = !DIEnumerator(name: "_SC_2_CHAR_TERM", value: 95, isUnsigned: true)
!493 = !DIEnumerator(name: "_SC_2_C_VERSION", value: 96, isUnsigned: true)
!494 = !DIEnumerator(name: "_SC_2_UPE", value: 97, isUnsigned: true)
!495 = !DIEnumerator(name: "_SC_XOPEN_XPG2", value: 98, isUnsigned: true)
!496 = !DIEnumerator(name: "_SC_XOPEN_XPG3", value: 99, isUnsigned: true)
!497 = !DIEnumerator(name: "_SC_XOPEN_XPG4", value: 100, isUnsigned: true)
!498 = !DIEnumerator(name: "_SC_CHAR_BIT", value: 101, isUnsigned: true)
!499 = !DIEnumerator(name: "_SC_CHAR_MAX", value: 102, isUnsigned: true)
!500 = !DIEnumerator(name: "_SC_CHAR_MIN", value: 103, isUnsigned: true)
!501 = !DIEnumerator(name: "_SC_INT_MAX", value: 104, isUnsigned: true)
!502 = !DIEnumerator(name: "_SC_INT_MIN", value: 105, isUnsigned: true)
!503 = !DIEnumerator(name: "_SC_LONG_BIT", value: 106, isUnsigned: true)
!504 = !DIEnumerator(name: "_SC_WORD_BIT", value: 107, isUnsigned: true)
!505 = !DIEnumerator(name: "_SC_MB_LEN_MAX", value: 108, isUnsigned: true)
!506 = !DIEnumerator(name: "_SC_NZERO", value: 109, isUnsigned: true)
!507 = !DIEnumerator(name: "_SC_SSIZE_MAX", value: 110, isUnsigned: true)
!508 = !DIEnumerator(name: "_SC_SCHAR_MAX", value: 111, isUnsigned: true)
!509 = !DIEnumerator(name: "_SC_SCHAR_MIN", value: 112, isUnsigned: true)
!510 = !DIEnumerator(name: "_SC_SHRT_MAX", value: 113, isUnsigned: true)
!511 = !DIEnumerator(name: "_SC_SHRT_MIN", value: 114, isUnsigned: true)
!512 = !DIEnumerator(name: "_SC_UCHAR_MAX", value: 115, isUnsigned: true)
!513 = !DIEnumerator(name: "_SC_UINT_MAX", value: 116, isUnsigned: true)
!514 = !DIEnumerator(name: "_SC_ULONG_MAX", value: 117, isUnsigned: true)
!515 = !DIEnumerator(name: "_SC_USHRT_MAX", value: 118, isUnsigned: true)
!516 = !DIEnumerator(name: "_SC_NL_ARGMAX", value: 119, isUnsigned: true)
!517 = !DIEnumerator(name: "_SC_NL_LANGMAX", value: 120, isUnsigned: true)
!518 = !DIEnumerator(name: "_SC_NL_MSGMAX", value: 121, isUnsigned: true)
!519 = !DIEnumerator(name: "_SC_NL_NMAX", value: 122, isUnsigned: true)
!520 = !DIEnumerator(name: "_SC_NL_SETMAX", value: 123, isUnsigned: true)
!521 = !DIEnumerator(name: "_SC_NL_TEXTMAX", value: 124, isUnsigned: true)
!522 = !DIEnumerator(name: "_SC_XBS5_ILP32_OFF32", value: 125, isUnsigned: true)
!523 = !DIEnumerator(name: "_SC_XBS5_ILP32_OFFBIG", value: 126, isUnsigned: true)
!524 = !DIEnumerator(name: "_SC_XBS5_LP64_OFF64", value: 127, isUnsigned: true)
!525 = !DIEnumerator(name: "_SC_XBS5_LPBIG_OFFBIG", value: 128, isUnsigned: true)
!526 = !DIEnumerator(name: "_SC_XOPEN_LEGACY", value: 129, isUnsigned: true)
!527 = !DIEnumerator(name: "_SC_XOPEN_REALTIME", value: 130, isUnsigned: true)
!528 = !DIEnumerator(name: "_SC_XOPEN_REALTIME_THREADS", value: 131, isUnsigned: true)
!529 = !DIEnumerator(name: "_SC_ADVISORY_INFO", value: 132, isUnsigned: true)
!530 = !DIEnumerator(name: "_SC_BARRIERS", value: 133, isUnsigned: true)
!531 = !DIEnumerator(name: "_SC_BASE", value: 134, isUnsigned: true)
!532 = !DIEnumerator(name: "_SC_C_LANG_SUPPORT", value: 135, isUnsigned: true)
!533 = !DIEnumerator(name: "_SC_C_LANG_SUPPORT_R", value: 136, isUnsigned: true)
!534 = !DIEnumerator(name: "_SC_CLOCK_SELECTION", value: 137, isUnsigned: true)
!535 = !DIEnumerator(name: "_SC_CPUTIME", value: 138, isUnsigned: true)
!536 = !DIEnumerator(name: "_SC_THREAD_CPUTIME", value: 139, isUnsigned: true)
!537 = !DIEnumerator(name: "_SC_DEVICE_IO", value: 140, isUnsigned: true)
!538 = !DIEnumerator(name: "_SC_DEVICE_SPECIFIC", value: 141, isUnsigned: true)
!539 = !DIEnumerator(name: "_SC_DEVICE_SPECIFIC_R", value: 142, isUnsigned: true)
!540 = !DIEnumerator(name: "_SC_FD_MGMT", value: 143, isUnsigned: true)
!541 = !DIEnumerator(name: "_SC_FIFO", value: 144, isUnsigned: true)
!542 = !DIEnumerator(name: "_SC_PIPE", value: 145, isUnsigned: true)
!543 = !DIEnumerator(name: "_SC_FILE_ATTRIBUTES", value: 146, isUnsigned: true)
!544 = !DIEnumerator(name: "_SC_FILE_LOCKING", value: 147, isUnsigned: true)
!545 = !DIEnumerator(name: "_SC_FILE_SYSTEM", value: 148, isUnsigned: true)
!546 = !DIEnumerator(name: "_SC_MONOTONIC_CLOCK", value: 149, isUnsigned: true)
!547 = !DIEnumerator(name: "_SC_MULTI_PROCESS", value: 150, isUnsigned: true)
!548 = !DIEnumerator(name: "_SC_SINGLE_PROCESS", value: 151, isUnsigned: true)
!549 = !DIEnumerator(name: "_SC_NETWORKING", value: 152, isUnsigned: true)
!550 = !DIEnumerator(name: "_SC_READER_WRITER_LOCKS", value: 153, isUnsigned: true)
!551 = !DIEnumerator(name: "_SC_SPIN_LOCKS", value: 154, isUnsigned: true)
!552 = !DIEnumerator(name: "_SC_REGEXP", value: 155, isUnsigned: true)
!553 = !DIEnumerator(name: "_SC_REGEX_VERSION", value: 156, isUnsigned: true)
!554 = !DIEnumerator(name: "_SC_SHELL", value: 157, isUnsigned: true)
!555 = !DIEnumerator(name: "_SC_SIGNALS", value: 158, isUnsigned: true)
!556 = !DIEnumerator(name: "_SC_SPAWN", value: 159, isUnsigned: true)
!557 = !DIEnumerator(name: "_SC_SPORADIC_SERVER", value: 160, isUnsigned: true)
!558 = !DIEnumerator(name: "_SC_THREAD_SPORADIC_SERVER", value: 161, isUnsigned: true)
!559 = !DIEnumerator(name: "_SC_SYSTEM_DATABASE", value: 162, isUnsigned: true)
!560 = !DIEnumerator(name: "_SC_SYSTEM_DATABASE_R", value: 163, isUnsigned: true)
!561 = !DIEnumerator(name: "_SC_TIMEOUTS", value: 164, isUnsigned: true)
!562 = !DIEnumerator(name: "_SC_TYPED_MEMORY_OBJECTS", value: 165, isUnsigned: true)
!563 = !DIEnumerator(name: "_SC_USER_GROUPS", value: 166, isUnsigned: true)
!564 = !DIEnumerator(name: "_SC_USER_GROUPS_R", value: 167, isUnsigned: true)
!565 = !DIEnumerator(name: "_SC_2_PBS", value: 168, isUnsigned: true)
!566 = !DIEnumerator(name: "_SC_2_PBS_ACCOUNTING", value: 169, isUnsigned: true)
!567 = !DIEnumerator(name: "_SC_2_PBS_LOCATE", value: 170, isUnsigned: true)
!568 = !DIEnumerator(name: "_SC_2_PBS_MESSAGE", value: 171, isUnsigned: true)
!569 = !DIEnumerator(name: "_SC_2_PBS_TRACK", value: 172, isUnsigned: true)
!570 = !DIEnumerator(name: "_SC_SYMLOOP_MAX", value: 173, isUnsigned: true)
!571 = !DIEnumerator(name: "_SC_STREAMS", value: 174, isUnsigned: true)
!572 = !DIEnumerator(name: "_SC_2_PBS_CHECKPOINT", value: 175, isUnsigned: true)
!573 = !DIEnumerator(name: "_SC_V6_ILP32_OFF32", value: 176, isUnsigned: true)
!574 = !DIEnumerator(name: "_SC_V6_ILP32_OFFBIG", value: 177, isUnsigned: true)
!575 = !DIEnumerator(name: "_SC_V6_LP64_OFF64", value: 178, isUnsigned: true)
!576 = !DIEnumerator(name: "_SC_V6_LPBIG_OFFBIG", value: 179, isUnsigned: true)
!577 = !DIEnumerator(name: "_SC_HOST_NAME_MAX", value: 180, isUnsigned: true)
!578 = !DIEnumerator(name: "_SC_TRACE", value: 181, isUnsigned: true)
!579 = !DIEnumerator(name: "_SC_TRACE_EVENT_FILTER", value: 182, isUnsigned: true)
!580 = !DIEnumerator(name: "_SC_TRACE_INHERIT", value: 183, isUnsigned: true)
!581 = !DIEnumerator(name: "_SC_TRACE_LOG", value: 184, isUnsigned: true)
!582 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_SIZE", value: 185, isUnsigned: true)
!583 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_ASSOC", value: 186, isUnsigned: true)
!584 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_LINESIZE", value: 187, isUnsigned: true)
!585 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_SIZE", value: 188, isUnsigned: true)
!586 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_ASSOC", value: 189, isUnsigned: true)
!587 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_LINESIZE", value: 190, isUnsigned: true)
!588 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_SIZE", value: 191, isUnsigned: true)
!589 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_ASSOC", value: 192, isUnsigned: true)
!590 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_LINESIZE", value: 193, isUnsigned: true)
!591 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_SIZE", value: 194, isUnsigned: true)
!592 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_ASSOC", value: 195, isUnsigned: true)
!593 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_LINESIZE", value: 196, isUnsigned: true)
!594 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_SIZE", value: 197, isUnsigned: true)
!595 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_ASSOC", value: 198, isUnsigned: true)
!596 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_LINESIZE", value: 199, isUnsigned: true)
!597 = !DIEnumerator(name: "_SC_IPV6", value: 235, isUnsigned: true)
!598 = !DIEnumerator(name: "_SC_RAW_SOCKETS", value: 236, isUnsigned: true)
!599 = !DIEnumerator(name: "_SC_V7_ILP32_OFF32", value: 237, isUnsigned: true)
!600 = !DIEnumerator(name: "_SC_V7_ILP32_OFFBIG", value: 238, isUnsigned: true)
!601 = !DIEnumerator(name: "_SC_V7_LP64_OFF64", value: 239, isUnsigned: true)
!602 = !DIEnumerator(name: "_SC_V7_LPBIG_OFFBIG", value: 240, isUnsigned: true)
!603 = !DIEnumerator(name: "_SC_SS_REPL_MAX", value: 241, isUnsigned: true)
!604 = !DIEnumerator(name: "_SC_TRACE_EVENT_NAME_MAX", value: 242, isUnsigned: true)
!605 = !DIEnumerator(name: "_SC_TRACE_NAME_MAX", value: 243, isUnsigned: true)
!606 = !DIEnumerator(name: "_SC_TRACE_SYS_MAX", value: 244, isUnsigned: true)
!607 = !DIEnumerator(name: "_SC_TRACE_USER_EVENT_MAX", value: 245, isUnsigned: true)
!608 = !DIEnumerator(name: "_SC_XOPEN_STREAMS", value: 246, isUnsigned: true)
!609 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_INHERIT", value: 247, isUnsigned: true)
!610 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_PROTECT", value: 248, isUnsigned: true)
!611 = !{!612, !74, !613, !617}
!612 = !DISubprogram(name: "getenv", scope: !99, file: !99, line: 634, type: !96, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !22)
!613 = !DISubprogram(name: "sysconf", scope: !614, file: !614, line: 619, type: !615, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !22)
!614 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!615 = !DISubroutineType(types: !616)
!616 = !{!52, !21}
!617 = !DISubprogram(name: "sched_getaffinity", scope: !618, file: !618, line: 125, type: !619, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !22)
!618 = !DIFile(filename: "/usr/include/sched.h", directory: "")
!619 = !DISubroutineType(types: !620)
!620 = !{!21, !21, !78, !621}
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !623, line: 39, size: 1024, elements: !624)
!623 = !DIFile(filename: "/usr/include/bits/cpu-set.h", directory: "")
!624 = !{!625}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "__bits", scope: !622, file: !623, line: 41, baseType: !626, size: 1024)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !627, size: 1024, elements: !628)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "__cpu_mask", file: !623, line: 32, baseType: !78)
!628 = !{!629}
!629 = !DISubrange(count: 16)
!630 = distinct !DICompileUnit(language: DW_LANG_C99, file: !631, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !632, retainedTypes: !636, splitDebugInlining: false, nameTableKind: None)
!631 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!632 = !{!633}
!633 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !631, line: 40, baseType: !7, size: 32, elements: !634)
!634 = !{!635}
!635 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!636 = !{!13, !637, !74}
!637 = !DISubprogram(name: "fputs_unlocked", scope: !24, file: !24, line: 662, type: !638, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !22)
!638 = !DISubroutineType(types: !639)
!639 = !{!21, !19, !640}
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !29, line: 49, size: 1728, elements: !642)
!642 = !{!643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !641, file: !29, line: 51, baseType: !21, size: 32)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !641, file: !29, line: 54, baseType: !17, size: 64, offset: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !641, file: !29, line: 55, baseType: !17, size: 64, offset: 128)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !641, file: !29, line: 56, baseType: !17, size: 64, offset: 192)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !641, file: !29, line: 57, baseType: !17, size: 64, offset: 256)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !641, file: !29, line: 58, baseType: !17, size: 64, offset: 320)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !641, file: !29, line: 59, baseType: !17, size: 64, offset: 384)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !641, file: !29, line: 60, baseType: !17, size: 64, offset: 448)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !641, file: !29, line: 61, baseType: !17, size: 64, offset: 512)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !641, file: !29, line: 64, baseType: !17, size: 64, offset: 576)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !641, file: !29, line: 65, baseType: !17, size: 64, offset: 640)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !641, file: !29, line: 66, baseType: !17, size: 64, offset: 704)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !641, file: !29, line: 68, baseType: !44, size: 64, offset: 768)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !641, file: !29, line: 70, baseType: !640, size: 64, offset: 832)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !641, file: !29, line: 72, baseType: !21, size: 32, offset: 896)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !641, file: !29, line: 73, baseType: !21, size: 32, offset: 928)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !641, file: !29, line: 74, baseType: !50, size: 64, offset: 960)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !641, file: !29, line: 77, baseType: !54, size: 16, offset: 1024)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !641, file: !29, line: 78, baseType: !56, size: 8, offset: 1040)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !641, file: !29, line: 79, baseType: !58, size: 8, offset: 1048)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !641, file: !29, line: 81, baseType: !62, size: 64, offset: 1088)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !641, file: !29, line: 89, baseType: !65, size: 64, offset: 1152)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !641, file: !29, line: 91, baseType: !67, size: 64, offset: 1216)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !641, file: !29, line: 92, baseType: !70, size: 64, offset: 1280)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !641, file: !29, line: 93, baseType: !640, size: 64, offset: 1344)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !641, file: !29, line: 94, baseType: !74, size: 64, offset: 1408)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !641, file: !29, line: 95, baseType: !76, size: 64, offset: 1472)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !641, file: !29, line: 96, baseType: !21, size: 32, offset: 1536)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !641, file: !29, line: 98, baseType: !81, size: 160, offset: 1568)
!672 = distinct !DICompileUnit(language: DW_LANG_C99, file: !673, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !674, retainedTypes: !687, splitDebugInlining: false, nameTableKind: None)
!673 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!674 = !{!675}
!675 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !676, file: !282, line: 186, baseType: !7, size: 32, elements: !685)
!676 = distinct !DISubprogram(name: "x2nrealloc", scope: !282, file: !282, line: 174, type: !677, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !672, retainedNodes: !680)
!677 = !DISubroutineType(types: !678)
!678 = !{!74, !74, !679, !76}
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!680 = !{!681, !682, !683, !684}
!681 = !DILocalVariable(name: "p", arg: 1, scope: !676, file: !282, line: 174, type: !74)
!682 = !DILocalVariable(name: "pn", arg: 2, scope: !676, file: !282, line: 174, type: !679)
!683 = !DILocalVariable(name: "s", arg: 3, scope: !676, file: !282, line: 174, type: !76)
!684 = !DILocalVariable(name: "n", scope: !676, file: !282, line: 176, type: !76)
!685 = !{!686}
!686 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!687 = !{!76, !347, !344, !348, !17, !303, !74, !688, !691}
!688 = !DISubprogram(name: "xcalloc", scope: !282, file: !282, line: 57, type: !689, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !22)
!689 = !DISubroutineType(types: !690)
!690 = !{!74, !78, !78}
!691 = !DISubprogram(name: "rpl_calloc", scope: !692, file: !692, line: 688, type: !689, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !22)
!692 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!693 = distinct !DICompileUnit(language: DW_LANG_C99, file: !694, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !22, retainedTypes: !695, splitDebugInlining: false, nameTableKind: None)
!694 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!695 = !{!13, !132}
!696 = distinct !DICompileUnit(language: DW_LANG_C99, file: !697, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !698, retainedTypes: !707, splitDebugInlining: false, nameTableKind: None)
!697 = !DIFile(filename: "lib/xdectoumax.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!698 = !{!699}
!699 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !700, line: 25, baseType: !7, size: 32, elements: !701)
!700 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!701 = !{!702, !703, !704, !705, !706}
!702 = !DIEnumerator(name: "LONGINT_OK", value: 0, isUnsigned: true)
!703 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1, isUnsigned: true)
!704 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2, isUnsigned: true)
!705 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3, isUnsigned: true)
!706 = !DIEnumerator(name: "LONGINT_INVALID", value: 4, isUnsigned: true)
!707 = !{!708, !128, !132}
!708 = !DISubprogram(name: "xstrtoumax", scope: !700, file: !700, line: 48, type: !709, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !22)
!709 = !DISubroutineType(types: !710)
!710 = !{!699, !19, !711, !21, !290, !19}
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!712 = distinct !DICompileUnit(language: DW_LANG_C99, file: !713, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !714, retainedTypes: !715, splitDebugInlining: false, nameTableKind: None)
!713 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!714 = !{!699, !265}
!715 = !{!21, !54}
!716 = distinct !DICompileUnit(language: DW_LANG_C99, file: !717, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !22, retainedTypes: !718, splitDebugInlining: false, nameTableKind: None)
!717 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!718 = !{!74}
!719 = distinct !DICompileUnit(language: DW_LANG_C99, file: !720, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !22, retainedTypes: !721, splitDebugInlining: false, nameTableKind: None)
!720 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!721 = !{!722, !76, !734}
!722 = !DISubprogram(name: "mbrtowc", scope: !331, file: !331, line: 296, type: !723, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !22)
!723 = !DISubroutineType(types: !724)
!724 = !{!78, !118, !19, !78, !725}
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !315, line: 13, size: 64, elements: !727)
!727 = !{!728, !729}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !726, file: !315, line: 15, baseType: !21, size: 32)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !726, file: !315, line: 20, baseType: !730, size: 32, offset: 32)
!730 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !726, file: !315, line: 16, size: 32, elements: !731)
!731 = !{!732, !733}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !730, file: !315, line: 18, baseType: !7, size: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !730, file: !315, line: 19, baseType: !323, size: 32)
!734 = !DISubprogram(name: "hard_locale", scope: !735, file: !735, line: 26, type: !736, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !22)
!735 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!736 = !DISubroutineType(types: !737)
!737 = !{!194, !21}
!738 = distinct !DICompileUnit(language: DW_LANG_C99, file: !739, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !22, retainedTypes: !740, splitDebugInlining: false, nameTableKind: None)
!739 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!740 = !{!741}
!741 = !DISubprogram(name: "rpl_fclose", scope: !742, file: !742, line: 672, type: !743, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !22)
!742 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!743 = !DISubroutineType(types: !744)
!744 = !{!21, !745}
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !29, line: 49, size: 1728, elements: !747)
!747 = !{!748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !746, file: !29, line: 51, baseType: !21, size: 32)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !746, file: !29, line: 54, baseType: !17, size: 64, offset: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !746, file: !29, line: 55, baseType: !17, size: 64, offset: 128)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !746, file: !29, line: 56, baseType: !17, size: 64, offset: 192)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !746, file: !29, line: 57, baseType: !17, size: 64, offset: 256)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !746, file: !29, line: 58, baseType: !17, size: 64, offset: 320)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !746, file: !29, line: 59, baseType: !17, size: 64, offset: 384)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !746, file: !29, line: 60, baseType: !17, size: 64, offset: 448)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !746, file: !29, line: 61, baseType: !17, size: 64, offset: 512)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !746, file: !29, line: 64, baseType: !17, size: 64, offset: 576)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !746, file: !29, line: 65, baseType: !17, size: 64, offset: 640)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !746, file: !29, line: 66, baseType: !17, size: 64, offset: 704)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !746, file: !29, line: 68, baseType: !44, size: 64, offset: 768)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !746, file: !29, line: 70, baseType: !745, size: 64, offset: 832)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !746, file: !29, line: 72, baseType: !21, size: 32, offset: 896)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !746, file: !29, line: 73, baseType: !21, size: 32, offset: 928)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !746, file: !29, line: 74, baseType: !50, size: 64, offset: 960)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !746, file: !29, line: 77, baseType: !54, size: 16, offset: 1024)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !746, file: !29, line: 78, baseType: !56, size: 8, offset: 1040)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !746, file: !29, line: 79, baseType: !58, size: 8, offset: 1048)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !746, file: !29, line: 81, baseType: !62, size: 64, offset: 1088)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !746, file: !29, line: 89, baseType: !65, size: 64, offset: 1152)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !746, file: !29, line: 91, baseType: !67, size: 64, offset: 1216)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !746, file: !29, line: 92, baseType: !70, size: 64, offset: 1280)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !746, file: !29, line: 93, baseType: !745, size: 64, offset: 1344)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !746, file: !29, line: 94, baseType: !74, size: 64, offset: 1408)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !746, file: !29, line: 95, baseType: !76, size: 64, offset: 1472)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !746, file: !29, line: 96, baseType: !21, size: 32, offset: 1536)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !746, file: !29, line: 98, baseType: !81, size: 160, offset: 1568)
!777 = distinct !DICompileUnit(language: DW_LANG_C99, file: !778, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !22, retainedTypes: !779, splitDebugInlining: false, nameTableKind: None)
!778 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!779 = !{!780}
!780 = !DISubprogram(name: "setlocale_null_r", scope: !781, file: !781, line: 64, type: !782, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !22)
!781 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!782 = !DISubroutineType(types: !783)
!783 = !{!21, !21, !17, !78}
!784 = distinct !DICompileUnit(language: DW_LANG_C99, file: !785, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !786, retainedTypes: !1173, splitDebugInlining: false, nameTableKind: None)
!785 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!786 = !{!787}
!787 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !788, line: 41, baseType: !7, size: 32, elements: !789)
!788 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!789 = !{!790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172}
!790 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!791 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!792 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!793 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!794 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!795 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!796 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!797 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!798 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!799 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!800 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!801 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!802 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!803 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!804 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!805 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!806 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!807 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!808 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!809 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!810 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!811 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!812 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!813 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!814 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!815 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!816 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!817 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!818 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!819 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!820 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!821 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!822 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!823 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!824 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!825 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!826 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!827 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!828 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!829 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!830 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!831 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!832 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!833 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!834 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!835 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!836 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!837 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!838 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!839 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!840 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!841 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!842 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!843 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!844 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!845 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!846 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!847 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!884 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!885 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!886 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!887 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!894 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!895 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!896 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!898 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!899 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!900 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!901 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!902 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!903 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!904 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!905 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!906 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!907 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!908 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!909 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!910 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!911 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!912 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!913 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!914 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!915 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!916 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!917 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!918 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!919 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!920 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!921 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!922 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!923 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!924 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!925 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!926 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!927 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!928 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!929 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!930 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!931 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!932 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!933 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!934 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!935 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!936 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!937 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!938 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!939 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!940 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!941 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!942 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!943 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!944 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!945 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!946 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!947 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!948 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!949 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!950 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!951 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!952 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!953 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!954 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!955 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!956 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!957 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!958 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!959 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!960 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!961 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!962 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!963 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!964 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!965 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!966 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!967 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!968 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!969 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!970 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!971 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!972 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!973 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!974 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!975 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!976 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!977 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!978 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!979 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!980 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!981 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!982 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!983 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!984 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!985 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!986 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!987 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!988 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!989 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!990 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!991 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!992 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!993 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!994 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!995 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!996 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!997 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!998 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!999 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!1000 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!1001 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!1002 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!1003 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!1004 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!1005 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!1006 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!1007 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!1008 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!1009 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!1010 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!1011 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!1012 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!1013 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!1014 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!1015 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!1016 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!1017 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!1018 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!1019 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!1020 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!1021 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!1022 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!1023 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!1024 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!1025 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!1026 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!1027 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!1028 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!1029 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!1030 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!1031 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!1032 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!1033 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!1034 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!1035 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!1036 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!1037 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!1038 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!1039 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!1040 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!1041 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!1042 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!1043 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!1044 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!1045 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!1046 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!1047 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!1048 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!1049 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!1050 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!1051 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!1052 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!1053 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!1054 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
