; ModuleID = 'coreutils-8.32/src/numfmt.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.field_range_pair = type { i64, i64 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [35 x i8] c"Usage: %s [OPTION]... [NUMBER]...\0A\00", align 1
@.str.2 = private unnamed_addr constant [79 x i8] c"Reformat NUMBER(s), or the numbers from standard input if none are specified.\0A\00", align 1
@stdout = external local_unnamed_addr global %struct._IO_FILE*, align 8

!416 = !DIEnumerator(name: "scale_SI", value: 2, isUnsigned: true)
!417 = !DIEnumerator(name: "scale_IEC", value: 3, isUnsigned: true)
!418 = !DIEnumerator(name: "scale_IEC_I", value: 4, isUnsigned: true)
!419 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 158, baseType: !7, size: 32, elements: !420)
!420 = !{!421}
!421 = !DIEnumerator(name: "DELIMITER_DEFAULT", value: 128, isUnsigned: true)
!422 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "inval_type", file: !3, line: 116, baseType: !7, size: 32, elements: !423)
!423 = !{!424, !425, !426, !427}
!424 = !DIEnumerator(name: "inval_abort", value: 0, isUnsigned: true)
!425 = !DIEnumerator(name: "inval_fail", value: 1, isUnsigned: true)
!426 = !DIEnumerator(name: "inval_warn", value: 2, isUnsigned: true)
!427 = !DIEnumerator(name: "inval_ignore", value: 3, isUnsigned: true)
!428 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 46, baseType: !7, size: 32, elements: !429)
!429 = !{!430}
!430 = !DIEnumerator(name: "EXIT_CONVERSION_WARNINGS", value: 2, isUnsigned: true)
!431 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "round_type", file: !3, line: 96, baseType: !7, size: 32, elements: !432)
!432 = !{!433, !434, !435, !436, !437}
!433 = !DIEnumerator(name: "round_ceiling", value: 0, isUnsigned: true)
!434 = !DIEnumerator(name: "round_floor", value: 1, isUnsigned: true)
!435 = !DIEnumerator(name: "round_from_zero", value: 2, isUnsigned: true)
!436 = !DIEnumerator(name: "round_to_zero", value: 3, isUnsigned: true)
!437 = !DIEnumerator(name: "round_nearest", value: 4, isUnsigned: true)
!438 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !439, line: 46, baseType: !7, size: 32, elements: !440)
!439 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!440 = !{!441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452}
!441 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!442 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!443 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!444 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!445 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!446 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!447 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!448 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!449 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!450 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!451 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!452 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!453 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "simple_strtod_error", file: !3, line: 436, baseType: !7, size: 32, elements: !454)
!454 = !{!455, !456, !457, !458, !459, !460, !461}
!455 = !DIEnumerator(name: "SSE_OK", value: 0, isUnsigned: true)
!456 = !DIEnumerator(name: "SSE_OK_PRECISION_LOSS", value: 1, isUnsigned: true)
!457 = !DIEnumerator(name: "SSE_OVERFLOW", value: 2, isUnsigned: true)
!458 = !DIEnumerator(name: "SSE_INVALID_NUMBER", value: 3, isUnsigned: true)
!459 = !DIEnumerator(name: "SSE_VALID_BUT_FORBIDDEN_SUFFIX", value: 4, isUnsigned: true)
!460 = !DIEnumerator(name: "SSE_INVALID_SUFFIX", value: 5, isUnsigned: true)
!461 = !DIEnumerator(name: "SSE_MISSING_I_SUFFIX", value: 6, isUnsigned: true)
!462 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 162, baseType: !7, size: 32, elements: !463)
!463 = !{!464}
!464 = !DIEnumerator(name: "MAX_UNSCALED_DIGITS", value: 18, isUnsigned: true)
!465 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 168, baseType: !7, size: 32, elements: !466)
!466 = !{!467}
!467 = !DIEnumerator(name: "MAX_ACCEPTABLE_DIGITS", value: 27, isUnsigned: true)
!468 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !401, line: 21, baseType: !7, size: 32, elements: !469)
!469 = !{!470, !471, !472, !473}
!470 = !DIEnumerator(name: "MBA_UNIBYTE_FALLBACK", value: 1, isUnsigned: true)
!471 = !DIEnumerator(name: "MBA_UNIBYTE_ONLY", value: 2, isUnsigned: true)
!472 = !DIEnumerator(name: "MBA_NO_LEFT_PAD", value: 4, isUnsigned: true)
!473 = !DIEnumerator(name: "MBA_NO_RIGHT_PAD", value: 8, isUnsigned: true)
!474 = !{!475, !485, !546, !550, !554, !557, !560, !536, !563, !570, !585, !587, !592, !596, !600, !603, !479, !607, !611, !614, !618, !483, !516, !621, !625, !626, !629, !632, !633, !636, !639}
!475 = !DISubprogram(name: "dcgettext", scope: !476, file: !476, line: 51, type: !477, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !484)
!476 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!477 = !DISubroutineType(types: !478)
!478 = !{!479, !481, !481, !483}
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !480)
!483 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!484 = !{}
!485 = !DISubprogram(name: "fputs_unlocked", scope: !486, file: !486, line: 662, type: !487, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !484)
!486 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!487 = !DISubroutineType(types: !488)
!488 = !{!483, !481, !489}
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !491, line: 49, size: 1728, elements: !492)
!491 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!492 = !{!493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !508, !509, !510, !511, !515, !517, !519, !523, !526, !528, !531, !534, !535, !537, !541, !542}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !490, file: !491, line: 51, baseType: !483, size: 32)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !490, file: !491, line: 54, baseType: !479, size: 64, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !490, file: !491, line: 55, baseType: !479, size: 64, offset: 128)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !490, file: !491, line: 56, baseType: !479, size: 64, offset: 192)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !490, file: !491, line: 57, baseType: !479, size: 64, offset: 256)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !490, file: !491, line: 58, baseType: !479, size: 64, offset: 320)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !490, file: !491, line: 59, baseType: !479, size: 64, offset: 384)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !490, file: !491, line: 60, baseType: !479, size: 64, offset: 448)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !490, file: !491, line: 61, baseType: !479, size: 64, offset: 512)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !490, file: !491, line: 64, baseType: !479, size: 64, offset: 576)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !490, file: !491, line: 65, baseType: !479, size: 64, offset: 640)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !490, file: !491, line: 66, baseType: !479, size: 64, offset: 704)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !490, file: !491, line: 68, baseType: !506, size: 64, offset: 768)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !491, line: 36, flags: DIFlagFwdDecl)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !490, file: !491, line: 70, baseType: !489, size: 64, offset: 832)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !490, file: !491, line: 72, baseType: !483, size: 32, offset: 896)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !490, file: !491, line: 73, baseType: !483, size: 32, offset: 928)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !490, file: !491, line: 74, baseType: !512, size: 64, offset: 960)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !513, line: 152, baseType: !514)
!513 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!514 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !490, file: !491, line: 77, baseType: !516, size: 16, offset: 1024)
!516 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !490, file: !491, line: 78, baseType: !518, size: 8, offset: 1040)
!518 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !490, file: !491, line: 79, baseType: !520, size: 8, offset: 1048)
!520 = !DICompositeType(tag: DW_TAG_array_type, baseType: !480, size: 8, elements: !521)
!521 = !{!522}
!522 = !DISubrange(count: 1)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !490, file: !491, line: 81, baseType: !524, size: 64, offset: 1088)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !491, line: 43, baseType: null)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !490, file: !491, line: 89, baseType: !527, size: 64, offset: 1152)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !513, line: 153, baseType: !514)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !490, file: !491, line: 91, baseType: !529, size: 64, offset: 1216)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !491, line: 37, flags: DIFlagFwdDecl)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !490, file: !491, line: 92, baseType: !532, size: 64, offset: 1280)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !491, line: 38, flags: DIFlagFwdDecl)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !490, file: !491, line: 93, baseType: !489, size: 64, offset: 1344)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !490, file: !491, line: 94, baseType: !536, size: 64, offset: 1408)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !490, file: !491, line: 95, baseType: !538, size: 64, offset: 1472)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !539, line: 46, baseType: !540)
!539 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!540 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !490, file: !491, line: 96, baseType: !483, size: 32, offset: 1536)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !490, file: !491, line: 98, baseType: !543, size: 160, offset: 1568)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !480, size: 160, elements: !544)
!544 = !{!545}
!545 = !DISubrange(count: 20)
!546 = !DISubprogram(name: "set_program_name", scope: !547, file: !547, line: 37, type: !548, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !484)
!547 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!548 = !DISubroutineType(types: !549)
!549 = !{null, !481}
!550 = !DISubprogram(name: "setlocale", scope: !551, file: !551, line: 122, type: !552, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !484)
!551 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!552 = !DISubroutineType(types: !553)
!553 = !{!479, !483, !481}
!554 = !DISubprogram(name: "bindtextdomain", scope: !476, file: !476, line: 86, type: !555, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !484)
!555 = !DISubroutineType(types: !556)
!556 = !{!479, !481, !481}
!557 = !DISubprogram(name: "textdomain", scope: !476, file: !476, line: 82, type: !558, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !484)
!558 = !DISubroutineType(types: !559)
!559 = !{!479, !481}
!560 = !DISubprogram(name: "nl_langinfo", scope: !6, file: !6, line: 661, type: !561, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !484)
!561 = !DISubroutineType(types: !562)
!562 = !{!479, !483}
!563 = !DISubprogram(name: "atexit", scope: !564, file: !564, line: 595, type: !565, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !484)
!564 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!565 = !DISubroutineType(types: !566)
!566 = !{!483, !567}
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DISubroutineType(types: !569)
!569 = !{null}
!570 = !DISubprogram(name: "getopt_long", scope: !571, file: !571, line: 66, type: !572, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !484)
!571 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!572 = !DISubroutineType(types: !573)
!573 = !{!483, !483, !574, !481, !576, !583}
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !479)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !578)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !571, line: 50, size: 256, elements: !579)
!579 = !{!580, !581, !582, !584}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !578, file: !571, line: 52, baseType: !481, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !578, file: !571, line: 55, baseType: !483, size: 32, offset: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !578, file: !571, line: 56, baseType: !583, size: 64, offset: 128)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !578, file: !571, line: 57, baseType: !483, size: 32, offset: 192)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!587 = !DISubprogram(name: "xstrtol", scope: !393, file: !393, line: 43, type: !588, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !484)
!588 = !DISubroutineType(types: !589)
!589 = !{!392, !481, !590, !483, !591, !481}
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!592 = !DISubprogram(name: "quote", scope: !593, file: !593, line: 44, type: !594, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !484)
!593 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!594 = !DISubroutineType(types: !595)
!595 = !{!481, !481}
!596 = !DISubprogram(name: "error", scope: !597, file: !597, line: 52, type: !598, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !484)
!597 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!598 = !DISubroutineType(types: !599)
!599 = !{null, !483, !483, !481, null}
!600 = !DISubprogram(name: "set_fields", scope: !407, file: !407, line: 42, type: !601, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !484)
!601 = !DISubroutineType(types: !602)
!602 = !{null, !481, !7}
!603 = !DISubprogram(name: "xstrtoumax", scope: !393, file: !393, line: 48, type: !604, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !484)
!604 = !DISubroutineType(types: !605)
!605 = !{!392, !481, !590, !483, !606, !481}
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!607 = !DISubprogram(name: "version_etc", scope: !608, file: !608, line: 69, type: !609, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !484)
!608 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!609 = !DISubroutineType(types: !610)
!610 = !{null, !489, !481, !481, !481, null}
!611 = !DISubprogram(name: "getdelim", scope: !486, file: !486, line: 606, type: !612, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !484)
!612 = !DISubroutineType(types: !613)
!613 = !{!514, !590, !606, !483, !489}
!614 = !DISubprogram(name: "xmalloc", scope: !615, file: !615, line: 53, type: !616, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !484)
!615 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!616 = !DISubroutineType(types: !617)
!617 = !{!536, !540}
!618 = !DISubprogram(name: "free", scope: !564, file: !564, line: 565, type: !619, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !484)
!619 = !DISubroutineType(types: !620)
!620 = !{null, !536}
!621 = !DISubprogram(name: "xstrndup", scope: !622, file: !622, line: 23, type: !623, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !484)
!622 = !DIFile(filename: "./lib/xstrndup.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!623 = !DISubroutineType(types: !624)
!624 = !{!479, !481, !540}
!625 = !DISubprogram(name: "xstrdup", scope: !615, file: !615, line: 64, type: !558, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !484)
!626 = !DISubprogram(name: "quote_n", scope: !593, file: !593, line: 40, type: !627, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !484)
!627 = !DISubroutineType(types: !628)
!628 = !{!481, !483, !481}
!629 = !DISubprogram(name: "xrealloc", scope: !615, file: !615, line: 59, type: !630, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !484)
!630 = !DISubroutineType(types: !631)
!631 = !{!536, !536, !540}
!632 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !634, line: 102, baseType: !635)
!634 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !513, line: 73, baseType: !540)
!636 = !DISubprogram(name: "mbsalign", scope: !401, file: !401, line: 55, type: !637, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !484)
!637 = !DISubroutineType(types: !638)
!638 = !{!540, !481, !479, !540, !606, !400, !483}
!639 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!640 = !{!641, !0, !644, !646, !651, !657, !663, !665, !667, !672, !675, !677, !679, !683, !685, !687, !689, !691, !694, !696, !698, !700, !702, !704, !706, !710, !712, !714, !716, !718, !720, !722, !724, !726, !728, !730}
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(name: "debug", scope: !2, file: !3, line: 206, type: !643, isLocal: true, isDefinition: true)
!643 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(name: "decimal_point_length", scope: !2, file: !3, line: 210, type: !483, isLocal: true, isDefinition: true)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 134, type: !648, isLocal: true, isDefinition: true)
!648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !577, size: 4864, elements: !649)
!649 = !{!650}
!650 = !DISubrange(count: 19)
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(name: "scale_from_types", scope: !2, file: !3, line: 80, type: !653, isLocal: true, isDefinition: true)
!653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !654, size: 160, elements: !655)
!654 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !412)
!655 = !{!656}
!656 = !DISubrange(count: 5)
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(name: "scale_from_args", scope: !2, file: !3, line: 75, type: !659, isLocal: true, isDefinition: true)
!659 = !DICompositeType(tag: DW_TAG_array_type, baseType: !660, size: 384, elements: !661)
!660 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !481)
!661 = !{!662}
!662 = !DISubrange(count: 6)
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(name: "scale_from", scope: !2, file: !3, line: 170, type: !412, isLocal: true, isDefinition: true)
!665 = !DIGlobalVariableExpression(var: !666, expr: !DIExpression())
!666 = distinct !DIGlobalVariable(name: "from_unit_size", scope: !2, file: !3, line: 175, type: !633, isLocal: true, isDefinition: true)
!667 = !DIGlobalVariableExpression(var: !668, expr: !DIExpression())
!668 = distinct !DIGlobalVariable(name: "scale_to_types", scope: !2, file: !3, line: 90, type: !669, isLocal: true, isDefinition: true)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !654, size: 128, elements: !670)
!670 = !{!671}
!671 = !DISubrange(count: 4)
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(name: "scale_to_args", scope: !2, file: !3, line: 85, type: !674, isLocal: true, isDefinition: true)
!674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !660, size: 320, elements: !655)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(name: "scale_to", scope: !2, file: !3, line: 171, type: !412, isLocal: true, isDefinition: true)
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(name: "to_unit_size", scope: !2, file: !3, line: 176, type: !633, isLocal: true, isDefinition: true)
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(name: "round_types", scope: !2, file: !3, line: 110, type: !681, isLocal: true, isDefinition: true)
!681 = !DICompositeType(tag: DW_TAG_array_type, baseType: !682, size: 160, elements: !655)
!682 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !431)
!683 = !DIGlobalVariableExpression(var: !684, expr: !DIExpression())
!684 = distinct !DIGlobalVariable(name: "round_args", scope: !2, file: !3, line: 105, type: !659, isLocal: true, isDefinition: true)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(name: "round_style", scope: !2, file: !3, line: 172, type: !431, isLocal: true, isDefinition: true)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(name: "grouping", scope: !2, file: !3, line: 177, type: !483, isLocal: true, isDefinition: true)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(name: "padding_width", scope: !2, file: !3, line: 180, type: !514, isLocal: true, isDefinition: true)
!691 = !DIGlobalVariableExpression(var: !692, expr: !DIExpression())
!692 = distinct !DIGlobalVariable(name: "padding_alignment", scope: !2, file: !3, line: 193, type: !693, isLocal: true, isDefinition: true)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbs_align_t", file: !401, line: 19, baseType: !400)
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(name: "delimiter", scope: !2, file: !3, line: 196, type: !483, isLocal: true, isDefinition: true)
!696 = !DIGlobalVariableExpression(var: !697, expr: !DIExpression())
!697 = distinct !DIGlobalVariable(name: "line_delim", scope: !2, file: !3, line: 199, type: !639, isLocal: true, isDefinition: true)
!698 = !DIGlobalVariableExpression(var: !699, expr: !DIExpression())
!699 = distinct !DIGlobalVariable(name: "suffix", scope: !2, file: !3, line: 174, type: !481, isLocal: true, isDefinition: true)
!700 = !DIGlobalVariableExpression(var: !701, expr: !DIExpression())
!701 = distinct !DIGlobalVariable(name: "dev_debug", scope: !2, file: !3, line: 213, type: !643, isLocal: true, isDefinition: true)
!702 = !DIGlobalVariableExpression(var: !703, expr: !DIExpression())
!703 = distinct !DIGlobalVariable(name: "header", scope: !2, file: !3, line: 202, type: !633, isLocal: true, isDefinition: true)
!704 = !DIGlobalVariableExpression(var: !705, expr: !DIExpression())
!705 = distinct !DIGlobalVariable(name: "format_str", scope: !2, file: !3, line: 183, type: !481, isLocal: true, isDefinition: true)
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(name: "inval_types", scope: !2, file: !3, line: 129, type: !708, isLocal: true, isDefinition: true)
!708 = !DICompositeType(tag: DW_TAG_array_type, baseType: !709, size: 128, elements: !670)
!709 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !422)
!710 = !DIGlobalVariableExpression(var: !711, expr: !DIExpression())
!711 = distinct !DIGlobalVariable(name: "inval_args", scope: !2, file: !3, line: 124, type: !674, isLocal: true, isDefinition: true)
!712 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression())
!713 = distinct !DIGlobalVariable(name: "inval_style", scope: !2, file: !3, line: 173, type: !422, isLocal: true, isDefinition: true)
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(name: "zero_padding_width", scope: !2, file: !3, line: 181, type: !514, isLocal: true, isDefinition: true)
!716 = !DIGlobalVariableExpression(var: !717, expr: !DIExpression())
!717 = distinct !DIGlobalVariable(name: "user_precision", scope: !2, file: !3, line: 182, type: !514, isLocal: true, isDefinition: true)
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(name: "format_str_prefix", scope: !2, file: !3, line: 184, type: !479, isLocal: true, isDefinition: true)
!720 = !DIGlobalVariableExpression(var: !721, expr: !DIExpression())
!721 = distinct !DIGlobalVariable(name: "format_str_suffix", scope: !2, file: !3, line: 185, type: !479, isLocal: true, isDefinition: true)
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(name: "padding_buffer_size", scope: !2, file: !3, line: 179, type: !538, isLocal: true, isDefinition: true)
!724 = !DIGlobalVariableExpression(var: !725, expr: !DIExpression())
!725 = distinct !DIGlobalVariable(name: "padding_buffer", scope: !2, file: !3, line: 178, type: !479, isLocal: true, isDefinition: true)
!726 = !DIGlobalVariableExpression(var: !727, expr: !DIExpression())
!727 = distinct !DIGlobalVariable(name: "auto_padding", scope: !2, file: !3, line: 192, type: !483, isLocal: true, isDefinition: true)
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(name: "conv_exit_code", scope: !2, file: !3, line: 188, type: !483, isLocal: true, isDefinition: true)
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(name: "valid_suffixes", scope: !732, file: !3, line: 236, type: !481, isLocal: true, isDefinition: true)
!732 = distinct !DISubprogram(name: "valid_suffix", scope: !3, file: !3, line: 234, type: !733, scopeLine: 235, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !735)
!733 = !DISubroutineType(types: !734)
!734 = !{!483, !482}
!735 = !{!736}
!736 = !DILocalVariable(name: "suf", arg: 1, scope: !732, file: !3, line: 234, type: !482)
!737 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!738 = !DIGlobalVariableExpression(var: !692, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!739 = !DIGlobalVariableExpression(var: !697, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551606, DW_OP_mul, DW_OP_constu, 10, DW_OP_plus, DW_OP_stack_value))
!740 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!741 = !DIGlobalVariableExpression(var: !701, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!742 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551614, DW_OP_mul, DW_OP_constu, 2, DW_OP_plus, DW_OP_stack_value))
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(name: "n_frp", scope: !745, file: !746, line: 31, type: !538, isLocal: false, isDefinition: true)
!745 = distinct !DICompileUnit(language: DW_LANG_C99, file: !746, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !747, retainedTypes: !760, globals: !779, splitDebugInlining: false, nameTableKind: None)
!746 = !DIFile(filename: "src/set-fields.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!747 = !{!406, !438, !748}
!748 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !749, file: !615, line: 186, baseType: !7, size: 32, elements: !758)
!749 = distinct !DISubprogram(name: "x2nrealloc", scope: !615, file: !615, line: 174, type: !750, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !745, retainedNodes: !753)
!750 = !DISubroutineType(types: !751)
!751 = !{!536, !536, !752, !538}
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!753 = !{!754, !755, !756, !757}
!754 = !DILocalVariable(name: "p", arg: 1, scope: !749, file: !615, line: 174, type: !536)
!755 = !DILocalVariable(name: "pn", arg: 2, scope: !749, file: !615, line: 174, type: !752)
!756 = !DILocalVariable(name: "s", arg: 3, scope: !749, file: !615, line: 174, type: !538)
!757 = !DILocalVariable(name: "n", scope: !749, file: !615, line: 176, type: !538)
!758 = !{!759}
!759 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!760 = !{!475, !596, !761, !483, !516, !7, !765, !536, !633, !621, !592, !618, !766, !629, !538, !772, !773}
!761 = !DISubprogram(name: "usage", scope: !762, file: !762, line: 711, type: !763, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !484)
!762 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!763 = !DISubroutineType(types: !764)
!764 = !{null, !483}
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!766 = !DISubprogram(name: "qsort", scope: !564, file: !564, line: 830, type: !767, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !484)
!767 = !DISubroutineType(types: !768)
!768 = !{null, !536, !540, !540, !769}
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DISubroutineType(types: !771)
!771 = !{!483, !585, !585}
!772 = !DISubprogram(name: "xalloc_die", scope: !615, file: !615, line: 51, type: !568, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !484)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !775)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "field_range_pair", file: !407, line: 20, size: 128, elements: !776)
!776 = !{!777, !778}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "lo", scope: !775, file: !407, line: 22, baseType: !633, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "hi", scope: !775, file: !407, line: 23, baseType: !633, size: 64, offset: 64)
!779 = !{!780, !807, !743, !810}
!780 = !DIGlobalVariableExpression(var: !781, expr: !DIExpression())
!781 = distinct !DIGlobalVariable(name: "num_start", scope: !782, file: !746, line: 239, type: !481, isLocal: true, isDefinition: true)
!782 = distinct !DISubprogram(name: "set_fields", scope: !746, file: !746, line: 138, type: !601, scopeLine: 139, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !745, retainedNodes: !783)
!783 = !{!784, !785, !786, !787, !788, !789, !790, !791, !792, !800, !801, !803}
!784 = !DILocalVariable(name: "fieldstr", arg: 1, scope: !782, file: !746, line: 138, type: !481)
!785 = !DILocalVariable(name: "options", arg: 2, scope: !782, file: !746, line: 138, type: !7)
!786 = !DILocalVariable(name: "initial", scope: !782, file: !746, line: 140, type: !633)
!787 = !DILocalVariable(name: "value", scope: !782, file: !746, line: 141, type: !633)
!788 = !DILocalVariable(name: "lhs_specified", scope: !782, file: !746, line: 142, type: !643)
!789 = !DILocalVariable(name: "rhs_specified", scope: !782, file: !746, line: 143, type: !643)
!790 = !DILocalVariable(name: "dash_found", scope: !782, file: !746, line: 144, type: !643)
!791 = !DILocalVariable(name: "in_digits", scope: !782, file: !746, line: 146, type: !643)
!792 = !DILocalVariable(name: "len", scope: !793, file: !746, line: 256, type: !538)
!793 = distinct !DILexicalBlock(scope: !794, file: !746, line: 252, column: 13)
!794 = distinct !DILexicalBlock(scope: !795, file: !746, line: 250, column: 15)
!795 = distinct !DILexicalBlock(scope: !796, file: !746, line: 236, column: 9)
!796 = distinct !DILexicalBlock(scope: !797, file: !746, line: 235, column: 16)
!797 = distinct !DILexicalBlock(scope: !798, file: !746, line: 181, column: 16)
!798 = distinct !DILexicalBlock(scope: !799, file: !746, line: 161, column: 11)
!799 = distinct !DILexicalBlock(scope: !782, file: !746, line: 160, column: 5)
!800 = !DILocalVariable(name: "bad_num", scope: !793, file: !746, line: 257, type: !479)
!801 = !DILocalVariable(name: "i", scope: !802, file: !746, line: 286, type: !538)
!802 = distinct !DILexicalBlock(scope: !782, file: !746, line: 286, column: 3)
!803 = !DILocalVariable(name: "j", scope: !804, file: !746, line: 288, type: !538)
!804 = distinct !DILexicalBlock(scope: !805, file: !746, line: 288, column: 7)
!805 = distinct !DILexicalBlock(scope: !806, file: !746, line: 287, column: 5)
!806 = distinct !DILexicalBlock(scope: !802, file: !746, line: 286, column: 3)
!807 = !DIGlobalVariableExpression(var: !808, expr: !DIExpression())
!808 = distinct !DIGlobalVariable(name: "frp", scope: !745, file: !746, line: 28, type: !809, isLocal: false, isDefinition: true)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!810 = !DIGlobalVariableExpression(var: !811, expr: !DIExpression())
!811 = distinct !DIGlobalVariable(name: "n_frp_allocated", scope: !745, file: !746, line: 34, type: !538, isLocal: true, isDefinition: true)
!812 = !DIGlobalVariableExpression(var: !813, expr: !DIExpression())
!813 = distinct !DIGlobalVariable(name: "Version", scope: !814, file: !815, line: 2, type: !481, isLocal: false, isDefinition: true)
!814 = distinct !DICompileUnit(language: DW_LANG_C99, file: !815, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !484, globals: !816, splitDebugInlining: false, nameTableKind: None)
!815 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!816 = !{!812}
!817 = !DIGlobalVariableExpression(var: !818, expr: !DIExpression())
!818 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !819, file: !820, line: 67, type: !877, isLocal: false, isDefinition: true)
!819 = distinct !DICompileUnit(language: DW_LANG_C99, file: !820, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !821, retainedTypes: !836, globals: !876, splitDebugInlining: false, nameTableKind: None)
!820 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!821 = !{!822}
!822 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !823, line: 32, baseType: !7, size: 32, elements: !824)
!823 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!824 = !{!825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835}
!825 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!826 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!827 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!828 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!829 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!830 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!831 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!832 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!833 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!834 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!835 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!836 = !{!536, !481, !475, !837, !626, !596, !840, !592, !875, !639}
!837 = !DISubprogram(name: "quotearg_n_style", scope: !823, file: !823, line: 368, type: !838, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !484)
!838 = !DISubroutineType(types: !839)
!839 = !{!479, !483, !822, !481}
!840 = !DISubprogram(name: "fputs_unlocked", scope: !486, file: !486, line: 662, type: !841, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !484)
!841 = !DISubroutineType(types: !842)
!842 = !{!483, !481, !843}
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !491, line: 49, size: 1728, elements: !845)
!845 = !{!846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !844, file: !491, line: 51, baseType: !483, size: 32)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !844, file: !491, line: 54, baseType: !479, size: 64, offset: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !844, file: !491, line: 55, baseType: !479, size: 64, offset: 128)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !844, file: !491, line: 56, baseType: !479, size: 64, offset: 192)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !844, file: !491, line: 57, baseType: !479, size: 64, offset: 256)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !844, file: !491, line: 58, baseType: !479, size: 64, offset: 320)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !844, file: !491, line: 59, baseType: !479, size: 64, offset: 384)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !844, file: !491, line: 60, baseType: !479, size: 64, offset: 448)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !844, file: !491, line: 61, baseType: !479, size: 64, offset: 512)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !844, file: !491, line: 64, baseType: !479, size: 64, offset: 576)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !844, file: !491, line: 65, baseType: !479, size: 64, offset: 640)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !844, file: !491, line: 66, baseType: !479, size: 64, offset: 704)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !844, file: !491, line: 68, baseType: !506, size: 64, offset: 768)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !844, file: !491, line: 70, baseType: !843, size: 64, offset: 832)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !844, file: !491, line: 72, baseType: !483, size: 32, offset: 896)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !844, file: !491, line: 73, baseType: !483, size: 32, offset: 928)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !844, file: !491, line: 74, baseType: !512, size: 64, offset: 960)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !844, file: !491, line: 77, baseType: !516, size: 16, offset: 1024)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !844, file: !491, line: 78, baseType: !518, size: 8, offset: 1040)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !844, file: !491, line: 79, baseType: !520, size: 8, offset: 1048)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !844, file: !491, line: 81, baseType: !524, size: 64, offset: 1088)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !844, file: !491, line: 89, baseType: !527, size: 64, offset: 1152)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !844, file: !491, line: 91, baseType: !529, size: 64, offset: 1216)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !844, file: !491, line: 92, baseType: !532, size: 64, offset: 1280)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !844, file: !491, line: 93, baseType: !843, size: 64, offset: 1344)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !844, file: !491, line: 94, baseType: !536, size: 64, offset: 1408)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !844, file: !491, line: 95, baseType: !538, size: 64, offset: 1472)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !844, file: !491, line: 96, baseType: !483, size: 32, offset: 1536)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !844, file: !491, line: 98, baseType: !543, size: 160, offset: 1568)
!875 = !DISubprogram(name: "usage", scope: !820, file: !820, line: 56, type: !763, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !484)
!876 = !{!817}
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !878, line: 61, baseType: !567)
!878 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!879 = !DIGlobalVariableExpression(var: !880, expr: !DIExpression())
!880 = distinct !DIGlobalVariable(name: "file_name", scope: !881, file: !882, line: 46, type: !481, isLocal: true, isDefinition: true)
!881 = distinct !DICompileUnit(language: DW_LANG_C99, file: !882, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !484, retainedTypes: !883, globals: !921, splitDebugInlining: false, nameTableKind: None)
!882 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!883 = !{!884, !475, !920, !596}
!884 = !DISubprogram(name: "close_stream", scope: !885, file: !885, line: 2, type: !886, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !484)
!885 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!886 = !DISubroutineType(types: !887)
!887 = !{!483, !888}
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !491, line: 49, size: 1728, elements: !890)
!890 = !{!891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !889, file: !491, line: 51, baseType: !483, size: 32)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !889, file: !491, line: 54, baseType: !479, size: 64, offset: 64)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !889, file: !491, line: 55, baseType: !479, size: 64, offset: 128)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !889, file: !491, line: 56, baseType: !479, size: 64, offset: 192)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !889, file: !491, line: 57, baseType: !479, size: 64, offset: 256)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !889, file: !491, line: 58, baseType: !479, size: 64, offset: 320)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !889, file: !491, line: 59, baseType: !479, size: 64, offset: 384)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !889, file: !491, line: 60, baseType: !479, size: 64, offset: 448)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !889, file: !491, line: 61, baseType: !479, size: 64, offset: 512)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !889, file: !491, line: 64, baseType: !479, size: 64, offset: 576)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !889, file: !491, line: 65, baseType: !479, size: 64, offset: 640)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !889, file: !491, line: 66, baseType: !479, size: 64, offset: 704)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !889, file: !491, line: 68, baseType: !506, size: 64, offset: 768)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !889, file: !491, line: 70, baseType: !888, size: 64, offset: 832)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !889, file: !491, line: 72, baseType: !483, size: 32, offset: 896)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !889, file: !491, line: 73, baseType: !483, size: 32, offset: 928)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !889, file: !491, line: 74, baseType: !512, size: 64, offset: 960)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !889, file: !491, line: 77, baseType: !516, size: 16, offset: 1024)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !889, file: !491, line: 78, baseType: !518, size: 8, offset: 1040)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !889, file: !491, line: 79, baseType: !520, size: 8, offset: 1048)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !889, file: !491, line: 81, baseType: !524, size: 64, offset: 1088)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !889, file: !491, line: 89, baseType: !527, size: 64, offset: 1152)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !889, file: !491, line: 91, baseType: !529, size: 64, offset: 1216)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !889, file: !491, line: 92, baseType: !532, size: 64, offset: 1280)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !889, file: !491, line: 93, baseType: !888, size: 64, offset: 1344)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !889, file: !491, line: 94, baseType: !536, size: 64, offset: 1408)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !889, file: !491, line: 95, baseType: !538, size: 64, offset: 1472)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !889, file: !491, line: 96, baseType: !483, size: 32, offset: 1536)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !889, file: !491, line: 98, baseType: !543, size: 160, offset: 1568)
!920 = !DISubprogram(name: "quotearg_colon", scope: !823, file: !823, line: 391, type: !558, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !484)
!921 = !{!879, !922}
!922 = !DIGlobalVariableExpression(var: !923, expr: !DIExpression())
!923 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !881, file: !882, line: 56, type: !643, isLocal: true, isDefinition: true)
!924 = !DIGlobalVariableExpression(var: !925, expr: !DIExpression())
!925 = distinct !DIGlobalVariable(name: "exit_failure", scope: !926, file: !927, line: 24, type: !929, isLocal: false, isDefinition: true)
!926 = distinct !DICompileUnit(language: DW_LANG_C99, file: !927, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !484, globals: !928, splitDebugInlining: false, nameTableKind: None)
!927 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!928 = !{!924}
!929 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !483)
!930 = !DIGlobalVariableExpression(var: !931, expr: !DIExpression())
!931 = distinct !DIGlobalVariable(name: "program_name", scope: !932, file: !933, line: 33, type: !481, isLocal: false, isDefinition: true)
!932 = distinct !DICompileUnit(language: DW_LANG_C99, file: !933, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !484, retainedTypes: !934, globals: !970, splitDebugInlining: false, nameTableKind: None)
!933 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!934 = !{!536, !935, !479}
!935 = !DISubprogram(name: "fputs", scope: !486, file: !486, line: 626, type: !936, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !484)
!936 = !DISubroutineType(types: !937)
!937 = !{!483, !481, !938}
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !491, line: 49, size: 1728, elements: !940)
!940 = !{!941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !939, file: !491, line: 51, baseType: !483, size: 32)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !939, file: !491, line: 54, baseType: !479, size: 64, offset: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !939, file: !491, line: 55, baseType: !479, size: 64, offset: 128)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !939, file: !491, line: 56, baseType: !479, size: 64, offset: 192)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !939, file: !491, line: 57, baseType: !479, size: 64, offset: 256)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !939, file: !491, line: 58, baseType: !479, size: 64, offset: 320)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !939, file: !491, line: 59, baseType: !479, size: 64, offset: 384)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !939, file: !491, line: 60, baseType: !479, size: 64, offset: 448)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !939, file: !491, line: 61, baseType: !479, size: 64, offset: 512)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !939, file: !491, line: 64, baseType: !479, size: 64, offset: 576)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !939, file: !491, line: 65, baseType: !479, size: 64, offset: 640)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !939, file: !491, line: 66, baseType: !479, size: 64, offset: 704)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !939, file: !491, line: 68, baseType: !506, size: 64, offset: 768)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !939, file: !491, line: 70, baseType: !938, size: 64, offset: 832)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !939, file: !491, line: 72, baseType: !483, size: 32, offset: 896)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !939, file: !491, line: 73, baseType: !483, size: 32, offset: 928)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !939, file: !491, line: 74, baseType: !512, size: 64, offset: 960)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !939, file: !491, line: 77, baseType: !516, size: 16, offset: 1024)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !939, file: !491, line: 78, baseType: !518, size: 8, offset: 1040)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !939, file: !491, line: 79, baseType: !520, size: 8, offset: 1048)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !939, file: !491, line: 81, baseType: !524, size: 64, offset: 1088)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !939, file: !491, line: 89, baseType: !527, size: 64, offset: 1152)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !939, file: !491, line: 91, baseType: !529, size: 64, offset: 1216)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !939, file: !491, line: 92, baseType: !532, size: 64, offset: 1280)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !939, file: !491, line: 93, baseType: !938, size: 64, offset: 1344)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !939, file: !491, line: 94, baseType: !536, size: 64, offset: 1408)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !939, file: !491, line: 95, baseType: !538, size: 64, offset: 1472)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !939, file: !491, line: 96, baseType: !483, size: 32, offset: 1536)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !939, file: !491, line: 98, baseType: !543, size: 160, offset: 1568)
!970 = !{!930}
!971 = !DIGlobalVariableExpression(var: !972, expr: !DIExpression())
!972 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !973, file: !974, line: 85, type: !1063, isLocal: false, isDefinition: true)
!973 = distinct !DICompileUnit(language: DW_LANG_C99, file: !974, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !975, retainedTypes: !981, globals: !1036, splitDebugInlining: false, nameTableKind: None)
!974 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!975 = !{!822, !976, !438}
!976 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !823, line: 242, baseType: !7, size: 32, elements: !977)
!977 = !{!978, !979, !980}
!978 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!979 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!980 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!981 = !{!982, !985, !618, !1000, !483, !516, !1003, !538, !1018, !1022, !475, !1028, !1032, !479, !614, !772, !629}
!982 = !DISubprogram(name: "xmemdup", scope: !615, file: !615, line: 62, type: !983, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !484)
!983 = !DISubroutineType(types: !984)
!984 = !{!536, !585, !540}
!985 = !DISubprogram(name: "quotearg_alloc_mem", scope: !823, file: !823, line: 342, type: !986, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !484)
!986 = !DISubroutineType(types: !987)
!987 = !{!479, !481, !540, !606, !988}
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !990)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !974, line: 65, size: 448, elements: !991)
!991 = !{!992, !993, !994, !998, !999}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !990, file: !974, line: 68, baseType: !822, size: 32)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !990, file: !974, line: 71, baseType: !483, size: 32, offset: 32)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !990, file: !974, line: 75, baseType: !995, size: 256, offset: 64)
!995 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !996)
!996 = !{!997}
!997 = !DISubrange(count: 8)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !990, file: !974, line: 78, baseType: !481, size: 64, offset: 320)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !990, file: !974, line: 81, baseType: !481, size: 64, offset: 384)
!1000 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !823, file: !823, line: 408, type: !1001, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !484)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!479, !483, !481, !481, !481, !540}
!1003 = !DISubprogram(name: "rpl_mbrtowc", scope: !1004, file: !1004, line: 717, type: !1005, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !484)
!1004 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!540, !583, !481, !540, !1007}
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1009, line: 13, size: 64, elements: !1010)
!1009 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!1010 = !{!1011, !1012}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1008, file: !1009, line: 15, baseType: !483, size: 32)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1008, file: !1009, line: 20, baseType: !1013, size: 32, offset: 32)
!1013 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1008, file: !1009, line: 16, size: 32, elements: !1014)
!1014 = !{!1015, !1016}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1013, file: !1009, line: 18, baseType: !7, size: 32)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1013, file: !1009, line: 19, baseType: !1017, size: 32)
!1017 = !DICompositeType(tag: DW_TAG_array_type, baseType: !480, size: 32, elements: !670)
!1018 = !DISubprogram(name: "iswprint", scope: !1019, file: !1019, line: 120, type: !1020, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !484)
!1019 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!483, !7}
!1022 = !DISubprogram(name: "mbsinit", scope: !1023, file: !1023, line: 292, type: !1024, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !484)
!1023 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!483, !1026}
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1008)
!1028 = !DISubprogram(name: "locale_charset", scope: !1029, file: !1029, line: 35, type: !1030, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !484)
!1029 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1030 = !DISubroutineType(types: !1031)
!1031 = !{!481}
!1032 = !DISubprogram(name: "c_strcasecmp", scope: !1033, file: !1033, line: 42, type: !1034, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !484)
!1033 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!483, !481, !481}
!1036 = !{!971, !1037, !1043, !1045, !1047, !1052, !1059, !1061}
!1037 = !DIGlobalVariableExpression(var: !1038, expr: !DIExpression())
!1038 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !973, file: !974, line: 101, type: !1039, isLocal: false, isDefinition: true)
!1039 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1040, size: 320, elements: !1041)
!1040 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !822)
!1041 = !{!1042}
!1042 = !DISubrange(count: 10)
!1043 = !DIGlobalVariableExpression(var: !1044, expr: !DIExpression())
!1044 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !973, file: !974, line: 1052, type: !990, isLocal: false, isDefinition: true)
!1045 = !DIGlobalVariableExpression(var: !1046, expr: !DIExpression())
!1046 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !973, file: !974, line: 116, type: !990, isLocal: true, isDefinition: true)
!1047 = !DIGlobalVariableExpression(var: !1048, expr: !DIExpression())
!1048 = distinct !DIGlobalVariable(name: "slot0", scope: !973, file: !974, line: 842, type: !1049, isLocal: true, isDefinition: true)
!1049 = !DICompositeType(tag: DW_TAG_array_type, baseType: !480, size: 2048, elements: !1050)
!1050 = !{!1051}
!1051 = !DISubrange(count: 256)
!1052 = !DIGlobalVariableExpression(var: !1053, expr: !DIExpression())
!1053 = distinct !DIGlobalVariable(name: "slotvec", scope: !973, file: !974, line: 845, type: !1054, isLocal: true, isDefinition: true)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !974, line: 834, size: 128, elements: !1056)
!1056 = !{!1057, !1058}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1055, file: !974, line: 836, baseType: !538, size: 64)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1055, file: !974, line: 837, baseType: !479, size: 64, offset: 64)
!1059 = !DIGlobalVariableExpression(var: !1060, expr: !DIExpression())
!1060 = distinct !DIGlobalVariable(name: "nslots", scope: !973, file: !974, line: 843, type: !483, isLocal: true, isDefinition: true)
!1061 = !DIGlobalVariableExpression(var: !1062, expr: !DIExpression())
!1062 = distinct !DIGlobalVariable(name: "slotvec0", scope: !973, file: !974, line: 844, type: !1055, isLocal: true, isDefinition: true)
!1063 = !DICompositeType(tag: DW_TAG_array_type, baseType: !660, size: 704, elements: !1064)
!1064 = !{!1065}
!1065 = !DISubrange(count: 11)
!1066 = !DIGlobalVariableExpression(var: !1067, expr: !DIExpression())
!1067 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !1068, file: !1069, line: 26, type: !1071, isLocal: false, isDefinition: true)
!1068 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1069, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !484, globals: !1070, splitDebugInlining: false, nameTableKind: None)
!1069 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1070 = !{!1066}
!1071 = !DICompositeType(tag: DW_TAG_array_type, baseType: !482, size: 376, elements: !1072)
!1072 = !{!1073}
!1073 = !DISubrange(count: 47)
!1074 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1075, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1076, retainedTypes: !1077, splitDebugInlining: false, nameTableKind: None)
!1075 = !DIFile(filename: "lib/mbsalign.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1076 = !{!400, !468}
!1077 = !{!536, !1078, !618, !1083, !1018, !1085}
!1078 = !DISubprogram(name: "wcswidth", scope: !1023, file: !1023, line: 371, type: !1079, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !484)
!1079 = !DISubroutineType(types: !1080)
!1080 = !{!483, !1081, !540}
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64)
!1082 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !483)
!1083 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !1084, line: 20, baseType: !7)
!1084 = !DIFile(filename: "/usr/include/bits/types/wint_t.h", directory: "")
!1085 = !DISubprogram(name: "wcwidth", scope: !1023, file: !1023, line: 367, type: !1086, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !484)
!1086 = !DISubroutineType(types: !1087)
!1087 = !{!483, !483}
!1088 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1089, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1090, retainedTypes: !1094, splitDebugInlining: false, nameTableKind: None)
!1089 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1090 = !{!1091}
!1091 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1089, line: 40, baseType: !7, size: 32, elements: !1092)
!1092 = !{!1093}
!1093 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!1094 = !{!475, !1095, !536}
!1095 = !DISubprogram(name: "fputs_unlocked", scope: !486, file: !486, line: 662, type: !1096, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !484)
!1096 = !DISubroutineType(types: !1097)
!1097 = !{!483, !481, !1098}
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64)
!1099 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !491, line: 49, size: 1728, elements: !1100)
!1100 = !{!1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1099, file: !491, line: 51, baseType: !483, size: 32)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1099, file: !491, line: 54, baseType: !479, size: 64, offset: 64)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1099, file: !491, line: 55, baseType: !479, size: 64, offset: 128)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1099, file: !491, line: 56, baseType: !479, size: 64, offset: 192)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1099, file: !491, line: 57, baseType: !479, size: 64, offset: 256)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1099, file: !491, line: 58, baseType: !479, size: 64, offset: 320)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1099, file: !491, line: 59, baseType: !479, size: 64, offset: 384)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1099, file: !491, line: 60, baseType: !479, size: 64, offset: 448)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1099, file: !491, line: 61, baseType: !479, size: 64, offset: 512)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1099, file: !491, line: 64, baseType: !479, size: 64, offset: 576)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1099, file: !491, line: 65, baseType: !479, size: 64, offset: 640)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1099, file: !491, line: 66, baseType: !479, size: 64, offset: 704)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1099, file: !491, line: 68, baseType: !506, size: 64, offset: 768)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1099, file: !491, line: 70, baseType: !1098, size: 64, offset: 832)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1099, file: !491, line: 72, baseType: !483, size: 32, offset: 896)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1099, file: !491, line: 73, baseType: !483, size: 32, offset: 928)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1099, file: !491, line: 74, baseType: !512, size: 64, offset: 960)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1099, file: !491, line: 77, baseType: !516, size: 16, offset: 1024)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1099, file: !491, line: 78, baseType: !518, size: 8, offset: 1040)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1099, file: !491, line: 79, baseType: !520, size: 8, offset: 1048)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1099, file: !491, line: 81, baseType: !524, size: 64, offset: 1088)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1099, file: !491, line: 89, baseType: !527, size: 64, offset: 1152)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1099, file: !491, line: 91, baseType: !529, size: 64, offset: 1216)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1099, file: !491, line: 92, baseType: !532, size: 64, offset: 1280)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1099, file: !491, line: 93, baseType: !1098, size: 64, offset: 1344)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1099, file: !491, line: 94, baseType: !536, size: 64, offset: 1408)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1099, file: !491, line: 95, baseType: !538, size: 64, offset: 1472)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1099, file: !491, line: 96, baseType: !483, size: 32, offset: 1536)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1099, file: !491, line: 98, baseType: !543, size: 160, offset: 1568)
!1130 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1131, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1132, retainedTypes: !1140, splitDebugInlining: false, nameTableKind: None)
!1131 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1132 = !{!1133}
!1133 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1134, file: !615, line: 186, baseType: !7, size: 32, elements: !758)
!1134 = distinct !DISubprogram(name: "x2nrealloc", scope: !615, file: !615, line: 174, type: !750, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1130, retainedNodes: !1135)
!1135 = !{!1136, !1137, !1138, !1139}
!1136 = !DILocalVariable(name: "p", arg: 1, scope: !1134, file: !615, line: 174, type: !536)
!1137 = !DILocalVariable(name: "pn", arg: 2, scope: !1134, file: !615, line: 174, type: !752)
!1138 = !DILocalVariable(name: "s", arg: 3, scope: !1134, file: !615, line: 174, type: !538)
!1139 = !DILocalVariable(name: "n", scope: !1134, file: !615, line: 176, type: !538)
!1140 = !{!538, !772, !614, !629, !479, !618, !536, !1141, !1144}
!1141 = !DISubprogram(name: "xcalloc", scope: !615, file: !615, line: 57, type: !1142, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !484)
!1142 = !DISubroutineType(types: !1143)
!1143 = !{!536, !540, !540}
!1144 = !DISubprogram(name: "rpl_calloc", scope: !1145, file: !1145, line: 688, type: !1142, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !484)
!1145 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1146 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1147, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !484, retainedTypes: !1148, splitDebugInlining: false, nameTableKind: None)
!1147 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1148 = !{!475, !596}
!1149 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1150, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !484, retainedTypes: !1151, splitDebugInlining: false, nameTableKind: None)
!1150 = !DIFile(filename: "lib/xstrndup.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1151 = !{!772}
!1152 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1153, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1154, splitDebugInlining: false, nameTableKind: None)
!1153 = !DIFile(filename: "lib/xstrtol.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1154 = !{!392}
!1155 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1156, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1157, retainedTypes: !1158, splitDebugInlining: false, nameTableKind: None)
!1156 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1157 = !{!392, !438}
!1158 = !{!483, !516}
!1159 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1160, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !484, retainedTypes: !1161, splitDebugInlining: false, nameTableKind: None)
!1160 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1161 = !{!536}
!1162 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1163, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !484, retainedTypes: !1164, splitDebugInlining: false, nameTableKind: None)
!1163 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1164 = !{!1165, !538, !1177}
!1165 = !DISubprogram(name: "mbrtowc", scope: !1023, file: !1023, line: 296, type: !1166, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !484)
!1166 = !DISubroutineType(types: !1167)
!1167 = !{!540, !583, !481, !540, !1168}
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64)
!1169 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1009, line: 13, size: 64, elements: !1170)
!1170 = !{!1171, !1172}
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1169, file: !1009, line: 15, baseType: !483, size: 32)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1169, file: !1009, line: 20, baseType: !1173, size: 32, offset: 32)
!1173 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1169, file: !1009, line: 16, size: 32, elements: !1174)
!1174 = !{!1175, !1176}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1173, file: !1009, line: 18, baseType: !7, size: 32)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1173, file: !1009, line: 19, baseType: !1017, size: 32)
!1177 = !DISubprogram(name: "hard_locale", scope: !1178, file: !1178, line: 26, type: !1179, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !484)
!1178 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1179 = !DISubroutineType(types: !1180)
!1180 = !{!643, !483}
!1181 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1182, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !484, retainedTypes: !1183, splitDebugInlining: false, nameTableKind: None)
!1182 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1183 = !{!1184}
!1184 = !DISubprogram(name: "rpl_fclose", scope: !1185, file: !1185, line: 672, type: !1186, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !484)
!1185 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1186 = !DISubroutineType(types: !1187)
!1187 = !{!483, !1188}
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64)
!1189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !491, line: 49, size: 1728, elements: !1190)
!1190 = !{!1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219}
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1189, file: !491, line: 51, baseType: !483, size: 32)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1189, file: !491, line: 54, baseType: !479, size: 64, offset: 64)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1189, file: !491, line: 55, baseType: !479, size: 64, offset: 128)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1189, file: !491, line: 56, baseType: !479, size: 64, offset: 192)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1189, file: !491, line: 57, baseType: !479, size: 64, offset: 256)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1189, file: !491, line: 58, baseType: !479, size: 64, offset: 320)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1189, file: !491, line: 59, baseType: !479, size: 64, offset: 384)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1189, file: !491, line: 60, baseType: !479, size: 64, offset: 448)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1189, file: !491, line: 61, baseType: !479, size: 64, offset: 512)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1189, file: !491, line: 64, baseType: !479, size: 64, offset: 576)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1189, file: !491, line: 65, baseType: !479, size: 64, offset: 640)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1189, file: !491, line: 66, baseType: !479, size: 64, offset: 704)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1189, file: !491, line: 68, baseType: !506, size: 64, offset: 768)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1189, file: !491, line: 70, baseType: !1188, size: 64, offset: 832)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1189, file: !491, line: 72, baseType: !483, size: 32, offset: 896)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1189, file: !491, line: 73, baseType: !483, size: 32, offset: 928)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1189, file: !491, line: 74, baseType: !512, size: 64, offset: 960)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1189, file: !491, line: 77, baseType: !516, size: 16, offset: 1024)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1189, file: !491, line: 78, baseType: !518, size: 8, offset: 1040)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1189, file: !491, line: 79, baseType: !520, size: 8, offset: 1048)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1189, file: !491, line: 81, baseType: !524, size: 64, offset: 1088)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1189, file: !491, line: 89, baseType: !527, size: 64, offset: 1152)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1189, file: !491, line: 91, baseType: !529, size: 64, offset: 1216)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1189, file: !491, line: 92, baseType: !532, size: 64, offset: 1280)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1189, file: !491, line: 93, baseType: !1188, size: 64, offset: 1344)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1189, file: !491, line: 94, baseType: !536, size: 64, offset: 1408)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1189, file: !491, line: 95, baseType: !538, size: 64, offset: 1472)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1189, file: !491, line: 96, baseType: !483, size: 32, offset: 1536)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1189, file: !491, line: 98, baseType: !543, size: 160, offset: 1568)
!1220 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1221, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !484, retainedTypes: !1222, splitDebugInlining: false, nameTableKind: None)
!1221 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1222 = !{!1223}
!1223 = !DISubprogram(name: "setlocale_null_r", scope: !1224, file: !1224, line: 64, type: !1225, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !484)
!1224 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1225 = !DISubroutineType(types: !1226)
!1226 = !{!483, !483, !479, !540}
!1227 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1228, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1229, retainedTypes: !1230, splitDebugInlining: false, nameTableKind: None)
!1228 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1229 = !{!5}
!1230 = !{!560, !536}
!1231 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1232, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !484, retainedTypes: !1233, splitDebugInlining: false, nameTableKind: None)
!1232 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1233 = !{!536, !550}
!1234 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1235, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !484, retainedTypes: !1236, splitDebugInlining: false, nameTableKind: None)
!1235 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1236 = !{!1237, !1272, !1273, !1277}
!1237 = !DISubprogram(name: "fileno", scope: !486, file: !486, line: 786, type: !1238, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !484)
!1238 = !DISubroutineType(types: !1239)
!1239 = !{!483, !1240}
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64)
!1241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !491, line: 49, size: 1728, elements: !1242)
!1242 = !{!1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1241, file: !491, line: 51, baseType: !483, size: 32)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1241, file: !491, line: 54, baseType: !479, size: 64, offset: 64)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1241, file: !491, line: 55, baseType: !479, size: 64, offset: 128)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1241, file: !491, line: 56, baseType: !479, size: 64, offset: 192)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1241, file: !491, line: 57, baseType: !479, size: 64, offset: 256)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1241, file: !491, line: 58, baseType: !479, size: 64, offset: 320)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1241, file: !491, line: 59, baseType: !479, size: 64, offset: 384)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1241, file: !491, line: 60, baseType: !479, size: 64, offset: 448)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1241, file: !491, line: 61, baseType: !479, size: 64, offset: 512)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1241, file: !491, line: 64, baseType: !479, size: 64, offset: 576)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1241, file: !491, line: 65, baseType: !479, size: 64, offset: 640)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1241, file: !491, line: 66, baseType: !479, size: 64, offset: 704)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1241, file: !491, line: 68, baseType: !506, size: 64, offset: 768)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1241, file: !491, line: 70, baseType: !1240, size: 64, offset: 832)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1241, file: !491, line: 72, baseType: !483, size: 32, offset: 896)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1241, file: !491, line: 73, baseType: !483, size: 32, offset: 928)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1241, file: !491, line: 74, baseType: !512, size: 64, offset: 960)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1241, file: !491, line: 77, baseType: !516, size: 16, offset: 1024)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1241, file: !491, line: 78, baseType: !518, size: 8, offset: 1040)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1241, file: !491, line: 79, baseType: !520, size: 8, offset: 1048)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1241, file: !491, line: 81, baseType: !524, size: 64, offset: 1088)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1241, file: !491, line: 89, baseType: !527, size: 64, offset: 1152)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1241, file: !491, line: 91, baseType: !529, size: 64, offset: 1216)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1241, file: !491, line: 92, baseType: !532, size: 64, offset: 1280)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1241, file: !491, line: 93, baseType: !1240, size: 64, offset: 1344)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1241, file: !491, line: 94, baseType: !536, size: 64, offset: 1408)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1241, file: !491, line: 95, baseType: !538, size: 64, offset: 1472)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1241, file: !491, line: 96, baseType: !483, size: 32, offset: 1536)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1241, file: !491, line: 98, baseType: !543, size: 160, offset: 1568)
!1272 = !DISubprogram(name: "fclose", scope: !486, file: !486, line: 213, type: !1238, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !484)
!1273 = !DISubprogram(name: "lseek", scope: !1274, file: !1274, line: 334, type: !1275, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !484)
!1274 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!1275 = !DISubroutineType(types: !1276)
!1276 = !{!514, !483, !514, !483}
!1277 = !DISubprogram(name: "rpl_fflush", scope: !1185, file: !1185, line: 718, type: !1238, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !484)
!1278 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1279, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !484, retainedTypes: !1280, splitDebugInlining: false, nameTableKind: None)
!1279 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1280 = !{!536, !1281, !1316}
!1281 = !DISubprogram(name: "fflush", scope: !486, file: !486, line: 218, type: !1282, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !484)
!1282 = !DISubroutineType(types: !1283)
!1283 = !{!483, !1284}
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64)
!1285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !491, line: 49, size: 1728, elements: !1286)
!1286 = !{!1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315}
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1285, file: !491, line: 51, baseType: !483, size: 32)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1285, file: !491, line: 54, baseType: !479, size: 64, offset: 64)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1285, file: !491, line: 55, baseType: !479, size: 64, offset: 128)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1285, file: !491, line: 56, baseType: !479, size: 64, offset: 192)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1285, file: !491, line: 57, baseType: !479, size: 64, offset: 256)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1285, file: !491, line: 58, baseType: !479, size: 64, offset: 320)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1285, file: !491, line: 59, baseType: !479, size: 64, offset: 384)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1285, file: !491, line: 60, baseType: !479, size: 64, offset: 448)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1285, file: !491, line: 61, baseType: !479, size: 64, offset: 512)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1285, file: !491, line: 64, baseType: !479, size: 64, offset: 576)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1285, file: !491, line: 65, baseType: !479, size: 64, offset: 640)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1285, file: !491, line: 66, baseType: !479, size: 64, offset: 704)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1285, file: !491, line: 68, baseType: !506, size: 64, offset: 768)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1285, file: !491, line: 70, baseType: !1284, size: 64, offset: 832)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1285, file: !491, line: 72, baseType: !483, size: 32, offset: 896)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1285, file: !491, line: 73, baseType: !483, size: 32, offset: 928)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1285, file: !491, line: 74, baseType: !512, size: 64, offset: 960)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1285, file: !491, line: 77, baseType: !516, size: 16, offset: 1024)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1285, file: !491, line: 78, baseType: !518, size: 8, offset: 1040)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1285, file: !491, line: 79, baseType: !520, size: 8, offset: 1048)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1285, file: !491, line: 81, baseType: !524, size: 64, offset: 1088)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1285, file: !491, line: 89, baseType: !527, size: 64, offset: 1152)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1285, file: !491, line: 91, baseType: !529, size: 64, offset: 1216)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1285, file: !491, line: 92, baseType: !532, size: 64, offset: 1280)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1285, file: !491, line: 93, baseType: !1284, size: 64, offset: 1344)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1285, file: !491, line: 94, baseType: !536, size: 64, offset: 1408)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1285, file: !491, line: 95, baseType: !538, size: 64, offset: 1472)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1285, file: !491, line: 96, baseType: !483, size: 32, offset: 1536)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1285, file: !491, line: 98, baseType: !543, size: 160, offset: 1568)
!1316 = !DISubprogram(name: "rpl_fseeko", scope: !1185, file: !1185, line: 1034, type: !1317, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !484)
!1317 = !DISubroutineType(types: !1318)
!1318 = !{!483, !1284, !514, !483}
!1319 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1320, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !484, retainedTypes: !1321, splitDebugInlining: false, nameTableKind: None)
!1320 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1321 = !{!536, !1322, !1273, !1357}
!1322 = !DISubprogram(name: "fileno", scope: !486, file: !486, line: 786, type: !1323, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !484)
!1323 = !DISubroutineType(types: !1324)
!1324 = !{!483, !1325}
!1325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1326, size: 64)
!1326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !491, line: 49, size: 1728, elements: !1327)
!1327 = !{!1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356}
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1326, file: !491, line: 51, baseType: !483, size: 32)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1326, file: !491, line: 54, baseType: !479, size: 64, offset: 64)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1326, file: !491, line: 55, baseType: !479, size: 64, offset: 128)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1326, file: !491, line: 56, baseType: !479, size: 64, offset: 192)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1326, file: !491, line: 57, baseType: !479, size: 64, offset: 256)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1326, file: !491, line: 58, baseType: !479, size: 64, offset: 320)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1326, file: !491, line: 59, baseType: !479, size: 64, offset: 384)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1326, file: !491, line: 60, baseType: !479, size: 64, offset: 448)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1326, file: !491, line: 61, baseType: !479, size: 64, offset: 512)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1326, file: !491, line: 64, baseType: !479, size: 64, offset: 576)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1326, file: !491, line: 65, baseType: !479, size: 64, offset: 640)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1326, file: !491, line: 66, baseType: !479, size: 64, offset: 704)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1326, file: !491, line: 68, baseType: !506, size: 64, offset: 768)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1326, file: !491, line: 70, baseType: !1325, size: 64, offset: 832)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1326, file: !491, line: 72, baseType: !483, size: 32, offset: 896)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1326, file: !491, line: 73, baseType: !483, size: 32, offset: 928)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1326, file: !491, line: 74, baseType: !512, size: 64, offset: 960)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1326, file: !491, line: 77, baseType: !516, size: 16, offset: 1024)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1326, file: !491, line: 78, baseType: !518, size: 8, offset: 1040)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1326, file: !491, line: 79, baseType: !520, size: 8, offset: 1048)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1326, file: !491, line: 81, baseType: !524, size: 64, offset: 1088)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1326, file: !491, line: 89, baseType: !527, size: 64, offset: 1152)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1326, file: !491, line: 91, baseType: !529, size: 64, offset: 1216)
