; ModuleID = 'coreutils-8.32/src/od.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.tspec = type { i32, i32, void (i64, i64, i8*, i8*, i32, i32)*, [8 x i8], i8, i32, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.lconv = type { i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8 }
%union.anon.2 = type { i16 }
%union.anon.5 = type { i64 }
%union.anon.6 = type { float }
%union.anon.7 = type { double }
%union.anon.8 = type { x86_fp80 }
%union.anon.3 = type { i32 }
%struct.__mbstate_t = type { i32, %union.anon.3 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }


!34 = !DIEnumerator(name: "CHARACTER", value: 6, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !37, file: !36, line: 186, baseType: !6, size: 32, elements: !50)
!36 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!37 = distinct !DISubprogram(name: "x2nrealloc", scope: !36, file: !36, line: 174, type: !38, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !45)
!38 = !DISubroutineType(types: !39)
!39 = !{!40, !40, !41, !42}
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !43, line: 46, baseType: !44)
!43 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!44 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!45 = !{!46, !47, !48, !49}
!46 = !DILocalVariable(name: "p", arg: 1, scope: !37, file: !36, line: 174, type: !40)
!47 = !DILocalVariable(name: "pn", arg: 2, scope: !37, file: !36, line: 174, type: !41)
!48 = !DILocalVariable(name: "s", arg: 3, scope: !37, file: !36, line: 174, type: !42)
!49 = !DILocalVariable(name: "n", scope: !37, file: !36, line: 176, type: !42)
!50 = !{!51}
!51 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!52 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 85, baseType: !6, size: 32, elements: !53)
!53 = !{!54}
!54 = !DIEnumerator(name: "FMT_BYTES_ALLOCATED", value: 8, isUnsigned: true)
!55 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !56, line: 46, baseType: !6, size: 32, elements: !57)
!56 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!57 = !{!58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69}
!58 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!59 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!60 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!61 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!62 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!63 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!64 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!65 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!66 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!67 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!68 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!69 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!70 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "endian_type", file: !3, line: 283, baseType: !6, size: 32, elements: !71)
!71 = !{!72, !73}
!72 = !DIEnumerator(name: "endian_little", value: 0, isUnsigned: true)
!73 = !DIEnumerator(name: "endian_big", value: 1, isUnsigned: true)
!74 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !75, line: 32, baseType: !6, size: 32, elements: !76)
!75 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!76 = !{!77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87}
!77 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!78 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!79 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!80 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!81 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!82 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!83 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!84 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!85 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!86 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!87 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!88 = !{!89, !99, !156, !160, !164, !167, !170, !177, !192, !196, !201, !40, !205, !209, !93, !211, !6, !215, !44, !217, !42, !221, !222, !225, !95, !255, !259, !264, !268, !97, !130, !272, !273, !276, !279, !280, !283, !286, !289, !292, !295}
!89 = !DISubprogram(name: "dcgettext", scope: !90, file: !90, line: 51, type: !91, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !98)
!90 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!91 = !DISubroutineType(types: !92)
!92 = !{!93, !95, !95, !97}
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !94)
!97 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!98 = !{}
!99 = !DISubprogram(name: "fputs_unlocked", scope: !100, file: !100, line: 662, type: !101, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !98)
!100 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!101 = !DISubroutineType(types: !102)
!102 = !{!97, !95, !103}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !105, line: 49, size: 1728, elements: !106)
!105 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!106 = !{!107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !122, !123, !124, !125, !129, !131, !133, !137, !140, !142, !145, !148, !149, !150, !151, !152}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !104, file: !105, line: 51, baseType: !97, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !104, file: !105, line: 54, baseType: !93, size: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !104, file: !105, line: 55, baseType: !93, size: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !104, file: !105, line: 56, baseType: !93, size: 64, offset: 192)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !104, file: !105, line: 57, baseType: !93, size: 64, offset: 256)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !104, file: !105, line: 58, baseType: !93, size: 64, offset: 320)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !104, file: !105, line: 59, baseType: !93, size: 64, offset: 384)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !104, file: !105, line: 60, baseType: !93, size: 64, offset: 448)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !104, file: !105, line: 61, baseType: !93, size: 64, offset: 512)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !104, file: !105, line: 64, baseType: !93, size: 64, offset: 576)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !104, file: !105, line: 65, baseType: !93, size: 64, offset: 640)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !104, file: !105, line: 66, baseType: !93, size: 64, offset: 704)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !104, file: !105, line: 68, baseType: !120, size: 64, offset: 768)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !105, line: 36, flags: DIFlagFwdDecl)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !104, file: !105, line: 70, baseType: !103, size: 64, offset: 832)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !104, file: !105, line: 72, baseType: !97, size: 32, offset: 896)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !104, file: !105, line: 73, baseType: !97, size: 32, offset: 928)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !104, file: !105, line: 74, baseType: !126, size: 64, offset: 960)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !127, line: 152, baseType: !128)
!127 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!128 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !104, file: !105, line: 77, baseType: !130, size: 16, offset: 1024)
!130 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !104, file: !105, line: 78, baseType: !132, size: 8, offset: 1040)
!132 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !104, file: !105, line: 79, baseType: !134, size: 8, offset: 1048)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 8, elements: !135)
!135 = !{!136}
!136 = !DISubrange(count: 1)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !104, file: !105, line: 81, baseType: !138, size: 64, offset: 1088)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !105, line: 43, baseType: null)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !104, file: !105, line: 89, baseType: !141, size: 64, offset: 1152)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !127, line: 153, baseType: !128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !104, file: !105, line: 91, baseType: !143, size: 64, offset: 1216)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !105, line: 37, flags: DIFlagFwdDecl)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !104, file: !105, line: 92, baseType: !146, size: 64, offset: 1280)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !105, line: 38, flags: DIFlagFwdDecl)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !104, file: !105, line: 93, baseType: !103, size: 64, offset: 1344)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !104, file: !105, line: 94, baseType: !40, size: 64, offset: 1408)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !104, file: !105, line: 95, baseType: !42, size: 64, offset: 1472)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !104, file: !105, line: 96, baseType: !97, size: 32, offset: 1536)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !104, file: !105, line: 98, baseType: !153, size: 160, offset: 1568)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 160, elements: !154)
!154 = !{!155}
!155 = !DISubrange(count: 20)
!156 = !DISubprogram(name: "set_program_name", scope: !157, file: !157, line: 37, type: !158, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !98)
!157 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!158 = !DISubroutineType(types: !159)
!159 = !{null, !95}
!160 = !DISubprogram(name: "setlocale", scope: !161, file: !161, line: 122, type: !162, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !98)
!161 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!162 = !DISubroutineType(types: !163)
!163 = !{!93, !97, !95}
!164 = !DISubprogram(name: "bindtextdomain", scope: !90, file: !90, line: 86, type: !165, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !98)
!165 = !DISubroutineType(types: !166)
!166 = !{!93, !95, !95}
!167 = !DISubprogram(name: "textdomain", scope: !90, file: !90, line: 82, type: !168, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !98)
!168 = !DISubroutineType(types: !169)
!169 = !{!93, !95}
!170 = !DISubprogram(name: "atexit", scope: !171, file: !171, line: 595, type: !172, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !98)
!171 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!172 = !DISubroutineType(types: !173)
!173 = !{!97, !174}
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DISubroutineType(types: !176)
!176 = !{null}
!177 = !DISubprogram(name: "getopt_long", scope: !178, file: !178, line: 66, type: !179, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !98)
!178 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!179 = !DISubroutineType(types: !180)
!180 = !{!97, !97, !181, !95, !183, !190}
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !93)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !185)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !178, line: 50, size: 256, elements: !186)
!186 = !{!187, !188, !189, !191}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !185, file: !178, line: 52, baseType: !95, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !185, file: !178, line: 55, baseType: !97, size: 32, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !185, file: !178, line: 56, baseType: !190, size: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !185, file: !178, line: 57, baseType: !97, size: 32, offset: 192)
!192 = !DISubprogram(name: "error", scope: !193, file: !193, line: 52, type: !194, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !98)
!193 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!194 = !DISubroutineType(types: !195)
!195 = !{null, !97, !97, !95, null}
!196 = !DISubprogram(name: "xstrtoumax", scope: !19, file: !19, line: 48, type: !197, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !98)
!197 = !DISubroutineType(types: !198)
!198 = !{!18, !95, !199, !97, !200, !95}
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!201 = !DISubprogram(name: "xstrtol_fatal", scope: !202, file: !202, line: 41, type: !203, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !98)
!202 = !DIFile(filename: "./lib/xstrtol-error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!203 = !DISubroutineType(types: !204)
!204 = !{null, !18, !97, !94, !183, !95}
!205 = !DISubprogram(name: "quote", scope: !206, file: !206, line: 44, type: !207, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !98)
!206 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!207 = !DISubroutineType(types: !208)
!208 = !{!95, !95}
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!211 = !DISubprogram(name: "version_etc", scope: !212, file: !212, line: 69, type: !213, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !98)
!212 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!213 = !DISubroutineType(types: !214)
!214 = !{null, !103, !95, !95, !95, null}
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !95)
!217 = !DISubprogram(name: "rpl_fclose", scope: !218, file: !218, line: 672, type: !219, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !98)
!218 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!219 = !DISubroutineType(types: !220)
!220 = !{!97, !103}
!221 = !DISubprogram(name: "xalloc_die", scope: !36, file: !36, line: 51, type: !175, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !98)
!222 = !DISubprogram(name: "xrealloc", scope: !36, file: !36, line: 59, type: !223, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !98)
!223 = !DISubroutineType(types: !224)
!224 = !{!40, !40, !44}
!225 = !DISubprogram(name: "localeconv", scope: !161, file: !161, line: 125, type: !226, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !98)
!226 = !DISubroutineType(types: !227)
!227 = !{!228}
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", file: !161, line: 51, size: 768, elements: !230)
!230 = !{!231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !229, file: !161, line: 55, baseType: !93, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !229, file: !161, line: 56, baseType: !93, size: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !229, file: !161, line: 62, baseType: !93, size: 64, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !229, file: !161, line: 68, baseType: !93, size: 64, offset: 192)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !229, file: !161, line: 69, baseType: !93, size: 64, offset: 256)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !229, file: !161, line: 70, baseType: !93, size: 64, offset: 320)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !229, file: !161, line: 71, baseType: !93, size: 64, offset: 384)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !229, file: !161, line: 72, baseType: !93, size: 64, offset: 448)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !229, file: !161, line: 73, baseType: !93, size: 64, offset: 512)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !229, file: !161, line: 74, baseType: !93, size: 64, offset: 576)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !229, file: !161, line: 75, baseType: !94, size: 8, offset: 640)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !229, file: !161, line: 76, baseType: !94, size: 8, offset: 648)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !229, file: !161, line: 78, baseType: !94, size: 8, offset: 656)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !229, file: !161, line: 80, baseType: !94, size: 8, offset: 664)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !229, file: !161, line: 82, baseType: !94, size: 8, offset: 672)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !229, file: !161, line: 84, baseType: !94, size: 8, offset: 680)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !229, file: !161, line: 91, baseType: !94, size: 8, offset: 688)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !229, file: !161, line: 92, baseType: !94, size: 8, offset: 696)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !229, file: !161, line: 95, baseType: !94, size: 8, offset: 704)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !229, file: !161, line: 97, baseType: !94, size: 8, offset: 712)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !229, file: !161, line: 99, baseType: !94, size: 8, offset: 720)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !229, file: !161, line: 101, baseType: !94, size: 8, offset: 728)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !229, file: !161, line: 108, baseType: !94, size: 8, offset: 736)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !229, file: !161, line: 109, baseType: !94, size: 8, offset: 744)
!255 = !DISubprogram(name: "xprintf", scope: !256, file: !256, line: 35, type: !257, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !98)
!256 = !DIFile(filename: "./lib/xprintf.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!257 = !DISubroutineType(types: !258)
!258 = !{!97, !95, null}
!259 = !DISubprogram(name: "ftoastr", scope: !260, file: !260, line: 47, type: !261, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !98)
!260 = !DIFile(filename: "./lib/ftoastr.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!261 = !DISubroutineType(types: !262)
!262 = !{!97, !93, !44, !97, !97, !263}
!263 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!264 = !DISubprogram(name: "dtoastr", scope: !260, file: !260, line: 48, type: !265, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !98)
!265 = !DISubroutineType(types: !266)
!266 = !{!97, !93, !44, !97, !97, !267}
!267 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!268 = !DISubprogram(name: "ldtoastr", scope: !260, file: !260, line: 49, type: !269, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !98)
!269 = !DISubroutineType(types: !270)
!270 = !{!97, !93, !44, !97, !97, !271}
!271 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!272 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!273 = !DISubprogram(name: "quotearg_n_style_colon", scope: !75, file: !75, line: 397, type: !274, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !98)
!274 = !DISubroutineType(types: !275)
!275 = !{!93, !97, !74, !95}
!276 = !DISubprogram(name: "setvbuf", scope: !100, file: !100, line: 308, type: !277, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !98)
!277 = !DISubroutineType(types: !278)
!278 = !{!97, !103, !93, !97, !44}
!279 = !DISubprogram(name: "fileno", scope: !100, file: !100, line: 786, type: !219, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !98)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !281, line: 102, baseType: !282)
!281 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !127, line: 73, baseType: !44)
!283 = !DISubprogram(name: "rpl_fseeko", scope: !218, file: !218, line: 1034, type: !284, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !98)
!284 = !DISubroutineType(types: !285)
!285 = !{!97, !103, !128, !97}
!286 = !DISubprogram(name: "xmalloc", scope: !36, file: !36, line: 53, type: !287, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !98)
!287 = !DISubroutineType(types: !288)
!288 = !{!40, !44}
!289 = !DISubprogram(name: "free", scope: !171, file: !171, line: 565, type: !290, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !98)
!290 = !DISubroutineType(types: !291)
!291 = !{null, !40}
!292 = !DISubprogram(name: "x2realloc", scope: !36, file: !36, line: 61, type: !293, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !98)
!293 = !DISubroutineType(types: !294)
!294 = !{!40, !40, !200}
!295 = !DISubprogram(name: "fgetc", scope: !100, file: !100, line: 485, type: !219, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !98)
!296 = !{!297, !342, !344, !346, !348, !350, !352, !354, !356, !361, !363, !365, !383, !385, !387, !389, !391, !396, !0, !398, !403, !405, !410, !415, !417, !419, !423, !425, !427, !429, !435, !437, !443, !448, !451, !453, !459, !482}
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(name: "multipliers", scope: !299, file: !3, line: 1578, type: !339, isLocal: true, isDefinition: true)
!299 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 1568, type: !300, scopeLine: 1569, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !302)
!300 = !DISubroutineType(types: !301)
!301 = !{!97, !97, !199}
!302 = !{!303, !304, !305, !306, !307, !308, !309, !311, !312, !313, !314, !315, !317, !318, !319, !320, !324, !327, !328, !332, !333, !337, !338}
!303 = !DILocalVariable(name: "argc", arg: 1, scope: !299, file: !3, line: 1568, type: !97)
!304 = !DILocalVariable(name: "argv", arg: 2, scope: !299, file: !3, line: 1568, type: !199)
!305 = !DILocalVariable(name: "n_files", scope: !299, file: !3, line: 1570, type: !97)
!306 = !DILocalVariable(name: "i", scope: !299, file: !3, line: 1571, type: !42)
!307 = !DILocalVariable(name: "l_c_m", scope: !299, file: !3, line: 1572, type: !97)
!308 = !DILocalVariable(name: "desired_width", scope: !299, file: !3, line: 1573, type: !42)
!309 = !DILocalVariable(name: "modern", scope: !299, file: !3, line: 1574, type: !310)
!310 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!311 = !DILocalVariable(name: "width_specified", scope: !299, file: !3, line: 1575, type: !310)
!312 = !DILocalVariable(name: "ok", scope: !299, file: !3, line: 1576, type: !310)
!313 = !DILocalVariable(name: "width_per_block", scope: !299, file: !3, line: 1577, type: !42)
!314 = !DILocalVariable(name: "pseudo_start", scope: !299, file: !3, line: 1582, type: !280)
!315 = !DILocalVariable(name: "tmp", scope: !316, file: !3, line: 1626, type: !280)
!316 = distinct !DILexicalBlock(scope: !299, file: !3, line: 1625, column: 5)
!317 = !DILocalVariable(name: "s_err", scope: !316, file: !3, line: 1627, type: !18)
!318 = !DILocalVariable(name: "oi", scope: !316, file: !3, line: 1628, type: !97)
!319 = !DILocalVariable(name: "c", scope: !316, file: !3, line: 1629, type: !97)
!320 = !DILocalVariable(name: "w_tmp", scope: !321, file: !3, line: 1773, type: !280)
!321 = distinct !DILexicalBlock(scope: !322, file: !3, line: 1772, column: 13)
!322 = distinct !DILexicalBlock(scope: !323, file: !3, line: 1767, column: 15)
!323 = distinct !DILexicalBlock(scope: !316, file: !3, line: 1634, column: 9)
!324 = !DILocalVariable(name: "o1", scope: !325, file: !3, line: 1816, type: !280)
!325 = distinct !DILexicalBlock(scope: !326, file: !3, line: 1815, column: 5)
!326 = distinct !DILexicalBlock(scope: !299, file: !3, line: 1814, column: 7)
!327 = !DILocalVariable(name: "o2", scope: !325, file: !3, line: 1817, type: !280)
!328 = !DILocalVariable(name: "fields_per_block", scope: !329, file: !3, line: 1953, type: !97)
!329 = distinct !DILexicalBlock(scope: !330, file: !3, line: 1952, column: 5)
!330 = distinct !DILexicalBlock(scope: !331, file: !3, line: 1951, column: 3)
!331 = distinct !DILexicalBlock(scope: !299, file: !3, line: 1951, column: 3)
!332 = !DILocalVariable(name: "block_width", scope: !329, file: !3, line: 1954, type: !97)
!333 = !DILocalVariable(name: "fields_per_block", scope: !334, file: !3, line: 1960, type: !97)
!334 = distinct !DILexicalBlock(scope: !335, file: !3, line: 1959, column: 5)
!335 = distinct !DILexicalBlock(scope: !336, file: !3, line: 1958, column: 3)
!336 = distinct !DILexicalBlock(scope: !299, file: !3, line: 1958, column: 3)
!337 = !DILocalVariable(name: "block_width", scope: !334, file: !3, line: 1961, type: !97)
!338 = !DILabel(scope: !299, name: "cleanup", file: !3, line: 1981)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 104, elements: !340)
!340 = !{!341}
!341 = !DISubrange(count: 13)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "address_base", scope: !2, file: !3, line: 178, type: !97, isLocal: true, isDefinition: true)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "address_pad_len", scope: !2, file: !3, line: 186, type: !97, isLocal: true, isDefinition: true)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "string_min", scope: !2, file: !3, line: 189, type: !42, isLocal: true, isDefinition: true)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "flag_dump_strings", scope: !2, file: !3, line: 192, type: !310, isLocal: true, isDefinition: true)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "traditional", scope: !2, file: !3, line: 197, type: !310, isLocal: true, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "flag_pseudo_start", scope: !2, file: !3, line: 200, type: !310, isLocal: true, isDefinition: true)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "pseudo_offset", scope: !2, file: !3, line: 204, type: !280, isLocal: true, isDefinition: true)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(name: "format_address", scope: !2, file: !3, line: 208, type: !358, isLocal: true, isDefinition: true)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{null, !280, !94}
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "max_bytes_to_format", scope: !2, file: !3, line: 218, type: !280, isLocal: true, isDefinition: true)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "end_offset", scope: !2, file: !3, line: 221, type: !280, isLocal: true, isDefinition: true)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "spec", scope: !2, file: !3, line: 229, type: !367, isLocal: true, isDefinition: true)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tspec", file: !3, line: 101, size: 320, elements: !369)
!369 = !{!370, !371, !372, !376, !380, !381, !382}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !368, file: !3, line: 103, baseType: !26, size: 32)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !368, file: !3, line: 104, baseType: !5, size: 32, offset: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "print_function", scope: !368, file: !3, line: 109, baseType: !373, size: 64, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DISubroutineType(types: !375)
!375 = !{null, !42, !42, !209, !95, !97, !97}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "fmt_string", scope: !368, file: !3, line: 111, baseType: !377, size: 64, offset: 128)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 64, elements: !378)
!378 = !{!379}
!379 = !DISubrange(count: 8)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "hexl_mode_trailer", scope: !368, file: !3, line: 112, baseType: !310, size: 8, offset: 192)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "field_width", scope: !368, file: !3, line: 113, baseType: !97, size: 32, offset: 224)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "pad_width", scope: !368, file: !3, line: 114, baseType: !97, size: 32, offset: 256)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(name: "n_specs", scope: !2, file: !3, line: 232, type: !42, isLocal: true, isDefinition: true)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "n_specs_allocated", scope: !2, file: !3, line: 235, type: !42, isLocal: true, isDefinition: true)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "bytes_per_block", scope: !2, file: !3, line: 241, type: !42, isLocal: true, isDefinition: true)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "file_list", scope: !2, file: !3, line: 248, type: !215, isLocal: true, isDefinition: true)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "in_stream", scope: !2, file: !3, line: 255, type: !393, isLocal: true, isDefinition: true)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !395, line: 7, baseType: !104)
!395 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "")
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 258, type: !310, isLocal: true, isDefinition: true)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "fp_type_size", scope: !2, file: !3, line: 264, type: !400, isLocal: true, isDefinition: true)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 544, elements: !401)
!401 = !{!402}
!402 = !DISubrange(count: 17)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(name: "input_swap", scope: !2, file: !3, line: 271, type: !310, isLocal: true, isDefinition: true)
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(name: "short_options", scope: !2, file: !3, line: 273, type: !407, isLocal: true, isDefinition: true)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 280, elements: !408)
!408 = !{!409}
!409 = !DISubrange(count: 35)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 299, type: !412, isLocal: true, isDefinition: true)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 3072, elements: !413)
!413 = !{!414}
!414 = !DISubrange(count: 12)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(name: "n_bytes_to_skip", scope: !2, file: !3, line: 211, type: !280, isLocal: true, isDefinition: true)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(name: "limit_bytes_to_format", scope: !2, file: !3, line: 215, type: !310, isLocal: true, isDefinition: true)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(name: "bytes_to_signed_dec_digits", scope: !2, file: !3, line: 130, type: !421, isLocal: true, isDefinition: true)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !422, size: 544, elements: !401)
!422 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(name: "bytes_to_oct_digits", scope: !2, file: !3, line: 127, type: !421, isLocal: true, isDefinition: true)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(name: "bytes_to_unsigned_dec_digits", scope: !2, file: !3, line: 133, type: !421, isLocal: true, isDefinition: true)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(name: "bytes_to_hex_digits", scope: !2, file: !3, line: 136, type: !421, isLocal: true, isDefinition: true)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(name: "charname", scope: !2, file: !3, line: 168, type: !431, isLocal: true, isDefinition: true)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 1056, elements: !432)
!432 = !{!433, !434}
!433 = !DISubrange(count: 33)
!434 = !DISubrange(count: 4)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(name: "abbreviate_duplicate_blocks", scope: !2, file: !3, line: 226, type: !310, isLocal: true, isDefinition: true)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(name: "endian_types", scope: !2, file: !3, line: 294, type: !439, isLocal: true, isDefinition: true)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !440, size: 64, elements: !441)
!440 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !70)
!441 = !{!442}
!442 = !DISubrange(count: 2)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(name: "endian_args", scope: !2, file: !3, line: 289, type: !445, isLocal: true, isDefinition: true)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !216, size: 192, elements: !446)
!446 = !{!447}
!447 = !DISubrange(count: 3)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "default_file_list", scope: !2, file: !3, line: 252, type: !450, isLocal: true, isDefinition: true)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !216, size: 128, elements: !441)
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(name: "input_filename", scope: !2, file: !3, line: 245, type: !95, isLocal: true, isDefinition: true)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(name: "width_bytes", scope: !2, file: !3, line: 150, type: !455, isLocal: true, isDefinition: true)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !456, size: 288, elements: !457)
!456 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !97)
!457 = !{!458}
!458 = !DISubrange(count: 9)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(name: "first", scope: !461, file: !3, line: 1191, type: !310, isLocal: true, isDefinition: true)
!461 = distinct !DISubprogram(name: "write_block", scope: !3, file: !3, line: 1188, type: !462, scopeLine: 1190, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !464)
!462 = !DISubroutineType(types: !463)
!463 = !{null, !280, !42, !95, !95}
!464 = !{!465, !466, !467, !468, !469, !473, !476, !477, !478, !481}
!465 = !DILocalVariable(name: "current_offset", arg: 1, scope: !461, file: !3, line: 1188, type: !280)
!466 = !DILocalVariable(name: "n_bytes", arg: 2, scope: !461, file: !3, line: 1188, type: !42)
!467 = !DILocalVariable(name: "prev_block", arg: 3, scope: !461, file: !3, line: 1189, type: !95)
!468 = !DILocalVariable(name: "curr_block", arg: 4, scope: !461, file: !3, line: 1189, type: !95)
!469 = !DILocalVariable(name: "i", scope: !470, file: !3, line: 1214, type: !42)
!470 = distinct !DILexicalBlock(scope: !471, file: !3, line: 1214, column: 7)
!471 = distinct !DILexicalBlock(scope: !472, file: !3, line: 1212, column: 5)
!472 = distinct !DILexicalBlock(scope: !461, file: !3, line: 1196, column: 7)
!473 = !DILocalVariable(name: "datum_width", scope: !474, file: !3, line: 1216, type: !97)
!474 = distinct !DILexicalBlock(scope: !475, file: !3, line: 1215, column: 9)
!475 = distinct !DILexicalBlock(scope: !470, file: !3, line: 1214, column: 7)
!476 = !DILocalVariable(name: "fields_per_block", scope: !474, file: !3, line: 1217, type: !97)
!477 = !DILocalVariable(name: "blank_fields", scope: !474, file: !3, line: 1218, type: !97)
!478 = !DILocalVariable(name: "field_width", scope: !479, file: !3, line: 1229, type: !97)
!479 = distinct !DILexicalBlock(scope: !480, file: !3, line: 1227, column: 13)
!480 = distinct !DILexicalBlock(scope: !474, file: !3, line: 1226, column: 15)
!481 = !DILocalVariable(name: "pad_width", scope: !479, file: !3, line: 1230, type: !97)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(name: "prev_pair_equal", scope: !461, file: !3, line: 1192, type: !310, isLocal: true, isDefinition: true)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 288, elements: !457)
!485 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!486 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!487 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!488 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!489 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!490 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!491 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!492 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!493 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(name: "Version", scope: !496, file: !497, line: 2, type: !95, isLocal: false, isDefinition: true)
!496 = distinct !DICompileUnit(language: DW_LANG_C99, file: !497, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !98, globals: !498, splitDebugInlining: false, nameTableKind: None)
!497 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!498 = !{!494}
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !501, file: !502, line: 67, type: !548, isLocal: false, isDefinition: true)
!501 = distinct !DICompileUnit(language: DW_LANG_C99, file: !502, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !503, retainedTypes: !504, globals: !547, splitDebugInlining: false, nameTableKind: None)
!502 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!503 = !{!74}
!504 = !{!40, !95, !89, !505, !506, !192, !509, !205, !544, !272}
!505 = !DISubprogram(name: "quotearg_n_style", scope: !75, file: !75, line: 368, type: !274, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !98)
!506 = !DISubprogram(name: "quote_n", scope: !206, file: !206, line: 40, type: !507, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !98)
!507 = !DISubroutineType(types: !508)
!508 = !{!95, !97, !95}
!509 = !DISubprogram(name: "fputs_unlocked", scope: !100, file: !100, line: 662, type: !510, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !98)
!510 = !DISubroutineType(types: !511)
!511 = !{!97, !95, !512}
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !105, line: 49, size: 1728, elements: !514)
!514 = !{!515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !513, file: !105, line: 51, baseType: !97, size: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !513, file: !105, line: 54, baseType: !93, size: 64, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !513, file: !105, line: 55, baseType: !93, size: 64, offset: 128)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !513, file: !105, line: 56, baseType: !93, size: 64, offset: 192)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !513, file: !105, line: 57, baseType: !93, size: 64, offset: 256)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !513, file: !105, line: 58, baseType: !93, size: 64, offset: 320)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !513, file: !105, line: 59, baseType: !93, size: 64, offset: 384)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !513, file: !105, line: 60, baseType: !93, size: 64, offset: 448)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !513, file: !105, line: 61, baseType: !93, size: 64, offset: 512)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !513, file: !105, line: 64, baseType: !93, size: 64, offset: 576)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !513, file: !105, line: 65, baseType: !93, size: 64, offset: 640)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !513, file: !105, line: 66, baseType: !93, size: 64, offset: 704)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !513, file: !105, line: 68, baseType: !120, size: 64, offset: 768)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !513, file: !105, line: 70, baseType: !512, size: 64, offset: 832)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !513, file: !105, line: 72, baseType: !97, size: 32, offset: 896)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !513, file: !105, line: 73, baseType: !97, size: 32, offset: 928)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !513, file: !105, line: 74, baseType: !126, size: 64, offset: 960)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !513, file: !105, line: 77, baseType: !130, size: 16, offset: 1024)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !513, file: !105, line: 78, baseType: !132, size: 8, offset: 1040)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !513, file: !105, line: 79, baseType: !134, size: 8, offset: 1048)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !513, file: !105, line: 81, baseType: !138, size: 64, offset: 1088)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !513, file: !105, line: 89, baseType: !141, size: 64, offset: 1152)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !513, file: !105, line: 91, baseType: !143, size: 64, offset: 1216)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !513, file: !105, line: 92, baseType: !146, size: 64, offset: 1280)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !513, file: !105, line: 93, baseType: !512, size: 64, offset: 1344)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !513, file: !105, line: 94, baseType: !40, size: 64, offset: 1408)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !513, file: !105, line: 95, baseType: !42, size: 64, offset: 1472)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !513, file: !105, line: 96, baseType: !97, size: 32, offset: 1536)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !513, file: !105, line: 98, baseType: !153, size: 160, offset: 1568)
!544 = !DISubprogram(name: "usage", scope: !502, file: !502, line: 56, type: !545, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !98)
!545 = !DISubroutineType(types: !546)
!546 = !{null, !97}
!547 = !{!499}
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !549, line: 61, baseType: !174)
!549 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(name: "file_name", scope: !552, file: !553, line: 46, type: !95, isLocal: true, isDefinition: true)
!552 = distinct !DICompileUnit(language: DW_LANG_C99, file: !553, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !98, retainedTypes: !554, globals: !592, splitDebugInlining: false, nameTableKind: None)
!553 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!554 = !{!555, !89, !591, !192}
!555 = !DISubprogram(name: "close_stream", scope: !556, file: !556, line: 2, type: !557, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !98)
!556 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!557 = !DISubroutineType(types: !558)
!558 = !{!97, !559}
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !105, line: 49, size: 1728, elements: !561)
!561 = !{!562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !560, file: !105, line: 51, baseType: !97, size: 32)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !560, file: !105, line: 54, baseType: !93, size: 64, offset: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !560, file: !105, line: 55, baseType: !93, size: 64, offset: 128)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !560, file: !105, line: 56, baseType: !93, size: 64, offset: 192)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !560, file: !105, line: 57, baseType: !93, size: 64, offset: 256)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !560, file: !105, line: 58, baseType: !93, size: 64, offset: 320)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !560, file: !105, line: 59, baseType: !93, size: 64, offset: 384)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !560, file: !105, line: 60, baseType: !93, size: 64, offset: 448)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !560, file: !105, line: 61, baseType: !93, size: 64, offset: 512)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !560, file: !105, line: 64, baseType: !93, size: 64, offset: 576)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !560, file: !105, line: 65, baseType: !93, size: 64, offset: 640)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !560, file: !105, line: 66, baseType: !93, size: 64, offset: 704)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !560, file: !105, line: 68, baseType: !120, size: 64, offset: 768)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !560, file: !105, line: 70, baseType: !559, size: 64, offset: 832)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !560, file: !105, line: 72, baseType: !97, size: 32, offset: 896)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !560, file: !105, line: 73, baseType: !97, size: 32, offset: 928)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !560, file: !105, line: 74, baseType: !126, size: 64, offset: 960)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !560, file: !105, line: 77, baseType: !130, size: 16, offset: 1024)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !560, file: !105, line: 78, baseType: !132, size: 8, offset: 1040)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !560, file: !105, line: 79, baseType: !134, size: 8, offset: 1048)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !560, file: !105, line: 81, baseType: !138, size: 64, offset: 1088)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !560, file: !105, line: 89, baseType: !141, size: 64, offset: 1152)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !560, file: !105, line: 91, baseType: !143, size: 64, offset: 1216)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !560, file: !105, line: 92, baseType: !146, size: 64, offset: 1280)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !560, file: !105, line: 93, baseType: !559, size: 64, offset: 1344)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !560, file: !105, line: 94, baseType: !40, size: 64, offset: 1408)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !560, file: !105, line: 95, baseType: !42, size: 64, offset: 1472)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !560, file: !105, line: 96, baseType: !97, size: 32, offset: 1536)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !560, file: !105, line: 98, baseType: !153, size: 160, offset: 1568)
!591 = !DISubprogram(name: "quotearg_colon", scope: !75, file: !75, line: 391, type: !168, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !98)
!592 = !{!550, !593}
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !552, file: !553, line: 56, type: !310, isLocal: true, isDefinition: true)
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(name: "exit_failure", scope: !597, file: !598, line: 24, type: !600, isLocal: false, isDefinition: true)
!597 = distinct !DICompileUnit(language: DW_LANG_C99, file: !598, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !98, globals: !599, splitDebugInlining: false, nameTableKind: None)
!598 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!599 = !{!595}
!600 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !97)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(name: "program_name", scope: !603, file: !604, line: 33, type: !95, isLocal: false, isDefinition: true)
!603 = distinct !DICompileUnit(language: DW_LANG_C99, file: !604, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !98, retainedTypes: !605, globals: !641, splitDebugInlining: false, nameTableKind: None)
!604 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!605 = !{!40, !606, !93}
!606 = !DISubprogram(name: "fputs", scope: !100, file: !100, line: 626, type: !607, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !98)
!607 = !DISubroutineType(types: !608)
!608 = !{!97, !95, !609}
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !105, line: 49, size: 1728, elements: !611)
!611 = !{!612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !610, file: !105, line: 51, baseType: !97, size: 32)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !610, file: !105, line: 54, baseType: !93, size: 64, offset: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !610, file: !105, line: 55, baseType: !93, size: 64, offset: 128)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !610, file: !105, line: 56, baseType: !93, size: 64, offset: 192)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !610, file: !105, line: 57, baseType: !93, size: 64, offset: 256)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !610, file: !105, line: 58, baseType: !93, size: 64, offset: 320)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !610, file: !105, line: 59, baseType: !93, size: 64, offset: 384)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !610, file: !105, line: 60, baseType: !93, size: 64, offset: 448)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !610, file: !105, line: 61, baseType: !93, size: 64, offset: 512)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !610, file: !105, line: 64, baseType: !93, size: 64, offset: 576)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !610, file: !105, line: 65, baseType: !93, size: 64, offset: 640)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !610, file: !105, line: 66, baseType: !93, size: 64, offset: 704)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !610, file: !105, line: 68, baseType: !120, size: 64, offset: 768)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !610, file: !105, line: 70, baseType: !609, size: 64, offset: 832)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !610, file: !105, line: 72, baseType: !97, size: 32, offset: 896)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !610, file: !105, line: 73, baseType: !97, size: 32, offset: 928)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !610, file: !105, line: 74, baseType: !126, size: 64, offset: 960)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !610, file: !105, line: 77, baseType: !130, size: 16, offset: 1024)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !610, file: !105, line: 78, baseType: !132, size: 8, offset: 1040)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !610, file: !105, line: 79, baseType: !134, size: 8, offset: 1048)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !610, file: !105, line: 81, baseType: !138, size: 64, offset: 1088)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !610, file: !105, line: 89, baseType: !141, size: 64, offset: 1152)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !610, file: !105, line: 91, baseType: !143, size: 64, offset: 1216)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !610, file: !105, line: 92, baseType: !146, size: 64, offset: 1280)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !610, file: !105, line: 93, baseType: !609, size: 64, offset: 1344)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !610, file: !105, line: 94, baseType: !40, size: 64, offset: 1408)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !610, file: !105, line: 95, baseType: !42, size: 64, offset: 1472)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !610, file: !105, line: 96, baseType: !97, size: 32, offset: 1536)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !610, file: !105, line: 98, baseType: !153, size: 160, offset: 1568)
!641 = !{!601}
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !644, file: !645, line: 85, type: !733, isLocal: false, isDefinition: true)
!644 = distinct !DICompileUnit(language: DW_LANG_C99, file: !645, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !646, retainedTypes: !652, globals: !706, splitDebugInlining: false, nameTableKind: None)
!645 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!646 = !{!74, !647, !55}
!647 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !75, line: 242, baseType: !6, size: 32, elements: !648)
!648 = !{!649, !650, !651}
!649 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!650 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!651 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!652 = !{!653, !656, !289, !669, !97, !130, !672, !42, !688, !692, !89, !698, !702, !93, !286, !221, !222}
!653 = !DISubprogram(name: "xmemdup", scope: !36, file: !36, line: 62, type: !654, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !98)
!654 = !DISubroutineType(types: !655)
!655 = !{!40, !209, !44}
!656 = !DISubprogram(name: "quotearg_alloc_mem", scope: !75, file: !75, line: 342, type: !657, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !98)
!657 = !DISubroutineType(types: !658)
!658 = !{!93, !95, !44, !200, !659}
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !661)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !645, line: 65, size: 448, elements: !662)
!662 = !{!663, !664, !665, !667, !668}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !661, file: !645, line: 68, baseType: !74, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !661, file: !645, line: 71, baseType: !97, size: 32, offset: 32)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !661, file: !645, line: 75, baseType: !666, size: 256, offset: 64)
!666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !378)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !661, file: !645, line: 78, baseType: !95, size: 64, offset: 320)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !661, file: !645, line: 81, baseType: !95, size: 64, offset: 384)
!669 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !75, file: !75, line: 408, type: !670, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !98)
!670 = !DISubroutineType(types: !671)
!671 = !{!93, !97, !95, !95, !95, !44}
!672 = !DISubprogram(name: "rpl_mbrtowc", scope: !673, file: !673, line: 717, type: !674, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !98)
!673 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!674 = !DISubroutineType(types: !675)
!675 = !{!44, !190, !95, !44, !676}
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !678, line: 13, size: 64, elements: !679)
!678 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!679 = !{!680, !681}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !677, file: !678, line: 15, baseType: !97, size: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !677, file: !678, line: 20, baseType: !682, size: 32, offset: 32)
!682 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !677, file: !678, line: 16, size: 32, elements: !683)
!683 = !{!684, !685}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !682, file: !678, line: 18, baseType: !6, size: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !682, file: !678, line: 19, baseType: !686, size: 32)
!686 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 32, elements: !687)
!687 = !{!434}
!688 = !DISubprogram(name: "iswprint", scope: !689, file: !689, line: 120, type: !690, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !98)
!689 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!690 = !DISubroutineType(types: !691)
!691 = !{!97, !6}
!692 = !DISubprogram(name: "mbsinit", scope: !693, file: !693, line: 292, type: !694, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !98)
!693 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!694 = !DISubroutineType(types: !695)
!695 = !{!97, !696}
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !677)
!698 = !DISubprogram(name: "locale_charset", scope: !699, file: !699, line: 35, type: !700, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !98)
!699 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!700 = !DISubroutineType(types: !701)
!701 = !{!95}
!702 = !DISubprogram(name: "c_strcasecmp", scope: !703, file: !703, line: 42, type: !704, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !98)
!703 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!704 = !DISubroutineType(types: !705)
!705 = !{!97, !95, !95}
!706 = !{!642, !707, !713, !715, !717, !722, !729, !731}
!707 = !DIGlobalVariableExpression(var: !708, expr: !DIExpression())
!708 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !644, file: !645, line: 101, type: !709, isLocal: false, isDefinition: true)
!709 = !DICompositeType(tag: DW_TAG_array_type, baseType: !710, size: 320, elements: !711)
!710 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !74)
!711 = !{!712}
!712 = !DISubrange(count: 10)
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !644, file: !645, line: 1052, type: !661, isLocal: false, isDefinition: true)
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !644, file: !645, line: 116, type: !661, isLocal: true, isDefinition: true)
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(name: "slot0", scope: !644, file: !645, line: 842, type: !719, isLocal: true, isDefinition: true)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 2048, elements: !720)
!720 = !{!721}
!721 = !DISubrange(count: 256)
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(name: "slotvec", scope: !644, file: !645, line: 845, type: !724, isLocal: true, isDefinition: true)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !645, line: 834, size: 128, elements: !726)
!726 = !{!727, !728}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !725, file: !645, line: 836, baseType: !42, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !725, file: !645, line: 837, baseType: !93, size: 64, offset: 64)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(name: "nslots", scope: !644, file: !645, line: 843, type: !97, isLocal: true, isDefinition: true)
!731 = !DIGlobalVariableExpression(var: !732, expr: !DIExpression())
!732 = distinct !DIGlobalVariable(name: "slotvec0", scope: !644, file: !645, line: 844, type: !725, isLocal: true, isDefinition: true)
!733 = !DICompositeType(tag: DW_TAG_array_type, baseType: !216, size: 704, elements: !734)
!734 = !{!735}
!735 = !DISubrange(count: 11)
!736 = !DIGlobalVariableExpression(var: !737, expr: !DIExpression())
!737 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !738, file: !739, line: 26, type: !741, isLocal: false, isDefinition: true)
!738 = distinct !DICompileUnit(language: DW_LANG_C99, file: !739, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !98, globals: !740, splitDebugInlining: false, nameTableKind: None)
!739 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!740 = !{!736}
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 376, elements: !742)
!742 = !{!743}
!743 = !DISubrange(count: 47)
!744 = distinct !DICompileUnit(language: DW_LANG_C99, file: !745, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !746, splitDebugInlining: false, nameTableKind: None)
!745 = !DIFile(filename: "lib/dtoastr.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!746 = !{!747}
!747 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !260, line: 52, baseType: !6, size: 32, elements: !748)
!748 = !{!749, !750, !751, !752, !753}
!749 = !DIEnumerator(name: "FTOASTR_LEFT_JUSTIFY", value: 1, isUnsigned: true)
!750 = !DIEnumerator(name: "FTOASTR_ALWAYS_SIGNED", value: 2, isUnsigned: true)
!751 = !DIEnumerator(name: "FTOASTR_SPACE_POSITIVE", value: 4, isUnsigned: true)
!752 = !DIEnumerator(name: "FTOASTR_ZERO_PAD", value: 8, isUnsigned: true)
!753 = !DIEnumerator(name: "FTOASTR_UPPER_E", value: 16, isUnsigned: true)
!754 = distinct !DICompileUnit(language: DW_LANG_C99, file: !755, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !746, splitDebugInlining: false, nameTableKind: None)
!755 = !DIFile(filename: "lib/ftoastr.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!756 = distinct !DICompileUnit(language: DW_LANG_C99, file: !757, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !746, splitDebugInlining: false, nameTableKind: None)
!757 = !DIFile(filename: "lib/ldtoastr.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!758 = distinct !DICompileUnit(language: DW_LANG_C99, file: !759, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !760, retainedTypes: !764, splitDebugInlining: false, nameTableKind: None)
!759 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!760 = !{!761}
!761 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !759, line: 40, baseType: !6, size: 32, elements: !762)
!762 = !{!763}
!763 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!764 = !{!89, !765, !40}
!765 = !DISubprogram(name: "fputs_unlocked", scope: !100, file: !100, line: 662, type: !766, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !98)
!766 = !DISubroutineType(types: !767)
!767 = !{!97, !95, !768}
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !105, line: 49, size: 1728, elements: !770)
!770 = !{!771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !769, file: !105, line: 51, baseType: !97, size: 32)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !769, file: !105, line: 54, baseType: !93, size: 64, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !769, file: !105, line: 55, baseType: !93, size: 64, offset: 128)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !769, file: !105, line: 56, baseType: !93, size: 64, offset: 192)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !769, file: !105, line: 57, baseType: !93, size: 64, offset: 256)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !769, file: !105, line: 58, baseType: !93, size: 64, offset: 320)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !769, file: !105, line: 59, baseType: !93, size: 64, offset: 384)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !769, file: !105, line: 60, baseType: !93, size: 64, offset: 448)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !769, file: !105, line: 61, baseType: !93, size: 64, offset: 512)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !769, file: !105, line: 64, baseType: !93, size: 64, offset: 576)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !769, file: !105, line: 65, baseType: !93, size: 64, offset: 640)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !769, file: !105, line: 66, baseType: !93, size: 64, offset: 704)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !769, file: !105, line: 68, baseType: !120, size: 64, offset: 768)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !769, file: !105, line: 70, baseType: !768, size: 64, offset: 832)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !769, file: !105, line: 72, baseType: !97, size: 32, offset: 896)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !769, file: !105, line: 73, baseType: !97, size: 32, offset: 928)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !769, file: !105, line: 74, baseType: !126, size: 64, offset: 960)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !769, file: !105, line: 77, baseType: !130, size: 16, offset: 1024)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !769, file: !105, line: 78, baseType: !132, size: 8, offset: 1040)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !769, file: !105, line: 79, baseType: !134, size: 8, offset: 1048)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !769, file: !105, line: 81, baseType: !138, size: 64, offset: 1088)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !769, file: !105, line: 89, baseType: !141, size: 64, offset: 1152)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !769, file: !105, line: 91, baseType: !143, size: 64, offset: 1216)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !769, file: !105, line: 92, baseType: !146, size: 64, offset: 1280)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !769, file: !105, line: 93, baseType: !768, size: 64, offset: 1344)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !769, file: !105, line: 94, baseType: !40, size: 64, offset: 1408)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !769, file: !105, line: 95, baseType: !42, size: 64, offset: 1472)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !769, file: !105, line: 96, baseType: !97, size: 32, offset: 1536)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !769, file: !105, line: 98, baseType: !153, size: 160, offset: 1568)
!800 = distinct !DICompileUnit(language: DW_LANG_C99, file: !801, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !802, retainedTypes: !810, splitDebugInlining: false, nameTableKind: None)
!801 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!802 = !{!803}
!803 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !804, file: !36, line: 186, baseType: !6, size: 32, elements: !50)
!804 = distinct !DISubprogram(name: "x2nrealloc", scope: !36, file: !36, line: 174, type: !38, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !800, retainedNodes: !805)
!805 = !{!806, !807, !808, !809}
!806 = !DILocalVariable(name: "p", arg: 1, scope: !804, file: !36, line: 174, type: !40)
!807 = !DILocalVariable(name: "pn", arg: 2, scope: !804, file: !36, line: 174, type: !41)
!808 = !DILocalVariable(name: "s", arg: 3, scope: !804, file: !36, line: 174, type: !42)
!809 = !DILocalVariable(name: "n", scope: !804, file: !36, line: 176, type: !42)
!810 = !{!42, !221, !286, !222, !93, !289, !40, !811, !814}
!811 = !DISubprogram(name: "xcalloc", scope: !36, file: !36, line: 57, type: !812, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !98)
!812 = !DISubroutineType(types: !813)
!813 = !{!40, !44, !44}
!814 = !DISubprogram(name: "rpl_calloc", scope: !815, file: !815, line: 688, type: !812, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !98)
!815 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!816 = distinct !DICompileUnit(language: DW_LANG_C99, file: !817, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !98, retainedTypes: !818, splitDebugInlining: false, nameTableKind: None)
!817 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!818 = !{!89, !192}
!819 = distinct !DICompileUnit(language: DW_LANG_C99, file: !820, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !98, retainedTypes: !821, splitDebugInlining: false, nameTableKind: None)
!820 = !DIFile(filename: "lib/xprintf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!821 = !{!822, !832, !89, !192, !867}
!822 = !DISubprogram(name: "xvprintf", scope: !256, file: !256, line: 37, type: !823, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !98)
!823 = !DISubroutineType(types: !824)
!824 = !{!97, !95, !825}
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !820, line: 34, size: 192, elements: !827)
!827 = !{!828, !829, !830, !831}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !826, file: !820, line: 34, baseType: !6, size: 32)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !826, file: !820, line: 34, baseType: !6, size: 32, offset: 32)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !826, file: !820, line: 34, baseType: !40, size: 64, offset: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !826, file: !820, line: 34, baseType: !40, size: 64, offset: 128)
!832 = !DISubprogram(name: "ferror", scope: !100, file: !100, line: 761, type: !833, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !98)
!833 = !DISubroutineType(types: !834)
!834 = !{!97, !835}
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !105, line: 49, size: 1728, elements: !837)
!837 = !{!838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !836, file: !105, line: 51, baseType: !97, size: 32)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !836, file: !105, line: 54, baseType: !93, size: 64, offset: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !836, file: !105, line: 55, baseType: !93, size: 64, offset: 128)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !836, file: !105, line: 56, baseType: !93, size: 64, offset: 192)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !836, file: !105, line: 57, baseType: !93, size: 64, offset: 256)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !836, file: !105, line: 58, baseType: !93, size: 64, offset: 320)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !836, file: !105, line: 59, baseType: !93, size: 64, offset: 384)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !836, file: !105, line: 60, baseType: !93, size: 64, offset: 448)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !836, file: !105, line: 61, baseType: !93, size: 64, offset: 512)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !836, file: !105, line: 64, baseType: !93, size: 64, offset: 576)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !836, file: !105, line: 65, baseType: !93, size: 64, offset: 640)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !836, file: !105, line: 66, baseType: !93, size: 64, offset: 704)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !836, file: !105, line: 68, baseType: !120, size: 64, offset: 768)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !836, file: !105, line: 70, baseType: !835, size: 64, offset: 832)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !836, file: !105, line: 72, baseType: !97, size: 32, offset: 896)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !836, file: !105, line: 73, baseType: !97, size: 32, offset: 928)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !836, file: !105, line: 74, baseType: !126, size: 64, offset: 960)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !836, file: !105, line: 77, baseType: !130, size: 16, offset: 1024)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !836, file: !105, line: 78, baseType: !132, size: 8, offset: 1040)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !836, file: !105, line: 79, baseType: !134, size: 8, offset: 1048)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !836, file: !105, line: 81, baseType: !138, size: 64, offset: 1088)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !836, file: !105, line: 89, baseType: !141, size: 64, offset: 1152)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !836, file: !105, line: 91, baseType: !143, size: 64, offset: 1216)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !836, file: !105, line: 92, baseType: !146, size: 64, offset: 1280)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !836, file: !105, line: 93, baseType: !835, size: 64, offset: 1344)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !836, file: !105, line: 94, baseType: !40, size: 64, offset: 1408)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !836, file: !105, line: 95, baseType: !42, size: 64, offset: 1472)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !836, file: !105, line: 96, baseType: !97, size: 32, offset: 1536)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !836, file: !105, line: 98, baseType: !153, size: 160, offset: 1568)
!867 = !DISubprogram(name: "xvfprintf", scope: !256, file: !256, line: 41, type: !868, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !98)
!868 = !DISubroutineType(types: !869)
!869 = !{!97, !835, !95, !825}
!870 = distinct !DICompileUnit(language: DW_LANG_C99, file: !871, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !872, retainedTypes: !818, splitDebugInlining: false, nameTableKind: None)
!871 = !DIFile(filename: "lib/xstrtol-error.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!872 = !{!18}
!873 = distinct !DICompileUnit(language: DW_LANG_C99, file: !874, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !875, retainedTypes: !876, splitDebugInlining: false, nameTableKind: None)
!874 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!875 = !{!18, !55}
!876 = !{!97, !130}
!877 = distinct !DICompileUnit(language: DW_LANG_C99, file: !878, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !98, retainedTypes: !879, splitDebugInlining: false, nameTableKind: None)
!878 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!879 = !{!40}
!880 = distinct !DICompileUnit(language: DW_LANG_C99, file: !881, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !98, retainedTypes: !882, splitDebugInlining: false, nameTableKind: None)
!881 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!882 = !{!883, !918, !919, !923}
!883 = !DISubprogram(name: "fileno", scope: !100, file: !100, line: 786, type: !884, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !98)
!884 = !DISubroutineType(types: !885)
!885 = !{!97, !886}
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !105, line: 49, size: 1728, elements: !888)
!888 = !{!889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !887, file: !105, line: 51, baseType: !97, size: 32)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !887, file: !105, line: 54, baseType: !93, size: 64, offset: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !887, file: !105, line: 55, baseType: !93, size: 64, offset: 128)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !887, file: !105, line: 56, baseType: !93, size: 64, offset: 192)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !887, file: !105, line: 57, baseType: !93, size: 64, offset: 256)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !887, file: !105, line: 58, baseType: !93, size: 64, offset: 320)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !887, file: !105, line: 59, baseType: !93, size: 64, offset: 384)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !887, file: !105, line: 60, baseType: !93, size: 64, offset: 448)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !887, file: !105, line: 61, baseType: !93, size: 64, offset: 512)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !887, file: !105, line: 64, baseType: !93, size: 64, offset: 576)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !887, file: !105, line: 65, baseType: !93, size: 64, offset: 640)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !887, file: !105, line: 66, baseType: !93, size: 64, offset: 704)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !887, file: !105, line: 68, baseType: !120, size: 64, offset: 768)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !887, file: !105, line: 70, baseType: !886, size: 64, offset: 832)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !887, file: !105, line: 72, baseType: !97, size: 32, offset: 896)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !887, file: !105, line: 73, baseType: !97, size: 32, offset: 928)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !887, file: !105, line: 74, baseType: !126, size: 64, offset: 960)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !887, file: !105, line: 77, baseType: !130, size: 16, offset: 1024)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !887, file: !105, line: 78, baseType: !132, size: 8, offset: 1040)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !887, file: !105, line: 79, baseType: !134, size: 8, offset: 1048)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !887, file: !105, line: 81, baseType: !138, size: 64, offset: 1088)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !887, file: !105, line: 89, baseType: !141, size: 64, offset: 1152)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !887, file: !105, line: 91, baseType: !143, size: 64, offset: 1216)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !887, file: !105, line: 92, baseType: !146, size: 64, offset: 1280)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !887, file: !105, line: 93, baseType: !886, size: 64, offset: 1344)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !887, file: !105, line: 94, baseType: !40, size: 64, offset: 1408)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !887, file: !105, line: 95, baseType: !42, size: 64, offset: 1472)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !887, file: !105, line: 96, baseType: !97, size: 32, offset: 1536)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !887, file: !105, line: 98, baseType: !153, size: 160, offset: 1568)
!918 = !DISubprogram(name: "fclose", scope: !100, file: !100, line: 213, type: !884, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !98)
!919 = !DISubprogram(name: "lseek", scope: !920, file: !920, line: 334, type: !921, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !98)
!920 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!921 = !DISubroutineType(types: !922)
!922 = !{!128, !97, !128, !97}
!923 = !DISubprogram(name: "rpl_fflush", scope: !218, file: !218, line: 718, type: !884, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !98)
!924 = distinct !DICompileUnit(language: DW_LANG_C99, file: !925, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !98, retainedTypes: !926, splitDebugInlining: false, nameTableKind: None)
!925 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!926 = !{!40, !927, !962}
!927 = !DISubprogram(name: "fflush", scope: !100, file: !100, line: 218, type: !928, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !98)
!928 = !DISubroutineType(types: !929)
!929 = !{!97, !930}
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !105, line: 49, size: 1728, elements: !932)
!932 = !{!933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !931, file: !105, line: 51, baseType: !97, size: 32)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !931, file: !105, line: 54, baseType: !93, size: 64, offset: 64)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !931, file: !105, line: 55, baseType: !93, size: 64, offset: 128)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !931, file: !105, line: 56, baseType: !93, size: 64, offset: 192)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !931, file: !105, line: 57, baseType: !93, size: 64, offset: 256)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !931, file: !105, line: 58, baseType: !93, size: 64, offset: 320)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !931, file: !105, line: 59, baseType: !93, size: 64, offset: 384)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !931, file: !105, line: 60, baseType: !93, size: 64, offset: 448)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !931, file: !105, line: 61, baseType: !93, size: 64, offset: 512)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !931, file: !105, line: 64, baseType: !93, size: 64, offset: 576)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !931, file: !105, line: 65, baseType: !93, size: 64, offset: 640)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !931, file: !105, line: 66, baseType: !93, size: 64, offset: 704)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !931, file: !105, line: 68, baseType: !120, size: 64, offset: 768)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !931, file: !105, line: 70, baseType: !930, size: 64, offset: 832)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !931, file: !105, line: 72, baseType: !97, size: 32, offset: 896)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !931, file: !105, line: 73, baseType: !97, size: 32, offset: 928)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !931, file: !105, line: 74, baseType: !126, size: 64, offset: 960)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !931, file: !105, line: 77, baseType: !130, size: 16, offset: 1024)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !931, file: !105, line: 78, baseType: !132, size: 8, offset: 1040)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !931, file: !105, line: 79, baseType: !134, size: 8, offset: 1048)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !931, file: !105, line: 81, baseType: !138, size: 64, offset: 1088)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !931, file: !105, line: 89, baseType: !141, size: 64, offset: 1152)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !931, file: !105, line: 91, baseType: !143, size: 64, offset: 1216)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !931, file: !105, line: 92, baseType: !146, size: 64, offset: 1280)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !931, file: !105, line: 93, baseType: !930, size: 64, offset: 1344)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !931, file: !105, line: 94, baseType: !40, size: 64, offset: 1408)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !931, file: !105, line: 95, baseType: !42, size: 64, offset: 1472)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !931, file: !105, line: 96, baseType: !97, size: 32, offset: 1536)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !931, file: !105, line: 98, baseType: !153, size: 160, offset: 1568)
!962 = !DISubprogram(name: "rpl_fseeko", scope: !218, file: !218, line: 1034, type: !963, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !98)
!963 = !DISubroutineType(types: !964)
!964 = !{!97, !930, !128, !97}
!965 = distinct !DICompileUnit(language: DW_LANG_C99, file: !966, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !98, retainedTypes: !967, splitDebugInlining: false, nameTableKind: None)
!966 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!967 = !{!40, !968, !919, !1003}
!968 = !DISubprogram(name: "fileno", scope: !100, file: !100, line: 786, type: !969, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !98)
!969 = !DISubroutineType(types: !970)
!970 = !{!97, !971}
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !105, line: 49, size: 1728, elements: !973)
!973 = !{!974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !972, file: !105, line: 51, baseType: !97, size: 32)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !972, file: !105, line: 54, baseType: !93, size: 64, offset: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !972, file: !105, line: 55, baseType: !93, size: 64, offset: 128)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !972, file: !105, line: 56, baseType: !93, size: 64, offset: 192)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !972, file: !105, line: 57, baseType: !93, size: 64, offset: 256)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !972, file: !105, line: 58, baseType: !93, size: 64, offset: 320)
