source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon.3 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.infomap = type { i8*, i8* }
%struct.lconv = type { i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.tspec = type { i32, i32, void (i64, i64, i8*, i8*, i32, i32)*, [8 x i8], i8, i32, i32 }
%union.anon.2 = type { i16 }
%union.anon.3 = type { i32 }
%union.anon.5 = type { i64 }
%union.anon.6 = type { float }
%union.anon.7 = type { double }
%union.anon.8 = type { x86_fp80 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8

!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!109 = !{!110, !111, !112, !113, !114, !115, !116, !118, !119, !120, !121, !122, !124, !125, !126, !127, !131, !134, !135, !139, !140, !144}
!110 = !DILocalVariable(name: "argc", arg: 1, scope: !105, file: !3, line: 1562, type: !95)
!111 = !DILocalVariable(name: "argv", arg: 2, scope: !105, file: !3, line: 1562, type: !108)
!112 = !DILocalVariable(name: "n_files", scope: !105, file: !3, line: 1564, type: !95)
!113 = !DILocalVariable(name: "i", scope: !105, file: !3, line: 1565, type: !42)
!114 = !DILocalVariable(name: "l_c_m", scope: !105, file: !3, line: 1566, type: !95)
!115 = !DILocalVariable(name: "desired_width", scope: !105, file: !3, line: 1567, type: !42)
!116 = !DILocalVariable(name: "modern", scope: !105, file: !3, line: 1568, type: !117)
!117 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!118 = !DILocalVariable(name: "width_specified", scope: !105, file: !3, line: 1569, type: !117)
!119 = !DILocalVariable(name: "ok", scope: !105, file: !3, line: 1570, type: !117)
!120 = !DILocalVariable(name: "width_per_block", scope: !105, file: !3, line: 1571, type: !42)
!121 = !DILocalVariable(name: "pseudo_start", scope: !105, file: !3, line: 1576, type: !98)
!122 = !DILocalVariable(name: "tmp", scope: !123, file: !3, line: 1620, type: !98)
!123 = distinct !DILexicalBlock(scope: !105, file: !3, line: 1619, column: 5)
!124 = !DILocalVariable(name: "s_err", scope: !123, file: !3, line: 1621, type: !18)
!125 = !DILocalVariable(name: "oi", scope: !123, file: !3, line: 1622, type: !95)
!126 = !DILocalVariable(name: "c", scope: !123, file: !3, line: 1623, type: !95)
!127 = !DILocalVariable(name: "w_tmp", scope: !128, file: !3, line: 1767, type: !98)
!128 = distinct !DILexicalBlock(scope: !129, file: !3, line: 1766, column: 13)
!129 = distinct !DILexicalBlock(scope: !130, file: !3, line: 1761, column: 15)
!130 = distinct !DILexicalBlock(scope: !123, file: !3, line: 1628, column: 9)
!131 = !DILocalVariable(name: "o1", scope: !132, file: !3, line: 1810, type: !98)
!132 = distinct !DILexicalBlock(scope: !133, file: !3, line: 1809, column: 5)
!133 = distinct !DILexicalBlock(scope: !105, file: !3, line: 1808, column: 7)
!134 = !DILocalVariable(name: "o2", scope: !132, file: !3, line: 1811, type: !98)
!135 = !DILocalVariable(name: "fields_per_block", scope: !136, file: !3, line: 1947, type: !95)
!136 = distinct !DILexicalBlock(scope: !137, file: !3, line: 1946, column: 5)
!137 = distinct !DILexicalBlock(scope: !138, file: !3, line: 1945, column: 3)
!138 = distinct !DILexicalBlock(scope: !105, file: !3, line: 1945, column: 3)
!139 = !DILocalVariable(name: "block_width", scope: !136, file: !3, line: 1948, type: !95)
!140 = !DILocalVariable(name: "fields_per_block", scope: !141, file: !3, line: 1954, type: !95)
!141 = distinct !DILexicalBlock(scope: !142, file: !3, line: 1953, column: 5)
!142 = distinct !DILexicalBlock(scope: !143, file: !3, line: 1952, column: 3)
!143 = distinct !DILexicalBlock(scope: !105, file: !3, line: 1952, column: 3)
!144 = !DILocalVariable(name: "block_width", scope: !141, file: !3, line: 1955, type: !95)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 104, elements: !146)
!146 = !{!147}
!147 = !DISubrange(count: 13)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(name: "address_base", scope: !2, file: !3, line: 177, type: !95, isLocal: true, isDefinition: true)
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(name: "address_pad_len", scope: !2, file: !3, line: 185, type: !95, isLocal: true, isDefinition: true)
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(name: "string_min", scope: !2, file: !3, line: 188, type: !42, isLocal: true, isDefinition: true)
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(name: "flag_dump_strings", scope: !2, file: !3, line: 191, type: !117, isLocal: true, isDefinition: true)
!156 = !DIGlobalVariableExpression(var: !157, expr: !DIExpression())
!157 = distinct !DIGlobalVariable(name: "traditional", scope: !2, file: !3, line: 196, type: !117, isLocal: true, isDefinition: true)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "flag_pseudo_start", scope: !2, file: !3, line: 199, type: !117, isLocal: true, isDefinition: true)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "pseudo_offset", scope: !2, file: !3, line: 203, type: !98, isLocal: true, isDefinition: true)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(name: "format_address", scope: !2, file: !3, line: 207, type: !164, isLocal: true, isDefinition: true)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DISubroutineType(types: !166)
!166 = !{null, !98, !91}
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(name: "max_bytes_to_format", scope: !2, file: !3, line: 217, type: !98, isLocal: true, isDefinition: true)
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(name: "end_offset", scope: !2, file: !3, line: 220, type: !98, isLocal: true, isDefinition: true)
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(name: "spec", scope: !2, file: !3, line: 228, type: !173, isLocal: true, isDefinition: true)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tspec", file: !3, line: 100, size: 320, elements: !175)
!175 = !{!176, !177, !178, !184, !188, !189, !190}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !174, file: !3, line: 102, baseType: !26, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !174, file: !3, line: 103, baseType: !5, size: 32, offset: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "print_function", scope: !174, file: !3, line: 108, baseType: !179, size: 64, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{null, !42, !42, !182, !89, !95, !95}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "fmt_string", scope: !174, file: !3, line: 110, baseType: !185, size: 64, offset: 128)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 64, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 8)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "hexl_mode_trailer", scope: !174, file: !3, line: 111, baseType: !117, size: 8, offset: 192)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "field_width", scope: !174, file: !3, line: 112, baseType: !95, size: 32, offset: 224)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "pad_width", scope: !174, file: !3, line: 113, baseType: !95, size: 32, offset: 256)
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(name: "n_specs", scope: !2, file: !3, line: 231, type: !42, isLocal: true, isDefinition: true)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(name: "n_specs_allocated", scope: !2, file: !3, line: 234, type: !42, isLocal: true, isDefinition: true)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "bytes_per_block", scope: !2, file: !3, line: 240, type: !42, isLocal: true, isDefinition: true)
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(name: "file_list", scope: !2, file: !3, line: 247, type: !93, isLocal: true, isDefinition: true)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(name: "in_stream", scope: !2, file: !3, line: 254, type: !201, isLocal: true, isDefinition: true)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !203, line: 7, baseType: !204)
!203 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !205, line: 49, size: 1728, elements: !206)
!205 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!206 = !{!207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !222, !224, !225, !226, !229, !230, !232, !236, !239, !241, !244, !247, !248, !249, !250, !251}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !204, file: !205, line: 51, baseType: !95, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !204, file: !205, line: 54, baseType: !92, size: 64, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !204, file: !205, line: 55, baseType: !92, size: 64, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !204, file: !205, line: 56, baseType: !92, size: 64, offset: 192)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !204, file: !205, line: 57, baseType: !92, size: 64, offset: 256)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !204, file: !205, line: 58, baseType: !92, size: 64, offset: 320)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !204, file: !205, line: 59, baseType: !92, size: 64, offset: 384)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !204, file: !205, line: 60, baseType: !92, size: 64, offset: 448)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !204, file: !205, line: 61, baseType: !92, size: 64, offset: 512)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !204, file: !205, line: 64, baseType: !92, size: 64, offset: 576)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !204, file: !205, line: 65, baseType: !92, size: 64, offset: 640)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !204, file: !205, line: 66, baseType: !92, size: 64, offset: 704)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !204, file: !205, line: 68, baseType: !220, size: 64, offset: 768)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !205, line: 36, flags: DIFlagFwdDecl)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !204, file: !205, line: 70, baseType: !223, size: 64, offset: 832)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !204, file: !205, line: 72, baseType: !95, size: 32, offset: 896)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !204, file: !205, line: 73, baseType: !95, size: 32, offset: 928)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !204, file: !205, line: 74, baseType: !227, size: 64, offset: 960)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !101, line: 150, baseType: !228)
!228 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !204, file: !205, line: 77, baseType: !96, size: 16, offset: 1024)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !204, file: !205, line: 78, baseType: !231, size: 8, offset: 1040)
!231 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !204, file: !205, line: 79, baseType: !233, size: 8, offset: 1048)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 8, elements: !234)
!234 = !{!235}
!235 = !DISubrange(count: 1)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !204, file: !205, line: 81, baseType: !237, size: 64, offset: 1088)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !205, line: 43, baseType: null)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !204, file: !205, line: 89, baseType: !240, size: 64, offset: 1152)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !101, line: 151, baseType: !228)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !204, file: !205, line: 91, baseType: !242, size: 64, offset: 1216)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !205, line: 37, flags: DIFlagFwdDecl)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !204, file: !205, line: 92, baseType: !245, size: 64, offset: 1280)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !205, line: 38, flags: DIFlagFwdDecl)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !204, file: !205, line: 93, baseType: !223, size: 64, offset: 1344)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !204, file: !205, line: 94, baseType: !40, size: 64, offset: 1408)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !204, file: !205, line: 95, baseType: !42, size: 64, offset: 1472)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !204, file: !205, line: 96, baseType: !95, size: 32, offset: 1536)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !204, file: !205, line: 98, baseType: !252, size: 160, offset: 1568)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 160, elements: !253)
!253 = !{!254}
!254 = !DISubrange(count: 20)
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 257, type: !117, isLocal: true, isDefinition: true)
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "fp_type_size", scope: !2, file: !3, line: 263, type: !259, isLocal: true, isDefinition: true)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 544, elements: !260)
!260 = !{!261}
!261 = !DISubrange(count: 17)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(name: "input_swap", scope: !2, file: !3, line: 270, type: !117, isLocal: true, isDefinition: true)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "short_options", scope: !2, file: !3, line: 272, type: !266, isLocal: true, isDefinition: true)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 280, elements: !267)
!267 = !{!268}
!268 = !DISubrange(count: 35)
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 298, type: !271, isLocal: true, isDefinition: true)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 3072, elements: !281)
!272 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !273)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !274, line: 50, size: 256, elements: !275)
!274 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!275 = !{!276, !277, !278, !280}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !273, file: !274, line: 52, baseType: !89, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !273, file: !274, line: 55, baseType: !95, size: 32, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !273, file: !274, line: 56, baseType: !279, size: 64, offset: 128)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !273, file: !274, line: 57, baseType: !95, size: 32, offset: 192)
!281 = !{!282}
!282 = !DISubrange(count: 12)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(name: "n_bytes_to_skip", scope: !2, file: !3, line: 210, type: !98, isLocal: true, isDefinition: true)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(name: "limit_bytes_to_format", scope: !2, file: !3, line: 214, type: !117, isLocal: true, isDefinition: true)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(name: "bytes_to_signed_dec_digits", scope: !2, file: !3, line: 129, type: !289, isLocal: true, isDefinition: true)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !290, size: 544, elements: !260)
!290 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "bytes_to_oct_digits", scope: !2, file: !3, line: 126, type: !289, isLocal: true, isDefinition: true)
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(name: "bytes_to_unsigned_dec_digits", scope: !2, file: !3, line: 132, type: !289, isLocal: true, isDefinition: true)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "bytes_to_hex_digits", scope: !2, file: !3, line: 135, type: !289, isLocal: true, isDefinition: true)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(name: "charname", scope: !2, file: !3, line: 167, type: !299, isLocal: true, isDefinition: true)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 1056, elements: !300)
!300 = !{!301, !302}
!301 = !DISubrange(count: 33)
!302 = !DISubrange(count: 4)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "abbreviate_duplicate_blocks", scope: !2, file: !3, line: 225, type: !117, isLocal: true, isDefinition: true)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(name: "endian_types", scope: !2, file: !3, line: 293, type: !307, isLocal: true, isDefinition: true)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !308, size: 64, elements: !309)
!308 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !70)
!309 = !{!310}
!310 = !DISubrange(count: 2)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(name: "endian_args", scope: !2, file: !3, line: 288, type: !313, isLocal: true, isDefinition: true)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 192, elements: !314)
!314 = !{!315}
!315 = !DISubrange(count: 3)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "default_file_list", scope: !2, file: !3, line: 251, type: !318, isLocal: true, isDefinition: true)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 128, elements: !309)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(name: "input_filename", scope: !2, file: !3, line: 244, type: !89, isLocal: true, isDefinition: true)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(name: "width_bytes", scope: !2, file: !3, line: 149, type: !323, isLocal: true, isDefinition: true)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !324, size: 288, elements: !325)
!324 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !95)
!325 = !{!326}
!326 = !DISubrange(count: 9)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "first", scope: !329, file: !3, line: 1185, type: !117, isLocal: true, isDefinition: true)
!329 = distinct !DISubprogram(name: "write_block", scope: !3, file: !3, line: 1182, type: !330, isLocal: true, isDefinition: true, scopeLine: 1184, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !332)
!330 = !DISubroutineType(types: !331)
!331 = !{null, !98, !42, !89, !89}
!332 = !{!333, !334, !335, !336, !337, !341, !344, !345, !346, !349}
!333 = !DILocalVariable(name: "current_offset", arg: 1, scope: !329, file: !3, line: 1182, type: !98)
!334 = !DILocalVariable(name: "n_bytes", arg: 2, scope: !329, file: !3, line: 1182, type: !42)
!335 = !DILocalVariable(name: "prev_block", arg: 3, scope: !329, file: !3, line: 1183, type: !89)
!336 = !DILocalVariable(name: "curr_block", arg: 4, scope: !329, file: !3, line: 1183, type: !89)
!337 = !DILocalVariable(name: "i", scope: !338, file: !3, line: 1208, type: !42)
!338 = distinct !DILexicalBlock(scope: !339, file: !3, line: 1208, column: 7)
!339 = distinct !DILexicalBlock(scope: !340, file: !3, line: 1206, column: 5)
!340 = distinct !DILexicalBlock(scope: !329, file: !3, line: 1190, column: 7)
!341 = !DILocalVariable(name: "datum_width", scope: !342, file: !3, line: 1210, type: !95)
!342 = distinct !DILexicalBlock(scope: !343, file: !3, line: 1209, column: 9)
!343 = distinct !DILexicalBlock(scope: !338, file: !3, line: 1208, column: 7)
!344 = !DILocalVariable(name: "fields_per_block", scope: !342, file: !3, line: 1211, type: !95)
!345 = !DILocalVariable(name: "blank_fields", scope: !342, file: !3, line: 1212, type: !95)
!346 = !DILocalVariable(name: "field_width", scope: !347, file: !3, line: 1223, type: !95)
!347 = distinct !DILexicalBlock(scope: !348, file: !3, line: 1221, column: 13)
!348 = distinct !DILexicalBlock(scope: !342, file: !3, line: 1220, column: 15)
!349 = !DILocalVariable(name: "pad_width", scope: !347, file: !3, line: 1224, type: !95)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "prev_pair_equal", scope: !329, file: !3, line: 1186, type: !117, isLocal: true, isDefinition: true)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 288, elements: !325)
!353 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!354 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!355 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!356 = !DIGlobalVariableExpression(var: !157, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!357 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!358 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!359 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!360 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!361 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression(DW_OP_deref, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "Version", scope: !364, file: !365, line: 2, type: !89, isDefinition: true)
!364 = distinct !DICompileUnit(language: DW_LANG_C99, file: !365, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !366, globals: !367)
!365 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!366 = !{}
!367 = !{!362}
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !370, file: !375, line: 69, type: !376, isDefinition: true)
!370 = distinct !DICompileUnit(language: DW_LANG_C99, file: !371, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !372, retainedTypes: !373, globals: !374)
!371 = !DIFile(filename: "./lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!372 = !{!74}
!373 = !{!40, !97}
!374 = !{!368}
!375 = !DIFile(filename: "lib/argmatch.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !377, line: 55, baseType: !378)
!377 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{null}
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(name: "file_name", scope: !383, file: !388, line: 46, type: !89, isLocal: true, isDefinition: true)
!383 = distinct !DICompileUnit(language: DW_LANG_C99, file: !384, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !366, globals: !385)
!384 = !DIFile(filename: "./lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!385 = !{!381, !386}
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !383, file: !388, line: 56, type: !117, isLocal: true, isDefinition: true)
!388 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "exit_failure", scope: !391, file: !394, line: 24, type: !395, isDefinition: true)
!391 = distinct !DICompileUnit(language: DW_LANG_C99, file: !392, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !366, globals: !393)
!392 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!393 = !{!389}
!394 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!395 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !95)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(name: "program_name", scope: !398, file: !402, line: 33, type: !89, isDefinition: true)
!398 = distinct !DICompileUnit(language: DW_LANG_C99, file: !399, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !366, retainedTypes: !400, globals: !401)
!399 = !DIFile(filename: "./lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!400 = !{!40, !92}
!401 = !{!396}
!402 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !405, file: !417, line: 85, type: !450, isDefinition: true)
!405 = distinct !DICompileUnit(language: DW_LANG_C99, file: !406, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !407, retainedTypes: !413, globals: !414)
!406 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!407 = !{!74, !408, !55}
!408 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !75, line: 242, baseType: !6, size: 32, elements: !409)
!409 = !{!410, !411, !412}
!410 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!411 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!412 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!413 = !{!95, !96, !42, !92}
!414 = !{!403, !415, !422, !432, !434, !439, !446, !448}
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !405, file: !417, line: 101, type: !418, isDefinition: true)
!417 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !419, size: 320, elements: !420)
!419 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !74)
!420 = !{!421}
!421 = !DISubrange(count: 10)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !405, file: !417, line: 1052, type: !424, isDefinition: true)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !417, line: 65, size: 448, elements: !425)
!425 = !{!426, !427, !428, !430, !431}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !424, file: !417, line: 68, baseType: !74, size: 32)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !424, file: !417, line: 71, baseType: !95, size: 32, offset: 32)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !424, file: !417, line: 75, baseType: !429, size: 256, offset: 64)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !186)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !424, file: !417, line: 78, baseType: !89, size: 64, offset: 320)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !424, file: !417, line: 81, baseType: !89, size: 64, offset: 384)
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !405, file: !417, line: 116, type: !424, isLocal: true, isDefinition: true)
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(name: "slot0", scope: !405, file: !417, line: 842, type: !436, isLocal: true, isDefinition: true)
!436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 2048, elements: !437)
!437 = !{!438}
!438 = !DISubrange(count: 256)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(name: "slotvec", scope: !405, file: !417, line: 845, type: !441, isLocal: true, isDefinition: true)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !417, line: 834, size: 128, elements: !443)
!443 = !{!444, !445}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !442, file: !417, line: 836, baseType: !42, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !442, file: !417, line: 837, baseType: !92, size: 64, offset: 64)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "nslots", scope: !405, file: !417, line: 843, type: !95, isLocal: true, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "slotvec0", scope: !405, file: !417, line: 844, type: !442, isLocal: true, isDefinition: true)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 704, elements: !451)
!451 = !{!452}
!452 = !DISubrange(count: 11)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !455, file: !458, line: 26, type: !459, isDefinition: true)
!455 = distinct !DICompileUnit(language: DW_LANG_C99, file: !456, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !366, globals: !457)
!456 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!457 = !{!453}
!458 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 376, elements: !460)
!460 = !{!461}
!461 = !DISubrange(count: 47)
!462 = distinct !DICompileUnit(language: DW_LANG_C99, file: !463, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !464)
!463 = !DIFile(filename: "./lib/dtoastr.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!464 = !{!465}
!465 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !466, line: 52, baseType: !6, size: 32, elements: !467)
!466 = !DIFile(filename: "./lib/ftoastr.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!467 = !{!468, !469, !470, !471, !472}
!468 = !DIEnumerator(name: "FTOASTR_LEFT_JUSTIFY", value: 1, isUnsigned: true)
!469 = !DIEnumerator(name: "FTOASTR_ALWAYS_SIGNED", value: 2, isUnsigned: true)
!470 = !DIEnumerator(name: "FTOASTR_SPACE_POSITIVE", value: 4, isUnsigned: true)
!471 = !DIEnumerator(name: "FTOASTR_ZERO_PAD", value: 8, isUnsigned: true)
!472 = !DIEnumerator(name: "FTOASTR_UPPER_E", value: 16, isUnsigned: true)
!473 = distinct !DICompileUnit(language: DW_LANG_C99, file: !474, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !464)
!474 = !DIFile(filename: "./lib/ftoastr.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!475 = distinct !DICompileUnit(language: DW_LANG_C99, file: !476, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !464)
!476 = !DIFile(filename: "./lib/ldtoastr.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!477 = distinct !DICompileUnit(language: DW_LANG_C99, file: !478, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !479, retainedTypes: !484)
!478 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!479 = !{!480}
!480 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !481, line: 41, baseType: !6, size: 32, elements: !482)
!481 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!482 = !{!483}
!483 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2018, isUnsigned: true)
!484 = !{!40}
!485 = distinct !DICompileUnit(language: DW_LANG_C99, file: !486, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !487, retainedTypes: !495)
!486 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!487 = !{!488}
!488 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !489, file: !36, line: 186, baseType: !6, size: 32, elements: !50)
!489 = distinct !DISubprogram(name: "x2nrealloc", scope: !36, file: !36, line: 174, type: !38, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: true, unit: !485, retainedNodes: !490)
!490 = !{!491, !492, !493, !494}
!491 = !DILocalVariable(name: "p", arg: 1, scope: !489, file: !36, line: 174, type: !40)
!492 = !DILocalVariable(name: "pn", arg: 2, scope: !489, file: !36, line: 174, type: !41)
!493 = !DILocalVariable(name: "s", arg: 3, scope: !489, file: !36, line: 174, type: !42)
!494 = !DILocalVariable(name: "n", scope: !489, file: !36, line: 176, type: !42)
!495 = !{!42, !92, !40}
!496 = distinct !DICompileUnit(language: DW_LANG_C99, file: !497, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !366)
!497 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!498 = distinct !DICompileUnit(language: DW_LANG_C99, file: !499, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !366)
!499 = !DIFile(filename: "./lib/xprintf.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!500 = distinct !DICompileUnit(language: DW_LANG_C99, file: !501, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !502)
!501 = !DIFile(filename: "./lib/xstrtol-error.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!502 = !{!18}
!503 = distinct !DICompileUnit(language: DW_LANG_C99, file: !504, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !505, retainedTypes: !506)
!504 = !DIFile(filename: "./lib/xstrtoumax.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!505 = !{!18, !55}
!506 = !{!95, !96}
!507 = distinct !DICompileUnit(language: DW_LANG_C99, file: !508, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !366, retainedTypes: !484)
!508 = !DIFile(filename: "./lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!509 = distinct !DICompileUnit(language: DW_LANG_C99, file: !510, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !366)
!510 = !DIFile(filename: "./lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!511 = distinct !DICompileUnit(language: DW_LANG_C99, file: !512, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !366, retainedTypes: !484)
!512 = !DIFile(filename: "./lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!513 = distinct !DICompileUnit(language: DW_LANG_C99, file: !514, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !366, retainedTypes: !484)
!514 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!515 = distinct !DICompileUnit(language: DW_LANG_C99, file: !516, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !366, retainedTypes: !517)
!516 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!517 = !{!42}
!518 = distinct !DICompileUnit(language: DW_LANG_C99, file: !519, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !366)
!519 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!520 = distinct !DICompileUnit(language: DW_LANG_C99, file: !521, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !366)
!521 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!522 = distinct !DICompileUnit(language: DW_LANG_C99, file: !523, producer: "clang version 7.0.0 (tags/RELEASE_700/final)", isOptimized: true, emissionKind: FullDebug, enums: !524, retainedTypes: !484)
!523 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!524 = !{!525}
!525 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !526, line: 41, baseType: !6, size: 32, elements: !527)
!526 = !DIFile(filename: "/usr/include/langinfo.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!527 = !{!528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910}
!528 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!529 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!530 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!531 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!532 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!533 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!534 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!535 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!536 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!537 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!538 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!539 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!540 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!541 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!542 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!543 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!544 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!545 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!546 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!547 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!548 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!549 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!550 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!551 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!552 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!553 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!554 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!555 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!556 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!557 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!558 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!559 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!560 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!561 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!562 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!563 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!564 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!565 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!566 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!567 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!568 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!569 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!570 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!571 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!572 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!573 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!574 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!575 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!576 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!577 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!578 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!579 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!580 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!581 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!582 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!583 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!584 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!585 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!586 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!587 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!588 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!589 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!590 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!591 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!592 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!593 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!594 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!595 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!596 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!597 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!598 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!599 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!600 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!601 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!602 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!603 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!604 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!605 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!606 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!607 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!608 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!609 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!610 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!611 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!612 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!613 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!614 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!615 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!616 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!617 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!618 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!619 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!620 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!621 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!622 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!623 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!624 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!625 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!626 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!627 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!628 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!629 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!630 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!631 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!632 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!633 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!634 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!635 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!636 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!637 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!639 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!640 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!641 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!642 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!643 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!644 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!645 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!646 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!647 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!648 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!649 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!650 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!661 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!662 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!663 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!664 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!665 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!666 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!667 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!668 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!669 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!670 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!671 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!672 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!673 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!674 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!675 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!676 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!677 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!678 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!679 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!680 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!681 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!682 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!683 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!684 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!685 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!686 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!687 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!688 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!689 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!690 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!691 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!692 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!693 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!694 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!695 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!696 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!697 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!698 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!699 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!700 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!701 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!702 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!703 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!704 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!705 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!706 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!707 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!708 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!709 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!710 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!711 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!712 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!713 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!714 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!715 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!716 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!717 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!719 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!720 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!721 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!722 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!723 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!724 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!725 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!726 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!727 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!728 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!729 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!730 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!731 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!732 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!733 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!734 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!735 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!736 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!737 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!738 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!739 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!740 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!741 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!742 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!743 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!744 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!745 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!746 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!747 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!748 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!749 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!750 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!751 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!752 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!753 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!754 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!755 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!756 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!757 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!758 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!759 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!760 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!761 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!762 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!763 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!764 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!765 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!766 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!767 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!768 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!769 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!770 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!771 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!772 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!773 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!774 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!779 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!780 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!781 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!782 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!783 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!784 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!785 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!786 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!787 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!788 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!789 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!790 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!791 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!793 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!794 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!795 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!796 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!797 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!798 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!799 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!800 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!801 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!802 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!803 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!804 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!805 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!806 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!807 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!808 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!809 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!810 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!812 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!813 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!814 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!815 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!816 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!817 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!818 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!819 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!820 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!821 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!822 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!823 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!824 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!825 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!826 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!827 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!828 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!829 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!830 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!831 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!832 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!833 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!834 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!835 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!836 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!837 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!838 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!839 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!840 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!841 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!842 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!843 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!844 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!845 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!846 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!847 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!852 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!853 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!854 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!855 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!884 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!885 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!886 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!887 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!894 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!895 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!896 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!898 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!899 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!900 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!901 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!902 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!903 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!904 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!905 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!906 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!907 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!908 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!909 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!910 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!911 = !{!"clang version 7.0.0 (tags/RELEASE_700/final)"}
!912 = !{i32 2, !"Dwarf Version", i32 4}
!913 = !{i32 2, !"Debug Info Version", i32 3}
!914 = !{i32 1, !"wchar_size", i32 4}
!915 = !{i32 7, !"PIC Level", i32 2}
!916 = !{i32 7, !"PIE Level", i32 2}
!917 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 316, type: !918, isDefinition: true, scopeLine: 317, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true, unit: !2, retainedNodes: !920)
!918 = !DISubroutineType(types: !919)
!919 = !{null, !95}
!920 = !{!921}
!921 = !DILocalVariable(name: "status", arg: 1, scope: !917, file: !3, line: 316, type: !95)
!922 = !DILocalVariable(name: "infomap", scope: !923, file: !924, line: 632, type: !938)
!923 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !924, file: !924, line: 630, type: !925, isLocal: true, isDefinition: true, scopeLine: 631, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !927)
!924 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!925 = !DISubroutineType(types: !926)
!926 = !{null, !89}
!927 = !{!928, !922, !929, !930, !937}
!928 = !DILocalVariable(name: "program", arg: 1, scope: !923, file: !924, line: 630, type: !89)
!929 = !DILocalVariable(name: "node", scope: !923, file: !924, line: 642, type: !89)
!930 = !DILocalVariable(name: "map_prog", scope: !923, file: !924, line: 643, type: !931)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !933)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !923, file: !924, line: 632, size: 128, elements: !934)
!934 = !{!935, !936}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !933, file: !924, line: 632, baseType: !89, size: 64)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !933, file: !924, line: 632, baseType: !89, size: 64, offset: 64)
!937 = !DILocalVariable(name: "lc_messages", scope: !923, file: !924, line: 655, type: !89)
!938 = !DICompositeType(tag: DW_TAG_array_type, baseType: !932, size: 896, elements: !939)
!939 = !{!940}
!940 = !DISubrange(count: 7)
!941 = !DILocation(line: 632, column: 67, scope: !923, inlinedAt: !942)
!942 = distinct !DILocation(line: 421, column: 7, scope: !943)
!943 = distinct !DILexicalBlock(scope: !944, file: !3, line: 321, column: 5)
!944 = distinct !DILexicalBlock(scope: !917, file: !3, line: 318, column: 7)
!945 = !DILocation(line: 316, column: 12, scope: !917)
!946 = !DILocation(line: 318, column: 14, scope: !944)
!947 = !DILocation(line: 318, column: 7, scope: !917)
!948 = !DILocation(line: 319, column: 5, scope: !949)
!949 = distinct !DILexicalBlock(scope: !944, file: !3, line: 319, column: 5)
!950 = !{!951, !951, i64 0}
!951 = !{!"any pointer", !952, i64 0}
!952 = !{!"omnipotent char", !953, i64 0}
!953 = !{!"Simple C/C++ TBAA"}
!954 = !DILocation(line: 322, column: 7, scope: !943)
!955 = !DILocation(line: 328, column: 7, scope: !943)
!956 = !DILocation(line: 580, column: 3, scope: !957, inlinedAt: !958)
!957 = distinct !DISubprogram(name: "emit_stdin_note", scope: !924, file: !924, line: 578, type: !379, isLocal: true, isDefinition: true, scopeLine: 579, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !366)
!958 = distinct !DILocation(line: 334, column: 7, scope: !943)
!959 = !DILocation(line: 336, column: 7, scope: !943)
!960 = !DILocation(line: 587, column: 3, scope: !961, inlinedAt: !962)
!961 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !924, file: !924, line: 585, type: !379, isLocal: true, isDefinition: true, scopeLine: 586, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !366)
!962 = distinct !DILocation(line: 346, column: 7, scope: !943)
!963 = !DILocation(line: 348, column: 7, scope: !943)
!964 = !DILocation(line: 354, column: 7, scope: !943)
!965 = !DILocation(line: 365, column: 7, scope: !943)
!966 = !DILocation(line: 366, column: 7, scope: !943)
!967 = !DILocation(line: 367, column: 7, scope: !943)
!968 = !DILocation(line: 376, column: 7, scope: !943)
!969 = !DILocation(line: 384, column: 7, scope: !943)
!970 = !DILocation(line: 391, column: 7, scope: !943)
!971 = !DILocation(line: 398, column: 7, scope: !943)
!972 = !DILocation(line: 405, column: 7, scope: !943)
!973 = !DILocation(line: 410, column: 7, scope: !943)
!974 = !DILocation(line: 632, column: 3, scope: !923, inlinedAt: !942)
!975 = !DILocation(line: 643, column: 36, scope: !923, inlinedAt: !942)
!976 = !DILocation(line: 643, column: 25, scope: !923, inlinedAt: !942)
!977 = !DILocation(line: 645, column: 33, scope: !923, inlinedAt: !942)
!978 = !DILocation(line: 645, column: 3, scope: !923, inlinedAt: !942)
!979 = !DILocation(line: 646, column: 13, scope: !923, inlinedAt: !942)
!980 = !DILocation(line: 645, column: 20, scope: !923, inlinedAt: !942)
!981 = !{!982, !951, i64 0}
!982 = !{!"infomap", !951, i64 0, !951, i64 8}
!983 = !DILocation(line: 645, column: 10, scope: !923, inlinedAt: !942)
!984 = !DILocation(line: 645, column: 28, scope: !923, inlinedAt: !942)
!985 = distinct !{!985, !986, !987}
!986 = !DILocation(line: 645, column: 3, scope: !923)
!987 = !DILocation(line: 646, column: 13, scope: !923)
!988 = !DILocation(line: 648, column: 17, scope: !989, inlinedAt: !942)
!989 = distinct !DILexicalBlock(scope: !923, file: !924, line: 648, column: 7)
!990 = !{!982, !951, i64 8}
!991 = !DILocation(line: 648, column: 7, scope: !989, inlinedAt: !942)
!992 = !DILocation(line: 648, column: 7, scope: !923, inlinedAt: !942)
!993 = !DILocation(line: 642, column: 15, scope: !923, inlinedAt: !942)
!994 = !DILocation(line: 651, column: 3, scope: !923, inlinedAt: !942)
!995 = !DILocation(line: 655, column: 29, scope: !923, inlinedAt: !942)
!996 = !DILocation(line: 655, column: 15, scope: !923, inlinedAt: !942)
!997 = !DILocation(line: 656, column: 7, scope: !998, inlinedAt: !942)
!998 = distinct !DILexicalBlock(scope: !923, file: !924, line: 656, column: 7)
!999 = !DILocation(line: 656, column: 19, scope: !998, inlinedAt: !942)
!1000 = !DILocation(line: 656, column: 22, scope: !998, inlinedAt: !942)
!1001 = !DILocation(line: 656, column: 7, scope: !923, inlinedAt: !942)
!1002 = !DILocation(line: 662, column: 7, scope: !1003, inlinedAt: !942)
!1003 = distinct !DILexicalBlock(scope: !998, file: !924, line: 657, column: 5)
!1004 = !DILocation(line: 664, column: 5, scope: !1003, inlinedAt: !942)
!1005 = !DILocation(line: 665, column: 3, scope: !923, inlinedAt: !942)
!1006 = !DILocation(line: 667, column: 3, scope: !923, inlinedAt: !942)
!1007 = !DILocation(line: 669, column: 1, scope: !923, inlinedAt: !942)
!1008 = !DILocation(line: 423, column: 3, scope: !917)
!1009 = !DILocalVariable(name: "block", scope: !1010, file: !3, line: 1371, type: !1026)
!1010 = distinct !DISubprogram(name: "dump", scope: !3, file: !3, line: 1369, type: !1011, isLocal: true, isDefinition: true, scopeLine: 1370, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1013)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!117}
!1013 = !{!1009, !1014, !1015, !1016, !1017, !1018, !1022, !1025}
!1014 = !DILocalVariable(name: "current_offset", scope: !1010, file: !3, line: 1372, type: !98)
!1015 = !DILocalVariable(name: "idx", scope: !1010, file: !3, line: 1373, type: !117)
!1016 = !DILocalVariable(name: "ok", scope: !1010, file: !3, line: 1374, type: !117)
!1017 = !DILocalVariable(name: "n_bytes_read", scope: !1010, file: !3, line: 1375, type: !42)
!1018 = !DILocalVariable(name: "n_needed", scope: !1019, file: !3, line: 1386, type: !42)
!1019 = distinct !DILexicalBlock(scope: !1020, file: !3, line: 1385, column: 9)
!1020 = distinct !DILexicalBlock(scope: !1021, file: !3, line: 1383, column: 5)
!1021 = distinct !DILexicalBlock(scope: !1010, file: !3, line: 1382, column: 7)
!1022 = !DILocalVariable(name: "l_c_m", scope: !1023, file: !3, line: 1421, type: !95)
!1023 = distinct !DILexicalBlock(scope: !1024, file: !3, line: 1420, column: 5)
!1024 = distinct !DILexicalBlock(scope: !1010, file: !3, line: 1419, column: 7)
!1025 = !DILocalVariable(name: "bytes_to_write", scope: !1023, file: !3, line: 1422, type: !42)
!1026 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 128, elements: !309)
!1027 = !DILocation(line: 1371, column: 9, scope: !1010, inlinedAt: !1028)
!1028 = distinct !DILocation(line: 1973, column: 48, scope: !105)
!1029 = !DILocalVariable(name: "buf", scope: !1030, file: !3, line: 1064, type: !1079)
!1030 = distinct !DILexicalBlock(scope: !1031, file: !3, line: 1063, column: 13)
!1031 = distinct !DILexicalBlock(scope: !1032, file: !3, line: 1042, column: 15)
!1032 = distinct !DILexicalBlock(scope: !1033, file: !3, line: 1034, column: 9)
!1033 = distinct !DILexicalBlock(scope: !1034, file: !3, line: 1033, column: 11)
!1034 = distinct !DILexicalBlock(scope: !1035, file: !3, line: 1020, column: 5)
!1035 = distinct !DISubprogram(name: "skip", scope: !3, file: !3, line: 1011, type: !1036, isLocal: true, isDefinition: true, scopeLine: 1012, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1038)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!117, !98}
!1038 = !{!1039, !1040, !1041, !1042, !1029, !1077, !1078}
!1039 = !DILocalVariable(name: "n_skip", arg: 1, scope: !1035, file: !3, line: 1011, type: !98)
!1040 = !DILocalVariable(name: "ok", scope: !1035, file: !3, line: 1013, type: !117)
!1041 = !DILocalVariable(name: "in_errno", scope: !1035, file: !3, line: 1014, type: !95)
!1042 = !DILocalVariable(name: "file_stats", scope: !1034, file: !3, line: 1021, type: !1043)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !1044, line: 46, size: 1152, elements: !1045)
!1044 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!1045 = !{!1046, !1048, !1050, !1052, !1054, !1056, !1058, !1059, !1060, !1061, !1063, !1065, !1073, !1074, !1075}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1043, file: !1044, line: 48, baseType: !1047, size: 64)
!1047 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !101, line: 143, baseType: !44)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1043, file: !1044, line: 53, baseType: !1049, size: 64, offset: 64)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !101, line: 146, baseType: !44)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1043, file: !1044, line: 61, baseType: !1051, size: 64, offset: 128)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !101, line: 149, baseType: !44)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1043, file: !1044, line: 62, baseType: !1053, size: 32, offset: 192)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !101, line: 148, baseType: !6)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1043, file: !1044, line: 64, baseType: !1055, size: 32, offset: 224)
!1055 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !101, line: 144, baseType: !6)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1043, file: !1044, line: 65, baseType: !1057, size: 32, offset: 256)
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !101, line: 145, baseType: !6)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !1043, file: !1044, line: 67, baseType: !95, size: 32, offset: 288)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1043, file: !1044, line: 69, baseType: !1047, size: 64, offset: 320)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1043, file: !1044, line: 74, baseType: !227, size: 64, offset: 384)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1043, file: !1044, line: 78, baseType: !1062, size: 64, offset: 448)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !101, line: 172, baseType: !228)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1043, file: !1044, line: 80, baseType: !1064, size: 64, offset: 512)
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !101, line: 177, baseType: !228)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1043, file: !1044, line: 91, baseType: !1066, size: 128, offset: 576)
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !1067, line: 9, size: 128, elements: !1068)
!1067 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "/home/u/Desktop/go/src/github.com/llir/testdata/coreutils/coreutils-8.30")
!1068 = !{!1069, !1071}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1066, file: !1067, line: 11, baseType: !1070, size: 64)
!1070 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !101, line: 158, baseType: !228)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1066, file: !1067, line: 12, baseType: !1072, size: 64, offset: 64)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !101, line: 194, baseType: !228)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !1043, file: !1044, line: 92, baseType: !1066, size: 128, offset: 704)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !1043, file: !1044, line: 93, baseType: !1066, size: 128, offset: 832)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !1043, file: !1044, line: 106, baseType: !1076, size: 192, offset: 960)
!1076 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1072, size: 192, elements: !314)
!1077 = !DILocalVariable(name: "n_bytes_read", scope: !1030, file: !3, line: 1065, type: !42)
!1078 = !DILocalVariable(name: "n_bytes_to_read", scope: !1030, file: !3, line: 1065, type: !42)
!1079 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 65536, elements: !1080)
!1080 = !{!1081}
!1081 = !DISubrange(count: 8192)
!1082 = !DILocation(line: 1064, column: 20, scope: !1030, inlinedAt: !1083)
!1083 = distinct !DILocation(line: 1916, column: 9, scope: !105)
!1084 = !DILocation(line: 1562, column: 11, scope: !105)
!1085 = !DILocation(line: 1562, column: 24, scope: !105)
!1086 = !DILocation(line: 1568, column: 8, scope: !105)
!1087 = !DILocation(line: 1569, column: 8, scope: !105)
!1088 = !DILocation(line: 1570, column: 8, scope: !105)
!1089 = !DILocation(line: 1571, column: 10, scope: !105)
!1090 = !DILocation(line: 1579, column: 21, scope: !105)
!1091 = !DILocation(line: 1579, column: 3, scope: !105)
!1092 = !DILocation(line: 1580, column: 3, scope: !105)
!1093 = !DILocation(line: 1581, column: 3, scope: !105)
!1094 = !DILocation(line: 1582, column: 3, scope: !105)
!1095 = !DILocation(line: 1584, column: 3, scope: !105)
!1096 = !DILocation(line: 1565, column: 10, scope: !105)
!1097 = !DILocation(line: 1587, column: 27, scope: !1098)
!1098 = distinct !DILexicalBlock(scope: !1099, file: !3, line: 1586, column: 3)
!1099 = distinct !DILexicalBlock(scope: !105, file: !3, line: 1586, column: 3)
!1100 = !DILocation(line: 1589, column: 37, scope: !105)
!1101 = !{!952, !952, i64 0}
!1102 = !DILocation(line: 1590, column: 42, scope: !105)
!1103 = !DILocation(line: 1591, column: 36, scope: !105)
!1104 = !DILocation(line: 1596, column: 55, scope: !105)
!1105 = !DILocation(line: 1600, column: 21, scope: !1106)
!1106 = distinct !DILexicalBlock(scope: !1107, file: !3, line: 1599, column: 3)
!1107 = distinct !DILexicalBlock(scope: !105, file: !3, line: 1599, column: 3)
!1108 = !DILocation(line: 1602, column: 32, scope: !105)
!1109 = !DILocation(line: 1606, column: 38, scope: !105)
!1110 = !DILocation(line: 1607, column: 33, scope: !105)
!1111 = !DILocation(line: 1609, column: 11, scope: !105)
!1112 = !{!1113, !1113, i64 0}
!1113 = !{!"long", !952, i64 0}
!1114 = !DILocation(line: 1610, column: 21, scope: !105)
!1115 = !DILocation(line: 1611, column: 8, scope: !105)
!1116 = !DILocation(line: 1613, column: 18, scope: !105)
!1117 = !DILocation(line: 1614, column: 16, scope: !105)
!1118 = !{!1119, !1119, i64 0}
!1119 = !{!"int", !952, i64 0}
!1120 = !DILocation(line: 1615, column: 19, scope: !105)
!1121 = !DILocation(line: 1618, column: 3, scope: !105)
!1122 = !DILocation(line: 1567, column: 10, scope: !105)
!1123 = !DILocation(line: 1620, column: 7, scope: !123)
!1124 = !DILocation(line: 1622, column: 7, scope: !123)
!1125 = !DILocation(line: 1622, column: 11, scope: !123)
!1126 = !DILocation(line: 1623, column: 15, scope: !123)
!1127 = !DILocation(line: 1623, column: 11, scope: !123)
!1128 = !DILocation(line: 1624, column: 11, scope: !123)
!1129 = !DILocation(line: 1631, column: 19, scope: !130)
!1130 = !DILocation(line: 1631, column: 11, scope: !130)
!1131 = !DILocation(line: 1634, column: 30, scope: !1132)
!1132 = distinct !DILexicalBlock(scope: !130, file: !3, line: 1632, column: 13)
!1133 = !DILocation(line: 1635, column: 28, scope: !1132)
!1134 = !DILocation(line: 1636, column: 31, scope: !1132)
!1135 = !DILocation(line: 1637, column: 15, scope: !1132)
!1136 = !DILocation(line: 1639, column: 30, scope: !1132)
!1137 = !DILocation(line: 1640, column: 28, scope: !1132)
!1138 = !DILocation(line: 1641, column: 31, scope: !1132)
!1139 = !DILocation(line: 1642, column: 15, scope: !1132)
!1140 = !DILocation(line: 1644, column: 30, scope: !1132)
!1141 = !DILocation(line: 1645, column: 28, scope: !1132)
!1142 = !DILocation(line: 1646, column: 31, scope: !1132)
!1143 = !DILocation(line: 1647, column: 15, scope: !1132)
!1144 = !DILocation(line: 1649, column: 30, scope: !1132)
!1145 = !DILocation(line: 1650, column: 31, scope: !1132)
!1146 = !DILocation(line: 1651, column: 15, scope: !1132)
!1147 = !DILocation(line: 1653, column: 15, scope: !1132)
!1148 = !DILocation(line: 1663, column: 31, scope: !130)
!1149 = !DILocation(line: 1663, column: 19, scope: !130)
!1150 = !DILocation(line: 1621, column: 25, scope: !123)
!1151 = !DILocation(line: 1664, column: 21, scope: !1152)
!1152 = distinct !DILexicalBlock(scope: !130, file: !3, line: 1664, column: 15)
!1153 = !DILocation(line: 1664, column: 15, scope: !130)
!1154 = !DILocation(line: 1665, column: 35, scope: !1152)
!1155 = !DILocation(line: 1665, column: 56, scope: !1152)
!1156 = !DILocation(line: 1665, column: 13, scope: !1152)
!1157 = !DILocation(line: 1672, column: 31, scope: !130)
!1158 = !DILocation(line: 1672, column: 19, scope: !130)
!1159 = !DILocation(line: 1674, column: 21, scope: !1160)
!1160 = distinct !DILexicalBlock(scope: !130, file: !3, line: 1674, column: 15)
!1161 = !DILocation(line: 1674, column: 15, scope: !130)
!1162 = !DILocation(line: 1675, column: 35, scope: !1160)
!1163 = !DILocation(line: 1675, column: 56, scope: !1160)
!1164 = !DILocation(line: 1675, column: 13, scope: !1160)
!1165 = !DILocation(line: 1680, column: 15, scope: !1166)
!1166 = distinct !DILexicalBlock(scope: !130, file: !3, line: 1680, column: 15)
!1167 = !DILocation(line: 1680, column: 22, scope: !1166)
!1168 = !DILocation(line: 1680, column: 15, scope: !130)
!1169 = !DILocation(line: 1620, column: 17, scope: !123)
!1170 = !DILocation(line: 1684, column: 23, scope: !1171)
!1171 = distinct !DILexicalBlock(scope: !1166, file: !3, line: 1683, column: 13)
!1172 = !DILocation(line: 1685, column: 25, scope: !1173)
!1173 = distinct !DILexicalBlock(scope: !1171, file: !3, line: 1685, column: 19)
!1174 = !DILocation(line: 1685, column: 19, scope: !1171)
!1175 = !DILocation(line: 1686, column: 39, scope: !1173)
!1176 = !DILocation(line: 1686, column: 60, scope: !1173)
!1177 = !DILocation(line: 1686, column: 17, scope: !1173)
!1178 = !DILocation(line: 1690, column: 30, scope: !1179)
!1179 = distinct !DILexicalBlock(scope: !1171, file: !3, line: 1690, column: 19)
!1180 = !DILocation(scope: !1166)
!1181 = !DILocation(line: 1696, column: 11, scope: !130)
!1182 = !DILocation(line: 1700, column: 39, scope: !130)
!1183 = !DILocation(line: 1700, column: 17, scope: !130)
!1184 = !DILocation(line: 1700, column: 14, scope: !130)
!1185 = !DILocation(line: 1701, column: 11, scope: !130)
!1186 = !DILocation(line: 1706, column: 11, scope: !130)
!1187 = !DILocation(line: 1710, column: 11, scope: !130)
!1188 = !DILocation(line: 1713, column: 19, scope: !130)
!1189 = !DILocation(line: 1713, column: 11, scope: !130)
!1190 = !DILocation(line: 1717, column: 19, scope: !1191)
!1191 = distinct !DILexicalBlock(scope: !130, file: !3, line: 1714, column: 13)
!1192 = !DILocation(line: 1720, column: 19, scope: !1191)
!1193 = !DILocation(line: 1736, column: 11, scope: !130)
!1194 = !DILocation(line: 1737, column: 11, scope: !130)
!1195 = !DILocation(line: 1738, column: 11, scope: !130)
!1196 = !DILocation(line: 1739, column: 11, scope: !130)
!1197 = !DILocation(line: 1740, column: 11, scope: !130)
!1198 = !DILocation(line: 1742, column: 11, scope: !130)
!1199 = !DILocation(line: 1743, column: 11, scope: !130)
!1200 = !DILocation(line: 1745, column: 11, scope: !130)
!1201 = !DILocation(line: 1746, column: 11, scope: !130)
!1202 = !DILocation(line: 1748, column: 11, scope: !130)
!1203 = !DILocation(line: 1749, column: 11, scope: !130)
!1204 = !DILocation(line: 1751, column: 11, scope: !130)
!1205 = !DILocation(line: 1752, column: 11, scope: !130)
!1206 = !DILocation(line: 1754, column: 11, scope: !130)
!1207 = !DILocation(line: 1761, column: 15, scope: !129)
!1208 = !DILocation(line: 1761, column: 22, scope: !129)
!1209 = !DILocation(line: 1761, column: 15, scope: !130)
!1210 = !DILocation(line: 1767, column: 15, scope: !128)
!1211 = !DILocation(line: 1767, column: 25, scope: !128)
!1212 = !DILocation(line: 1768, column: 23, scope: !128)
!1213 = !DILocation(line: 1769, column: 25, scope: !1214)
!1214 = distinct !DILexicalBlock(scope: !128, file: !3, line: 1769, column: 19)
!1215 = !DILocation(line: 1769, column: 19, scope: !128)
!1216 = !DILocation(line: 1770, column: 39, scope: !1214)
!1217 = !DILocation(line: 1770, column: 60, scope: !1214)
!1218 = !DILocation(line: 1770, column: 17, scope: !1214)
!1219 = !DILocation(line: 1771, column: 30, scope: !1220)
!1220 = distinct !DILexicalBlock(scope: !128, file: !3, line: 1771, column: 19)
!1221 = !DILocation(line: 1774, column: 13, scope: !129)
!1222 = !DILocation(line: 1777, column: 9, scope: !130)
!1223 = !DILocation(line: 1779, column: 9, scope: !130)
!1224 = !DILocation(line: 1782, column: 11, scope: !130)
!1225 = !DILocation(scope: !130)
!1226 = !DILocation(line: 1785, column: 5, scope: !105)
!1227 = !DILocation(line: 1787, column: 8, scope: !1228)
!1228 = distinct !DILexicalBlock(scope: !105, file: !3, line: 1787, column: 7)
!1229 = !DILocation(line: 1787, column: 7, scope: !105)
!1230 = !DILocation(line: 1790, column: 28, scope: !1231)
!1231 = distinct !DILexicalBlock(scope: !105, file: !3, line: 1790, column: 7)
!1232 = !DILocation(line: 1790, column: 36, scope: !1231)
!1233 = !DILocation(line: 1790, column: 25, scope: !1231)
!1234 = !DILocation(line: 1791, column: 5, scope: !1231)
!1235 = !DILocation(line: 1794, column: 20, scope: !105)
!1236 = !DILocation(line: 1794, column: 18, scope: !105)
!1237 = !DILocation(line: 1564, column: 7, scope: !105)
!1238 = !DILocation(line: 1808, column: 8, scope: !133)
!1239 = !DILocation(line: 1808, column: 15, scope: !133)
!1240 = !DILocation(line: 1808, column: 7, scope: !105)
!1241 = !DILocation(line: 1810, column: 7, scope: !132)
!1242 = !DILocation(line: 1811, column: 7, scope: !132)
!1243 = !DILocation(line: 1813, column: 7, scope: !132)
!1244 = !DILocation(scope: !1245)
!1245 = distinct !DILexicalBlock(scope: !1246, file: !3, line: 1816, column: 15)
!1246 = distinct !DILexicalBlock(scope: !132, file: !3, line: 1814, column: 9)
!1247 = !DILocation(line: 1816, column: 28, scope: !1245)
!1248 = !DILocation(line: 1816, column: 47, scope: !1245)
!1249 = !DILocation(line: 1817, column: 15, scope: !1245)
!1250 = !DILocation(line: 1810, column: 17, scope: !132)
!1251 = !DILocalVariable(name: "s", arg: 1, scope: !1252, file: !3, line: 1329, type: !89)
!1252 = distinct !DISubprogram(name: "parse_old_offset", scope: !3, file: !3, line: 1329, type: !1253, isLocal: true, isDefinition: true, scopeLine: 1330, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !1256)
!1253 = !DISubroutineType(types: !1254)
!1254 = !{!117, !89, !1255}
