source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [FILE]...\0A\00", align 1
@.str.2 = private unnamed_addr constant [119 x i8] c"Write lines consisting of the sequentially corresponding lines from\0Aeach FILE, separated by TABs, to standard output.\0A\00", align 1
@stdout = external local_unnamed_addr global %struct._IO_FILE*, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 59, type: !179, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !29, globals: !175, nameTableKind: None)
!3 = !DIFile(filename: "src/paste.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !20}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!9 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 45, baseType: !7, size: 32, elements: !22)
!21 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!22 = !{!23, !24, !25, !26, !27, !28}
!23 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0, isUnsigned: true)
!24 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2, isUnsigned: true)
!25 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5, isUnsigned: true)
!26 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4, isUnsigned: true)
!27 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3, isUnsigned: true)
!28 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1, isUnsigned: true)
!29 = !{!30, !40, !101, !105, !109, !112, !115, !122, !34, !91, !137, !141, !144, !148, !151, !155, !157, !160, !163, !164, !165, !168, !93, !36, !169, !174}
!30 = !DISubprogram(name: "dcgettext", scope: !31, file: !31, line: 51, type: !32, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!31 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!32 = !DISubroutineType(types: !33)
!33 = !{!34, !36, !36, !38}
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!38 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!39 = !{}
!40 = !DISubprogram(name: "fputs_unlocked", scope: !41, file: !41, line: 662, type: !42, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!41 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!42 = !DISubroutineType(types: !43)
!43 = !{!38, !36, !44}
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !46, line: 49, size: 1728, elements: !47)
!46 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!47 = !{!48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !63, !64, !65, !66, !70, !72, !74, !78, !81, !83, !86, !89, !90, !92, !96, !97}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !45, file: !46, line: 51, baseType: !38, size: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !45, file: !46, line: 54, baseType: !34, size: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !45, file: !46, line: 55, baseType: !34, size: 64, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !45, file: !46, line: 56, baseType: !34, size: 64, offset: 192)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !45, file: !46, line: 57, baseType: !34, size: 64, offset: 256)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !45, file: !46, line: 58, baseType: !34, size: 64, offset: 320)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !45, file: !46, line: 59, baseType: !34, size: 64, offset: 384)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !45, file: !46, line: 60, baseType: !34, size: 64, offset: 448)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !45, file: !46, line: 61, baseType: !34, size: 64, offset: 512)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !45, file: !46, line: 64, baseType: !34, size: 64, offset: 576)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !45, file: !46, line: 65, baseType: !34, size: 64, offset: 640)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !45, file: !46, line: 66, baseType: !34, size: 64, offset: 704)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !45, file: !46, line: 68, baseType: !61, size: 64, offset: 768)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !46, line: 36, flags: DIFlagFwdDecl)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !45, file: !46, line: 70, baseType: !44, size: 64, offset: 832)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !45, file: !46, line: 72, baseType: !38, size: 32, offset: 896)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !45, file: !46, line: 73, baseType: !38, size: 32, offset: 928)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !45, file: !46, line: 74, baseType: !67, size: 64, offset: 960)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !68, line: 152, baseType: !69)
!68 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!69 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !45, file: !46, line: 77, baseType: !71, size: 16, offset: 1024)
!71 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !45, file: !46, line: 78, baseType: !73, size: 8, offset: 1040)
!73 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !45, file: !46, line: 79, baseType: !75, size: 8, offset: 1048)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 8, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 1)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !45, file: !46, line: 81, baseType: !79, size: 64, offset: 1088)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !46, line: 43, baseType: null)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !45, file: !46, line: 89, baseType: !82, size: 64, offset: 1152)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !68, line: 153, baseType: !69)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !45, file: !46, line: 91, baseType: !84, size: 64, offset: 1216)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !46, line: 37, flags: DIFlagFwdDecl)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !45, file: !46, line: 92, baseType: !87, size: 64, offset: 1280)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !46, line: 38, flags: DIFlagFwdDecl)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !45, file: !46, line: 93, baseType: !44, size: 64, offset: 1344)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !45, file: !46, line: 94, baseType: !91, size: 64, offset: 1408)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !45, file: !46, line: 95, baseType: !93, size: 64, offset: 1472)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !94, line: 46, baseType: !95)
!94 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!95 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !45, file: !46, line: 96, baseType: !38, size: 32, offset: 1536)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !45, file: !46, line: 98, baseType: !98, size: 160, offset: 1568)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 160, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 20)
!101 = !DISubprogram(name: "set_program_name", scope: !102, file: !102, line: 37, type: !103, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!102 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!103 = !DISubroutineType(types: !104)
!104 = !{null, !36}
!105 = !DISubprogram(name: "setlocale", scope: !106, file: !106, line: 122, type: !107, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!106 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!107 = !DISubroutineType(types: !108)
!108 = !{!34, !38, !36}
!109 = !DISubprogram(name: "bindtextdomain", scope: !31, file: !31, line: 86, type: !110, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!110 = !DISubroutineType(types: !111)
!111 = !{!34, !36, !36}
!112 = !DISubprogram(name: "textdomain", scope: !31, file: !31, line: 82, type: !113, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!113 = !DISubroutineType(types: !114)
!114 = !{!34, !36}
!115 = !DISubprogram(name: "atexit", scope: !116, file: !116, line: 595, type: !117, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!116 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!117 = !DISubroutineType(types: !118)
!118 = !{!38, !119}
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{null}
!122 = !DISubprogram(name: "getopt_long", scope: !123, file: !123, line: 66, type: !124, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!123 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!124 = !DISubroutineType(types: !125)
!125 = !{!38, !38, !126, !36, !128, !135}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !130)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !123, line: 50, size: 256, elements: !131)
!131 = !{!132, !133, !134, !136}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !130, file: !123, line: 52, baseType: !36, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !130, file: !123, line: 55, baseType: !38, size: 32, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !130, file: !123, line: 56, baseType: !135, size: 64, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !130, file: !123, line: 57, baseType: !38, size: 32, offset: 192)
!137 = !DISubprogram(name: "version_etc", scope: !138, file: !138, line: 69, type: !139, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!138 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!139 = !DISubroutineType(types: !140)
!140 = !{null, !44, !36, !36, !36, null}
!141 = !DISubprogram(name: "quotearg_n_style_colon", scope: !6, file: !6, line: 397, type: !142, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!142 = !DISubroutineType(types: !143)
!143 = !{!34, !38, !5, !36}
!144 = !DISubprogram(name: "error", scope: !145, file: !145, line: 52, type: !146, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!145 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!146 = !DISubroutineType(types: !147)
!147 = !{null, !38, !38, !36, null}
!148 = !DISubprogram(name: "free", scope: !116, file: !116, line: 565, type: !149, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!149 = !DISubroutineType(types: !150)
!150 = !{null, !91}
!151 = !DISubprogram(name: "rpl_fclose", scope: !152, file: !152, line: 672, type: !153, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!152 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!153 = !DISubroutineType(types: !154)
!154 = !{!38, !44}
!155 = !DISubprogram(name: "xstrdup", scope: !156, file: !156, line: 64, type: !113, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!156 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!157 = !DISubprogram(name: "fadvise", scope: !21, file: !21, line: 72, type: !158, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!158 = !DISubroutineType(types: !159)
!159 = !{null, !44, !20}
!160 = !DISubprogram(name: "clearerr_unlocked", scope: !41, file: !41, line: 765, type: !161, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!161 = !DISubroutineType(types: !162)
!162 = !{null, !44}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!165 = !DISubprogram(name: "xmalloc", scope: !156, file: !156, line: 53, type: !166, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!166 = !DISubroutineType(types: !167)
!167 = !{!91, !95}
!168 = !DISubprogram(name: "fileno", scope: !41, file: !41, line: 786, type: !153, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!169 = !DISubprogram(name: "fwrite_unlocked", scope: !41, file: !41, line: 675, type: !170, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!170 = !DISubroutineType(types: !171)
!171 = !{!95, !172, !95, !95, !44}
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!174 = !DISubprogram(name: "xalloc_die", scope: !156, file: !156, line: 51, type: !120, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !39)
!175 = !{!176, !177, !180, !182, !187, !189}
!176 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "serial_merge", scope: !2, file: !3, line: 63, type: !179, isLocal: true, isDefinition: true)
!179 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(name: "delims", scope: !2, file: !3, line: 66, type: !34, isLocal: true, isDefinition: true)
!182 = !DIGlobalVariableExpression(var: !183, expr: !DIExpression())
!183 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 73, type: !184, isLocal: true, isDefinition: true)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 1536, elements: !185)
!185 = !{!186}
!186 = !DISubrange(count: 6)
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(name: "line_delim", scope: !2, file: !3, line: 71, type: !164, isLocal: true, isDefinition: true)
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(name: "delim_end", scope: !2, file: !3, line: 69, type: !36, isLocal: true, isDefinition: true)
!191 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!192 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551606, DW_OP_mul, DW_OP_constu, 10, DW_OP_plus, DW_OP_stack_value))
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(name: "Version", scope: !195, file: !196, line: 2, type: !36, isDefinition: true)
!195 = distinct !DICompileUnit(language: DW_LANG_C99, file: !196, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !39, globals: !197, nameTableKind: None)
!196 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!197 = !{!193}
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(name: "file_name", scope: !200, file: !201, line: 46, type: !36, isLocal: true, isDefinition: true)
!200 = distinct !DICompileUnit(language: DW_LANG_C99, file: !201, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !39, retainedTypes: !202, globals: !240, nameTableKind: None)
!201 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!202 = !{!203, !30, !239, !144}
!203 = !DISubprogram(name: "close_stream", scope: !204, file: !204, line: 2, type: !205, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!204 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!205 = !DISubroutineType(types: !206)
!206 = !{!38, !207}
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !46, line: 49, size: 1728, elements: !209)
!209 = !{!210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !208, file: !46, line: 51, baseType: !38, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !208, file: !46, line: 54, baseType: !34, size: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !208, file: !46, line: 55, baseType: !34, size: 64, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !208, file: !46, line: 56, baseType: !34, size: 64, offset: 192)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !208, file: !46, line: 57, baseType: !34, size: 64, offset: 256)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !208, file: !46, line: 58, baseType: !34, size: 64, offset: 320)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !208, file: !46, line: 59, baseType: !34, size: 64, offset: 384)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !208, file: !46, line: 60, baseType: !34, size: 64, offset: 448)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !208, file: !46, line: 61, baseType: !34, size: 64, offset: 512)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !208, file: !46, line: 64, baseType: !34, size: 64, offset: 576)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !208, file: !46, line: 65, baseType: !34, size: 64, offset: 640)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !208, file: !46, line: 66, baseType: !34, size: 64, offset: 704)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !208, file: !46, line: 68, baseType: !61, size: 64, offset: 768)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !208, file: !46, line: 70, baseType: !207, size: 64, offset: 832)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !208, file: !46, line: 72, baseType: !38, size: 32, offset: 896)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !208, file: !46, line: 73, baseType: !38, size: 32, offset: 928)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !208, file: !46, line: 74, baseType: !67, size: 64, offset: 960)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !208, file: !46, line: 77, baseType: !71, size: 16, offset: 1024)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !208, file: !46, line: 78, baseType: !73, size: 8, offset: 1040)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !208, file: !46, line: 79, baseType: !75, size: 8, offset: 1048)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !208, file: !46, line: 81, baseType: !79, size: 64, offset: 1088)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !208, file: !46, line: 89, baseType: !82, size: 64, offset: 1152)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !208, file: !46, line: 91, baseType: !84, size: 64, offset: 1216)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !208, file: !46, line: 92, baseType: !87, size: 64, offset: 1280)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !208, file: !46, line: 93, baseType: !207, size: 64, offset: 1344)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !208, file: !46, line: 94, baseType: !91, size: 64, offset: 1408)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !208, file: !46, line: 95, baseType: !93, size: 64, offset: 1472)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !208, file: !46, line: 96, baseType: !38, size: 32, offset: 1536)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !208, file: !46, line: 98, baseType: !98, size: 160, offset: 1568)
!239 = !DISubprogram(name: "quotearg_colon", scope: !6, file: !6, line: 391, type: !113, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!240 = !{!198, !241}
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !200, file: !201, line: 56, type: !179, isLocal: true, isDefinition: true)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(name: "exit_failure", scope: !245, file: !246, line: 24, type: !248, isDefinition: true)
!245 = distinct !DICompileUnit(language: DW_LANG_C99, file: !246, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !39, globals: !247, nameTableKind: None)
!246 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!247 = !{!243}
!248 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !38)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(name: "program_name", scope: !251, file: !252, line: 33, type: !36, isDefinition: true)
!251 = distinct !DICompileUnit(language: DW_LANG_C99, file: !252, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !39, retainedTypes: !253, globals: !289, nameTableKind: None)
!252 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!253 = !{!91, !254, !34}
!254 = !DISubprogram(name: "fputs", scope: !41, file: !41, line: 626, type: !255, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!255 = !DISubroutineType(types: !256)
!256 = !{!38, !36, !257}
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !46, line: 49, size: 1728, elements: !259)
!259 = !{!260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !258, file: !46, line: 51, baseType: !38, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !258, file: !46, line: 54, baseType: !34, size: 64, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !258, file: !46, line: 55, baseType: !34, size: 64, offset: 128)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !258, file: !46, line: 56, baseType: !34, size: 64, offset: 192)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !258, file: !46, line: 57, baseType: !34, size: 64, offset: 256)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !258, file: !46, line: 58, baseType: !34, size: 64, offset: 320)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !258, file: !46, line: 59, baseType: !34, size: 64, offset: 384)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !258, file: !46, line: 60, baseType: !34, size: 64, offset: 448)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !258, file: !46, line: 61, baseType: !34, size: 64, offset: 512)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !258, file: !46, line: 64, baseType: !34, size: 64, offset: 576)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !258, file: !46, line: 65, baseType: !34, size: 64, offset: 640)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !258, file: !46, line: 66, baseType: !34, size: 64, offset: 704)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !258, file: !46, line: 68, baseType: !61, size: 64, offset: 768)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !258, file: !46, line: 70, baseType: !257, size: 64, offset: 832)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !258, file: !46, line: 72, baseType: !38, size: 32, offset: 896)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !258, file: !46, line: 73, baseType: !38, size: 32, offset: 928)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !258, file: !46, line: 74, baseType: !67, size: 64, offset: 960)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !258, file: !46, line: 77, baseType: !71, size: 16, offset: 1024)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !258, file: !46, line: 78, baseType: !73, size: 8, offset: 1040)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !258, file: !46, line: 79, baseType: !75, size: 8, offset: 1048)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !258, file: !46, line: 81, baseType: !79, size: 64, offset: 1088)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !258, file: !46, line: 89, baseType: !82, size: 64, offset: 1152)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !258, file: !46, line: 91, baseType: !84, size: 64, offset: 1216)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !258, file: !46, line: 92, baseType: !87, size: 64, offset: 1280)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !258, file: !46, line: 93, baseType: !257, size: 64, offset: 1344)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !258, file: !46, line: 94, baseType: !91, size: 64, offset: 1408)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !258, file: !46, line: 95, baseType: !93, size: 64, offset: 1472)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !258, file: !46, line: 96, baseType: !38, size: 32, offset: 1536)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !258, file: !46, line: 98, baseType: !98, size: 160, offset: 1568)
!289 = !{!249}
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !292, file: !293, line: 85, type: !403, isDefinition: true)
!292 = distinct !DICompileUnit(language: DW_LANG_C99, file: !293, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !294, retainedTypes: !315, globals: !376, nameTableKind: None)
!293 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!294 = !{!5, !295, !300}
!295 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, baseType: !7, size: 32, elements: !296)
!296 = !{!297, !298, !299}
!297 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!298 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!299 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!300 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !301, line: 46, baseType: !7, size: 32, elements: !302)
!301 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!302 = !{!303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314}
!303 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!304 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!305 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!306 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!307 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!308 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!309 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!310 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!311 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!312 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!313 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!314 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!315 = !{!316, !319, !148, !335, !38, !71, !338, !93, !355, !359, !30, !365, !369, !34, !165, !174, !373}
!316 = !DISubprogram(name: "xmemdup", scope: !156, file: !156, line: 62, type: !317, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!317 = !DISubroutineType(types: !318)
!318 = !{!91, !172, !95}
!319 = !DISubprogram(name: "quotearg_alloc_mem", scope: !6, file: !6, line: 342, type: !320, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!320 = !DISubroutineType(types: !321)
!321 = !{!34, !36, !95, !322, !323}
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !325)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !293, line: 65, size: 448, elements: !326)
!326 = !{!327, !328, !329, !333, !334}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !325, file: !293, line: 68, baseType: !5, size: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !325, file: !293, line: 71, baseType: !38, size: 32, offset: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !325, file: !293, line: 75, baseType: !330, size: 256, offset: 64)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !331)
!331 = !{!332}
!332 = !DISubrange(count: 8)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !325, file: !293, line: 78, baseType: !36, size: 64, offset: 320)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !325, file: !293, line: 81, baseType: !36, size: 64, offset: 384)
!335 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !6, file: !6, line: 408, type: !336, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!336 = !DISubroutineType(types: !337)
!337 = !{!34, !38, !36, !36, !36, !95}
!338 = !DISubprogram(name: "rpl_mbrtowc", scope: !339, file: !339, line: 717, type: !340, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!339 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!340 = !DISubroutineType(types: !341)
!341 = !{!95, !135, !36, !95, !342}
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !344, line: 13, size: 64, elements: !345)
!344 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!345 = !{!346, !347}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !343, file: !344, line: 15, baseType: !38, size: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !343, file: !344, line: 20, baseType: !348, size: 32, offset: 32)
!348 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !343, file: !344, line: 16, size: 32, elements: !349)
!349 = !{!350, !351}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !348, file: !344, line: 18, baseType: !7, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !348, file: !344, line: 19, baseType: !352, size: 32)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 32, elements: !353)
!353 = !{!354}
!354 = !DISubrange(count: 4)
!355 = !DISubprogram(name: "iswprint", scope: !356, file: !356, line: 120, type: !357, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!356 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!357 = !DISubroutineType(types: !358)
!358 = !{!38, !7}
!359 = !DISubprogram(name: "mbsinit", scope: !360, file: !360, line: 292, type: !361, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!360 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!361 = !DISubroutineType(types: !362)
!362 = !{!38, !363}
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !343)
!365 = !DISubprogram(name: "locale_charset", scope: !366, file: !366, line: 35, type: !367, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!366 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!367 = !DISubroutineType(types: !368)
!368 = !{!36}
!369 = !DISubprogram(name: "c_strcasecmp", scope: !370, file: !370, line: 42, type: !371, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!370 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!371 = !DISubroutineType(types: !372)
!372 = !{!38, !36, !36}
!373 = !DISubprogram(name: "xrealloc", scope: !156, file: !156, line: 59, type: !374, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!374 = !DISubroutineType(types: !375)
!375 = !{!91, !91, !95}
!376 = !{!290, !377, !383, !385, !387, !392, !399, !401}
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !292, file: !293, line: 101, type: !379, isDefinition: true)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !380, size: 320, elements: !381)
!380 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!381 = !{!382}
!382 = !DISubrange(count: 10)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !292, file: !293, line: 1052, type: !325, isDefinition: true)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !292, file: !293, line: 116, type: !325, isLocal: true, isDefinition: true)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "slot0", scope: !292, file: !293, line: 842, type: !389, isLocal: true, isDefinition: true)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 2048, elements: !390)
!390 = !{!391}
!391 = !DISubrange(count: 256)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "slotvec", scope: !292, file: !293, line: 845, type: !394, isLocal: true, isDefinition: true)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !293, line: 834, size: 128, elements: !396)
!396 = !{!397, !398}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !395, file: !293, line: 836, baseType: !93, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !395, file: !293, line: 837, baseType: !34, size: 64, offset: 64)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(name: "nslots", scope: !292, file: !293, line: 843, type: !38, isLocal: true, isDefinition: true)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "slotvec0", scope: !292, file: !293, line: 844, type: !395, isLocal: true, isDefinition: true)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !404, size: 704, elements: !405)
!404 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!405 = !{!406}
!406 = !DISubrange(count: 11)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !409, file: !410, line: 26, type: !412, isDefinition: true)
!409 = distinct !DICompileUnit(language: DW_LANG_C99, file: !410, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !39, globals: !411, nameTableKind: None)
!410 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!411 = !{!407}
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 376, elements: !413)
!413 = !{!414}
!414 = !DISubrange(count: 47)
!415 = distinct !DICompileUnit(language: DW_LANG_C99, file: !416, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !417, retainedTypes: !418, nameTableKind: None)
!416 = !DIFile(filename: "lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!417 = !{!20}
!418 = !{!419, !423}
!419 = !DISubprogram(name: "posix_fadvise", scope: !420, file: !420, line: 288, type: !421, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!420 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
!421 = !DISubroutineType(types: !422)
!422 = !{!38, !38, !69, !69, !38}
!423 = !DISubprogram(name: "fileno", scope: !41, file: !41, line: 786, type: !424, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!424 = !DISubroutineType(types: !425)
!425 = !{!38, !426}
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !46, line: 49, size: 1728, elements: !428)
!428 = !{!429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !427, file: !46, line: 51, baseType: !38, size: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !427, file: !46, line: 54, baseType: !34, size: 64, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !427, file: !46, line: 55, baseType: !34, size: 64, offset: 128)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !427, file: !46, line: 56, baseType: !34, size: 64, offset: 192)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !427, file: !46, line: 57, baseType: !34, size: 64, offset: 256)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !427, file: !46, line: 58, baseType: !34, size: 64, offset: 320)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !427, file: !46, line: 59, baseType: !34, size: 64, offset: 384)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !427, file: !46, line: 60, baseType: !34, size: 64, offset: 448)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !427, file: !46, line: 61, baseType: !34, size: 64, offset: 512)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !427, file: !46, line: 64, baseType: !34, size: 64, offset: 576)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !427, file: !46, line: 65, baseType: !34, size: 64, offset: 640)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !427, file: !46, line: 66, baseType: !34, size: 64, offset: 704)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !427, file: !46, line: 68, baseType: !61, size: 64, offset: 768)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !427, file: !46, line: 70, baseType: !426, size: 64, offset: 832)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !427, file: !46, line: 72, baseType: !38, size: 32, offset: 896)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !427, file: !46, line: 73, baseType: !38, size: 32, offset: 928)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !427, file: !46, line: 74, baseType: !67, size: 64, offset: 960)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !427, file: !46, line: 77, baseType: !71, size: 16, offset: 1024)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !427, file: !46, line: 78, baseType: !73, size: 8, offset: 1040)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !427, file: !46, line: 79, baseType: !75, size: 8, offset: 1048)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !427, file: !46, line: 81, baseType: !79, size: 64, offset: 1088)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !427, file: !46, line: 89, baseType: !82, size: 64, offset: 1152)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !427, file: !46, line: 91, baseType: !84, size: 64, offset: 1216)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !427, file: !46, line: 92, baseType: !87, size: 64, offset: 1280)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !427, file: !46, line: 93, baseType: !426, size: 64, offset: 1344)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !427, file: !46, line: 94, baseType: !91, size: 64, offset: 1408)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !427, file: !46, line: 95, baseType: !93, size: 64, offset: 1472)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !427, file: !46, line: 96, baseType: !38, size: 32, offset: 1536)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !427, file: !46, line: 98, baseType: !98, size: 160, offset: 1568)
!458 = distinct !DICompileUnit(language: DW_LANG_C99, file: !459, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !460, retainedTypes: !464, nameTableKind: None)
!459 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!460 = !{!461}
!461 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !459, line: 40, baseType: !7, size: 32, elements: !462)
!462 = !{!463}
!463 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!464 = !{!30, !465, !91}
!465 = !DISubprogram(name: "fputs_unlocked", scope: !41, file: !41, line: 662, type: !466, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!466 = !DISubroutineType(types: !467)
!467 = !{!38, !36, !468}
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !46, line: 49, size: 1728, elements: !470)
!470 = !{!471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !469, file: !46, line: 51, baseType: !38, size: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !469, file: !46, line: 54, baseType: !34, size: 64, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !469, file: !46, line: 55, baseType: !34, size: 64, offset: 128)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !469, file: !46, line: 56, baseType: !34, size: 64, offset: 192)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !469, file: !46, line: 57, baseType: !34, size: 64, offset: 256)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !469, file: !46, line: 58, baseType: !34, size: 64, offset: 320)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !469, file: !46, line: 59, baseType: !34, size: 64, offset: 384)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !469, file: !46, line: 60, baseType: !34, size: 64, offset: 448)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !469, file: !46, line: 61, baseType: !34, size: 64, offset: 512)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !469, file: !46, line: 64, baseType: !34, size: 64, offset: 576)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !469, file: !46, line: 65, baseType: !34, size: 64, offset: 640)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !469, file: !46, line: 66, baseType: !34, size: 64, offset: 704)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !469, file: !46, line: 68, baseType: !61, size: 64, offset: 768)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !469, file: !46, line: 70, baseType: !468, size: 64, offset: 832)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !469, file: !46, line: 72, baseType: !38, size: 32, offset: 896)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !469, file: !46, line: 73, baseType: !38, size: 32, offset: 928)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !469, file: !46, line: 74, baseType: !67, size: 64, offset: 960)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !469, file: !46, line: 77, baseType: !71, size: 16, offset: 1024)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !469, file: !46, line: 78, baseType: !73, size: 8, offset: 1040)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !469, file: !46, line: 79, baseType: !75, size: 8, offset: 1048)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !469, file: !46, line: 81, baseType: !79, size: 64, offset: 1088)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !469, file: !46, line: 89, baseType: !82, size: 64, offset: 1152)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !469, file: !46, line: 91, baseType: !84, size: 64, offset: 1216)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !469, file: !46, line: 92, baseType: !87, size: 64, offset: 1280)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !469, file: !46, line: 93, baseType: !468, size: 64, offset: 1344)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !469, file: !46, line: 94, baseType: !91, size: 64, offset: 1408)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !469, file: !46, line: 95, baseType: !93, size: 64, offset: 1472)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !469, file: !46, line: 96, baseType: !38, size: 32, offset: 1536)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !469, file: !46, line: 98, baseType: !98, size: 160, offset: 1568)
!500 = distinct !DICompileUnit(language: DW_LANG_C99, file: !501, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !502, retainedTypes: !515, nameTableKind: None)
!501 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!502 = !{!503}
!503 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !504, file: !156, line: 186, baseType: !7, size: 32, elements: !513)
!504 = distinct !DISubprogram(name: "x2nrealloc", scope: !156, file: !156, line: 174, type: !505, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !500, retainedNodes: !508)
!505 = !DISubroutineType(types: !506)
!506 = !{!91, !91, !507, !93}
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!508 = !{!509, !510, !511, !512}
!509 = !DILocalVariable(name: "p", arg: 1, scope: !504, file: !156, line: 174, type: !91)
!510 = !DILocalVariable(name: "pn", arg: 2, scope: !504, file: !156, line: 174, type: !507)
!511 = !DILocalVariable(name: "s", arg: 3, scope: !504, file: !156, line: 174, type: !93)
!512 = !DILocalVariable(name: "n", scope: !504, file: !156, line: 176, type: !93)
!513 = !{!514}
!514 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!515 = !{!93, !174, !165, !373, !34, !148, !91, !516, !519}
!516 = !DISubprogram(name: "xcalloc", scope: !156, file: !156, line: 57, type: !517, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!517 = !DISubroutineType(types: !518)
!518 = !{!91, !95, !95}
!519 = !DISubprogram(name: "rpl_calloc", scope: !520, file: !520, line: 688, type: !517, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!520 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!521 = distinct !DICompileUnit(language: DW_LANG_C99, file: !522, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !39, retainedTypes: !523, nameTableKind: None)
!522 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!523 = !{!30, !144}
!524 = distinct !DICompileUnit(language: DW_LANG_C99, file: !525, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !39, retainedTypes: !526, nameTableKind: None)
!525 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!526 = !{!91}
!527 = distinct !DICompileUnit(language: DW_LANG_C99, file: !528, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !39, retainedTypes: !529, nameTableKind: None)
!528 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!529 = !{!530, !565, !566, !570}
!530 = !DISubprogram(name: "fileno", scope: !41, file: !41, line: 786, type: !531, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!531 = !DISubroutineType(types: !532)
!532 = !{!38, !533}
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !46, line: 49, size: 1728, elements: !535)
!535 = !{!536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !534, file: !46, line: 51, baseType: !38, size: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !534, file: !46, line: 54, baseType: !34, size: 64, offset: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !534, file: !46, line: 55, baseType: !34, size: 64, offset: 128)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !534, file: !46, line: 56, baseType: !34, size: 64, offset: 192)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !534, file: !46, line: 57, baseType: !34, size: 64, offset: 256)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !534, file: !46, line: 58, baseType: !34, size: 64, offset: 320)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !534, file: !46, line: 59, baseType: !34, size: 64, offset: 384)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !534, file: !46, line: 60, baseType: !34, size: 64, offset: 448)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !534, file: !46, line: 61, baseType: !34, size: 64, offset: 512)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !534, file: !46, line: 64, baseType: !34, size: 64, offset: 576)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !534, file: !46, line: 65, baseType: !34, size: 64, offset: 640)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !534, file: !46, line: 66, baseType: !34, size: 64, offset: 704)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !534, file: !46, line: 68, baseType: !61, size: 64, offset: 768)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !534, file: !46, line: 70, baseType: !533, size: 64, offset: 832)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !534, file: !46, line: 72, baseType: !38, size: 32, offset: 896)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !534, file: !46, line: 73, baseType: !38, size: 32, offset: 928)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !534, file: !46, line: 74, baseType: !67, size: 64, offset: 960)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !534, file: !46, line: 77, baseType: !71, size: 16, offset: 1024)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !534, file: !46, line: 78, baseType: !73, size: 8, offset: 1040)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !534, file: !46, line: 79, baseType: !75, size: 8, offset: 1048)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !534, file: !46, line: 81, baseType: !79, size: 64, offset: 1088)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !534, file: !46, line: 89, baseType: !82, size: 64, offset: 1152)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !534, file: !46, line: 91, baseType: !84, size: 64, offset: 1216)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !534, file: !46, line: 92, baseType: !87, size: 64, offset: 1280)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !534, file: !46, line: 93, baseType: !533, size: 64, offset: 1344)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !534, file: !46, line: 94, baseType: !91, size: 64, offset: 1408)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !534, file: !46, line: 95, baseType: !93, size: 64, offset: 1472)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !534, file: !46, line: 96, baseType: !38, size: 32, offset: 1536)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !534, file: !46, line: 98, baseType: !98, size: 160, offset: 1568)
!565 = !DISubprogram(name: "fclose", scope: !41, file: !41, line: 213, type: !531, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!566 = !DISubprogram(name: "lseek", scope: !567, file: !567, line: 334, type: !568, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!567 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!568 = !DISubroutineType(types: !569)
!569 = !{!69, !38, !69, !38}
!570 = !DISubprogram(name: "rpl_fflush", scope: !152, file: !152, line: 718, type: !531, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!571 = distinct !DICompileUnit(language: DW_LANG_C99, file: !572, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !39, retainedTypes: !573, nameTableKind: None)
!572 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!573 = !{!91, !574, !609}
!574 = !DISubprogram(name: "fflush", scope: !41, file: !41, line: 218, type: !575, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!575 = !DISubroutineType(types: !576)
!576 = !{!38, !577}
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !46, line: 49, size: 1728, elements: !579)
!579 = !{!580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !578, file: !46, line: 51, baseType: !38, size: 32)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !578, file: !46, line: 54, baseType: !34, size: 64, offset: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !578, file: !46, line: 55, baseType: !34, size: 64, offset: 128)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !578, file: !46, line: 56, baseType: !34, size: 64, offset: 192)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !578, file: !46, line: 57, baseType: !34, size: 64, offset: 256)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !578, file: !46, line: 58, baseType: !34, size: 64, offset: 320)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !578, file: !46, line: 59, baseType: !34, size: 64, offset: 384)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !578, file: !46, line: 60, baseType: !34, size: 64, offset: 448)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !578, file: !46, line: 61, baseType: !34, size: 64, offset: 512)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !578, file: !46, line: 64, baseType: !34, size: 64, offset: 576)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !578, file: !46, line: 65, baseType: !34, size: 64, offset: 640)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !578, file: !46, line: 66, baseType: !34, size: 64, offset: 704)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !578, file: !46, line: 68, baseType: !61, size: 64, offset: 768)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !578, file: !46, line: 70, baseType: !577, size: 64, offset: 832)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !578, file: !46, line: 72, baseType: !38, size: 32, offset: 896)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !578, file: !46, line: 73, baseType: !38, size: 32, offset: 928)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !578, file: !46, line: 74, baseType: !67, size: 64, offset: 960)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !578, file: !46, line: 77, baseType: !71, size: 16, offset: 1024)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !578, file: !46, line: 78, baseType: !73, size: 8, offset: 1040)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !578, file: !46, line: 79, baseType: !75, size: 8, offset: 1048)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !578, file: !46, line: 81, baseType: !79, size: 64, offset: 1088)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !578, file: !46, line: 89, baseType: !82, size: 64, offset: 1152)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !578, file: !46, line: 91, baseType: !84, size: 64, offset: 1216)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !578, file: !46, line: 92, baseType: !87, size: 64, offset: 1280)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !578, file: !46, line: 93, baseType: !577, size: 64, offset: 1344)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !578, file: !46, line: 94, baseType: !91, size: 64, offset: 1408)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !578, file: !46, line: 95, baseType: !93, size: 64, offset: 1472)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !578, file: !46, line: 96, baseType: !38, size: 32, offset: 1536)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !578, file: !46, line: 98, baseType: !98, size: 160, offset: 1568)
!609 = !DISubprogram(name: "rpl_fseeko", scope: !152, file: !152, line: 1034, type: !610, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!610 = !DISubroutineType(types: !611)
!611 = !{!38, !577, !69, !38}
!612 = distinct !DICompileUnit(language: DW_LANG_C99, file: !613, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !39, retainedTypes: !614, nameTableKind: None)
!613 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!614 = !{!91, !615, !566, !650}
!615 = !DISubprogram(name: "fileno", scope: !41, file: !41, line: 786, type: !616, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!616 = !DISubroutineType(types: !617)
!617 = !{!38, !618}
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !46, line: 49, size: 1728, elements: !620)
!620 = !{!621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !619, file: !46, line: 51, baseType: !38, size: 32)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !619, file: !46, line: 54, baseType: !34, size: 64, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !619, file: !46, line: 55, baseType: !34, size: 64, offset: 128)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !619, file: !46, line: 56, baseType: !34, size: 64, offset: 192)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !619, file: !46, line: 57, baseType: !34, size: 64, offset: 256)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !619, file: !46, line: 58, baseType: !34, size: 64, offset: 320)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !619, file: !46, line: 59, baseType: !34, size: 64, offset: 384)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !619, file: !46, line: 60, baseType: !34, size: 64, offset: 448)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !619, file: !46, line: 61, baseType: !34, size: 64, offset: 512)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !619, file: !46, line: 64, baseType: !34, size: 64, offset: 576)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !619, file: !46, line: 65, baseType: !34, size: 64, offset: 640)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !619, file: !46, line: 66, baseType: !34, size: 64, offset: 704)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !619, file: !46, line: 68, baseType: !61, size: 64, offset: 768)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !619, file: !46, line: 70, baseType: !618, size: 64, offset: 832)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !619, file: !46, line: 72, baseType: !38, size: 32, offset: 896)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !619, file: !46, line: 73, baseType: !38, size: 32, offset: 928)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !619, file: !46, line: 74, baseType: !67, size: 64, offset: 960)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !619, file: !46, line: 77, baseType: !71, size: 16, offset: 1024)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !619, file: !46, line: 78, baseType: !73, size: 8, offset: 1040)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !619, file: !46, line: 79, baseType: !75, size: 8, offset: 1048)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !619, file: !46, line: 81, baseType: !79, size: 64, offset: 1088)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !619, file: !46, line: 89, baseType: !82, size: 64, offset: 1152)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !619, file: !46, line: 91, baseType: !84, size: 64, offset: 1216)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !619, file: !46, line: 92, baseType: !87, size: 64, offset: 1280)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !619, file: !46, line: 93, baseType: !618, size: 64, offset: 1344)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !619, file: !46, line: 94, baseType: !91, size: 64, offset: 1408)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !619, file: !46, line: 95, baseType: !93, size: 64, offset: 1472)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !619, file: !46, line: 96, baseType: !38, size: 32, offset: 1536)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !619, file: !46, line: 98, baseType: !98, size: 160, offset: 1568)
!650 = !DISubprogram(name: "fseeko", scope: !41, file: !41, line: 707, type: !651, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!651 = !DISubroutineType(types: !652)
!652 = !{!38, !618, !69, !38}
!653 = distinct !DICompileUnit(language: DW_LANG_C99, file: !654, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !39, retainedTypes: !655, nameTableKind: None)
!654 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!655 = !{!656, !93, !668}
!656 = !DISubprogram(name: "mbrtowc", scope: !360, file: !360, line: 296, type: !657, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!657 = !DISubroutineType(types: !658)
!658 = !{!95, !135, !36, !95, !659}
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !344, line: 13, size: 64, elements: !661)
!661 = !{!662, !663}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !660, file: !344, line: 15, baseType: !38, size: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !660, file: !344, line: 20, baseType: !664, size: 32, offset: 32)
!664 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !660, file: !344, line: 16, size: 32, elements: !665)
!665 = !{!666, !667}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !664, file: !344, line: 18, baseType: !7, size: 32)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !664, file: !344, line: 19, baseType: !352, size: 32)
!668 = !DISubprogram(name: "hard_locale", scope: !669, file: !669, line: 26, type: !670, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!669 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!670 = !DISubroutineType(types: !671)
!671 = !{!179, !38}
!672 = distinct !DICompileUnit(language: DW_LANG_C99, file: !673, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !39, retainedTypes: !674, nameTableKind: None)
!673 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!674 = !{!675}
!675 = !DISubprogram(name: "rpl_fclose", scope: !152, file: !152, line: 672, type: !676, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!676 = !DISubroutineType(types: !677)
!677 = !{!38, !678}
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !46, line: 49, size: 1728, elements: !680)
!680 = !{!681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !679, file: !46, line: 51, baseType: !38, size: 32)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !679, file: !46, line: 54, baseType: !34, size: 64, offset: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !679, file: !46, line: 55, baseType: !34, size: 64, offset: 128)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !679, file: !46, line: 56, baseType: !34, size: 64, offset: 192)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !679, file: !46, line: 57, baseType: !34, size: 64, offset: 256)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !679, file: !46, line: 58, baseType: !34, size: 64, offset: 320)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !679, file: !46, line: 59, baseType: !34, size: 64, offset: 384)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !679, file: !46, line: 60, baseType: !34, size: 64, offset: 448)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !679, file: !46, line: 61, baseType: !34, size: 64, offset: 512)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !679, file: !46, line: 64, baseType: !34, size: 64, offset: 576)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !679, file: !46, line: 65, baseType: !34, size: 64, offset: 640)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !679, file: !46, line: 66, baseType: !34, size: 64, offset: 704)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !679, file: !46, line: 68, baseType: !61, size: 64, offset: 768)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !679, file: !46, line: 70, baseType: !678, size: 64, offset: 832)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !679, file: !46, line: 72, baseType: !38, size: 32, offset: 896)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !679, file: !46, line: 73, baseType: !38, size: 32, offset: 928)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !679, file: !46, line: 74, baseType: !67, size: 64, offset: 960)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !679, file: !46, line: 77, baseType: !71, size: 16, offset: 1024)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !679, file: !46, line: 78, baseType: !73, size: 8, offset: 1040)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !679, file: !46, line: 79, baseType: !75, size: 8, offset: 1048)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !679, file: !46, line: 81, baseType: !79, size: 64, offset: 1088)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !679, file: !46, line: 89, baseType: !82, size: 64, offset: 1152)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !679, file: !46, line: 91, baseType: !84, size: 64, offset: 1216)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !679, file: !46, line: 92, baseType: !87, size: 64, offset: 1280)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !679, file: !46, line: 93, baseType: !678, size: 64, offset: 1344)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !679, file: !46, line: 94, baseType: !91, size: 64, offset: 1408)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !679, file: !46, line: 95, baseType: !93, size: 64, offset: 1472)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !679, file: !46, line: 96, baseType: !38, size: 32, offset: 1536)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !679, file: !46, line: 98, baseType: !98, size: 160, offset: 1568)
!710 = distinct !DICompileUnit(language: DW_LANG_C99, file: !711, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !39, retainedTypes: !712, nameTableKind: None)
!711 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!712 = !{!713}
!713 = !DISubprogram(name: "setlocale_null_r", scope: !714, file: !714, line: 64, type: !715, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !39)
!714 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!715 = !DISubroutineType(types: !716)
!716 = !{!38, !38, !34, !95}
!717 = distinct !DICompileUnit(language: DW_LANG_C99, file: !718, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !719, retainedTypes: !1106, nameTableKind: None)
!718 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!719 = !{!720}
!720 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !721, line: 41, baseType: !7, size: 32, elements: !722)
!721 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!722 = !{!723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105}
!723 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!724 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!725 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!726 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!727 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!728 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!729 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!730 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!731 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!732 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!733 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!734 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!735 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!736 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!737 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!738 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!739 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!740 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!741 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!742 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!743 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!744 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!745 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!746 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!747 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!748 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!749 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!750 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!751 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!752 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!753 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!754 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!755 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!756 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!757 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!758 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!759 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!760 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!761 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!762 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!763 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!764 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!765 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!766 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!767 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!768 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!769 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!770 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!771 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!772 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!773 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!774 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!779 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!780 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!781 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!782 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!783 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!784 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!785 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!786 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!787 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!788 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!789 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!790 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!791 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!793 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!794 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!795 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!796 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!797 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!798 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!799 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!800 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!801 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!802 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!803 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!804 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!805 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!806 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!807 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!808 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!809 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!810 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!812 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!813 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!814 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!815 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!816 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!817 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!818 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!819 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!820 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!821 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!822 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!823 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!824 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!825 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!826 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!827 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!828 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!829 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!830 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!831 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!832 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!833 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!834 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!835 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!836 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!837 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!838 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!839 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!840 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!841 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!842 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!843 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!844 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!845 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!846 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!847 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!884 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!885 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!886 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!887 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!894 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!895 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!896 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!898 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!899 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!900 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!901 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!902 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!903 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!904 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!905 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!906 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!907 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!908 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!909 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!910 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!911 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!912 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!913 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!914 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!915 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!916 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!917 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!918 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!919 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!920 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!921 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!922 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!923 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!924 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!925 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!926 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!927 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!928 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!929 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!930 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!931 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!932 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!933 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!934 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!935 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!936 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!937 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!938 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!939 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!940 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!941 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!942 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!943 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!944 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!945 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!946 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!947 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!948 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!949 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!950 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!951 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!952 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!953 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!954 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!955 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!956 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!957 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!958 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!959 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!960 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!961 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!962 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!963 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!964 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!965 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!966 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!967 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!968 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
