; ModuleID = 'coreutils-8.32/src/pathchk.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [31 x i8] c"Usage: %s [OPTION]... NAME...\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 73, type: !49, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !44, globals: !48, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/pathchk.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !20}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!9 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 24, baseType: !7, size: 32, elements: !22)
!21 = !DIFile(filename: "/usr/include/bits/confname.h", directory: "")
!22 = !{!23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43}
!23 = !DIEnumerator(name: "_PC_LINK_MAX", value: 0, isUnsigned: true)
!24 = !DIEnumerator(name: "_PC_MAX_CANON", value: 1, isUnsigned: true)
!25 = !DIEnumerator(name: "_PC_MAX_INPUT", value: 2, isUnsigned: true)
!26 = !DIEnumerator(name: "_PC_NAME_MAX", value: 3, isUnsigned: true)
!27 = !DIEnumerator(name: "_PC_PATH_MAX", value: 4, isUnsigned: true)
!28 = !DIEnumerator(name: "_PC_PIPE_BUF", value: 5, isUnsigned: true)
!29 = !DIEnumerator(name: "_PC_CHOWN_RESTRICTED", value: 6, isUnsigned: true)
!30 = !DIEnumerator(name: "_PC_NO_TRUNC", value: 7, isUnsigned: true)
!31 = !DIEnumerator(name: "_PC_VDISABLE", value: 8, isUnsigned: true)
!32 = !DIEnumerator(name: "_PC_SYNC_IO", value: 9, isUnsigned: true)
!33 = !DIEnumerator(name: "_PC_ASYNC_IO", value: 10, isUnsigned: true)
!34 = !DIEnumerator(name: "_PC_PRIO_IO", value: 11, isUnsigned: true)
!35 = !DIEnumerator(name: "_PC_SOCK_MAXBUF", value: 12, isUnsigned: true)
!36 = !DIEnumerator(name: "_PC_FILESIZEBITS", value: 13, isUnsigned: true)
!37 = !DIEnumerator(name: "_PC_REC_INCR_XFER_SIZE", value: 14, isUnsigned: true)
!38 = !DIEnumerator(name: "_PC_REC_MAX_XFER_SIZE", value: 15, isUnsigned: true)
!39 = !DIEnumerator(name: "_PC_REC_MIN_XFER_SIZE", value: 16, isUnsigned: true)
!40 = !DIEnumerator(name: "_PC_REC_XFER_ALIGN", value: 17, isUnsigned: true)
!41 = !DIEnumerator(name: "_PC_ALLOC_SIZE_MIN", value: 18, isUnsigned: true)
!42 = !DIEnumerator(name: "_PC_SYMLINK_MAX", value: 19, isUnsigned: true)
!43 = !DIEnumerator(name: "_PC_2_SYMLINKS", value: 20, isUnsigned: true)
!44 = !{!45, !47}
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!48 = !{!0}
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 1024, elements: !62)
!50 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !52, line: 50, size: 256, elements: !53)
!52 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!53 = !{!54, !57, !59, !61}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !51, file: !52, line: 52, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !51, file: !52, line: 55, baseType: !58, size: 32, offset: 64)
!58 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !51, file: !52, line: 56, baseType: !60, size: 64, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !51, file: !52, line: 57, baseType: !58, size: 32, offset: 192)
!62 = !{!63}
!63 = !DISubrange(count: 4)
!64 = !DIGlobalVariableExpression(var: !65, expr: !DIExpression())
!65 = distinct !DIGlobalVariable(name: "Version", scope: !66, file: !67, line: 2, type: !55, isLocal: false, isDefinition: true)
!66 = distinct !DICompileUnit(language: DW_LANG_C99, file: !67, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, globals: !69, splitDebugInlining: false, nameTableKind: None)
!67 = !DIFile(filename: "src/version.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!68 = !{}
!69 = !{!64}
!70 = !DIGlobalVariableExpression(var: !71, expr: !DIExpression())
!71 = distinct !DIGlobalVariable(name: "file_name", scope: !72, file: !73, line: 46, type: !55, isLocal: true, isDefinition: true)
!72 = distinct !DICompileUnit(language: DW_LANG_C99, file: !73, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, globals: !74, splitDebugInlining: false, nameTableKind: None)
!73 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!74 = !{!70, !75}
!75 = !DIGlobalVariableExpression(var: !76, expr: !DIExpression())
!76 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !72, file: !73, line: 56, type: !77, isLocal: true, isDefinition: true)
!77 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!78 = !DIGlobalVariableExpression(var: !79, expr: !DIExpression())
!79 = distinct !DIGlobalVariable(name: "exit_failure", scope: !80, file: !81, line: 24, type: !83, isLocal: false, isDefinition: true)
!80 = distinct !DICompileUnit(language: DW_LANG_C99, file: !81, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, globals: !82, splitDebugInlining: false, nameTableKind: None)
!81 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!82 = !{!78}
!83 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !58)
!84 = !DIGlobalVariableExpression(var: !85, expr: !DIExpression())
!85 = distinct !DIGlobalVariable(name: "program_name", scope: !86, file: !87, line: 33, type: !55, isLocal: false, isDefinition: true)
!86 = distinct !DICompileUnit(language: DW_LANG_C99, file: !87, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, retainedTypes: !88, globals: !89, splitDebugInlining: false, nameTableKind: None)
!87 = !DIFile(filename: "lib/progname.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!88 = !{!47, !45}
!89 = !{!84}
!90 = !DIGlobalVariableExpression(var: !91, expr: !DIExpression())
!91 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !92, file: !93, line: 85, type: !157, isLocal: false, isDefinition: true)
!92 = distinct !DICompileUnit(language: DW_LANG_C99, file: !93, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !94, retainedTypes: !115, globals: !120, splitDebugInlining: false, nameTableKind: None)
!93 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!94 = !{!5, !95, !100}
!95 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, baseType: !7, size: 32, elements: !96)
!96 = !{!97, !98, !99}
!97 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!98 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!99 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!100 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !101, line: 46, baseType: !7, size: 32, elements: !102)
!101 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!102 = !{!103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114}
!103 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!104 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!105 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!106 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!107 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!108 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!109 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!110 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!111 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!112 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!113 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!114 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!115 = !{!58, !116, !117, !45}
!116 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !118, line: 46, baseType: !119)
!118 = !DIFile(filename: "/usr/lib/clang/12.0.1/include/stddef.h", directory: "")
!119 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!120 = !{!90, !121, !127, !139, !141, !146, !153, !155}
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !92, file: !93, line: 101, type: !123, isLocal: false, isDefinition: true)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 320, elements: !125)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!125 = !{!126}
!126 = !DISubrange(count: 10)
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !92, file: !93, line: 1052, type: !129, isLocal: false, isDefinition: true)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !93, line: 65, size: 448, elements: !130)
!130 = !{!131, !132, !133, !137, !138}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !129, file: !93, line: 68, baseType: !5, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !129, file: !93, line: 71, baseType: !58, size: 32, offset: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !129, file: !93, line: 75, baseType: !134, size: 256, offset: 64)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !135)
!135 = !{!136}
!136 = !DISubrange(count: 8)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !129, file: !93, line: 78, baseType: !55, size: 64, offset: 320)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !129, file: !93, line: 81, baseType: !55, size: 64, offset: 384)
!139 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression())
!140 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !92, file: !93, line: 116, type: !129, isLocal: true, isDefinition: true)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(name: "slot0", scope: !92, file: !93, line: 842, type: !143, isLocal: true, isDefinition: true)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 2048, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: 256)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(name: "slotvec", scope: !92, file: !93, line: 845, type: !148, isLocal: true, isDefinition: true)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !93, line: 834, size: 128, elements: !150)
!150 = !{!151, !152}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !149, file: !93, line: 836, baseType: !117, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !149, file: !93, line: 837, baseType: !45, size: 64, offset: 64)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "nslots", scope: !92, file: !93, line: 843, type: !58, isLocal: true, isDefinition: true)
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(name: "slotvec0", scope: !92, file: !93, line: 844, type: !149, isLocal: true, isDefinition: true)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 704, elements: !159)
!158 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!159 = !{!160}
!160 = !DISubrange(count: 11)
!161 = !DIGlobalVariableExpression(var: !162, expr: !DIExpression())
!162 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !163, file: !164, line: 26, type: !166, isLocal: false, isDefinition: true)
!163 = distinct !DICompileUnit(language: DW_LANG_C99, file: !164, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, globals: !165, splitDebugInlining: false, nameTableKind: None)
!164 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!165 = !{!161}
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 376, elements: !167)
!167 = !{!168}
!168 = !DISubrange(count: 47)
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(name: "internal_state", scope: !171, file: !172, line: 24, type: !175, isLocal: true, isDefinition: true)
!171 = distinct !DICompileUnit(language: DW_LANG_C99, file: !172, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, retainedTypes: !173, globals: !174, splitDebugInlining: false, nameTableKind: None)
!172 = !DIFile(filename: "lib/mbrlen.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!173 = !{!47}
!174 = !{!169}
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !176, line: 6, baseType: !177)
!176 = !DIFile(filename: "/usr/include/bits/types/mbstate_t.h", directory: "")
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !178, line: 21, baseType: !179)
!178 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !178, line: 13, size: 64, elements: !180)
!180 = !{!181, !182}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !179, file: !178, line: 15, baseType: !58, size: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !179, file: !178, line: 20, baseType: !183, size: 32, offset: 32)
!183 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !179, file: !178, line: 16, size: 32, elements: !184)
!184 = !{!185, !186}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !183, file: !178, line: 18, baseType: !7, size: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !183, file: !178, line: 19, baseType: !187, size: 32)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 32, elements: !62)
!188 = distinct !DICompileUnit(language: DW_LANG_C99, file: !189, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !190, retainedTypes: !173, splitDebugInlining: false, nameTableKind: None)
!189 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!190 = !{!191}
!191 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !189, line: 40, baseType: !7, size: 32, elements: !192)
!192 = !{!193}
!193 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!194 = distinct !DICompileUnit(language: DW_LANG_C99, file: !195, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !196, retainedTypes: !210, splitDebugInlining: false, nameTableKind: None)
!195 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!196 = !{!197}
!197 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !199, file: !198, line: 186, baseType: !7, size: 32, elements: !208)
!198 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!199 = distinct !DISubprogram(name: "x2nrealloc", scope: !198, file: !198, line: 174, type: !200, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !194, retainedNodes: !203)
!200 = !DISubroutineType(types: !201)
!201 = !{!47, !47, !202, !117}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!203 = !{!204, !205, !206, !207}
!204 = !DILocalVariable(name: "p", arg: 1, scope: !199, file: !198, line: 174, type: !47)
!205 = !DILocalVariable(name: "pn", arg: 2, scope: !199, file: !198, line: 174, type: !202)
!206 = !DILocalVariable(name: "s", arg: 3, scope: !199, file: !198, line: 174, type: !117)
!207 = !DILocalVariable(name: "n", scope: !199, file: !198, line: 176, type: !117)
!208 = !{!209}
!209 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!210 = !{!117, !45, !47}
!211 = distinct !DICompileUnit(language: DW_LANG_C99, file: !212, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, splitDebugInlining: false, nameTableKind: None)
!212 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!213 = distinct !DICompileUnit(language: DW_LANG_C99, file: !214, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, retainedTypes: !173, splitDebugInlining: false, nameTableKind: None)
!214 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!215 = distinct !DICompileUnit(language: DW_LANG_C99, file: !216, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, retainedTypes: !217, splitDebugInlining: false, nameTableKind: None)
!216 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!217 = !{!117}
!218 = distinct !DICompileUnit(language: DW_LANG_C99, file: !219, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, splitDebugInlining: false, nameTableKind: None)
!219 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!220 = distinct !DICompileUnit(language: DW_LANG_C99, file: !221, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, splitDebugInlining: false, nameTableKind: None)
!221 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!222 = distinct !DICompileUnit(language: DW_LANG_C99, file: !223, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !224, retainedTypes: !173, splitDebugInlining: false, nameTableKind: None)
!223 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!224 = !{!225}
!225 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !226, line: 41, baseType: !7, size: 32, elements: !227)
!226 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!227 = !{!228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610}
!228 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!229 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!230 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!231 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!232 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!233 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!234 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!235 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!236 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!237 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!238 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!239 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!240 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!241 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!242 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!243 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!244 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!245 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!246 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!247 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!248 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!249 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!250 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!251 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!252 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!253 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!254 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!255 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!256 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!257 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!258 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!259 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!260 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!261 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!262 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!263 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!264 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!265 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!266 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!267 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!268 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!269 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!270 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!271 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!272 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!273 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!274 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!275 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!276 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!277 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!278 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!279 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!280 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!281 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!282 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!283 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!284 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!285 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!286 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!287 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!288 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!289 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!290 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!291 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!292 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!293 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!294 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!295 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!296 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!297 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!298 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!299 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!300 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!301 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!302 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!303 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!304 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!305 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!306 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!307 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!308 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!309 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!310 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!311 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!312 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!313 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!314 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!315 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!316 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!317 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!318 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!319 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!320 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!321 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!322 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!323 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!324 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!325 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!326 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!327 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!328 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!329 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!330 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!331 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!332 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!333 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!334 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!335 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!336 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!337 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!338 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!339 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!340 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!341 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!342 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!343 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!344 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!345 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!346 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!347 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!348 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!349 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!350 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!351 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!352 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!353 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!354 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!355 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!356 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!357 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!358 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!359 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!360 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!361 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!362 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!363 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!364 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!365 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!366 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!367 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!368 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!369 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!370 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!371 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!372 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!373 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!374 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!375 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!376 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!377 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!378 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!379 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!380 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!381 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!382 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!383 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!384 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!385 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!386 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!387 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!388 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!389 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!390 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!391 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!392 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!393 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!394 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!395 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!396 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!397 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!398 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!399 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!400 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!401 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!402 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!403 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!404 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!405 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!406 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!407 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!408 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!409 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!410 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!411 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!412 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!413 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!414 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!415 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!416 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!417 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!418 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!419 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!420 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!421 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!422 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!423 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!424 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!425 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!426 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!427 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!428 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!429 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!430 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!431 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!432 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!433 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!434 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!435 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!436 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!437 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!438 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!439 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!440 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!441 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!442 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!443 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!444 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!445 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!446 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!447 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!448 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!449 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!450 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!451 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!452 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!453 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!454 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!455 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!456 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!457 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!458 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!459 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!460 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!461 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!462 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!463 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!464 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!465 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!466 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!467 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!468 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!469 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!470 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!471 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!472 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!473 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!474 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!475 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!476 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!477 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!478 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!479 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!480 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!481 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!482 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!483 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!484 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!485 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!486 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!487 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!488 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!489 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!490 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!491 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!492 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!493 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!494 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!495 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!496 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!497 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!498 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!499 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!500 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!501 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!502 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!503 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!504 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!505 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!506 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!507 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!508 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!509 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!510 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!511 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!512 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!513 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!514 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!515 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!516 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!517 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!518 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!519 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!520 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!521 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!522 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!523 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!524 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!525 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!526 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!527 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!528 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!529 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!530 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!531 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!532 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!533 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!534 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!535 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!536 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!537 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!538 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!539 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!540 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!541 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!542 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!543 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!544 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!545 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!546 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!547 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!548 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!549 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!550 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!551 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!552 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!553 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!554 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!555 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!556 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!557 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!558 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!559 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!560 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!561 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!562 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!563 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!564 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!565 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!566 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!567 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!568 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!569 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!570 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!571 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!572 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!573 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!574 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!575 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!576 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!577 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!578 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!579 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!580 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!581 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!582 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!583 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!584 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!585 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!586 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!587 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!588 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!589 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!590 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!591 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!592 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!593 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!594 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!595 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!596 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!597 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!598 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!599 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!600 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!601 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!602 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!603 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!604 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!605 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!606 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!607 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!608 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!609 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!610 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!611 = distinct !DICompileUnit(language: DW_LANG_C99, file: !612, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, retainedTypes: !173, splitDebugInlining: false, nameTableKind: None)
!612 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!613 = distinct !DICompileUnit(language: DW_LANG_C99, file: !614, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, splitDebugInlining: false, nameTableKind: None)
!614 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!615 = distinct !DICompileUnit(language: DW_LANG_C99, file: !616, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, retainedTypes: !173, splitDebugInlining: false, nameTableKind: None)
!616 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!617 = distinct !DICompileUnit(language: DW_LANG_C99, file: !618, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !68, retainedTypes: !173, splitDebugInlining: false, nameTableKind: None)
!618 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!619 = !{!"clang version 12.0.1"}
!620 = !{i32 7, !"Dwarf Version", i32 4}
!621 = !{i32 2, !"Debug Info Version", i32 3}
!622 = !{i32 1, !"wchar_size", i32 4}
!623 = !{i32 7, !"PIC Level", i32 2}
!624 = !{i32 7, !"PIE Level", i32 2}
!625 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 82, type: !626, scopeLine: 83, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !628)
!626 = !DISubroutineType(types: !627)
!627 = !{null, !58}
!628 = !{!629}
!629 = !DILocalVariable(name: "status", arg: 1, scope: !625, file: !3, line: 82, type: !58)
!630 = !DILocation(line: 0, scope: !625)
!631 = !DILocation(line: 84, column: 14, scope: !632)
!632 = distinct !DILexicalBlock(scope: !625, file: !3, line: 84, column: 7)
!633 = !DILocation(line: 84, column: 7, scope: !625)
!634 = !DILocation(line: 85, column: 5, scope: !635)
!635 = distinct !DILexicalBlock(scope: !632, file: !3, line: 85, column: 5)
!636 = !{!637, !637, i64 0}
!637 = !{!"any pointer", !638, i64 0}
!638 = !{!"omnipotent char", !639, i64 0}
!639 = !{!"Simple C/C++ TBAA"}
!640 = !DILocation(line: 88, column: 7, scope: !641)
!641 = distinct !DILexicalBlock(scope: !632, file: !3, line: 87, column: 5)
!642 = !DILocation(line: 89, column: 7, scope: !641)
!643 = !DILocation(line: 96, column: 7, scope: !641)
!644 = !DILocation(line: 97, column: 7, scope: !641)
!645 = !DILocalVariable(name: "program", arg: 1, scope: !646, file: !647, line: 634, type: !55)
!646 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !647, file: !647, line: 634, type: !648, scopeLine: 635, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !650)
!647 = !DIFile(filename: "src/system.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!648 = !DISubroutineType(types: !649)
!649 = !{null, !55}
!650 = !{!645, !651, !660, !661, !663}
!651 = !DILocalVariable(name: "infomap", scope: !646, file: !647, line: 636, type: !652)
!652 = !DICompositeType(tag: DW_TAG_array_type, baseType: !653, size: 896, elements: !658)
!653 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !654)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !646, file: !647, line: 636, size: 128, elements: !655)
!655 = !{!656, !657}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !654, file: !647, line: 636, baseType: !55, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !654, file: !647, line: 636, baseType: !55, size: 64, offset: 64)
!658 = !{!659}
!659 = !DISubrange(count: 7)
!660 = !DILocalVariable(name: "node", scope: !646, file: !647, line: 646, type: !55)
!661 = !DILocalVariable(name: "map_prog", scope: !646, file: !647, line: 647, type: !662)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!663 = !DILocalVariable(name: "lc_messages", scope: !646, file: !647, line: 659, type: !55)
!664 = !DILocation(line: 0, scope: !646, inlinedAt: !665)
!665 = distinct !DILocation(line: 98, column: 7, scope: !641)
!666 = !DILocation(line: 636, column: 3, scope: !646, inlinedAt: !665)
!667 = !DILocation(line: 636, column: 67, scope: !646, inlinedAt: !665)
!668 = !DILocation(line: 647, column: 36, scope: !646, inlinedAt: !665)
!669 = !DILocation(line: 649, column: 3, scope: !646, inlinedAt: !665)
!670 = !DILocation(line: 649, column: 33, scope: !646, inlinedAt: !665)
!671 = !DILocation(line: 650, column: 13, scope: !646, inlinedAt: !665)
!672 = !DILocation(line: 649, column: 20, scope: !646, inlinedAt: !665)
!673 = !{!674, !637, i64 0}
!674 = !{!"infomap", !637, i64 0, !637, i64 8}
!675 = !DILocation(line: 649, column: 10, scope: !646, inlinedAt: !665)
!676 = !DILocation(line: 649, column: 28, scope: !646, inlinedAt: !665)
!677 = distinct !{!677, !669, !671, !678}
!678 = !{!"llvm.loop.mustprogress"}
!679 = !DILocation(line: 652, column: 17, scope: !680, inlinedAt: !665)
!680 = distinct !DILexicalBlock(scope: !646, file: !647, line: 652, column: 7)
!681 = !{!674, !637, i64 8}
!682 = !DILocation(line: 652, column: 7, scope: !680, inlinedAt: !665)
!683 = !DILocation(line: 652, column: 7, scope: !646, inlinedAt: !665)
!684 = !DILocation(line: 655, column: 3, scope: !646, inlinedAt: !665)
!685 = !DILocation(line: 659, column: 29, scope: !646, inlinedAt: !665)
!686 = !DILocation(line: 660, column: 7, scope: !687, inlinedAt: !665)
!687 = distinct !DILexicalBlock(scope: !646, file: !647, line: 660, column: 7)
!688 = !DILocation(line: 660, column: 19, scope: !687, inlinedAt: !665)
!689 = !DILocation(line: 660, column: 22, scope: !687, inlinedAt: !665)
!690 = !DILocation(line: 660, column: 7, scope: !646, inlinedAt: !665)
!691 = !DILocation(line: 666, column: 7, scope: !692, inlinedAt: !665)
!692 = distinct !DILexicalBlock(scope: !687, file: !647, line: 661, column: 5)
!693 = !DILocation(line: 668, column: 5, scope: !692, inlinedAt: !665)
!694 = !DILocation(line: 669, column: 3, scope: !646, inlinedAt: !665)
!695 = !DILocation(line: 671, column: 3, scope: !646, inlinedAt: !665)
!696 = !DILocation(line: 673, column: 1, scope: !646, inlinedAt: !665)
!697 = !DILocation(line: 100, column: 3, scope: !625)
!698 = !DISubprogram(name: "dcgettext", scope: !699, file: !699, line: 51, type: !700, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!699 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!700 = !DISubroutineType(types: !701)
!701 = !{!45, !55, !55, !58}
!702 = !DISubprogram(name: "fputs_unlocked", scope: !703, file: !703, line: 667, type: !704, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!703 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!704 = !DISubroutineType(types: !705)
!705 = !{!58, !55, !706}
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !708, line: 49, size: 1728, elements: !709)
!708 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!709 = !{!710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !725, !726, !727, !728, !732, !733, !735, !739, !742, !744, !747, !750, !751, !752, !753, !754}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !707, file: !708, line: 51, baseType: !58, size: 32)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !707, file: !708, line: 54, baseType: !45, size: 64, offset: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !707, file: !708, line: 55, baseType: !45, size: 64, offset: 128)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !707, file: !708, line: 56, baseType: !45, size: 64, offset: 192)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !707, file: !708, line: 57, baseType: !45, size: 64, offset: 256)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !707, file: !708, line: 58, baseType: !45, size: 64, offset: 320)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !707, file: !708, line: 59, baseType: !45, size: 64, offset: 384)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !707, file: !708, line: 60, baseType: !45, size: 64, offset: 448)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !707, file: !708, line: 61, baseType: !45, size: 64, offset: 512)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !707, file: !708, line: 64, baseType: !45, size: 64, offset: 576)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !707, file: !708, line: 65, baseType: !45, size: 64, offset: 640)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !707, file: !708, line: 66, baseType: !45, size: 64, offset: 704)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !707, file: !708, line: 68, baseType: !723, size: 64, offset: 768)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !708, line: 36, flags: DIFlagFwdDecl)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !707, file: !708, line: 70, baseType: !706, size: 64, offset: 832)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !707, file: !708, line: 72, baseType: !58, size: 32, offset: 896)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !707, file: !708, line: 73, baseType: !58, size: 32, offset: 928)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !707, file: !708, line: 74, baseType: !729, size: 64, offset: 960)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !730, line: 152, baseType: !731)
!730 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!731 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !707, file: !708, line: 77, baseType: !116, size: 16, offset: 1024)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !707, file: !708, line: 78, baseType: !734, size: 8, offset: 1040)
!734 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !707, file: !708, line: 79, baseType: !736, size: 8, offset: 1048)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 8, elements: !737)
!737 = !{!738}
!738 = !DISubrange(count: 1)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !707, file: !708, line: 81, baseType: !740, size: 64, offset: 1088)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !708, line: 43, baseType: null)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !707, file: !708, line: 89, baseType: !743, size: 64, offset: 1152)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !730, line: 153, baseType: !731)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !707, file: !708, line: 91, baseType: !745, size: 64, offset: 1216)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !708, line: 37, flags: DIFlagFwdDecl)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !707, file: !708, line: 92, baseType: !748, size: 64, offset: 1280)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !708, line: 38, flags: DIFlagFwdDecl)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !707, file: !708, line: 93, baseType: !706, size: 64, offset: 1344)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !707, file: !708, line: 94, baseType: !47, size: 64, offset: 1408)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !707, file: !708, line: 95, baseType: !117, size: 64, offset: 1472)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !707, file: !708, line: 96, baseType: !58, size: 32, offset: 1536)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !707, file: !708, line: 98, baseType: !755, size: 160, offset: 1568)
!755 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 160, elements: !756)
!756 = !{!757}
!757 = !DISubrange(count: 20)
!758 = !DISubprogram(name: "setlocale", scope: !759, file: !759, line: 122, type: !760, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!759 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!760 = !DISubroutineType(types: !761)
!761 = !{!45, !58, !55}
!762 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 104, type: !763, scopeLine: 105, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !766)
!763 = !DISubroutineType(types: !764)
!764 = !{!58, !58, !765}
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!766 = !{!767, !768, !769, !770, !771, !772}
!767 = !DILocalVariable(name: "argc", arg: 1, scope: !762, file: !3, line: 104, type: !58)
!768 = !DILocalVariable(name: "argv", arg: 2, scope: !762, file: !3, line: 104, type: !765)
!769 = !DILocalVariable(name: "ok", scope: !762, file: !3, line: 106, type: !77)
!770 = !DILocalVariable(name: "check_basic_portability", scope: !762, file: !3, line: 107, type: !77)
!771 = !DILocalVariable(name: "check_extra_portability", scope: !762, file: !3, line: 108, type: !77)
!772 = !DILocalVariable(name: "optc", scope: !762, file: !3, line: 109, type: !58)
!773 = !DILocation(line: 0, scope: !762)
!774 = !DILocation(line: 112, column: 21, scope: !762)
!775 = !DILocation(line: 112, column: 3, scope: !762)
!776 = !DILocation(line: 113, column: 3, scope: !762)
!777 = !DILocation(line: 114, column: 3, scope: !762)
!778 = !DILocation(line: 115, column: 3, scope: !762)
!779 = !DILocation(line: 117, column: 3, scope: !762)
!780 = !DILocation(line: 119, column: 3, scope: !762)
!781 = !DILocation(line: 119, column: 18, scope: !762)
!782 = distinct !{!782, !780, !783, !678}
!783 = !DILocation(line: 143, column: 5, scope: !762)
!784 = !DILocation(line: 130, column: 11, scope: !785)
!785 = distinct !DILexicalBlock(scope: !786, file: !3, line: 122, column: 9)
!786 = distinct !DILexicalBlock(scope: !762, file: !3, line: 120, column: 5)
!787 = !DILocation(line: 136, column: 9, scope: !785)
!788 = !DILocation(line: 138, column: 9, scope: !785)
!789 = !DILocation(line: 141, column: 11, scope: !785)
!790 = !DILocation(line: 145, column: 7, scope: !791)
!791 = distinct !DILexicalBlock(scope: !762, file: !3, line: 145, column: 7)
!792 = !{!793, !793, i64 0}
!793 = !{!"int", !638, i64 0}
!794 = !DILocation(line: 145, column: 14, scope: !791)
!795 = !DILocation(line: 145, column: 7, scope: !762)
!796 = !DILocation(line: 151, column: 17, scope: !797)
!797 = distinct !DILexicalBlock(scope: !798, file: !3, line: 151, column: 3)
!798 = distinct !DILexicalBlock(scope: !762, file: !3, line: 151, column: 3)
!799 = !DILocation(line: 151, column: 3, scope: !798)
!800 = !DILocation(line: 147, column: 20, scope: !801)
!801 = distinct !DILexicalBlock(scope: !791, file: !3, line: 146, column: 5)
!802 = !DILocation(line: 147, column: 7, scope: !801)
!803 = !DILocation(line: 148, column: 7, scope: !801)
!804 = !DILocation(line: 152, column: 31, scope: !797)
!805 = !DILocalVariable(name: "file", arg: 1, scope: !806, file: !3, line: 247, type: !45)
!806 = distinct !DISubprogram(name: "validate_file_name", scope: !3, file: !3, line: 247, type: !807, scopeLine: 249, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !809)
!807 = !DISubroutineType(types: !808)
!808 = !{!77, !45, !77, !77}
!809 = !{!805, !810, !811, !812, !813, !814, !815, !816, !855, !858, !861, !862, !865, !866, !872, !875, !876, !880, !883, !884, !885, !888, !889}
!810 = !DILocalVariable(name: "check_basic_portability", arg: 2, scope: !806, file: !3, line: 247, type: !77)
!811 = !DILocalVariable(name: "check_extra_portability", arg: 3, scope: !806, file: !3, line: 248, type: !77)
!812 = !DILocalVariable(name: "filelen", scope: !806, file: !3, line: 250, type: !117)
!813 = !DILocalVariable(name: "start", scope: !806, file: !3, line: 253, type: !45)
!814 = !DILocalVariable(name: "check_component_lengths", scope: !806, file: !3, line: 256, type: !77)
!815 = !DILocalVariable(name: "file_exists", scope: !806, file: !3, line: 259, type: !77)
!816 = !DILocalVariable(name: "st", scope: !817, file: !3, line: 287, type: !819)
!817 = distinct !DILexicalBlock(scope: !818, file: !3, line: 281, column: 5)
!818 = distinct !DILexicalBlock(scope: !806, file: !3, line: 275, column: 7)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !820, line: 26, size: 1152, elements: !821)
!820 = !DIFile(filename: "/usr/include/bits/struct_stat.h", directory: "")
!821 = !{!822, !824, !826, !828, !830, !832, !834, !835, !836, !837, !839, !841, !849, !850, !851}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !819, file: !820, line: 28, baseType: !823, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !730, line: 145, baseType: !119)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !819, file: !820, line: 33, baseType: !825, size: 64, offset: 64)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !730, line: 148, baseType: !119)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !819, file: !820, line: 41, baseType: !827, size: 64, offset: 128)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !730, line: 151, baseType: !119)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !819, file: !820, line: 42, baseType: !829, size: 32, offset: 192)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !730, line: 150, baseType: !7)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !819, file: !820, line: 44, baseType: !831, size: 32, offset: 224)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !730, line: 146, baseType: !7)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !819, file: !820, line: 45, baseType: !833, size: 32, offset: 256)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !730, line: 147, baseType: !7)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !819, file: !820, line: 47, baseType: !58, size: 32, offset: 288)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !819, file: !820, line: 49, baseType: !823, size: 64, offset: 320)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !819, file: !820, line: 54, baseType: !729, size: 64, offset: 384)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !819, file: !820, line: 58, baseType: !838, size: 64, offset: 448)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !730, line: 175, baseType: !731)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !819, file: !820, line: 60, baseType: !840, size: 64, offset: 512)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !730, line: 180, baseType: !731)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !819, file: !820, line: 71, baseType: !842, size: 128, offset: 576)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !843, line: 10, size: 128, elements: !844)
!843 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!844 = !{!845, !847}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !842, file: !843, line: 12, baseType: !846, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !730, line: 160, baseType: !731)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !842, file: !843, line: 16, baseType: !848, size: 64, offset: 64)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !730, line: 197, baseType: !731)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !819, file: !820, line: 72, baseType: !842, size: 128, offset: 704)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !819, file: !820, line: 73, baseType: !842, size: 128, offset: 832)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !819, file: !820, line: 86, baseType: !852, size: 192, offset: 960)
!852 = !DICompositeType(tag: DW_TAG_array_type, baseType: !848, size: 192, elements: !853)
!853 = !{!854}
!854 = !DISubrange(count: 3)
!855 = !DILocalVariable(name: "maxsize", scope: !856, file: !3, line: 300, type: !117)
!856 = distinct !DILexicalBlock(scope: !857, file: !3, line: 299, column: 5)
!857 = distinct !DILexicalBlock(scope: !806, file: !3, line: 297, column: 7)
!858 = !DILocalVariable(name: "size", scope: !859, file: !3, line: 306, type: !731)
!859 = distinct !DILexicalBlock(scope: !860, file: !3, line: 305, column: 9)
!860 = distinct !DILexicalBlock(scope: !856, file: !3, line: 302, column: 11)
!861 = !DILocalVariable(name: "dir", scope: !859, file: !3, line: 307, type: !55)
!862 = !DILocalVariable(name: "len", scope: !863, file: !3, line: 322, type: !119)
!863 = distinct !DILexicalBlock(scope: !864, file: !3, line: 321, column: 9)
!864 = distinct !DILexicalBlock(scope: !856, file: !3, line: 320, column: 11)
!865 = !DILocalVariable(name: "maxlen", scope: !863, file: !3, line: 323, type: !119)
!866 = !DILocalVariable(name: "length", scope: !867, file: !3, line: 340, type: !117)
!867 = distinct !DILexicalBlock(scope: !868, file: !3, line: 339, column: 9)
!868 = distinct !DILexicalBlock(scope: !869, file: !3, line: 338, column: 7)
!869 = distinct !DILexicalBlock(scope: !870, file: !3, line: 338, column: 7)
!870 = distinct !DILexicalBlock(scope: !871, file: !3, line: 337, column: 5)
!871 = distinct !DILexicalBlock(scope: !806, file: !3, line: 336, column: 7)
!872 = !DILocalVariable(name: "name_max", scope: !873, file: !3, line: 358, type: !117)
!873 = distinct !DILexicalBlock(scope: !874, file: !3, line: 353, column: 5)
!874 = distinct !DILexicalBlock(scope: !806, file: !3, line: 352, column: 7)
!875 = !DILocalVariable(name: "known_name_max", scope: !873, file: !3, line: 361, type: !117)
!876 = !DILocalVariable(name: "length", scope: !877, file: !3, line: 365, type: !117)
!877 = distinct !DILexicalBlock(scope: !878, file: !3, line: 364, column: 9)
!878 = distinct !DILexicalBlock(scope: !879, file: !3, line: 363, column: 7)
!879 = distinct !DILexicalBlock(scope: !873, file: !3, line: 363, column: 7)
!880 = !DILocalVariable(name: "len", scope: !881, file: !3, line: 371, type: !731)
!881 = distinct !DILexicalBlock(scope: !882, file: !3, line: 370, column: 13)
!882 = distinct !DILexicalBlock(scope: !877, file: !3, line: 367, column: 15)
!883 = !DILocalVariable(name: "dir", scope: !881, file: !3, line: 372, type: !55)
!884 = !DILocalVariable(name: "c", scope: !881, file: !3, line: 373, type: !46)
!885 = !DILocalVariable(name: "len", scope: !886, file: !3, line: 405, type: !119)
!886 = distinct !DILexicalBlock(scope: !887, file: !3, line: 404, column: 13)
!887 = distinct !DILexicalBlock(scope: !877, file: !3, line: 403, column: 15)
!888 = !DILocalVariable(name: "maxlen", scope: !886, file: !3, line: 406, type: !119)
!889 = !DILocalVariable(name: "c", scope: !886, file: !3, line: 407, type: !46)
!890 = !DILocation(line: 0, scope: !806, inlinedAt: !891)
!891 = distinct !DILocation(line: 152, column: 11, scope: !797)
!892 = !DILocation(line: 250, column: 20, scope: !806, inlinedAt: !891)
!893 = !DILocation(line: 261, column: 31, scope: !894, inlinedAt: !891)
!894 = distinct !DILexicalBlock(scope: !806, file: !3, line: 261, column: 7)
!895 = !DILocalVariable(name: "file", arg: 1, scope: !896, file: !3, line: 162, type: !55)
!896 = distinct !DISubprogram(name: "no_leading_hyphen", scope: !3, file: !3, line: 162, type: !897, scopeLine: 163, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !899)
!897 = !DISubroutineType(types: !898)
!898 = !{!77, !55}
!899 = !{!895, !900}
!900 = !DILocalVariable(name: "p", scope: !896, file: !3, line: 164, type: !55)
!901 = !DILocation(line: 0, scope: !896, inlinedAt: !902)
!902 = distinct !DILocation(line: 261, column: 36, scope: !894, inlinedAt: !891)
!903 = !DILocation(line: 166, column: 24, scope: !904, inlinedAt: !902)
!904 = distinct !DILexicalBlock(scope: !905, file: !3, line: 166, column: 3)
!905 = distinct !DILexicalBlock(scope: !896, file: !3, line: 166, column: 3)
!906 = !DILocation(line: 166, column: 3, scope: !905, inlinedAt: !902)
!907 = !DILocation(line: 166, column: 44, scope: !904, inlinedAt: !902)
!908 = distinct !{!908, !906, !909, !678}
!909 = !DILocation(line: 172, column: 7, scope: !905, inlinedAt: !902)
!910 = !DILocation(line: 167, column: 11, scope: !911, inlinedAt: !902)
!911 = distinct !DILexicalBlock(scope: !904, file: !3, line: 167, column: 9)
!912 = !DILocation(line: 167, column: 19, scope: !911, inlinedAt: !902)
!913 = !DILocation(line: 167, column: 22, scope: !911, inlinedAt: !902)
!914 = !{!638, !638, i64 0}
!915 = !DILocation(line: 167, column: 28, scope: !911, inlinedAt: !902)
!916 = !DILocation(line: 167, column: 9, scope: !904, inlinedAt: !902)
!917 = !DILocation(line: 169, column: 22, scope: !918, inlinedAt: !902)
!918 = distinct !DILexicalBlock(scope: !911, file: !3, line: 168, column: 7)
!919 = !DILocation(line: 170, column: 16, scope: !918, inlinedAt: !902)
!920 = !DILocation(line: 169, column: 9, scope: !918, inlinedAt: !902)
!921 = !DILocation(line: 261, column: 7, scope: !806, inlinedAt: !891)
!922 = !DILocation(line: 264, column: 32, scope: !923, inlinedAt: !891)
!923 = distinct !DILexicalBlock(scope: !806, file: !3, line: 264, column: 7)
!924 = !DILocation(line: 271, column: 20, scope: !925, inlinedAt: !891)
!925 = distinct !DILexicalBlock(scope: !923, file: !3, line: 266, column: 5)
!926 = !DILocation(line: 271, column: 7, scope: !925, inlinedAt: !891)
!927 = !DILocation(line: 272, column: 7, scope: !925, inlinedAt: !891)
!928 = !DILocation(line: 275, column: 7, scope: !806, inlinedAt: !891)
!929 = !DILocalVariable(name: "file", arg: 1, scope: !930, file: !3, line: 181, type: !55)
!930 = distinct !DISubprogram(name: "portable_chars_only", scope: !3, file: !3, line: 181, type: !931, scopeLine: 182, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !933)
!931 = !DISubroutineType(types: !932)
!932 = !{!77, !55, !117}
!933 = !{!929, !934, !935, !936, !937, !950}
!934 = !DILocalVariable(name: "filelen", arg: 2, scope: !930, file: !3, line: 181, type: !117)
!935 = !DILocalVariable(name: "validlen", scope: !930, file: !3, line: 183, type: !117)
!936 = !DILocalVariable(name: "invalid", scope: !930, file: !3, line: 188, type: !55)
!937 = !DILocalVariable(name: "mbstate", scope: !938, file: !3, line: 192, type: !940)
!938 = distinct !DILexicalBlock(scope: !939, file: !3, line: 191, column: 5)
!939 = distinct !DILexicalBlock(scope: !930, file: !3, line: 190, column: 7)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !176, line: 6, baseType: !941)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !178, line: 21, baseType: !942)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !178, line: 13, size: 64, elements: !943)
!943 = !{!944, !945}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !942, file: !178, line: 15, baseType: !58, size: 32)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !942, file: !178, line: 20, baseType: !946, size: 32, offset: 32)
!946 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !942, file: !178, line: 16, size: 32, elements: !947)
!947 = !{!948, !949}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !946, file: !178, line: 18, baseType: !7, size: 32)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !946, file: !178, line: 19, baseType: !187, size: 32)
!950 = !DILocalVariable(name: "charlen", scope: !938, file: !3, line: 193, type: !117)
!951 = !DILocation(line: 0, scope: !930, inlinedAt: !952)
!952 = distinct !DILocation(line: 277, column: 13, scope: !953, inlinedAt: !891)
!953 = distinct !DILexicalBlock(scope: !954, file: !3, line: 277, column: 11)
!954 = distinct !DILexicalBlock(scope: !818, file: !3, line: 276, column: 5)
!955 = !DILocation(line: 183, column: 21, scope: !930, inlinedAt: !952)
!956 = !DILocation(line: 188, column: 30, scope: !930, inlinedAt: !952)
!957 = !DILocation(line: 190, column: 7, scope: !939, inlinedAt: !952)
!958 = !DILocation(line: 190, column: 7, scope: !930, inlinedAt: !952)
!959 = !DILocation(line: 192, column: 7, scope: !938, inlinedAt: !952)
!960 = !DILocation(line: 192, column: 17, scope: !938, inlinedAt: !952)
!961 = !DILocation(line: 193, column: 49, scope: !938, inlinedAt: !952)
!962 = !DILocation(line: 193, column: 24, scope: !938, inlinedAt: !952)
!963 = !DILocation(line: 0, scope: !938, inlinedAt: !952)
!964 = !DILocation(line: 195, column: 14, scope: !938, inlinedAt: !952)
!965 = !DILocation(line: 197, column: 45, scope: !938, inlinedAt: !952)
!966 = !DILocation(line: 197, column: 37, scope: !938, inlinedAt: !952)
!967 = !DILocation(line: 196, column: 14, scope: !938, inlinedAt: !952)
!968 = !DILocation(line: 198, column: 14, scope: !938, inlinedAt: !952)
!969 = !DILocation(line: 194, column: 7, scope: !938, inlinedAt: !952)
!970 = !DILocation(line: 200, column: 5, scope: !939, inlinedAt: !952)
!971 = !DILocation(line: 277, column: 11, scope: !954, inlinedAt: !891)
!972 = !DILocation(line: 287, column: 7, scope: !817, inlinedAt: !891)
!973 = !DILocation(line: 287, column: 19, scope: !817, inlinedAt: !891)
!974 = !DILocation(line: 288, column: 11, scope: !975, inlinedAt: !891)
!975 = distinct !DILexicalBlock(scope: !817, file: !3, line: 288, column: 11)
!976 = !DILocation(line: 288, column: 29, scope: !975, inlinedAt: !891)
!977 = !DILocation(line: 288, column: 11, scope: !817, inlinedAt: !891)
!978 = !DILocation(line: 295, column: 5, scope: !818, inlinedAt: !891)
!979 = !DILocation(line: 352, column: 7, scope: !806, inlinedAt: !891)
!980 = !DILocation(line: 290, column: 16, scope: !981, inlinedAt: !891)
!981 = distinct !DILexicalBlock(scope: !975, file: !3, line: 290, column: 16)
!982 = !DILocation(line: 290, column: 22, scope: !981, inlinedAt: !891)
!983 = !DILocation(line: 290, column: 32, scope: !981, inlinedAt: !891)
!984 = !DILocation(line: 292, column: 34, scope: !985, inlinedAt: !891)
!985 = distinct !DILexicalBlock(scope: !981, file: !3, line: 291, column: 9)
!986 = !DILocation(line: 292, column: 11, scope: !985, inlinedAt: !891)
!987 = !DILocation(line: 298, column: 25, scope: !857, inlinedAt: !891)
!988 = !DILocation(line: 307, column: 30, scope: !859, inlinedAt: !891)
!989 = !DILocation(line: 307, column: 36, scope: !859, inlinedAt: !891)
!990 = !DILocation(line: 0, scope: !859, inlinedAt: !891)
!991 = !DILocation(line: 308, column: 17, scope: !859, inlinedAt: !891)
!992 = !DILocation(line: 309, column: 18, scope: !859, inlinedAt: !891)
!993 = !DILocation(line: 310, column: 20, scope: !994, inlinedAt: !891)
!994 = distinct !DILexicalBlock(scope: !859, file: !3, line: 310, column: 15)
!995 = !DILocation(line: 310, column: 24, scope: !994, inlinedAt: !891)
!996 = !DILocation(line: 310, column: 27, scope: !994, inlinedAt: !891)
!997 = !DILocation(line: 310, column: 33, scope: !994, inlinedAt: !891)
!998 = !DILocation(line: 310, column: 15, scope: !859, inlinedAt: !891)
!999 = !DILocation(line: 313, column: 22, scope: !1000, inlinedAt: !891)
!1000 = distinct !DILexicalBlock(scope: !994, file: !3, line: 311, column: 13)
!1001 = !DILocation(line: 312, column: 15, scope: !1000, inlinedAt: !891)
!1002 = !DILocation(line: 0, scope: !856, inlinedAt: !891)
!1003 = !DILocation(line: 320, column: 19, scope: !864, inlinedAt: !891)
!1004 = !DILocation(line: 320, column: 11, scope: !856, inlinedAt: !891)
!1005 = !DILocation(line: 210, column: 3, scope: !1006, inlinedAt: !1011)
!1006 = distinct !DISubprogram(name: "component_start", scope: !3, file: !3, line: 208, type: !1007, scopeLine: 209, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1009)
!1007 = !DISubroutineType(types: !1008)
!1008 = !{!45, !45}
!1009 = !{!1010}
!1010 = !DILocalVariable(name: "f", arg: 1, scope: !1006, file: !3, line: 208, type: !45)
!1011 = distinct !DILocation(line: 338, column: 36, scope: !868, inlinedAt: !891)
!1012 = !DILocation(line: 0, scope: !863, inlinedAt: !891)
!1013 = !DILocation(line: 323, column: 46, scope: !863, inlinedAt: !891)
!1014 = !DILocation(line: 324, column: 24, scope: !863, inlinedAt: !891)
!1015 = !DILocation(line: 325, column: 31, scope: !863, inlinedAt: !891)
!1016 = !DILocation(line: 324, column: 11, scope: !863, inlinedAt: !891)
!1017 = !DILocation(line: 0, scope: !1006, inlinedAt: !1011)
!1018 = !DILocation(line: 210, column: 10, scope: !1006, inlinedAt: !1011)
!1019 = !DILocation(line: 211, column: 6, scope: !1006, inlinedAt: !1011)
!1020 = distinct !{!1020, !1021, !1022, !678}
!1021 = !DILocation(line: 338, column: 7, scope: !869, inlinedAt: !891)
!1022 = !DILocation(line: 349, column: 9, scope: !869, inlinedAt: !891)
!1023 = !DILocation(line: 0, scope: !1024, inlinedAt: !1031)
!1024 = distinct !DILexicalBlock(scope: !1025, file: !3, line: 221, column: 3)
!1025 = distinct !DISubprogram(name: "component_len", scope: !3, file: !3, line: 218, type: !1026, scopeLine: 219, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1028)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!117, !55}
!1028 = !{!1029, !1030}
!1029 = !DILocalVariable(name: "f", arg: 1, scope: !1025, file: !3, line: 218, type: !55)
!1030 = !DILocalVariable(name: "len", scope: !1025, file: !3, line: 220, type: !117)
!1031 = distinct !DILocation(line: 340, column: 27, scope: !867, inlinedAt: !891)
!1032 = !DILocation(line: 0, scope: !1025, inlinedAt: !1031)
!1033 = !DILocation(line: 221, column: 17, scope: !1034, inlinedAt: !1031)
!1034 = distinct !DILexicalBlock(scope: !1024, file: !3, line: 221, column: 3)
!1035 = !DILocation(line: 221, column: 31, scope: !1034, inlinedAt: !1031)
!1036 = !DILocation(line: 221, column: 45, scope: !1034, inlinedAt: !1031)
!1037 = !DILocation(line: 221, column: 3, scope: !1034, inlinedAt: !1031)
!1038 = distinct !{!1038, !1039, !1040, !678}
!1039 = !DILocation(line: 221, column: 3, scope: !1024, inlinedAt: !1031)
!1040 = !DILocation(line: 222, column: 5, scope: !1024, inlinedAt: !1031)
!1041 = !DILocation(line: 0, scope: !867, inlinedAt: !891)
!1042 = !DILocation(line: 342, column: 32, scope: !1043, inlinedAt: !891)
!1043 = distinct !DILexicalBlock(scope: !867, file: !3, line: 342, column: 15)
!1044 = !DILocation(line: 210, column: 3, scope: !1006, inlinedAt: !1045)
!1045 = distinct !DILocation(line: 363, column: 36, scope: !878, inlinedAt: !891)
!1046 = !DILocation(line: 361, column: 14, scope: !873, inlinedAt: !891)
!1047 = !DILocation(line: 0, scope: !873, inlinedAt: !891)
!1048 = !DILocation(line: 0, scope: !879, inlinedAt: !891)
!1049 = !DILocation(line: 0, scope: !1006, inlinedAt: !1045)
!1050 = !DILocation(line: 210, column: 10, scope: !1006, inlinedAt: !1045)
!1051 = !DILocation(line: 211, column: 6, scope: !1006, inlinedAt: !1045)
!1052 = !DILocation(line: 367, column: 15, scope: !882, inlinedAt: !891)
!1053 = !DILocation(line: 367, column: 15, scope: !877, inlinedAt: !891)
!1054 = !DILocation(line: 372, column: 40, scope: !881, inlinedAt: !891)
!1055 = !DILocation(line: 372, column: 34, scope: !881, inlinedAt: !891)
!1056 = !DILocation(line: 0, scope: !881, inlinedAt: !891)
!1057 = !DILocation(line: 374, column: 15, scope: !881, inlinedAt: !891)
!1058 = !DILocation(line: 374, column: 21, scope: !881, inlinedAt: !891)
!1059 = !DILocation(line: 375, column: 22, scope: !881, inlinedAt: !891)
!1060 = !DILocation(line: 376, column: 21, scope: !881, inlinedAt: !891)
!1061 = !DILocation(line: 377, column: 22, scope: !881, inlinedAt: !891)
!1062 = !DILocation(line: 378, column: 21, scope: !1063, inlinedAt: !891)
!1063 = distinct !DILexicalBlock(scope: !881, file: !3, line: 378, column: 19)
!1064 = !DILocation(line: 378, column: 19, scope: !881, inlinedAt: !891)
!1065 = !DILocation(line: 381, column: 25, scope: !1063, inlinedAt: !891)
!1066 = !DILocation(line: 381, column: 17, scope: !1063, inlinedAt: !891)
!1067 = !DILocation(line: 391, column: 21, scope: !1068, inlinedAt: !891)
!1068 = distinct !DILexicalBlock(scope: !1063, file: !3, line: 382, column: 19)
!1069 = !DILocation(line: 394, column: 28, scope: !1068, inlinedAt: !891)
!1070 = !DILocation(line: 395, column: 31, scope: !1068, inlinedAt: !891)
!1071 = !DILocation(line: 395, column: 44, scope: !1068, inlinedAt: !891)
!1072 = !DILocation(line: 395, column: 21, scope: !1068, inlinedAt: !891)
!1073 = !DILocation(line: 396, column: 28, scope: !1068, inlinedAt: !891)
!1074 = !DILocation(line: 0, scope: !882, inlinedAt: !891)
!1075 = !DILocation(line: 0, scope: !1025, inlinedAt: !1076)
!1076 = distinct !DILocation(line: 401, column: 20, scope: !877, inlinedAt: !891)
!1077 = !DILocation(line: 221, column: 8, scope: !1024, inlinedAt: !1076)
!1078 = !DILocation(line: 0, scope: !1024, inlinedAt: !1076)
!1079 = !DILocation(line: 221, column: 17, scope: !1034, inlinedAt: !1076)
!1080 = !DILocation(line: 221, column: 31, scope: !1034, inlinedAt: !1076)
!1081 = !DILocation(line: 221, column: 45, scope: !1034, inlinedAt: !1076)
!1082 = !DILocation(line: 221, column: 3, scope: !1034, inlinedAt: !1076)
!1083 = distinct !{!1083, !1084, !1085, !678}
!1084 = !DILocation(line: 221, column: 3, scope: !1024, inlinedAt: !1076)
!1085 = !DILocation(line: 222, column: 5, scope: !1024, inlinedAt: !1076)
!1086 = !DILocation(line: 0, scope: !877, inlinedAt: !891)
!1087 = !DILocation(line: 403, column: 24, scope: !887, inlinedAt: !891)
!1088 = !DILocation(line: 403, column: 15, scope: !877, inlinedAt: !891)
!1089 = !DILocation(line: 0, scope: !886, inlinedAt: !891)
!1090 = !DILocation(line: 408, column: 26, scope: !886, inlinedAt: !891)
!1091 = !DILocation(line: 410, column: 22, scope: !886, inlinedAt: !891)
!1092 = !DILocation(line: 412, column: 35, scope: !886, inlinedAt: !891)
!1093 = !DILocation(line: 409, column: 15, scope: !886, inlinedAt: !891)
!1094 = !DILocation(line: 413, column: 26, scope: !886, inlinedAt: !891)
!1095 = !DILocation(line: 152, column: 8, scope: !797)
!1096 = !DILocation(line: 151, column: 25, scope: !797)
!1097 = distinct !{!1097, !799, !1098, !678}
!1098 = !DILocation(line: 153, column: 79, scope: !798)
!1099 = !DILocation(line: 155, column: 10, scope: !762)
!1100 = !DILocation(line: 156, column: 1, scope: !762)
!1101 = !DISubprogram(name: "bindtextdomain", scope: !699, file: !699, line: 86, type: !1102, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!1102 = !DISubroutineType(types: !1103)
!1103 = !{!45, !55, !55}
!1104 = !DISubprogram(name: "textdomain", scope: !699, file: !699, line: 82, type: !1105, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!1105 = !DISubroutineType(types: !1106)
!1106 = !{!45, !55}
!1107 = !DISubprogram(name: "atexit", scope: !1108, file: !1108, line: 595, type: !1109, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!1108 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!1109 = !DISubroutineType(types: !1110)
!1110 = !{!58, !1111}
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64)
!1112 = !DISubroutineType(types: !1113)
!1113 = !{null}
!1114 = !DISubprogram(name: "getopt_long", scope: !52, file: !52, line: 66, type: !1115, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!1115 = !DISubroutineType(types: !1116)
!1116 = !{!58, !58, !1117, !55, !1119, !60}
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64)
!1118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!1120 = !DISubprogram(name: "error", scope: !1121, file: !1121, line: 52, type: !1122, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!1121 = !DIFile(filename: "./lib/error.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1122 = !DISubroutineType(types: !1123)
!1123 = !{null, !58, !58, !55, null}
!1124 = !DISubprogram(name: "lstat", scope: !1125, file: !1125, line: 259, type: !1126, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!1125 = !DIFile(filename: "/usr/include/sys/stat.h", directory: "")
!1126 = !DISubroutineType(types: !1127)
!1127 = !{!58, !55, !1128}
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!1129 = !DISubprogram(name: "pathconf", scope: !1130, file: !1130, line: 623, type: !1131, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !68)
!1130 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!1131 = !DISubroutineType(types: !1132)
!1132 = !{!731, !55, !58}
!1133 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !73, file: !73, line: 51, type: !648, scopeLine: 52, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !72, retainedNodes: !1134)
!1134 = !{!1135}
!1135 = !DILocalVariable(name: "file", arg: 1, scope: !1133, file: !73, line: 51, type: !55)
!1136 = !DILocation(line: 0, scope: !1133)
!1137 = !DILocation(line: 53, column: 13, scope: !1133)
!1138 = !DILocation(line: 54, column: 1, scope: !1133)
!1139 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !73, file: !73, line: 88, type: !1140, scopeLine: 89, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !72, retainedNodes: !1142)
!1140 = !DISubroutineType(types: !1141)
!1141 = !{null, !77}
!1142 = !{!1143}
!1143 = !DILocalVariable(name: "ignore", arg: 1, scope: !1139, file: !73, line: 88, type: !77)
!1144 = !DILocation(line: 0, scope: !1139)
!1145 = !DILocation(line: 90, column: 16, scope: !1139)
!1146 = !{!1147, !1147, i64 0}
!1147 = !{!"_Bool", !638, i64 0}
!1148 = !DILocation(line: 91, column: 1, scope: !1139)
!1149 = distinct !DISubprogram(name: "close_stdout", scope: !73, file: !73, line: 117, type: !1112, scopeLine: 118, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !72, retainedNodes: !1150)
!1150 = !{!1151}
!1151 = !DILocalVariable(name: "write_error", scope: !1152, file: !73, line: 122, type: !55)
!1152 = distinct !DILexicalBlock(scope: !1153, file: !73, line: 121, column: 5)
!1153 = distinct !DILexicalBlock(scope: !1149, file: !73, line: 119, column: 7)
!1154 = !DILocation(line: 119, column: 21, scope: !1153)
!1155 = !DILocation(line: 119, column: 7, scope: !1153)
!1156 = !DILocation(line: 119, column: 29, scope: !1153)
!1157 = !DILocation(line: 120, column: 7, scope: !1153)
!1158 = !DILocation(line: 120, column: 12, scope: !1153)
!1159 = !{i8 0, i8 2}
!1160 = !DILocation(line: 120, column: 25, scope: !1153)
!1161 = !DILocation(line: 120, column: 28, scope: !1153)
!1162 = !DILocation(line: 120, column: 34, scope: !1153)
!1163 = !DILocation(line: 119, column: 7, scope: !1149)
!1164 = !DILocation(line: 122, column: 33, scope: !1152)
!1165 = !DILocation(line: 0, scope: !1152)
