; ModuleID = 'coreutils-8.32/src/pathchk.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [31 x i8] c"Usage: %s [OPTION]... NAME...\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 73, type: !196, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !44, globals: !195, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/pathchk.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !20}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!9 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 24, baseType: !7, size: 32, elements: !22)
!21 = !DIFile(filename: "/usr/include/bits/confname.h", directory: "")
!22 = !{!23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43}
!23 = !DIEnumerator(name: "_PC_LINK_MAX", value: 0, isUnsigned: true)
!24 = !DIEnumerator(name: "_PC_MAX_CANON", value: 1, isUnsigned: true)
!25 = !DIEnumerator(name: "_PC_MAX_INPUT", value: 2, isUnsigned: true)
!26 = !DIEnumerator(name: "_PC_NAME_MAX", value: 3, isUnsigned: true)
!27 = !DIEnumerator(name: "_PC_PATH_MAX", value: 4, isUnsigned: true)
!28 = !DIEnumerator(name: "_PC_PIPE_BUF", value: 5, isUnsigned: true)
!29 = !DIEnumerator(name: "_PC_CHOWN_RESTRICTED", value: 6, isUnsigned: true)
!30 = !DIEnumerator(name: "_PC_NO_TRUNC", value: 7, isUnsigned: true)
!31 = !DIEnumerator(name: "_PC_VDISABLE", value: 8, isUnsigned: true)
!32 = !DIEnumerator(name: "_PC_SYNC_IO", value: 9, isUnsigned: true)
!33 = !DIEnumerator(name: "_PC_ASYNC_IO", value: 10, isUnsigned: true)
!34 = !DIEnumerator(name: "_PC_PRIO_IO", value: 11, isUnsigned: true)
!35 = !DIEnumerator(name: "_PC_SOCK_MAXBUF", value: 12, isUnsigned: true)
!36 = !DIEnumerator(name: "_PC_FILESIZEBITS", value: 13, isUnsigned: true)
!37 = !DIEnumerator(name: "_PC_REC_INCR_XFER_SIZE", value: 14, isUnsigned: true)
!38 = !DIEnumerator(name: "_PC_REC_MAX_XFER_SIZE", value: 15, isUnsigned: true)
!39 = !DIEnumerator(name: "_PC_REC_MIN_XFER_SIZE", value: 16, isUnsigned: true)
!40 = !DIEnumerator(name: "_PC_REC_XFER_ALIGN", value: 17, isUnsigned: true)
!41 = !DIEnumerator(name: "_PC_ALLOC_SIZE_MIN", value: 18, isUnsigned: true)
!42 = !DIEnumerator(name: "_PC_SYMLINK_MAX", value: 19, isUnsigned: true)
!43 = !DIEnumerator(name: "_PC_2_SYMLINKS", value: 20, isUnsigned: true)
!44 = !{!45, !55, !116, !120, !124, !127, !130, !137, !49, !106, !152, !156, !160, !163, !167, !170, !174, !191, !194}
!45 = !DISubprogram(name: "dcgettext", scope: !46, file: !46, line: 51, type: !47, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!46 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!47 = !DISubroutineType(types: !48)
!48 = !{!49, !51, !51, !53}
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!53 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!54 = !{}
!55 = !DISubprogram(name: "fputs_unlocked", scope: !56, file: !56, line: 662, type: !57, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!56 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!57 = !DISubroutineType(types: !58)
!58 = !{!53, !51, !59}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !61, line: 49, size: 1728, elements: !62)
!61 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!62 = !{!63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !78, !79, !80, !81, !85, !87, !89, !93, !96, !98, !101, !104, !105, !107, !111, !112}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !60, file: !61, line: 51, baseType: !53, size: 32)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !60, file: !61, line: 54, baseType: !49, size: 64, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !60, file: !61, line: 55, baseType: !49, size: 64, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !60, file: !61, line: 56, baseType: !49, size: 64, offset: 192)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !60, file: !61, line: 57, baseType: !49, size: 64, offset: 256)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !60, file: !61, line: 58, baseType: !49, size: 64, offset: 320)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !60, file: !61, line: 59, baseType: !49, size: 64, offset: 384)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !60, file: !61, line: 60, baseType: !49, size: 64, offset: 448)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !60, file: !61, line: 61, baseType: !49, size: 64, offset: 512)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !60, file: !61, line: 64, baseType: !49, size: 64, offset: 576)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !60, file: !61, line: 65, baseType: !49, size: 64, offset: 640)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !60, file: !61, line: 66, baseType: !49, size: 64, offset: 704)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !60, file: !61, line: 68, baseType: !76, size: 64, offset: 768)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !61, line: 36, flags: DIFlagFwdDecl)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !60, file: !61, line: 70, baseType: !59, size: 64, offset: 832)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !60, file: !61, line: 72, baseType: !53, size: 32, offset: 896)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !60, file: !61, line: 73, baseType: !53, size: 32, offset: 928)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !60, file: !61, line: 74, baseType: !82, size: 64, offset: 960)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !83, line: 152, baseType: !84)
!83 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!84 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !60, file: !61, line: 77, baseType: !86, size: 16, offset: 1024)
!86 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !60, file: !61, line: 78, baseType: !88, size: 8, offset: 1040)
!88 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !60, file: !61, line: 79, baseType: !90, size: 8, offset: 1048)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 8, elements: !91)
!91 = !{!92}
!92 = !DISubrange(count: 1)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !60, file: !61, line: 81, baseType: !94, size: 64, offset: 1088)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !61, line: 43, baseType: null)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !60, file: !61, line: 89, baseType: !97, size: 64, offset: 1152)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !83, line: 153, baseType: !84)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !60, file: !61, line: 91, baseType: !99, size: 64, offset: 1216)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !61, line: 37, flags: DIFlagFwdDecl)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !60, file: !61, line: 92, baseType: !102, size: 64, offset: 1280)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !61, line: 38, flags: DIFlagFwdDecl)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !60, file: !61, line: 93, baseType: !59, size: 64, offset: 1344)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !60, file: !61, line: 94, baseType: !106, size: 64, offset: 1408)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !60, file: !61, line: 95, baseType: !108, size: 64, offset: 1472)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !109, line: 46, baseType: !110)
!109 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!110 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !60, file: !61, line: 96, baseType: !53, size: 32, offset: 1536)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !60, file: !61, line: 98, baseType: !113, size: 160, offset: 1568)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 160, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 20)
!116 = !DISubprogram(name: "set_program_name", scope: !117, file: !117, line: 37, type: !118, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!117 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!118 = !DISubroutineType(types: !119)
!119 = !{null, !51}
!120 = !DISubprogram(name: "setlocale", scope: !121, file: !121, line: 122, type: !122, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!121 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!122 = !DISubroutineType(types: !123)
!123 = !{!49, !53, !51}
!124 = !DISubprogram(name: "bindtextdomain", scope: !46, file: !46, line: 86, type: !125, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!125 = !DISubroutineType(types: !126)
!126 = !{!49, !51, !51}
!127 = !DISubprogram(name: "textdomain", scope: !46, file: !46, line: 82, type: !128, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!128 = !DISubroutineType(types: !129)
!129 = !{!49, !51}
!130 = !DISubprogram(name: "atexit", scope: !131, file: !131, line: 595, type: !132, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!131 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!132 = !DISubroutineType(types: !133)
!133 = !{!53, !134}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{null}
!137 = !DISubprogram(name: "getopt_long", scope: !138, file: !138, line: 66, type: !139, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!138 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!139 = !DISubroutineType(types: !140)
!140 = !{!53, !53, !141, !51, !143, !150}
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !145)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !138, line: 50, size: 256, elements: !146)
!146 = !{!147, !148, !149, !151}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !145, file: !138, line: 52, baseType: !51, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !145, file: !138, line: 55, baseType: !53, size: 32, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !145, file: !138, line: 56, baseType: !150, size: 64, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !145, file: !138, line: 57, baseType: !53, size: 32, offset: 192)
!152 = !DISubprogram(name: "version_etc", scope: !153, file: !153, line: 69, type: !154, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!153 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!154 = !DISubroutineType(types: !155)
!155 = !{null, !59, !51, !51, !51, null}
!156 = !DISubprogram(name: "error", scope: !157, file: !157, line: 52, type: !158, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!157 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!158 = !DISubroutineType(types: !159)
!159 = !{null, !53, !53, !51, null}
!160 = !DISubprogram(name: "quotearg_n_style_colon", scope: !6, file: !6, line: 397, type: !161, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!161 = !DISubroutineType(types: !162)
!162 = !{!49, !53, !5, !51}
!163 = !DISubprogram(name: "pathconf", scope: !164, file: !164, line: 612, type: !165, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!164 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!165 = !DISubroutineType(types: !166)
!166 = !{!84, !51, !53}
!167 = !DISubprogram(name: "quotearg_style", scope: !6, file: !6, line: 377, type: !168, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!168 = !DISubroutineType(types: !169)
!169 = !{!49, !5, !51}
!170 = !DISubprogram(name: "quote", scope: !171, file: !171, line: 44, type: !172, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!171 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!172 = !DISubroutineType(types: !173)
!173 = !{!51, !51}
!174 = !DISubprogram(name: "rpl_mbrlen", scope: !175, file: !175, line: 752, type: !176, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!175 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!176 = !DISubroutineType(types: !177)
!177 = !{!110, !51, !110, !178}
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !180, line: 13, size: 64, elements: !181)
!180 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!181 = !{!182, !183}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !179, file: !180, line: 15, baseType: !53, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !179, file: !180, line: 20, baseType: !184, size: 32, offset: 32)
!184 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !179, file: !180, line: 16, size: 32, elements: !185)
!185 = !{!186, !187}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !184, file: !180, line: 18, baseType: !7, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !184, file: !180, line: 19, baseType: !188, size: 32)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 32, elements: !189)
!189 = !{!190}
!190 = !DISubrange(count: 4)
!191 = !DISubprogram(name: "quotearg_n_style_mem", scope: !6, file: !6, line: 373, type: !192, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!192 = !DISubroutineType(types: !193)
!193 = !{!49, !53, !5, !51, !110}
!194 = !DISubprogram(name: "quotearg_n_style", scope: !6, file: !6, line: 368, type: !161, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!195 = !{!0}
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 1024, elements: !189)
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(name: "Version", scope: !199, file: !200, line: 2, type: !51, isLocal: false, isDefinition: true)
!199 = distinct !DICompileUnit(language: DW_LANG_C99, file: !200, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !54, globals: !201, splitDebugInlining: false, nameTableKind: None)
!200 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!201 = !{!197}
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(name: "file_name", scope: !204, file: !205, line: 46, type: !51, isLocal: true, isDefinition: true)
!204 = distinct !DICompileUnit(language: DW_LANG_C99, file: !205, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !54, retainedTypes: !206, globals: !244, splitDebugInlining: false, nameTableKind: None)
!205 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!206 = !{!207, !45, !243, !156}
!207 = !DISubprogram(name: "close_stream", scope: !208, file: !208, line: 2, type: !209, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!208 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!209 = !DISubroutineType(types: !210)
!210 = !{!53, !211}
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !61, line: 49, size: 1728, elements: !213)
!213 = !{!214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !212, file: !61, line: 51, baseType: !53, size: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !212, file: !61, line: 54, baseType: !49, size: 64, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !212, file: !61, line: 55, baseType: !49, size: 64, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !212, file: !61, line: 56, baseType: !49, size: 64, offset: 192)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !212, file: !61, line: 57, baseType: !49, size: 64, offset: 256)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !212, file: !61, line: 58, baseType: !49, size: 64, offset: 320)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !212, file: !61, line: 59, baseType: !49, size: 64, offset: 384)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !212, file: !61, line: 60, baseType: !49, size: 64, offset: 448)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !212, file: !61, line: 61, baseType: !49, size: 64, offset: 512)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !212, file: !61, line: 64, baseType: !49, size: 64, offset: 576)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !212, file: !61, line: 65, baseType: !49, size: 64, offset: 640)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !212, file: !61, line: 66, baseType: !49, size: 64, offset: 704)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !212, file: !61, line: 68, baseType: !76, size: 64, offset: 768)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !212, file: !61, line: 70, baseType: !211, size: 64, offset: 832)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !212, file: !61, line: 72, baseType: !53, size: 32, offset: 896)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !212, file: !61, line: 73, baseType: !53, size: 32, offset: 928)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !212, file: !61, line: 74, baseType: !82, size: 64, offset: 960)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !212, file: !61, line: 77, baseType: !86, size: 16, offset: 1024)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !212, file: !61, line: 78, baseType: !88, size: 8, offset: 1040)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !212, file: !61, line: 79, baseType: !90, size: 8, offset: 1048)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !212, file: !61, line: 81, baseType: !94, size: 64, offset: 1088)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !212, file: !61, line: 89, baseType: !97, size: 64, offset: 1152)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !212, file: !61, line: 91, baseType: !99, size: 64, offset: 1216)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !212, file: !61, line: 92, baseType: !102, size: 64, offset: 1280)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !212, file: !61, line: 93, baseType: !211, size: 64, offset: 1344)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !212, file: !61, line: 94, baseType: !106, size: 64, offset: 1408)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !212, file: !61, line: 95, baseType: !108, size: 64, offset: 1472)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !212, file: !61, line: 96, baseType: !53, size: 32, offset: 1536)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !212, file: !61, line: 98, baseType: !113, size: 160, offset: 1568)
!243 = !DISubprogram(name: "quotearg_colon", scope: !6, file: !6, line: 391, type: !128, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!244 = !{!202, !245}
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !204, file: !205, line: 56, type: !247, isLocal: true, isDefinition: true)
!247 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(name: "exit_failure", scope: !250, file: !251, line: 24, type: !253, isLocal: false, isDefinition: true)
!250 = distinct !DICompileUnit(language: DW_LANG_C99, file: !251, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !54, globals: !252, splitDebugInlining: false, nameTableKind: None)
!251 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!252 = !{!248}
!253 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !53)
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(name: "program_name", scope: !256, file: !257, line: 33, type: !51, isLocal: false, isDefinition: true)
!256 = distinct !DICompileUnit(language: DW_LANG_C99, file: !257, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !54, retainedTypes: !258, globals: !294, splitDebugInlining: false, nameTableKind: None)
!257 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!258 = !{!106, !259, !49}
!259 = !DISubprogram(name: "fputs", scope: !56, file: !56, line: 626, type: !260, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!260 = !DISubroutineType(types: !261)
!261 = !{!53, !51, !262}
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !61, line: 49, size: 1728, elements: !264)
!264 = !{!265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !263, file: !61, line: 51, baseType: !53, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !263, file: !61, line: 54, baseType: !49, size: 64, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !263, file: !61, line: 55, baseType: !49, size: 64, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !263, file: !61, line: 56, baseType: !49, size: 64, offset: 192)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !263, file: !61, line: 57, baseType: !49, size: 64, offset: 256)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !263, file: !61, line: 58, baseType: !49, size: 64, offset: 320)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !263, file: !61, line: 59, baseType: !49, size: 64, offset: 384)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !263, file: !61, line: 60, baseType: !49, size: 64, offset: 448)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !263, file: !61, line: 61, baseType: !49, size: 64, offset: 512)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !263, file: !61, line: 64, baseType: !49, size: 64, offset: 576)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !263, file: !61, line: 65, baseType: !49, size: 64, offset: 640)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !263, file: !61, line: 66, baseType: !49, size: 64, offset: 704)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !263, file: !61, line: 68, baseType: !76, size: 64, offset: 768)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !263, file: !61, line: 70, baseType: !262, size: 64, offset: 832)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !263, file: !61, line: 72, baseType: !53, size: 32, offset: 896)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !263, file: !61, line: 73, baseType: !53, size: 32, offset: 928)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !263, file: !61, line: 74, baseType: !82, size: 64, offset: 960)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !263, file: !61, line: 77, baseType: !86, size: 16, offset: 1024)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !263, file: !61, line: 78, baseType: !88, size: 8, offset: 1040)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !263, file: !61, line: 79, baseType: !90, size: 8, offset: 1048)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !263, file: !61, line: 81, baseType: !94, size: 64, offset: 1088)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !263, file: !61, line: 89, baseType: !97, size: 64, offset: 1152)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !263, file: !61, line: 91, baseType: !99, size: 64, offset: 1216)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !263, file: !61, line: 92, baseType: !102, size: 64, offset: 1280)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !263, file: !61, line: 93, baseType: !262, size: 64, offset: 1344)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !263, file: !61, line: 94, baseType: !106, size: 64, offset: 1408)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !263, file: !61, line: 95, baseType: !108, size: 64, offset: 1472)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !263, file: !61, line: 96, baseType: !53, size: 32, offset: 1536)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !263, file: !61, line: 98, baseType: !113, size: 160, offset: 1568)
!294 = !{!254}
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !297, file: !298, line: 85, type: !413, isLocal: false, isDefinition: true)
!297 = distinct !DICompileUnit(language: DW_LANG_C99, file: !298, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !299, retainedTypes: !320, globals: !386, splitDebugInlining: false, nameTableKind: None)
!298 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!299 = !{!5, !300, !305}
!300 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, baseType: !7, size: 32, elements: !301)
!301 = !{!302, !303, !304}
!302 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!303 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!304 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!305 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !306, line: 46, baseType: !7, size: 32, elements: !307)
!306 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!307 = !{!308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319}
!308 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!309 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!310 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!311 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!312 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!313 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!314 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!315 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!316 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!317 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!318 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!319 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!320 = !{!321, !327, !343, !346, !53, !86, !349, !108, !361, !365, !45, !371, !375, !49, !379, !382, !383}
!321 = !DISubprogram(name: "xmemdup", scope: !322, file: !322, line: 62, type: !323, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!322 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!323 = !DISubroutineType(types: !324)
!324 = !{!106, !325, !110}
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!327 = !DISubprogram(name: "quotearg_alloc_mem", scope: !6, file: !6, line: 342, type: !328, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!328 = !DISubroutineType(types: !329)
!329 = !{!49, !51, !110, !330, !331}
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !333)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !298, line: 65, size: 448, elements: !334)
!334 = !{!335, !336, !337, !341, !342}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !333, file: !298, line: 68, baseType: !5, size: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !333, file: !298, line: 71, baseType: !53, size: 32, offset: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !333, file: !298, line: 75, baseType: !338, size: 256, offset: 64)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !339)
!339 = !{!340}
!340 = !DISubrange(count: 8)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !333, file: !298, line: 78, baseType: !51, size: 64, offset: 320)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !333, file: !298, line: 81, baseType: !51, size: 64, offset: 384)
!343 = !DISubprogram(name: "free", scope: !131, file: !131, line: 565, type: !344, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!344 = !DISubroutineType(types: !345)
!345 = !{null, !106}
!346 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !6, file: !6, line: 408, type: !347, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!347 = !DISubroutineType(types: !348)
!348 = !{!49, !53, !51, !51, !51, !110}
!349 = !DISubprogram(name: "rpl_mbrtowc", scope: !175, file: !175, line: 717, type: !350, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!350 = !DISubroutineType(types: !351)
!351 = !{!110, !150, !51, !110, !352}
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !180, line: 13, size: 64, elements: !354)
!354 = !{!355, !356}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !353, file: !180, line: 15, baseType: !53, size: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !353, file: !180, line: 20, baseType: !357, size: 32, offset: 32)
!357 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !353, file: !180, line: 16, size: 32, elements: !358)
!358 = !{!359, !360}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !357, file: !180, line: 18, baseType: !7, size: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !357, file: !180, line: 19, baseType: !188, size: 32)
!361 = !DISubprogram(name: "iswprint", scope: !362, file: !362, line: 120, type: !363, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!362 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!363 = !DISubroutineType(types: !364)
!364 = !{!53, !7}
!365 = !DISubprogram(name: "mbsinit", scope: !366, file: !366, line: 292, type: !367, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!366 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!367 = !DISubroutineType(types: !368)
!368 = !{!53, !369}
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !353)
!371 = !DISubprogram(name: "locale_charset", scope: !372, file: !372, line: 35, type: !373, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!372 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!373 = !DISubroutineType(types: !374)
!374 = !{!51}
!375 = !DISubprogram(name: "c_strcasecmp", scope: !376, file: !376, line: 42, type: !377, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!376 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!377 = !DISubroutineType(types: !378)
!378 = !{!53, !51, !51}
!379 = !DISubprogram(name: "xmalloc", scope: !322, file: !322, line: 53, type: !380, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!380 = !DISubroutineType(types: !381)
!381 = !{!106, !110}
!382 = !DISubprogram(name: "xalloc_die", scope: !322, file: !322, line: 51, type: !135, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !54)
!383 = !DISubprogram(name: "xrealloc", scope: !322, file: !322, line: 59, type: !384, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!384 = !DISubroutineType(types: !385)
!385 = !{!106, !106, !110}
!386 = !{!295, !387, !393, !395, !397, !402, !409, !411}
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !297, file: !298, line: 101, type: !389, isLocal: false, isDefinition: true)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 320, elements: !391)
!390 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!391 = !{!392}
!392 = !DISubrange(count: 10)
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !297, file: !298, line: 1052, type: !333, isLocal: false, isDefinition: true)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !297, file: !298, line: 116, type: !333, isLocal: true, isDefinition: true)
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(name: "slot0", scope: !297, file: !298, line: 842, type: !399, isLocal: true, isDefinition: true)
!399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 2048, elements: !400)
!400 = !{!401}
!401 = !DISubrange(count: 256)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(name: "slotvec", scope: !297, file: !298, line: 845, type: !404, isLocal: true, isDefinition: true)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !298, line: 834, size: 128, elements: !406)
!406 = !{!407, !408}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !405, file: !298, line: 836, baseType: !108, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !405, file: !298, line: 837, baseType: !49, size: 64, offset: 64)
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(name: "nslots", scope: !297, file: !298, line: 843, type: !53, isLocal: true, isDefinition: true)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(name: "slotvec0", scope: !297, file: !298, line: 844, type: !405, isLocal: true, isDefinition: true)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !414, size: 704, elements: !415)
!414 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!415 = !{!416}
!416 = !DISubrange(count: 11)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !419, file: !420, line: 26, type: !422, isLocal: false, isDefinition: true)
!419 = distinct !DICompileUnit(language: DW_LANG_C99, file: !420, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !54, globals: !421, splitDebugInlining: false, nameTableKind: None)
!420 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!421 = !{!417}
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 376, elements: !423)
!423 = !{!424}
!424 = !DISubrange(count: 47)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(name: "internal_state", scope: !427, file: !428, line: 24, type: !443, isLocal: true, isDefinition: true)
!427 = distinct !DICompileUnit(language: DW_LANG_C99, file: !428, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !54, retainedTypes: !429, globals: !442, splitDebugInlining: false, nameTableKind: None)
!428 = !DIFile(filename: "lib/mbrlen.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!429 = !{!106, !430}
!430 = !DISubprogram(name: "rpl_mbrtowc", scope: !175, file: !175, line: 717, type: !431, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!431 = !DISubroutineType(types: !432)
!432 = !{!110, !150, !51, !110, !433}
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !180, line: 13, size: 64, elements: !435)
!435 = !{!436, !437}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !434, file: !180, line: 15, baseType: !53, size: 32)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !434, file: !180, line: 20, baseType: !438, size: 32, offset: 32)
!438 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !434, file: !180, line: 16, size: 32, elements: !439)
!439 = !{!440, !441}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !438, file: !180, line: 18, baseType: !7, size: 32)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !438, file: !180, line: 19, baseType: !188, size: 32)
!442 = !{!425}
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !444, line: 6, baseType: !445)
!444 = !DIFile(filename: "/usr/include/bits/types/mbstate_t.h", directory: "")
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !180, line: 21, baseType: !434)
!446 = distinct !DICompileUnit(language: DW_LANG_C99, file: !447, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !448, retainedTypes: !452, splitDebugInlining: false, nameTableKind: None)
!447 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!448 = !{!449}
!449 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !447, line: 40, baseType: !7, size: 32, elements: !450)
!450 = !{!451}
!451 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!452 = !{!45, !453, !106}
!453 = !DISubprogram(name: "fputs_unlocked", scope: !56, file: !56, line: 662, type: !454, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!454 = !DISubroutineType(types: !455)
!455 = !{!53, !51, !456}
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !61, line: 49, size: 1728, elements: !458)
!458 = !{!459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !457, file: !61, line: 51, baseType: !53, size: 32)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !457, file: !61, line: 54, baseType: !49, size: 64, offset: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !457, file: !61, line: 55, baseType: !49, size: 64, offset: 128)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !457, file: !61, line: 56, baseType: !49, size: 64, offset: 192)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !457, file: !61, line: 57, baseType: !49, size: 64, offset: 256)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !457, file: !61, line: 58, baseType: !49, size: 64, offset: 320)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !457, file: !61, line: 59, baseType: !49, size: 64, offset: 384)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !457, file: !61, line: 60, baseType: !49, size: 64, offset: 448)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !457, file: !61, line: 61, baseType: !49, size: 64, offset: 512)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !457, file: !61, line: 64, baseType: !49, size: 64, offset: 576)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !457, file: !61, line: 65, baseType: !49, size: 64, offset: 640)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !457, file: !61, line: 66, baseType: !49, size: 64, offset: 704)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !457, file: !61, line: 68, baseType: !76, size: 64, offset: 768)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !457, file: !61, line: 70, baseType: !456, size: 64, offset: 832)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !457, file: !61, line: 72, baseType: !53, size: 32, offset: 896)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !457, file: !61, line: 73, baseType: !53, size: 32, offset: 928)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !457, file: !61, line: 74, baseType: !82, size: 64, offset: 960)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !457, file: !61, line: 77, baseType: !86, size: 16, offset: 1024)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !457, file: !61, line: 78, baseType: !88, size: 8, offset: 1040)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !457, file: !61, line: 79, baseType: !90, size: 8, offset: 1048)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !457, file: !61, line: 81, baseType: !94, size: 64, offset: 1088)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !457, file: !61, line: 89, baseType: !97, size: 64, offset: 1152)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !457, file: !61, line: 91, baseType: !99, size: 64, offset: 1216)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !457, file: !61, line: 92, baseType: !102, size: 64, offset: 1280)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !457, file: !61, line: 93, baseType: !456, size: 64, offset: 1344)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !457, file: !61, line: 94, baseType: !106, size: 64, offset: 1408)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !457, file: !61, line: 95, baseType: !108, size: 64, offset: 1472)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !457, file: !61, line: 96, baseType: !53, size: 32, offset: 1536)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !457, file: !61, line: 98, baseType: !113, size: 160, offset: 1568)
!488 = distinct !DICompileUnit(language: DW_LANG_C99, file: !489, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !490, retainedTypes: !503, splitDebugInlining: false, nameTableKind: None)
!489 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!490 = !{!491}
!491 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !492, file: !322, line: 186, baseType: !7, size: 32, elements: !501)
!492 = distinct !DISubprogram(name: "x2nrealloc", scope: !322, file: !322, line: 174, type: !493, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !488, retainedNodes: !496)
!493 = !DISubroutineType(types: !494)
!494 = !{!106, !106, !495, !108}
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!496 = !{!497, !498, !499, !500}
!497 = !DILocalVariable(name: "p", arg: 1, scope: !492, file: !322, line: 174, type: !106)
!498 = !DILocalVariable(name: "pn", arg: 2, scope: !492, file: !322, line: 174, type: !495)
!499 = !DILocalVariable(name: "s", arg: 3, scope: !492, file: !322, line: 174, type: !108)
!500 = !DILocalVariable(name: "n", scope: !492, file: !322, line: 176, type: !108)
!501 = !{!502}
!502 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!503 = !{!108, !382, !379, !383, !49, !343, !106, !504, !507}
!504 = !DISubprogram(name: "xcalloc", scope: !322, file: !322, line: 57, type: !505, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!505 = !DISubroutineType(types: !506)
!506 = !{!106, !110, !110}
!507 = !DISubprogram(name: "rpl_calloc", scope: !508, file: !508, line: 688, type: !505, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!508 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!509 = distinct !DICompileUnit(language: DW_LANG_C99, file: !510, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !54, retainedTypes: !511, splitDebugInlining: false, nameTableKind: None)
!510 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!511 = !{!45, !156}
!512 = distinct !DICompileUnit(language: DW_LANG_C99, file: !513, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !54, retainedTypes: !514, splitDebugInlining: false, nameTableKind: None)
!513 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!514 = !{!106}
!515 = distinct !DICompileUnit(language: DW_LANG_C99, file: !516, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !54, retainedTypes: !517, splitDebugInlining: false, nameTableKind: None)
!516 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!517 = !{!518, !108, !530}
!518 = !DISubprogram(name: "mbrtowc", scope: !366, file: !366, line: 296, type: !519, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!519 = !DISubroutineType(types: !520)
!520 = !{!110, !150, !51, !110, !521}
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !180, line: 13, size: 64, elements: !523)
!523 = !{!524, !525}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !522, file: !180, line: 15, baseType: !53, size: 32)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !522, file: !180, line: 20, baseType: !526, size: 32, offset: 32)
!526 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !522, file: !180, line: 16, size: 32, elements: !527)
!527 = !{!528, !529}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !526, file: !180, line: 18, baseType: !7, size: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !526, file: !180, line: 19, baseType: !188, size: 32)
!530 = !DISubprogram(name: "hard_locale", scope: !531, file: !531, line: 26, type: !532, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!531 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!532 = !DISubroutineType(types: !533)
!533 = !{!247, !53}
!534 = distinct !DICompileUnit(language: DW_LANG_C99, file: !535, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !54, retainedTypes: !536, splitDebugInlining: false, nameTableKind: None)
!535 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!536 = !{!537}
!537 = !DISubprogram(name: "rpl_fclose", scope: !538, file: !538, line: 672, type: !539, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!538 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!539 = !DISubroutineType(types: !540)
!540 = !{!53, !541}
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !61, line: 49, size: 1728, elements: !543)
!543 = !{!544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !542, file: !61, line: 51, baseType: !53, size: 32)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !542, file: !61, line: 54, baseType: !49, size: 64, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !542, file: !61, line: 55, baseType: !49, size: 64, offset: 128)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !542, file: !61, line: 56, baseType: !49, size: 64, offset: 192)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !542, file: !61, line: 57, baseType: !49, size: 64, offset: 256)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !542, file: !61, line: 58, baseType: !49, size: 64, offset: 320)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !542, file: !61, line: 59, baseType: !49, size: 64, offset: 384)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !542, file: !61, line: 60, baseType: !49, size: 64, offset: 448)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !542, file: !61, line: 61, baseType: !49, size: 64, offset: 512)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !542, file: !61, line: 64, baseType: !49, size: 64, offset: 576)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !542, file: !61, line: 65, baseType: !49, size: 64, offset: 640)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !542, file: !61, line: 66, baseType: !49, size: 64, offset: 704)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !542, file: !61, line: 68, baseType: !76, size: 64, offset: 768)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !542, file: !61, line: 70, baseType: !541, size: 64, offset: 832)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !542, file: !61, line: 72, baseType: !53, size: 32, offset: 896)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !542, file: !61, line: 73, baseType: !53, size: 32, offset: 928)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !542, file: !61, line: 74, baseType: !82, size: 64, offset: 960)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !542, file: !61, line: 77, baseType: !86, size: 16, offset: 1024)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !542, file: !61, line: 78, baseType: !88, size: 8, offset: 1040)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !542, file: !61, line: 79, baseType: !90, size: 8, offset: 1048)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !542, file: !61, line: 81, baseType: !94, size: 64, offset: 1088)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !542, file: !61, line: 89, baseType: !97, size: 64, offset: 1152)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !542, file: !61, line: 91, baseType: !99, size: 64, offset: 1216)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !542, file: !61, line: 92, baseType: !102, size: 64, offset: 1280)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !542, file: !61, line: 93, baseType: !541, size: 64, offset: 1344)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !542, file: !61, line: 94, baseType: !106, size: 64, offset: 1408)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !542, file: !61, line: 95, baseType: !108, size: 64, offset: 1472)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !542, file: !61, line: 96, baseType: !53, size: 32, offset: 1536)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !542, file: !61, line: 98, baseType: !113, size: 160, offset: 1568)
!573 = distinct !DICompileUnit(language: DW_LANG_C99, file: !574, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !54, retainedTypes: !575, splitDebugInlining: false, nameTableKind: None)
!574 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!575 = !{!576}
!576 = !DISubprogram(name: "setlocale_null_r", scope: !577, file: !577, line: 64, type: !578, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!577 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!578 = !DISubroutineType(types: !579)
!579 = !{!53, !53, !49, !110}
!580 = distinct !DICompileUnit(language: DW_LANG_C99, file: !581, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !582, retainedTypes: !969, splitDebugInlining: false, nameTableKind: None)
!581 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!582 = !{!583}
!583 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !584, line: 41, baseType: !7, size: 32, elements: !585)
!584 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!585 = !{!586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968}
!586 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!587 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!588 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!589 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!590 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!591 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!592 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!593 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!594 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!595 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!596 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!597 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!598 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!599 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!600 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!601 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!602 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!603 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!604 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!605 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!606 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!607 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!608 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!609 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!610 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!611 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!612 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!613 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!614 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!615 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!616 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!617 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!618 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!619 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!620 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!621 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!622 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!623 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!624 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!625 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!626 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!627 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!628 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!629 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!630 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!631 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!632 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!633 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!634 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!635 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!636 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!637 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!661 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!662 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!663 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!664 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!665 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!666 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!667 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!668 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!669 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!670 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!671 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!672 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!673 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!674 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!675 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!676 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!677 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!678 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!679 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!680 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!681 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!682 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!683 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!684 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!685 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!686 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!687 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!688 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!689 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!690 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!691 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!692 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!693 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!694 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!695 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!696 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!697 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!698 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!699 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!700 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!701 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!702 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!703 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!704 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!705 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!706 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!707 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!708 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!709 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!710 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!711 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!712 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!713 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!714 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!715 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!716 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!717 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!719 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!720 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!721 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!722 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!723 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!724 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!725 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!726 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!727 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!728 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!729 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!730 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!731 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!732 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!733 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!734 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!735 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!736 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!737 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!738 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!739 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!740 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!741 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!742 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!743 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!744 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!745 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!746 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!747 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!748 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!749 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!750 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!751 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!752 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!753 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!754 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!755 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!756 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!757 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!758 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!759 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!760 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!761 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!762 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!763 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!764 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!765 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!766 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!767 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!768 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!769 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!770 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!771 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!772 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!773 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!774 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!779 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!780 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!781 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!782 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!783 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!784 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!785 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!786 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!787 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!788 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!789 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!790 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!791 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!793 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!794 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!795 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!796 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!797 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!798 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!799 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!800 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!801 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!802 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!803 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!804 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!805 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!806 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!807 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!808 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!809 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!810 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!812 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!813 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!814 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!815 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!816 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!817 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!818 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!819 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!820 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!821 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!822 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!823 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!824 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!825 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!826 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!827 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!828 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!829 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!830 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!831 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!832 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!833 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!834 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!835 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!836 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!837 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!838 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!839 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!840 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!841 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!842 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!843 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!844 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!845 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!846 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!847 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!854 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!855 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!856 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!857 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!858 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!859 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!860 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!861 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!862 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!863 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!864 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!865 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!866 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!867 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!868 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!870 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!871 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!872 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!873 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!874 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!875 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!884 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!885 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!886 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!887 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!894 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!895 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!896 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!898 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!899 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!900 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!901 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!902 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!903 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!904 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!905 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!906 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!907 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!908 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!909 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!910 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!911 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!912 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!913 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!914 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!915 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!916 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!917 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!918 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!919 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!920 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!921 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!922 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!923 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!924 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!925 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!926 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!927 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!928 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!929 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!930 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!931 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!932 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!933 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!934 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!935 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!936 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!937 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!938 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!939 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!940 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!941 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!942 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!943 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!944 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!945 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!946 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!947 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!948 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!949 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!950 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!951 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!952 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!953 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!954 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!955 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!956 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!957 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!958 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!959 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!960 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!961 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!962 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!963 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!964 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!965 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!966 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!967 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!968 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!969 = !{!970, !106}
!970 = !DISubprogram(name: "nl_langinfo", scope: !584, file: !584, line: 661, type: !971, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!971 = !DISubroutineType(types: !972)
!972 = !{!49, !53}
!973 = distinct !DICompileUnit(language: DW_LANG_C99, file: !974, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !54, retainedTypes: !975, splitDebugInlining: false, nameTableKind: None)
!974 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!975 = !{!106, !120}
!976 = distinct !DICompileUnit(language: DW_LANG_C99, file: !977, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !54, retainedTypes: !978, splitDebugInlining: false, nameTableKind: None)
!977 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!978 = !{!979, !1014, !1015, !1018}
!979 = !DISubprogram(name: "fileno", scope: !56, file: !56, line: 786, type: !980, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!980 = !DISubroutineType(types: !981)
!981 = !{!53, !982}
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !61, line: 49, size: 1728, elements: !984)
!984 = !{!985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !983, file: !61, line: 51, baseType: !53, size: 32)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !983, file: !61, line: 54, baseType: !49, size: 64, offset: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !983, file: !61, line: 55, baseType: !49, size: 64, offset: 128)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !983, file: !61, line: 56, baseType: !49, size: 64, offset: 192)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !983, file: !61, line: 57, baseType: !49, size: 64, offset: 256)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !983, file: !61, line: 58, baseType: !49, size: 64, offset: 320)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !983, file: !61, line: 59, baseType: !49, size: 64, offset: 384)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !983, file: !61, line: 60, baseType: !49, size: 64, offset: 448)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !983, file: !61, line: 61, baseType: !49, size: 64, offset: 512)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !983, file: !61, line: 64, baseType: !49, size: 64, offset: 576)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !983, file: !61, line: 65, baseType: !49, size: 64, offset: 640)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !983, file: !61, line: 66, baseType: !49, size: 64, offset: 704)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !983, file: !61, line: 68, baseType: !76, size: 64, offset: 768)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !983, file: !61, line: 70, baseType: !982, size: 64, offset: 832)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !983, file: !61, line: 72, baseType: !53, size: 32, offset: 896)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !983, file: !61, line: 73, baseType: !53, size: 32, offset: 928)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !983, file: !61, line: 74, baseType: !82, size: 64, offset: 960)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !983, file: !61, line: 77, baseType: !86, size: 16, offset: 1024)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !983, file: !61, line: 78, baseType: !88, size: 8, offset: 1040)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !983, file: !61, line: 79, baseType: !90, size: 8, offset: 1048)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !983, file: !61, line: 81, baseType: !94, size: 64, offset: 1088)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !983, file: !61, line: 89, baseType: !97, size: 64, offset: 1152)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !983, file: !61, line: 91, baseType: !99, size: 64, offset: 1216)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !983, file: !61, line: 92, baseType: !102, size: 64, offset: 1280)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !983, file: !61, line: 93, baseType: !982, size: 64, offset: 1344)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !983, file: !61, line: 94, baseType: !106, size: 64, offset: 1408)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !983, file: !61, line: 95, baseType: !108, size: 64, offset: 1472)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !983, file: !61, line: 96, baseType: !53, size: 32, offset: 1536)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !983, file: !61, line: 98, baseType: !113, size: 160, offset: 1568)
!1014 = !DISubprogram(name: "fclose", scope: !56, file: !56, line: 213, type: !980, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!1015 = !DISubprogram(name: "lseek", scope: !164, file: !164, line: 334, type: !1016, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!84, !53, !84, !53}
!1018 = !DISubprogram(name: "rpl_fflush", scope: !538, file: !538, line: 718, type: !980, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!1019 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1020, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !54, retainedTypes: !1021, splitDebugInlining: false, nameTableKind: None)
!1020 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1021 = !{!106, !1022, !1057}
!1022 = !DISubprogram(name: "fflush", scope: !56, file: !56, line: 218, type: !1023, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !54)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!53, !1025}
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !61, line: 49, size: 1728, elements: !1027)
