; ModuleID = 'coreutils-8.32/src/pinky.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.addrinfo = type { i32, i32, i32, i32, i32, %struct.sockaddr*, i8*, %struct.addrinfo* }
%struct.sockaddr = type { i16, [14 x i8] }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.utmpx = type { i16, i32, [32 x i8], [4 x i8], [32 x i8], [256 x i8], %struct.__exit_status, i32, %struct.anon, [4 x i32], [20 x i8] }
%struct.__exit_status = type { i16, i16 }
%struct.anon = type { i32, i32 }
%struct.passwd = type { i8*, i8*, i32, i32, i8*, i8*, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 75, type: !332, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !39, globals: !274, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/pinky.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !20, !24}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!9 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 148, baseType: !7, size: 32, elements: !22)
!21 = !DIFile(filename: "./lib/readutmp.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!22 = !{!23}
!23 = !DIEnumerator(name: "UT_USER_SIZE", value: 32, isUnsigned: true)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 46, baseType: !7, size: 32, elements: !26)
!25 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!26 = !{!27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38}
!27 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!28 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!29 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!30 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!31 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!32 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!33 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!34 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!35 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!36 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!37 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!38 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!39 = !{!40, !50, !111, !115, !119, !122, !125, !132, !44, !101, !147, !151, !155, !196, !199, !204, !205, !221, !48, !224, !103, !226, !228, !81, !231, !236, !256, !261, !46, !265, !270}
!40 = !DISubprogram(name: "dcgettext", scope: !41, file: !41, line: 51, type: !42, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!41 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!42 = !DISubroutineType(types: !43)
!43 = !{!44, !46, !46, !48}
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!48 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!49 = !{}
!50 = !DISubprogram(name: "fputs_unlocked", scope: !51, file: !51, line: 662, type: !52, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!51 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!52 = !DISubroutineType(types: !53)
!53 = !{!48, !46, !54}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !56, line: 49, size: 1728, elements: !57)
!56 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!57 = !{!58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !73, !74, !75, !76, !80, !82, !84, !88, !91, !93, !96, !99, !100, !102, !106, !107}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !55, file: !56, line: 51, baseType: !48, size: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !55, file: !56, line: 54, baseType: !44, size: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !55, file: !56, line: 55, baseType: !44, size: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !55, file: !56, line: 56, baseType: !44, size: 64, offset: 192)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !55, file: !56, line: 57, baseType: !44, size: 64, offset: 256)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !55, file: !56, line: 58, baseType: !44, size: 64, offset: 320)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !55, file: !56, line: 59, baseType: !44, size: 64, offset: 384)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !55, file: !56, line: 60, baseType: !44, size: 64, offset: 448)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !55, file: !56, line: 61, baseType: !44, size: 64, offset: 512)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !55, file: !56, line: 64, baseType: !44, size: 64, offset: 576)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !55, file: !56, line: 65, baseType: !44, size: 64, offset: 640)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !55, file: !56, line: 66, baseType: !44, size: 64, offset: 704)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !55, file: !56, line: 68, baseType: !71, size: 64, offset: 768)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !56, line: 36, flags: DIFlagFwdDecl)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !55, file: !56, line: 70, baseType: !54, size: 64, offset: 832)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !55, file: !56, line: 72, baseType: !48, size: 32, offset: 896)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !55, file: !56, line: 73, baseType: !48, size: 32, offset: 928)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !55, file: !56, line: 74, baseType: !77, size: 64, offset: 960)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !78, line: 152, baseType: !79)
!78 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!79 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !55, file: !56, line: 77, baseType: !81, size: 16, offset: 1024)
!81 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !55, file: !56, line: 78, baseType: !83, size: 8, offset: 1040)
!83 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !55, file: !56, line: 79, baseType: !85, size: 8, offset: 1048)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 8, elements: !86)
!86 = !{!87}
!87 = !DISubrange(count: 1)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !55, file: !56, line: 81, baseType: !89, size: 64, offset: 1088)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !56, line: 43, baseType: null)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !55, file: !56, line: 89, baseType: !92, size: 64, offset: 1152)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !78, line: 153, baseType: !79)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !55, file: !56, line: 91, baseType: !94, size: 64, offset: 1216)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !56, line: 37, flags: DIFlagFwdDecl)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !55, file: !56, line: 92, baseType: !97, size: 64, offset: 1280)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !56, line: 38, flags: DIFlagFwdDecl)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !55, file: !56, line: 93, baseType: !54, size: 64, offset: 1344)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !55, file: !56, line: 94, baseType: !101, size: 64, offset: 1408)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !55, file: !56, line: 95, baseType: !103, size: 64, offset: 1472)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !104, line: 46, baseType: !105)
!104 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!105 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !55, file: !56, line: 96, baseType: !48, size: 32, offset: 1536)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !55, file: !56, line: 98, baseType: !108, size: 160, offset: 1568)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 160, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 20)
!111 = !DISubprogram(name: "set_program_name", scope: !112, file: !112, line: 37, type: !113, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!112 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!113 = !DISubroutineType(types: !114)
!114 = !{null, !46}
!115 = !DISubprogram(name: "setlocale", scope: !116, file: !116, line: 122, type: !117, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!116 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!117 = !DISubroutineType(types: !118)
!118 = !{!44, !48, !46}
!119 = !DISubprogram(name: "bindtextdomain", scope: !41, file: !41, line: 86, type: !120, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!120 = !DISubroutineType(types: !121)
!121 = !{!44, !46, !46}
!122 = !DISubprogram(name: "textdomain", scope: !41, file: !41, line: 82, type: !123, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!123 = !DISubroutineType(types: !124)
!124 = !{!44, !46}
!125 = !DISubprogram(name: "atexit", scope: !126, file: !126, line: 595, type: !127, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!126 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!127 = !DISubroutineType(types: !128)
!128 = !{!48, !129}
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{null}
!132 = !DISubprogram(name: "getopt_long", scope: !133, file: !133, line: 66, type: !134, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!133 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!134 = !DISubroutineType(types: !135)
!135 = !{!48, !48, !136, !46, !138, !145}
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !133, line: 50, size: 256, elements: !141)
!141 = !{!142, !143, !144, !146}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !140, file: !133, line: 52, baseType: !46, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !140, file: !133, line: 55, baseType: !48, size: 32, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !140, file: !133, line: 56, baseType: !145, size: 64, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !140, file: !133, line: 57, baseType: !48, size: 32, offset: 192)
!147 = !DISubprogram(name: "version_etc", scope: !148, file: !148, line: 69, type: !149, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!148 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!149 = !DISubroutineType(types: !150)
!150 = !{null, !54, !46, !46, !46, null}
!151 = !DISubprogram(name: "error", scope: !152, file: !152, line: 52, type: !153, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!152 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!153 = !DISubroutineType(types: !154)
!154 = !{null, !48, !48, !46, null}
!155 = !DISubprogram(name: "read_utmp", scope: !21, file: !21, line: 215, type: !156, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!156 = !DISubroutineType(types: !157)
!157 = !{!48, !46, !158, !159, !48}
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utmpx", file: !162, line: 55, size: 3072, elements: !163)
!162 = !DIFile(filename: "/usr/include/bits/utmpx.h", directory: "")
!163 = !{!164, !166, !168, !172, !176, !177, !181, !186, !188, !193, !195}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !161, file: !162, line: 57, baseType: !165, size: 16)
!165 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !161, file: !162, line: 58, baseType: !167, size: 32, offset: 32)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !78, line: 154, baseType: !48)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !161, file: !162, line: 59, baseType: !169, size: 256, offset: 64)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 256, elements: !170)
!170 = !{!171}
!171 = !DISubrange(count: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !161, file: !162, line: 61, baseType: !173, size: 32, offset: 320)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 32, elements: !174)
!174 = !{!175}
!175 = !DISubrange(count: 4)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !161, file: !162, line: 63, baseType: !169, size: 256, offset: 352)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !161, file: !162, line: 65, baseType: !178, size: 2048, offset: 608)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 2048, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 256)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !161, file: !162, line: 67, baseType: !182, size: 32, offset: 2656)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exit_status", file: !162, line: 42, size: 32, elements: !183)
!183 = !{!184, !185}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !182, file: !162, line: 45, baseType: !165, size: 16)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !182, file: !162, line: 46, baseType: !165, size: 16, offset: 16)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !161, file: !162, line: 74, baseType: !187, size: 32, offset: 2688)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !78, line: 41, baseType: !48)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "ut_tv", scope: !161, file: !162, line: 79, baseType: !189, size: 64, offset: 2720)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !161, file: !162, line: 75, size: 64, elements: !190)
!190 = !{!191, !192}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !189, file: !162, line: 77, baseType: !187, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !189, file: !162, line: 78, baseType: !187, size: 32, offset: 32)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "ut_addr_v6", scope: !161, file: !162, line: 84, baseType: !194, size: 128, offset: 2784)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 128, elements: !174)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !161, file: !162, line: 85, baseType: !108, size: 160, offset: 2912)
!196 = !DISubprogram(name: "quotearg_n_style_colon", scope: !6, file: !6, line: 397, type: !197, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!197 = !DISubroutineType(types: !198)
!198 = !{!44, !48, !5, !46}
!199 = !DISubprogram(name: "hard_locale", scope: !200, file: !200, line: 26, type: !201, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!200 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!201 = !DISubroutineType(types: !202)
!202 = !{!203, !48}
!203 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!204 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!205 = !DISubprogram(name: "getpwnam", scope: !206, file: !206, line: 116, type: !207, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!206 = !DIFile(filename: "/usr/include/pwd.h", directory: "")
!207 = !DISubroutineType(types: !208)
!208 = !{!209, !46}
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !206, line: 49, size: 384, elements: !211)
!211 = !{!212, !213, !214, !216, !218, !219, !220}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !210, file: !206, line: 51, baseType: !44, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !210, file: !206, line: 52, baseType: !44, size: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !210, file: !206, line: 54, baseType: !215, size: 32, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !78, line: 146, baseType: !7)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !210, file: !206, line: 55, baseType: !217, size: 32, offset: 160)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !78, line: 147, baseType: !7)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !210, file: !206, line: 56, baseType: !44, size: 64, offset: 192)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !210, file: !206, line: 57, baseType: !44, size: 64, offset: 256)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !210, file: !206, line: 58, baseType: !44, size: 64, offset: 320)
!221 = !DISubprogram(name: "free", scope: !126, file: !126, line: 565, type: !222, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!222 = !DISubroutineType(types: !223)
!223 = !{null, !101}
!224 = !DISubprogram(name: "canon_host", scope: !225, file: !225, line: 23, type: !123, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!225 = !DIFile(filename: "./lib/canon-host.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!226 = !DISubprogram(name: "xalloc_die", scope: !227, file: !227, line: 51, type: !130, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !49)
!227 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!228 = !DISubprogram(name: "xmalloc", scope: !227, file: !227, line: 53, type: !229, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!229 = !DISubroutineType(types: !230)
!230 = !{!101, !105}
!231 = !DISubprogram(name: "time", scope: !232, file: !232, line: 75, type: !233, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!232 = !DIFile(filename: "/usr/include/time.h", directory: "")
!233 = !DISubroutineType(types: !234)
!234 = !{!79, !235}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!236 = !DISubprogram(name: "localtime", scope: !232, file: !232, line: 123, type: !237, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!237 = !DISubroutineType(types: !238)
!238 = !{!239, !254}
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !241, line: 7, size: 448, elements: !242)
!241 = !DIFile(filename: "/usr/include/bits/types/struct_tm.h", directory: "")
!242 = !{!243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !240, file: !241, line: 9, baseType: !48, size: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !240, file: !241, line: 10, baseType: !48, size: 32, offset: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !240, file: !241, line: 11, baseType: !48, size: 32, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !240, file: !241, line: 12, baseType: !48, size: 32, offset: 96)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !240, file: !241, line: 13, baseType: !48, size: 32, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !240, file: !241, line: 14, baseType: !48, size: 32, offset: 160)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !240, file: !241, line: 15, baseType: !48, size: 32, offset: 192)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !240, file: !241, line: 16, baseType: !48, size: 32, offset: 224)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !240, file: !241, line: 17, baseType: !48, size: 32, offset: 256)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !240, file: !241, line: 20, baseType: !79, size: 64, offset: 320)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !240, file: !241, line: 21, baseType: !46, size: 64, offset: 384)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !79)
!256 = !DISubprogram(name: "strftime", scope: !232, file: !232, line: 88, type: !257, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!257 = !DISubroutineType(types: !258)
!258 = !{!105, !44, !105, !46, !259}
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !240)
!261 = !DISubprogram(name: "imaxtostr", scope: !262, file: !262, line: 42, type: !263, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!262 = !DIFile(filename: "./lib/inttostr.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!263 = !DISubroutineType(types: !264)
!264 = !{!44, !79, !44}
!265 = !DISubprogram(name: "fwrite_unlocked", scope: !51, file: !51, line: 675, type: !266, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!266 = !DISubroutineType(types: !267)
!267 = !{!105, !268, !105, !105, !54}
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!270 = !DISubprogram(name: "rpl_fclose", scope: !271, file: !271, line: 672, type: !272, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!271 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!272 = !DISubroutineType(types: !273)
!273 = !{!48, !54}
!274 = !{!0, !275, !277, !279, !281, !283, !285, !287, !289, !291, !293, !295, !312, !317}
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(name: "do_short_format", scope: !2, file: !3, line: 63, type: !203, isLocal: true, isDefinition: true)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(name: "include_heading", scope: !2, file: !3, line: 47, type: !203, isLocal: true, isDefinition: true)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "include_fullname", scope: !2, file: !3, line: 50, type: !203, isLocal: true, isDefinition: true)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(name: "include_where", scope: !2, file: !3, line: 67, type: !203, isLocal: true, isDefinition: true)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(name: "include_idle", scope: !2, file: !3, line: 44, type: !203, isLocal: true, isDefinition: true)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(name: "include_project", scope: !2, file: !3, line: 53, type: !203, isLocal: true, isDefinition: true)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(name: "include_plan", scope: !2, file: !3, line: 56, type: !203, isLocal: true, isDefinition: true)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(name: "include_home_and_shell", scope: !2, file: !3, line: 60, type: !203, isLocal: true, isDefinition: true)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "time_format", scope: !2, file: !3, line: 72, type: !46, isLocal: true, isDefinition: true)
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(name: "time_format_width", scope: !2, file: !3, line: 73, type: !48, isLocal: true, isDefinition: true)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "now", scope: !297, file: !3, line: 149, type: !300, isLocal: true, isDefinition: true)
!297 = distinct !DISubprogram(name: "idle_string", scope: !3, file: !3, line: 147, type: !298, scopeLine: 148, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !303)
!298 = !DISubroutineType(types: !299)
!299 = !{!46, !300}
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !301, line: 7, baseType: !302)
!301 = !DIFile(filename: "/usr/include/bits/types/time_t.h", directory: "")
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !78, line: 160, baseType: !79)
!303 = !{!304, !305, !306, !309, !310}
!304 = !DILocalVariable(name: "when", arg: 1, scope: !297, file: !3, line: 147, type: !300)
!305 = !DILocalVariable(name: "seconds_idle", scope: !297, file: !3, line: 151, type: !300)
!306 = !DILocalVariable(name: "hours", scope: !307, file: !3, line: 161, type: !48)
!307 = distinct !DILexicalBlock(scope: !308, file: !3, line: 160, column: 5)
!308 = distinct !DILexicalBlock(scope: !297, file: !3, line: 159, column: 7)
!309 = !DILocalVariable(name: "minutes", scope: !307, file: !3, line: 162, type: !48)
!310 = !DILocalVariable(name: "days", scope: !311, file: !3, line: 167, type: !105)
!311 = distinct !DILexicalBlock(scope: !308, file: !3, line: 166, column: 5)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(name: "buf", scope: !297, file: !3, line: 150, type: !314, isLocal: true, isDefinition: true)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 176, elements: !315)
!315 = !{!316}
!316 = !DISubrange(count: 22)
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(name: "buf", scope: !319, file: !3, line: 177, type: !329, isLocal: true, isDefinition: true)
!319 = distinct !DISubprogram(name: "time_string", scope: !3, file: !3, line: 175, type: !320, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !325)
!320 = !DISubroutineType(types: !321)
!321 = !{!46, !322}
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !324)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRUCT_UTMP", file: !21, line: 146, baseType: !161)
!325 = !{!326, !327, !328}
!326 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !319, file: !3, line: 175, type: !322)
!327 = !DILocalVariable(name: "t", scope: !319, file: !3, line: 185, type: !300)
!328 = !DILocalVariable(name: "tmp", scope: !319, file: !3, line: 186, type: !239)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 264, elements: !330)
!330 = !{!331}
!331 = !DISubrange(count: 33)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 768, elements: !333)
!333 = !{!334}
!334 = !DISubrange(count: 3)
!335 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!336 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!337 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!338 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!339 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!340 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!341 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!342 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "Version", scope: !345, file: !346, line: 2, type: !46, isLocal: false, isDefinition: true)
!345 = distinct !DICompileUnit(language: DW_LANG_C99, file: !346, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !49, globals: !347, splitDebugInlining: false, nameTableKind: None)
!346 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!347 = !{!343}
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "last_cherror", scope: !350, file: !351, line: 28, type: !48, isLocal: true, isDefinition: true)
!350 = distinct !DICompileUnit(language: DW_LANG_C99, file: !351, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !49, retainedTypes: !352, globals: !393, splitDebugInlining: false, nameTableKind: None)
!351 = !DIFile(filename: "lib/canon-host.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!352 = !{!353, !356, !387, !390}
!353 = !DISubprogram(name: "canon_host_r", scope: !225, file: !225, line: 24, type: !354, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!354 = !DISubroutineType(types: !355)
!355 = !{!44, !46, !145}
!356 = !DISubprogram(name: "getaddrinfo", scope: !357, file: !357, line: 660, type: !358, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!357 = !DIFile(filename: "/usr/include/netdb.h", directory: "")
!358 = !DISubroutineType(types: !359)
!359 = !{!48, !46, !46, !360, !386}
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !362)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "addrinfo", file: !357, line: 565, size: 384, elements: !363)
!363 = !{!364, !365, !366, !367, !368, !372, !383, !384}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "ai_flags", scope: !362, file: !357, line: 567, baseType: !48, size: 32)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "ai_family", scope: !362, file: !357, line: 568, baseType: !48, size: 32, offset: 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "ai_socktype", scope: !362, file: !357, line: 569, baseType: !48, size: 32, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "ai_protocol", scope: !362, file: !357, line: 570, baseType: !48, size: 32, offset: 96)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !362, file: !357, line: 571, baseType: !369, size: 32, offset: 128)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !370, line: 33, baseType: !371)
!370 = !DIFile(filename: "/usr/include/bits/socket.h", directory: "")
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !78, line: 209, baseType: !7)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr", scope: !362, file: !357, line: 572, baseType: !373, size: 64, offset: 192)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !370, line: 178, size: 128, elements: !375)
!375 = !{!376, !379}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !374, file: !370, line: 180, baseType: !377, size: 16)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !378, line: 28, baseType: !81)
!378 = !DIFile(filename: "/usr/include/bits/sockaddr.h", directory: "")
!379 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !374, file: !370, line: 181, baseType: !380, size: 112, offset: 16)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 112, elements: !381)
!381 = !{!382}
!382 = !DISubrange(count: 14)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ai_canonname", scope: !362, file: !357, line: 573, baseType: !44, size: 64, offset: 256)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "ai_next", scope: !362, file: !357, line: 574, baseType: !385, size: 64, offset: 320)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!387 = !DISubprogram(name: "freeaddrinfo", scope: !357, file: !357, line: 666, type: !388, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!388 = !DISubroutineType(types: !389)
!389 = !{null, !385}
!390 = !DISubprogram(name: "gai_strerror", scope: !357, file: !357, line: 669, type: !391, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!391 = !DISubroutineType(types: !392)
!392 = !{!46, !48}
!393 = !{!394, !348}
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(name: "hints", scope: !396, file: !351, line: 64, type: !362, isLocal: true, isDefinition: true)
!396 = distinct !DISubprogram(name: "canon_host_r", scope: !351, file: !351, line: 61, type: !354, scopeLine: 62, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !350, retainedNodes: !397)
!397 = !{!398, !399, !400, !401, !402}
!398 = !DILocalVariable(name: "host", arg: 1, scope: !396, file: !351, line: 61, type: !46)
!399 = !DILocalVariable(name: "cherror", arg: 2, scope: !396, file: !351, line: 61, type: !145)
!400 = !DILocalVariable(name: "retval", scope: !396, file: !351, line: 63, type: !44)
!401 = !DILocalVariable(name: "res", scope: !396, file: !351, line: 65, type: !385)
!402 = !DILocalVariable(name: "status", scope: !396, file: !351, line: 66, type: !48)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(name: "file_name", scope: !405, file: !406, line: 46, type: !46, isLocal: true, isDefinition: true)
!405 = distinct !DICompileUnit(language: DW_LANG_C99, file: !406, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !49, retainedTypes: !407, globals: !445, splitDebugInlining: false, nameTableKind: None)
!406 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!407 = !{!408, !40, !444, !151}
!408 = !DISubprogram(name: "close_stream", scope: !409, file: !409, line: 2, type: !410, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!409 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!410 = !DISubroutineType(types: !411)
!411 = !{!48, !412}
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !56, line: 49, size: 1728, elements: !414)
!414 = !{!415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !413, file: !56, line: 51, baseType: !48, size: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !413, file: !56, line: 54, baseType: !44, size: 64, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !413, file: !56, line: 55, baseType: !44, size: 64, offset: 128)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !413, file: !56, line: 56, baseType: !44, size: 64, offset: 192)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !413, file: !56, line: 57, baseType: !44, size: 64, offset: 256)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !413, file: !56, line: 58, baseType: !44, size: 64, offset: 320)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !413, file: !56, line: 59, baseType: !44, size: 64, offset: 384)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !413, file: !56, line: 60, baseType: !44, size: 64, offset: 448)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !413, file: !56, line: 61, baseType: !44, size: 64, offset: 512)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !413, file: !56, line: 64, baseType: !44, size: 64, offset: 576)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !413, file: !56, line: 65, baseType: !44, size: 64, offset: 640)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !413, file: !56, line: 66, baseType: !44, size: 64, offset: 704)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !413, file: !56, line: 68, baseType: !71, size: 64, offset: 768)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !413, file: !56, line: 70, baseType: !412, size: 64, offset: 832)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !413, file: !56, line: 72, baseType: !48, size: 32, offset: 896)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !413, file: !56, line: 73, baseType: !48, size: 32, offset: 928)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !413, file: !56, line: 74, baseType: !77, size: 64, offset: 960)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !413, file: !56, line: 77, baseType: !81, size: 16, offset: 1024)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !413, file: !56, line: 78, baseType: !83, size: 8, offset: 1040)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !413, file: !56, line: 79, baseType: !85, size: 8, offset: 1048)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !413, file: !56, line: 81, baseType: !89, size: 64, offset: 1088)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !413, file: !56, line: 89, baseType: !92, size: 64, offset: 1152)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !413, file: !56, line: 91, baseType: !94, size: 64, offset: 1216)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !413, file: !56, line: 92, baseType: !97, size: 64, offset: 1280)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !413, file: !56, line: 93, baseType: !412, size: 64, offset: 1344)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !413, file: !56, line: 94, baseType: !101, size: 64, offset: 1408)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !413, file: !56, line: 95, baseType: !103, size: 64, offset: 1472)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !413, file: !56, line: 96, baseType: !48, size: 32, offset: 1536)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !413, file: !56, line: 98, baseType: !108, size: 160, offset: 1568)
!444 = !DISubprogram(name: "quotearg_colon", scope: !6, file: !6, line: 391, type: !123, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!445 = !{!403, !446}
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !405, file: !406, line: 56, type: !203, isLocal: true, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "exit_failure", scope: !450, file: !451, line: 24, type: !453, isLocal: false, isDefinition: true)
!450 = distinct !DICompileUnit(language: DW_LANG_C99, file: !451, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !49, globals: !452, splitDebugInlining: false, nameTableKind: None)
!451 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!452 = !{!448}
!453 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !48)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(name: "program_name", scope: !456, file: !457, line: 33, type: !46, isLocal: false, isDefinition: true)
!456 = distinct !DICompileUnit(language: DW_LANG_C99, file: !457, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !49, retainedTypes: !458, globals: !494, splitDebugInlining: false, nameTableKind: None)
!457 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!458 = !{!101, !459, !44}
!459 = !DISubprogram(name: "fputs", scope: !51, file: !51, line: 626, type: !460, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!460 = !DISubroutineType(types: !461)
!461 = !{!48, !46, !462}
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !56, line: 49, size: 1728, elements: !464)
!464 = !{!465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !463, file: !56, line: 51, baseType: !48, size: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !463, file: !56, line: 54, baseType: !44, size: 64, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !463, file: !56, line: 55, baseType: !44, size: 64, offset: 128)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !463, file: !56, line: 56, baseType: !44, size: 64, offset: 192)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !463, file: !56, line: 57, baseType: !44, size: 64, offset: 256)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !463, file: !56, line: 58, baseType: !44, size: 64, offset: 320)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !463, file: !56, line: 59, baseType: !44, size: 64, offset: 384)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !463, file: !56, line: 60, baseType: !44, size: 64, offset: 448)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !463, file: !56, line: 61, baseType: !44, size: 64, offset: 512)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !463, file: !56, line: 64, baseType: !44, size: 64, offset: 576)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !463, file: !56, line: 65, baseType: !44, size: 64, offset: 640)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !463, file: !56, line: 66, baseType: !44, size: 64, offset: 704)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !463, file: !56, line: 68, baseType: !71, size: 64, offset: 768)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !463, file: !56, line: 70, baseType: !462, size: 64, offset: 832)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !463, file: !56, line: 72, baseType: !48, size: 32, offset: 896)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !463, file: !56, line: 73, baseType: !48, size: 32, offset: 928)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !463, file: !56, line: 74, baseType: !77, size: 64, offset: 960)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !463, file: !56, line: 77, baseType: !81, size: 16, offset: 1024)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !463, file: !56, line: 78, baseType: !83, size: 8, offset: 1040)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !463, file: !56, line: 79, baseType: !85, size: 8, offset: 1048)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !463, file: !56, line: 81, baseType: !89, size: 64, offset: 1088)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !463, file: !56, line: 89, baseType: !92, size: 64, offset: 1152)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !463, file: !56, line: 91, baseType: !94, size: 64, offset: 1216)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !463, file: !56, line: 92, baseType: !97, size: 64, offset: 1280)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !463, file: !56, line: 93, baseType: !462, size: 64, offset: 1344)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !463, file: !56, line: 94, baseType: !101, size: 64, offset: 1408)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !463, file: !56, line: 95, baseType: !103, size: 64, offset: 1472)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !463, file: !56, line: 96, baseType: !48, size: 32, offset: 1536)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !463, file: !56, line: 98, baseType: !108, size: 160, offset: 1568)
!494 = !{!454}
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !497, file: !498, line: 85, type: !586, isLocal: false, isDefinition: true)
!497 = distinct !DICompileUnit(language: DW_LANG_C99, file: !498, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !499, retainedTypes: !505, globals: !562, splitDebugInlining: false, nameTableKind: None)
!498 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!499 = !{!5, !500, !24}
!500 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, baseType: !7, size: 32, elements: !501)
!501 = !{!502, !503, !504}
!502 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!503 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!504 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!505 = !{!506, !509, !221, !524, !48, !81, !527, !103, !541, !545, !40, !551, !555, !44, !228, !226, !559}
!506 = !DISubprogram(name: "xmemdup", scope: !227, file: !227, line: 62, type: !507, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!507 = !DISubroutineType(types: !508)
!508 = !{!101, !268, !105}
!509 = !DISubprogram(name: "quotearg_alloc_mem", scope: !6, file: !6, line: 342, type: !510, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!510 = !DISubroutineType(types: !511)
!511 = !{!44, !46, !105, !158, !512}
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !514)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !498, line: 65, size: 448, elements: !515)
!515 = !{!516, !517, !518, !522, !523}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !514, file: !498, line: 68, baseType: !5, size: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !514, file: !498, line: 71, baseType: !48, size: 32, offset: 32)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !514, file: !498, line: 75, baseType: !519, size: 256, offset: 64)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !520)
!520 = !{!521}
!521 = !DISubrange(count: 8)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !514, file: !498, line: 78, baseType: !46, size: 64, offset: 320)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !514, file: !498, line: 81, baseType: !46, size: 64, offset: 384)
!524 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !6, file: !6, line: 408, type: !525, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!525 = !DISubroutineType(types: !526)
!526 = !{!44, !48, !46, !46, !46, !105}
!527 = !DISubprogram(name: "rpl_mbrtowc", scope: !528, file: !528, line: 717, type: !529, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!528 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!529 = !DISubroutineType(types: !530)
!530 = !{!105, !145, !46, !105, !531}
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !533, line: 13, size: 64, elements: !534)
!533 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!534 = !{!535, !536}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !532, file: !533, line: 15, baseType: !48, size: 32)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !532, file: !533, line: 20, baseType: !537, size: 32, offset: 32)
!537 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !532, file: !533, line: 16, size: 32, elements: !538)
!538 = !{!539, !540}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !537, file: !533, line: 18, baseType: !7, size: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !537, file: !533, line: 19, baseType: !173, size: 32)
!541 = !DISubprogram(name: "iswprint", scope: !542, file: !542, line: 120, type: !543, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!542 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!543 = !DISubroutineType(types: !544)
!544 = !{!48, !7}
!545 = !DISubprogram(name: "mbsinit", scope: !546, file: !546, line: 292, type: !547, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!546 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!547 = !DISubroutineType(types: !548)
!548 = !{!48, !549}
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !532)
!551 = !DISubprogram(name: "locale_charset", scope: !552, file: !552, line: 35, type: !553, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!552 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!553 = !DISubroutineType(types: !554)
!554 = !{!46}
!555 = !DISubprogram(name: "c_strcasecmp", scope: !556, file: !556, line: 42, type: !557, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!556 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!557 = !DISubroutineType(types: !558)
!558 = !{!48, !46, !46}
!559 = !DISubprogram(name: "xrealloc", scope: !227, file: !227, line: 59, type: !560, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!560 = !DISubroutineType(types: !561)
!561 = !{!101, !101, !105}
!562 = !{!495, !563, !569, !571, !573, !575, !582, !584}
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !497, file: !498, line: 101, type: !565, isLocal: false, isDefinition: true)
!565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !566, size: 320, elements: !567)
!566 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!567 = !{!568}
!568 = !DISubrange(count: 10)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !497, file: !498, line: 1052, type: !514, isLocal: false, isDefinition: true)
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !497, file: !498, line: 116, type: !514, isLocal: true, isDefinition: true)
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(name: "slot0", scope: !497, file: !498, line: 842, type: !178, isLocal: true, isDefinition: true)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(name: "slotvec", scope: !497, file: !498, line: 845, type: !577, isLocal: true, isDefinition: true)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !498, line: 834, size: 128, elements: !579)
!579 = !{!580, !581}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !578, file: !498, line: 836, baseType: !103, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !578, file: !498, line: 837, baseType: !44, size: 64, offset: 64)
!582 = !DIGlobalVariableExpression(var: !583, expr: !DIExpression())
!583 = distinct !DIGlobalVariable(name: "nslots", scope: !497, file: !498, line: 843, type: !48, isLocal: true, isDefinition: true)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(name: "slotvec0", scope: !497, file: !498, line: 844, type: !578, isLocal: true, isDefinition: true)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !587, size: 704, elements: !588)
!587 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!588 = !{!589}
!589 = !DISubrange(count: 11)
!590 = !DIGlobalVariableExpression(var: !591, expr: !DIExpression())
!591 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !592, file: !593, line: 26, type: !595, isLocal: false, isDefinition: true)
!592 = distinct !DICompileUnit(language: DW_LANG_C99, file: !593, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !49, globals: !594, splitDebugInlining: false, nameTableKind: None)
!593 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!594 = !{!590}
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 376, elements: !596)
!596 = !{!597}
!597 = !DISubrange(count: 47)
!598 = distinct !DICompileUnit(language: DW_LANG_C99, file: !599, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !49, retainedTypes: !600, splitDebugInlining: false, nameTableKind: None)
!599 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!600 = !{!601}
!601 = !DISubprogram(name: "setlocale_null_r", scope: !602, file: !602, line: 64, type: !603, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!602 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!603 = !DISubroutineType(types: !604)
!604 = !{!48, !48, !44, !105}
!605 = distinct !DICompileUnit(language: DW_LANG_C99, file: !606, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !49, retainedTypes: !607, splitDebugInlining: false, nameTableKind: None)
!606 = !DIFile(filename: "lib/imaxtostr.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!607 = !{!608}
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !609, line: 101, baseType: !610)
!609 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !78, line: 72, baseType: !79)
!611 = distinct !DICompileUnit(language: DW_LANG_C99, file: !612, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !49, retainedTypes: !613, splitDebugInlining: false, nameTableKind: None)
!612 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!613 = !{!101, !115}
!614 = distinct !DICompileUnit(language: DW_LANG_C99, file: !615, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !616, retainedTypes: !620, splitDebugInlining: false, nameTableKind: None)
!615 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!616 = !{!617}
!617 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !615, line: 40, baseType: !7, size: 32, elements: !618)
!618 = !{!619}
!619 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!620 = !{!40, !621, !101}
!621 = !DISubprogram(name: "fputs_unlocked", scope: !51, file: !51, line: 662, type: !622, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!622 = !DISubroutineType(types: !623)
!623 = !{!48, !46, !624}
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !56, line: 49, size: 1728, elements: !626)
!626 = !{!627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !625, file: !56, line: 51, baseType: !48, size: 32)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !625, file: !56, line: 54, baseType: !44, size: 64, offset: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !625, file: !56, line: 55, baseType: !44, size: 64, offset: 128)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !625, file: !56, line: 56, baseType: !44, size: 64, offset: 192)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !625, file: !56, line: 57, baseType: !44, size: 64, offset: 256)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !625, file: !56, line: 58, baseType: !44, size: 64, offset: 320)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !625, file: !56, line: 59, baseType: !44, size: 64, offset: 384)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !625, file: !56, line: 60, baseType: !44, size: 64, offset: 448)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !625, file: !56, line: 61, baseType: !44, size: 64, offset: 512)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !625, file: !56, line: 64, baseType: !44, size: 64, offset: 576)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !625, file: !56, line: 65, baseType: !44, size: 64, offset: 640)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !625, file: !56, line: 66, baseType: !44, size: 64, offset: 704)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !625, file: !56, line: 68, baseType: !71, size: 64, offset: 768)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !625, file: !56, line: 70, baseType: !624, size: 64, offset: 832)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !625, file: !56, line: 72, baseType: !48, size: 32, offset: 896)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !625, file: !56, line: 73, baseType: !48, size: 32, offset: 928)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !625, file: !56, line: 74, baseType: !77, size: 64, offset: 960)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !625, file: !56, line: 77, baseType: !81, size: 16, offset: 1024)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !625, file: !56, line: 78, baseType: !83, size: 8, offset: 1040)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !625, file: !56, line: 79, baseType: !85, size: 8, offset: 1048)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !625, file: !56, line: 81, baseType: !89, size: 64, offset: 1088)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !625, file: !56, line: 89, baseType: !92, size: 64, offset: 1152)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !625, file: !56, line: 91, baseType: !94, size: 64, offset: 1216)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !625, file: !56, line: 92, baseType: !97, size: 64, offset: 1280)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !625, file: !56, line: 93, baseType: !624, size: 64, offset: 1344)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !625, file: !56, line: 94, baseType: !101, size: 64, offset: 1408)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !625, file: !56, line: 95, baseType: !103, size: 64, offset: 1472)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !625, file: !56, line: 96, baseType: !48, size: 32, offset: 1536)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !625, file: !56, line: 98, baseType: !108, size: 160, offset: 1568)
!656 = distinct !DICompileUnit(language: DW_LANG_C99, file: !657, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !658, retainedTypes: !671, splitDebugInlining: false, nameTableKind: None)
!657 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!658 = !{!659}
!659 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !660, file: !227, line: 186, baseType: !7, size: 32, elements: !669)
!660 = distinct !DISubprogram(name: "x2nrealloc", scope: !227, file: !227, line: 174, type: !661, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !656, retainedNodes: !664)
!661 = !DISubroutineType(types: !662)
!662 = !{!101, !101, !663, !103}
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!664 = !{!665, !666, !667, !668}
!665 = !DILocalVariable(name: "p", arg: 1, scope: !660, file: !227, line: 174, type: !101)
!666 = !DILocalVariable(name: "pn", arg: 2, scope: !660, file: !227, line: 174, type: !663)
!667 = !DILocalVariable(name: "s", arg: 3, scope: !660, file: !227, line: 174, type: !103)
!668 = !DILocalVariable(name: "n", scope: !660, file: !227, line: 176, type: !103)
!669 = !{!670}
!670 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!671 = !{!103, !226, !228, !559, !44, !221, !101, !672, !675}
!672 = !DISubprogram(name: "xcalloc", scope: !227, file: !227, line: 57, type: !673, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!673 = !DISubroutineType(types: !674)
!674 = !{!101, !105, !105}
!675 = !DISubprogram(name: "rpl_calloc", scope: !676, file: !676, line: 688, type: !673, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!676 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!677 = distinct !DICompileUnit(language: DW_LANG_C99, file: !678, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !49, retainedTypes: !679, splitDebugInlining: false, nameTableKind: None)
!678 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!679 = !{!40, !151}
!680 = distinct !DICompileUnit(language: DW_LANG_C99, file: !681, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !49, retainedTypes: !682, splitDebugInlining: false, nameTableKind: None)
!681 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!682 = !{!101}
!683 = distinct !DICompileUnit(language: DW_LANG_C99, file: !684, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !49, retainedTypes: !685, splitDebugInlining: false, nameTableKind: None)
!684 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!685 = !{!686, !721, !722, !726}
!686 = !DISubprogram(name: "fileno", scope: !51, file: !51, line: 786, type: !687, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!687 = !DISubroutineType(types: !688)
!688 = !{!48, !689}
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !56, line: 49, size: 1728, elements: !691)
!691 = !{!692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !690, file: !56, line: 51, baseType: !48, size: 32)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !690, file: !56, line: 54, baseType: !44, size: 64, offset: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !690, file: !56, line: 55, baseType: !44, size: 64, offset: 128)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !690, file: !56, line: 56, baseType: !44, size: 64, offset: 192)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !690, file: !56, line: 57, baseType: !44, size: 64, offset: 256)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !690, file: !56, line: 58, baseType: !44, size: 64, offset: 320)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !690, file: !56, line: 59, baseType: !44, size: 64, offset: 384)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !690, file: !56, line: 60, baseType: !44, size: 64, offset: 448)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !690, file: !56, line: 61, baseType: !44, size: 64, offset: 512)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !690, file: !56, line: 64, baseType: !44, size: 64, offset: 576)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !690, file: !56, line: 65, baseType: !44, size: 64, offset: 640)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !690, file: !56, line: 66, baseType: !44, size: 64, offset: 704)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !690, file: !56, line: 68, baseType: !71, size: 64, offset: 768)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !690, file: !56, line: 70, baseType: !689, size: 64, offset: 832)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !690, file: !56, line: 72, baseType: !48, size: 32, offset: 896)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !690, file: !56, line: 73, baseType: !48, size: 32, offset: 928)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !690, file: !56, line: 74, baseType: !77, size: 64, offset: 960)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !690, file: !56, line: 77, baseType: !81, size: 16, offset: 1024)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !690, file: !56, line: 78, baseType: !83, size: 8, offset: 1040)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !690, file: !56, line: 79, baseType: !85, size: 8, offset: 1048)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !690, file: !56, line: 81, baseType: !89, size: 64, offset: 1088)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !690, file: !56, line: 89, baseType: !92, size: 64, offset: 1152)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !690, file: !56, line: 91, baseType: !94, size: 64, offset: 1216)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !690, file: !56, line: 92, baseType: !97, size: 64, offset: 1280)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !690, file: !56, line: 93, baseType: !689, size: 64, offset: 1344)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !690, file: !56, line: 94, baseType: !101, size: 64, offset: 1408)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !690, file: !56, line: 95, baseType: !103, size: 64, offset: 1472)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !690, file: !56, line: 96, baseType: !48, size: 32, offset: 1536)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !690, file: !56, line: 98, baseType: !108, size: 160, offset: 1568)
!721 = !DISubprogram(name: "fclose", scope: !51, file: !51, line: 213, type: !687, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!722 = !DISubprogram(name: "lseek", scope: !723, file: !723, line: 334, type: !724, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!723 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!724 = !DISubroutineType(types: !725)
!725 = !{!79, !48, !79, !48}
!726 = !DISubprogram(name: "rpl_fflush", scope: !271, file: !271, line: 718, type: !687, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!727 = distinct !DICompileUnit(language: DW_LANG_C99, file: !728, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !49, retainedTypes: !729, splitDebugInlining: false, nameTableKind: None)
!728 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!729 = !{!101, !730, !765}
!730 = !DISubprogram(name: "fflush", scope: !51, file: !51, line: 218, type: !731, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!731 = !DISubroutineType(types: !732)
!732 = !{!48, !733}
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !56, line: 49, size: 1728, elements: !735)
!735 = !{!736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !734, file: !56, line: 51, baseType: !48, size: 32)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !734, file: !56, line: 54, baseType: !44, size: 64, offset: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !734, file: !56, line: 55, baseType: !44, size: 64, offset: 128)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !734, file: !56, line: 56, baseType: !44, size: 64, offset: 192)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !734, file: !56, line: 57, baseType: !44, size: 64, offset: 256)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !734, file: !56, line: 58, baseType: !44, size: 64, offset: 320)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !734, file: !56, line: 59, baseType: !44, size: 64, offset: 384)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !734, file: !56, line: 60, baseType: !44, size: 64, offset: 448)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !734, file: !56, line: 61, baseType: !44, size: 64, offset: 512)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !734, file: !56, line: 64, baseType: !44, size: 64, offset: 576)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !734, file: !56, line: 65, baseType: !44, size: 64, offset: 640)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !734, file: !56, line: 66, baseType: !44, size: 64, offset: 704)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !734, file: !56, line: 68, baseType: !71, size: 64, offset: 768)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !734, file: !56, line: 70, baseType: !733, size: 64, offset: 832)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !734, file: !56, line: 72, baseType: !48, size: 32, offset: 896)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !734, file: !56, line: 73, baseType: !48, size: 32, offset: 928)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !734, file: !56, line: 74, baseType: !77, size: 64, offset: 960)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !734, file: !56, line: 77, baseType: !81, size: 16, offset: 1024)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !734, file: !56, line: 78, baseType: !83, size: 8, offset: 1040)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !734, file: !56, line: 79, baseType: !85, size: 8, offset: 1048)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !734, file: !56, line: 81, baseType: !89, size: 64, offset: 1088)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !734, file: !56, line: 89, baseType: !92, size: 64, offset: 1152)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !734, file: !56, line: 91, baseType: !94, size: 64, offset: 1216)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !734, file: !56, line: 92, baseType: !97, size: 64, offset: 1280)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !734, file: !56, line: 93, baseType: !733, size: 64, offset: 1344)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !734, file: !56, line: 94, baseType: !101, size: 64, offset: 1408)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !734, file: !56, line: 95, baseType: !103, size: 64, offset: 1472)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !734, file: !56, line: 96, baseType: !48, size: 32, offset: 1536)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !734, file: !56, line: 98, baseType: !108, size: 160, offset: 1568)
!765 = !DISubprogram(name: "rpl_fseeko", scope: !271, file: !271, line: 1034, type: !766, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!766 = !DISubroutineType(types: !767)
!767 = !{!48, !733, !79, !48}
!768 = distinct !DICompileUnit(language: DW_LANG_C99, file: !769, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !49, retainedTypes: !770, splitDebugInlining: false, nameTableKind: None)
!769 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!770 = !{!101, !771, !722, !806}
!771 = !DISubprogram(name: "fileno", scope: !51, file: !51, line: 786, type: !772, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!772 = !DISubroutineType(types: !773)
!773 = !{!48, !774}
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !56, line: 49, size: 1728, elements: !776)
!776 = !{!777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !775, file: !56, line: 51, baseType: !48, size: 32)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !775, file: !56, line: 54, baseType: !44, size: 64, offset: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !775, file: !56, line: 55, baseType: !44, size: 64, offset: 128)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !775, file: !56, line: 56, baseType: !44, size: 64, offset: 192)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !775, file: !56, line: 57, baseType: !44, size: 64, offset: 256)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !775, file: !56, line: 58, baseType: !44, size: 64, offset: 320)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !775, file: !56, line: 59, baseType: !44, size: 64, offset: 384)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !775, file: !56, line: 60, baseType: !44, size: 64, offset: 448)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !775, file: !56, line: 61, baseType: !44, size: 64, offset: 512)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !775, file: !56, line: 64, baseType: !44, size: 64, offset: 576)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !775, file: !56, line: 65, baseType: !44, size: 64, offset: 640)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !775, file: !56, line: 66, baseType: !44, size: 64, offset: 704)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !775, file: !56, line: 68, baseType: !71, size: 64, offset: 768)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !775, file: !56, line: 70, baseType: !774, size: 64, offset: 832)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !775, file: !56, line: 72, baseType: !48, size: 32, offset: 896)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !775, file: !56, line: 73, baseType: !48, size: 32, offset: 928)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !775, file: !56, line: 74, baseType: !77, size: 64, offset: 960)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !775, file: !56, line: 77, baseType: !81, size: 16, offset: 1024)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !775, file: !56, line: 78, baseType: !83, size: 8, offset: 1040)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !775, file: !56, line: 79, baseType: !85, size: 8, offset: 1048)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !775, file: !56, line: 81, baseType: !89, size: 64, offset: 1088)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !775, file: !56, line: 89, baseType: !92, size: 64, offset: 1152)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !775, file: !56, line: 91, baseType: !94, size: 64, offset: 1216)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !775, file: !56, line: 92, baseType: !97, size: 64, offset: 1280)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !775, file: !56, line: 93, baseType: !774, size: 64, offset: 1344)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !775, file: !56, line: 94, baseType: !101, size: 64, offset: 1408)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !775, file: !56, line: 95, baseType: !103, size: 64, offset: 1472)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !775, file: !56, line: 96, baseType: !48, size: 32, offset: 1536)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !775, file: !56, line: 98, baseType: !108, size: 160, offset: 1568)
!806 = !DISubprogram(name: "fseeko", scope: !51, file: !51, line: 707, type: !807, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!807 = !DISubroutineType(types: !808)
!808 = !{!48, !774, !79, !48}
!809 = distinct !DICompileUnit(language: DW_LANG_C99, file: !810, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !49, retainedTypes: !811, splitDebugInlining: false, nameTableKind: None)
!810 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!811 = !{!812, !103, !199}
!812 = !DISubprogram(name: "mbrtowc", scope: !546, file: !546, line: 296, type: !813, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!813 = !DISubroutineType(types: !814)
!814 = !{!105, !145, !46, !105, !815}
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !533, line: 13, size: 64, elements: !817)
!817 = !{!818, !819}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !816, file: !533, line: 15, baseType: !48, size: 32)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !816, file: !533, line: 20, baseType: !820, size: 32, offset: 32)
!820 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !816, file: !533, line: 16, size: 32, elements: !821)
!821 = !{!822, !823}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !820, file: !533, line: 18, baseType: !7, size: 32)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !820, file: !533, line: 19, baseType: !173, size: 32)
!824 = distinct !DICompileUnit(language: DW_LANG_C99, file: !825, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !826, retainedTypes: !838, splitDebugInlining: false, nameTableKind: None)
!825 = !DIFile(filename: "lib/readutmp.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!826 = !{!827, !831}
!827 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 208, baseType: !7, size: 32, elements: !828)
!828 = !{!829, !830}
!829 = !DIEnumerator(name: "READ_UTMP_CHECK_PIDS", value: 1, isUnsigned: true)
!830 = !DIEnumerator(name: "READ_UTMP_USER_PROCESS", value: 2, isUnsigned: true)
!831 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !832, file: !227, line: 186, baseType: !7, size: 32, elements: !669)
!832 = distinct !DISubprogram(name: "x2nrealloc", scope: !227, file: !227, line: 174, type: !661, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !824, retainedNodes: !833)
!833 = !{!834, !835, !836, !837}
!834 = !DILocalVariable(name: "p", arg: 1, scope: !832, file: !227, line: 174, type: !101)
!835 = !DILocalVariable(name: "pn", arg: 2, scope: !832, file: !227, line: 174, type: !663)
!836 = !DILocalVariable(name: "s", arg: 3, scope: !832, file: !227, line: 174, type: !103)
!837 = !DILocalVariable(name: "n", scope: !832, file: !227, line: 176, type: !103)
!838 = !{!228, !44, !839, !843, !844, !101, !869, !870, !103, !226, !559}
!839 = !DISubprogram(name: "utmpxname", scope: !840, file: !840, line: 93, type: !841, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!840 = !DIFile(filename: "/usr/include/utmpx.h", directory: "")
!841 = !DISubroutineType(types: !842)
!842 = !{!48, !46}
!843 = !DISubprogram(name: "setutxent", scope: !840, file: !840, line: 53, type: !130, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!844 = !DISubprogram(name: "getutxent", scope: !840, file: !840, line: 65, type: !845, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!845 = !DISubroutineType(types: !846)
!846 = !{!847}
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utmpx", file: !162, line: 55, size: 3072, elements: !849)
!849 = !{!850, !851, !852, !853, !854, !855, !856, !861, !862, !867, !868}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !848, file: !162, line: 57, baseType: !165, size: 16)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !848, file: !162, line: 58, baseType: !167, size: 32, offset: 32)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !848, file: !162, line: 59, baseType: !169, size: 256, offset: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !848, file: !162, line: 61, baseType: !173, size: 32, offset: 320)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !848, file: !162, line: 63, baseType: !169, size: 256, offset: 352)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !848, file: !162, line: 65, baseType: !178, size: 2048, offset: 608)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !848, file: !162, line: 67, baseType: !857, size: 32, offset: 2656)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exit_status", file: !162, line: 42, size: 32, elements: !858)
!858 = !{!859, !860}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !857, file: !162, line: 45, baseType: !165, size: 16)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !857, file: !162, line: 46, baseType: !165, size: 16, offset: 16)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !848, file: !162, line: 74, baseType: !187, size: 32, offset: 2688)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "ut_tv", scope: !848, file: !162, line: 79, baseType: !863, size: 64, offset: 2720)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !848, file: !162, line: 75, size: 64, elements: !864)
!864 = !{!865, !866}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !863, file: !162, line: 77, baseType: !187, size: 32)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !863, file: !162, line: 78, baseType: !187, size: 32, offset: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "ut_addr_v6", scope: !848, file: !162, line: 84, baseType: !194, size: 128, offset: 2784)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !848, file: !162, line: 85, baseType: !108, size: 160, offset: 2912)
!869 = !DISubprogram(name: "endutxent", scope: !840, file: !840, line: 59, type: !130, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!870 = !DISubprogram(name: "kill", scope: !871, file: !871, line: 112, type: !872, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!871 = !DIFile(filename: "/usr/include/signal.h", directory: "")
!872 = !DISubroutineType(types: !873)
!873 = !{!48, !48, !48}
!874 = distinct !DICompileUnit(language: DW_LANG_C99, file: !875, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !49, retainedTypes: !876, splitDebugInlining: false, nameTableKind: None)
!875 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!876 = !{!877}
!877 = !DISubprogram(name: "rpl_fclose", scope: !271, file: !271, line: 672, type: !878, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !49)
!878 = !DISubroutineType(types: !879)
!879 = !{!48, !880}
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !56, line: 49, size: 1728, elements: !882)
!882 = !{!883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !881, file: !56, line: 51, baseType: !48, size: 32)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !881, file: !56, line: 54, baseType: !44, size: 64, offset: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !881, file: !56, line: 55, baseType: !44, size: 64, offset: 128)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !881, file: !56, line: 56, baseType: !44, size: 64, offset: 192)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !881, file: !56, line: 57, baseType: !44, size: 64, offset: 256)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !881, file: !56, line: 58, baseType: !44, size: 64, offset: 320)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !881, file: !56, line: 59, baseType: !44, size: 64, offset: 384)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !881, file: !56, line: 60, baseType: !44, size: 64, offset: 448)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !881, file: !56, line: 61, baseType: !44, size: 64, offset: 512)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !881, file: !56, line: 64, baseType: !44, size: 64, offset: 576)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !881, file: !56, line: 65, baseType: !44, size: 64, offset: 640)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !881, file: !56, line: 66, baseType: !44, size: 64, offset: 704)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !881, file: !56, line: 68, baseType: !71, size: 64, offset: 768)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !881, file: !56, line: 70, baseType: !880, size: 64, offset: 832)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !881, file: !56, line: 72, baseType: !48, size: 32, offset: 896)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !881, file: !56, line: 73, baseType: !48, size: 32, offset: 928)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !881, file: !56, line: 74, baseType: !77, size: 64, offset: 960)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !881, file: !56, line: 77, baseType: !81, size: 16, offset: 1024)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !881, file: !56, line: 78, baseType: !83, size: 8, offset: 1040)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !881, file: !56, line: 79, baseType: !85, size: 8, offset: 1048)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !881, file: !56, line: 81, baseType: !89, size: 64, offset: 1088)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !881, file: !56, line: 89, baseType: !92, size: 64, offset: 1152)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !881, file: !56, line: 91, baseType: !94, size: 64, offset: 1216)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !881, file: !56, line: 92, baseType: !97, size: 64, offset: 1280)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !881, file: !56, line: 93, baseType: !880, size: 64, offset: 1344)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !881, file: !56, line: 94, baseType: !101, size: 64, offset: 1408)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !881, file: !56, line: 95, baseType: !103, size: 64, offset: 1472)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !881, file: !56, line: 96, baseType: !48, size: 32, offset: 1536)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !881, file: !56, line: 98, baseType: !108, size: 160, offset: 1568)
!912 = distinct !DICompileUnit(language: DW_LANG_C99, file: !913, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !914, retainedTypes: !1301, splitDebugInlining: false, nameTableKind: None)
!913 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!914 = !{!915}
!915 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !916, line: 41, baseType: !7, size: 32, elements: !917)
!916 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!917 = !{!918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300}
!918 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
