source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__exit_status = type { i16, i16 }
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.addrinfo = type { i32, i32, i32, i32, i32, %struct.sockaddr*, i8*, %struct.addrinfo* }
%struct.anon = type { i32, i32 }
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.passwd = type { i8*, i8*, i32, i32, i8*, i8*, i8* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.sockaddr = type { i16, [14 x i8] }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }
%struct.utmpx = type { i16, i32, [32 x i8], [4 x i8], [32 x i8], [256 x i8], %struct.__exit_status, i32, %struct.anon, [4 x i32], [20 x i8] }

!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!43 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!44 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !46, line: 46, baseType: !47)
!46 = !DIFile(filename: "/usr/lib/clang/12.0.1/include/stddef.h", directory: "")
!47 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!48 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!51 = !{!0, !52, !55, !57, !59, !61, !63, !65, !67, !69, !71, !73, !92, !97}
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(name: "do_short_format", scope: !2, file: !3, line: 63, type: !54, isLocal: true, isDefinition: true)
!54 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!55 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression())
!56 = distinct !DIGlobalVariable(name: "include_heading", scope: !2, file: !3, line: 47, type: !54, isLocal: true, isDefinition: true)
!57 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression())
!58 = distinct !DIGlobalVariable(name: "include_fullname", scope: !2, file: !3, line: 50, type: !54, isLocal: true, isDefinition: true)
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(name: "include_where", scope: !2, file: !3, line: 67, type: !54, isLocal: true, isDefinition: true)
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!62 = distinct !DIGlobalVariable(name: "include_idle", scope: !2, file: !3, line: 44, type: !54, isLocal: true, isDefinition: true)
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "include_project", scope: !2, file: !3, line: 53, type: !54, isLocal: true, isDefinition: true)
!65 = !DIGlobalVariableExpression(var: !66, expr: !DIExpression())
!66 = distinct !DIGlobalVariable(name: "include_plan", scope: !2, file: !3, line: 56, type: !54, isLocal: true, isDefinition: true)
!67 = !DIGlobalVariableExpression(var: !68, expr: !DIExpression())
!68 = distinct !DIGlobalVariable(name: "include_home_and_shell", scope: !2, file: !3, line: 60, type: !54, isLocal: true, isDefinition: true)
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(name: "time_format", scope: !2, file: !3, line: 72, type: !49, isLocal: true, isDefinition: true)
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(name: "time_format_width", scope: !2, file: !3, line: 73, type: !44, isLocal: true, isDefinition: true)
!73 = !DIGlobalVariableExpression(var: !74, expr: !DIExpression())
!74 = distinct !DIGlobalVariable(name: "now", scope: !75, file: !3, line: 149, type: !78, isLocal: true, isDefinition: true)
!75 = distinct !DISubprogram(name: "idle_string", scope: !3, file: !3, line: 147, type: !76, scopeLine: 148, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !83)
!76 = !DISubroutineType(types: !77)
!77 = !{!49, !78}
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !79, line: 7, baseType: !80)
!79 = !DIFile(filename: "/usr/include/bits/types/time_t.h", directory: "")
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !81, line: 160, baseType: !82)
!81 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!82 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!83 = !{!84, !85, !86, !89, !90}
!84 = !DILocalVariable(name: "when", arg: 1, scope: !75, file: !3, line: 147, type: !78)
!85 = !DILocalVariable(name: "seconds_idle", scope: !75, file: !3, line: 151, type: !78)
!86 = !DILocalVariable(name: "hours", scope: !87, file: !3, line: 161, type: !44)
!87 = distinct !DILexicalBlock(scope: !88, file: !3, line: 160, column: 5)
!88 = distinct !DILexicalBlock(scope: !75, file: !3, line: 159, column: 7)
!89 = !DILocalVariable(name: "minutes", scope: !87, file: !3, line: 162, type: !44)
!90 = !DILocalVariable(name: "days", scope: !91, file: !3, line: 167, type: !47)
!91 = distinct !DILexicalBlock(scope: !88, file: !3, line: 166, column: 5)
!92 = !DIGlobalVariableExpression(var: !93, expr: !DIExpression())
!93 = distinct !DIGlobalVariable(name: "buf", scope: !75, file: !3, line: 150, type: !94, isLocal: true, isDefinition: true)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 176, elements: !95)
!95 = !{!96}
!96 = !DISubrange(count: 22)
!97 = !DIGlobalVariableExpression(var: !98, expr: !DIExpression())
!98 = distinct !DIGlobalVariable(name: "buf", scope: !99, file: !3, line: 177, type: !162, isLocal: true, isDefinition: true)
!99 = distinct !DISubprogram(name: "time_string", scope: !3, file: !3, line: 175, type: !100, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !143)
!100 = !DISubroutineType(types: !101)
!101 = !{!49, !102}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRUCT_UTMP", file: !21, line: 146, baseType: !105)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utmpx", file: !106, line: 55, size: 3072, elements: !107)
!106 = !DIFile(filename: "/usr/include/bits/utmpx.h", directory: "")
!107 = !{!108, !110, !112, !116, !120, !121, !125, !130, !132, !137, !139}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !105, file: !106, line: 57, baseType: !109, size: 16)
!109 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !105, file: !106, line: 58, baseType: !111, size: 32, offset: 32)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !81, line: 154, baseType: !44)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !105, file: !106, line: 59, baseType: !113, size: 256, offset: 64)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 256, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !105, file: !106, line: 61, baseType: !117, size: 32, offset: 320)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 32, elements: !118)
!118 = !{!119}
!119 = !DISubrange(count: 4)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !105, file: !106, line: 63, baseType: !113, size: 256, offset: 352)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !105, file: !106, line: 65, baseType: !122, size: 2048, offset: 608)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 2048, elements: !123)
!123 = !{!124}
!124 = !DISubrange(count: 256)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !105, file: !106, line: 67, baseType: !126, size: 32, offset: 2656)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exit_status", file: !106, line: 42, size: 32, elements: !127)
!127 = !{!128, !129}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !126, file: !106, line: 45, baseType: !109, size: 16)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !126, file: !106, line: 46, baseType: !109, size: 16, offset: 16)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !105, file: !106, line: 74, baseType: !131, size: 32, offset: 2688)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !81, line: 41, baseType: !44)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "ut_tv", scope: !105, file: !106, line: 79, baseType: !133, size: 64, offset: 2720)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !105, file: !106, line: 75, size: 64, elements: !134)
!134 = !{!135, !136}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !133, file: !106, line: 77, baseType: !131, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !133, file: !106, line: 78, baseType: !131, size: 32, offset: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "ut_addr_v6", scope: !105, file: !106, line: 84, baseType: !138, size: 128, offset: 2784)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 128, elements: !118)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !105, file: !106, line: 85, baseType: !140, size: 160, offset: 2912)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 160, elements: !141)
!141 = !{!142}
!142 = !DISubrange(count: 20)
!143 = !{!144, !145, !146}
!144 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !99, file: !3, line: 175, type: !102)
!145 = !DILocalVariable(name: "t", scope: !99, file: !3, line: 185, type: !78)
!146 = !DILocalVariable(name: "tmp", scope: !99, file: !3, line: 186, type: !147)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !149, line: 7, size: 448, elements: !150)
!149 = !DIFile(filename: "/usr/include/bits/types/struct_tm.h", directory: "")
!150 = !{!151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !148, file: !149, line: 9, baseType: !44, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !148, file: !149, line: 10, baseType: !44, size: 32, offset: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !148, file: !149, line: 11, baseType: !44, size: 32, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !148, file: !149, line: 12, baseType: !44, size: 32, offset: 96)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !148, file: !149, line: 13, baseType: !44, size: 32, offset: 128)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !148, file: !149, line: 14, baseType: !44, size: 32, offset: 160)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !148, file: !149, line: 15, baseType: !44, size: 32, offset: 192)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !148, file: !149, line: 16, baseType: !44, size: 32, offset: 224)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !148, file: !149, line: 17, baseType: !44, size: 32, offset: 256)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !148, file: !149, line: 20, baseType: !82, size: 64, offset: 320)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !148, file: !149, line: 21, baseType: !49, size: 64, offset: 384)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 264, elements: !163)
!163 = !{!164}
!164 = !DISubrange(count: 33)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 768, elements: !175)
!166 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !167)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !168, line: 50, size: 256, elements: !169)
!168 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!169 = !{!170, !171, !172, !174}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !167, file: !168, line: 52, baseType: !49, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !167, file: !168, line: 55, baseType: !44, size: 32, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !167, file: !168, line: 56, baseType: !173, size: 64, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !167, file: !168, line: 57, baseType: !44, size: 32, offset: 192)
!175 = !{!176}
!176 = !DISubrange(count: 3)
!177 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!178 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!179 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!180 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!181 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!182 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!183 = !DIGlobalVariableExpression(var: !66, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!184 = !DIGlobalVariableExpression(var: !68, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "Version", scope: !187, file: !188, line: 2, type: !49, isDefinition: true)
!187 = distinct !DICompileUnit(language: DW_LANG_C99, file: !188, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !189, globals: !190, nameTableKind: None)
!188 = !DIFile(filename: "src/version.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!189 = !{}
!190 = !{!185}
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(name: "last_cherror", scope: !193, file: !194, line: 28, type: !44, isLocal: true, isDefinition: true)
!193 = distinct !DICompileUnit(language: DW_LANG_C99, file: !194, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !189, globals: !195, nameTableKind: None)
!194 = !DIFile(filename: "lib/canon-host.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!195 = !{!196, !191}
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "hints", scope: !198, file: !194, line: 64, type: !207, isLocal: true, isDefinition: true)
!198 = distinct !DISubprogram(name: "canon_host_r", scope: !194, file: !194, line: 61, type: !199, scopeLine: 62, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !193, retainedNodes: !201)
!199 = !DISubroutineType(types: !200)
!200 = !{!40, !49, !173}
!201 = !{!202, !203, !204, !205, !231}
!202 = !DILocalVariable(name: "host", arg: 1, scope: !198, file: !194, line: 61, type: !49)
!203 = !DILocalVariable(name: "cherror", arg: 2, scope: !198, file: !194, line: 61, type: !173)
!204 = !DILocalVariable(name: "retval", scope: !198, file: !194, line: 63, type: !40)
!205 = !DILocalVariable(name: "res", scope: !198, file: !194, line: 65, type: !206)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "addrinfo", file: !208, line: 565, size: 384, elements: !209)
!208 = !DIFile(filename: "/usr/include/netdb.h", directory: "")
!209 = !{!210, !211, !212, !213, !214, !218, !229, !230}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "ai_flags", scope: !207, file: !208, line: 567, baseType: !44, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "ai_family", scope: !207, file: !208, line: 568, baseType: !44, size: 32, offset: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "ai_socktype", scope: !207, file: !208, line: 569, baseType: !44, size: 32, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "ai_protocol", scope: !207, file: !208, line: 570, baseType: !44, size: 32, offset: 96)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !207, file: !208, line: 571, baseType: !215, size: 32, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !216, line: 33, baseType: !217)
!216 = !DIFile(filename: "/usr/include/bits/socket.h", directory: "")
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !81, line: 210, baseType: !7)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr", scope: !207, file: !208, line: 572, baseType: !219, size: 64, offset: 192)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !216, line: 178, size: 128, elements: !221)
!221 = !{!222, !225}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !220, file: !216, line: 180, baseType: !223, size: 16)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !224, line: 28, baseType: !48)
!224 = !DIFile(filename: "/usr/include/bits/sockaddr.h", directory: "")
!225 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !220, file: !216, line: 181, baseType: !226, size: 112, offset: 16)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 112, elements: !227)
!227 = !{!228}
!228 = !DISubrange(count: 14)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "ai_canonname", scope: !207, file: !208, line: 573, baseType: !40, size: 64, offset: 256)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "ai_next", scope: !207, file: !208, line: 574, baseType: !206, size: 64, offset: 320)
!231 = !DILocalVariable(name: "status", scope: !198, file: !194, line: 66, type: !44)
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(name: "file_name", scope: !234, file: !235, line: 46, type: !49, isLocal: true, isDefinition: true)
!234 = distinct !DICompileUnit(language: DW_LANG_C99, file: !235, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !189, globals: !236, nameTableKind: None)
!235 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!236 = !{!232, !237}
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !234, file: !235, line: 56, type: !54, isLocal: true, isDefinition: true)
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(name: "exit_failure", scope: !241, file: !242, line: 24, type: !244, isDefinition: true)
!241 = distinct !DICompileUnit(language: DW_LANG_C99, file: !242, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !189, globals: !243, nameTableKind: None)
!242 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!243 = !{!239}
!244 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !44)
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(name: "program_name", scope: !247, file: !248, line: 33, type: !49, isDefinition: true)
!247 = distinct !DICompileUnit(language: DW_LANG_C99, file: !248, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !189, retainedTypes: !249, globals: !250, nameTableKind: None)
!248 = !DIFile(filename: "lib/progname.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!249 = !{!42, !40}
!250 = !{!245}
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !253, file: !254, line: 85, type: !296, isDefinition: true)
!253 = distinct !DICompileUnit(language: DW_LANG_C99, file: !254, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !255, retainedTypes: !261, globals: !262, nameTableKind: None)
!254 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!255 = !{!5, !256, !24}
!256 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, baseType: !7, size: 32, elements: !257)
!257 = !{!258, !259, !260}
!258 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!259 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!260 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!261 = !{!44, !48, !45, !40}
!262 = !{!251, !263, !269, !281, !283, !285, !292, !294}
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !253, file: !254, line: 101, type: !265, isDefinition: true)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 320, elements: !267)
!266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!267 = !{!268}
!268 = !DISubrange(count: 10)
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !253, file: !254, line: 1052, type: !271, isDefinition: true)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !254, line: 65, size: 448, elements: !272)
!272 = !{!273, !274, !275, !279, !280}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !271, file: !254, line: 68, baseType: !5, size: 32)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !271, file: !254, line: 71, baseType: !44, size: 32, offset: 32)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !271, file: !254, line: 75, baseType: !276, size: 256, offset: 64)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !277)
!277 = !{!278}
!278 = !DISubrange(count: 8)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !271, file: !254, line: 78, baseType: !49, size: 64, offset: 320)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !271, file: !254, line: 81, baseType: !49, size: 64, offset: 384)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !253, file: !254, line: 116, type: !271, isLocal: true, isDefinition: true)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(name: "slot0", scope: !253, file: !254, line: 842, type: !122, isLocal: true, isDefinition: true)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(name: "slotvec", scope: !253, file: !254, line: 845, type: !287, isLocal: true, isDefinition: true)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !254, line: 834, size: 128, elements: !289)
!289 = !{!290, !291}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !288, file: !254, line: 836, baseType: !45, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !288, file: !254, line: 837, baseType: !40, size: 64, offset: 64)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(name: "nslots", scope: !253, file: !254, line: 843, type: !44, isLocal: true, isDefinition: true)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(name: "slotvec0", scope: !253, file: !254, line: 844, type: !288, isLocal: true, isDefinition: true)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !297, size: 704, elements: !298)
!297 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!298 = !{!299}
!299 = !DISubrange(count: 11)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !302, file: !303, line: 26, type: !305, isDefinition: true)
!302 = distinct !DICompileUnit(language: DW_LANG_C99, file: !303, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !189, globals: !304, nameTableKind: None)
!303 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!304 = !{!300}
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 376, elements: !306)
!306 = !{!307}
!307 = !DISubrange(count: 47)
!308 = distinct !DICompileUnit(language: DW_LANG_C99, file: !309, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !189, nameTableKind: None)
!309 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!310 = distinct !DICompileUnit(language: DW_LANG_C99, file: !311, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !189, retainedTypes: !312, nameTableKind: None)
!311 = !DIFile(filename: "lib/imaxtostr.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!312 = !{!313}
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !314, line: 101, baseType: !315)
!314 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !81, line: 72, baseType: !82)
!316 = distinct !DICompileUnit(language: DW_LANG_C99, file: !317, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !189, retainedTypes: !318, nameTableKind: None)
!317 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!318 = !{!42}
!319 = distinct !DICompileUnit(language: DW_LANG_C99, file: !320, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !321, retainedTypes: !318, nameTableKind: None)
!320 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!321 = !{!322}
!322 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !320, line: 40, baseType: !7, size: 32, elements: !323)
!323 = !{!324}
!324 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!325 = distinct !DICompileUnit(language: DW_LANG_C99, file: !326, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !327, retainedTypes: !341, nameTableKind: None)
!326 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!327 = !{!328}
!328 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !330, file: !329, line: 186, baseType: !7, size: 32, elements: !339)
!329 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!330 = distinct !DISubprogram(name: "x2nrealloc", scope: !329, file: !329, line: 174, type: !331, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !325, retainedNodes: !334)
!331 = !DISubroutineType(types: !332)
!332 = !{!42, !42, !333, !45}
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!334 = !{!335, !336, !337, !338}
!335 = !DILocalVariable(name: "p", arg: 1, scope: !330, file: !329, line: 174, type: !42)
!336 = !DILocalVariable(name: "pn", arg: 2, scope: !330, file: !329, line: 174, type: !333)
!337 = !DILocalVariable(name: "s", arg: 3, scope: !330, file: !329, line: 174, type: !45)
!338 = !DILocalVariable(name: "n", scope: !330, file: !329, line: 176, type: !45)
!339 = !{!340}
!340 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!341 = !{!45, !40, !42}
!342 = distinct !DICompileUnit(language: DW_LANG_C99, file: !343, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !189, nameTableKind: None)
!343 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!344 = distinct !DICompileUnit(language: DW_LANG_C99, file: !345, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !189, retainedTypes: !318, nameTableKind: None)
!345 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!346 = distinct !DICompileUnit(language: DW_LANG_C99, file: !347, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !189, nameTableKind: None)
!347 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!348 = distinct !DICompileUnit(language: DW_LANG_C99, file: !349, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !189, retainedTypes: !318, nameTableKind: None)
!349 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!350 = distinct !DICompileUnit(language: DW_LANG_C99, file: !351, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !189, retainedTypes: !318, nameTableKind: None)
!351 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!352 = distinct !DICompileUnit(language: DW_LANG_C99, file: !353, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !189, retainedTypes: !354, nameTableKind: None)
!353 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!354 = !{!45}
!355 = distinct !DICompileUnit(language: DW_LANG_C99, file: !356, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !357, retainedTypes: !369, nameTableKind: None)
!356 = !DIFile(filename: "lib/readutmp.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!357 = !{!358, !362}
!358 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 208, baseType: !7, size: 32, elements: !359)
!359 = !{!360, !361}
!360 = !DIEnumerator(name: "READ_UTMP_CHECK_PIDS", value: 1, isUnsigned: true)
!361 = !DIEnumerator(name: "READ_UTMP_USER_PROCESS", value: 2, isUnsigned: true)
!362 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !363, file: !329, line: 186, baseType: !7, size: 32, elements: !339)
!363 = distinct !DISubprogram(name: "x2nrealloc", scope: !329, file: !329, line: 174, type: !331, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !355, retainedNodes: !364)
!364 = !{!365, !366, !367, !368}
!365 = !DILocalVariable(name: "p", arg: 1, scope: !363, file: !329, line: 174, type: !42)
!366 = !DILocalVariable(name: "pn", arg: 2, scope: !363, file: !329, line: 174, type: !333)
!367 = !DILocalVariable(name: "s", arg: 3, scope: !363, file: !329, line: 174, type: !45)
!368 = !DILocalVariable(name: "n", scope: !363, file: !329, line: 176, type: !45)
!369 = !{!40, !42, !45}
!370 = distinct !DICompileUnit(language: DW_LANG_C99, file: !371, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !189, nameTableKind: None)
!371 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!372 = distinct !DICompileUnit(language: DW_LANG_C99, file: !373, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !374, retainedTypes: !318, nameTableKind: None)
!373 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!374 = !{!375}
!375 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !376, line: 41, baseType: !7, size: 32, elements: !377)
!376 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!377 = !{!378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760}
!378 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!379 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!380 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!381 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!382 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!383 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!384 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!385 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!386 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!387 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!388 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!389 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!390 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!391 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!392 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!393 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!394 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!395 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!396 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!397 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!398 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!399 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!400 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!401 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!402 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!403 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!404 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!405 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!406 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!407 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!408 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!409 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!410 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!411 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!412 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!413 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!414 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!415 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!416 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!417 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!418 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!419 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!420 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!421 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!422 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!423 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!424 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!425 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!426 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!427 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!428 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!429 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!430 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!431 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!432 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!433 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!434 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!435 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!436 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!437 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!438 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!439 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!440 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!441 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!442 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!443 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!444 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!445 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!446 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!447 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!448 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!449 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!450 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!451 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!452 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!453 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!454 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!455 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!456 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!457 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!458 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!459 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!460 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!461 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!462 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!463 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!464 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!465 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!466 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!467 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!468 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!469 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!470 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!471 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!472 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!473 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!474 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!475 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!476 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!477 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!478 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!479 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!480 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!481 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!482 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!483 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!484 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!485 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!486 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!487 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!488 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!489 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!490 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!491 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!492 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!493 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!494 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!495 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!496 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!497 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!498 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!499 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!500 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!501 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!502 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!503 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!504 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!505 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!506 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!507 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!508 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!509 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!510 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!511 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!512 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!513 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!514 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!515 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!516 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!517 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!518 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!519 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!520 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!521 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!522 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!523 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!524 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!525 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!526 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!527 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!528 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!529 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!530 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!531 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!532 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!533 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!534 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!535 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!536 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!537 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!538 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!539 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!540 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!541 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!542 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!543 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!544 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!545 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!546 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!547 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!548 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!549 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!550 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!551 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!552 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!553 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!554 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!555 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!556 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!557 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!558 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!559 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!560 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!561 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!562 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!563 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!564 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!565 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!566 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!567 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!568 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!569 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!570 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!571 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!572 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!573 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!574 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!575 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!576 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!577 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!578 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!579 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!580 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!581 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!582 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!583 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!584 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!585 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!586 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!587 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!588 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!589 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!590 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!591 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!592 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!593 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!594 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!595 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!596 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!597 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!598 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!599 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!600 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!601 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!602 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!603 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!604 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!605 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!606 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!607 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!608 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!609 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!610 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!611 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!612 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!613 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!614 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!615 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!616 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!617 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!618 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!619 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!620 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!621 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!622 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!623 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!624 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!625 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!626 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!627 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!628 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!629 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!630 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!631 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!632 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!633 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!634 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!635 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!636 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!637 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!646 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!647 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!648 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!649 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!650 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!651 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!652 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!653 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!654 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!655 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!656 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!657 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!658 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!659 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!660 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!661 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!662 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!663 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!664 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!665 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!666 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!667 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!668 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!669 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!670 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!671 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!672 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!673 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!674 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!675 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!676 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!677 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!678 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!679 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!680 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!681 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!682 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!683 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!684 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!685 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!686 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!687 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!688 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!689 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!690 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!691 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!692 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!693 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!694 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!695 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!696 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!697 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!698 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!699 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!700 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!701 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!702 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!703 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!704 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!705 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!706 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!707 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!708 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!709 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!710 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!711 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!712 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!713 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!714 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!715 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!716 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!717 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!719 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!720 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!721 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!722 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!723 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!724 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!725 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!726 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!727 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!728 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!729 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!730 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!731 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!732 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!733 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!734 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!735 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!736 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!737 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!738 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!739 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!740 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!741 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!742 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!743 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!744 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!745 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!746 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!747 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!748 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!749 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!750 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!751 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!752 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!753 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!754 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!755 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!756 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!757 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!758 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!759 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!760 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!761 = !{!"clang version 12.0.1"}
!762 = !{i32 7, !"Dwarf Version", i32 4}
!763 = !{i32 2, !"Debug Info Version", i32 3}
!764 = !{i32 1, !"wchar_size", i32 4}
!765 = !{i32 7, !"PIC Level", i32 2}
!766 = !{i32 7, !"PIE Level", i32 2}
!767 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 483, type: !768, scopeLine: 484, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !770)
!768 = !DISubroutineType(types: !769)
!769 = !{null, !44}
!770 = !{!771}
!771 = !DILocalVariable(name: "status", arg: 1, scope: !767, file: !3, line: 483, type: !44)
!772 = !DILocation(scope: !767)
!773 = !DILocation(line: 485, column: 14, scope: !774)
!774 = distinct !DILexicalBlock(scope: !767, file: !3, line: 485, column: 7)
!775 = !DILocation(line: 485, column: 7, scope: !767)
!776 = !DILocation(line: 486, column: 5, scope: !777)
!777 = distinct !DILexicalBlock(scope: !774, file: !3, line: 486, column: 5)
!778 = !{!779, !779, i64 0}
!779 = !{!"any pointer", !780, i64 0}
!780 = !{!"omnipotent char", !781, i64 0}
!781 = !{!"Simple C/C++ TBAA"}
!782 = !DILocation(line: 489, column: 7, scope: !783)
!783 = distinct !DILexicalBlock(scope: !774, file: !3, line: 488, column: 5)
!784 = !DILocation(line: 490, column: 7, scope: !783)
!785 = !DILocation(line: 498, column: 7, scope: !783)
!786 = !DILocation(line: 505, column: 7, scope: !783)
!787 = !DILocation(line: 506, column: 7, scope: !783)
!788 = !DILocation(line: 507, column: 7, scope: !783)
!789 = !DILocalVariable(name: "program", arg: 1, scope: !790, file: !791, line: 634, type: !49)
!790 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !791, file: !791, line: 634, type: !792, scopeLine: 635, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !794)
!791 = !DIFile(filename: "src/system.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!792 = !DISubroutineType(types: !793)
!793 = !{null, !49}
!794 = !{!789, !795, !804, !805, !807}
!795 = !DILocalVariable(name: "infomap", scope: !790, file: !791, line: 636, type: !796)
!796 = !DICompositeType(tag: DW_TAG_array_type, baseType: !797, size: 896, elements: !802)
!797 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !798)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !790, file: !791, line: 636, size: 128, elements: !799)
!799 = !{!800, !801}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !798, file: !791, line: 636, baseType: !49, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !798, file: !791, line: 636, baseType: !49, size: 64, offset: 64)
!802 = !{!803}
!803 = !DISubrange(count: 7)
!804 = !DILocalVariable(name: "node", scope: !790, file: !791, line: 646, type: !49)
!805 = !DILocalVariable(name: "map_prog", scope: !790, file: !791, line: 647, type: !806)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!807 = !DILocalVariable(name: "lc_messages", scope: !790, file: !791, line: 659, type: !49)
!808 = !DILocation(scope: !790, inlinedAt: !809)
!809 = distinct !DILocation(line: 512, column: 7, scope: !783)
!810 = !DILocation(line: 636, column: 3, scope: !790, inlinedAt: !809)
!811 = !DILocation(line: 636, column: 67, scope: !790, inlinedAt: !809)
!812 = !DILocation(line: 647, column: 36, scope: !790, inlinedAt: !809)
!813 = !DILocation(line: 649, column: 3, scope: !790, inlinedAt: !809)
!814 = !DILocation(line: 649, column: 33, scope: !790, inlinedAt: !809)
!815 = !DILocation(line: 650, column: 13, scope: !790, inlinedAt: !809)
!816 = !DILocation(line: 649, column: 20, scope: !790, inlinedAt: !809)
!817 = !{!818, !779, i64 0}
!818 = !{!"infomap", !779, i64 0, !779, i64 8}
!819 = !DILocation(line: 649, column: 10, scope: !790, inlinedAt: !809)
!820 = !DILocation(line: 649, column: 28, scope: !790, inlinedAt: !809)
!821 = distinct !{!821, !813, !815, !822}
!822 = !{!"llvm.loop.mustprogress"}
!823 = !DILocation(line: 652, column: 17, scope: !824, inlinedAt: !809)
!824 = distinct !DILexicalBlock(scope: !790, file: !791, line: 652, column: 7)
!825 = !{!818, !779, i64 8}
!826 = !DILocation(line: 652, column: 7, scope: !824, inlinedAt: !809)
!827 = !DILocation(line: 652, column: 7, scope: !790, inlinedAt: !809)
!828 = !DILocation(line: 655, column: 3, scope: !790, inlinedAt: !809)
!829 = !DILocation(line: 659, column: 29, scope: !790, inlinedAt: !809)
!830 = !DILocation(line: 660, column: 7, scope: !831, inlinedAt: !809)
!831 = distinct !DILexicalBlock(scope: !790, file: !791, line: 660, column: 7)
!832 = !DILocation(line: 660, column: 19, scope: !831, inlinedAt: !809)
!833 = !DILocation(line: 660, column: 22, scope: !831, inlinedAt: !809)
!834 = !DILocation(line: 660, column: 7, scope: !790, inlinedAt: !809)
!835 = !DILocation(line: 666, column: 7, scope: !836, inlinedAt: !809)
!836 = distinct !DILexicalBlock(scope: !831, file: !791, line: 661, column: 5)
!837 = !DILocation(line: 668, column: 5, scope: !836, inlinedAt: !809)
!838 = !DILocation(line: 669, column: 3, scope: !790, inlinedAt: !809)
!839 = !DILocation(line: 671, column: 3, scope: !790, inlinedAt: !809)
!840 = !DILocation(line: 673, column: 1, scope: !790, inlinedAt: !809)
!841 = !DILocation(line: 514, column: 3, scope: !767)
!842 = !DISubprogram(name: "dcgettext", scope: !843, file: !843, line: 51, type: !844, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !189)
!843 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!844 = !DISubroutineType(types: !845)
!845 = !{!40, !49, !49, !44}
!846 = !DISubprogram(name: "fputs_unlocked", scope: !847, file: !847, line: 667, type: !848, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !189)
!847 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!848 = !DISubroutineType(types: !849)
!849 = !{!44, !49, !850}
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !852, line: 49, size: 1728, elements: !853)
!852 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!853 = !{!854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !869, !870, !871, !872, !874, !875, !877, !881, !884, !886, !889, !892, !893, !894, !895, !896}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !851, file: !852, line: 51, baseType: !44, size: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !851, file: !852, line: 54, baseType: !40, size: 64, offset: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !851, file: !852, line: 55, baseType: !40, size: 64, offset: 128)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !851, file: !852, line: 56, baseType: !40, size: 64, offset: 192)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !851, file: !852, line: 57, baseType: !40, size: 64, offset: 256)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !851, file: !852, line: 58, baseType: !40, size: 64, offset: 320)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !851, file: !852, line: 59, baseType: !40, size: 64, offset: 384)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !851, file: !852, line: 60, baseType: !40, size: 64, offset: 448)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !851, file: !852, line: 61, baseType: !40, size: 64, offset: 512)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !851, file: !852, line: 64, baseType: !40, size: 64, offset: 576)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !851, file: !852, line: 65, baseType: !40, size: 64, offset: 640)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !851, file: !852, line: 66, baseType: !40, size: 64, offset: 704)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !851, file: !852, line: 68, baseType: !867, size: 64, offset: 768)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !852, line: 36, flags: DIFlagFwdDecl)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !851, file: !852, line: 70, baseType: !850, size: 64, offset: 832)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !851, file: !852, line: 72, baseType: !44, size: 32, offset: 896)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !851, file: !852, line: 73, baseType: !44, size: 32, offset: 928)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !851, file: !852, line: 74, baseType: !873, size: 64, offset: 960)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !81, line: 152, baseType: !82)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !851, file: !852, line: 77, baseType: !48, size: 16, offset: 1024)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !851, file: !852, line: 78, baseType: !876, size: 8, offset: 1040)
!876 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !851, file: !852, line: 79, baseType: !878, size: 8, offset: 1048)
!878 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 8, elements: !879)
!879 = !{!880}
!880 = !DISubrange(count: 1)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !851, file: !852, line: 81, baseType: !882, size: 64, offset: 1088)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !852, line: 43, baseType: null)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !851, file: !852, line: 89, baseType: !885, size: 64, offset: 1152)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !81, line: 153, baseType: !82)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !851, file: !852, line: 91, baseType: !887, size: 64, offset: 1216)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !852, line: 37, flags: DIFlagFwdDecl)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !851, file: !852, line: 92, baseType: !890, size: 64, offset: 1280)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !852, line: 38, flags: DIFlagFwdDecl)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !851, file: !852, line: 93, baseType: !850, size: 64, offset: 1344)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !851, file: !852, line: 94, baseType: !42, size: 64, offset: 1408)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !851, file: !852, line: 95, baseType: !45, size: 64, offset: 1472)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !851, file: !852, line: 96, baseType: !44, size: 32, offset: 1536)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !851, file: !852, line: 98, baseType: !140, size: 160, offset: 1568)
!897 = !DISubprogram(name: "setlocale", scope: !898, file: !898, line: 122, type: !899, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !189)
!898 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!899 = !DISubroutineType(types: !900)
!900 = !{!40, !44, !49}
!901 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 518, type: !902, scopeLine: 519, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !905)
!902 = !DISubroutineType(types: !903)
!903 = !{!44, !44, !904}
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!905 = !{!906, !907, !908, !909}
!906 = !DILocalVariable(name: "argc", arg: 1, scope: !901, file: !3, line: 518, type: !44)
!907 = !DILocalVariable(name: "argv", arg: 2, scope: !901, file: !3, line: 518, type: !904)
!908 = !DILocalVariable(name: "optc", scope: !901, file: !3, line: 520, type: !44)
!909 = !DILocalVariable(name: "n_users", scope: !901, file: !3, line: 521, type: !44)
!910 = !DILocation(scope: !901)
!911 = !DILocation(line: 524, column: 21, scope: !901)
!912 = !DILocation(line: 524, column: 3, scope: !901)
!913 = !DILocation(line: 525, column: 3, scope: !901)
!914 = !DILocation(line: 526, column: 3, scope: !901)
!915 = !DILocation(line: 527, column: 3, scope: !901)
!916 = !DILocation(line: 529, column: 3, scope: !901)
!917 = !DILocation(line: 531, column: 3, scope: !901)
!918 = !DILocation(line: 531, column: 18, scope: !901)
!919 = !DILocation(line: 536, column: 27, scope: !920)
!920 = distinct !DILexicalBlock(scope: !921, file: !3, line: 534, column: 9)
!921 = distinct !DILexicalBlock(scope: !901, file: !3, line: 532, column: 5)
!922 = !DILocation(line: 537, column: 11, scope: !920)
!923 = !DILocation(line: 540, column: 27, scope: !920)
!924 = !DILocation(line: 541, column: 11, scope: !920)
!925 = !DILocation(line: 544, column: 27, scope: !920)
!926 = !DILocation(line: 545, column: 11, scope: !920)
!927 = !DILocation(line: 548, column: 28, scope: !920)
!928 = !DILocation(line: 549, column: 11, scope: !920)
!929 = !DILocation(line: 552, column: 28, scope: !920)
!930 = !DILocation(line: 554, column: 25, scope: !920)
!931 = !DILocation(line: 556, column: 11, scope: !920)
!932 = !DILocation(line: 559, column: 28, scope: !920)
!933 = !DILocation(line: 561, column: 25, scope: !920)
!934 = !DILocation(line: 563, column: 24, scope: !920)
!935 = !DILocation(line: 564, column: 11, scope: !920)
!936 = !DILocation(line: 567, column: 27, scope: !920)
!937 = !DILocation(line: 568, column: 11, scope: !920)
!938 = !DILocation(line: 571, column: 24, scope: !920)
!939 = !DILocation(line: 572, column: 11, scope: !920)
!940 = !DILocation(line: 575, column: 34, scope: !920)
!941 = !DILocation(line: 576, column: 11, scope: !920)
!942 = distinct !{!942, !917, !943, !822}
!943 = !DILocation(line: 585, column: 5, scope: !901)
!944 = !DILocation(line: 578, column: 9, scope: !920)
!945 = !DILocation(line: 580, column: 9, scope: !920)
!946 = !DILocation(line: 583, column: 11, scope: !920)
!947 = !DILocation(line: 587, column: 20, scope: !901)
!948 = !{!949, !949, i64 0}
!949 = !{!"int", !780, i64 0}
!950 = !DILocation(line: 587, column: 18, scope: !901)
!951 = !DILocation(line: 589, column: 8, scope: !952)
!952 = distinct !DILexicalBlock(scope: !901, file: !3, line: 589, column: 7)
!953 = !DILocation(line: 589, column: 24, scope: !952)
!954 = !DILocation(line: 591, column: 20, scope: !955)
!955 = distinct !DILexicalBlock(scope: !952, file: !3, line: 590, column: 5)
!956 = !DILocation(line: 591, column: 7, scope: !955)
!957 = !DILocation(line: 593, column: 7, scope: !955)
!958 = !DILocation(scope: !959)
!959 = distinct !DILexicalBlock(scope: !901, file: !3, line: 596, column: 7)
!960 = !DILocation(line: 596, column: 7, scope: !901)
!961 = !DILocalVariable(name: "filename", arg: 1, scope: !962, file: !3, line: 461, type: !49)
!962 = distinct !DISubprogram(name: "short_pinky", scope: !3, file: !3, line: 461, type: !963, scopeLine: 463, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !968)
!963 = !DISubroutineType(types: !964)
!964 = !{null, !49, !965, !966}
!965 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!968 = !{!961, !969, !970, !971, !972}
!969 = !DILocalVariable(name: "argc_names", arg: 2, scope: !962, file: !3, line: 462, type: !965)
!970 = !DILocalVariable(name: "argv_names", arg: 3, scope: !962, file: !3, line: 462, type: !966)
!971 = !DILocalVariable(name: "n_users", scope: !962, file: !3, line: 464, type: !45)
!972 = !DILocalVariable(name: "utmp_buf", scope: !962, file: !3, line: 465, type: !973)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!974 = !DILocation(scope: !962, inlinedAt: !975)
!975 = distinct !DILocation(line: 597, column: 5, scope: !959)
!976 = !DILocation(line: 464, column: 3, scope: !962, inlinedAt: !975)
!977 = !DILocation(line: 465, column: 3, scope: !962, inlinedAt: !975)
!978 = !DILocation(line: 465, column: 16, scope: !962, inlinedAt: !975)
!979 = !DILocation(line: 467, column: 7, scope: !980, inlinedAt: !975)
!980 = distinct !DILexicalBlock(scope: !962, file: !3, line: 467, column: 7)
!981 = !DILocation(line: 467, column: 52, scope: !980, inlinedAt: !975)
!982 = !DILocation(line: 467, column: 7, scope: !962, inlinedAt: !975)
!983 = !DILocation(line: 468, column: 5, scope: !980, inlinedAt: !975)
!984 = !DILocation(line: 470, column: 17, scope: !962, inlinedAt: !975)
!985 = !{!986, !986, i64 0}
!986 = !{!"long", !780, i64 0}
!987 = !DILocation(line: 470, column: 26, scope: !962, inlinedAt: !975)
!988 = !DILocalVariable(name: "n", arg: 1, scope: !989, file: !3, line: 421, type: !45)
!989 = distinct !DISubprogram(name: "scan_entries", scope: !3, file: !3, line: 421, type: !990, scopeLine: 423, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !992)
!990 = !DISubroutineType(types: !991)
!991 = !{null, !45, !102, !965, !966}
!992 = !{!988, !993, !994, !995, !996}
!993 = !DILocalVariable(name: "utmp_buf", arg: 2, scope: !989, file: !3, line: 421, type: !102)
!994 = !DILocalVariable(name: "argc_names", arg: 3, scope: !989, file: !3, line: 422, type: !965)
!995 = !DILocalVariable(name: "argv_names", arg: 4, scope: !989, file: !3, line: 422, type: !966)
!996 = !DILocalVariable(name: "i", scope: !997, file: !3, line: 444, type: !44)
!997 = distinct !DILexicalBlock(scope: !998, file: !3, line: 444, column: 15)
!998 = distinct !DILexicalBlock(scope: !999, file: !3, line: 443, column: 13)
!999 = distinct !DILexicalBlock(scope: !1000, file: !3, line: 442, column: 15)
!1000 = distinct !DILexicalBlock(scope: !1001, file: !3, line: 441, column: 9)
!1001 = distinct !DILexicalBlock(scope: !1002, file: !3, line: 440, column: 11)
!1002 = distinct !DILexicalBlock(scope: !989, file: !3, line: 439, column: 5)
!1003 = !DILocation(scope: !989, inlinedAt: !1004)
!1004 = distinct !DILocation(line: 470, column: 3, scope: !962, inlinedAt: !975)
!1005 = !DILocation(line: 424, column: 7, scope: !1006, inlinedAt: !1004)
!1006 = distinct !DILexicalBlock(scope: !989, file: !3, line: 424, column: 7)
!1007 = !DILocation(line: 424, column: 7, scope: !989, inlinedAt: !1004)
!1008 = !DILocation(scope: !1006, inlinedAt: !1004)
!1009 = !DILocation(line: 435, column: 7, scope: !1010, inlinedAt: !1004)
!1010 = distinct !DILexicalBlock(scope: !989, file: !3, line: 435, column: 7)
!1011 = !DILocation(line: 435, column: 7, scope: !989, inlinedAt: !1004)
!1012 = !DILocation(line: 404, column: 3, scope: !1013, inlinedAt: !1016)
!1013 = distinct !DISubprogram(name: "print_heading", scope: !3, file: !3, line: 402, type: !1014, scopeLine: 403, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !189)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{null}
!1016 = distinct !DILocation(line: 436, column: 5, scope: !1010, inlinedAt: !1004)
!1017 = !DILocation(line: 405, column: 7, scope: !1018, inlinedAt: !1016)
!1018 = distinct !DILexicalBlock(scope: !1013, file: !3, line: 405, column: 7)
!1019 = !DILocation(line: 405, column: 7, scope: !1013, inlinedAt: !1016)
!1020 = !DILocation(line: 406, column: 5, scope: !1018, inlinedAt: !1016)
!1021 = !DILocation(line: 407, column: 3, scope: !1013, inlinedAt: !1016)
!1022 = !DILocation(line: 408, column: 7, scope: !1023, inlinedAt: !1016)
!1023 = distinct !DILexicalBlock(scope: !1013, file: !3, line: 408, column: 7)
!1024 = !DILocation(line: 408, column: 7, scope: !1013, inlinedAt: !1016)
!1025 = !DILocation(line: 409, column: 5, scope: !1023, inlinedAt: !1016)
!1026 = !DILocation(line: 410, column: 3, scope: !1013, inlinedAt: !1016)
!1027 = !DILocation(line: 412, column: 7, scope: !1028, inlinedAt: !1016)
!1028 = distinct !DILexicalBlock(scope: !1013, file: !3, line: 412, column: 7)
!1029 = !DILocation(line: 412, column: 7, scope: !1013, inlinedAt: !1016)
!1030 = !DILocation(line: 413, column: 5, scope: !1028, inlinedAt: !1016)
!1031 = !DILocalVariable(name: "__c", arg: 1, scope: !1032, file: !1033, line: 108, type: !44)
!1032 = distinct !DISubprogram(name: "putchar_unlocked", scope: !1033, file: !1033, line: 108, type: !1034, scopeLine: 109, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1036)
!1033 = !DIFile(filename: "/usr/include/bits/stdio.h", directory: "")
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!44, !44}
!1036 = !{!1031}
!1037 = !DILocation(scope: !1032, inlinedAt: !1038)
!1038 = distinct !DILocation(line: 415, column: 3, scope: !1013, inlinedAt: !1016)
!1039 = !DILocation(line: 110, column: 10, scope: !1032, inlinedAt: !1038)
!1040 = !{!1041, !779, i64 40}
!1041 = !{!"_IO_FILE", !949, i64 0, !779, i64 8, !779, i64 16, !779, i64 24, !779, i64 32, !779, i64 40, !779, i64 48, !779, i64 56, !779, i64 64, !779, i64 72, !779, i64 80, !779, i64 88, !779, i64 96, !779, i64 104, !949, i64 112, !949, i64 116, !986, i64 120, !1042, i64 128, !780, i64 130, !780, i64 131, !779, i64 136, !986, i64 144, !779, i64 152, !779, i64 160, !779, i64 168, !779, i64 176, !986, i64 184, !949, i64 192, !780, i64 196}
!1042 = !{!"short", !780, i64 0}
!1043 = !{!1041, !779, i64 48}
!1044 = !{!"branch_weights", i32 2000, i32 1}
!1045 = !{!780, !780, i64 0}
!1046 = !DILocation(line: 438, column: 3, scope: !989, inlinedAt: !1004)
!1047 = !DILocation(line: 438, column: 11, scope: !989, inlinedAt: !1004)
!1048 = !DILocation(line: 440, column: 11, scope: !1001, inlinedAt: !1004)
!1049 = !{!1050, !1042, i64 0}
!1050 = !{!"utmpx", !1042, i64 0, !949, i64 4, !780, i64 8, !780, i64 40, !780, i64 44, !780, i64 76, !1051, i64 332, !949, i64 336, !1052, i64 340, !780, i64 348, !780, i64 364}
!1051 = !{!"__exit_status", !1042, i64 0, !1042, i64 2}
!1052 = !{!"", !949, i64 0, !949, i64 4}
!1053 = !DILocation(line: 440, column: 11, scope: !1002, inlinedAt: !1004)
!1054 = !DILocation(line: 442, column: 15, scope: !1000, inlinedAt: !1004)
!1055 = !DILocation(scope: !997, inlinedAt: !1004)
!1056 = !DILocation(line: 444, column: 15, scope: !997, inlinedAt: !1004)
!1057 = !DILocation(line: 444, column: 33, scope: !1058, inlinedAt: !1004)
!1058 = distinct !DILexicalBlock(scope: !997, file: !3, line: 444, column: 15)
!1059 = distinct !{!1059, !1056, !1060, !822}
!1060 = !DILocation(line: 449, column: 19, scope: !997, inlinedAt: !1004)
!1061 = !DILocation(line: 445, column: 21, scope: !1062, inlinedAt: !1004)
!1062 = distinct !DILexicalBlock(scope: !1058, file: !3, line: 445, column: 21)
!1063 = !DILocation(line: 444, column: 48, scope: !1058, inlinedAt: !1004)
!1064 = !DILocation(line: 445, column: 21, scope: !1058, inlinedAt: !1004)
!1065 = !DILocation(line: 447, column: 21, scope: !1066, inlinedAt: !1004)
!1066 = distinct !DILexicalBlock(scope: !1062, file: !3, line: 446, column: 19)
!1067 = !DILocation(line: 448, column: 21, scope: !1066, inlinedAt: !1004)
!1068 = !DILocation(line: 452, column: 13, scope: !999, inlinedAt: !1004)
!1069 = !DILocation(line: 454, column: 15, scope: !1002, inlinedAt: !1004)
!1070 = distinct !{!1070, !1046, !1071, !822}
!1071 = !DILocation(line: 455, column: 5, scope: !989, inlinedAt: !1004)
!1072 = !DILocation(line: 473, column: 1, scope: !962, inlinedAt: !975)
!1073 = !DILocation(line: 597, column: 5, scope: !959)
!1074 = !DILocalVariable(name: "argc_names", arg: 1, scope: !1075, file: !3, line: 476, type: !965)
!1075 = distinct !DISubprogram(name: "long_pinky", scope: !3, file: !3, line: 476, type: !1076, scopeLine: 477, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1078)
!1076 = !DISubroutineType(types: !1077)
!1077 = !{null, !965, !966}
!1078 = !{!1074, !1079, !1080}
!1079 = !DILocalVariable(name: "argv_names", arg: 2, scope: !1075, file: !3, line: 476, type: !966)
!1080 = !DILocalVariable(name: "i", scope: !1081, file: !3, line: 478, type: !44)
!1081 = distinct !DILexicalBlock(scope: !1075, file: !3, line: 478, column: 3)
!1082 = !DILocation(scope: !1075, inlinedAt: !1083)
!1083 = distinct !DILocation(line: 599, column: 5, scope: !959)
!1084 = !DILocation(scope: !1081, inlinedAt: !1083)
!1085 = !DILocation(line: 478, column: 21, scope: !1086, inlinedAt: !1083)
!1086 = distinct !DILexicalBlock(scope: !1081, file: !3, line: 478, column: 3)
!1087 = !DILocation(line: 478, column: 3, scope: !1081, inlinedAt: !1083)
!1088 = !DILocation(line: 479, column: 23, scope: !1086, inlinedAt: !1083)
!1089 = !DILocalVariable(name: "name", arg: 1, scope: !1090, file: !3, line: 307, type: !49)
!1090 = distinct !DISubprogram(name: "print_long_entry", scope: !3, file: !3, line: 307, type: !792, scopeLine: 308, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1091)
!1091 = !{!1089, !1092, !1106, !1109, !1110, !1116, !1120, !1121, !1122, !1125, !1127, !1128, !1129, !1132, !1133, !1134, !1135, !1138, !1140, !1141}
!1092 = !DILocalVariable(name: "pw", scope: !1090, file: !3, line: 309, type: !1093)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !1095, line: 49, size: 384, elements: !1096)
!1095 = !DIFile(filename: "/usr/include/pwd.h", directory: "")
!1096 = !{!1097, !1098, !1099, !1101, !1103, !1104, !1105}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !1094, file: !1095, line: 51, baseType: !40, size: 64)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !1094, file: !1095, line: 52, baseType: !40, size: 64, offset: 64)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !1094, file: !1095, line: 54, baseType: !1100, size: 32, offset: 128)
!1100 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !81, line: 146, baseType: !7)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !1094, file: !1095, line: 55, baseType: !1102, size: 32, offset: 160)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !81, line: 147, baseType: !7)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !1094, file: !1095, line: 56, baseType: !40, size: 64, offset: 192)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !1094, file: !1095, line: 57, baseType: !40, size: 64, offset: 256)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !1094, file: !1095, line: 58, baseType: !40, size: 64, offset: 320)
!1106 = !DILocalVariable(name: "comma", scope: !1107, file: !3, line: 325, type: !967)
!1107 = distinct !DILexicalBlock(scope: !1108, file: !3, line: 324, column: 5)
!1108 = distinct !DILexicalBlock(scope: !1090, file: !3, line: 317, column: 7)
!1109 = !DILocalVariable(name: "result", scope: !1107, file: !3, line: 326, type: !40)
!1110 = !DILocalVariable(name: "stream", scope: !1111, file: !3, line: 349, type: !1113)
!1111 = distinct !DILexicalBlock(scope: !1112, file: !3, line: 348, column: 5)
!1112 = distinct !DILexicalBlock(scope: !1090, file: !3, line: 347, column: 7)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64)
!1114 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !1115, line: 7, baseType: !851)
!1115 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "")
!1116 = !DILocalVariable(name: "buf", scope: !1111, file: !3, line: 350, type: !1117)
!1117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 8192, elements: !1118)
!1118 = !{!1119}
!1119 = !DISubrange(count: 1024)
!1120 = !DILocalVariable(name: "baseproject", scope: !1111, file: !3, line: 351, type: !297)
!1121 = !DILocalVariable(name: "project", scope: !1111, file: !3, line: 352, type: !967)
!1122 = !DILocalVariable(name: "bytes", scope: !1123, file: !3, line: 359, type: !45)
!1123 = distinct !DILexicalBlock(scope: !1124, file: !3, line: 358, column: 9)
!1124 = distinct !DILexicalBlock(scope: !1111, file: !3, line: 357, column: 11)
!1125 = !DILocalVariable(name: "__ptr", scope: !1126, file: !3, line: 364, type: !49)
!1126 = distinct !DILexicalBlock(scope: !1123, file: !3, line: 364, column: 13)
!1127 = !DILocalVariable(name: "__stream", scope: !1126, file: !3, line: 364, type: !1113)
!1128 = !DILocalVariable(name: "__cnt", scope: !1126, file: !3, line: 364, type: !45)
!1129 = !DILocalVariable(name: "stream", scope: !1130, file: !3, line: 373, type: !1113)
!1130 = distinct !DILexicalBlock(scope: !1131, file: !3, line: 372, column: 5)
!1131 = distinct !DILexicalBlock(scope: !1090, file: !3, line: 371, column: 7)
!1132 = !DILocalVariable(name: "buf", scope: !1130, file: !3, line: 374, type: !1117)
!1133 = !DILocalVariable(name: "baseplan", scope: !1130, file: !3, line: 375, type: !297)
!1134 = !DILocalVariable(name: "plan", scope: !1130, file: !3, line: 376, type: !967)
!1135 = !DILocalVariable(name: "bytes", scope: !1136, file: !3, line: 383, type: !45)
!1136 = distinct !DILexicalBlock(scope: !1137, file: !3, line: 382, column: 9)
!1137 = distinct !DILexicalBlock(scope: !1130, file: !3, line: 381, column: 11)
!1138 = !DILocalVariable(name: "__ptr", scope: !1139, file: !3, line: 388, type: !49)
!1139 = distinct !DILexicalBlock(scope: !1136, file: !3, line: 388, column: 13)
!1140 = !DILocalVariable(name: "__stream", scope: !1139, file: !3, line: 388, type: !1113)
!1141 = !DILocalVariable(name: "__cnt", scope: !1139, file: !3, line: 388, type: !45)
!1142 = !DILocation(scope: !1090, inlinedAt: !1143)
!1143 = distinct !DILocation(line: 479, column: 5, scope: !1086, inlinedAt: !1083)
!1144 = !DILocation(line: 311, column: 8, scope: !1090, inlinedAt: !1143)
!1145 = !DILocation(line: 313, column: 3, scope: !1090, inlinedAt: !1143)
!1146 = !DILocation(line: 314, column: 3, scope: !1090, inlinedAt: !1143)
!1147 = !DILocation(line: 316, column: 3, scope: !1090, inlinedAt: !1143)
!1148 = !DILocation(line: 317, column: 10, scope: !1108, inlinedAt: !1143)
!1149 = !DILocation(line: 317, column: 7, scope: !1090, inlinedAt: !1143)
!1150 = !DILocation(line: 320, column: 7, scope: !1151, inlinedAt: !1143)
!1151 = distinct !DILexicalBlock(scope: !1108, file: !3, line: 318, column: 5)
!1152 = !DILocation(line: 321, column: 7, scope: !1151, inlinedAt: !1143)
!1153 = !DILocation(line: 325, column: 39, scope: !1107, inlinedAt: !1143)
!1154 = !{!1155, !779, i64 24}
!1155 = !{!"passwd", !779, i64 0, !779, i64 8, !949, i64 16, !949, i64 20, !779, i64 24, !779, i64 32, !779, i64 40}
!1156 = !DILocation(line: 325, column: 27, scope: !1107, inlinedAt: !1143)
!1157 = !DILocation(scope: !1107, inlinedAt: !1143)
!1158 = !DILocation(line: 328, column: 11, scope: !1159, inlinedAt: !1143)
!1159 = distinct !DILexicalBlock(scope: !1107, file: !3, line: 328, column: 11)
!1160 = !DILocation(line: 328, column: 11, scope: !1107, inlinedAt: !1143)
!1161 = !DILocation(line: 329, column: 16, scope: !1159, inlinedAt: !1143)
!1162 = !DILocation(line: 331, column: 37, scope: !1107, inlinedAt: !1143)
!1163 = !DILocation(line: 329, column: 9, scope: !1159, inlinedAt: !1143)
!1164 = !DILocation(line: 331, column: 51, scope: !1107, inlinedAt: !1143)
!1165 = !{!1155, !779, i64 0}
!1166 = !DILocation(line: 331, column: 16, scope: !1107, inlinedAt: !1143)
!1167 = !DILocation(line: 332, column: 7, scope: !1107, inlinedAt: !1143)
!1168 = !DILocation(line: 333, column: 7, scope: !1107, inlinedAt: !1143)
!1169 = !DILocation(scope: !1032, inlinedAt: !1170)
!1170 = distinct !DILocation(line: 336, column: 3, scope: !1090, inlinedAt: !1143)
!1171 = !DILocation(line: 110, column: 10, scope: !1032, inlinedAt: !1170)
!1172 = !DILocation(line: 338, column: 7, scope: !1173, inlinedAt: !1143)
!1173 = distinct !DILexicalBlock(scope: !1090, file: !3, line: 338, column: 7)
!1174 = !DILocation(line: 338, column: 7, scope: !1090, inlinedAt: !1143)
