source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.COLUMN = type { %struct._IO_FILE*, i8*, i32, i1 (%struct.COLUMN*)*, void (i8)*, i32, i32, i32, i32, i8, i8 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }
%struct.tm_zone = type { %struct.tm_zone*, i8, [0 x i8] }
%union.anon = type { i32 }

@.str = private unnamed_addr constant [1 x i8] zeroinitializer, align 1
@.str.1 = private unnamed_addr constant [10 x i8] c"coreutils\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "short_options", scope: !2, file: !3, line: 741, type: !395, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !150, globals: !156, nameTableKind: None)
!3 = !DIFile(filename: "src/pr.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !14, !17, !20, !112, !126, !135}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !6, line: 25, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "LONGINT_OK", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "LONGINT_INVALID", value: 4, isUnsigned: true)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 538, baseType: !7, size: 32, elements: !15)
!15 = !{!16}
!16 = !DIEnumerator(name: "lines_per_header", value: 5, isUnsigned: true)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 540, baseType: !7, size: 32, elements: !18)
!18 = !{!19}
!19 = !DIEnumerator(name: "lines_per_footer", value: 5, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !21, file: !3, line: 389, baseType: !7, size: 32, elements: !107)
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "COLUMN", file: !3, line: 385, size: 512, elements: !22)
!22 = !{!23, !87, !90, !91, !97, !101, !102, !103, !104, !105, !106}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !21, file: !3, line: 387, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !26, line: 7, baseType: !27)
!26 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "")
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !28, line: 49, size: 1728, elements: !29)
!28 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!29 = !{!30, !32, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !48, !50, !51, !52, !56, !58, !60, !64, !67, !69, !72, !75, !76, !78, !82, !83}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !27, file: !28, line: 51, baseType: !31, size: 32)
!31 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !27, file: !28, line: 54, baseType: !33, size: 64, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !27, file: !28, line: 55, baseType: !33, size: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !27, file: !28, line: 56, baseType: !33, size: 64, offset: 192)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !27, file: !28, line: 57, baseType: !33, size: 64, offset: 256)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !27, file: !28, line: 58, baseType: !33, size: 64, offset: 320)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !27, file: !28, line: 59, baseType: !33, size: 64, offset: 384)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !27, file: !28, line: 60, baseType: !33, size: 64, offset: 448)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !27, file: !28, line: 61, baseType: !33, size: 64, offset: 512)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !27, file: !28, line: 64, baseType: !33, size: 64, offset: 576)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !27, file: !28, line: 65, baseType: !33, size: 64, offset: 640)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !27, file: !28, line: 66, baseType: !33, size: 64, offset: 704)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !27, file: !28, line: 68, baseType: !46, size: 64, offset: 768)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !28, line: 36, flags: DIFlagFwdDecl)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !27, file: !28, line: 70, baseType: !49, size: 64, offset: 832)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !27, file: !28, line: 72, baseType: !31, size: 32, offset: 896)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !27, file: !28, line: 73, baseType: !31, size: 32, offset: 928)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !27, file: !28, line: 74, baseType: !53, size: 64, offset: 960)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !54, line: 152, baseType: !55)
!54 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!55 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !27, file: !28, line: 77, baseType: !57, size: 16, offset: 1024)
!57 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !27, file: !28, line: 78, baseType: !59, size: 8, offset: 1040)
!59 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !27, file: !28, line: 79, baseType: !61, size: 8, offset: 1048)
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 8, elements: !62)
!62 = !{!63}
!63 = !DISubrange(count: 1)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !27, file: !28, line: 81, baseType: !65, size: 64, offset: 1088)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !28, line: 43, baseType: null)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !27, file: !28, line: 89, baseType: !68, size: 64, offset: 1152)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !54, line: 153, baseType: !55)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !27, file: !28, line: 91, baseType: !70, size: 64, offset: 1216)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !28, line: 37, flags: DIFlagFwdDecl)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !27, file: !28, line: 92, baseType: !73, size: 64, offset: 1280)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !28, line: 38, flags: DIFlagFwdDecl)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !27, file: !28, line: 93, baseType: !49, size: 64, offset: 1344)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !27, file: !28, line: 94, baseType: !77, size: 64, offset: 1408)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !27, file: !28, line: 95, baseType: !79, size: 64, offset: 1472)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !80, line: 46, baseType: !81)
!80 = !DIFile(filename: "/usr/lib/clang/12.0.1/include/stddef.h", directory: "")
!81 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !27, file: !28, line: 96, baseType: !31, size: 32, offset: 1536)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !27, file: !28, line: 98, baseType: !84, size: 160, offset: 1568)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 160, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 20)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !21, file: !3, line: 388, baseType: !88, size: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !21, file: !3, line: 397, baseType: !20, size: 32, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "print_func", scope: !21, file: !3, line: 400, baseType: !92, size: 64, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{!95, !96}
!95 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "char_func", scope: !21, file: !3, line: 403, baseType: !98, size: 64, offset: 256)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{null, !34}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "current_line", scope: !21, file: !3, line: 405, baseType: !31, size: 32, offset: 320)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "lines_stored", scope: !21, file: !3, line: 406, baseType: !31, size: 32, offset: 352)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "lines_to_print", scope: !21, file: !3, line: 407, baseType: !31, size: 32, offset: 384)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "start_position", scope: !21, file: !3, line: 408, baseType: !31, size: 32, offset: 416)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "numbered", scope: !21, file: !3, line: 409, baseType: !95, size: 8, offset: 448)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "full_page_printed", scope: !21, file: !3, line: 410, baseType: !95, size: 8, offset: 456)
!107 = !{!108, !109, !110, !111}
!108 = !DIEnumerator(name: "OPEN", value: 0, isUnsigned: true)
!109 = !DIEnumerator(name: "FF_FOUND", value: 1, isUnsigned: true)
!110 = !DIEnumerator(name: "ON_HOLD", value: 2, isUnsigned: true)
!111 = !DIEnumerator(name: "CLOSED", value: 3, isUnsigned: true)
!112 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !113, line: 32, baseType: !7, size: 32, elements: !114)
!113 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!114 = !{!115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125}
!115 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!116 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!117 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!118 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!119 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!120 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!121 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!122 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!123 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!124 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!125 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!126 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !127, line: 45, baseType: !7, size: 32, elements: !128)
!127 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!128 = !{!129, !130, !131, !132, !133, !134}
!129 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0, isUnsigned: true)
!130 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2, isUnsigned: true)
!131 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5, isUnsigned: true)
!132 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4, isUnsigned: true)
!133 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3, isUnsigned: true)
!134 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1, isUnsigned: true)
!135 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !136, line: 46, baseType: !7, size: 32, elements: !137)
!136 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!137 = !{!138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149}
!138 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!139 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!140 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!141 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!142 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!143 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!144 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!145 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!146 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!147 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!148 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!149 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!150 = !{!77, !7, !33, !79, !31, !59, !151, !152, !57, !55, !81, !153, !154, !155}
!151 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!152 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!153 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!154 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!156 = !{!157, !159, !161, !0, !167, !181, !186, !188, !190, !192, !194, !196, !198, !200, !202, !204, !206, !208, !210, !212, !214, !216, !218, !220, !222, !224, !226, !228, !230, !232, !234, !236, !238, !240, !242, !244, !246, !248, !250, !252, !254, !256, !258, !260, !262, !264, !266, !268, !270, !272, !276, !347, !349, !351, !353, !355, !357, !359, !361, !363, !365, !367, !369, !371, !373, !375, !377, !379, !381, !383, !385, !387, !389, !391, !393}
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!158 = distinct !DIGlobalVariable(name: "custom_header", scope: !2, file: !3, line: 710, type: !33, isLocal: true, isDefinition: true)
!159 = !DIGlobalVariableExpression(var: !160, expr: !DIExpression())
!160 = distinct !DIGlobalVariable(name: "date_format", scope: !2, file: !3, line: 713, type: !88, isLocal: true, isDefinition: true)
!161 = !DIGlobalVariableExpression(var: !162, expr: !DIExpression())
!162 = distinct !DIGlobalVariable(name: "localtz", scope: !2, file: !3, line: 716, type: !163, isLocal: true, isDefinition: true)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !164, line: 778, baseType: !165)
!164 = !DIFile(filename: "./lib/time.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !164, line: 778, flags: DIFlagFwdDecl)
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 744, type: !169, isLocal: true, isDefinition: true)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 6912, elements: !179)
!170 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !171)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !172, line: 50, size: 256, elements: !173)
!172 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!173 = !{!174, !175, !176, !178}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !171, file: !172, line: 52, baseType: !88, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !171, file: !172, line: 55, baseType: !31, size: 32, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !171, file: !172, line: 56, baseType: !177, size: 64, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !171, file: !172, line: 57, baseType: !31, size: 32, offset: 192)
!179 = !{!180}
!180 = !DISubrange(count: 27)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "first_page_number", scope: !2, file: !3, line: 613, type: !183, isLocal: true, isDefinition: true)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !184, line: 102, baseType: !185)
!184 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !54, line: 73, baseType: !81)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "last_page_number", scope: !2, file: !3, line: 614, type: !183, isLocal: true, isDefinition: true)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(name: "columns", scope: !2, file: !3, line: 609, type: !31, isLocal: true, isDefinition: true)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(name: "print_across_flag", scope: !2, file: !3, line: 522, type: !95, isLocal: true, isDefinition: true)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(name: "storing_columns", scope: !2, file: !3, line: 525, type: !95, isLocal: true, isDefinition: true)
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(name: "balance_columns", scope: !2, file: !3, line: 531, type: !95, isLocal: true, isDefinition: true)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "use_cntrl_prefix", scope: !2, file: !3, line: 673, type: !95, isLocal: true, isDefinition: true)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(name: "double_space", scope: !2, file: !3, line: 676, type: !95, isLocal: true, isDefinition: true)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(name: "input_tab_char", scope: !2, file: !3, line: 561, type: !34, isLocal: true, isDefinition: true)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(name: "chars_per_input_tab", scope: !2, file: !3, line: 565, type: !31, isLocal: true, isDefinition: true)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(name: "untabify_input", scope: !2, file: !3, line: 558, type: !95, isLocal: true, isDefinition: true)
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(name: "use_form_feed", scope: !2, file: !3, line: 516, type: !95, isLocal: true, isDefinition: true)
!208 = !DIGlobalVariableExpression(var: !209, expr: !DIExpression())
!209 = distinct !DIGlobalVariable(name: "output_tab_char", scope: !2, file: !3, line: 571, type: !34, isLocal: true, isDefinition: true)
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(name: "chars_per_output_tab", scope: !2, file: !3, line: 574, type: !31, isLocal: true, isDefinition: true)
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(name: "tabify_output", scope: !2, file: !3, line: 568, type: !95, isLocal: true, isDefinition: true)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(name: "join_lines", scope: !2, file: !3, line: 551, type: !95, isLocal: true, isDefinition: true)
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "lines_per_page", scope: !2, file: !3, line: 534, type: !31, isLocal: true, isDefinition: true)
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(name: "parallel_files", scope: !2, file: !3, line: 481, type: !95, isLocal: true, isDefinition: true)
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(name: "numbered_lines", scope: !2, file: !3, line: 638, type: !95, isLocal: true, isDefinition: true)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(name: "number_separator", scope: !2, file: !3, line: 641, type: !34, isLocal: true, isDefinition: true)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(name: "chars_per_number", scope: !2, file: !3, line: 657, type: !31, isLocal: true, isDefinition: true)
!226 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!227 = distinct !DIGlobalVariable(name: "skip_count", scope: !2, file: !3, line: 650, type: !95, isLocal: true, isDefinition: true)
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(name: "start_line_num", scope: !2, file: !3, line: 654, type: !31, isLocal: true, isDefinition: true)
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(name: "chars_per_margin", scope: !2, file: !3, line: 582, type: !31, isLocal: true, isDefinition: true)
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(name: "ignore_failed_opens", scope: !2, file: !3, line: 683, type: !95, isLocal: true, isDefinition: true)
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(name: "use_col_separator", scope: !2, file: !3, line: 687, type: !95, isLocal: true, isDefinition: true)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(name: "col_sep_string", scope: !2, file: !3, line: 692, type: !88, isLocal: true, isDefinition: true)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(name: "col_sep_length", scope: !2, file: !3, line: 693, type: !31, isLocal: true, isDefinition: true)
!240 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!241 = distinct !DIGlobalVariable(name: "extremities", scope: !2, file: !3, line: 504, type: !95, isLocal: true, isDefinition: true)
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(name: "keep_FF", scope: !2, file: !3, line: 508, type: !95, isLocal: true, isDefinition: true)
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(name: "use_esc_sequence", scope: !2, file: !3, line: 669, type: !95, isLocal: true, isDefinition: true)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(name: "truncate_lines", scope: !2, file: !3, line: 547, type: !95, isLocal: true, isDefinition: true)
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(name: "chars_per_line", scope: !2, file: !3, line: 544, type: !31, isLocal: true, isDefinition: true)
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(name: "explicit_columns", scope: !2, file: !3, line: 501, type: !95, isLocal: true, isDefinition: true)
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 519, type: !95, isLocal: true, isDefinition: true)
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(name: "failed_opens", scope: !2, file: !3, line: 598, type: !95, isLocal: true, isDefinition: true)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(name: "lines_per_body", scope: !2, file: !3, line: 539, type: !31, isLocal: true, isDefinition: true)
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(name: "line_separator", scope: !2, file: !3, line: 695, type: !33, isLocal: true, isDefinition: true)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(name: "column_separator", scope: !2, file: !3, line: 694, type: !33, isLocal: true, isDefinition: true)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(name: "number_width", scope: !2, file: !3, line: 662, type: !31, isLocal: true, isDefinition: true)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "chars_per_column", scope: !2, file: !3, line: 555, type: !31, isLocal: true, isDefinition: true)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "number_buff", scope: !2, file: !3, line: 665, type: !33, isLocal: true, isDefinition: true)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(name: "clump_buff", scope: !2, file: !3, line: 725, type: !33, isLocal: true, isDefinition: true)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(name: "total_files", scope: !2, file: !3, line: 680, type: !31, isLocal: true, isDefinition: true)
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(name: "column_vector", scope: !2, file: !3, line: 451, type: !274, isLocal: true, isDefinition: true)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "COLUMN", file: !3, line: 418, baseType: !21)
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(name: "timespec", scope: !278, file: !3, line: 1640, type: !309, isLocal: true, isDefinition: true)
!278 = distinct !DISubprogram(name: "init_header", scope: !3, file: !3, line: 1625, type: !279, scopeLine: 1626, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !281)
!279 = !DISubroutineType(types: !280)
!280 = !{null, !88, !31}
!281 = !{!282, !283, !284, !285, !322, !323, !324, !339, !342}
!282 = !DILocalVariable(name: "filename", arg: 1, scope: !278, file: !3, line: 1625, type: !88)
!283 = !DILocalVariable(name: "desc", arg: 2, scope: !278, file: !3, line: 1625, type: !31)
!284 = !DILocalVariable(name: "buf", scope: !278, file: !3, line: 1627, type: !33)
!285 = !DILocalVariable(name: "st", scope: !278, file: !3, line: 1628, type: !286)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !287, line: 26, size: 1152, elements: !288)
!287 = !DIFile(filename: "/usr/include/bits/struct_stat.h", directory: "")
!288 = !{!289, !291, !293, !295, !297, !299, !301, !302, !303, !304, !306, !308, !316, !317, !318}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !286, file: !287, line: 28, baseType: !290, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !54, line: 145, baseType: !81)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !286, file: !287, line: 33, baseType: !292, size: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !54, line: 148, baseType: !81)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !286, file: !287, line: 41, baseType: !294, size: 64, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !54, line: 151, baseType: !81)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !286, file: !287, line: 42, baseType: !296, size: 32, offset: 192)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !54, line: 150, baseType: !7)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !286, file: !287, line: 44, baseType: !298, size: 32, offset: 224)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !54, line: 146, baseType: !7)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !286, file: !287, line: 45, baseType: !300, size: 32, offset: 256)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !54, line: 147, baseType: !7)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !286, file: !287, line: 47, baseType: !31, size: 32, offset: 288)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !286, file: !287, line: 49, baseType: !290, size: 64, offset: 320)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !286, file: !287, line: 54, baseType: !53, size: 64, offset: 384)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !286, file: !287, line: 58, baseType: !305, size: 64, offset: 448)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !54, line: 175, baseType: !55)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !286, file: !287, line: 60, baseType: !307, size: 64, offset: 512)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !54, line: 180, baseType: !55)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !286, file: !287, line: 71, baseType: !309, size: 128, offset: 576)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !310, line: 10, size: 128, elements: !311)
!310 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!311 = !{!312, !314}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !309, file: !310, line: 12, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !54, line: 160, baseType: !55)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !309, file: !310, line: 16, baseType: !315, size: 64, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !54, line: 197, baseType: !55)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !286, file: !287, line: 72, baseType: !309, size: 128, offset: 704)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !286, file: !287, line: 73, baseType: !309, size: 128, offset: 832)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !286, file: !287, line: 86, baseType: !319, size: 192, offset: 960)
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !315, size: 192, elements: !320)
!320 = !{!321}
!321 = !DISubrange(count: 3)
!322 = !DILocalVariable(name: "t", scope: !278, file: !3, line: 1629, type: !309)
!323 = !DILocalVariable(name: "ns", scope: !278, file: !3, line: 1630, type: !31)
!324 = !DILocalVariable(name: "tm", scope: !278, file: !3, line: 1631, type: !325)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !326, line: 7, size: 448, elements: !327)
!326 = !DIFile(filename: "/usr/include/bits/types/struct_tm.h", directory: "")
!327 = !{!328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !325, file: !326, line: 9, baseType: !31, size: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !325, file: !326, line: 10, baseType: !31, size: 32, offset: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !325, file: !326, line: 11, baseType: !31, size: 32, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !325, file: !326, line: 12, baseType: !31, size: 32, offset: 96)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !325, file: !326, line: 13, baseType: !31, size: 32, offset: 128)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !325, file: !326, line: 14, baseType: !31, size: 32, offset: 160)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !325, file: !326, line: 15, baseType: !31, size: 32, offset: 192)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !325, file: !326, line: 16, baseType: !31, size: 32, offset: 224)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !325, file: !326, line: 17, baseType: !31, size: 32, offset: 256)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !325, file: !326, line: 20, baseType: !55, size: 64, offset: 320)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !325, file: !326, line: 21, baseType: !88, size: 64, offset: 384)
!339 = !DILocalVariable(name: "bufsize", scope: !340, file: !3, line: 1649, type: !79)
!340 = distinct !DILexicalBlock(scope: !341, file: !3, line: 1648, column: 5)
!341 = distinct !DILexicalBlock(scope: !278, file: !3, line: 1647, column: 7)
!342 = !DILocalVariable(name: "secbuf", scope: !343, file: !3, line: 1656, type: !344)
!343 = distinct !DILexicalBlock(scope: !341, file: !3, line: 1655, column: 5)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 168, elements: !345)
!345 = !{!346}
!346 = !DISubrange(count: 21)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(name: "date_text", scope: !2, file: !3, line: 719, type: !33, isLocal: true, isDefinition: true)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(name: "file_text", scope: !2, file: !3, line: 720, type: !88, isLocal: true, isDefinition: true)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "header_width_available", scope: !2, file: !3, line: 723, type: !31, isLocal: true, isDefinition: true)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(name: "files_ready_to_read", scope: !2, file: !3, line: 617, type: !31, isLocal: true, isDefinition: true)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(name: "line_vector", scope: !2, file: !3, line: 471, type: !177, isLocal: true, isDefinition: true)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(name: "end_vector", scope: !2, file: !3, line: 478, type: !177, isLocal: true, isDefinition: true)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(name: "buff", scope: !2, file: !3, line: 457, type: !33, isLocal: true, isDefinition: true)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "buff_allocated", scope: !2, file: !3, line: 465, type: !79, isLocal: true, isDefinition: true)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "last_line", scope: !2, file: !3, line: 731, type: !95, isLocal: true, isDefinition: true)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "page_number", scope: !2, file: !3, line: 620, type: !183, isLocal: true, isDefinition: true)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "buff_current", scope: !2, file: !3, line: 461, type: !7, isLocal: true, isDefinition: true)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(name: "pad_vertically", scope: !2, file: !3, line: 707, type: !95, isLocal: true, isDefinition: true)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(name: "print_a_header", scope: !2, file: !3, line: 513, type: !95, isLocal: true, isDefinition: true)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "padding_not_printed", scope: !2, file: !3, line: 703, type: !31, isLocal: true, isDefinition: true)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(name: "separators_not_printed", scope: !2, file: !3, line: 699, type: !31, isLocal: true, isDefinition: true)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "spaces_not_printed", scope: !2, file: !3, line: 579, type: !31, isLocal: true, isDefinition: true)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(name: "output_position", scope: !2, file: !3, line: 588, type: !31, isLocal: true, isDefinition: true)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(name: "input_position", scope: !2, file: !3, line: 594, type: !31, isLocal: true, isDefinition: true)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(name: "FF_only", scope: !2, file: !3, line: 496, type: !95, isLocal: true, isDefinition: true)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "print_a_FF", scope: !2, file: !3, line: 509, type: !95, isLocal: true, isDefinition: true)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "align_empty_cols", scope: !2, file: !3, line: 485, type: !95, isLocal: true, isDefinition: true)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "empty_line", scope: !2, file: !3, line: 489, type: !95, isLocal: true, isDefinition: true)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "line_count", scope: !2, file: !3, line: 645, type: !31, isLocal: true, isDefinition: true)
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(name: "line_number", scope: !2, file: !3, line: 635, type: !31, isLocal: true, isDefinition: true)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 424, elements: !396)
!396 = !{!397}
!397 = !DISubrange(count: 53)
!398 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!399 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!400 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!401 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!402 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!403 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!404 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!405 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!406 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!407 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!408 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!409 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!410 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!411 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!412 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!413 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!414 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!415 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!416 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!417 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!418 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!419 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!420 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!421 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!422 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!423 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!424 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(name: "Version", scope: !427, file: !428, line: 2, type: !88, isDefinition: true)
!427 = distinct !DICompileUnit(language: DW_LANG_C99, file: !428, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !429, globals: !430, nameTableKind: None)
!428 = !DIFile(filename: "src/version.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!429 = !{}
!430 = !{!425}
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(name: "file_name", scope: !433, file: !434, line: 46, type: !88, isLocal: true, isDefinition: true)
!433 = distinct !DICompileUnit(language: DW_LANG_C99, file: !434, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !429, globals: !435, nameTableKind: None)
!434 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!435 = !{!431, !436}
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !433, file: !434, line: 56, type: !95, isLocal: true, isDefinition: true)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(name: "exit_failure", scope: !440, file: !441, line: 24, type: !443, isDefinition: true)
!440 = distinct !DICompileUnit(language: DW_LANG_C99, file: !441, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !429, globals: !442, nameTableKind: None)
!441 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!442 = !{!438}
!443 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !31)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "program_name", scope: !446, file: !447, line: 33, type: !88, isDefinition: true)
!446 = distinct !DICompileUnit(language: DW_LANG_C99, file: !447, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !429, retainedTypes: !448, globals: !449, nameTableKind: None)
!447 = !DIFile(filename: "lib/progname.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!448 = !{!77, !33}
!449 = !{!444}
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !452, file: !453, line: 85, type: !498, isDefinition: true)
!452 = distinct !DICompileUnit(language: DW_LANG_C99, file: !453, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !454, retainedTypes: !460, globals: !461, nameTableKind: None)
!453 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!454 = !{!112, !455, !135}
!455 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !113, line: 242, baseType: !7, size: 32, elements: !456)
!456 = !{!457, !458, !459}
!457 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!458 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!459 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!460 = !{!31, !57, !79, !33}
!461 = !{!450, !462, !468, !480, !482, !487, !494, !496}
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !452, file: !453, line: 101, type: !464, isDefinition: true)
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !465, size: 320, elements: !466)
!465 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !112)
!466 = !{!467}
!467 = !DISubrange(count: 10)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !452, file: !453, line: 1052, type: !470, isDefinition: true)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !453, line: 65, size: 448, elements: !471)
!471 = !{!472, !473, !474, !478, !479}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !470, file: !453, line: 68, baseType: !112, size: 32)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !470, file: !453, line: 71, baseType: !31, size: 32, offset: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !470, file: !453, line: 75, baseType: !475, size: 256, offset: 64)
!475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !476)
!476 = !{!477}
!477 = !DISubrange(count: 8)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !470, file: !453, line: 78, baseType: !88, size: 64, offset: 320)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !470, file: !453, line: 81, baseType: !88, size: 64, offset: 384)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !452, file: !453, line: 116, type: !470, isLocal: true, isDefinition: true)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(name: "slot0", scope: !452, file: !453, line: 842, type: !484, isLocal: true, isDefinition: true)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 2048, elements: !485)
!485 = !{!486}
!486 = !DISubrange(count: 256)
!487 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression())
!488 = distinct !DIGlobalVariable(name: "slotvec", scope: !452, file: !453, line: 845, type: !489, isLocal: true, isDefinition: true)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !453, line: 834, size: 128, elements: !491)
!491 = !{!492, !493}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !490, file: !453, line: 836, baseType: !79, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !490, file: !453, line: 837, baseType: !33, size: 64, offset: 64)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(name: "nslots", scope: !452, file: !453, line: 843, type: !31, isLocal: true, isDefinition: true)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(name: "slotvec0", scope: !452, file: !453, line: 844, type: !490, isLocal: true, isDefinition: true)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 704, elements: !500)
!499 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !88)
!500 = !{!501}
!501 = !DISubrange(count: 11)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !504, file: !505, line: 26, type: !507, isDefinition: true)
!504 = distinct !DICompileUnit(language: DW_LANG_C99, file: !505, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !429, globals: !506, nameTableKind: None)
!505 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!506 = !{!502}
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 376, elements: !508)
!508 = !{!509}
!509 = !DISubrange(count: 47)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !512, file: !513, line: 507, type: !31, isLocal: true, isDefinition: true)
!512 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !513, file: !513, line: 488, type: !514, scopeLine: 489, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !516, retainedNodes: !518)
!513 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!514 = !DISubroutineType(types: !515)
!515 = !{!31, !31, !31}
!516 = distinct !DICompileUnit(language: DW_LANG_C99, file: !513, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !429, globals: !517, nameTableKind: None)
!517 = !{!510}
!518 = !{!519, !520, !521, !522, !525}
!519 = !DILocalVariable(name: "fd", arg: 1, scope: !512, file: !513, line: 488, type: !31)
!520 = !DILocalVariable(name: "target", arg: 2, scope: !512, file: !513, line: 488, type: !31)
!521 = !DILocalVariable(name: "result", scope: !512, file: !513, line: 490, type: !31)
!522 = !DILocalVariable(name: "flags", scope: !523, file: !513, line: 531, type: !31)
!523 = distinct !DILexicalBlock(scope: !524, file: !513, line: 530, column: 5)
!524 = distinct !DILexicalBlock(scope: !512, file: !513, line: 529, column: 7)
!525 = !DILocalVariable(name: "saved_errno", scope: !526, file: !513, line: 534, type: !31)
!526 = distinct !DILexicalBlock(scope: !527, file: !513, line: 533, column: 9)
!527 = distinct !DILexicalBlock(scope: !523, file: !513, line: 532, column: 11)
!528 = distinct !DICompileUnit(language: DW_LANG_C99, file: !529, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !530, nameTableKind: None)
!529 = !DIFile(filename: "lib/fadvise.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!530 = !{!126}
!531 = distinct !DICompileUnit(language: DW_LANG_C99, file: !532, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !429, nameTableKind: None)
!532 = !DIFile(filename: "lib/fopen-safer.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!533 = distinct !DICompileUnit(language: DW_LANG_C99, file: !534, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !429, nameTableKind: None)
!534 = !DIFile(filename: "lib/gettime.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!535 = distinct !DICompileUnit(language: DW_LANG_C99, file: !536, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !429, nameTableKind: None)
!536 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!537 = distinct !DICompileUnit(language: DW_LANG_C99, file: !538, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !429, retainedTypes: !539, nameTableKind: None)
!538 = !DIFile(filename: "lib/imaxtostr.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!539 = !{!540}
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !184, line: 101, baseType: !541)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !54, line: 72, baseType: !55)
!542 = distinct !DICompileUnit(language: DW_LANG_C99, file: !543, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !544, retainedTypes: !545, nameTableKind: None)
!543 = !DIFile(filename: "lib/mbswidth.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!544 = !{!135}
!545 = !{!79, !151, !31, !57}
!546 = distinct !DICompileUnit(language: DW_LANG_C99, file: !547, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !429, retainedTypes: !548, nameTableKind: None)
!547 = !DIFile(filename: "lib/nstrftime.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!548 = !{!88, !7, !31, !59, !151, !152, !57, !55, !81, !153, !154, !79, !77, !549}
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!551 = distinct !DICompileUnit(language: DW_LANG_C99, file: !552, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !429, retainedTypes: !553, nameTableKind: None)
!552 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!553 = !{!77}
!554 = distinct !DICompileUnit(language: DW_LANG_C99, file: !555, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !429, nameTableKind: None)
!555 = !DIFile(filename: "lib/dup-safer.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!556 = distinct !DICompileUnit(language: DW_LANG_C99, file: !557, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !558, retainedTypes: !553, nameTableKind: None)
!557 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!558 = !{!559}
!559 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !557, line: 40, baseType: !7, size: 32, elements: !560)
!560 = !{!561}
!561 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!562 = distinct !DICompileUnit(language: DW_LANG_C99, file: !563, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !564, retainedTypes: !578, nameTableKind: None)
!563 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!564 = !{!565}
!565 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !567, file: !566, line: 186, baseType: !7, size: 32, elements: !576)
!566 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!567 = distinct !DISubprogram(name: "x2nrealloc", scope: !566, file: !566, line: 174, type: !568, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !562, retainedNodes: !571)
!568 = !DISubroutineType(types: !569)
!569 = !{!77, !77, !570, !79}
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!571 = !{!572, !573, !574, !575}
!572 = !DILocalVariable(name: "p", arg: 1, scope: !567, file: !566, line: 174, type: !77)
!573 = !DILocalVariable(name: "pn", arg: 2, scope: !567, file: !566, line: 174, type: !570)
!574 = !DILocalVariable(name: "s", arg: 3, scope: !567, file: !566, line: 174, type: !79)
!575 = !DILocalVariable(name: "n", scope: !567, file: !566, line: 176, type: !79)
!576 = !{!577}
!577 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!578 = !{!79, !33, !77}
!579 = distinct !DICompileUnit(language: DW_LANG_C99, file: !580, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !429, nameTableKind: None)
!580 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!581 = distinct !DICompileUnit(language: DW_LANG_C99, file: !582, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !583, nameTableKind: None)
!582 = !DIFile(filename: "lib/xdectoimax.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!583 = !{!5}
!584 = distinct !DICompileUnit(language: DW_LANG_C99, file: !585, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !583, nameTableKind: None)
!585 = !DIFile(filename: "lib/xstrtoimax.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!586 = distinct !DICompileUnit(language: DW_LANG_C99, file: !587, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !583, nameTableKind: None)
!587 = !DIFile(filename: "lib/xstrtol.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!588 = distinct !DICompileUnit(language: DW_LANG_C99, file: !589, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !583, nameTableKind: None)
!589 = !DIFile(filename: "lib/xstrtol-error.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!590 = distinct !DICompileUnit(language: DW_LANG_C99, file: !591, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !592, retainedTypes: !593, nameTableKind: None)
!591 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!592 = !{!5, !135}
!593 = !{!31, !57}
!594 = distinct !DICompileUnit(language: DW_LANG_C99, file: !595, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !429, retainedTypes: !553, nameTableKind: None)
!595 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!596 = distinct !DICompileUnit(language: DW_LANG_C99, file: !597, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !429, nameTableKind: None)
!597 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!598 = distinct !DICompileUnit(language: DW_LANG_C99, file: !599, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !429, retainedTypes: !553, nameTableKind: None)
!599 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!600 = distinct !DICompileUnit(language: DW_LANG_C99, file: !601, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !429, retainedTypes: !553, nameTableKind: None)
!601 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!602 = distinct !DICompileUnit(language: DW_LANG_C99, file: !603, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !429, retainedTypes: !604, nameTableKind: None)
!603 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!604 = !{!79}
!605 = distinct !DICompileUnit(language: DW_LANG_C99, file: !606, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !607, retainedTypes: !611, globals: !612, nameTableKind: None)
!606 = !DIFile(filename: "lib/time_rz.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!607 = !{!608}
!608 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !606, line: 50, baseType: !7, size: 32, elements: !609)
!609 = !{!610}
!610 = !DIEnumerator(name: "ABBR_SIZE_MIN", value: 119, isUnsigned: true)
!611 = !{!33, !79}
!612 = !{!613}
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(name: "local_tz", scope: !605, file: !606, line: 55, type: !615, isLocal: true, isDefinition: true)
!615 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !616)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !164, line: 778, baseType: !617)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !619, line: 21, size: 128, elements: !620)
!619 = !DIFile(filename: "./lib/time-internal.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!620 = !{!621, !622, !623}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !618, file: !619, line: 25, baseType: !617, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "tz_is_set", scope: !618, file: !619, line: 36, baseType: !34, size: 8, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "abbrs", scope: !618, file: !619, line: 48, baseType: !624, offset: 72)
!624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, elements: !625)
!625 = !{!626}
!626 = !DISubrange(count: -1)
!627 = distinct !DICompileUnit(language: DW_LANG_C99, file: !628, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !429, nameTableKind: None)
!628 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!629 = distinct !DICompileUnit(language: DW_LANG_C99, file: !630, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !631, retainedTypes: !553, nameTableKind: None)
!630 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!631 = !{!632}
!632 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !633, line: 41, baseType: !7, size: 32, elements: !634)
!633 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!634 = !{!635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017}
!635 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!636 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!637 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!638 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!639 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!640 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!641 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!642 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!643 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!644 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!645 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!646 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!647 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!648 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!649 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!650 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!651 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!652 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!653 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!654 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!655 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!656 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!657 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!658 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!659 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!660 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!661 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!662 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!663 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!664 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!665 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!666 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!667 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!668 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!669 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!670 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!671 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!672 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!673 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!674 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!675 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!676 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!677 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!678 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!679 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!680 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!681 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!682 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!683 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!684 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!685 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!686 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!687 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!688 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!689 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!690 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!691 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!692 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!693 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!694 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!695 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!696 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!697 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!698 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!699 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!700 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!701 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!702 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!703 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!704 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!705 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!706 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!707 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!708 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!709 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!710 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!711 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!712 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!713 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!714 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!715 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!716 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!717 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!719 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!720 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!721 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!722 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!723 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!724 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!725 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!726 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!727 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!728 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!729 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!730 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!731 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!732 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!733 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!734 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!735 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!736 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!737 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!738 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!739 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!740 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!741 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!742 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!743 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!744 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!745 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!746 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!747 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!748 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!749 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!750 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!751 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!752 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!753 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!754 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!755 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!756 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!757 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!758 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!759 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!760 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!761 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!762 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!763 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!764 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!765 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!766 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!767 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!768 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!769 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!770 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!771 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!772 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!773 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!774 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!779 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!780 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!781 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!782 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!783 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!784 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!785 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!786 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!787 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!788 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!789 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!790 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!791 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!793 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!794 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!795 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!796 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!797 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!798 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!799 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!800 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!801 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!802 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!803 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!804 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!805 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!806 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!807 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!808 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!809 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!810 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!812 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!813 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!814 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!815 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!816 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!817 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!818 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!819 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!820 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!821 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!822 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!823 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!824 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!825 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!826 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!827 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!828 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!829 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!830 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!831 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!832 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!833 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!834 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!835 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!836 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!837 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!838 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!839 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!840 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!841 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!842 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!843 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!844 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!845 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!846 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!847 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!884 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!885 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!886 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!887 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!894 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!895 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!896 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!898 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!899 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!900 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!901 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!902 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!903 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!904 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!905 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!906 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!907 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!908 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!909 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!910 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!911 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!912 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!913 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!914 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!915 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!916 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!917 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!918 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!919 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!920 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!921 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!922 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!923 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!924 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!925 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!926 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!927 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!928 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!929 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!930 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!931 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!932 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!933 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!934 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!935 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!936 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!937 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!938 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!939 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!940 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!941 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!942 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!943 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!944 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!945 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!946 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!947 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!948 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!949 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!950 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!951 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!952 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!953 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!954 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!955 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!956 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!957 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!958 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!959 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!960 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!961 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!962 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!963 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!964 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!965 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!966 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!967 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!968 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!969 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!970 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!971 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!972 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!973 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!974 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!975 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!976 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!977 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!978 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!979 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!980 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!981 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!982 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!983 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!984 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!985 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!986 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!987 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!988 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!989 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!990 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!991 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!992 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!993 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!994 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!995 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!996 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!997 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!998 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!999 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!1000 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!1001 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!1002 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!1003 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!1004 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!1005 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!1006 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!1007 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!1008 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!1009 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!1010 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!1011 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!1012 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!1013 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!1014 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!1015 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!1016 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!1017 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!1018 = !{!"clang version 12.0.1"}
!1019 = !{i32 7, !"Dwarf Version", i32 4}
!1020 = !{i32 2, !"Debug Info Version", i32 3}
!1021 = !{i32 1, !"wchar_size", i32 4}
!1022 = !{i32 7, !"PIC Level", i32 2}
!1023 = !{i32 7, !"PIE Level", i32 2}
!1024 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 858, type: !1025, scopeLine: 859, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1028)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!31, !31, !1027}
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!1028 = !{!1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1041, !1042, !1045}
!1029 = !DILocalVariable(name: "argc", arg: 1, scope: !1024, file: !3, line: 858, type: !31)
