; ModuleID = 'coreutils-8.32/src/pr.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.tm_zone = type { %struct.tm_zone*, i8, [0 x i8] }
%struct.COLUMN = type { %struct._IO_FILE*, i8*, i32, i1 (%struct.COLUMN*)*, void (i8)*, i32, i32, i32, i32, i8, i8 }
%struct.timespec = type { i64, i64 }
%struct.infomap = type { i8*, i8* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@.str = private unnamed_addr constant [1 x i8] zeroinitializer, align 1
@.str.1 = private unnamed_addr constant [10 x i8] c"coreutils\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "short_options", scope: !2, file: !3, line: 741, type: !526, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !150, globals: !320, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/pr.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !14, !17, !20, !112, !126, !135}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !6, line: 25, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "LONGINT_OK", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "LONGINT_INVALID", value: 4, isUnsigned: true)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 538, baseType: !7, size: 32, elements: !15)
!15 = !{!16}
!16 = !DIEnumerator(name: "lines_per_header", value: 5, isUnsigned: true)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 540, baseType: !7, size: 32, elements: !18)
!18 = !{!19}
!19 = !DIEnumerator(name: "lines_per_footer", value: 5, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !21, file: !3, line: 389, baseType: !7, size: 32, elements: !107)
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "COLUMN", file: !3, line: 385, size: 512, elements: !22)
!22 = !{!23, !87, !90, !91, !97, !101, !102, !103, !104, !105, !106}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !21, file: !3, line: 387, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !26, line: 7, baseType: !27)
!26 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "")
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !28, line: 49, size: 1728, elements: !29)
!28 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!29 = !{!30, !32, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !48, !50, !51, !52, !56, !58, !60, !64, !67, !69, !72, !75, !76, !78, !82, !83}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !27, file: !28, line: 51, baseType: !31, size: 32)
!31 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !27, file: !28, line: 54, baseType: !33, size: 64, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !27, file: !28, line: 55, baseType: !33, size: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !27, file: !28, line: 56, baseType: !33, size: 64, offset: 192)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !27, file: !28, line: 57, baseType: !33, size: 64, offset: 256)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !27, file: !28, line: 58, baseType: !33, size: 64, offset: 320)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !27, file: !28, line: 59, baseType: !33, size: 64, offset: 384)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !27, file: !28, line: 60, baseType: !33, size: 64, offset: 448)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !27, file: !28, line: 61, baseType: !33, size: 64, offset: 512)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !27, file: !28, line: 64, baseType: !33, size: 64, offset: 576)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !27, file: !28, line: 65, baseType: !33, size: 64, offset: 640)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !27, file: !28, line: 66, baseType: !33, size: 64, offset: 704)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !27, file: !28, line: 68, baseType: !46, size: 64, offset: 768)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !28, line: 36, flags: DIFlagFwdDecl)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !27, file: !28, line: 70, baseType: !49, size: 64, offset: 832)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !27, file: !28, line: 72, baseType: !31, size: 32, offset: 896)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !27, file: !28, line: 73, baseType: !31, size: 32, offset: 928)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !27, file: !28, line: 74, baseType: !53, size: 64, offset: 960)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !54, line: 152, baseType: !55)
!54 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!55 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !27, file: !28, line: 77, baseType: !57, size: 16, offset: 1024)
!57 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !27, file: !28, line: 78, baseType: !59, size: 8, offset: 1040)
!59 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !27, file: !28, line: 79, baseType: !61, size: 8, offset: 1048)
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 8, elements: !62)
!62 = !{!63}
!63 = !DISubrange(count: 1)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !27, file: !28, line: 81, baseType: !65, size: 64, offset: 1088)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !28, line: 43, baseType: null)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !27, file: !28, line: 89, baseType: !68, size: 64, offset: 1152)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !54, line: 153, baseType: !55)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !27, file: !28, line: 91, baseType: !70, size: 64, offset: 1216)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !28, line: 37, flags: DIFlagFwdDecl)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !27, file: !28, line: 92, baseType: !73, size: 64, offset: 1280)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !28, line: 38, flags: DIFlagFwdDecl)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !27, file: !28, line: 93, baseType: !49, size: 64, offset: 1344)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !27, file: !28, line: 94, baseType: !77, size: 64, offset: 1408)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !27, file: !28, line: 95, baseType: !79, size: 64, offset: 1472)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !80, line: 46, baseType: !81)
!80 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!81 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !27, file: !28, line: 96, baseType: !31, size: 32, offset: 1536)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !27, file: !28, line: 98, baseType: !84, size: 160, offset: 1568)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 160, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 20)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !21, file: !3, line: 388, baseType: !88, size: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !21, file: !3, line: 397, baseType: !20, size: 32, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "print_func", scope: !21, file: !3, line: 400, baseType: !92, size: 64, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{!95, !96}
!95 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "char_func", scope: !21, file: !3, line: 403, baseType: !98, size: 64, offset: 256)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{null, !34}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "current_line", scope: !21, file: !3, line: 405, baseType: !31, size: 32, offset: 320)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "lines_stored", scope: !21, file: !3, line: 406, baseType: !31, size: 32, offset: 352)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "lines_to_print", scope: !21, file: !3, line: 407, baseType: !31, size: 32, offset: 384)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "start_position", scope: !21, file: !3, line: 408, baseType: !31, size: 32, offset: 416)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "numbered", scope: !21, file: !3, line: 409, baseType: !95, size: 8, offset: 448)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "full_page_printed", scope: !21, file: !3, line: 410, baseType: !95, size: 8, offset: 456)
!107 = !{!108, !109, !110, !111}
!108 = !DIEnumerator(name: "OPEN", value: 0, isUnsigned: true)
!109 = !DIEnumerator(name: "FF_FOUND", value: 1, isUnsigned: true)
!110 = !DIEnumerator(name: "ON_HOLD", value: 2, isUnsigned: true)
!111 = !DIEnumerator(name: "CLOSED", value: 3, isUnsigned: true)
!112 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !113, line: 32, baseType: !7, size: 32, elements: !114)
!113 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!114 = !{!115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125}
!115 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!116 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!117 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!118 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!119 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!120 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!121 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!122 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!123 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!124 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!125 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!126 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !127, line: 45, baseType: !7, size: 32, elements: !128)
!127 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!128 = !{!129, !130, !131, !132, !133, !134}
!129 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0, isUnsigned: true)
!130 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2, isUnsigned: true)
!131 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5, isUnsigned: true)
!132 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4, isUnsigned: true)
!133 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3, isUnsigned: true)
!134 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1, isUnsigned: true)
!135 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !136, line: 46, baseType: !7, size: 32, elements: !137)
!136 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!137 = !{!138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149}
!138 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!139 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!140 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!141 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!142 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!143 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!144 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!145 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!146 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!147 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!148 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!149 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!150 = !{!151, !156, !160, !164, !167, !77, !174, !7, !189, !194, !197, !201, !205, !208, !33, !212, !216, !217, !221, !227, !231, !79, !235, !236, !239, !243, !247, !251, !31, !59, !255, !256, !57, !55, !81, !257, !258, !259, !260, !264, !267, !270, !282, !302, !308, !312, !316, !319}
!151 = !DISubprogram(name: "set_program_name", scope: !152, file: !152, line: 37, type: !153, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!152 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!153 = !DISubroutineType(types: !154)
!154 = !{null, !88}
!155 = !{}
!156 = !DISubprogram(name: "setlocale", scope: !157, file: !157, line: 122, type: !158, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!157 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!158 = !DISubroutineType(types: !159)
!159 = !{!33, !31, !88}
!160 = !DISubprogram(name: "bindtextdomain", scope: !161, file: !161, line: 86, type: !162, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!161 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!162 = !DISubroutineType(types: !163)
!163 = !{!33, !88, !88}
!164 = !DISubprogram(name: "textdomain", scope: !161, file: !161, line: 82, type: !165, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!165 = !DISubroutineType(types: !166)
!166 = !{!33, !88}
!167 = !DISubprogram(name: "atexit", scope: !168, file: !168, line: 595, type: !169, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!168 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!169 = !DISubroutineType(types: !170)
!170 = !{!31, !171}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{null}
!174 = !DISubprogram(name: "getopt_long", scope: !175, file: !175, line: 66, type: !176, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!175 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!176 = !DISubroutineType(types: !177)
!177 = !{!31, !31, !178, !88, !180, !187}
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !182)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !175, line: 50, size: 256, elements: !183)
!183 = !{!184, !185, !186, !188}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !182, file: !175, line: 52, baseType: !88, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !182, file: !175, line: 55, baseType: !31, size: 32, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !182, file: !175, line: 56, baseType: !187, size: 64, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !182, file: !175, line: 57, baseType: !31, size: 32, offset: 192)
!189 = !DISubprogram(name: "x2realloc", scope: !190, file: !190, line: 61, type: !191, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!190 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!191 = !DISubroutineType(types: !192)
!192 = !{!77, !77, !193}
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!194 = !DISubprogram(name: "dcgettext", scope: !161, file: !161, line: 51, type: !195, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!195 = !DISubroutineType(types: !196)
!196 = !{!33, !88, !88, !31}
!197 = !DISubprogram(name: "error", scope: !198, file: !198, line: 52, type: !199, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!198 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!199 = !DISubroutineType(types: !200)
!200 = !{null, !31, !31, !88, null}
!201 = !DISubprogram(name: "quote", scope: !202, file: !202, line: 44, type: !203, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!202 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!203 = !DISubroutineType(types: !204)
!204 = !{!88, !88}
!205 = !DISubprogram(name: "free", scope: !168, file: !168, line: 565, type: !206, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!206 = !DISubroutineType(types: !207)
!207 = !{null, !77}
!208 = !DISubprogram(name: "usage", scope: !209, file: !209, line: 711, type: !210, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !155)
!209 = !DIFile(filename: "src/system.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!210 = !DISubroutineType(types: !211)
!211 = !{null, !31}
!212 = !DISubprogram(name: "version_etc", scope: !213, file: !213, line: 69, type: !214, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!213 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!214 = !DISubroutineType(types: !215)
!215 = !{null, !49, !88, !88, !88, null}
!216 = !DISubprogram(name: "getenv", scope: !168, file: !168, line: 634, type: !165, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!217 = !DISubprogram(name: "hard_locale", scope: !218, file: !218, line: 26, type: !219, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!218 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!219 = !DISubroutineType(types: !220)
!220 = !{!95, !31}
!221 = !DISubprogram(name: "tzalloc", scope: !222, file: !222, line: 779, type: !223, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!222 = !DIFile(filename: "./lib/time.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!223 = !DISubroutineType(types: !224)
!224 = !{!225, !88}
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !222, line: 778, flags: DIFlagFwdDecl)
!227 = !DISubprogram(name: "rpl_fclose", scope: !228, file: !228, line: 672, type: !229, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!228 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!229 = !DISubroutineType(types: !230)
!230 = !{!31, !49}
!231 = !DISubprogram(name: "fputs_unlocked", scope: !232, file: !232, line: 662, type: !233, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!232 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!233 = !DISubroutineType(types: !234)
!234 = !{!31, !88, !49}
!235 = !DISubprogram(name: "xalloc_die", scope: !190, file: !190, line: 51, type: !172, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !155)
!236 = !DISubprogram(name: "xmalloc", scope: !190, file: !190, line: 53, type: !237, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!237 = !DISubroutineType(types: !238)
!238 = !{!77, !81}
!239 = !DISubprogram(name: "xstrtoumax", scope: !6, file: !6, line: 48, type: !240, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!240 = !DISubroutineType(types: !241)
!241 = !{!5, !88, !242, !31, !193, !88}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!243 = !DISubprogram(name: "xstrtol_fatal", scope: !244, file: !244, line: 41, type: !245, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !155)
!244 = !DIFile(filename: "./lib/xstrtol-error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!245 = !DISubroutineType(types: !246)
!246 = !{null, !5, !31, !34, !180, !88}
!247 = !DISubprogram(name: "xdectoimax", scope: !248, file: !248, line: 30, type: !249, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!248 = !DIFile(filename: "./lib/xdectoint.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!249 = !DISubroutineType(types: !250)
!250 = !{!55, !88, !55, !55, !88, !88, !31}
!251 = !DISubprogram(name: "xstrtol", scope: !6, file: !6, line: 43, type: !252, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!252 = !DISubroutineType(types: !253)
!253 = !{!5, !88, !242, !31, !254, !88}
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!255 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!256 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!257 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!258 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!259 = !DISubprogram(name: "fileno", scope: !232, file: !232, line: 786, type: !229, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!260 = !DISubprogram(name: "fopen_safer", scope: !261, file: !261, line: 23, type: !262, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!261 = !DIFile(filename: "./lib/stdio-safer.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!262 = !DISubroutineType(types: !263)
!263 = !{!49, !88, !88}
!264 = !DISubprogram(name: "quotearg_n_style_colon", scope: !113, file: !113, line: 397, type: !265, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!265 = !DISubroutineType(types: !266)
!266 = !{!33, !31, !112, !88}
!267 = !DISubprogram(name: "fadvise", scope: !127, file: !127, line: 72, type: !268, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!268 = !DISubroutineType(types: !269)
!269 = !{null, !49, !126}
!270 = !DISubprogram(name: "gettime", scope: !271, file: !271, line: 127, type: !272, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!271 = !DIFile(filename: "./lib/timespec.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!272 = !DISubroutineType(types: !273)
!273 = !{null, !274}
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !276, line: 10, size: 128, elements: !277)
!276 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!277 = !{!278, !280}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !275, file: !276, line: 12, baseType: !279, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !54, line: 160, baseType: !55)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !275, file: !276, line: 16, baseType: !281, size: 64, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !54, line: 196, baseType: !55)
!282 = !DISubprogram(name: "localtime_rz", scope: !222, file: !222, line: 783, type: !283, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!283 = !DISubroutineType(types: !284)
!284 = !{!285, !225, !300, !285}
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !287, line: 7, size: 448, elements: !288)
!287 = !DIFile(filename: "/usr/include/bits/types/struct_tm.h", directory: "")
!288 = !{!289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !286, file: !287, line: 9, baseType: !31, size: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !286, file: !287, line: 10, baseType: !31, size: 32, offset: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !286, file: !287, line: 11, baseType: !31, size: 32, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !286, file: !287, line: 12, baseType: !31, size: 32, offset: 96)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !286, file: !287, line: 13, baseType: !31, size: 32, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !286, file: !287, line: 14, baseType: !31, size: 32, offset: 160)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !286, file: !287, line: 15, baseType: !31, size: 32, offset: 192)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !286, file: !287, line: 16, baseType: !31, size: 32, offset: 224)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !286, file: !287, line: 17, baseType: !31, size: 32, offset: 256)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !286, file: !287, line: 20, baseType: !55, size: 64, offset: 320)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !286, file: !287, line: 21, baseType: !88, size: 64, offset: 384)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!302 = !DISubprogram(name: "nstrftime", scope: !303, file: !303, line: 28, type: !304, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!303 = !DIFile(filename: "./lib/strftime.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!304 = !DISubroutineType(types: !305)
!305 = !{!81, !33, !81, !88, !306, !225, !31}
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !286)
!308 = !DISubprogram(name: "gnu_mbswidth", scope: !309, file: !309, line: 51, type: !310, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!309 = !DIFile(filename: "./lib/mbswidth.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!310 = !DISubroutineType(types: !311)
!311 = !{!31, !88, !31}
!312 = !DISubprogram(name: "imaxtostr", scope: !313, file: !313, line: 42, type: !314, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!313 = !DIFile(filename: "./lib/inttostr.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!314 = !DISubroutineType(types: !315)
!315 = !{!33, !55, !33}
!316 = !DISubprogram(name: "ungetc", scope: !232, file: !232, line: 639, type: !317, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!317 = !DISubroutineType(types: !318)
!318 = !{!31, !31, !49}
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!320 = !{!321, !323, !325, !0, !328, !333, !338, !340, !342, !344, !346, !348, !350, !352, !354, !356, !358, !360, !362, !364, !366, !368, !370, !372, !374, !376, !378, !380, !382, !384, !386, !388, !390, !392, !394, !396, !398, !400, !402, !404, !406, !408, !410, !412, !414, !416, !418, !420, !422, !424, !428, !478, !480, !482, !484, !486, !488, !490, !492, !494, !496, !498, !500, !502, !504, !506, !508, !510, !512, !514, !516, !518, !520, !522, !524}
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(name: "custom_header", scope: !2, file: !3, line: 710, type: !33, isLocal: true, isDefinition: true)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(name: "date_format", scope: !2, file: !3, line: 713, type: !88, isLocal: true, isDefinition: true)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "localtz", scope: !2, file: !3, line: 716, type: !327, isLocal: true, isDefinition: true)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !222, line: 778, baseType: !225)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 744, type: !330, isLocal: true, isDefinition: true)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 6912, elements: !331)
!331 = !{!332}
!332 = !DISubrange(count: 27)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(name: "first_page_number", scope: !2, file: !3, line: 613, type: !335, isLocal: true, isDefinition: true)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !336, line: 102, baseType: !337)
!336 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !54, line: 73, baseType: !81)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "last_page_number", scope: !2, file: !3, line: 614, type: !335, isLocal: true, isDefinition: true)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(name: "columns", scope: !2, file: !3, line: 609, type: !31, isLocal: true, isDefinition: true)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "print_across_flag", scope: !2, file: !3, line: 522, type: !95, isLocal: true, isDefinition: true)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "storing_columns", scope: !2, file: !3, line: 525, type: !95, isLocal: true, isDefinition: true)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "balance_columns", scope: !2, file: !3, line: 531, type: !95, isLocal: true, isDefinition: true)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "use_cntrl_prefix", scope: !2, file: !3, line: 673, type: !95, isLocal: true, isDefinition: true)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "double_space", scope: !2, file: !3, line: 676, type: !95, isLocal: true, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "input_tab_char", scope: !2, file: !3, line: 561, type: !34, isLocal: true, isDefinition: true)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "chars_per_input_tab", scope: !2, file: !3, line: 565, type: !31, isLocal: true, isDefinition: true)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(name: "untabify_input", scope: !2, file: !3, line: 558, type: !95, isLocal: true, isDefinition: true)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "use_form_feed", scope: !2, file: !3, line: 516, type: !95, isLocal: true, isDefinition: true)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(name: "output_tab_char", scope: !2, file: !3, line: 571, type: !34, isLocal: true, isDefinition: true)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "chars_per_output_tab", scope: !2, file: !3, line: 574, type: !31, isLocal: true, isDefinition: true)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(name: "tabify_output", scope: !2, file: !3, line: 568, type: !95, isLocal: true, isDefinition: true)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "join_lines", scope: !2, file: !3, line: 551, type: !95, isLocal: true, isDefinition: true)
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(name: "lines_per_page", scope: !2, file: !3, line: 534, type: !31, isLocal: true, isDefinition: true)
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(name: "parallel_files", scope: !2, file: !3, line: 481, type: !95, isLocal: true, isDefinition: true)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "numbered_lines", scope: !2, file: !3, line: 638, type: !95, isLocal: true, isDefinition: true)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(name: "number_separator", scope: !2, file: !3, line: 641, type: !34, isLocal: true, isDefinition: true)
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(name: "chars_per_number", scope: !2, file: !3, line: 657, type: !31, isLocal: true, isDefinition: true)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(name: "skip_count", scope: !2, file: !3, line: 650, type: !95, isLocal: true, isDefinition: true)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(name: "start_line_num", scope: !2, file: !3, line: 654, type: !31, isLocal: true, isDefinition: true)
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(name: "chars_per_margin", scope: !2, file: !3, line: 582, type: !31, isLocal: true, isDefinition: true)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(name: "ignore_failed_opens", scope: !2, file: !3, line: 683, type: !95, isLocal: true, isDefinition: true)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "use_col_separator", scope: !2, file: !3, line: 687, type: !95, isLocal: true, isDefinition: true)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(name: "col_sep_string", scope: !2, file: !3, line: 692, type: !88, isLocal: true, isDefinition: true)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(name: "col_sep_length", scope: !2, file: !3, line: 693, type: !31, isLocal: true, isDefinition: true)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "extremities", scope: !2, file: !3, line: 504, type: !95, isLocal: true, isDefinition: true)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(name: "keep_FF", scope: !2, file: !3, line: 508, type: !95, isLocal: true, isDefinition: true)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(name: "use_esc_sequence", scope: !2, file: !3, line: 669, type: !95, isLocal: true, isDefinition: true)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "truncate_lines", scope: !2, file: !3, line: 547, type: !95, isLocal: true, isDefinition: true)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(name: "chars_per_line", scope: !2, file: !3, line: 544, type: !31, isLocal: true, isDefinition: true)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(name: "explicit_columns", scope: !2, file: !3, line: 501, type: !95, isLocal: true, isDefinition: true)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 519, type: !95, isLocal: true, isDefinition: true)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "failed_opens", scope: !2, file: !3, line: 598, type: !95, isLocal: true, isDefinition: true)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(name: "lines_per_body", scope: !2, file: !3, line: 539, type: !31, isLocal: true, isDefinition: true)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "line_separator", scope: !2, file: !3, line: 695, type: !33, isLocal: true, isDefinition: true)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(name: "column_separator", scope: !2, file: !3, line: 694, type: !33, isLocal: true, isDefinition: true)
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(name: "number_width", scope: !2, file: !3, line: 662, type: !31, isLocal: true, isDefinition: true)
!416 = !DIGlobalVariableExpression(var: !417, expr: !DIExpression())
!417 = distinct !DIGlobalVariable(name: "chars_per_column", scope: !2, file: !3, line: 555, type: !31, isLocal: true, isDefinition: true)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(name: "number_buff", scope: !2, file: !3, line: 665, type: !33, isLocal: true, isDefinition: true)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(name: "clump_buff", scope: !2, file: !3, line: 725, type: !33, isLocal: true, isDefinition: true)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(name: "total_files", scope: !2, file: !3, line: 680, type: !31, isLocal: true, isDefinition: true)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(name: "column_vector", scope: !2, file: !3, line: 451, type: !426, isLocal: true, isDefinition: true)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "COLUMN", file: !3, line: 418, baseType: !21)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(name: "timespec", scope: !430, file: !3, line: 1640, type: !275, isLocal: true, isDefinition: true)
!430 = distinct !DISubprogram(name: "init_header", scope: !3, file: !3, line: 1625, type: !431, scopeLine: 1626, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !433)
!431 = !DISubroutineType(types: !432)
!432 = !{null, !88, !31}
!433 = !{!434, !435, !436, !437, !467, !468, !469, !470, !473}
!434 = !DILocalVariable(name: "filename", arg: 1, scope: !430, file: !3, line: 1625, type: !88)
!435 = !DILocalVariable(name: "desc", arg: 2, scope: !430, file: !3, line: 1625, type: !31)
!436 = !DILocalVariable(name: "buf", scope: !430, file: !3, line: 1627, type: !33)
!437 = !DILocalVariable(name: "st", scope: !430, file: !3, line: 1628, type: !438)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !439, line: 46, size: 1152, elements: !440)
!439 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "")
!440 = !{!441, !443, !445, !447, !449, !451, !453, !454, !455, !456, !458, !460, !461, !462, !463}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !438, file: !439, line: 48, baseType: !442, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !54, line: 145, baseType: !81)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !438, file: !439, line: 53, baseType: !444, size: 64, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !54, line: 148, baseType: !81)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !438, file: !439, line: 61, baseType: !446, size: 64, offset: 128)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !54, line: 151, baseType: !81)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !438, file: !439, line: 62, baseType: !448, size: 32, offset: 192)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !54, line: 150, baseType: !7)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !438, file: !439, line: 64, baseType: !450, size: 32, offset: 224)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !54, line: 146, baseType: !7)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !438, file: !439, line: 65, baseType: !452, size: 32, offset: 256)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !54, line: 147, baseType: !7)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !438, file: !439, line: 67, baseType: !31, size: 32, offset: 288)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !438, file: !439, line: 69, baseType: !442, size: 64, offset: 320)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !438, file: !439, line: 74, baseType: !53, size: 64, offset: 384)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !438, file: !439, line: 78, baseType: !457, size: 64, offset: 448)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !54, line: 174, baseType: !55)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !438, file: !439, line: 80, baseType: !459, size: 64, offset: 512)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !54, line: 179, baseType: !55)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !438, file: !439, line: 91, baseType: !275, size: 128, offset: 576)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !438, file: !439, line: 92, baseType: !275, size: 128, offset: 704)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !438, file: !439, line: 93, baseType: !275, size: 128, offset: 832)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !438, file: !439, line: 106, baseType: !464, size: 192, offset: 960)
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !281, size: 192, elements: !465)
!465 = !{!466}
!466 = !DISubrange(count: 3)
!467 = !DILocalVariable(name: "t", scope: !430, file: !3, line: 1629, type: !275)
!468 = !DILocalVariable(name: "ns", scope: !430, file: !3, line: 1630, type: !31)
!469 = !DILocalVariable(name: "tm", scope: !430, file: !3, line: 1631, type: !286)
!470 = !DILocalVariable(name: "bufsize", scope: !471, file: !3, line: 1649, type: !79)
!471 = distinct !DILexicalBlock(scope: !472, file: !3, line: 1648, column: 5)
!472 = distinct !DILexicalBlock(scope: !430, file: !3, line: 1647, column: 7)
!473 = !DILocalVariable(name: "secbuf", scope: !474, file: !3, line: 1656, type: !475)
!474 = distinct !DILexicalBlock(scope: !472, file: !3, line: 1655, column: 5)
!475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 168, elements: !476)
!476 = !{!477}
!477 = !DISubrange(count: 21)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(name: "date_text", scope: !2, file: !3, line: 719, type: !33, isLocal: true, isDefinition: true)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(name: "file_text", scope: !2, file: !3, line: 720, type: !88, isLocal: true, isDefinition: true)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(name: "header_width_available", scope: !2, file: !3, line: 723, type: !31, isLocal: true, isDefinition: true)
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(name: "files_ready_to_read", scope: !2, file: !3, line: 617, type: !31, isLocal: true, isDefinition: true)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(name: "line_vector", scope: !2, file: !3, line: 471, type: !187, isLocal: true, isDefinition: true)
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(name: "end_vector", scope: !2, file: !3, line: 478, type: !187, isLocal: true, isDefinition: true)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(name: "buff", scope: !2, file: !3, line: 457, type: !33, isLocal: true, isDefinition: true)
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(name: "buff_allocated", scope: !2, file: !3, line: 465, type: !79, isLocal: true, isDefinition: true)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(name: "last_line", scope: !2, file: !3, line: 731, type: !95, isLocal: true, isDefinition: true)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(name: "page_number", scope: !2, file: !3, line: 620, type: !335, isLocal: true, isDefinition: true)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(name: "buff_current", scope: !2, file: !3, line: 461, type: !7, isLocal: true, isDefinition: true)
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(name: "pad_vertically", scope: !2, file: !3, line: 707, type: !95, isLocal: true, isDefinition: true)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(name: "print_a_header", scope: !2, file: !3, line: 513, type: !95, isLocal: true, isDefinition: true)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(name: "padding_not_printed", scope: !2, file: !3, line: 703, type: !31, isLocal: true, isDefinition: true)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(name: "separators_not_printed", scope: !2, file: !3, line: 699, type: !31, isLocal: true, isDefinition: true)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(name: "spaces_not_printed", scope: !2, file: !3, line: 579, type: !31, isLocal: true, isDefinition: true)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(name: "output_position", scope: !2, file: !3, line: 588, type: !31, isLocal: true, isDefinition: true)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(name: "input_position", scope: !2, file: !3, line: 594, type: !31, isLocal: true, isDefinition: true)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(name: "FF_only", scope: !2, file: !3, line: 496, type: !95, isLocal: true, isDefinition: true)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(name: "print_a_FF", scope: !2, file: !3, line: 509, type: !95, isLocal: true, isDefinition: true)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(name: "align_empty_cols", scope: !2, file: !3, line: 485, type: !95, isLocal: true, isDefinition: true)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(name: "empty_line", scope: !2, file: !3, line: 489, type: !95, isLocal: true, isDefinition: true)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(name: "line_count", scope: !2, file: !3, line: 645, type: !31, isLocal: true, isDefinition: true)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(name: "line_number", scope: !2, file: !3, line: 635, type: !31, isLocal: true, isDefinition: true)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 424, elements: !527)
!527 = !{!528}
!528 = !DISubrange(count: 53)
!529 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!530 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!531 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!532 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!533 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!534 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!535 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!536 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!537 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!538 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!539 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!540 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!541 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!542 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!543 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!544 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!545 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!546 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!547 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!548 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!549 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!550 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!551 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!552 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!553 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!554 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!555 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(name: "Version", scope: !558, file: !559, line: 2, type: !88, isLocal: false, isDefinition: true)
!558 = distinct !DICompileUnit(language: DW_LANG_C99, file: !559, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !155, globals: !560, splitDebugInlining: false, nameTableKind: None)
!559 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!560 = !{!556}
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(name: "file_name", scope: !563, file: !564, line: 46, type: !88, isLocal: true, isDefinition: true)
!563 = distinct !DICompileUnit(language: DW_LANG_C99, file: !564, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !155, retainedTypes: !565, globals: !603, splitDebugInlining: false, nameTableKind: None)
!564 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!565 = !{!566, !194, !602, !197}
!566 = !DISubprogram(name: "close_stream", scope: !567, file: !567, line: 2, type: !568, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!567 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!568 = !DISubroutineType(types: !569)
!569 = !{!31, !570}
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !28, line: 49, size: 1728, elements: !572)
!572 = !{!573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !571, file: !28, line: 51, baseType: !31, size: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !571, file: !28, line: 54, baseType: !33, size: 64, offset: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !571, file: !28, line: 55, baseType: !33, size: 64, offset: 128)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !571, file: !28, line: 56, baseType: !33, size: 64, offset: 192)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !571, file: !28, line: 57, baseType: !33, size: 64, offset: 256)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !571, file: !28, line: 58, baseType: !33, size: 64, offset: 320)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !571, file: !28, line: 59, baseType: !33, size: 64, offset: 384)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !571, file: !28, line: 60, baseType: !33, size: 64, offset: 448)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !571, file: !28, line: 61, baseType: !33, size: 64, offset: 512)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !571, file: !28, line: 64, baseType: !33, size: 64, offset: 576)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !571, file: !28, line: 65, baseType: !33, size: 64, offset: 640)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !571, file: !28, line: 66, baseType: !33, size: 64, offset: 704)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !571, file: !28, line: 68, baseType: !46, size: 64, offset: 768)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !571, file: !28, line: 70, baseType: !570, size: 64, offset: 832)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !571, file: !28, line: 72, baseType: !31, size: 32, offset: 896)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !571, file: !28, line: 73, baseType: !31, size: 32, offset: 928)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !571, file: !28, line: 74, baseType: !53, size: 64, offset: 960)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !571, file: !28, line: 77, baseType: !57, size: 16, offset: 1024)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !571, file: !28, line: 78, baseType: !59, size: 8, offset: 1040)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !571, file: !28, line: 79, baseType: !61, size: 8, offset: 1048)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !571, file: !28, line: 81, baseType: !65, size: 64, offset: 1088)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !571, file: !28, line: 89, baseType: !68, size: 64, offset: 1152)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !571, file: !28, line: 91, baseType: !70, size: 64, offset: 1216)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !571, file: !28, line: 92, baseType: !73, size: 64, offset: 1280)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !571, file: !28, line: 93, baseType: !570, size: 64, offset: 1344)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !571, file: !28, line: 94, baseType: !77, size: 64, offset: 1408)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !571, file: !28, line: 95, baseType: !79, size: 64, offset: 1472)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !571, file: !28, line: 96, baseType: !31, size: 32, offset: 1536)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !571, file: !28, line: 98, baseType: !84, size: 160, offset: 1568)
!602 = !DISubprogram(name: "quotearg_colon", scope: !113, file: !113, line: 391, type: !165, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!603 = !{!561, !604}
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !563, file: !564, line: 56, type: !95, isLocal: true, isDefinition: true)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(name: "exit_failure", scope: !608, file: !609, line: 24, type: !611, isLocal: false, isDefinition: true)
!608 = distinct !DICompileUnit(language: DW_LANG_C99, file: !609, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !155, globals: !610, splitDebugInlining: false, nameTableKind: None)
!609 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!610 = !{!606}
!611 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !31)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(name: "program_name", scope: !614, file: !615, line: 33, type: !88, isLocal: false, isDefinition: true)
!614 = distinct !DICompileUnit(language: DW_LANG_C99, file: !615, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !155, retainedTypes: !616, globals: !652, splitDebugInlining: false, nameTableKind: None)
!615 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!616 = !{!77, !617, !33}
!617 = !DISubprogram(name: "fputs", scope: !232, file: !232, line: 626, type: !618, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!618 = !DISubroutineType(types: !619)
!619 = !{!31, !88, !620}
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !28, line: 49, size: 1728, elements: !622)
!622 = !{!623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !621, file: !28, line: 51, baseType: !31, size: 32)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !621, file: !28, line: 54, baseType: !33, size: 64, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !621, file: !28, line: 55, baseType: !33, size: 64, offset: 128)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !621, file: !28, line: 56, baseType: !33, size: 64, offset: 192)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !621, file: !28, line: 57, baseType: !33, size: 64, offset: 256)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !621, file: !28, line: 58, baseType: !33, size: 64, offset: 320)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !621, file: !28, line: 59, baseType: !33, size: 64, offset: 384)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !621, file: !28, line: 60, baseType: !33, size: 64, offset: 448)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !621, file: !28, line: 61, baseType: !33, size: 64, offset: 512)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !621, file: !28, line: 64, baseType: !33, size: 64, offset: 576)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !621, file: !28, line: 65, baseType: !33, size: 64, offset: 640)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !621, file: !28, line: 66, baseType: !33, size: 64, offset: 704)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !621, file: !28, line: 68, baseType: !46, size: 64, offset: 768)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !621, file: !28, line: 70, baseType: !620, size: 64, offset: 832)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !621, file: !28, line: 72, baseType: !31, size: 32, offset: 896)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !621, file: !28, line: 73, baseType: !31, size: 32, offset: 928)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !621, file: !28, line: 74, baseType: !53, size: 64, offset: 960)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !621, file: !28, line: 77, baseType: !57, size: 16, offset: 1024)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !621, file: !28, line: 78, baseType: !59, size: 8, offset: 1040)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !621, file: !28, line: 79, baseType: !61, size: 8, offset: 1048)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !621, file: !28, line: 81, baseType: !65, size: 64, offset: 1088)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !621, file: !28, line: 89, baseType: !68, size: 64, offset: 1152)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !621, file: !28, line: 91, baseType: !70, size: 64, offset: 1216)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !621, file: !28, line: 92, baseType: !73, size: 64, offset: 1280)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !621, file: !28, line: 93, baseType: !620, size: 64, offset: 1344)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !621, file: !28, line: 94, baseType: !77, size: 64, offset: 1408)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !621, file: !28, line: 95, baseType: !79, size: 64, offset: 1472)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !621, file: !28, line: 96, baseType: !31, size: 32, offset: 1536)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !621, file: !28, line: 98, baseType: !84, size: 160, offset: 1568)
!652 = !{!612}
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !655, file: !656, line: 85, type: !752, isLocal: false, isDefinition: true)
!655 = distinct !DICompileUnit(language: DW_LANG_C99, file: !656, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !657, retainedTypes: !663, globals: !725, splitDebugInlining: false, nameTableKind: None)
!656 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!657 = !{!112, !658, !135}
!658 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !113, line: 242, baseType: !7, size: 32, elements: !659)
!659 = !{!660, !661, !662}
!660 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!661 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!662 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!663 = !{!664, !669, !205, !684, !31, !57, !687, !79, !704, !708, !194, !714, !718, !33, !236, !235, !722}
!664 = !DISubprogram(name: "xmemdup", scope: !190, file: !190, line: 62, type: !665, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!665 = !DISubroutineType(types: !666)
!666 = !{!77, !667, !81}
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!669 = !DISubprogram(name: "quotearg_alloc_mem", scope: !113, file: !113, line: 342, type: !670, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!670 = !DISubroutineType(types: !671)
!671 = !{!33, !88, !81, !193, !672}
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !674)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !656, line: 65, size: 448, elements: !675)
!675 = !{!676, !677, !678, !682, !683}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !674, file: !656, line: 68, baseType: !112, size: 32)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !674, file: !656, line: 71, baseType: !31, size: 32, offset: 32)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !674, file: !656, line: 75, baseType: !679, size: 256, offset: 64)
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !680)
!680 = !{!681}
!681 = !DISubrange(count: 8)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !674, file: !656, line: 78, baseType: !88, size: 64, offset: 320)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !674, file: !656, line: 81, baseType: !88, size: 64, offset: 384)
!684 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !113, file: !113, line: 408, type: !685, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!685 = !DISubroutineType(types: !686)
!686 = !{!33, !31, !88, !88, !88, !81}
!687 = !DISubprogram(name: "rpl_mbrtowc", scope: !688, file: !688, line: 717, type: !689, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!688 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!689 = !DISubroutineType(types: !690)
!690 = !{!81, !187, !88, !81, !691}
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !693, line: 13, size: 64, elements: !694)
!693 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!694 = !{!695, !696}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !692, file: !693, line: 15, baseType: !31, size: 32)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !692, file: !693, line: 20, baseType: !697, size: 32, offset: 32)
!697 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !692, file: !693, line: 16, size: 32, elements: !698)
!698 = !{!699, !700}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !697, file: !693, line: 18, baseType: !7, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !697, file: !693, line: 19, baseType: !701, size: 32)
!701 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 32, elements: !702)
!702 = !{!703}
!703 = !DISubrange(count: 4)
!704 = !DISubprogram(name: "iswprint", scope: !705, file: !705, line: 120, type: !706, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!705 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!706 = !DISubroutineType(types: !707)
!707 = !{!31, !7}
!708 = !DISubprogram(name: "mbsinit", scope: !709, file: !709, line: 292, type: !710, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!709 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!710 = !DISubroutineType(types: !711)
!711 = !{!31, !712}
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !692)
!714 = !DISubprogram(name: "locale_charset", scope: !715, file: !715, line: 35, type: !716, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!715 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!716 = !DISubroutineType(types: !717)
!717 = !{!88}
!718 = !DISubprogram(name: "c_strcasecmp", scope: !719, file: !719, line: 42, type: !720, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!719 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!720 = !DISubroutineType(types: !721)
!721 = !{!31, !88, !88}
!722 = !DISubprogram(name: "xrealloc", scope: !190, file: !190, line: 59, type: !723, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!723 = !DISubroutineType(types: !724)
!724 = !{!77, !77, !81}
!725 = !{!653, !726, !732, !734, !736, !741, !748, !750}
!726 = !DIGlobalVariableExpression(var: !727, expr: !DIExpression())
!727 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !655, file: !656, line: 101, type: !728, isLocal: false, isDefinition: true)
!728 = !DICompositeType(tag: DW_TAG_array_type, baseType: !729, size: 320, elements: !730)
!729 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !112)
!730 = !{!731}
!731 = !DISubrange(count: 10)
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !655, file: !656, line: 1052, type: !674, isLocal: false, isDefinition: true)
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !655, file: !656, line: 116, type: !674, isLocal: true, isDefinition: true)
!736 = !DIGlobalVariableExpression(var: !737, expr: !DIExpression())
!737 = distinct !DIGlobalVariable(name: "slot0", scope: !655, file: !656, line: 842, type: !738, isLocal: true, isDefinition: true)
!738 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 2048, elements: !739)
!739 = !{!740}
!740 = !DISubrange(count: 256)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(name: "slotvec", scope: !655, file: !656, line: 845, type: !743, isLocal: true, isDefinition: true)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !656, line: 834, size: 128, elements: !745)
!745 = !{!746, !747}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !744, file: !656, line: 836, baseType: !79, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !744, file: !656, line: 837, baseType: !33, size: 64, offset: 64)
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(name: "nslots", scope: !655, file: !656, line: 843, type: !31, isLocal: true, isDefinition: true)
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(name: "slotvec0", scope: !655, file: !656, line: 844, type: !744, isLocal: true, isDefinition: true)
!752 = !DICompositeType(tag: DW_TAG_array_type, baseType: !753, size: 704, elements: !754)
!753 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !88)
!754 = !{!755}
!755 = !DISubrange(count: 11)
!756 = !DIGlobalVariableExpression(var: !757, expr: !DIExpression())
!757 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !758, file: !759, line: 26, type: !761, isLocal: false, isDefinition: true)
!758 = distinct !DICompileUnit(language: DW_LANG_C99, file: !759, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !155, globals: !760, splitDebugInlining: false, nameTableKind: None)
!759 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!760 = !{!756}
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 376, elements: !762)
!762 = !{!763}
!763 = !DISubrange(count: 47)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !766, file: !767, line: 507, type: !31, isLocal: true, isDefinition: true)
!766 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !767, file: !767, line: 488, type: !768, scopeLine: 489, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !770, retainedNodes: !781)
!767 = !DIFile(filename: "lib/fcntl.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!768 = !DISubroutineType(types: !769)
!769 = !{!31, !31, !31}
!770 = distinct !DICompileUnit(language: DW_LANG_C99, file: !767, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !155, retainedTypes: !771, globals: !780, splitDebugInlining: false, nameTableKind: None)
!771 = !{!772, !776}
!772 = !DISubprogram(name: "fcntl", scope: !773, file: !773, line: 176, type: !774, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!773 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
!774 = !DISubroutineType(types: !775)
!775 = !{!31, !31, !31, null}
!776 = !DISubprogram(name: "close", scope: !777, file: !777, line: 353, type: !778, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!777 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!778 = !DISubroutineType(types: !779)
!779 = !{!31, !31}
!780 = !{!764}
!781 = !{!782, !783, !784, !785, !788}
!782 = !DILocalVariable(name: "fd", arg: 1, scope: !766, file: !767, line: 488, type: !31)
!783 = !DILocalVariable(name: "target", arg: 2, scope: !766, file: !767, line: 488, type: !31)
!784 = !DILocalVariable(name: "result", scope: !766, file: !767, line: 490, type: !31)
!785 = !DILocalVariable(name: "flags", scope: !786, file: !767, line: 531, type: !31)
!786 = distinct !DILexicalBlock(scope: !787, file: !767, line: 530, column: 5)
!787 = distinct !DILexicalBlock(scope: !766, file: !767, line: 529, column: 7)
!788 = !DILocalVariable(name: "saved_errno", scope: !789, file: !767, line: 534, type: !31)
!789 = distinct !DILexicalBlock(scope: !790, file: !767, line: 533, column: 9)
!790 = distinct !DILexicalBlock(scope: !786, file: !767, line: 532, column: 11)
!791 = distinct !DICompileUnit(language: DW_LANG_C99, file: !792, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !793, retainedTypes: !794, splitDebugInlining: false, nameTableKind: None)
!792 = !DIFile(filename: "lib/fadvise.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!793 = !{!126}
!794 = !{!795, !798}
!795 = !DISubprogram(name: "posix_fadvise", scope: !773, file: !773, line: 288, type: !796, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!796 = !DISubroutineType(types: !797)
!797 = !{!31, !31, !55, !55, !31}
!798 = !DISubprogram(name: "fileno", scope: !232, file: !232, line: 786, type: !799, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!799 = !DISubroutineType(types: !800)
!800 = !{!31, !801}
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !28, line: 49, size: 1728, elements: !803)
!803 = !{!804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !802, file: !28, line: 51, baseType: !31, size: 32)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !802, file: !28, line: 54, baseType: !33, size: 64, offset: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !802, file: !28, line: 55, baseType: !33, size: 64, offset: 128)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !802, file: !28, line: 56, baseType: !33, size: 64, offset: 192)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !802, file: !28, line: 57, baseType: !33, size: 64, offset: 256)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !802, file: !28, line: 58, baseType: !33, size: 64, offset: 320)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !802, file: !28, line: 59, baseType: !33, size: 64, offset: 384)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !802, file: !28, line: 60, baseType: !33, size: 64, offset: 448)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !802, file: !28, line: 61, baseType: !33, size: 64, offset: 512)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !802, file: !28, line: 64, baseType: !33, size: 64, offset: 576)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !802, file: !28, line: 65, baseType: !33, size: 64, offset: 640)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !802, file: !28, line: 66, baseType: !33, size: 64, offset: 704)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !802, file: !28, line: 68, baseType: !46, size: 64, offset: 768)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !802, file: !28, line: 70, baseType: !801, size: 64, offset: 832)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !802, file: !28, line: 72, baseType: !31, size: 32, offset: 896)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !802, file: !28, line: 73, baseType: !31, size: 32, offset: 928)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !802, file: !28, line: 74, baseType: !53, size: 64, offset: 960)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !802, file: !28, line: 77, baseType: !57, size: 16, offset: 1024)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !802, file: !28, line: 78, baseType: !59, size: 8, offset: 1040)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !802, file: !28, line: 79, baseType: !61, size: 8, offset: 1048)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !802, file: !28, line: 81, baseType: !65, size: 64, offset: 1088)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !802, file: !28, line: 89, baseType: !68, size: 64, offset: 1152)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !802, file: !28, line: 91, baseType: !70, size: 64, offset: 1216)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !802, file: !28, line: 92, baseType: !73, size: 64, offset: 1280)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !802, file: !28, line: 93, baseType: !801, size: 64, offset: 1344)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !802, file: !28, line: 94, baseType: !77, size: 64, offset: 1408)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !802, file: !28, line: 95, baseType: !79, size: 64, offset: 1472)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !802, file: !28, line: 96, baseType: !31, size: 32, offset: 1536)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !802, file: !28, line: 98, baseType: !84, size: 160, offset: 1568)
!833 = distinct !DICompileUnit(language: DW_LANG_C99, file: !834, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !155, retainedTypes: !835, splitDebugInlining: false, nameTableKind: None)
!834 = !DIFile(filename: "lib/fopen-safer.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!835 = !{!836, !871, !873, !874, !776}
!836 = !DISubprogram(name: "fileno", scope: !232, file: !232, line: 786, type: !837, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!837 = !DISubroutineType(types: !838)
!838 = !{!31, !839}
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !28, line: 49, size: 1728, elements: !841)
!841 = !{!842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !840, file: !28, line: 51, baseType: !31, size: 32)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !840, file: !28, line: 54, baseType: !33, size: 64, offset: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !840, file: !28, line: 55, baseType: !33, size: 64, offset: 128)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !840, file: !28, line: 56, baseType: !33, size: 64, offset: 192)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !840, file: !28, line: 57, baseType: !33, size: 64, offset: 256)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !840, file: !28, line: 58, baseType: !33, size: 64, offset: 320)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !840, file: !28, line: 59, baseType: !33, size: 64, offset: 384)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !840, file: !28, line: 60, baseType: !33, size: 64, offset: 448)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !840, file: !28, line: 61, baseType: !33, size: 64, offset: 512)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !840, file: !28, line: 64, baseType: !33, size: 64, offset: 576)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !840, file: !28, line: 65, baseType: !33, size: 64, offset: 640)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !840, file: !28, line: 66, baseType: !33, size: 64, offset: 704)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !840, file: !28, line: 68, baseType: !46, size: 64, offset: 768)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !840, file: !28, line: 70, baseType: !839, size: 64, offset: 832)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !840, file: !28, line: 72, baseType: !31, size: 32, offset: 896)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !840, file: !28, line: 73, baseType: !31, size: 32, offset: 928)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !840, file: !28, line: 74, baseType: !53, size: 64, offset: 960)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !840, file: !28, line: 77, baseType: !57, size: 16, offset: 1024)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !840, file: !28, line: 78, baseType: !59, size: 8, offset: 1040)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !840, file: !28, line: 79, baseType: !61, size: 8, offset: 1048)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !840, file: !28, line: 81, baseType: !65, size: 64, offset: 1088)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !840, file: !28, line: 89, baseType: !68, size: 64, offset: 1152)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !840, file: !28, line: 91, baseType: !70, size: 64, offset: 1216)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !840, file: !28, line: 92, baseType: !73, size: 64, offset: 1280)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !840, file: !28, line: 93, baseType: !839, size: 64, offset: 1344)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !840, file: !28, line: 94, baseType: !77, size: 64, offset: 1408)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !840, file: !28, line: 95, baseType: !79, size: 64, offset: 1472)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !840, file: !28, line: 96, baseType: !31, size: 32, offset: 1536)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !840, file: !28, line: 98, baseType: !84, size: 160, offset: 1568)
!871 = !DISubprogram(name: "dup_safer", scope: !872, file: !872, line: 20, type: !778, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!872 = !DIFile(filename: "./lib/unistd-safer.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!873 = !DISubprogram(name: "rpl_fclose", scope: !228, file: !228, line: 672, type: !837, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!874 = !DISubprogram(name: "fdopen", scope: !232, file: !232, line: 279, type: !875, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!875 = !DISubroutineType(types: !876)
!876 = !{!839, !31, !88}
!877 = distinct !DICompileUnit(language: DW_LANG_C99, file: !878, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !155, retainedTypes: !879, splitDebugInlining: false, nameTableKind: None)
!878 = !DIFile(filename: "lib/gettime.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!879 = !{!880}
!880 = !DISubprogram(name: "clock_gettime", scope: !881, file: !881, line: 213, type: !882, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!881 = !DIFile(filename: "/usr/include/time.h", directory: "")
!882 = !DISubroutineType(types: !883)
!883 = !{!31, !31, !884}
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !276, line: 10, size: 128, elements: !886)
!886 = !{!887, !888}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !885, file: !276, line: 12, baseType: !279, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !885, file: !276, line: 16, baseType: !281, size: 64, offset: 64)
!889 = distinct !DICompileUnit(language: DW_LANG_C99, file: !890, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !155, retainedTypes: !891, splitDebugInlining: false, nameTableKind: None)
!890 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!891 = !{!892}
!892 = !DISubprogram(name: "setlocale_null_r", scope: !893, file: !893, line: 64, type: !894, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!893 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!894 = !DISubroutineType(types: !895)
!895 = !{!31, !31, !33, !81}
!896 = distinct !DICompileUnit(language: DW_LANG_C99, file: !897, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !155, retainedTypes: !898, splitDebugInlining: false, nameTableKind: None)
!897 = !DIFile(filename: "lib/imaxtostr.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!898 = !{!899}
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !336, line: 101, baseType: !900)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !54, line: 72, baseType: !55)
!901 = distinct !DICompileUnit(language: DW_LANG_C99, file: !902, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !903, retainedTypes: !904, splitDebugInlining: false, nameTableKind: None)
!902 = !DIFile(filename: "lib/mbswidth.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!903 = !{!135}
!904 = !{!905, !908, !79, !920, !921, !922, !255, !31, !57}
!905 = !DISubprogram(name: "mbsnwidth", scope: !309, file: !309, line: 55, type: !906, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!906 = !DISubroutineType(types: !907)
!907 = !{!31, !88, !81, !31}
!908 = !DISubprogram(name: "rpl_mbrtowc", scope: !688, file: !688, line: 717, type: !909, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!909 = !DISubroutineType(types: !910)
!910 = !{!81, !187, !88, !81, !911}
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !693, line: 13, size: 64, elements: !913)
!913 = !{!914, !915}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !912, file: !693, line: 15, baseType: !31, size: 32)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !912, file: !693, line: 20, baseType: !916, size: 32, offset: 32)
!916 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !912, file: !693, line: 16, size: 32, elements: !917)
!917 = !{!918, !919}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !916, file: !693, line: 18, baseType: !7, size: 32)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !916, file: !693, line: 19, baseType: !701, size: 32)
!920 = !DISubprogram(name: "wcwidth", scope: !709, file: !709, line: 367, type: !778, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!921 = !DISubprogram(name: "iswcntrl", scope: !705, file: !705, line: 104, type: !706, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!922 = !DISubprogram(name: "mbsinit", scope: !709, file: !709, line: 292, type: !923, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!923 = !DISubroutineType(types: !924)
!924 = !{!31, !925}
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !912)
!927 = distinct !DICompileUnit(language: DW_LANG_C99, file: !928, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !155, retainedTypes: !929, splitDebugInlining: false, nameTableKind: None)
!928 = !DIFile(filename: "lib/nstrftime.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!929 = !{!88, !7, !31, !59, !255, !256, !57, !55, !81, !257, !258, !79, !930, !77, !667, !948}
!930 = !DISubprogram(name: "strftime", scope: !881, file: !881, line: 88, type: !931, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!931 = !DISubroutineType(types: !932)
!932 = !{!81, !33, !81, !88, !933}
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !935)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !287, line: 7, size: 448, elements: !936)
!936 = !{!937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !935, file: !287, line: 9, baseType: !31, size: 32)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !935, file: !287, line: 10, baseType: !31, size: 32, offset: 32)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !935, file: !287, line: 11, baseType: !31, size: 32, offset: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !935, file: !287, line: 12, baseType: !31, size: 32, offset: 96)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !935, file: !287, line: 13, baseType: !31, size: 32, offset: 128)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !935, file: !287, line: 14, baseType: !31, size: 32, offset: 160)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !935, file: !287, line: 15, baseType: !31, size: 32, offset: 192)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !935, file: !287, line: 16, baseType: !31, size: 32, offset: 224)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !935, file: !287, line: 17, baseType: !31, size: 32, offset: 256)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !935, file: !287, line: 20, baseType: !55, size: 64, offset: 320)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !935, file: !287, line: 21, baseType: !88, size: 64, offset: 384)
!948 = !DISubprogram(name: "mktime_z", scope: !222, file: !222, line: 789, type: !949, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !155)
!949 = !DISubroutineType(types: !950)
!950 = !{!55, !951, !961}
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !953, line: 21, size: 128, elements: !954)
!953 = !DIFile(filename: "./lib/time-internal.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!954 = !{!955, !956, !957}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !952, file: !953, line: 25, baseType: !951, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "tz_is_set", scope: !952, file: !953, line: 36, baseType: !34, size: 8, offset: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "abbrs", scope: !952, file: !953, line: 48, baseType: !958, offset: 72)
!958 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, elements: !959)
!959 = !{!960}
!960 = !DISubrange(count: -1)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!962 = distinct !DICompileUnit(language: DW_LANG_C99, file: !963, producer: "clang version 10.0.0 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !155, retainedTypes: !964, splitDebugInlining: false, nameTableKind: None)
!963 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!964 = !{!77, !156}
