source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__locale_data = type opaque
%struct.__locale_struct = type { [13 x %struct.__locale_data*], i16*, i32*, i32*, [13 x i8*] }
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.infomap = type { i8*, i8* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [49 x i8] c"Usage: %s FORMAT [ARGUMENT]...\0A  or:  %s OPTION\0A\00", align 1
@.str.2 = private unnamed_addr constant [73 x i8] c"Print ARGUMENT(s) according to FORMAT, or execute according to OPTION:\0A\0A\00", align 1
@stdout = external local_unnamed_addr global %struct._IO_FILE*, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1 = distinct !DIGlobalVariable(name: "exit_status", scope: !2, file: !3, line: 76, type: !44, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !35, globals: !166, nameTableKind: None)
!3 = !DIFile(filename: "src/printf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !20}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!9 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 46, baseType: !7, size: 32, elements: !22)
!21 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!22 = !{!23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34}
!23 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!24 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!25 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!26 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!27 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!28 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!29 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!30 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!31 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!32 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!33 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!34 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!35 = !{!36, !46, !107, !111, !115, !118, !121, !128, !97, !40, !129, !133, !137, !141, !7, !44, !144, !145, !149, !153, !156, !77, !162}
!36 = !DISubprogram(name: "dcgettext", scope: !37, file: !37, line: 51, type: !38, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!37 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!38 = !DISubroutineType(types: !39)
!39 = !{!40, !42, !42, !44}
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!44 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!45 = !{}
!46 = !DISubprogram(name: "fputs_unlocked", scope: !47, file: !47, line: 662, type: !48, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!47 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!48 = !DISubroutineType(types: !49)
!49 = !{!44, !42, !50}
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !52, line: 49, size: 1728, elements: !53)
!52 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!53 = !{!54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !69, !70, !71, !72, !76, !78, !80, !84, !87, !89, !92, !95, !96, !98, !102, !103}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !51, file: !52, line: 51, baseType: !44, size: 32)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !51, file: !52, line: 54, baseType: !40, size: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !51, file: !52, line: 55, baseType: !40, size: 64, offset: 128)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !51, file: !52, line: 56, baseType: !40, size: 64, offset: 192)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !51, file: !52, line: 57, baseType: !40, size: 64, offset: 256)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !51, file: !52, line: 58, baseType: !40, size: 64, offset: 320)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !51, file: !52, line: 59, baseType: !40, size: 64, offset: 384)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !51, file: !52, line: 60, baseType: !40, size: 64, offset: 448)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !51, file: !52, line: 61, baseType: !40, size: 64, offset: 512)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !51, file: !52, line: 64, baseType: !40, size: 64, offset: 576)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !51, file: !52, line: 65, baseType: !40, size: 64, offset: 640)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !51, file: !52, line: 66, baseType: !40, size: 64, offset: 704)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !51, file: !52, line: 68, baseType: !67, size: 64, offset: 768)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !52, line: 36, flags: DIFlagFwdDecl)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !51, file: !52, line: 70, baseType: !50, size: 64, offset: 832)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !51, file: !52, line: 72, baseType: !44, size: 32, offset: 896)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !51, file: !52, line: 73, baseType: !44, size: 32, offset: 928)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !51, file: !52, line: 74, baseType: !73, size: 64, offset: 960)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !74, line: 152, baseType: !75)
!74 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!75 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !51, file: !52, line: 77, baseType: !77, size: 16, offset: 1024)
!77 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !51, file: !52, line: 78, baseType: !79, size: 8, offset: 1040)
!79 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !51, file: !52, line: 79, baseType: !81, size: 8, offset: 1048)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 8, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 1)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !51, file: !52, line: 81, baseType: !85, size: 64, offset: 1088)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !52, line: 43, baseType: null)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !51, file: !52, line: 89, baseType: !88, size: 64, offset: 1152)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !74, line: 153, baseType: !75)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !51, file: !52, line: 91, baseType: !90, size: 64, offset: 1216)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !52, line: 37, flags: DIFlagFwdDecl)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !51, file: !52, line: 92, baseType: !93, size: 64, offset: 1280)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !52, line: 38, flags: DIFlagFwdDecl)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !51, file: !52, line: 93, baseType: !50, size: 64, offset: 1344)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !51, file: !52, line: 94, baseType: !97, size: 64, offset: 1408)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !51, file: !52, line: 95, baseType: !99, size: 64, offset: 1472)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !100, line: 46, baseType: !101)
!100 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!101 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !51, file: !52, line: 96, baseType: !44, size: 32, offset: 1536)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !51, file: !52, line: 98, baseType: !104, size: 160, offset: 1568)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 160, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 20)
!107 = !DISubprogram(name: "set_program_name", scope: !108, file: !108, line: 37, type: !109, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!108 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!109 = !DISubroutineType(types: !110)
!110 = !{null, !42}
!111 = !DISubprogram(name: "setlocale", scope: !112, file: !112, line: 122, type: !113, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!112 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!113 = !DISubroutineType(types: !114)
!114 = !{!40, !44, !42}
!115 = !DISubprogram(name: "bindtextdomain", scope: !37, file: !37, line: 86, type: !116, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!116 = !DISubroutineType(types: !117)
!117 = !{!40, !42, !42}
!118 = !DISubprogram(name: "textdomain", scope: !37, file: !37, line: 82, type: !119, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!119 = !DISubroutineType(types: !120)
!120 = !{!40, !42}
!121 = !DISubprogram(name: "atexit", scope: !122, file: !122, line: 595, type: !123, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!122 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!123 = !DISubroutineType(types: !124)
!124 = !{!44, !125}
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{null}
!128 = !DISubprogram(name: "getenv", scope: !122, file: !122, line: 634, type: !119, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!129 = !DISubprogram(name: "version_etc", scope: !130, file: !130, line: 69, type: !131, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!130 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!131 = !DISubroutineType(types: !132)
!132 = !{null, !50, !42, !42, !42, null}
!133 = !DISubprogram(name: "error", scope: !134, file: !134, line: 52, type: !135, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!134 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!135 = !DISubroutineType(types: !136)
!136 = !{null, !44, !44, !42, null}
!137 = !DISubprogram(name: "quote", scope: !138, file: !138, line: 44, type: !139, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!138 = !DIFile(filename: "./lib/quote.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!139 = !DISubroutineType(types: !140)
!140 = !{!42, !42}
!141 = !DISubprogram(name: "quotearg_style", scope: !6, file: !6, line: 377, type: !142, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!142 = !DISubroutineType(types: !143)
!143 = !{!40, !5, !42}
!144 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!145 = !DISubprogram(name: "xmalloc", scope: !146, file: !146, line: 53, type: !147, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!146 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!147 = !DISubroutineType(types: !148)
!148 = !{!97, !101}
!149 = !DISubprogram(name: "xprintf", scope: !150, file: !150, line: 35, type: !151, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!150 = !DIFile(filename: "./lib/xprintf.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!151 = !DISubroutineType(types: !152)
!152 = !{!44, !42, null}
!153 = !DISubprogram(name: "free", scope: !122, file: !122, line: 565, type: !154, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!154 = !DISubroutineType(types: !155)
!155 = !{null, !97}
!156 = !DISubprogram(name: "cl_strtold", scope: !157, file: !157, line: 2, type: !158, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!157 = !DIFile(filename: "./lib/cl-strtod.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!158 = !DISubroutineType(types: !159)
!159 = !{!160, !42, !161}
!160 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!162 = !DISubprogram(name: "print_unicode_char", scope: !163, file: !163, line: 40, type: !164, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!163 = !DIFile(filename: "./lib/unicodeio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!164 = !DISubroutineType(types: !165)
!165 = !{null, !50, !7, !44}
!166 = !{!167, !168, !171}
!167 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "posixly_correct", scope: !2, file: !3, line: 79, type: !170, isLocal: true, isDefinition: true)
!170 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(name: "cfcc_msg", scope: !2, file: !3, line: 83, type: !173, isLocal: true, isDefinition: true)
!173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(name: "Version", scope: !176, file: !177, line: 2, type: !42, isDefinition: true)
!176 = distinct !DICompileUnit(language: DW_LANG_C99, file: !177, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !45, globals: !178, nameTableKind: None)
!177 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!178 = !{!174}
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(name: "file_name", scope: !181, file: !182, line: 46, type: !42, isLocal: true, isDefinition: true)
!181 = distinct !DICompileUnit(language: DW_LANG_C99, file: !182, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !45, retainedTypes: !183, globals: !221, nameTableKind: None)
!182 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!183 = !{!184, !36, !220, !133}
!184 = !DISubprogram(name: "close_stream", scope: !185, file: !185, line: 2, type: !186, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!185 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!186 = !DISubroutineType(types: !187)
!187 = !{!44, !188}
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !52, line: 49, size: 1728, elements: !190)
!190 = !{!191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !189, file: !52, line: 51, baseType: !44, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !189, file: !52, line: 54, baseType: !40, size: 64, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !189, file: !52, line: 55, baseType: !40, size: 64, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !189, file: !52, line: 56, baseType: !40, size: 64, offset: 192)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !189, file: !52, line: 57, baseType: !40, size: 64, offset: 256)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !189, file: !52, line: 58, baseType: !40, size: 64, offset: 320)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !189, file: !52, line: 59, baseType: !40, size: 64, offset: 384)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !189, file: !52, line: 60, baseType: !40, size: 64, offset: 448)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !189, file: !52, line: 61, baseType: !40, size: 64, offset: 512)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !189, file: !52, line: 64, baseType: !40, size: 64, offset: 576)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !189, file: !52, line: 65, baseType: !40, size: 64, offset: 640)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !189, file: !52, line: 66, baseType: !40, size: 64, offset: 704)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !189, file: !52, line: 68, baseType: !67, size: 64, offset: 768)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !189, file: !52, line: 70, baseType: !188, size: 64, offset: 832)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !189, file: !52, line: 72, baseType: !44, size: 32, offset: 896)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !189, file: !52, line: 73, baseType: !44, size: 32, offset: 928)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !189, file: !52, line: 74, baseType: !73, size: 64, offset: 960)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !189, file: !52, line: 77, baseType: !77, size: 16, offset: 1024)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !189, file: !52, line: 78, baseType: !79, size: 8, offset: 1040)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !189, file: !52, line: 79, baseType: !81, size: 8, offset: 1048)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !189, file: !52, line: 81, baseType: !85, size: 64, offset: 1088)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !189, file: !52, line: 89, baseType: !88, size: 64, offset: 1152)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !189, file: !52, line: 91, baseType: !90, size: 64, offset: 1216)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !189, file: !52, line: 92, baseType: !93, size: 64, offset: 1280)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !189, file: !52, line: 93, baseType: !188, size: 64, offset: 1344)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !189, file: !52, line: 94, baseType: !97, size: 64, offset: 1408)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !189, file: !52, line: 95, baseType: !99, size: 64, offset: 1472)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !189, file: !52, line: 96, baseType: !44, size: 32, offset: 1536)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !189, file: !52, line: 98, baseType: !104, size: 160, offset: 1568)
!220 = !DISubprogram(name: "quotearg_colon", scope: !6, file: !6, line: 391, type: !119, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!221 = !{!179, !222}
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !181, file: !182, line: 56, type: !170, isLocal: true, isDefinition: true)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(name: "exit_failure", scope: !226, file: !227, line: 24, type: !229, isDefinition: true)
!226 = distinct !DICompileUnit(language: DW_LANG_C99, file: !227, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !45, globals: !228, nameTableKind: None)
!227 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!228 = !{!224}
!229 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !44)
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(name: "program_name", scope: !232, file: !233, line: 33, type: !42, isDefinition: true)
!232 = distinct !DICompileUnit(language: DW_LANG_C99, file: !233, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !45, retainedTypes: !234, globals: !270, nameTableKind: None)
!233 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!234 = !{!97, !235, !40}
!235 = !DISubprogram(name: "fputs", scope: !47, file: !47, line: 626, type: !236, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!236 = !DISubroutineType(types: !237)
!237 = !{!44, !42, !238}
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !52, line: 49, size: 1728, elements: !240)
!240 = !{!241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !239, file: !52, line: 51, baseType: !44, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !239, file: !52, line: 54, baseType: !40, size: 64, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !239, file: !52, line: 55, baseType: !40, size: 64, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !239, file: !52, line: 56, baseType: !40, size: 64, offset: 192)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !239, file: !52, line: 57, baseType: !40, size: 64, offset: 256)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !239, file: !52, line: 58, baseType: !40, size: 64, offset: 320)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !239, file: !52, line: 59, baseType: !40, size: 64, offset: 384)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !239, file: !52, line: 60, baseType: !40, size: 64, offset: 448)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !239, file: !52, line: 61, baseType: !40, size: 64, offset: 512)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !239, file: !52, line: 64, baseType: !40, size: 64, offset: 576)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !239, file: !52, line: 65, baseType: !40, size: 64, offset: 640)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !239, file: !52, line: 66, baseType: !40, size: 64, offset: 704)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !239, file: !52, line: 68, baseType: !67, size: 64, offset: 768)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !239, file: !52, line: 70, baseType: !238, size: 64, offset: 832)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !239, file: !52, line: 72, baseType: !44, size: 32, offset: 896)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !239, file: !52, line: 73, baseType: !44, size: 32, offset: 928)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !239, file: !52, line: 74, baseType: !73, size: 64, offset: 960)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !239, file: !52, line: 77, baseType: !77, size: 16, offset: 1024)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !239, file: !52, line: 78, baseType: !79, size: 8, offset: 1040)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !239, file: !52, line: 79, baseType: !81, size: 8, offset: 1048)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !239, file: !52, line: 81, baseType: !85, size: 64, offset: 1088)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !239, file: !52, line: 89, baseType: !88, size: 64, offset: 1152)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !239, file: !52, line: 91, baseType: !90, size: 64, offset: 1216)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !239, file: !52, line: 92, baseType: !93, size: 64, offset: 1280)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !239, file: !52, line: 93, baseType: !238, size: 64, offset: 1344)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !239, file: !52, line: 94, baseType: !97, size: 64, offset: 1408)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !239, file: !52, line: 95, baseType: !99, size: 64, offset: 1472)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !239, file: !52, line: 96, baseType: !44, size: 32, offset: 1536)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !239, file: !52, line: 98, baseType: !104, size: 160, offset: 1568)
!270 = !{!230}
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !273, file: !274, line: 85, type: !373, isDefinition: true)
!273 = distinct !DICompileUnit(language: DW_LANG_C99, file: !274, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !275, retainedTypes: !281, globals: !346, nameTableKind: None)
!274 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!275 = !{!5, !276, !20}
!276 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, baseType: !7, size: 32, elements: !277)
!277 = !{!278, !279, !280}
!278 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!279 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!280 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!281 = !{!282, !287, !153, !303, !44, !77, !306, !99, !324, !328, !36, !334, !338, !40, !145, !342, !343}
!282 = !DISubprogram(name: "xmemdup", scope: !146, file: !146, line: 62, type: !283, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!283 = !DISubroutineType(types: !284)
!284 = !{!97, !285, !101}
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!287 = !DISubprogram(name: "quotearg_alloc_mem", scope: !6, file: !6, line: 342, type: !288, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!288 = !DISubroutineType(types: !289)
!289 = !{!40, !42, !101, !290, !291}
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !293)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !274, line: 65, size: 448, elements: !294)
!294 = !{!295, !296, !297, !301, !302}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !293, file: !274, line: 68, baseType: !5, size: 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !293, file: !274, line: 71, baseType: !44, size: 32, offset: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !293, file: !274, line: 75, baseType: !298, size: 256, offset: 64)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !299)
!299 = !{!300}
!300 = !DISubrange(count: 8)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !293, file: !274, line: 78, baseType: !42, size: 64, offset: 320)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !293, file: !274, line: 81, baseType: !42, size: 64, offset: 384)
!303 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !6, file: !6, line: 408, type: !304, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!304 = !DISubroutineType(types: !305)
!305 = !{!40, !44, !42, !42, !42, !101}
!306 = !DISubprogram(name: "rpl_mbrtowc", scope: !307, file: !307, line: 717, type: !308, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!307 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!308 = !DISubroutineType(types: !309)
!309 = !{!101, !310, !42, !101, !311}
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !313, line: 13, size: 64, elements: !314)
!313 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!314 = !{!315, !316}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !312, file: !313, line: 15, baseType: !44, size: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !312, file: !313, line: 20, baseType: !317, size: 32, offset: 32)
!317 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !312, file: !313, line: 16, size: 32, elements: !318)
!318 = !{!319, !320}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !317, file: !313, line: 18, baseType: !7, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !317, file: !313, line: 19, baseType: !321, size: 32)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 32, elements: !322)
!322 = !{!323}
!323 = !DISubrange(count: 4)
!324 = !DISubprogram(name: "iswprint", scope: !325, file: !325, line: 120, type: !326, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!325 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!326 = !DISubroutineType(types: !327)
!327 = !{!44, !7}
!328 = !DISubprogram(name: "mbsinit", scope: !329, file: !329, line: 292, type: !330, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!329 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!330 = !DISubroutineType(types: !331)
!331 = !{!44, !332}
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !312)
!334 = !DISubprogram(name: "locale_charset", scope: !335, file: !335, line: 35, type: !336, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!335 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!336 = !DISubroutineType(types: !337)
!337 = !{!42}
!338 = !DISubprogram(name: "c_strcasecmp", scope: !339, file: !339, line: 42, type: !340, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!339 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!340 = !DISubroutineType(types: !341)
!341 = !{!44, !42, !42}
!342 = !DISubprogram(name: "xalloc_die", scope: !146, file: !146, line: 51, type: !126, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !45)
!343 = !DISubprogram(name: "xrealloc", scope: !146, file: !146, line: 59, type: !344, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!344 = !DISubroutineType(types: !345)
!345 = !{!97, !97, !101}
!346 = !{!271, !347, !353, !355, !357, !362, !369, !371}
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !273, file: !274, line: 101, type: !349, isDefinition: true)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !350, size: 320, elements: !351)
!350 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!351 = !{!352}
!352 = !DISubrange(count: 10)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !273, file: !274, line: 1052, type: !293, isDefinition: true)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !273, file: !274, line: 116, type: !293, isLocal: true, isDefinition: true)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(name: "slot0", scope: !273, file: !274, line: 842, type: !359, isLocal: true, isDefinition: true)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 2048, elements: !360)
!360 = !{!361}
!361 = !DISubrange(count: 256)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "slotvec", scope: !273, file: !274, line: 845, type: !364, isLocal: true, isDefinition: true)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !274, line: 834, size: 128, elements: !366)
!366 = !{!367, !368}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !365, file: !274, line: 836, baseType: !99, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !365, file: !274, line: 837, baseType: !40, size: 64, offset: 64)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(name: "nslots", scope: !273, file: !274, line: 843, type: !44, isLocal: true, isDefinition: true)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(name: "slotvec0", scope: !273, file: !274, line: 844, type: !365, isLocal: true, isDefinition: true)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 704, elements: !374)
!374 = !{!375}
!375 = !DISubrange(count: 11)
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!377 = distinct !DIGlobalVariable(name: "initialized", scope: !378, file: !379, line: 71, type: !44, isLocal: true, isDefinition: true)
!378 = distinct !DISubprogram(name: "unicode_to_mb", scope: !379, file: !379, line: 64, type: !380, scopeLine: 70, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !388, retainedNodes: !444)
!379 = !DIFile(filename: "lib/unicodeio.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!380 = !DISubroutineType(types: !381)
!381 = !{!75, !7, !382, !385, !97}
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{!75, !42, !99, !97}
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{!75, !7, !42, !97}
!388 = distinct !DICompileUnit(language: DW_LANG_C99, file: !379, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !45, retainedTypes: !389, globals: !438, nameTableKind: None)
!389 = !{!334, !390, !394, !395, !161, !396, !99, !399, !434, !97, !36, !133}
!390 = !DISubprogram(name: "iconv_open", scope: !391, file: !391, line: 37, type: !392, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!391 = !DIFile(filename: "/usr/include/iconv.h", directory: "")
!392 = !DISubroutineType(types: !393)
!393 = !{!97, !42, !42}
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "iconv_t", file: !391, line: 29, baseType: !97)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!396 = !DISubprogram(name: "iconv", scope: !391, file: !391, line: 42, type: !397, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!397 = !DISubroutineType(types: !398)
!398 = !{!101, !97, !161, !290, !161, !290}
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !401, line: 7, baseType: !402)
!401 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "")
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !52, line: 49, size: 1728, elements: !403)
!403 = !{!404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !402, file: !52, line: 51, baseType: !44, size: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !402, file: !52, line: 54, baseType: !40, size: 64, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !402, file: !52, line: 55, baseType: !40, size: 64, offset: 128)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !402, file: !52, line: 56, baseType: !40, size: 64, offset: 192)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !402, file: !52, line: 57, baseType: !40, size: 64, offset: 256)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !402, file: !52, line: 58, baseType: !40, size: 64, offset: 320)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !402, file: !52, line: 59, baseType: !40, size: 64, offset: 384)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !402, file: !52, line: 60, baseType: !40, size: 64, offset: 448)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !402, file: !52, line: 61, baseType: !40, size: 64, offset: 512)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !402, file: !52, line: 64, baseType: !40, size: 64, offset: 576)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !402, file: !52, line: 65, baseType: !40, size: 64, offset: 640)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !402, file: !52, line: 66, baseType: !40, size: 64, offset: 704)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !402, file: !52, line: 68, baseType: !67, size: 64, offset: 768)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !402, file: !52, line: 70, baseType: !418, size: 64, offset: 832)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !402, file: !52, line: 72, baseType: !44, size: 32, offset: 896)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !402, file: !52, line: 73, baseType: !44, size: 32, offset: 928)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !402, file: !52, line: 74, baseType: !73, size: 64, offset: 960)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !402, file: !52, line: 77, baseType: !77, size: 16, offset: 1024)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !402, file: !52, line: 78, baseType: !79, size: 8, offset: 1040)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !402, file: !52, line: 79, baseType: !81, size: 8, offset: 1048)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !402, file: !52, line: 81, baseType: !85, size: 64, offset: 1088)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !402, file: !52, line: 89, baseType: !88, size: 64, offset: 1152)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !402, file: !52, line: 91, baseType: !90, size: 64, offset: 1216)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !402, file: !52, line: 92, baseType: !93, size: 64, offset: 1280)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !402, file: !52, line: 93, baseType: !418, size: 64, offset: 1344)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !402, file: !52, line: 94, baseType: !97, size: 64, offset: 1408)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !402, file: !52, line: 95, baseType: !99, size: 64, offset: 1472)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !402, file: !52, line: 96, baseType: !44, size: 32, offset: 1536)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !402, file: !52, line: 98, baseType: !104, size: 160, offset: 1568)
!434 = !DISubprogram(name: "u8_uctomb_aux", scope: !435, file: !435, line: 309, type: !436, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!435 = !DIFile(filename: "./lib/unistr.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!436 = !DISubroutineType(types: !437)
!437 = !{!44, !395, !7, !44}
!438 = !{!439, !440, !442}
!439 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(name: "is_utf8", scope: !378, file: !379, line: 72, type: !44, isLocal: true, isDefinition: true)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(name: "utf8_to_local", scope: !378, file: !379, line: 74, type: !394, isLocal: true, isDefinition: true)
!444 = !{!445, !446, !447, !448, !449, !453, !454, !457, !463, !464, !465, !466, !467}
!445 = !DILocalVariable(name: "code", arg: 1, scope: !378, file: !379, line: 64, type: !7)
!446 = !DILocalVariable(name: "success", arg: 2, scope: !378, file: !379, line: 65, type: !382)
!447 = !DILocalVariable(name: "failure", arg: 3, scope: !378, file: !379, line: 67, type: !385)
!448 = !DILocalVariable(name: "callback_arg", arg: 4, scope: !378, file: !379, line: 69, type: !97)
!449 = !DILocalVariable(name: "inbuf", scope: !378, file: !379, line: 77, type: !450)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 48, elements: !451)
!451 = !{!452}
!452 = !DISubrange(count: 6)
!453 = !DILocalVariable(name: "count", scope: !378, file: !379, line: 78, type: !44)
!454 = !DILocalVariable(name: "charset", scope: !455, file: !379, line: 82, type: !42)
!455 = distinct !DILexicalBlock(scope: !456, file: !379, line: 81, column: 5)
!456 = distinct !DILexicalBlock(scope: !378, file: !379, line: 80, column: 7)
!457 = !DILocalVariable(name: "outbuf", scope: !458, file: !379, line: 116, type: !460)
!458 = distinct !DILexicalBlock(scope: !459, file: !379, line: 115, column: 5)
!459 = distinct !DILexicalBlock(scope: !378, file: !379, line: 114, column: 7)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 200, elements: !461)
!461 = !{!462}
!462 = !DISubrange(count: 25)
!463 = !DILocalVariable(name: "inptr", scope: !458, file: !379, line: 117, type: !42)
!464 = !DILocalVariable(name: "inbytesleft", scope: !458, file: !379, line: 118, type: !99)
!465 = !DILocalVariable(name: "outptr", scope: !458, file: !379, line: 119, type: !40)
!466 = !DILocalVariable(name: "outbytesleft", scope: !458, file: !379, line: 120, type: !99)
!467 = !DILocalVariable(name: "res", scope: !458, file: !379, line: 121, type: !99)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !470, file: !471, line: 26, type: !473, isDefinition: true)
!470 = distinct !DICompileUnit(language: DW_LANG_C99, file: !471, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !45, globals: !472, nameTableKind: None)
!471 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!472 = !{!468}
!473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 376, elements: !474)
!474 = !{!475}
!475 = !DISubrange(count: 47)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(name: "c_locale_cache", scope: !478, file: !510, line: 50, type: !511, isLocal: true, isDefinition: true)
!478 = distinct !DICompileUnit(language: DW_LANG_C99, file: !479, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !45, retainedTypes: !480, globals: !509, nameTableKind: None)
!479 = !DIFile(filename: "lib/c-strtold.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!480 = !{!40, !481, !503, !506}
!481 = !DISubprogram(name: "uselocale", scope: !112, file: !112, line: 187, type: !482, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!482 = !DISubroutineType(types: !483)
!483 = !{!484, !484}
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_struct", file: !486, line: 28, size: 1856, elements: !487)
!486 = !DIFile(filename: "/usr/include/bits/types/__locale_t.h", directory: "")
!487 = !{!488, !494, !497, !500, !501}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "__locales", scope: !485, file: !486, line: 31, baseType: !489, size: 832)
!489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !490, size: 832, elements: !492)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_data", file: !486, line: 31, flags: DIFlagFwdDecl)
!492 = !{!493}
!493 = !DISubrange(count: 13)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !485, file: !486, line: 34, baseType: !495, size: 64, offset: 832)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !77)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower", scope: !485, file: !486, line: 35, baseType: !498, size: 64, offset: 896)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper", scope: !485, file: !486, line: 36, baseType: !498, size: 64, offset: 960)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "__names", scope: !485, file: !486, line: 39, baseType: !502, size: 832, offset: 1024)
!502 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 832, elements: !492)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "locale_t", file: !504, line: 24, baseType: !505)
!504 = !DIFile(filename: "/usr/include/bits/types/locale_t.h", directory: "")
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !486, line: 42, baseType: !484)
!506 = !DISubprogram(name: "newlocale", scope: !112, file: !112, line: 141, type: !507, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!507 = !DISubroutineType(types: !508)
!508 = !{!484, !44, !42, !484}
!509 = !{!476}
!510 = !DIFile(filename: "./lib/c-strtod.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!511 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !503)
!512 = distinct !DICompileUnit(language: DW_LANG_C99, file: !513, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !45, retainedTypes: !514, nameTableKind: None)
!513 = !DIFile(filename: "lib/cl-strtold.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!514 = !{!515}
!515 = !DISubprogram(name: "c_strtold", scope: !516, file: !516, line: 41, type: !158, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!516 = !DIFile(filename: "./lib/c-strtod.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!517 = distinct !DICompileUnit(language: DW_LANG_C99, file: !518, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !45, nameTableKind: None)
!518 = !DIFile(filename: "lib/unistr/u8-uctomb-aux.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!519 = distinct !DICompileUnit(language: DW_LANG_C99, file: !520, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !521, retainedTypes: !525, nameTableKind: None)
!520 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!521 = !{!522}
!522 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !520, line: 40, baseType: !7, size: 32, elements: !523)
!523 = !{!524}
!524 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!525 = !{!36, !526, !97}
!526 = !DISubprogram(name: "fputs_unlocked", scope: !47, file: !47, line: 662, type: !527, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!527 = !DISubroutineType(types: !528)
!528 = !{!44, !42, !529}
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !52, line: 49, size: 1728, elements: !531)
!531 = !{!532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !530, file: !52, line: 51, baseType: !44, size: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !530, file: !52, line: 54, baseType: !40, size: 64, offset: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !530, file: !52, line: 55, baseType: !40, size: 64, offset: 128)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !530, file: !52, line: 56, baseType: !40, size: 64, offset: 192)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !530, file: !52, line: 57, baseType: !40, size: 64, offset: 256)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !530, file: !52, line: 58, baseType: !40, size: 64, offset: 320)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !530, file: !52, line: 59, baseType: !40, size: 64, offset: 384)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !530, file: !52, line: 60, baseType: !40, size: 64, offset: 448)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !530, file: !52, line: 61, baseType: !40, size: 64, offset: 512)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !530, file: !52, line: 64, baseType: !40, size: 64, offset: 576)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !530, file: !52, line: 65, baseType: !40, size: 64, offset: 640)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !530, file: !52, line: 66, baseType: !40, size: 64, offset: 704)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !530, file: !52, line: 68, baseType: !67, size: 64, offset: 768)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !530, file: !52, line: 70, baseType: !529, size: 64, offset: 832)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !530, file: !52, line: 72, baseType: !44, size: 32, offset: 896)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !530, file: !52, line: 73, baseType: !44, size: 32, offset: 928)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !530, file: !52, line: 74, baseType: !73, size: 64, offset: 960)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !530, file: !52, line: 77, baseType: !77, size: 16, offset: 1024)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !530, file: !52, line: 78, baseType: !79, size: 8, offset: 1040)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !530, file: !52, line: 79, baseType: !81, size: 8, offset: 1048)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !530, file: !52, line: 81, baseType: !85, size: 64, offset: 1088)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !530, file: !52, line: 89, baseType: !88, size: 64, offset: 1152)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !530, file: !52, line: 91, baseType: !90, size: 64, offset: 1216)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !530, file: !52, line: 92, baseType: !93, size: 64, offset: 1280)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !530, file: !52, line: 93, baseType: !529, size: 64, offset: 1344)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !530, file: !52, line: 94, baseType: !97, size: 64, offset: 1408)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !530, file: !52, line: 95, baseType: !99, size: 64, offset: 1472)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !530, file: !52, line: 96, baseType: !44, size: 32, offset: 1536)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !530, file: !52, line: 98, baseType: !104, size: 160, offset: 1568)
!561 = distinct !DICompileUnit(language: DW_LANG_C99, file: !562, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !563, retainedTypes: !576, nameTableKind: None)
!562 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!563 = !{!564}
!564 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !565, file: !146, line: 186, baseType: !7, size: 32, elements: !574)
!565 = distinct !DISubprogram(name: "x2nrealloc", scope: !146, file: !146, line: 174, type: !566, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !561, retainedNodes: !569)
!566 = !DISubroutineType(types: !567)
!567 = !{!97, !97, !568, !99}
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!569 = !{!570, !571, !572, !573}
!570 = !DILocalVariable(name: "p", arg: 1, scope: !565, file: !146, line: 174, type: !97)
!571 = !DILocalVariable(name: "pn", arg: 2, scope: !565, file: !146, line: 174, type: !568)
!572 = !DILocalVariable(name: "s", arg: 3, scope: !565, file: !146, line: 174, type: !99)
!573 = !DILocalVariable(name: "n", scope: !565, file: !146, line: 176, type: !99)
!574 = !{!575}
!575 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!576 = !{!99, !342, !145, !343, !40, !153, !97, !577, !580}
!577 = !DISubprogram(name: "xcalloc", scope: !146, file: !146, line: 57, type: !578, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!578 = !DISubroutineType(types: !579)
!579 = !{!97, !101, !101}
!580 = !DISubprogram(name: "rpl_calloc", scope: !581, file: !581, line: 688, type: !578, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!581 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!582 = distinct !DICompileUnit(language: DW_LANG_C99, file: !583, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !45, retainedTypes: !584, nameTableKind: None)
!583 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!584 = !{!36, !133}
!585 = distinct !DICompileUnit(language: DW_LANG_C99, file: !586, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !45, retainedTypes: !587, nameTableKind: None)
!586 = !DIFile(filename: "lib/xprintf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!587 = !{!588, !598, !36, !133, !633}
!588 = !DISubprogram(name: "xvprintf", scope: !150, file: !150, line: 37, type: !589, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!589 = !DISubroutineType(types: !590)
!590 = !{!44, !42, !591}
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !586, line: 34, size: 192, elements: !593)
!593 = !{!594, !595, !596, !597}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !592, file: !586, line: 34, baseType: !7, size: 32)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !592, file: !586, line: 34, baseType: !7, size: 32, offset: 32)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !592, file: !586, line: 34, baseType: !97, size: 64, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !592, file: !586, line: 34, baseType: !97, size: 64, offset: 128)
!598 = !DISubprogram(name: "ferror", scope: !47, file: !47, line: 761, type: !599, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!599 = !DISubroutineType(types: !600)
!600 = !{!44, !601}
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !52, line: 49, size: 1728, elements: !603)
!603 = !{!604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !602, file: !52, line: 51, baseType: !44, size: 32)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !602, file: !52, line: 54, baseType: !40, size: 64, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !602, file: !52, line: 55, baseType: !40, size: 64, offset: 128)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !602, file: !52, line: 56, baseType: !40, size: 64, offset: 192)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !602, file: !52, line: 57, baseType: !40, size: 64, offset: 256)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !602, file: !52, line: 58, baseType: !40, size: 64, offset: 320)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !602, file: !52, line: 59, baseType: !40, size: 64, offset: 384)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !602, file: !52, line: 60, baseType: !40, size: 64, offset: 448)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !602, file: !52, line: 61, baseType: !40, size: 64, offset: 512)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !602, file: !52, line: 64, baseType: !40, size: 64, offset: 576)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !602, file: !52, line: 65, baseType: !40, size: 64, offset: 640)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !602, file: !52, line: 66, baseType: !40, size: 64, offset: 704)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !602, file: !52, line: 68, baseType: !67, size: 64, offset: 768)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !602, file: !52, line: 70, baseType: !601, size: 64, offset: 832)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !602, file: !52, line: 72, baseType: !44, size: 32, offset: 896)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !602, file: !52, line: 73, baseType: !44, size: 32, offset: 928)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !602, file: !52, line: 74, baseType: !73, size: 64, offset: 960)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !602, file: !52, line: 77, baseType: !77, size: 16, offset: 1024)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !602, file: !52, line: 78, baseType: !79, size: 8, offset: 1040)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !602, file: !52, line: 79, baseType: !81, size: 8, offset: 1048)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !602, file: !52, line: 81, baseType: !85, size: 64, offset: 1088)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !602, file: !52, line: 89, baseType: !88, size: 64, offset: 1152)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !602, file: !52, line: 91, baseType: !90, size: 64, offset: 1216)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !602, file: !52, line: 92, baseType: !93, size: 64, offset: 1280)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !602, file: !52, line: 93, baseType: !601, size: 64, offset: 1344)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !602, file: !52, line: 94, baseType: !97, size: 64, offset: 1408)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !602, file: !52, line: 95, baseType: !99, size: 64, offset: 1472)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !602, file: !52, line: 96, baseType: !44, size: 32, offset: 1536)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !602, file: !52, line: 98, baseType: !104, size: 160, offset: 1568)
!633 = !DISubprogram(name: "xvfprintf", scope: !150, file: !150, line: 41, type: !634, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!634 = !DISubroutineType(types: !635)
!635 = !{!44, !601, !42, !591}
!636 = distinct !DICompileUnit(language: DW_LANG_C99, file: !637, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !45, retainedTypes: !638, nameTableKind: None)
!637 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!638 = !{!97}
!639 = distinct !DICompileUnit(language: DW_LANG_C99, file: !640, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !45, retainedTypes: !641, nameTableKind: None)
!640 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!641 = !{!642, !99, !654}
!642 = !DISubprogram(name: "mbrtowc", scope: !329, file: !329, line: 296, type: !643, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!643 = !DISubroutineType(types: !644)
!644 = !{!101, !310, !42, !101, !645}
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !313, line: 13, size: 64, elements: !647)
!647 = !{!648, !649}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !646, file: !313, line: 15, baseType: !44, size: 32)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !646, file: !313, line: 20, baseType: !650, size: 32, offset: 32)
!650 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !646, file: !313, line: 16, size: 32, elements: !651)
!651 = !{!652, !653}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !650, file: !313, line: 18, baseType: !7, size: 32)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !650, file: !313, line: 19, baseType: !321, size: 32)
!654 = !DISubprogram(name: "hard_locale", scope: !655, file: !655, line: 26, type: !656, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!655 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!656 = !DISubroutineType(types: !657)
!657 = !{!170, !44}
!658 = distinct !DICompileUnit(language: DW_LANG_C99, file: !659, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !45, retainedTypes: !660, nameTableKind: None)
!659 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!660 = !{!661}
!661 = !DISubprogram(name: "rpl_fclose", scope: !662, file: !662, line: 672, type: !663, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!662 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!663 = !DISubroutineType(types: !664)
!664 = !{!44, !665}
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !52, line: 49, size: 1728, elements: !667)
!667 = !{!668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !666, file: !52, line: 51, baseType: !44, size: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !666, file: !52, line: 54, baseType: !40, size: 64, offset: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !666, file: !52, line: 55, baseType: !40, size: 64, offset: 128)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !666, file: !52, line: 56, baseType: !40, size: 64, offset: 192)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !666, file: !52, line: 57, baseType: !40, size: 64, offset: 256)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !666, file: !52, line: 58, baseType: !40, size: 64, offset: 320)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !666, file: !52, line: 59, baseType: !40, size: 64, offset: 384)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !666, file: !52, line: 60, baseType: !40, size: 64, offset: 448)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !666, file: !52, line: 61, baseType: !40, size: 64, offset: 512)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !666, file: !52, line: 64, baseType: !40, size: 64, offset: 576)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !666, file: !52, line: 65, baseType: !40, size: 64, offset: 640)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !666, file: !52, line: 66, baseType: !40, size: 64, offset: 704)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !666, file: !52, line: 68, baseType: !67, size: 64, offset: 768)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !666, file: !52, line: 70, baseType: !665, size: 64, offset: 832)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !666, file: !52, line: 72, baseType: !44, size: 32, offset: 896)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !666, file: !52, line: 73, baseType: !44, size: 32, offset: 928)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !666, file: !52, line: 74, baseType: !73, size: 64, offset: 960)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !666, file: !52, line: 77, baseType: !77, size: 16, offset: 1024)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !666, file: !52, line: 78, baseType: !79, size: 8, offset: 1040)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !666, file: !52, line: 79, baseType: !81, size: 8, offset: 1048)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !666, file: !52, line: 81, baseType: !85, size: 64, offset: 1088)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !666, file: !52, line: 89, baseType: !88, size: 64, offset: 1152)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !666, file: !52, line: 91, baseType: !90, size: 64, offset: 1216)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !666, file: !52, line: 92, baseType: !93, size: 64, offset: 1280)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !666, file: !52, line: 93, baseType: !665, size: 64, offset: 1344)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !666, file: !52, line: 94, baseType: !97, size: 64, offset: 1408)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !666, file: !52, line: 95, baseType: !99, size: 64, offset: 1472)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !666, file: !52, line: 96, baseType: !44, size: 32, offset: 1536)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !666, file: !52, line: 98, baseType: !104, size: 160, offset: 1568)
!697 = distinct !DICompileUnit(language: DW_LANG_C99, file: !698, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !45, retainedTypes: !699, nameTableKind: None)
!698 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!699 = !{!700}
!700 = !DISubprogram(name: "setlocale_null_r", scope: !701, file: !701, line: 64, type: !702, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !45)
!701 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!702 = !DISubroutineType(types: !703)
!703 = !{!44, !44, !40, !101}
!704 = distinct !DICompileUnit(language: DW_LANG_C99, file: !705, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !706, retainedTypes: !1093, nameTableKind: None)
!705 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!706 = !{!707}
!707 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !708, line: 41, baseType: !7, size: 32, elements: !709)
!708 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!709 = !{!710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092}
!710 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!711 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!712 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!713 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!714 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!715 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!716 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!717 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!718 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!719 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!720 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!721 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!722 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!723 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!724 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!725 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!726 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!727 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!728 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!729 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!730 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!731 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!732 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!733 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!734 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!735 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!736 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!737 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!738 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!739 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!740 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!741 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!742 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!743 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!744 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!745 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!746 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!747 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!748 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!749 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!750 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!751 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!752 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!753 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!754 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!755 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!756 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!757 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!758 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!759 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!760 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!761 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!762 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!763 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!764 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!765 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!766 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!767 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!768 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!769 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!770 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!771 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!772 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!773 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!774 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!779 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!780 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!781 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!782 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!783 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!784 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!785 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!786 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!787 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!788 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!789 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!790 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!791 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!792 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!793 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!794 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!795 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!796 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!797 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!798 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!799 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!800 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!801 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!802 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!803 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!804 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!805 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!806 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!807 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!808 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!809 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!810 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!812 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!813 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!814 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!815 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!816 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!817 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!818 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!819 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!820 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!821 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!822 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!823 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!824 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!825 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!826 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!827 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!828 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!829 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!830 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!831 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!832 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!833 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!834 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!835 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!836 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!837 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!838 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!839 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!840 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!841 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!842 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!843 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!844 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!845 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!846 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!847 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!884 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!885 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!886 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!887 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!894 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!895 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!896 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!897 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!898 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!899 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!900 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!901 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!902 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!903 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!904 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!905 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!906 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!907 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!908 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!909 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!910 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!911 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!912 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!913 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!914 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!915 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!916 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!917 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!918 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!919 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!920 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!921 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!922 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!923 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!924 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!925 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!926 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!927 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!928 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!929 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!930 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!931 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!932 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!933 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!934 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!935 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!936 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!937 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!938 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!939 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!940 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!941 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!942 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!943 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!944 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!945 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!946 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!947 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!948 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!949 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!950 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!951 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!952 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!953 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!954 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!955 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!956 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!957 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!958 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!959 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!960 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!961 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!962 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!963 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!964 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!965 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!966 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!967 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!968 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!969 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!970 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!971 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!972 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!973 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!974 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!975 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!976 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!977 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!978 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!979 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!980 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!981 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!982 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!983 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!984 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!985 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!986 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!987 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!988 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!989 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!990 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!991 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!992 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!993 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!994 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!995 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!996 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!997 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!998 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!999 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!1000 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!1001 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!1002 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
