; ModuleID = 'coreutils-8.32/src/printf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__locale_struct = type { [13 x %struct.__locale_data*], i16*, i32*, i32*, [13 x i8*] }
%struct.__locale_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [49 x i8] c"Usage: %s FORMAT [ARGUMENT]...\0A  or:  %s OPTION\0A\00", align 1
@.str.2 = private unnamed_addr constant [73 x i8] c"Print ARGUMENT(s) according to FORMAT, or execute according to OPTION:\0A\0A\00", align 1
@stdout = external local_unnamed_addr global %struct._IO_FILE*, align 8

!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!39 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!40 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!41 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!42 = !{!43, !44, !47}
!43 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "posixly_correct", scope: !2, file: !3, line: 79, type: !46, isLocal: true, isDefinition: true)
!46 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!47 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression())
!48 = distinct !DIGlobalVariable(name: "cfcc_msg", scope: !2, file: !3, line: 83, type: !49, isLocal: true, isDefinition: true)
!49 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(name: "Version", scope: !54, file: !55, line: 2, type: !50, isLocal: false, isDefinition: true)
!54 = distinct !DICompileUnit(language: DW_LANG_C99, file: !55, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !56, globals: !57, splitDebugInlining: false, nameTableKind: None)
!55 = !DIFile(filename: "src/version.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!56 = !{}
!57 = !{!52}
!58 = !DIGlobalVariableExpression(var: !59, expr: !DIExpression())
!59 = distinct !DIGlobalVariable(name: "file_name", scope: !60, file: !61, line: 46, type: !50, isLocal: true, isDefinition: true)
!60 = distinct !DICompileUnit(language: DW_LANG_C99, file: !61, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !56, globals: !62, splitDebugInlining: false, nameTableKind: None)
!61 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!62 = !{!58, !63}
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !60, file: !61, line: 56, type: !46, isLocal: true, isDefinition: true)
!65 = !DIGlobalVariableExpression(var: !66, expr: !DIExpression())
!66 = distinct !DIGlobalVariable(name: "exit_failure", scope: !67, file: !68, line: 24, type: !70, isLocal: false, isDefinition: true)
!67 = distinct !DICompileUnit(language: DW_LANG_C99, file: !68, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !56, globals: !69, splitDebugInlining: false, nameTableKind: None)
!68 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!69 = !{!65}
!70 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !39)
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(name: "program_name", scope: !73, file: !74, line: 33, type: !50, isLocal: false, isDefinition: true)
!73 = distinct !DICompileUnit(language: DW_LANG_C99, file: !74, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !56, retainedTypes: !75, globals: !76, splitDebugInlining: false, nameTableKind: None)
!74 = !DIFile(filename: "lib/progname.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!75 = !{!36, !37}
!76 = !{!71}
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !79, file: !80, line: 85, type: !128, isLocal: false, isDefinition: true)
!79 = distinct !DICompileUnit(language: DW_LANG_C99, file: !80, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !81, retainedTypes: !87, globals: !91, splitDebugInlining: false, nameTableKind: None)
!80 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!81 = !{!5, !82, !20}
!82 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, baseType: !7, size: 32, elements: !83)
!83 = !{!84, !85, !86}
!84 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!85 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!86 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!87 = !{!39, !41, !88, !37}
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !89, line: 46, baseType: !90)
!89 = !DIFile(filename: "/usr/lib/clang/12.0.1/include/stddef.h", directory: "")
!90 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!91 = !{!77, !92, !98, !110, !112, !117, !124, !126}
!92 = !DIGlobalVariableExpression(var: !93, expr: !DIExpression())
!93 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !79, file: !80, line: 101, type: !94, isLocal: false, isDefinition: true)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 320, elements: !96)
!95 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!96 = !{!97}
!97 = !DISubrange(count: 10)
!98 = !DIGlobalVariableExpression(var: !99, expr: !DIExpression())
!99 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !79, file: !80, line: 1052, type: !100, isLocal: false, isDefinition: true)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !80, line: 65, size: 448, elements: !101)
!101 = !{!102, !103, !104, !108, !109}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !100, file: !80, line: 68, baseType: !5, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !100, file: !80, line: 71, baseType: !39, size: 32, offset: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !100, file: !80, line: 75, baseType: !105, size: 256, offset: 64)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 8)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !100, file: !80, line: 78, baseType: !50, size: 64, offset: 320)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !100, file: !80, line: 81, baseType: !50, size: 64, offset: 384)
!110 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression())
!111 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !79, file: !80, line: 116, type: !100, isLocal: true, isDefinition: true)
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(name: "slot0", scope: !79, file: !80, line: 842, type: !114, isLocal: true, isDefinition: true)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 2048, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 256)
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(name: "slotvec", scope: !79, file: !80, line: 845, type: !119, isLocal: true, isDefinition: true)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !80, line: 834, size: 128, elements: !121)
!121 = !{!122, !123}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !120, file: !80, line: 836, baseType: !88, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !120, file: !80, line: 837, baseType: !37, size: 64, offset: 64)
!124 = !DIGlobalVariableExpression(var: !125, expr: !DIExpression())
!125 = distinct !DIGlobalVariable(name: "nslots", scope: !79, file: !80, line: 843, type: !39, isLocal: true, isDefinition: true)
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(name: "slotvec0", scope: !79, file: !80, line: 844, type: !120, isLocal: true, isDefinition: true)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 704, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 11)
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!132 = distinct !DIGlobalVariable(name: "initialized", scope: !133, file: !134, line: 71, type: !39, isLocal: true, isDefinition: true)
!133 = distinct !DISubprogram(name: "unicode_to_mb", scope: !134, file: !134, line: 64, type: !135, scopeLine: 70, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !144, retainedNodes: !210)
!134 = !DIFile(filename: "lib/unicodeio.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!135 = !DISubroutineType(types: !136)
!136 = !{!137, !7, !138, !141, !36}
!137 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{!137, !50, !88, !36}
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!137, !7, !50, !36}
!144 = distinct !DICompileUnit(language: DW_LANG_C99, file: !134, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !56, retainedTypes: !145, globals: !204, splitDebugInlining: false, nameTableKind: None)
!145 = !{!146, !148, !149, !88, !150, !36}
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "iconv_t", file: !147, line: 29, baseType: !36)
!147 = !DIFile(filename: "/usr/include/iconv.h", directory: "")
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !152, line: 7, baseType: !153)
!152 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "")
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !154, line: 49, size: 1728, elements: !155)
!154 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!155 = !{!156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !171, !173, !174, !175, !178, !179, !181, !185, !188, !190, !193, !196, !197, !198, !199, !200}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !153, file: !154, line: 51, baseType: !39, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !153, file: !154, line: 54, baseType: !37, size: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !153, file: !154, line: 55, baseType: !37, size: 64, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !153, file: !154, line: 56, baseType: !37, size: 64, offset: 192)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !153, file: !154, line: 57, baseType: !37, size: 64, offset: 256)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !153, file: !154, line: 58, baseType: !37, size: 64, offset: 320)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !153, file: !154, line: 59, baseType: !37, size: 64, offset: 384)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !153, file: !154, line: 60, baseType: !37, size: 64, offset: 448)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !153, file: !154, line: 61, baseType: !37, size: 64, offset: 512)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !153, file: !154, line: 64, baseType: !37, size: 64, offset: 576)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !153, file: !154, line: 65, baseType: !37, size: 64, offset: 640)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !153, file: !154, line: 66, baseType: !37, size: 64, offset: 704)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !153, file: !154, line: 68, baseType: !169, size: 64, offset: 768)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !154, line: 36, flags: DIFlagFwdDecl)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !153, file: !154, line: 70, baseType: !172, size: 64, offset: 832)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !153, file: !154, line: 72, baseType: !39, size: 32, offset: 896)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !153, file: !154, line: 73, baseType: !39, size: 32, offset: 928)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !153, file: !154, line: 74, baseType: !176, size: 64, offset: 960)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !177, line: 152, baseType: !137)
!177 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !153, file: !154, line: 77, baseType: !41, size: 16, offset: 1024)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !153, file: !154, line: 78, baseType: !180, size: 8, offset: 1040)
!180 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !153, file: !154, line: 79, baseType: !182, size: 8, offset: 1048)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 8, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 1)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !153, file: !154, line: 81, baseType: !186, size: 64, offset: 1088)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !154, line: 43, baseType: null)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !153, file: !154, line: 89, baseType: !189, size: 64, offset: 1152)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !177, line: 153, baseType: !137)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !153, file: !154, line: 91, baseType: !191, size: 64, offset: 1216)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !154, line: 37, flags: DIFlagFwdDecl)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !153, file: !154, line: 92, baseType: !194, size: 64, offset: 1280)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !154, line: 38, flags: DIFlagFwdDecl)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !153, file: !154, line: 93, baseType: !172, size: 64, offset: 1344)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !153, file: !154, line: 94, baseType: !36, size: 64, offset: 1408)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !153, file: !154, line: 95, baseType: !88, size: 64, offset: 1472)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !153, file: !154, line: 96, baseType: !39, size: 32, offset: 1536)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !153, file: !154, line: 98, baseType: !201, size: 160, offset: 1568)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 160, elements: !202)
!202 = !{!203}
!203 = !DISubrange(count: 20)
!204 = !{!205, !206, !208}
!205 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(name: "is_utf8", scope: !133, file: !134, line: 72, type: !39, isLocal: true, isDefinition: true)
!208 = !DIGlobalVariableExpression(var: !209, expr: !DIExpression())
!209 = distinct !DIGlobalVariable(name: "utf8_to_local", scope: !133, file: !134, line: 74, type: !146, isLocal: true, isDefinition: true)
!210 = !{!211, !212, !213, !214, !215, !219, !220, !223, !229, !230, !231, !232, !233}
!211 = !DILocalVariable(name: "code", arg: 1, scope: !133, file: !134, line: 64, type: !7)
!212 = !DILocalVariable(name: "success", arg: 2, scope: !133, file: !134, line: 65, type: !138)
!213 = !DILocalVariable(name: "failure", arg: 3, scope: !133, file: !134, line: 67, type: !141)
!214 = !DILocalVariable(name: "callback_arg", arg: 4, scope: !133, file: !134, line: 69, type: !36)
!215 = !DILocalVariable(name: "inbuf", scope: !133, file: !134, line: 77, type: !216)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 48, elements: !217)
!217 = !{!218}
!218 = !DISubrange(count: 6)
!219 = !DILocalVariable(name: "count", scope: !133, file: !134, line: 78, type: !39)
!220 = !DILocalVariable(name: "charset", scope: !221, file: !134, line: 82, type: !50)
!221 = distinct !DILexicalBlock(scope: !222, file: !134, line: 81, column: 5)
!222 = distinct !DILexicalBlock(scope: !133, file: !134, line: 80, column: 7)
!223 = !DILocalVariable(name: "outbuf", scope: !224, file: !134, line: 116, type: !226)
!224 = distinct !DILexicalBlock(scope: !225, file: !134, line: 115, column: 5)
!225 = distinct !DILexicalBlock(scope: !133, file: !134, line: 114, column: 7)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 200, elements: !227)
!227 = !{!228}
!228 = !DISubrange(count: 25)
!229 = !DILocalVariable(name: "inptr", scope: !224, file: !134, line: 117, type: !50)
!230 = !DILocalVariable(name: "inbytesleft", scope: !224, file: !134, line: 118, type: !88)
!231 = !DILocalVariable(name: "outptr", scope: !224, file: !134, line: 119, type: !37)
!232 = !DILocalVariable(name: "outbytesleft", scope: !224, file: !134, line: 120, type: !88)
!233 = !DILocalVariable(name: "res", scope: !224, file: !134, line: 121, type: !88)
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !236, file: !237, line: 26, type: !239, isLocal: false, isDefinition: true)
!236 = distinct !DICompileUnit(language: DW_LANG_C99, file: !237, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !56, globals: !238, splitDebugInlining: false, nameTableKind: None)
!237 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!238 = !{!234}
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 376, elements: !240)
!240 = !{!241}
!241 = !DISubrange(count: 47)
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(name: "c_locale_cache", scope: !244, file: !270, line: 50, type: !271, isLocal: true, isDefinition: true)
!244 = distinct !DICompileUnit(language: DW_LANG_C99, file: !245, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !56, retainedTypes: !246, globals: !269, splitDebugInlining: false, nameTableKind: None)
!245 = !DIFile(filename: "lib/c-strtold.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!246 = !{!37, !247}
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "locale_t", file: !248, line: 24, baseType: !249)
!248 = !DIFile(filename: "/usr/include/bits/types/locale_t.h", directory: "")
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !250, line: 42, baseType: !251)
!250 = !DIFile(filename: "/usr/include/bits/types/__locale_t.h", directory: "")
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_struct", file: !250, line: 28, size: 1856, elements: !253)
!253 = !{!254, !260, !263, !266, !267}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "__locales", scope: !252, file: !250, line: 31, baseType: !255, size: 832)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !256, size: 832, elements: !258)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_data", file: !250, line: 31, flags: DIFlagFwdDecl)
!258 = !{!259}
!259 = !DISubrange(count: 13)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !252, file: !250, line: 34, baseType: !261, size: 64, offset: 832)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower", scope: !252, file: !250, line: 35, baseType: !264, size: 64, offset: 896)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper", scope: !252, file: !250, line: 36, baseType: !264, size: 64, offset: 960)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "__names", scope: !252, file: !250, line: 39, baseType: !268, size: 832, offset: 1024)
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 832, elements: !258)
!269 = !{!242}
!270 = !DIFile(filename: "./lib/c-strtod.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!271 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !247)
!272 = distinct !DICompileUnit(language: DW_LANG_C99, file: !273, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !56, splitDebugInlining: false, nameTableKind: None)
!273 = !DIFile(filename: "lib/cl-strtold.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!274 = distinct !DICompileUnit(language: DW_LANG_C99, file: !275, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !56, splitDebugInlining: false, nameTableKind: None)
!275 = !DIFile(filename: "lib/unistr/u8-uctomb-aux.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!276 = distinct !DICompileUnit(language: DW_LANG_C99, file: !277, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !278, retainedTypes: !282, splitDebugInlining: false, nameTableKind: None)
!277 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!278 = !{!279}
!279 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !277, line: 40, baseType: !7, size: 32, elements: !280)
!280 = !{!281}
!281 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!282 = !{!36}
!283 = distinct !DICompileUnit(language: DW_LANG_C99, file: !284, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !285, retainedTypes: !299, splitDebugInlining: false, nameTableKind: None)
!284 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!285 = !{!286}
!286 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !288, file: !287, line: 186, baseType: !7, size: 32, elements: !297)
!287 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!288 = distinct !DISubprogram(name: "x2nrealloc", scope: !287, file: !287, line: 174, type: !289, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !283, retainedNodes: !292)
!289 = !DISubroutineType(types: !290)
!290 = !{!36, !36, !291, !88}
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!292 = !{!293, !294, !295, !296}
!293 = !DILocalVariable(name: "p", arg: 1, scope: !288, file: !287, line: 174, type: !36)
!294 = !DILocalVariable(name: "pn", arg: 2, scope: !288, file: !287, line: 174, type: !291)
!295 = !DILocalVariable(name: "s", arg: 3, scope: !288, file: !287, line: 174, type: !88)
!296 = !DILocalVariable(name: "n", scope: !288, file: !287, line: 176, type: !88)
!297 = !{!298}
!298 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!299 = !{!88, !37, !36}
!300 = distinct !DICompileUnit(language: DW_LANG_C99, file: !301, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !56, splitDebugInlining: false, nameTableKind: None)
!301 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!302 = distinct !DICompileUnit(language: DW_LANG_C99, file: !303, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !56, splitDebugInlining: false, nameTableKind: None)
!303 = !DIFile(filename: "lib/xprintf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!304 = distinct !DICompileUnit(language: DW_LANG_C99, file: !305, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !56, retainedTypes: !282, splitDebugInlining: false, nameTableKind: None)
!305 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!306 = distinct !DICompileUnit(language: DW_LANG_C99, file: !307, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !56, retainedTypes: !308, splitDebugInlining: false, nameTableKind: None)
!307 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!308 = !{!88}
!309 = distinct !DICompileUnit(language: DW_LANG_C99, file: !310, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !56, splitDebugInlining: false, nameTableKind: None)
!310 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!311 = distinct !DICompileUnit(language: DW_LANG_C99, file: !312, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !56, splitDebugInlining: false, nameTableKind: None)
!312 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!313 = distinct !DICompileUnit(language: DW_LANG_C99, file: !314, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !315, retainedTypes: !282, splitDebugInlining: false, nameTableKind: None)
!314 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!315 = !{!316}
!316 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !317, line: 41, baseType: !7, size: 32, elements: !318)
!317 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!318 = !{!319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701}
!319 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!320 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!321 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!322 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!323 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!324 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!325 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!326 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!327 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!328 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!329 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!330 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!331 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!332 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!333 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!334 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!335 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!336 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!337 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!338 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!339 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!340 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!341 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!342 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!343 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!344 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!345 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!346 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!347 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!348 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!349 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!350 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!351 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!352 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!353 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!354 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!355 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!356 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!357 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!358 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!359 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!360 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!361 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!362 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!363 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!364 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!365 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!366 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!367 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!368 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!369 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!370 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!371 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!372 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!373 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!374 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!375 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!376 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!377 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!378 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!379 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!380 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!381 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!382 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!383 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!384 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!385 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!386 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!387 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!388 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!389 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!390 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!391 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!392 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!393 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!394 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!395 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!396 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!397 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!398 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!399 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!400 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!401 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!402 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!403 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!404 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!405 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!406 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!407 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!408 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!409 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!410 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!411 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!412 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!413 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!414 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!415 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!416 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!417 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!418 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!419 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!420 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!421 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!422 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!423 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!424 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!425 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!426 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!427 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!428 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!429 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!430 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!431 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!432 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!433 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!434 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!435 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!436 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!437 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!438 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!439 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!440 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!441 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!442 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!443 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!444 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!445 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!446 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!447 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!448 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!449 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!450 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!451 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!452 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!453 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!454 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!455 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!456 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!457 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!458 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!459 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!460 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!461 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!462 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!463 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!464 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!465 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!466 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!467 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!468 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!469 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!470 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!471 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!472 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!473 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!474 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!475 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!476 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!477 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!478 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!479 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!480 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!481 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!482 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!483 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!484 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!485 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!486 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!487 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!488 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!489 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!490 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!491 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!492 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!493 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!494 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!495 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!496 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!497 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!498 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!499 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!500 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!501 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!502 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!503 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!504 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!505 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!506 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!507 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!508 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!509 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!510 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!511 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!512 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!513 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!514 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!515 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!516 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!517 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!518 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!519 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!520 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!521 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!522 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!523 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!524 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!525 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!526 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!527 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!528 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!529 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!530 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!531 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!532 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!533 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!534 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!535 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!536 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!537 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!538 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!539 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!540 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!541 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!542 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!543 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!544 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!545 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!546 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!547 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!548 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!549 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!550 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!551 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!552 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!553 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!554 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!555 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!556 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!557 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!558 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!559 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!560 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!561 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!562 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!563 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!564 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!565 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!566 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!567 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!568 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!569 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!570 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!571 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!572 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!573 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!574 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!575 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!576 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!577 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!578 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!579 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!580 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!581 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!582 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!583 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!584 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!585 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!586 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!587 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!588 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!589 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!590 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!591 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!592 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!593 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!594 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!595 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!596 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!597 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!598 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!599 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!600 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!601 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!602 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!603 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!604 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!605 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!606 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!607 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!608 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!609 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!610 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!611 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!612 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!613 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!614 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!615 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!616 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!617 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!618 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!619 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!620 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!621 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!622 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!623 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!624 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!625 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!626 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!627 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!628 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!629 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!630 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!631 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!632 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!633 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!634 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!635 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!636 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!637 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!638 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!643 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!644 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!645 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!646 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!661 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!662 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!663 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!664 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!665 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!666 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!667 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!668 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!669 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!670 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!671 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!672 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!673 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!674 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!675 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!676 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!677 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!678 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!679 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!680 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!681 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!682 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!683 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!684 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!685 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!686 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!687 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!688 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!689 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!690 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!691 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!692 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!693 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!694 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!695 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!696 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!697 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!698 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!699 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!700 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!701 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!702 = distinct !DICompileUnit(language: DW_LANG_C99, file: !703, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !56, retainedTypes: !282, splitDebugInlining: false, nameTableKind: None)
!703 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!704 = distinct !DICompileUnit(language: DW_LANG_C99, file: !705, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !56, splitDebugInlining: false, nameTableKind: None)
!705 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!706 = distinct !DICompileUnit(language: DW_LANG_C99, file: !707, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !56, retainedTypes: !282, splitDebugInlining: false, nameTableKind: None)
!707 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!708 = distinct !DICompileUnit(language: DW_LANG_C99, file: !709, producer: "clang version 12.0.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !56, retainedTypes: !282, splitDebugInlining: false, nameTableKind: None)
!709 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!710 = !{!"clang version 12.0.1"}
!711 = !{i32 7, !"Dwarf Version", i32 4}
!712 = !{i32 2, !"Debug Info Version", i32 3}
!713 = !{i32 1, !"wchar_size", i32 4}
!714 = !{i32 7, !"PIC Level", i32 2}
!715 = !{i32 7, !"PIE Level", i32 2}
!716 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 87, type: !717, scopeLine: 88, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !719)
!717 = !DISubroutineType(types: !718)
!718 = !{null, !39}
!719 = !{!720}
!720 = !DILocalVariable(name: "status", arg: 1, scope: !716, file: !3, line: 87, type: !39)
!721 = !DILocation(line: 0, scope: !716)
!722 = !DILocation(line: 89, column: 14, scope: !723)
!723 = distinct !DILexicalBlock(scope: !716, file: !3, line: 89, column: 7)
!724 = !DILocation(line: 89, column: 7, scope: !716)
!725 = !DILocation(line: 90, column: 5, scope: !726)
!726 = distinct !DILexicalBlock(scope: !723, file: !3, line: 90, column: 5)
!727 = !{!728, !728, i64 0}
!728 = !{!"any pointer", !729, i64 0}
!729 = !{!"omnipotent char", !730, i64 0}
!730 = !{!"Simple C/C++ TBAA"}
!731 = !DILocation(line: 93, column: 7, scope: !732)
!732 = distinct !DILexicalBlock(scope: !723, file: !3, line: 92, column: 5)
!733 = !DILocation(line: 98, column: 7, scope: !732)
!734 = !DILocation(line: 102, column: 7, scope: !732)
!735 = !DILocation(line: 103, column: 7, scope: !732)
!736 = !DILocation(line: 104, column: 7, scope: !732)
!737 = !DILocation(line: 110, column: 7, scope: !732)
!738 = !DILocation(line: 122, column: 7, scope: !732)
!739 = !DILocation(line: 128, column: 7, scope: !732)
!740 = !DILocation(line: 138, column: 7, scope: !732)
!741 = !DILocalVariable(name: "program", arg: 1, scope: !742, file: !743, line: 634, type: !50)
!742 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !743, file: !743, line: 634, type: !744, scopeLine: 635, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !746)
!743 = !DIFile(filename: "src/system.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!744 = !DISubroutineType(types: !745)
!745 = !{null, !50}
!746 = !{!741, !747, !756, !757, !759}
!747 = !DILocalVariable(name: "infomap", scope: !742, file: !743, line: 636, type: !748)
!748 = !DICompositeType(tag: DW_TAG_array_type, baseType: !749, size: 896, elements: !754)
!749 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !750)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !742, file: !743, line: 636, size: 128, elements: !751)
!751 = !{!752, !753}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !750, file: !743, line: 636, baseType: !50, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !750, file: !743, line: 636, baseType: !50, size: 64, offset: 64)
!754 = !{!755}
!755 = !DISubrange(count: 7)
!756 = !DILocalVariable(name: "node", scope: !742, file: !743, line: 646, type: !50)
!757 = !DILocalVariable(name: "map_prog", scope: !742, file: !743, line: 647, type: !758)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!759 = !DILocalVariable(name: "lc_messages", scope: !742, file: !743, line: 659, type: !50)
!760 = !DILocation(line: 0, scope: !742, inlinedAt: !761)
!761 = distinct !DILocation(line: 139, column: 7, scope: !732)
!762 = !DILocation(line: 636, column: 3, scope: !742, inlinedAt: !761)
!763 = !DILocation(line: 636, column: 67, scope: !742, inlinedAt: !761)
!764 = !DILocation(line: 647, column: 36, scope: !742, inlinedAt: !761)
!765 = !DILocation(line: 649, column: 3, scope: !742, inlinedAt: !761)
!766 = !DILocation(line: 649, column: 33, scope: !742, inlinedAt: !761)
!767 = !DILocation(line: 650, column: 13, scope: !742, inlinedAt: !761)
!768 = !DILocation(line: 649, column: 20, scope: !742, inlinedAt: !761)
!769 = !{!770, !728, i64 0}
!770 = !{!"infomap", !728, i64 0, !728, i64 8}
!771 = !DILocation(line: 649, column: 10, scope: !742, inlinedAt: !761)
!772 = !DILocation(line: 649, column: 28, scope: !742, inlinedAt: !761)
!773 = distinct !{!773, !765, !767, !774}
!774 = !{!"llvm.loop.mustprogress"}
!775 = !DILocation(line: 652, column: 17, scope: !776, inlinedAt: !761)
!776 = distinct !DILexicalBlock(scope: !742, file: !743, line: 652, column: 7)
!777 = !{!770, !728, i64 8}
!778 = !DILocation(line: 652, column: 7, scope: !776, inlinedAt: !761)
!779 = !DILocation(line: 652, column: 7, scope: !742, inlinedAt: !761)
!780 = !DILocation(line: 655, column: 3, scope: !742, inlinedAt: !761)
!781 = !DILocation(line: 659, column: 29, scope: !742, inlinedAt: !761)
!782 = !DILocation(line: 660, column: 7, scope: !783, inlinedAt: !761)
!783 = distinct !DILexicalBlock(scope: !742, file: !743, line: 660, column: 7)
!784 = !DILocation(line: 660, column: 19, scope: !783, inlinedAt: !761)
!785 = !DILocation(line: 660, column: 22, scope: !783, inlinedAt: !761)
!786 = !DILocation(line: 660, column: 7, scope: !742, inlinedAt: !761)
!787 = !DILocation(line: 666, column: 7, scope: !788, inlinedAt: !761)
!788 = distinct !DILexicalBlock(scope: !783, file: !743, line: 661, column: 5)
!789 = !DILocation(line: 668, column: 5, scope: !788, inlinedAt: !761)
!790 = !DILocation(line: 669, column: 3, scope: !742, inlinedAt: !761)
!791 = !DILocation(line: 671, column: 3, scope: !742, inlinedAt: !761)
!792 = !DILocation(line: 673, column: 1, scope: !742, inlinedAt: !761)
!793 = !DILocation(line: 141, column: 3, scope: !716)
!794 = !DISubprogram(name: "dcgettext", scope: !795, file: !795, line: 51, type: !796, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !56)
!795 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!796 = !DISubroutineType(types: !797)
!797 = !{!37, !50, !50, !39}
!798 = !DISubprogram(name: "fputs_unlocked", scope: !799, file: !799, line: 667, type: !800, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !56)
!799 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!800 = !DISubroutineType(types: !801)
!801 = !{!39, !50, !802}
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !154, line: 49, size: 1728, elements: !804)
!804 = !{!805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !803, file: !154, line: 51, baseType: !39, size: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !803, file: !154, line: 54, baseType: !37, size: 64, offset: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !803, file: !154, line: 55, baseType: !37, size: 64, offset: 128)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !803, file: !154, line: 56, baseType: !37, size: 64, offset: 192)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !803, file: !154, line: 57, baseType: !37, size: 64, offset: 256)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !803, file: !154, line: 58, baseType: !37, size: 64, offset: 320)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !803, file: !154, line: 59, baseType: !37, size: 64, offset: 384)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !803, file: !154, line: 60, baseType: !37, size: 64, offset: 448)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !803, file: !154, line: 61, baseType: !37, size: 64, offset: 512)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !803, file: !154, line: 64, baseType: !37, size: 64, offset: 576)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !803, file: !154, line: 65, baseType: !37, size: 64, offset: 640)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !803, file: !154, line: 66, baseType: !37, size: 64, offset: 704)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !803, file: !154, line: 68, baseType: !169, size: 64, offset: 768)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !803, file: !154, line: 70, baseType: !802, size: 64, offset: 832)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !803, file: !154, line: 72, baseType: !39, size: 32, offset: 896)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !803, file: !154, line: 73, baseType: !39, size: 32, offset: 928)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !803, file: !154, line: 74, baseType: !176, size: 64, offset: 960)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !803, file: !154, line: 77, baseType: !41, size: 16, offset: 1024)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !803, file: !154, line: 78, baseType: !180, size: 8, offset: 1040)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !803, file: !154, line: 79, baseType: !182, size: 8, offset: 1048)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !803, file: !154, line: 81, baseType: !186, size: 64, offset: 1088)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !803, file: !154, line: 89, baseType: !189, size: 64, offset: 1152)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !803, file: !154, line: 91, baseType: !191, size: 64, offset: 1216)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !803, file: !154, line: 92, baseType: !194, size: 64, offset: 1280)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !803, file: !154, line: 93, baseType: !802, size: 64, offset: 1344)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !803, file: !154, line: 94, baseType: !36, size: 64, offset: 1408)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !803, file: !154, line: 95, baseType: !88, size: 64, offset: 1472)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !803, file: !154, line: 96, baseType: !39, size: 32, offset: 1536)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !803, file: !154, line: 98, baseType: !201, size: 160, offset: 1568)
!834 = !DISubprogram(name: "setlocale", scope: !835, file: !835, line: 122, type: !836, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !56)
!835 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!836 = !DISubroutineType(types: !837)
!837 = !{!37, !39, !50}
!838 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 651, type: !839, scopeLine: 652, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !841)
!839 = !DISubroutineType(types: !840)
!840 = !{!39, !39, !149}
!841 = !{!842, !843, !844, !845}
!842 = !DILocalVariable(name: "argc", arg: 1, scope: !838, file: !3, line: 651, type: !39)
!843 = !DILocalVariable(name: "argv", arg: 2, scope: !838, file: !3, line: 651, type: !149)
!844 = !DILocalVariable(name: "format", scope: !838, file: !3, line: 653, type: !37)
!845 = !DILocalVariable(name: "args_used", scope: !838, file: !3, line: 654, type: !39)
!846 = !DILocation(line: 0, scope: !838)
!847 = !DILocation(line: 657, column: 21, scope: !838)
!848 = !DILocation(line: 657, column: 3, scope: !838)
!849 = !DILocation(line: 658, column: 3, scope: !838)
!850 = !DILocation(line: 659, column: 3, scope: !838)
!851 = !DILocation(line: 660, column: 3, scope: !838)
!852 = !DILocation(line: 662, column: 3, scope: !838)
!853 = !DILocation(line: 664, column: 15, scope: !838)
!854 = !DILocation(line: 666, column: 22, scope: !838)
!855 = !DILocation(line: 666, column: 49, scope: !838)
!856 = !DILocation(line: 666, column: 19, scope: !838)
!857 = !{!858, !858, i64 0}
!858 = !{!"_Bool", !729, i64 0}
!859 = !DILocation(line: 670, column: 12, scope: !860)
!860 = distinct !DILexicalBlock(scope: !838, file: !3, line: 670, column: 7)
!861 = !DILocation(line: 670, column: 7, scope: !838)
!862 = !DILocation(line: 672, column: 11, scope: !863)
!863 = distinct !DILexicalBlock(scope: !864, file: !3, line: 672, column: 11)
!864 = distinct !DILexicalBlock(scope: !860, file: !3, line: 671, column: 5)
!865 = !DILocation(line: 672, column: 11, scope: !864)
!866 = !DILocation(line: 673, column: 9, scope: !863)
!867 = !DILocation(line: 675, column: 11, scope: !868)
!868 = distinct !DILexicalBlock(scope: !864, file: !3, line: 675, column: 11)
!869 = !DILocation(line: 675, column: 11, scope: !864)
!870 = !DILocation(line: 677, column: 24, scope: !871)
!871 = distinct !DILexicalBlock(scope: !868, file: !3, line: 676, column: 9)
!872 = !DILocation(line: 677, column: 60, scope: !871)
!873 = !DILocation(line: 677, column: 11, scope: !871)
!874 = !DILocation(line: 679, column: 11, scope: !871)
!875 = !DILocation(line: 685, column: 9, scope: !876)
!876 = distinct !DILexicalBlock(scope: !838, file: !3, line: 685, column: 7)
!877 = !DILocation(line: 685, column: 16, scope: !876)
!878 = !DILocation(line: 685, column: 19, scope: !876)
!879 = !DILocation(line: 685, column: 7, scope: !838)
!880 = !DILocation(line: 691, column: 12, scope: !881)
!881 = distinct !DILexicalBlock(scope: !838, file: !3, line: 691, column: 7)
!882 = !DILocation(line: 691, column: 7, scope: !838)
!883 = !DILocation(line: 687, column: 7, scope: !884)
!884 = distinct !DILexicalBlock(scope: !876, file: !3, line: 686, column: 5)
!885 = !DILocation(line: 697, column: 12, scope: !838)
!886 = !DILocation(line: 693, column: 20, scope: !887)
!887 = distinct !DILexicalBlock(scope: !881, file: !3, line: 692, column: 5)
!888 = !DILocation(line: 693, column: 7, scope: !887)
!889 = !DILocation(line: 694, column: 7, scope: !887)
!890 = !DILocation(line: 698, column: 8, scope: !838)
!891 = !DILocation(line: 699, column: 8, scope: !838)
!892 = !DILocation(line: 701, column: 3, scope: !838)
!893 = !DILocalVariable(name: "format", arg: 1, scope: !894, file: !3, line: 478, type: !50)
!894 = distinct !DISubprogram(name: "print_formatted", scope: !3, file: !3, line: 478, type: !895, scopeLine: 479, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !897)
!895 = !DISubroutineType(types: !896)
!896 = !{!39, !50, !39, !149}
!897 = !{!893, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !921, !928, !930}
!898 = !DILocalVariable(name: "argc", arg: 2, scope: !894, file: !3, line: 478, type: !39)
!899 = !DILocalVariable(name: "argv", arg: 3, scope: !894, file: !3, line: 478, type: !149)
!900 = !DILocalVariable(name: "save_argc", scope: !894, file: !3, line: 480, type: !39)
!901 = !DILocalVariable(name: "f", scope: !894, file: !3, line: 481, type: !50)
!902 = !DILocalVariable(name: "direc_start", scope: !894, file: !3, line: 482, type: !50)
!903 = !DILocalVariable(name: "direc_length", scope: !894, file: !3, line: 483, type: !88)
!904 = !DILocalVariable(name: "have_field_width", scope: !894, file: !3, line: 484, type: !46)
!905 = !DILocalVariable(name: "field_width", scope: !894, file: !3, line: 485, type: !39)
!906 = !DILocalVariable(name: "have_precision", scope: !894, file: !3, line: 486, type: !46)
!907 = !DILocalVariable(name: "precision", scope: !894, file: !3, line: 487, type: !39)
!908 = !DILocalVariable(name: "ok", scope: !894, file: !3, line: 488, type: !114)
!909 = !DILocalVariable(name: "width", scope: !910, file: !3, line: 562, type: !918)
!910 = distinct !DILexicalBlock(scope: !911, file: !3, line: 561, column: 17)
!911 = distinct !DILexicalBlock(scope: !912, file: !3, line: 560, column: 19)
!912 = distinct !DILexicalBlock(scope: !913, file: !3, line: 557, column: 13)
!913 = distinct !DILexicalBlock(scope: !914, file: !3, line: 556, column: 15)
!914 = distinct !DILexicalBlock(scope: !915, file: !3, line: 493, column: 9)
!915 = distinct !DILexicalBlock(scope: !916, file: !3, line: 491, column: 5)
!916 = distinct !DILexicalBlock(scope: !917, file: !3, line: 490, column: 3)
!917 = distinct !DILexicalBlock(scope: !894, file: !3, line: 490, column: 3)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !919, line: 101, baseType: !920)
!919 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !177, line: 72, baseType: !137)
!921 = !DILocalVariable(name: "prec", scope: !922, file: !3, line: 592, type: !918)
!922 = distinct !DILexicalBlock(scope: !923, file: !3, line: 591, column: 21)
!923 = distinct !DILexicalBlock(scope: !924, file: !3, line: 590, column: 23)
!924 = distinct !DILexicalBlock(scope: !925, file: !3, line: 587, column: 17)
!925 = distinct !DILexicalBlock(scope: !926, file: !3, line: 586, column: 19)
!926 = distinct !DILexicalBlock(scope: !927, file: !3, line: 582, column: 13)
!927 = distinct !DILexicalBlock(scope: !914, file: !3, line: 581, column: 15)
!928 = !DILocalVariable(name: "conversion", scope: !929, file: !3, line: 625, type: !40)
!929 = distinct !DILexicalBlock(scope: !914, file: !3, line: 624, column: 11)
!930 = !DILabel(scope: !914, name: "no_more_flag_characters", file: !3, line: 554)
!931 = !DILocation(line: 0, scope: !894, inlinedAt: !932)
!932 = distinct !DILocation(line: 703, column: 19, scope: !933)
!933 = distinct !DILexicalBlock(scope: !838, file: !3, line: 702, column: 5)
!934 = !DILocation(line: 488, column: 3, scope: !894, inlinedAt: !932)
!935 = !DILocation(line: 488, column: 8, scope: !894, inlinedAt: !932)
!936 = !DILocation(line: 490, column: 20, scope: !916, inlinedAt: !932)
!937 = !{!729, !729, i64 0}
!938 = !DILocation(line: 490, column: 3, scope: !917, inlinedAt: !932)
!939 = !DILocation(line: 492, column: 15, scope: !915, inlinedAt: !932)
!940 = !DILocation(line: 492, column: 7, scope: !915, inlinedAt: !932)
!941 = !DILocation(line: 495, column: 26, scope: !914, inlinedAt: !932)
!942 = !DILocation(line: 498, column: 15, scope: !943, inlinedAt: !932)
!943 = distinct !DILexicalBlock(scope: !914, file: !3, line: 498, column: 15)
!944 = !DILocation(line: 498, column: 15, scope: !914, inlinedAt: !932)
!945 = !DILocalVariable(name: "__c", arg: 1, scope: !946, file: !947, line: 108, type: !39)
!946 = distinct !DISubprogram(name: "putchar_unlocked", scope: !947, file: !947, line: 108, type: !948, scopeLine: 109, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !950)
!947 = !DIFile(filename: "/usr/include/bits/stdio.h", directory: "")
!948 = !DISubroutineType(types: !949)
!949 = !{!39, !39}
!950 = !{!945}
!951 = !DILocation(line: 0, scope: !946, inlinedAt: !952)
!952 = distinct !DILocation(line: 500, column: 15, scope: !953, inlinedAt: !932)
!953 = distinct !DILexicalBlock(scope: !943, file: !3, line: 499, column: 13)
!954 = !DILocation(line: 110, column: 10, scope: !946, inlinedAt: !952)
!955 = !{!956, !728, i64 40}
!956 = !{!"_IO_FILE", !957, i64 0, !728, i64 8, !728, i64 16, !728, i64 24, !728, i64 32, !728, i64 40, !728, i64 48, !728, i64 56, !728, i64 64, !728, i64 72, !728, i64 80, !728, i64 88, !728, i64 96, !728, i64 104, !957, i64 112, !957, i64 116, !958, i64 120, !959, i64 128, !729, i64 130, !729, i64 131, !728, i64 136, !958, i64 144, !728, i64 152, !728, i64 160, !728, i64 168, !728, i64 176, !958, i64 184, !957, i64 192, !729, i64 196}
!957 = !{!"int", !729, i64 0}
!958 = !{!"long", !729, i64 0}
!959 = !{!"short", !729, i64 0}
!960 = !{!956, !728, i64 48}
!961 = !{!"branch_weights", i32 2000, i32 1}
!962 = !DILocation(line: 507, column: 24, scope: !963, inlinedAt: !932)
!963 = distinct !DILexicalBlock(scope: !964, file: !3, line: 507, column: 19)
!964 = distinct !DILexicalBlock(scope: !965, file: !3, line: 504, column: 13)
!965 = distinct !DILexicalBlock(scope: !914, file: !3, line: 503, column: 15)
!966 = !DILocation(line: 507, column: 19, scope: !964, inlinedAt: !932)
!967 = !DILocation(line: 509, column: 37, scope: !968, inlinedAt: !932)
!968 = distinct !DILexicalBlock(scope: !963, file: !3, line: 508, column: 17)
!969 = !DILocalVariable(name: "str", arg: 1, scope: !970, file: !3, line: 313, type: !50)
!970 = distinct !DISubprogram(name: "print_esc_string", scope: !3, file: !3, line: 313, type: !744, scopeLine: 314, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !971)
!971 = !{!969}
!972 = !DILocation(line: 0, scope: !970, inlinedAt: !973)
!973 = distinct !DILocation(line: 509, column: 19, scope: !968, inlinedAt: !932)
!974 = !DILocation(line: 315, column: 3, scope: !970, inlinedAt: !973)
!975 = !DILocation(line: 315, column: 10, scope: !976, inlinedAt: !973)
!976 = distinct !DILexicalBlock(scope: !977, file: !3, line: 315, column: 3)
!977 = distinct !DILexicalBlock(scope: !970, file: !3, line: 315, column: 3)
!978 = !DILocation(line: 315, column: 3, scope: !977, inlinedAt: !973)
!979 = !DILocation(line: 317, column: 14, scope: !980, inlinedAt: !973)
!980 = distinct !DILexicalBlock(scope: !976, file: !3, line: 316, column: 9)
!981 = !DILocation(line: 317, column: 11, scope: !980, inlinedAt: !973)
!982 = !DILocation(line: 317, column: 7, scope: !980, inlinedAt: !973)
!983 = !DILocation(line: 0, scope: !946, inlinedAt: !984)
!984 = distinct !DILocation(line: 319, column: 7, scope: !980, inlinedAt: !973)
!985 = !DILocation(line: 110, column: 10, scope: !946, inlinedAt: !984)
!986 = !DILocation(line: 316, column: 9, scope: !980, inlinedAt: !973)
!987 = !DILocation(line: 315, column: 19, scope: !976, inlinedAt: !973)
!988 = !DILocation(line: 315, column: 3, scope: !976, inlinedAt: !973)
!989 = distinct !{!989, !978, !990, !774}
!990 = !DILocation(line: 319, column: 7, scope: !977, inlinedAt: !973)
!991 = !DILocation(line: 510, column: 19, scope: !968, inlinedAt: !932)
!992 = !DILocation(line: 511, column: 19, scope: !968, inlinedAt: !932)
!993 = !DILocation(line: 512, column: 17, scope: !968, inlinedAt: !932)
!994 = !DILocation(line: 518, column: 24, scope: !995, inlinedAt: !932)
!995 = distinct !DILexicalBlock(scope: !996, file: !3, line: 518, column: 19)
!996 = distinct !DILexicalBlock(scope: !997, file: !3, line: 517, column: 13)
!997 = distinct !DILexicalBlock(scope: !914, file: !3, line: 516, column: 15)
!998 = !DILocation(line: 518, column: 19, scope: !996, inlinedAt: !932)
!999 = !DILocation(line: 520, column: 19, scope: !1000, inlinedAt: !932)
!1000 = distinct !DILexicalBlock(scope: !995, file: !3, line: 519, column: 17)
!1001 = !DILocation(line: 522, column: 19, scope: !1000, inlinedAt: !932)
!1002 = !DILocation(line: 523, column: 19, scope: !1000, inlinedAt: !932)
!1003 = !DILocation(line: 524, column: 17, scope: !1000, inlinedAt: !932)
!1004 = !DILocalVariable(name: "__dest", arg: 1, scope: !1005, file: !1006, line: 57, type: !36)
!1005 = distinct !DISubprogram(name: "memset", scope: !1006, file: !1006, line: 57, type: !1007, scopeLine: 58, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1009)
!1006 = !DIFile(filename: "/usr/include/bits/string_fortified.h", directory: "")
!1007 = !DISubroutineType(types: !1008)
!1008 = !{!36, !36, !39, !88}
!1009 = !{!1004, !1010, !1011}
!1010 = !DILocalVariable(name: "__ch", arg: 2, scope: !1005, file: !1006, line: 57, type: !39)
!1011 = !DILocalVariable(name: "__len", arg: 3, scope: !1005, file: !1006, line: 57, type: !88)
!1012 = !DILocation(line: 0, scope: !1005, inlinedAt: !1013)
!1013 = distinct !DILocation(line: 528, column: 11, scope: !914, inlinedAt: !932)
!1014 = !DILocation(line: 59, column: 10, scope: !1005, inlinedAt: !1013)
!1015 = !DILocation(line: 531, column: 51, scope: !914, inlinedAt: !932)
!1016 = !DILocation(line: 531, column: 41, scope: !914, inlinedAt: !932)
!1017 = !DILocation(line: 531, column: 31, scope: !914, inlinedAt: !932)
!1018 = !DILocation(line: 531, column: 21, scope: !914, inlinedAt: !932)
!1019 = !DILocation(line: 530, column: 71, scope: !914, inlinedAt: !932)
!1020 = !DILocation(line: 530, column: 61, scope: !914, inlinedAt: !932)
!1021 = !DILocation(line: 530, column: 51, scope: !914, inlinedAt: !932)
!1022 = !DILocation(line: 530, column: 31, scope: !914, inlinedAt: !932)
!1023 = !DILocation(line: 529, column: 69, scope: !914, inlinedAt: !932)
!1024 = !DILocation(line: 529, column: 29, scope: !914, inlinedAt: !932)
!1025 = !DILocation(line: 529, column: 19, scope: !914, inlinedAt: !932)
!1026 = !DILocation(line: 530, column: 41, scope: !914, inlinedAt: !932)
!1027 = !DILocation(line: 533, column: 11, scope: !914, inlinedAt: !932)
!1028 = !DILocation(line: 0, scope: !914, inlinedAt: !932)
!1029 = !DILocation(line: 534, column: 21, scope: !1030, inlinedAt: !932)
!1030 = distinct !DILexicalBlock(scope: !1031, file: !3, line: 533, column: 11)
!1031 = distinct !DILexicalBlock(scope: !914, file: !3, line: 533, column: 11)
!1032 = !DILocation(line: 534, column: 13, scope: !1030, inlinedAt: !932)
!1033 = !DILocation(line: 541, column: 57, scope: !1034, inlinedAt: !932)
!1034 = distinct !DILexicalBlock(scope: !1030, file: !3, line: 535, column: 15)
!1035 = !DILocation(line: 541, column: 47, scope: !1034, inlinedAt: !932)
!1036 = !DILocation(line: 541, column: 37, scope: !1034, inlinedAt: !932)
!1037 = !DILocation(line: 541, column: 27, scope: !1034, inlinedAt: !932)
!1038 = !DILocation(line: 540, column: 65, scope: !1034, inlinedAt: !932)
!1039 = !DILocation(line: 540, column: 55, scope: !1034, inlinedAt: !932)
!1040 = !DILocation(line: 540, column: 45, scope: !1034, inlinedAt: !932)
!1041 = !DILocation(line: 540, column: 35, scope: !1034, inlinedAt: !932)
!1042 = !DILocation(line: 540, column: 25, scope: !1034, inlinedAt: !932)
!1043 = !DILocation(line: 542, column: 17, scope: !1034, inlinedAt: !932)
!1044 = !DILocation(line: 546, column: 65, scope: !1034, inlinedAt: !932)
!1045 = !DILocation(line: 546, column: 55, scope: !1034, inlinedAt: !932)
!1046 = !DILocation(line: 546, column: 45, scope: !1034, inlinedAt: !932)
!1047 = !DILocation(line: 546, column: 35, scope: !1034, inlinedAt: !932)
!1048 = !DILocation(line: 546, column: 25, scope: !1034, inlinedAt: !932)
!1049 = !DILocation(line: 547, column: 17, scope: !1034, inlinedAt: !932)
!1050 = !DILocation(line: 549, column: 35, scope: !1034, inlinedAt: !932)
!1051 = !DILocation(line: 549, column: 25, scope: !1034, inlinedAt: !932)
!1052 = !DILocation(line: 550, column: 17, scope: !1034, inlinedAt: !932)
!1053 = !DILocation(line: 533, column: 20, scope: !1030, inlinedAt: !932)
!1054 = !DILocation(line: 533, column: 36, scope: !1030, inlinedAt: !932)
!1055 = !DILocation(line: 533, column: 11, scope: !1030, inlinedAt: !932)
!1056 = distinct !{!1056, !1057, !1058}
!1057 = !DILocation(line: 533, column: 11, scope: !1031, inlinedAt: !932)
!1058 = !DILocation(line: 553, column: 15, scope: !1031, inlinedAt: !932)
!1059 = !DILocation(line: 554, column: 9, scope: !914, inlinedAt: !932)
!1060 = !DILocation(line: 556, column: 18, scope: !913, inlinedAt: !932)
!1061 = !DILocation(line: 556, column: 15, scope: !914, inlinedAt: !932)
!1062 = !DILocation(line: 576, column: 20, scope: !913, inlinedAt: !932)
!1063 = !DILocation(line: 576, column: 13, scope: !913, inlinedAt: !932)
!1064 = !DILocation(line: 558, column: 15, scope: !912, inlinedAt: !932)
!1065 = !DILocation(line: 559, column: 15, scope: !912, inlinedAt: !932)
!1066 = !DILocation(line: 560, column: 24, scope: !911, inlinedAt: !932)
!1067 = !DILocation(line: 560, column: 19, scope: !912, inlinedAt: !932)
!1068 = !DILocation(line: 562, column: 48, scope: !910, inlinedAt: !932)
!1069 = !DILocation(line: 562, column: 36, scope: !910, inlinedAt: !932)
!1070 = !DILocation(line: 0, scope: !910, inlinedAt: !932)
!1071 = !DILocation(line: 563, column: 40, scope: !1072, inlinedAt: !932)
!1072 = distinct !DILexicalBlock(scope: !910, file: !3, line: 563, column: 23)
!1073 = !DILocation(line: 564, column: 35, scope: !1072, inlinedAt: !932)
!1074 = !DILocation(line: 568, column: 19, scope: !910, inlinedAt: !932)
!1075 = !DILocation(line: 569, column: 19, scope: !910, inlinedAt: !932)
!1076 = !DILocation(line: 570, column: 17, scope: !910, inlinedAt: !932)
!1077 = !DILocation(line: 566, column: 21, scope: !1072, inlinedAt: !932)
!1078 = !DILocation(line: 578, column: 17, scope: !1079, inlinedAt: !932)
!1079 = distinct !DILexicalBlock(scope: !913, file: !3, line: 577, column: 15)
!1080 = !DILocation(line: 579, column: 17, scope: !1079, inlinedAt: !932)
!1081 = distinct !{!1081, !1063, !1082, !774}
!1082 = !DILocation(line: 580, column: 15, scope: !913, inlinedAt: !932)
!1083 = !DILocation(line: 581, column: 15, scope: !927, inlinedAt: !932)
!1084 = !DILocation(line: 581, column: 18, scope: !927, inlinedAt: !932)
!1085 = !DILocation(line: 581, column: 15, scope: !914, inlinedAt: !932)
!1086 = !DILocation(line: 583, column: 15, scope: !926, inlinedAt: !932)
!1087 = !DILocation(line: 585, column: 23, scope: !926, inlinedAt: !932)
!1088 = !DILocation(line: 586, column: 19, scope: !925, inlinedAt: !932)
!1089 = !DILocation(line: 586, column: 22, scope: !925, inlinedAt: !932)
!1090 = !DILocation(line: 586, column: 19, scope: !926, inlinedAt: !932)
!1091 = !DILocation(line: 0, scope: !926, inlinedAt: !932)
!1092 = !DILocation(line: 613, column: 24, scope: !925, inlinedAt: !932)
!1093 = !DILocation(line: 613, column: 17, scope: !925, inlinedAt: !932)
!1094 = distinct !{!1094, !1093, !1095, !774}
!1095 = !DILocation(line: 617, column: 19, scope: !925, inlinedAt: !932)
!1096 = !DILocation(line: 615, column: 21, scope: !1097, inlinedAt: !932)
!1097 = distinct !DILexicalBlock(scope: !925, file: !3, line: 614, column: 19)
!1098 = !DILocation(line: 588, column: 19, scope: !924, inlinedAt: !932)
!1099 = !DILocation(line: 589, column: 19, scope: !924, inlinedAt: !932)
!1100 = !DILocation(line: 590, column: 28, scope: !923, inlinedAt: !932)
!1101 = !DILocation(line: 590, column: 23, scope: !924, inlinedAt: !932)
!1102 = !DILocation(line: 592, column: 51, scope: !922, inlinedAt: !932)
!1103 = !DILocation(line: 592, column: 39, scope: !922, inlinedAt: !932)
!1104 = !DILocation(line: 0, scope: !922, inlinedAt: !932)
!1105 = !DILocation(line: 593, column: 32, scope: !1106, inlinedAt: !932)
!1106 = distinct !DILexicalBlock(scope: !922, file: !3, line: 593, column: 27)
!1107 = !DILocation(line: 593, column: 27, scope: !922, inlinedAt: !932)
!1108 = !DILocation(line: 600, column: 40, scope: !1109, inlinedAt: !932)
!1109 = distinct !DILexicalBlock(scope: !1106, file: !3, line: 600, column: 32)
!1110 = !DILocation(line: 600, column: 32, scope: !1106, inlinedAt: !932)
!1111 = !DILocation(line: 601, column: 25, scope: !1109, inlinedAt: !932)
!1112 = !DILocation(line: 604, column: 37, scope: !1109, inlinedAt: !932)
!1113 = !DILocation(line: 0, scope: !1106, inlinedAt: !932)
!1114 = !DILocation(line: 605, column: 23, scope: !922, inlinedAt: !932)
!1115 = !DILocation(line: 606, column: 23, scope: !922, inlinedAt: !932)
!1116 = !DILocation(line: 607, column: 21, scope: !922, inlinedAt: !932)
!1117 = !DILocation(line: 620, column: 11, scope: !914, inlinedAt: !932)
!1118 = !DILocation(line: 620, column: 18, scope: !914, inlinedAt: !932)
!1119 = !DILocation(line: 620, column: 28, scope: !914, inlinedAt: !932)
!1120 = !DILocation(line: 622, column: 13, scope: !914, inlinedAt: !932)
!1121 = distinct !{!1121, !1117, !1122, !774}
!1122 = !DILocation(line: 622, column: 15, scope: !914, inlinedAt: !932)
!1123 = !DILocation(line: 0, scope: !929, inlinedAt: !932)
!1124 = !DILocation(line: 626, column: 19, scope: !1125, inlinedAt: !932)
!1125 = distinct !DILexicalBlock(scope: !929, file: !3, line: 626, column: 17)
!1126 = !DILocation(line: 626, column: 17, scope: !929, inlinedAt: !932)
!1127 = !DILocation(line: 627, column: 15, scope: !1125, inlinedAt: !932)
!1128 = !DILocation(line: 635, column: 30, scope: !914, inlinedAt: !932)
!1129 = !DILocation(line: 635, column: 25, scope: !914, inlinedAt: !932)
!1130 = !DILocation(line: 635, column: 47, scope: !914, inlinedAt: !932)
!1131 = !DILocation(line: 635, column: 56, scope: !914, inlinedAt: !932)
!1132 = !DILocation(line: 635, column: 51, scope: !914, inlinedAt: !932)
!1133 = !DILocalVariable(name: "arg", scope: !1134, file: !3, line: 427, type: !1159)
!1134 = distinct !DILexicalBlock(scope: !1135, file: !3, line: 426, column: 7)
!1135 = distinct !DILexicalBlock(scope: !1136, file: !3, line: 373, column: 5)
!1136 = distinct !DISubprogram(name: "print_direc", scope: !3, file: !3, line: 331, type: !1137, scopeLine: 335, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1139)
!1137 = !DISubroutineType(types: !1138)
!1138 = !{null, !50, !88, !38, !46, !39, !46, !39, !50}
!1139 = !{!1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1151, !1152, !1153, !1155, !1133}
!1140 = !DILocalVariable(name: "start", arg: 1, scope: !1136, file: !3, line: 331, type: !50)
!1141 = !DILocalVariable(name: "length", arg: 2, scope: !1136, file: !3, line: 331, type: !88)
!1142 = !DILocalVariable(name: "conversion", arg: 3, scope: !1136, file: !3, line: 331, type: !38)
!1143 = !DILocalVariable(name: "have_field_width", arg: 4, scope: !1136, file: !3, line: 332, type: !46)
!1144 = !DILocalVariable(name: "field_width", arg: 5, scope: !1136, file: !3, line: 332, type: !39)
!1145 = !DILocalVariable(name: "have_precision", arg: 6, scope: !1136, file: !3, line: 333, type: !46)
!1146 = !DILocalVariable(name: "precision", arg: 7, scope: !1136, file: !3, line: 333, type: !39)
!1147 = !DILocalVariable(name: "argument", arg: 8, scope: !1136, file: !3, line: 334, type: !50)
!1148 = !DILocalVariable(name: "p", scope: !1136, file: !3, line: 336, type: !37)
!1149 = !DILocalVariable(name: "q", scope: !1150, file: !3, line: 342, type: !37)
!1150 = distinct !DILexicalBlock(scope: !1136, file: !3, line: 341, column: 3)
!1151 = !DILocalVariable(name: "length_modifier", scope: !1150, file: !3, line: 343, type: !50)
!1152 = !DILocalVariable(name: "length_modifier_len", scope: !1150, file: !3, line: 344, type: !88)
!1153 = !DILocalVariable(name: "arg", scope: !1154, file: !3, line: 377, type: !918)
!1154 = distinct !DILexicalBlock(scope: !1135, file: !3, line: 376, column: 7)
!1155 = !DILocalVariable(name: "arg", scope: !1156, file: !3, line: 400, type: !1157)
!1156 = distinct !DILexicalBlock(scope: !1135, file: !3, line: 399, column: 7)
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !919, line: 102, baseType: !1158)
!1158 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !177, line: 73, baseType: !90)
!1159 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!1160 = !DILocation(line: 427, column: 21, scope: !1134, inlinedAt: !1161)
!1161 = distinct !DILocation(line: 632, column: 11, scope: !914, inlinedAt: !932)
!1162 = !DILocation(line: 0, scope: !1136, inlinedAt: !1161)
!1163 = !DILocation(line: 346, column: 13, scope: !1150, inlinedAt: !1161)
!1164 = !DILocation(line: 346, column: 5, scope: !1150, inlinedAt: !1161)
!1165 = !DILocation(line: 0, scope: !1150, inlinedAt: !1161)
!1166 = !DILocation(line: 357, column: 9, scope: !1167, inlinedAt: !1161)
!1167 = distinct !DILexicalBlock(scope: !1150, file: !3, line: 347, column: 7)
!1168 = !DILocation(line: 362, column: 9, scope: !1167, inlinedAt: !1161)
!1169 = !DILocation(line: 0, scope: !1167, inlinedAt: !1161)
!1170 = !DILocation(line: 365, column: 25, scope: !1150, inlinedAt: !1161)
!1171 = !DILocation(line: 365, column: 47, scope: !1150, inlinedAt: !1161)
!1172 = !DILocation(line: 365, column: 9, scope: !1150, inlinedAt: !1161)
!1173 = !DILocalVariable(name: "__dest", arg: 1, scope: !1174, file: !1006, line: 42, type: !1177)
!1174 = distinct !DISubprogram(name: "mempcpy", scope: !1006, file: !1006, line: 42, type: !1175, scopeLine: 44, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1181)
