source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [167 x i8] c"Usage: %s [OPTION]... [VARIABLE]...\0APrint the values of the specified environment VARIABLE(s).\0AIf no VARIABLE is specified, print name and value pairs for them all.\0A\0A\00", align 1
@.str.2 = private unnamed_addr constant [61 x i8] c"  -0, --null     end each output line with NUL, not newline\0A\00", align 1
@stdout = external local_unnamed_addr global %struct._IO_FILE*, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 47, type: !122, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !9, globals: !121, nameTableKind: None)
!3 = !DIFile(filename: "src/printenv.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 38, baseType: !6, size: 32, elements: !7)
!6 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!7 = !{!8}
!8 = !DIEnumerator(name: "PRINTENV_FAILURE", value: 2, isUnsigned: true)
!9 = !{!10, !20, !81, !85, !89, !92, !95, !102, !14, !71, !117}
!10 = !DISubprogram(name: "dcgettext", scope: !11, file: !11, line: 51, type: !12, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !19)
!11 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!12 = !DISubroutineType(types: !13)
!13 = !{!14, !16, !16, !18}
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!18 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!19 = !{}
!20 = !DISubprogram(name: "fputs_unlocked", scope: !21, file: !21, line: 662, type: !22, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !19)
!21 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!22 = !DISubroutineType(types: !23)
!23 = !{!18, !16, !24}
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !26, line: 49, size: 1728, elements: !27)
!26 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!27 = !{!28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !43, !44, !45, !46, !50, !52, !54, !58, !61, !63, !66, !69, !70, !72, !76, !77}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !25, file: !26, line: 51, baseType: !18, size: 32)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !25, file: !26, line: 54, baseType: !14, size: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !25, file: !26, line: 55, baseType: !14, size: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !25, file: !26, line: 56, baseType: !14, size: 64, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !25, file: !26, line: 57, baseType: !14, size: 64, offset: 256)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !25, file: !26, line: 58, baseType: !14, size: 64, offset: 320)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !25, file: !26, line: 59, baseType: !14, size: 64, offset: 384)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !25, file: !26, line: 60, baseType: !14, size: 64, offset: 448)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !25, file: !26, line: 61, baseType: !14, size: 64, offset: 512)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !25, file: !26, line: 64, baseType: !14, size: 64, offset: 576)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !25, file: !26, line: 65, baseType: !14, size: 64, offset: 640)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !25, file: !26, line: 66, baseType: !14, size: 64, offset: 704)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !25, file: !26, line: 68, baseType: !41, size: 64, offset: 768)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !26, line: 36, flags: DIFlagFwdDecl)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !25, file: !26, line: 70, baseType: !24, size: 64, offset: 832)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !25, file: !26, line: 72, baseType: !18, size: 32, offset: 896)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !25, file: !26, line: 73, baseType: !18, size: 32, offset: 928)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !25, file: !26, line: 74, baseType: !47, size: 64, offset: 960)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !48, line: 152, baseType: !49)
!48 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!49 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !25, file: !26, line: 77, baseType: !51, size: 16, offset: 1024)
!51 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !25, file: !26, line: 78, baseType: !53, size: 8, offset: 1040)
!53 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !25, file: !26, line: 79, baseType: !55, size: 8, offset: 1048)
!55 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 8, elements: !56)
!56 = !{!57}
!57 = !DISubrange(count: 1)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !25, file: !26, line: 81, baseType: !59, size: 64, offset: 1088)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !26, line: 43, baseType: null)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !25, file: !26, line: 89, baseType: !62, size: 64, offset: 1152)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !48, line: 153, baseType: !49)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !25, file: !26, line: 91, baseType: !64, size: 64, offset: 1216)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !26, line: 37, flags: DIFlagFwdDecl)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !25, file: !26, line: 92, baseType: !67, size: 64, offset: 1280)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !26, line: 38, flags: DIFlagFwdDecl)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !25, file: !26, line: 93, baseType: !24, size: 64, offset: 1344)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !25, file: !26, line: 94, baseType: !71, size: 64, offset: 1408)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !25, file: !26, line: 95, baseType: !73, size: 64, offset: 1472)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !74, line: 46, baseType: !75)
!74 = !DIFile(filename: "/usr/lib/clang/10.0.0/include/stddef.h", directory: "")
!75 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !25, file: !26, line: 96, baseType: !18, size: 32, offset: 1536)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !25, file: !26, line: 98, baseType: !78, size: 160, offset: 1568)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 160, elements: !79)
!79 = !{!80}
!80 = !DISubrange(count: 20)
!81 = !DISubprogram(name: "set_program_name", scope: !82, file: !82, line: 37, type: !83, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !19)
!82 = !DIFile(filename: "./lib/progname.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!83 = !DISubroutineType(types: !84)
!84 = !{null, !16}
!85 = !DISubprogram(name: "setlocale", scope: !86, file: !86, line: 122, type: !87, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !19)
!86 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!87 = !DISubroutineType(types: !88)
!88 = !{!14, !18, !16}
!89 = !DISubprogram(name: "bindtextdomain", scope: !11, file: !11, line: 86, type: !90, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !19)
!90 = !DISubroutineType(types: !91)
!91 = !{!14, !16, !16}
!92 = !DISubprogram(name: "textdomain", scope: !11, file: !11, line: 82, type: !93, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !19)
!93 = !DISubroutineType(types: !94)
!94 = !{!14, !16}
!95 = !DISubprogram(name: "atexit", scope: !96, file: !96, line: 595, type: !97, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !19)
!96 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!97 = !DISubroutineType(types: !98)
!98 = !{!18, !99}
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{null}
!102 = !DISubprogram(name: "getopt_long", scope: !103, file: !103, line: 66, type: !104, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !19)
!103 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!104 = !DISubroutineType(types: !105)
!105 = !{!18, !18, !106, !16, !108, !115}
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !103, line: 50, size: 256, elements: !111)
!111 = !{!112, !113, !114, !116}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !110, file: !103, line: 52, baseType: !16, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !110, file: !103, line: 55, baseType: !18, size: 32, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !110, file: !103, line: 56, baseType: !115, size: 64, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !110, file: !103, line: 57, baseType: !18, size: 32, offset: 192)
!117 = !DISubprogram(name: "version_etc", scope: !118, file: !118, line: 69, type: !119, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !19)
!118 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!119 = !DISubroutineType(types: !120)
!120 = !{null, !24, !16, !16, !16, null}
!121 = !{!0}
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 1024, elements: !123)
!123 = !{!124}
!124 = !DISubrange(count: 4)
!125 = !DIGlobalVariableExpression(var: !126, expr: !DIExpression())
!126 = distinct !DIGlobalVariable(name: "Version", scope: !127, file: !128, line: 2, type: !16, isDefinition: true)
!127 = distinct !DICompileUnit(language: DW_LANG_C99, file: !128, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !19, globals: !129, nameTableKind: None)
!128 = !DIFile(filename: "src/version.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!129 = !{!125}
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(name: "file_name", scope: !132, file: !133, line: 46, type: !16, isLocal: true, isDefinition: true)
!132 = distinct !DICompileUnit(language: DW_LANG_C99, file: !133, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !19, retainedTypes: !134, globals: !177, nameTableKind: None)
!133 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!134 = !{!135, !10, !171, !173}
!135 = !DISubprogram(name: "close_stream", scope: !136, file: !136, line: 2, type: !137, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !19)
!136 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!137 = !DISubroutineType(types: !138)
!138 = !{!18, !139}
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !26, line: 49, size: 1728, elements: !141)
!141 = !{!142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !140, file: !26, line: 51, baseType: !18, size: 32)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !140, file: !26, line: 54, baseType: !14, size: 64, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !140, file: !26, line: 55, baseType: !14, size: 64, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !140, file: !26, line: 56, baseType: !14, size: 64, offset: 192)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !140, file: !26, line: 57, baseType: !14, size: 64, offset: 256)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !140, file: !26, line: 58, baseType: !14, size: 64, offset: 320)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !140, file: !26, line: 59, baseType: !14, size: 64, offset: 384)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !140, file: !26, line: 60, baseType: !14, size: 64, offset: 448)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !140, file: !26, line: 61, baseType: !14, size: 64, offset: 512)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !140, file: !26, line: 64, baseType: !14, size: 64, offset: 576)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !140, file: !26, line: 65, baseType: !14, size: 64, offset: 640)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !140, file: !26, line: 66, baseType: !14, size: 64, offset: 704)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !140, file: !26, line: 68, baseType: !41, size: 64, offset: 768)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !140, file: !26, line: 70, baseType: !139, size: 64, offset: 832)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !140, file: !26, line: 72, baseType: !18, size: 32, offset: 896)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !140, file: !26, line: 73, baseType: !18, size: 32, offset: 928)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !140, file: !26, line: 74, baseType: !47, size: 64, offset: 960)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !140, file: !26, line: 77, baseType: !51, size: 16, offset: 1024)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !140, file: !26, line: 78, baseType: !53, size: 8, offset: 1040)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !140, file: !26, line: 79, baseType: !55, size: 8, offset: 1048)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !140, file: !26, line: 81, baseType: !59, size: 64, offset: 1088)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !140, file: !26, line: 89, baseType: !62, size: 64, offset: 1152)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !140, file: !26, line: 91, baseType: !64, size: 64, offset: 1216)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !140, file: !26, line: 92, baseType: !67, size: 64, offset: 1280)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !140, file: !26, line: 93, baseType: !139, size: 64, offset: 1344)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !140, file: !26, line: 94, baseType: !71, size: 64, offset: 1408)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !140, file: !26, line: 95, baseType: !73, size: 64, offset: 1472)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !140, file: !26, line: 96, baseType: !18, size: 32, offset: 1536)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !140, file: !26, line: 98, baseType: !78, size: 160, offset: 1568)
!171 = !DISubprogram(name: "quotearg_colon", scope: !172, file: !172, line: 391, type: !93, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !19)
!172 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!173 = !DISubprogram(name: "error", scope: !174, file: !174, line: 52, type: !175, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !19)
!174 = !DIFile(filename: "./lib/error.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!175 = !DISubroutineType(types: !176)
!176 = !{null, !18, !18, !16, null}
!177 = !{!130, !178}
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !132, file: !133, line: 56, type: !180, isLocal: true, isDefinition: true)
!180 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "exit_failure", scope: !183, file: !184, line: 24, type: !186, isDefinition: true)
!183 = distinct !DICompileUnit(language: DW_LANG_C99, file: !184, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !19, globals: !185, nameTableKind: None)
!184 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!185 = !{!181}
!186 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !18)
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(name: "program_name", scope: !189, file: !190, line: 33, type: !16, isDefinition: true)
!189 = distinct !DICompileUnit(language: DW_LANG_C99, file: !190, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !19, retainedTypes: !191, globals: !227, nameTableKind: None)
!190 = !DIFile(filename: "lib/progname.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!191 = !{!71, !192, !14}
!192 = !DISubprogram(name: "fputs", scope: !21, file: !21, line: 626, type: !193, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !19)
!193 = !DISubroutineType(types: !194)
!194 = !{!18, !16, !195}
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !26, line: 49, size: 1728, elements: !197)
!197 = !{!198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !196, file: !26, line: 51, baseType: !18, size: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !196, file: !26, line: 54, baseType: !14, size: 64, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !196, file: !26, line: 55, baseType: !14, size: 64, offset: 128)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !196, file: !26, line: 56, baseType: !14, size: 64, offset: 192)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !196, file: !26, line: 57, baseType: !14, size: 64, offset: 256)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !196, file: !26, line: 58, baseType: !14, size: 64, offset: 320)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !196, file: !26, line: 59, baseType: !14, size: 64, offset: 384)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !196, file: !26, line: 60, baseType: !14, size: 64, offset: 448)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !196, file: !26, line: 61, baseType: !14, size: 64, offset: 512)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !196, file: !26, line: 64, baseType: !14, size: 64, offset: 576)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !196, file: !26, line: 65, baseType: !14, size: 64, offset: 640)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !196, file: !26, line: 66, baseType: !14, size: 64, offset: 704)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !196, file: !26, line: 68, baseType: !41, size: 64, offset: 768)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !196, file: !26, line: 70, baseType: !195, size: 64, offset: 832)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !196, file: !26, line: 72, baseType: !18, size: 32, offset: 896)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !196, file: !26, line: 73, baseType: !18, size: 32, offset: 928)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !196, file: !26, line: 74, baseType: !47, size: 64, offset: 960)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !196, file: !26, line: 77, baseType: !51, size: 16, offset: 1024)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !196, file: !26, line: 78, baseType: !53, size: 8, offset: 1040)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !196, file: !26, line: 79, baseType: !55, size: 8, offset: 1048)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !196, file: !26, line: 81, baseType: !59, size: 64, offset: 1088)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !196, file: !26, line: 89, baseType: !62, size: 64, offset: 1152)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !196, file: !26, line: 91, baseType: !64, size: 64, offset: 1216)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !196, file: !26, line: 92, baseType: !67, size: 64, offset: 1280)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !196, file: !26, line: 93, baseType: !195, size: 64, offset: 1344)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !196, file: !26, line: 94, baseType: !71, size: 64, offset: 1408)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !196, file: !26, line: 95, baseType: !73, size: 64, offset: 1472)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !196, file: !26, line: 96, baseType: !18, size: 32, offset: 1536)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !196, file: !26, line: 98, baseType: !78, size: 160, offset: 1568)
!227 = !{!187}
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !230, file: !231, line: 85, type: !362, isDefinition: true)
!230 = distinct !DICompileUnit(language: DW_LANG_C99, file: !231, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !232, retainedTypes: !266, globals: !335, nameTableKind: None)
!231 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!232 = !{!233, !246, !251}
!233 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !172, line: 32, baseType: !6, size: 32, elements: !234)
!234 = !{!235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245}
!235 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!236 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!237 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!238 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!239 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!240 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!241 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!242 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!243 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!244 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!245 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!246 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !172, line: 242, baseType: !6, size: 32, elements: !247)
!247 = !{!248, !249, !250}
!248 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!249 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!250 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!251 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !252, line: 46, baseType: !6, size: 32, elements: !253)
!252 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!253 = !{!254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265}
!254 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!255 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!256 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!257 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!258 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!259 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!260 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!261 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!262 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!263 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!264 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!265 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!266 = !{!267, !273, !289, !292, !18, !51, !295, !73, !310, !314, !10, !320, !324, !14, !328, !331, !332}
!267 = !DISubprogram(name: "xmemdup", scope: !268, file: !268, line: 62, type: !269, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !19)
!268 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!269 = !DISubroutineType(types: !270)
!270 = !{!71, !271, !75}
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!273 = !DISubprogram(name: "quotearg_alloc_mem", scope: !172, file: !172, line: 342, type: !274, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !19)
!274 = !DISubroutineType(types: !275)
!275 = !{!14, !16, !75, !276, !277}
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !279)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !231, line: 65, size: 448, elements: !280)
!280 = !{!281, !282, !283, !287, !288}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !279, file: !231, line: 68, baseType: !233, size: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !279, file: !231, line: 71, baseType: !18, size: 32, offset: 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !279, file: !231, line: 75, baseType: !284, size: 256, offset: 64)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !285)
!285 = !{!286}
!286 = !DISubrange(count: 8)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !279, file: !231, line: 78, baseType: !16, size: 64, offset: 320)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !279, file: !231, line: 81, baseType: !16, size: 64, offset: 384)
!289 = !DISubprogram(name: "free", scope: !96, file: !96, line: 565, type: !290, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !19)
!290 = !DISubroutineType(types: !291)
!291 = !{null, !71}
!292 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !172, file: !172, line: 408, type: !293, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !19)
!293 = !DISubroutineType(types: !294)
!294 = !{!14, !18, !16, !16, !16, !75}
!295 = !DISubprogram(name: "rpl_mbrtowc", scope: !296, file: !296, line: 717, type: !297, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !19)
!296 = !DIFile(filename: "./lib/wchar.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!297 = !DISubroutineType(types: !298)
!298 = !{!75, !115, !16, !75, !299}
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !301, line: 13, size: 64, elements: !302)
!301 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!302 = !{!303, !304}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !300, file: !301, line: 15, baseType: !18, size: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !300, file: !301, line: 20, baseType: !305, size: 32, offset: 32)
!305 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !300, file: !301, line: 16, size: 32, elements: !306)
!306 = !{!307, !308}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !305, file: !301, line: 18, baseType: !6, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !305, file: !301, line: 19, baseType: !309, size: 32)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 32, elements: !123)
!310 = !DISubprogram(name: "iswprint", scope: !311, file: !311, line: 120, type: !312, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !19)
!311 = !DIFile(filename: "/usr/include/bits/wctype-wchar.h", directory: "")
!312 = !DISubroutineType(types: !313)
!313 = !{!18, !6}
!314 = !DISubprogram(name: "mbsinit", scope: !315, file: !315, line: 292, type: !316, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !19)
!315 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!316 = !DISubroutineType(types: !317)
!317 = !{!18, !318}
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !300)
!320 = !DISubprogram(name: "locale_charset", scope: !321, file: !321, line: 35, type: !322, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !19)
!321 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!322 = !DISubroutineType(types: !323)
!323 = !{!16}
!324 = !DISubprogram(name: "c_strcasecmp", scope: !325, file: !325, line: 42, type: !326, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !19)
!325 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!326 = !DISubroutineType(types: !327)
!327 = !{!18, !16, !16}
!328 = !DISubprogram(name: "xmalloc", scope: !268, file: !268, line: 53, type: !329, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !19)
!329 = !DISubroutineType(types: !330)
!330 = !{!71, !75}
!331 = !DISubprogram(name: "xalloc_die", scope: !268, file: !268, line: 51, type: !100, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !19)
!332 = !DISubprogram(name: "xrealloc", scope: !268, file: !268, line: 59, type: !333, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !19)
!333 = !DISubroutineType(types: !334)
!334 = !{!71, !71, !75}
!335 = !{!228, !336, !342, !344, !346, !351, !358, !360}
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !230, file: !231, line: 101, type: !338, isDefinition: true)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !339, size: 320, elements: !340)
!339 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !233)
!340 = !{!341}
!341 = !DISubrange(count: 10)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !230, file: !231, line: 1052, type: !279, isDefinition: true)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !230, file: !231, line: 116, type: !279, isLocal: true, isDefinition: true)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "slot0", scope: !230, file: !231, line: 842, type: !348, isLocal: true, isDefinition: true)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 2048, elements: !349)
!349 = !{!350}
!350 = !DISubrange(count: 256)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "slotvec", scope: !230, file: !231, line: 845, type: !353, isLocal: true, isDefinition: true)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !231, line: 834, size: 128, elements: !355)
!355 = !{!356, !357}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !354, file: !231, line: 836, baseType: !73, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !354, file: !231, line: 837, baseType: !14, size: 64, offset: 64)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "nslots", scope: !230, file: !231, line: 843, type: !18, isLocal: true, isDefinition: true)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(name: "slotvec0", scope: !230, file: !231, line: 844, type: !354, isLocal: true, isDefinition: true)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !363, size: 704, elements: !364)
!363 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!364 = !{!365}
!365 = !DISubrange(count: 11)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !368, file: !369, line: 26, type: !371, isDefinition: true)
!368 = distinct !DICompileUnit(language: DW_LANG_C99, file: !369, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !19, globals: !370, nameTableKind: None)
!369 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!370 = !{!366}
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 376, elements: !372)
!372 = !{!373}
!373 = !DISubrange(count: 47)
!374 = distinct !DICompileUnit(language: DW_LANG_C99, file: !375, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !376, retainedTypes: !380, nameTableKind: None)
!375 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!376 = !{!377}
!377 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !375, line: 40, baseType: !6, size: 32, elements: !378)
!378 = !{!379}
!379 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!380 = !{!10, !381, !71}
!381 = !DISubprogram(name: "fputs_unlocked", scope: !21, file: !21, line: 662, type: !382, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !19)
!382 = !DISubroutineType(types: !383)
!383 = !{!18, !16, !384}
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !26, line: 49, size: 1728, elements: !386)
!386 = !{!387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !385, file: !26, line: 51, baseType: !18, size: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !385, file: !26, line: 54, baseType: !14, size: 64, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !385, file: !26, line: 55, baseType: !14, size: 64, offset: 128)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !385, file: !26, line: 56, baseType: !14, size: 64, offset: 192)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !385, file: !26, line: 57, baseType: !14, size: 64, offset: 256)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !385, file: !26, line: 58, baseType: !14, size: 64, offset: 320)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !385, file: !26, line: 59, baseType: !14, size: 64, offset: 384)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !385, file: !26, line: 60, baseType: !14, size: 64, offset: 448)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !385, file: !26, line: 61, baseType: !14, size: 64, offset: 512)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !385, file: !26, line: 64, baseType: !14, size: 64, offset: 576)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !385, file: !26, line: 65, baseType: !14, size: 64, offset: 640)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !385, file: !26, line: 66, baseType: !14, size: 64, offset: 704)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !385, file: !26, line: 68, baseType: !41, size: 64, offset: 768)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !385, file: !26, line: 70, baseType: !384, size: 64, offset: 832)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !385, file: !26, line: 72, baseType: !18, size: 32, offset: 896)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !385, file: !26, line: 73, baseType: !18, size: 32, offset: 928)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !385, file: !26, line: 74, baseType: !47, size: 64, offset: 960)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !385, file: !26, line: 77, baseType: !51, size: 16, offset: 1024)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !385, file: !26, line: 78, baseType: !53, size: 8, offset: 1040)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !385, file: !26, line: 79, baseType: !55, size: 8, offset: 1048)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !385, file: !26, line: 81, baseType: !59, size: 64, offset: 1088)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !385, file: !26, line: 89, baseType: !62, size: 64, offset: 1152)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !385, file: !26, line: 91, baseType: !64, size: 64, offset: 1216)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !385, file: !26, line: 92, baseType: !67, size: 64, offset: 1280)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !385, file: !26, line: 93, baseType: !384, size: 64, offset: 1344)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !385, file: !26, line: 94, baseType: !71, size: 64, offset: 1408)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !385, file: !26, line: 95, baseType: !73, size: 64, offset: 1472)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !385, file: !26, line: 96, baseType: !18, size: 32, offset: 1536)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !385, file: !26, line: 98, baseType: !78, size: 160, offset: 1568)
!416 = distinct !DICompileUnit(language: DW_LANG_C99, file: !417, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !418, retainedTypes: !431, nameTableKind: None)
!417 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!418 = !{!419}
!419 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !420, file: !268, line: 186, baseType: !6, size: 32, elements: !429)
!420 = distinct !DISubprogram(name: "x2nrealloc", scope: !268, file: !268, line: 174, type: !421, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !416, retainedNodes: !424)
!421 = !DISubroutineType(types: !422)
!422 = !{!71, !71, !423, !73}
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!424 = !{!425, !426, !427, !428}
!425 = !DILocalVariable(name: "p", arg: 1, scope: !420, file: !268, line: 174, type: !71)
!426 = !DILocalVariable(name: "pn", arg: 2, scope: !420, file: !268, line: 174, type: !423)
!427 = !DILocalVariable(name: "s", arg: 3, scope: !420, file: !268, line: 174, type: !73)
!428 = !DILocalVariable(name: "n", scope: !420, file: !268, line: 176, type: !73)
!429 = !{!430}
!430 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!431 = !{!73, !331, !328, !332, !14, !289, !71, !432, !435}
!432 = !DISubprogram(name: "xcalloc", scope: !268, file: !268, line: 57, type: !433, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !19)
!433 = !DISubroutineType(types: !434)
!434 = !{!71, !75, !75}
!435 = !DISubprogram(name: "rpl_calloc", scope: !436, file: !436, line: 688, type: !433, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !19)
!436 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!437 = distinct !DICompileUnit(language: DW_LANG_C99, file: !438, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !19, retainedTypes: !439, nameTableKind: None)
!438 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!439 = !{!10, !173}
!440 = distinct !DICompileUnit(language: DW_LANG_C99, file: !441, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !19, retainedTypes: !442, nameTableKind: None)
!441 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!442 = !{!71}
!443 = distinct !DICompileUnit(language: DW_LANG_C99, file: !444, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !19, retainedTypes: !445, nameTableKind: None)
!444 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!445 = !{!446, !73, !458}
!446 = !DISubprogram(name: "mbrtowc", scope: !315, file: !315, line: 296, type: !447, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !19)
!447 = !DISubroutineType(types: !448)
!448 = !{!75, !115, !16, !75, !449}
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !301, line: 13, size: 64, elements: !451)
!451 = !{!452, !453}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !450, file: !301, line: 15, baseType: !18, size: 32)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !450, file: !301, line: 20, baseType: !454, size: 32, offset: 32)
!454 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !450, file: !301, line: 16, size: 32, elements: !455)
!455 = !{!456, !457}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !454, file: !301, line: 18, baseType: !6, size: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !454, file: !301, line: 19, baseType: !309, size: 32)
!458 = !DISubprogram(name: "hard_locale", scope: !459, file: !459, line: 26, type: !460, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !19)
!459 = !DIFile(filename: "./lib/hard-locale.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!460 = !DISubroutineType(types: !461)
!461 = !{!180, !18}
!462 = distinct !DICompileUnit(language: DW_LANG_C99, file: !463, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !19, retainedTypes: !464, nameTableKind: None)
!463 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!464 = !{!465}
!465 = !DISubprogram(name: "rpl_fclose", scope: !466, file: !466, line: 672, type: !467, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !19)
!466 = !DIFile(filename: "./lib/stdio.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!467 = !DISubroutineType(types: !468)
!468 = !{!18, !469}
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !26, line: 49, size: 1728, elements: !471)
!471 = !{!472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !470, file: !26, line: 51, baseType: !18, size: 32)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !470, file: !26, line: 54, baseType: !14, size: 64, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !470, file: !26, line: 55, baseType: !14, size: 64, offset: 128)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !470, file: !26, line: 56, baseType: !14, size: 64, offset: 192)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !470, file: !26, line: 57, baseType: !14, size: 64, offset: 256)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !470, file: !26, line: 58, baseType: !14, size: 64, offset: 320)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !470, file: !26, line: 59, baseType: !14, size: 64, offset: 384)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !470, file: !26, line: 60, baseType: !14, size: 64, offset: 448)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !470, file: !26, line: 61, baseType: !14, size: 64, offset: 512)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !470, file: !26, line: 64, baseType: !14, size: 64, offset: 576)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !470, file: !26, line: 65, baseType: !14, size: 64, offset: 640)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !470, file: !26, line: 66, baseType: !14, size: 64, offset: 704)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !470, file: !26, line: 68, baseType: !41, size: 64, offset: 768)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !470, file: !26, line: 70, baseType: !469, size: 64, offset: 832)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !470, file: !26, line: 72, baseType: !18, size: 32, offset: 896)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !470, file: !26, line: 73, baseType: !18, size: 32, offset: 928)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !470, file: !26, line: 74, baseType: !47, size: 64, offset: 960)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !470, file: !26, line: 77, baseType: !51, size: 16, offset: 1024)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !470, file: !26, line: 78, baseType: !53, size: 8, offset: 1040)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !470, file: !26, line: 79, baseType: !55, size: 8, offset: 1048)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !470, file: !26, line: 81, baseType: !59, size: 64, offset: 1088)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !470, file: !26, line: 89, baseType: !62, size: 64, offset: 1152)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !470, file: !26, line: 91, baseType: !64, size: 64, offset: 1216)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !470, file: !26, line: 92, baseType: !67, size: 64, offset: 1280)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !470, file: !26, line: 93, baseType: !469, size: 64, offset: 1344)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !470, file: !26, line: 94, baseType: !71, size: 64, offset: 1408)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !470, file: !26, line: 95, baseType: !73, size: 64, offset: 1472)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !470, file: !26, line: 96, baseType: !18, size: 32, offset: 1536)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !470, file: !26, line: 98, baseType: !78, size: 160, offset: 1568)
!501 = distinct !DICompileUnit(language: DW_LANG_C99, file: !502, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !19, retainedTypes: !503, nameTableKind: None)
!502 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!503 = !{!504}
!504 = !DISubprogram(name: "setlocale_null_r", scope: !505, file: !505, line: 64, type: !506, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !19)
!505 = !DIFile(filename: "./lib/setlocale_null.h", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!506 = !DISubroutineType(types: !507)
!507 = !{!18, !18, !14, !75}
!508 = distinct !DICompileUnit(language: DW_LANG_C99, file: !509, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !510, retainedTypes: !897, nameTableKind: None)
!509 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!510 = !{!511}
!511 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !512, line: 41, baseType: !6, size: 32, elements: !513)
!512 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!513 = !{!514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896}
!514 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!515 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!516 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!517 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!518 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!519 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!520 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!521 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!522 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!523 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!524 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!525 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!526 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!527 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!528 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!529 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!530 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!531 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!532 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!533 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!534 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!535 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!536 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!537 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!538 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!539 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!540 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!541 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!542 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!543 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!544 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!545 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!546 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!547 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!548 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!549 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!550 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!551 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!552 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!553 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!554 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!555 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!556 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!557 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!558 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!559 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!560 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!561 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!562 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!563 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!564 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!565 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!566 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!567 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!568 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!569 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!570 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!571 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!572 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!573 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!574 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!575 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!576 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!577 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!578 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!579 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!580 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!581 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!582 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!583 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!584 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!585 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!586 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!587 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!588 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!589 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!590 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!591 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!592 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!593 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!594 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!595 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!596 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!597 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!598 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!599 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!600 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!601 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!602 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!603 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!604 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!605 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!606 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!607 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!608 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!609 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!610 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!611 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!612 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!613 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!614 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!615 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!616 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!617 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!618 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!619 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!620 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!621 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!622 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!623 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!624 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!625 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!626 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!627 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!628 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!629 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!630 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!631 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!632 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!633 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!634 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!635 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!636 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!637 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!638 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!639 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!640 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!641 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!642 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!643 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!644 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!645 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!646 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!647 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!648 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!649 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!650 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!651 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!652 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!653 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!654 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!655 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!656 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!657 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!658 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!659 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!660 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!661 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!662 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!663 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!664 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!665 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!666 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!667 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!668 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!669 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!670 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!671 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!672 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!673 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!674 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!675 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!676 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!677 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!678 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!679 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!680 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!681 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!682 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!683 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!684 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!685 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!686 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!687 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!688 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!689 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!690 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!691 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!692 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!693 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!694 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!695 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!696 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!697 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!698 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!699 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!700 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!701 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!702 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!703 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!704 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!705 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!706 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!707 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!708 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!709 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!710 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!711 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!712 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!713 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!714 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!715 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!716 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!717 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!718 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!719 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!720 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!721 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!722 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!723 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!724 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!725 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!726 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!727 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!728 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!729 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!730 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!731 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!732 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!733 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!734 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!735 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!736 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!737 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!738 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!739 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!740 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!741 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!742 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!743 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!744 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!745 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!746 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!747 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!748 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!749 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!750 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!751 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!752 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!753 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!754 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!755 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!756 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!757 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!758 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!759 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!760 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!761 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!762 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!763 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!764 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!765 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!766 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!767 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!768 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!769 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!770 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!771 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!772 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!773 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!774 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!775 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!776 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!777 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!778 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!779 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!780 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!781 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!782 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!783 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!784 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!785 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!786 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!787 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!788 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!789 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!790 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!791 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!792 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!793 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!794 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!795 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!796 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!797 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!798 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!799 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!800 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!801 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!802 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!803 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!804 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!805 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!806 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!807 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!808 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!809 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!810 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!811 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!812 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!813 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!814 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!815 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!816 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!817 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!818 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!819 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!820 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!821 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!822 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!823 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!824 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!825 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!826 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!827 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!828 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!829 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!830 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!831 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!832 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!833 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!834 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!835 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!836 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!837 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!838 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!839 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!840 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!841 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!842 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!843 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!844 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!845 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!846 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!847 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!848 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!849 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!850 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!851 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!852 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!853 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!854 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!855 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!856 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!857 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!858 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!859 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!860 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!861 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!862 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!863 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!864 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!865 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!866 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!867 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!868 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!869 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!870 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!871 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!872 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!873 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!874 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!875 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!876 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!877 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!878 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!879 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!880 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!881 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!882 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!883 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!884 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!885 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!886 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!887 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!888 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!889 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!890 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!891 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!892 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!893 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!894 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!895 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!896 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!897 = !{!898, !71}
!898 = !DISubprogram(name: "nl_langinfo", scope: !512, file: !512, line: 661, type: !899, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !19)
!899 = !DISubroutineType(types: !900)
!900 = !{!14, !18}
!901 = distinct !DICompileUnit(language: DW_LANG_C99, file: !902, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !19, retainedTypes: !903, nameTableKind: None)
!902 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!903 = !{!71, !85}
!904 = distinct !DICompileUnit(language: DW_LANG_C99, file: !905, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !19, retainedTypes: !906, nameTableKind: None)
!905 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!906 = !{!907, !942, !943, !947}
!907 = !DISubprogram(name: "fileno", scope: !21, file: !21, line: 786, type: !908, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !19)
!908 = !DISubroutineType(types: !909)
!909 = !{!18, !910}
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !26, line: 49, size: 1728, elements: !912)
!912 = !{!913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !911, file: !26, line: 51, baseType: !18, size: 32)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !911, file: !26, line: 54, baseType: !14, size: 64, offset: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !911, file: !26, line: 55, baseType: !14, size: 64, offset: 128)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !911, file: !26, line: 56, baseType: !14, size: 64, offset: 192)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !911, file: !26, line: 57, baseType: !14, size: 64, offset: 256)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !911, file: !26, line: 58, baseType: !14, size: 64, offset: 320)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !911, file: !26, line: 59, baseType: !14, size: 64, offset: 384)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !911, file: !26, line: 60, baseType: !14, size: 64, offset: 448)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !911, file: !26, line: 61, baseType: !14, size: 64, offset: 512)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !911, file: !26, line: 64, baseType: !14, size: 64, offset: 576)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !911, file: !26, line: 65, baseType: !14, size: 64, offset: 640)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !911, file: !26, line: 66, baseType: !14, size: 64, offset: 704)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !911, file: !26, line: 68, baseType: !41, size: 64, offset: 768)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !911, file: !26, line: 70, baseType: !910, size: 64, offset: 832)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !911, file: !26, line: 72, baseType: !18, size: 32, offset: 896)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !911, file: !26, line: 73, baseType: !18, size: 32, offset: 928)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !911, file: !26, line: 74, baseType: !47, size: 64, offset: 960)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !911, file: !26, line: 77, baseType: !51, size: 16, offset: 1024)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !911, file: !26, line: 78, baseType: !53, size: 8, offset: 1040)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !911, file: !26, line: 79, baseType: !55, size: 8, offset: 1048)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !911, file: !26, line: 81, baseType: !59, size: 64, offset: 1088)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !911, file: !26, line: 89, baseType: !62, size: 64, offset: 1152)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !911, file: !26, line: 91, baseType: !64, size: 64, offset: 1216)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !911, file: !26, line: 92, baseType: !67, size: 64, offset: 1280)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !911, file: !26, line: 93, baseType: !910, size: 64, offset: 1344)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !911, file: !26, line: 94, baseType: !71, size: 64, offset: 1408)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !911, file: !26, line: 95, baseType: !73, size: 64, offset: 1472)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !911, file: !26, line: 96, baseType: !18, size: 32, offset: 1536)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !911, file: !26, line: 98, baseType: !78, size: 160, offset: 1568)
!942 = !DISubprogram(name: "fclose", scope: !21, file: !21, line: 213, type: !908, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !19)
!943 = !DISubprogram(name: "lseek", scope: !944, file: !944, line: 334, type: !945, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !19)
!944 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!945 = !DISubroutineType(types: !946)
!946 = !{!49, !18, !49, !18}
!947 = !DISubprogram(name: "rpl_fflush", scope: !466, file: !466, line: 718, type: !908, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !19)
!948 = distinct !DICompileUnit(language: DW_LANG_C99, file: !949, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !19, retainedTypes: !950, nameTableKind: None)
!949 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!950 = !{!71, !951, !986}
!951 = !DISubprogram(name: "fflush", scope: !21, file: !21, line: 218, type: !952, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !19)
!952 = !DISubroutineType(types: !953)
!953 = !{!18, !954}
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !26, line: 49, size: 1728, elements: !956)
!956 = !{!957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !955, file: !26, line: 51, baseType: !18, size: 32)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !955, file: !26, line: 54, baseType: !14, size: 64, offset: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !955, file: !26, line: 55, baseType: !14, size: 64, offset: 128)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !955, file: !26, line: 56, baseType: !14, size: 64, offset: 192)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !955, file: !26, line: 57, baseType: !14, size: 64, offset: 256)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !955, file: !26, line: 58, baseType: !14, size: 64, offset: 320)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !955, file: !26, line: 59, baseType: !14, size: 64, offset: 384)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !955, file: !26, line: 60, baseType: !14, size: 64, offset: 448)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !955, file: !26, line: 61, baseType: !14, size: 64, offset: 512)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !955, file: !26, line: 64, baseType: !14, size: 64, offset: 576)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !955, file: !26, line: 65, baseType: !14, size: 64, offset: 640)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !955, file: !26, line: 66, baseType: !14, size: 64, offset: 704)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !955, file: !26, line: 68, baseType: !41, size: 64, offset: 768)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !955, file: !26, line: 70, baseType: !954, size: 64, offset: 832)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !955, file: !26, line: 72, baseType: !18, size: 32, offset: 896)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !955, file: !26, line: 73, baseType: !18, size: 32, offset: 928)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !955, file: !26, line: 74, baseType: !47, size: 64, offset: 960)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !955, file: !26, line: 77, baseType: !51, size: 16, offset: 1024)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !955, file: !26, line: 78, baseType: !53, size: 8, offset: 1040)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !955, file: !26, line: 79, baseType: !55, size: 8, offset: 1048)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !955, file: !26, line: 81, baseType: !59, size: 64, offset: 1088)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !955, file: !26, line: 89, baseType: !62, size: 64, offset: 1152)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !955, file: !26, line: 91, baseType: !64, size: 64, offset: 1216)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !955, file: !26, line: 92, baseType: !67, size: 64, offset: 1280)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !955, file: !26, line: 93, baseType: !954, size: 64, offset: 1344)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !955, file: !26, line: 94, baseType: !71, size: 64, offset: 1408)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !955, file: !26, line: 95, baseType: !73, size: 64, offset: 1472)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !955, file: !26, line: 96, baseType: !18, size: 32, offset: 1536)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !955, file: !26, line: 98, baseType: !78, size: 160, offset: 1568)
!986 = !DISubprogram(name: "rpl_fseeko", scope: !466, file: !466, line: 1034, type: !987, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !19)
!987 = !DISubroutineType(types: !988)
!988 = !{!18, !954, !49, !18}
!989 = distinct !DICompileUnit(language: DW_LANG_C99, file: !990, producer: "clang version 10.0.0 ", isOptimized: true, emissionKind: FullDebug, enums: !19, retainedTypes: !991, nameTableKind: None)
!990 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/Desktop/go/src/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!991 = !{!71, !992, !943, !1027}
!992 = !DISubprogram(name: "fileno", scope: !21, file: !21, line: 786, type: !993, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !19)
!993 = !DISubroutineType(types: !994)
!994 = !{!18, !995}
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !26, line: 49, size: 1728, elements: !997)
!997 = !{!998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !996, file: !26, line: 51, baseType: !18, size: 32)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !996, file: !26, line: 54, baseType: !14, size: 64, offset: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !996, file: !26, line: 55, baseType: !14, size: 64, offset: 128)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !996, file: !26, line: 56, baseType: !14, size: 64, offset: 192)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !996, file: !26, line: 57, baseType: !14, size: 64, offset: 256)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !996, file: !26, line: 58, baseType: !14, size: 64, offset: 320)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !996, file: !26, line: 59, baseType: !14, size: 64, offset: 384)
