source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_codecvt = type opaque
%struct._IO_marker = type opaque
%struct._IO_wide_data = type opaque
%struct.__dirstream = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%struct.file_name = type { i8*, i64, i8* }
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%union.anon = type { i32 }

@stderr = external local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [23 x i8] c"Usage: %s [OPTION]...\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 41, type: !32, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !4, retainedTypes: !24, globals: !31, nameTableKind: None)
!3 = !DIFile(filename: "src/pwd.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!4 = !{!5, !20}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!9 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 112, baseType: !7, size: 32, elements: !22)
!21 = !DIFile(filename: "src/system.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!22 = !{!23}
!23 = !DIEnumerator(name: "NOT_AN_INODE_NUMBER", value: 0, isUnsigned: true)
!24 = !{!25, !26, !28}
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !29, line: 46, baseType: !30)
!29 = !DIFile(filename: "/usr/lib/clang/12.0.1/include/stddef.h", directory: "")
!30 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!31 = !{!0}
!32 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 1280, elements: !45)
!33 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !35, line: 50, size: 256, elements: !36)
!35 = !DIFile(filename: "/usr/include/bits/getopt_ext.h", directory: "")
!36 = !{!37, !40, !42, !44}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !34, file: !35, line: 52, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !34, file: !35, line: 55, baseType: !41, size: 32, offset: 64)
!41 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !34, file: !35, line: 56, baseType: !43, size: 64, offset: 128)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !34, file: !35, line: 57, baseType: !41, size: 32, offset: 192)
!45 = !{!46}
!46 = !DISubrange(count: 5)
!47 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression())
!48 = distinct !DIGlobalVariable(name: "Version", scope: !49, file: !50, line: 2, type: !38, isDefinition: true)
!49 = distinct !DICompileUnit(language: DW_LANG_C99, file: !50, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !51, globals: !52, nameTableKind: None)
!50 = !DIFile(filename: "src/version.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!51 = !{}
!52 = !{!47}
!53 = !DIGlobalVariableExpression(var: !54, expr: !DIExpression())
!54 = distinct !DIGlobalVariable(name: "file_name", scope: !55, file: !56, line: 46, type: !38, isLocal: true, isDefinition: true)
!55 = distinct !DICompileUnit(language: DW_LANG_C99, file: !56, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !51, globals: !57, nameTableKind: None)
!56 = !DIFile(filename: "lib/closeout.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!57 = !{!53, !58}
!58 = !DIGlobalVariableExpression(var: !59, expr: !DIExpression())
!59 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !55, file: !56, line: 56, type: !60, isLocal: true, isDefinition: true)
!60 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!62 = distinct !DIGlobalVariable(name: "exit_failure", scope: !63, file: !64, line: 24, type: !66, isDefinition: true)
!63 = distinct !DICompileUnit(language: DW_LANG_C99, file: !64, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !51, globals: !65, nameTableKind: None)
!64 = !DIFile(filename: "lib/exitfail.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!65 = !{!61}
!66 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !41)
!67 = !DIGlobalVariableExpression(var: !68, expr: !DIExpression())
!68 = distinct !DIGlobalVariable(name: "program_name", scope: !69, file: !70, line: 33, type: !38, isDefinition: true)
!69 = distinct !DICompileUnit(language: DW_LANG_C99, file: !70, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !51, retainedTypes: !71, globals: !72, nameTableKind: None)
!70 = !DIFile(filename: "lib/progname.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!71 = !{!25, !26}
!72 = !{!67}
!73 = !DIGlobalVariableExpression(var: !74, expr: !DIExpression())
!74 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !75, file: !76, line: 85, type: !137, isDefinition: true)
!75 = distinct !DICompileUnit(language: DW_LANG_C99, file: !76, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !77, retainedTypes: !98, globals: !100, nameTableKind: None)
!76 = !DIFile(filename: "lib/quotearg.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!77 = !{!5, !78, !83}
!78 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, baseType: !7, size: 32, elements: !79)
!79 = !{!80, !81, !82}
!80 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!81 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!82 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!83 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !84, line: 46, baseType: !7, size: 32, elements: !85)
!84 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!85 = !{!86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97}
!86 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!87 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!88 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!89 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!90 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!91 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!92 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!93 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!94 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!95 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!96 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!97 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!98 = !{!41, !99, !28, !26}
!99 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!100 = !{!73, !101, !107, !119, !121, !126, !133, !135}
!101 = !DIGlobalVariableExpression(var: !102, expr: !DIExpression())
!102 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !75, file: !76, line: 101, type: !103, isDefinition: true)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 320, elements: !105)
!104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!105 = !{!106}
!106 = !DISubrange(count: 10)
!107 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression())
!108 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !75, file: !76, line: 1052, type: !109, isDefinition: true)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !76, line: 65, size: 448, elements: !110)
!110 = !{!111, !112, !113, !117, !118}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !109, file: !76, line: 68, baseType: !5, size: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !109, file: !76, line: 71, baseType: !41, size: 32, offset: 32)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !109, file: !76, line: 75, baseType: !114, size: 256, offset: 64)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 8)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !109, file: !76, line: 78, baseType: !38, size: 64, offset: 320)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !109, file: !76, line: 81, baseType: !38, size: 64, offset: 384)
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !75, file: !76, line: 116, type: !109, isLocal: true, isDefinition: true)
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(name: "slot0", scope: !75, file: !76, line: 842, type: !123, isLocal: true, isDefinition: true)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 2048, elements: !124)
!124 = !{!125}
!125 = !DISubrange(count: 256)
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(name: "slotvec", scope: !75, file: !76, line: 845, type: !128, isLocal: true, isDefinition: true)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !76, line: 834, size: 128, elements: !130)
!130 = !{!131, !132}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !129, file: !76, line: 836, baseType: !28, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !129, file: !76, line: 837, baseType: !26, size: 64, offset: 64)
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(name: "nslots", scope: !75, file: !76, line: 843, type: !41, isLocal: true, isDefinition: true)
!135 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression())
!136 = distinct !DIGlobalVariable(name: "slotvec0", scope: !75, file: !76, line: 844, type: !129, isLocal: true, isDefinition: true)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 704, elements: !139)
!138 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!139 = !{!140}
!140 = !DISubrange(count: 11)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !143, file: !144, line: 26, type: !146, isDefinition: true)
!143 = distinct !DICompileUnit(language: DW_LANG_C99, file: !144, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !51, globals: !145, nameTableKind: None)
!144 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!145 = !{!141}
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 376, elements: !147)
!147 = !{!148}
!148 = !DISubrange(count: 47)
!149 = distinct !DICompileUnit(language: DW_LANG_C99, file: !150, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !51, nameTableKind: None)
!150 = !DIFile(filename: "lib/root-dev-ino.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!151 = distinct !DICompileUnit(language: DW_LANG_C99, file: !152, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !153, retainedTypes: !157, nameTableKind: None)
!152 = !DIFile(filename: "lib/version-etc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!153 = !{!154}
!154 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !152, line: 40, baseType: !7, size: 32, elements: !155)
!155 = !{!156}
!156 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2020, isUnsigned: true)
!157 = !{!25}
!158 = distinct !DICompileUnit(language: DW_LANG_C99, file: !159, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !160, retainedTypes: !174, nameTableKind: None)
!159 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!160 = !{!161}
!161 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !163, file: !162, line: 186, baseType: !7, size: 32, elements: !172)
!162 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!163 = distinct !DISubprogram(name: "x2nrealloc", scope: !162, file: !162, line: 174, type: !164, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !158, retainedNodes: !167)
!164 = !DISubroutineType(types: !165)
!165 = !{!25, !25, !166, !28}
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!167 = !{!168, !169, !170, !171}
!168 = !DILocalVariable(name: "p", arg: 1, scope: !163, file: !162, line: 174, type: !25)
!169 = !DILocalVariable(name: "pn", arg: 2, scope: !163, file: !162, line: 174, type: !166)
!170 = !DILocalVariable(name: "s", arg: 3, scope: !163, file: !162, line: 174, type: !28)
!171 = !DILocalVariable(name: "n", scope: !163, file: !162, line: 176, type: !28)
!172 = !{!173}
!173 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128, isUnsigned: true)
!174 = !{!28, !26, !25}
!175 = distinct !DICompileUnit(language: DW_LANG_C99, file: !176, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !51, nameTableKind: None)
!176 = !DIFile(filename: "lib/xalloc-die.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!177 = distinct !DICompileUnit(language: DW_LANG_C99, file: !178, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !51, nameTableKind: None)
!178 = !DIFile(filename: "lib/xgetcwd.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!179 = distinct !DICompileUnit(language: DW_LANG_C99, file: !180, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !51, retainedTypes: !157, nameTableKind: None)
!180 = !DIFile(filename: "lib/calloc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!181 = distinct !DICompileUnit(language: DW_LANG_C99, file: !182, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !51, retainedTypes: !183, nameTableKind: None)
!182 = !DIFile(filename: "lib/mbrtowc.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!183 = !{!28}
!184 = distinct !DICompileUnit(language: DW_LANG_C99, file: !185, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !51, nameTableKind: None)
!185 = !DIFile(filename: "lib/close-stream.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!186 = distinct !DICompileUnit(language: DW_LANG_C99, file: !187, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !51, nameTableKind: None)
!187 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!188 = distinct !DICompileUnit(language: DW_LANG_C99, file: !189, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !190, retainedTypes: !157, nameTableKind: None)
!189 = !DIFile(filename: "lib/localcharset.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!190 = !{!191}
!191 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !192, line: 41, baseType: !7, size: 32, elements: !193)
!192 = !DIFile(filename: "/usr/include/langinfo.h", directory: "")
!193 = !{!194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576}
!194 = !DIEnumerator(name: "ABDAY_1", value: 131072, isUnsigned: true)
!195 = !DIEnumerator(name: "ABDAY_2", value: 131073, isUnsigned: true)
!196 = !DIEnumerator(name: "ABDAY_3", value: 131074, isUnsigned: true)
!197 = !DIEnumerator(name: "ABDAY_4", value: 131075, isUnsigned: true)
!198 = !DIEnumerator(name: "ABDAY_5", value: 131076, isUnsigned: true)
!199 = !DIEnumerator(name: "ABDAY_6", value: 131077, isUnsigned: true)
!200 = !DIEnumerator(name: "ABDAY_7", value: 131078, isUnsigned: true)
!201 = !DIEnumerator(name: "DAY_1", value: 131079, isUnsigned: true)
!202 = !DIEnumerator(name: "DAY_2", value: 131080, isUnsigned: true)
!203 = !DIEnumerator(name: "DAY_3", value: 131081, isUnsigned: true)
!204 = !DIEnumerator(name: "DAY_4", value: 131082, isUnsigned: true)
!205 = !DIEnumerator(name: "DAY_5", value: 131083, isUnsigned: true)
!206 = !DIEnumerator(name: "DAY_6", value: 131084, isUnsigned: true)
!207 = !DIEnumerator(name: "DAY_7", value: 131085, isUnsigned: true)
!208 = !DIEnumerator(name: "ABMON_1", value: 131086, isUnsigned: true)
!209 = !DIEnumerator(name: "ABMON_2", value: 131087, isUnsigned: true)
!210 = !DIEnumerator(name: "ABMON_3", value: 131088, isUnsigned: true)
!211 = !DIEnumerator(name: "ABMON_4", value: 131089, isUnsigned: true)
!212 = !DIEnumerator(name: "ABMON_5", value: 131090, isUnsigned: true)
!213 = !DIEnumerator(name: "ABMON_6", value: 131091, isUnsigned: true)
!214 = !DIEnumerator(name: "ABMON_7", value: 131092, isUnsigned: true)
!215 = !DIEnumerator(name: "ABMON_8", value: 131093, isUnsigned: true)
!216 = !DIEnumerator(name: "ABMON_9", value: 131094, isUnsigned: true)
!217 = !DIEnumerator(name: "ABMON_10", value: 131095, isUnsigned: true)
!218 = !DIEnumerator(name: "ABMON_11", value: 131096, isUnsigned: true)
!219 = !DIEnumerator(name: "ABMON_12", value: 131097, isUnsigned: true)
!220 = !DIEnumerator(name: "MON_1", value: 131098, isUnsigned: true)
!221 = !DIEnumerator(name: "MON_2", value: 131099, isUnsigned: true)
!222 = !DIEnumerator(name: "MON_3", value: 131100, isUnsigned: true)
!223 = !DIEnumerator(name: "MON_4", value: 131101, isUnsigned: true)
!224 = !DIEnumerator(name: "MON_5", value: 131102, isUnsigned: true)
!225 = !DIEnumerator(name: "MON_6", value: 131103, isUnsigned: true)
!226 = !DIEnumerator(name: "MON_7", value: 131104, isUnsigned: true)
!227 = !DIEnumerator(name: "MON_8", value: 131105, isUnsigned: true)
!228 = !DIEnumerator(name: "MON_9", value: 131106, isUnsigned: true)
!229 = !DIEnumerator(name: "MON_10", value: 131107, isUnsigned: true)
!230 = !DIEnumerator(name: "MON_11", value: 131108, isUnsigned: true)
!231 = !DIEnumerator(name: "MON_12", value: 131109, isUnsigned: true)
!232 = !DIEnumerator(name: "AM_STR", value: 131110, isUnsigned: true)
!233 = !DIEnumerator(name: "PM_STR", value: 131111, isUnsigned: true)
!234 = !DIEnumerator(name: "D_T_FMT", value: 131112, isUnsigned: true)
!235 = !DIEnumerator(name: "D_FMT", value: 131113, isUnsigned: true)
!236 = !DIEnumerator(name: "T_FMT", value: 131114, isUnsigned: true)
!237 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115, isUnsigned: true)
!238 = !DIEnumerator(name: "ERA", value: 131116, isUnsigned: true)
!239 = !DIEnumerator(name: "__ERA_YEAR", value: 131117, isUnsigned: true)
!240 = !DIEnumerator(name: "ERA_D_FMT", value: 131118, isUnsigned: true)
!241 = !DIEnumerator(name: "ALT_DIGITS", value: 131119, isUnsigned: true)
!242 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120, isUnsigned: true)
!243 = !DIEnumerator(name: "ERA_T_FMT", value: 131121, isUnsigned: true)
!244 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122, isUnsigned: true)
!245 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123, isUnsigned: true)
!246 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124, isUnsigned: true)
!247 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125, isUnsigned: true)
!248 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126, isUnsigned: true)
!249 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127, isUnsigned: true)
!250 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128, isUnsigned: true)
!251 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129, isUnsigned: true)
!252 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130, isUnsigned: true)
!253 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131, isUnsigned: true)
!254 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132, isUnsigned: true)
!255 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133, isUnsigned: true)
!256 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134, isUnsigned: true)
!257 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135, isUnsigned: true)
!258 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136, isUnsigned: true)
!259 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137, isUnsigned: true)
!260 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138, isUnsigned: true)
!261 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139, isUnsigned: true)
!262 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140, isUnsigned: true)
!263 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141, isUnsigned: true)
!264 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142, isUnsigned: true)
!265 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143, isUnsigned: true)
!266 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144, isUnsigned: true)
!267 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145, isUnsigned: true)
!268 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146, isUnsigned: true)
!269 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147, isUnsigned: true)
!270 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148, isUnsigned: true)
!271 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149, isUnsigned: true)
!272 = !DIEnumerator(name: "_NL_WMON_1", value: 131150, isUnsigned: true)
!273 = !DIEnumerator(name: "_NL_WMON_2", value: 131151, isUnsigned: true)
!274 = !DIEnumerator(name: "_NL_WMON_3", value: 131152, isUnsigned: true)
!275 = !DIEnumerator(name: "_NL_WMON_4", value: 131153, isUnsigned: true)
!276 = !DIEnumerator(name: "_NL_WMON_5", value: 131154, isUnsigned: true)
!277 = !DIEnumerator(name: "_NL_WMON_6", value: 131155, isUnsigned: true)
!278 = !DIEnumerator(name: "_NL_WMON_7", value: 131156, isUnsigned: true)
!279 = !DIEnumerator(name: "_NL_WMON_8", value: 131157, isUnsigned: true)
!280 = !DIEnumerator(name: "_NL_WMON_9", value: 131158, isUnsigned: true)
!281 = !DIEnumerator(name: "_NL_WMON_10", value: 131159, isUnsigned: true)
!282 = !DIEnumerator(name: "_NL_WMON_11", value: 131160, isUnsigned: true)
!283 = !DIEnumerator(name: "_NL_WMON_12", value: 131161, isUnsigned: true)
!284 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162, isUnsigned: true)
!285 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163, isUnsigned: true)
!286 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164, isUnsigned: true)
!287 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165, isUnsigned: true)
!288 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166, isUnsigned: true)
!289 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167, isUnsigned: true)
!290 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168, isUnsigned: true)
!291 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169, isUnsigned: true)
!292 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170, isUnsigned: true)
!293 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171, isUnsigned: true)
!294 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172, isUnsigned: true)
!295 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173, isUnsigned: true)
!296 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174, isUnsigned: true)
!297 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175, isUnsigned: true)
!298 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176, isUnsigned: true)
!299 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177, isUnsigned: true)
!300 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178, isUnsigned: true)
!301 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179, isUnsigned: true)
!302 = !DIEnumerator(name: "_DATE_FMT", value: 131180, isUnsigned: true)
!303 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181, isUnsigned: true)
!304 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182, isUnsigned: true)
!305 = !DIEnumerator(name: "__ALTMON_1", value: 131183, isUnsigned: true)
!306 = !DIEnumerator(name: "__ALTMON_2", value: 131184, isUnsigned: true)
!307 = !DIEnumerator(name: "__ALTMON_3", value: 131185, isUnsigned: true)
!308 = !DIEnumerator(name: "__ALTMON_4", value: 131186, isUnsigned: true)
!309 = !DIEnumerator(name: "__ALTMON_5", value: 131187, isUnsigned: true)
!310 = !DIEnumerator(name: "__ALTMON_6", value: 131188, isUnsigned: true)
!311 = !DIEnumerator(name: "__ALTMON_7", value: 131189, isUnsigned: true)
!312 = !DIEnumerator(name: "__ALTMON_8", value: 131190, isUnsigned: true)
!313 = !DIEnumerator(name: "__ALTMON_9", value: 131191, isUnsigned: true)
!314 = !DIEnumerator(name: "__ALTMON_10", value: 131192, isUnsigned: true)
!315 = !DIEnumerator(name: "__ALTMON_11", value: 131193, isUnsigned: true)
!316 = !DIEnumerator(name: "__ALTMON_12", value: 131194, isUnsigned: true)
!317 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195, isUnsigned: true)
!318 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196, isUnsigned: true)
!319 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197, isUnsigned: true)
!320 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198, isUnsigned: true)
!321 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199, isUnsigned: true)
!322 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200, isUnsigned: true)
!323 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201, isUnsigned: true)
!324 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202, isUnsigned: true)
!325 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203, isUnsigned: true)
!326 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204, isUnsigned: true)
!327 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205, isUnsigned: true)
!328 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206, isUnsigned: true)
!329 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207, isUnsigned: true)
!330 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208, isUnsigned: true)
!331 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209, isUnsigned: true)
!332 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210, isUnsigned: true)
!333 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211, isUnsigned: true)
!334 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212, isUnsigned: true)
!335 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213, isUnsigned: true)
!336 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214, isUnsigned: true)
!337 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215, isUnsigned: true)
!338 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216, isUnsigned: true)
!339 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217, isUnsigned: true)
!340 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218, isUnsigned: true)
!341 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219, isUnsigned: true)
!342 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220, isUnsigned: true)
!343 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221, isUnsigned: true)
!344 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222, isUnsigned: true)
!345 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223, isUnsigned: true)
!346 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224, isUnsigned: true)
!347 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225, isUnsigned: true)
!348 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226, isUnsigned: true)
!349 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227, isUnsigned: true)
!350 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228, isUnsigned: true)
!351 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229, isUnsigned: true)
!352 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230, isUnsigned: true)
!353 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231, isUnsigned: true)
!354 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608, isUnsigned: true)
!355 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609, isUnsigned: true)
!356 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610, isUnsigned: true)
!357 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611, isUnsigned: true)
!358 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612, isUnsigned: true)
!359 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613, isUnsigned: true)
!360 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614, isUnsigned: true)
!361 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615, isUnsigned: true)
!362 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616, isUnsigned: true)
!363 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617, isUnsigned: true)
!364 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618, isUnsigned: true)
!365 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619, isUnsigned: true)
!366 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620, isUnsigned: true)
!367 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621, isUnsigned: true)
!368 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622, isUnsigned: true)
!369 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623, isUnsigned: true)
!370 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624, isUnsigned: true)
!371 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625, isUnsigned: true)
!372 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626, isUnsigned: true)
!373 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627, isUnsigned: true)
!374 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0, isUnsigned: true)
!375 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1, isUnsigned: true)
!376 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2, isUnsigned: true)
!377 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3, isUnsigned: true)
!378 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4, isUnsigned: true)
!379 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5, isUnsigned: true)
!380 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6, isUnsigned: true)
!381 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7, isUnsigned: true)
!382 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8, isUnsigned: true)
!383 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9, isUnsigned: true)
!384 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10, isUnsigned: true)
!385 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11, isUnsigned: true)
!386 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12, isUnsigned: true)
!387 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13, isUnsigned: true)
!388 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14, isUnsigned: true)
!389 = !DIEnumerator(name: "CODESET", value: 14, isUnsigned: true)
!390 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15, isUnsigned: true)
!391 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16, isUnsigned: true)
!392 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17, isUnsigned: true)
!393 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18, isUnsigned: true)
!394 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19, isUnsigned: true)
!395 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20, isUnsigned: true)
!396 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21, isUnsigned: true)
!397 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22, isUnsigned: true)
!398 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23, isUnsigned: true)
!399 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24, isUnsigned: true)
!400 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25, isUnsigned: true)
!401 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26, isUnsigned: true)
!402 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27, isUnsigned: true)
!403 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28, isUnsigned: true)
!404 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29, isUnsigned: true)
!405 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30, isUnsigned: true)
!406 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31, isUnsigned: true)
!407 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32, isUnsigned: true)
!408 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33, isUnsigned: true)
!409 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34, isUnsigned: true)
!410 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35, isUnsigned: true)
!411 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36, isUnsigned: true)
!412 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37, isUnsigned: true)
!413 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38, isUnsigned: true)
!414 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39, isUnsigned: true)
!415 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40, isUnsigned: true)
!416 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41, isUnsigned: true)
!417 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42, isUnsigned: true)
!418 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43, isUnsigned: true)
!419 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44, isUnsigned: true)
!420 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45, isUnsigned: true)
!421 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46, isUnsigned: true)
!422 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47, isUnsigned: true)
!423 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48, isUnsigned: true)
!424 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49, isUnsigned: true)
!425 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50, isUnsigned: true)
!426 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51, isUnsigned: true)
!427 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52, isUnsigned: true)
!428 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53, isUnsigned: true)
!429 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54, isUnsigned: true)
!430 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55, isUnsigned: true)
!431 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56, isUnsigned: true)
!432 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57, isUnsigned: true)
!433 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58, isUnsigned: true)
!434 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59, isUnsigned: true)
!435 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60, isUnsigned: true)
!436 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61, isUnsigned: true)
!437 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62, isUnsigned: true)
!438 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63, isUnsigned: true)
!439 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64, isUnsigned: true)
!440 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65, isUnsigned: true)
!441 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66, isUnsigned: true)
!442 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67, isUnsigned: true)
!443 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68, isUnsigned: true)
!444 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69, isUnsigned: true)
!445 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70, isUnsigned: true)
!446 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71, isUnsigned: true)
!447 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72, isUnsigned: true)
!448 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73, isUnsigned: true)
!449 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74, isUnsigned: true)
!450 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75, isUnsigned: true)
!451 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76, isUnsigned: true)
!452 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77, isUnsigned: true)
!453 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78, isUnsigned: true)
!454 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79, isUnsigned: true)
!455 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80, isUnsigned: true)
!456 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81, isUnsigned: true)
!457 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82, isUnsigned: true)
!458 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83, isUnsigned: true)
!459 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84, isUnsigned: true)
!460 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85, isUnsigned: true)
!461 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86, isUnsigned: true)
!462 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144, isUnsigned: true)
!463 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145, isUnsigned: true)
!464 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146, isUnsigned: true)
!465 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147, isUnsigned: true)
!466 = !DIEnumerator(name: "__MON_GROUPING", value: 262148, isUnsigned: true)
!467 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149, isUnsigned: true)
!468 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150, isUnsigned: true)
!469 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151, isUnsigned: true)
!470 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152, isUnsigned: true)
!471 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153, isUnsigned: true)
!472 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154, isUnsigned: true)
!473 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155, isUnsigned: true)
!474 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156, isUnsigned: true)
!475 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157, isUnsigned: true)
!476 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158, isUnsigned: true)
!477 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159, isUnsigned: true)
!478 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160, isUnsigned: true)
!479 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161, isUnsigned: true)
!480 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162, isUnsigned: true)
!481 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163, isUnsigned: true)
!482 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164, isUnsigned: true)
!483 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165, isUnsigned: true)
!484 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166, isUnsigned: true)
!485 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167, isUnsigned: true)
!486 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168, isUnsigned: true)
!487 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169, isUnsigned: true)
!488 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170, isUnsigned: true)
!489 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171, isUnsigned: true)
!490 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172, isUnsigned: true)
!491 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173, isUnsigned: true)
!492 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174, isUnsigned: true)
!493 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175, isUnsigned: true)
!494 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176, isUnsigned: true)
!495 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177, isUnsigned: true)
!496 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178, isUnsigned: true)
!497 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179, isUnsigned: true)
!498 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180, isUnsigned: true)
!499 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181, isUnsigned: true)
!500 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182, isUnsigned: true)
!501 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183, isUnsigned: true)
!502 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184, isUnsigned: true)
!503 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185, isUnsigned: true)
!504 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186, isUnsigned: true)
!505 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187, isUnsigned: true)
!506 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188, isUnsigned: true)
!507 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189, isUnsigned: true)
!508 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190, isUnsigned: true)
!509 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536, isUnsigned: true)
!510 = !DIEnumerator(name: "RADIXCHAR", value: 65536, isUnsigned: true)
!511 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537, isUnsigned: true)
!512 = !DIEnumerator(name: "THOUSEP", value: 65537, isUnsigned: true)
!513 = !DIEnumerator(name: "__GROUPING", value: 65538, isUnsigned: true)
!514 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539, isUnsigned: true)
!515 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540, isUnsigned: true)
!516 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541, isUnsigned: true)
!517 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542, isUnsigned: true)
!518 = !DIEnumerator(name: "__YESEXPR", value: 327680, isUnsigned: true)
!519 = !DIEnumerator(name: "__NOEXPR", value: 327681, isUnsigned: true)
!520 = !DIEnumerator(name: "__YESSTR", value: 327682, isUnsigned: true)
!521 = !DIEnumerator(name: "__NOSTR", value: 327683, isUnsigned: true)
!522 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684, isUnsigned: true)
!523 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685, isUnsigned: true)
!524 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752, isUnsigned: true)
!525 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753, isUnsigned: true)
!526 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754, isUnsigned: true)
!527 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755, isUnsigned: true)
!528 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288, isUnsigned: true)
!529 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289, isUnsigned: true)
!530 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290, isUnsigned: true)
!531 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291, isUnsigned: true)
!532 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292, isUnsigned: true)
!533 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293, isUnsigned: true)
!534 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294, isUnsigned: true)
!535 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295, isUnsigned: true)
!536 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824, isUnsigned: true)
!537 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825, isUnsigned: true)
!538 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826, isUnsigned: true)
!539 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827, isUnsigned: true)
!540 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828, isUnsigned: true)
!541 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829, isUnsigned: true)
!542 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830, isUnsigned: true)
!543 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831, isUnsigned: true)
!544 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832, isUnsigned: true)
!545 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833, isUnsigned: true)
!546 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834, isUnsigned: true)
!547 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835, isUnsigned: true)
!548 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836, isUnsigned: true)
!549 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837, isUnsigned: true)
!550 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360, isUnsigned: true)
!551 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361, isUnsigned: true)
!552 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362, isUnsigned: true)
!553 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363, isUnsigned: true)
!554 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364, isUnsigned: true)
!555 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365, isUnsigned: true)
!556 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896, isUnsigned: true)
!557 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897, isUnsigned: true)
!558 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898, isUnsigned: true)
!559 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432, isUnsigned: true)
!560 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433, isUnsigned: true)
!561 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434, isUnsigned: true)
!562 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435, isUnsigned: true)
!563 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436, isUnsigned: true)
!564 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437, isUnsigned: true)
!565 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438, isUnsigned: true)
!566 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439, isUnsigned: true)
!567 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440, isUnsigned: true)
!568 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441, isUnsigned: true)
!569 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442, isUnsigned: true)
!570 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443, isUnsigned: true)
!571 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444, isUnsigned: true)
!572 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445, isUnsigned: true)
!573 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446, isUnsigned: true)
!574 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447, isUnsigned: true)
!575 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448, isUnsigned: true)
!576 = !DIEnumerator(name: "_NL_NUM", value: 786449, isUnsigned: true)
!577 = distinct !DICompileUnit(language: DW_LANG_C99, file: !578, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !51, retainedTypes: !157, nameTableKind: None)
!578 = !DIFile(filename: "lib/setlocale_null.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!579 = distinct !DICompileUnit(language: DW_LANG_C99, file: !580, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !51, nameTableKind: None)
!580 = !DIFile(filename: "lib/fclose.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!581 = distinct !DICompileUnit(language: DW_LANG_C99, file: !582, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !51, retainedTypes: !157, nameTableKind: None)
!582 = !DIFile(filename: "lib/fflush.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!583 = distinct !DICompileUnit(language: DW_LANG_C99, file: !584, producer: "clang version 12.0.1", isOptimized: true, emissionKind: FullDebug, enums: !51, retainedTypes: !157, nameTableKind: None)
!584 = !DIFile(filename: "lib/fseeko.c", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!585 = !{!"clang version 12.0.1"}
!586 = !{i32 7, !"Dwarf Version", i32 4}
!587 = !{i32 2, !"Debug Info Version", i32 3}
!588 = !{i32 1, !"wchar_size", i32 4}
!589 = !{i32 7, !"PIC Level", i32 2}
!590 = !{i32 7, !"PIE Level", i32 2}
!591 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 51, type: !592, scopeLine: 52, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !594)
!592 = !DISubroutineType(types: !593)
!593 = !{null, !41}
!594 = !{!595}
!595 = !DILocalVariable(name: "status", arg: 1, scope: !591, file: !3, line: 51, type: !41)
!596 = !DILocation(scope: !591)
!597 = !DILocation(line: 53, column: 14, scope: !598)
!598 = distinct !DILexicalBlock(scope: !591, file: !3, line: 53, column: 7)
!599 = !DILocation(line: 53, column: 7, scope: !591)
!600 = !DILocation(line: 54, column: 5, scope: !601)
!601 = distinct !DILexicalBlock(scope: !598, file: !3, line: 54, column: 5)
!602 = !{!603, !603, i64 0}
!603 = !{!"any pointer", !604, i64 0}
!604 = !{!"omnipotent char", !605, i64 0}
!605 = !{!"Simple C/C++ TBAA"}
!606 = !DILocation(line: 57, column: 7, scope: !607)
!607 = distinct !DILexicalBlock(scope: !598, file: !3, line: 56, column: 5)
!608 = !DILocation(line: 58, column: 7, scope: !607)
!609 = !DILocation(line: 62, column: 7, scope: !607)
!610 = !DILocation(line: 66, column: 7, scope: !607)
!611 = !DILocation(line: 67, column: 7, scope: !607)
!612 = !DILocation(line: 68, column: 7, scope: !607)
!613 = !DILocation(line: 71, column: 7, scope: !607)
!614 = !DILocalVariable(name: "program", arg: 1, scope: !615, file: !21, line: 634, type: !38)
!615 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !21, file: !21, line: 634, type: !616, scopeLine: 635, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !618)
!616 = !DISubroutineType(types: !617)
!617 = !{null, !38}
!618 = !{!614, !619, !628, !629, !631}
!619 = !DILocalVariable(name: "infomap", scope: !615, file: !21, line: 636, type: !620)
!620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !621, size: 896, elements: !626)
!621 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !622)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !615, file: !21, line: 636, size: 128, elements: !623)
!623 = !{!624, !625}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !622, file: !21, line: 636, baseType: !38, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !622, file: !21, line: 636, baseType: !38, size: 64, offset: 64)
!626 = !{!627}
!627 = !DISubrange(count: 7)
!628 = !DILocalVariable(name: "node", scope: !615, file: !21, line: 646, type: !38)
!629 = !DILocalVariable(name: "map_prog", scope: !615, file: !21, line: 647, type: !630)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!631 = !DILocalVariable(name: "lc_messages", scope: !615, file: !21, line: 659, type: !38)
!632 = !DILocation(scope: !615, inlinedAt: !633)
!633 = distinct !DILocation(line: 72, column: 7, scope: !607)
!634 = !DILocation(line: 636, column: 3, scope: !615, inlinedAt: !633)
!635 = !DILocation(line: 636, column: 67, scope: !615, inlinedAt: !633)
!636 = !DILocation(line: 647, column: 36, scope: !615, inlinedAt: !633)
!637 = !DILocation(line: 649, column: 3, scope: !615, inlinedAt: !633)
!638 = !DILocation(line: 649, column: 33, scope: !615, inlinedAt: !633)
!639 = !DILocation(line: 650, column: 13, scope: !615, inlinedAt: !633)
!640 = !DILocation(line: 649, column: 20, scope: !615, inlinedAt: !633)
!641 = !{!642, !603, i64 0}
!642 = !{!"infomap", !603, i64 0, !603, i64 8}
!643 = !DILocation(line: 649, column: 10, scope: !615, inlinedAt: !633)
!644 = !DILocation(line: 649, column: 28, scope: !615, inlinedAt: !633)
!645 = distinct !{!645, !637, !639, !646}
!646 = !{!"llvm.loop.mustprogress"}
!647 = !DILocation(line: 652, column: 17, scope: !648, inlinedAt: !633)
!648 = distinct !DILexicalBlock(scope: !615, file: !21, line: 652, column: 7)
!649 = !{!642, !603, i64 8}
!650 = !DILocation(line: 652, column: 7, scope: !648, inlinedAt: !633)
!651 = !DILocation(line: 652, column: 7, scope: !615, inlinedAt: !633)
!652 = !DILocation(line: 655, column: 3, scope: !615, inlinedAt: !633)
!653 = !DILocation(line: 659, column: 29, scope: !615, inlinedAt: !633)
!654 = !DILocation(line: 660, column: 7, scope: !655, inlinedAt: !633)
!655 = distinct !DILexicalBlock(scope: !615, file: !21, line: 660, column: 7)
!656 = !DILocation(line: 660, column: 19, scope: !655, inlinedAt: !633)
!657 = !DILocation(line: 660, column: 22, scope: !655, inlinedAt: !633)
!658 = !DILocation(line: 660, column: 7, scope: !615, inlinedAt: !633)
!659 = !DILocation(line: 666, column: 7, scope: !660, inlinedAt: !633)
!660 = distinct !DILexicalBlock(scope: !655, file: !21, line: 661, column: 5)
!661 = !DILocation(line: 668, column: 5, scope: !660, inlinedAt: !633)
!662 = !DILocation(line: 669, column: 3, scope: !615, inlinedAt: !633)
!663 = !DILocation(line: 671, column: 3, scope: !615, inlinedAt: !633)
!664 = !DILocation(line: 673, column: 1, scope: !615, inlinedAt: !633)
!665 = !DILocation(line: 74, column: 3, scope: !591)
!666 = !DISubprogram(name: "dcgettext", scope: !667, file: !667, line: 51, type: !668, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!667 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!668 = !DISubroutineType(types: !669)
!669 = !{!26, !38, !38, !41}
!670 = !DISubprogram(name: "fputs_unlocked", scope: !671, file: !671, line: 667, type: !672, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!671 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!672 = !DISubroutineType(types: !673)
!673 = !{!41, !38, !674}
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !676, line: 49, size: 1728, elements: !677)
!676 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!677 = !{!678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !693, !694, !695, !696, !700, !701, !703, !707, !710, !712, !715, !718, !719, !720, !721, !722}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !675, file: !676, line: 51, baseType: !41, size: 32)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !675, file: !676, line: 54, baseType: !26, size: 64, offset: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !675, file: !676, line: 55, baseType: !26, size: 64, offset: 128)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !675, file: !676, line: 56, baseType: !26, size: 64, offset: 192)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !675, file: !676, line: 57, baseType: !26, size: 64, offset: 256)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !675, file: !676, line: 58, baseType: !26, size: 64, offset: 320)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !675, file: !676, line: 59, baseType: !26, size: 64, offset: 384)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !675, file: !676, line: 60, baseType: !26, size: 64, offset: 448)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !675, file: !676, line: 61, baseType: !26, size: 64, offset: 512)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !675, file: !676, line: 64, baseType: !26, size: 64, offset: 576)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !675, file: !676, line: 65, baseType: !26, size: 64, offset: 640)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !675, file: !676, line: 66, baseType: !26, size: 64, offset: 704)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !675, file: !676, line: 68, baseType: !691, size: 64, offset: 768)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !676, line: 36, flags: DIFlagFwdDecl)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !675, file: !676, line: 70, baseType: !674, size: 64, offset: 832)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !675, file: !676, line: 72, baseType: !41, size: 32, offset: 896)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !675, file: !676, line: 73, baseType: !41, size: 32, offset: 928)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !675, file: !676, line: 74, baseType: !697, size: 64, offset: 960)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !698, line: 152, baseType: !699)
!698 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!699 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !675, file: !676, line: 77, baseType: !99, size: 16, offset: 1024)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !675, file: !676, line: 78, baseType: !702, size: 8, offset: 1040)
!702 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !675, file: !676, line: 79, baseType: !704, size: 8, offset: 1048)
!704 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 8, elements: !705)
!705 = !{!706}
!706 = !DISubrange(count: 1)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !675, file: !676, line: 81, baseType: !708, size: 64, offset: 1088)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !676, line: 43, baseType: null)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !675, file: !676, line: 89, baseType: !711, size: 64, offset: 1152)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !698, line: 153, baseType: !699)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !675, file: !676, line: 91, baseType: !713, size: 64, offset: 1216)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !676, line: 37, flags: DIFlagFwdDecl)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !675, file: !676, line: 92, baseType: !716, size: 64, offset: 1280)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !676, line: 38, flags: DIFlagFwdDecl)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !675, file: !676, line: 93, baseType: !674, size: 64, offset: 1344)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !675, file: !676, line: 94, baseType: !25, size: 64, offset: 1408)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !675, file: !676, line: 95, baseType: !28, size: 64, offset: 1472)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !675, file: !676, line: 96, baseType: !41, size: 32, offset: 1536)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !675, file: !676, line: 98, baseType: !723, size: 160, offset: 1568)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 160, elements: !724)
!724 = !{!725}
!725 = !DISubrange(count: 20)
!726 = !DISubprogram(name: "setlocale", scope: !727, file: !727, line: 122, type: !728, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!727 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!728 = !DISubroutineType(types: !729)
!729 = !{!26, !41, !38}
!730 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 327, type: !731, scopeLine: 328, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !734)
!731 = !DISubroutineType(types: !732)
!732 = !{!41, !41, !733}
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!734 = !{!735, !736, !737, !738, !739, !741}
!735 = !DILocalVariable(name: "argc", arg: 1, scope: !730, file: !3, line: 327, type: !41)
!736 = !DILocalVariable(name: "argv", arg: 2, scope: !730, file: !3, line: 327, type: !733)
!737 = !DILocalVariable(name: "wd", scope: !730, file: !3, line: 329, type: !26)
!738 = !DILocalVariable(name: "logical", scope: !730, file: !3, line: 333, type: !60)
!739 = !DILocalVariable(name: "c", scope: !740, file: !3, line: 345, type: !41)
!740 = distinct !DILexicalBlock(scope: !730, file: !3, line: 344, column: 5)
!741 = !DILocalVariable(name: "file_name", scope: !742, file: !3, line: 387, type: !744)
!742 = distinct !DILexicalBlock(scope: !743, file: !3, line: 386, column: 5)
!743 = distinct !DILexicalBlock(scope: !730, file: !3, line: 380, column: 7)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_name", file: !3, line: 34, size: 192, elements: !746)
!746 = !{!747, !748, !749}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !745, file: !3, line: 36, baseType: !26, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "n_alloc", scope: !745, file: !3, line: 37, baseType: !28, size: 64, offset: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !745, file: !3, line: 38, baseType: !26, size: 64, offset: 128)
!750 = !DILocation(scope: !730)
!751 = !DILocation(line: 333, column: 19, scope: !730)
!752 = !DILocation(line: 333, column: 46, scope: !730)
!753 = !DILocation(line: 333, column: 8, scope: !730)
!754 = !DILocation(line: 336, column: 21, scope: !730)
!755 = !DILocation(line: 336, column: 3, scope: !730)
!756 = !DILocation(line: 337, column: 3, scope: !730)
!757 = !DILocation(line: 338, column: 3, scope: !730)
!758 = !DILocation(line: 339, column: 3, scope: !730)
!759 = !DILocation(line: 341, column: 3, scope: !730)
!760 = !DILocation(line: 343, column: 3, scope: !730)
!761 = !DILocation(line: 345, column: 15, scope: !740)
!762 = !DILocation(scope: !740)
!763 = !DILocation(line: 346, column: 11, scope: !740)
!764 = !DILocation(line: 355, column: 11, scope: !765)
!765 = distinct !DILexicalBlock(scope: !740, file: !3, line: 349, column: 9)
!766 = !DILocation(line: 357, column: 9, scope: !765)
!767 = !DILocation(line: 359, column: 9, scope: !765)
!768 = !DILocation(line: 362, column: 11, scope: !765)
!769 = !DILocation(line: 366, column: 7, scope: !770)
!770 = distinct !DILexicalBlock(scope: !730, file: !3, line: 366, column: 7)
!771 = !{!772, !772, i64 0}
!772 = !{!"int", !604, i64 0}
!773 = !DILocation(line: 366, column: 14, scope: !770)
!774 = !DILocation(line: 366, column: 7, scope: !730)
!775 = !DILocation(line: 367, column: 18, scope: !770)
!776 = !DILocation(line: 367, column: 5, scope: !770)
!777 = !DILocation(line: 369, column: 7, scope: !778)
!778 = distinct !DILexicalBlock(scope: !730, file: !3, line: 369, column: 7)
!779 = !DILocation(line: 369, column: 7, scope: !730)
!780 = !DILocation(line: 302, column: 3, scope: !781, inlinedAt: !825)
!781 = distinct !DISubprogram(name: "logical_getcwd", scope: !3, file: !3, line: 300, type: !782, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !784)
!782 = !DISubroutineType(types: !783)
!783 = !{!26}
!784 = !{!785, !822, !823, !824}
!785 = !DILocalVariable(name: "st1", scope: !781, file: !3, line: 302, type: !786)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !787, line: 26, size: 1152, elements: !788)
!787 = !DIFile(filename: "/usr/include/bits/struct_stat.h", directory: "")
!788 = !{!789, !791, !793, !795, !797, !799, !801, !802, !803, !804, !806, !808, !816, !817, !818}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !786, file: !787, line: 28, baseType: !790, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !698, line: 145, baseType: !30)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !786, file: !787, line: 33, baseType: !792, size: 64, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !698, line: 148, baseType: !30)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !786, file: !787, line: 41, baseType: !794, size: 64, offset: 128)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !698, line: 151, baseType: !30)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !786, file: !787, line: 42, baseType: !796, size: 32, offset: 192)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !698, line: 150, baseType: !7)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !786, file: !787, line: 44, baseType: !798, size: 32, offset: 224)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !698, line: 146, baseType: !7)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !786, file: !787, line: 45, baseType: !800, size: 32, offset: 256)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !698, line: 147, baseType: !7)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !786, file: !787, line: 47, baseType: !41, size: 32, offset: 288)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !786, file: !787, line: 49, baseType: !790, size: 64, offset: 320)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !786, file: !787, line: 54, baseType: !697, size: 64, offset: 384)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !786, file: !787, line: 58, baseType: !805, size: 64, offset: 448)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !698, line: 175, baseType: !699)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !786, file: !787, line: 60, baseType: !807, size: 64, offset: 512)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !698, line: 180, baseType: !699)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !786, file: !787, line: 71, baseType: !809, size: 128, offset: 576)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !810, line: 10, size: 128, elements: !811)
!810 = !DIFile(filename: "/usr/include/bits/types/struct_timespec.h", directory: "")
!811 = !{!812, !814}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !809, file: !810, line: 12, baseType: !813, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !698, line: 160, baseType: !699)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !809, file: !810, line: 16, baseType: !815, size: 64, offset: 64)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !698, line: 197, baseType: !699)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !786, file: !787, line: 72, baseType: !809, size: 128, offset: 704)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !786, file: !787, line: 73, baseType: !809, size: 128, offset: 832)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !786, file: !787, line: 86, baseType: !819, size: 192, offset: 960)
!819 = !DICompositeType(tag: DW_TAG_array_type, baseType: !815, size: 192, elements: !820)
!820 = !{!821}
!821 = !DISubrange(count: 3)
!822 = !DILocalVariable(name: "st2", scope: !781, file: !3, line: 303, type: !786)
!823 = !DILocalVariable(name: "wd", scope: !781, file: !3, line: 304, type: !26)
!824 = !DILocalVariable(name: "p", scope: !781, file: !3, line: 305, type: !26)
!825 = distinct !DILocation(line: 371, column: 12, scope: !826)
!826 = distinct !DILexicalBlock(scope: !778, file: !3, line: 370, column: 5)
!827 = !DILocation(line: 302, column: 15, scope: !781, inlinedAt: !825)
!828 = !DILocation(line: 303, column: 3, scope: !781, inlinedAt: !825)
!829 = !DILocation(line: 303, column: 15, scope: !781, inlinedAt: !825)
!830 = !DILocation(line: 304, column: 14, scope: !781, inlinedAt: !825)
!831 = !DILocation(scope: !781, inlinedAt: !825)
!832 = !DILocation(line: 308, column: 8, scope: !833, inlinedAt: !825)
!833 = distinct !DILexicalBlock(scope: !781, file: !3, line: 308, column: 7)
!834 = !DILocation(line: 308, column: 11, scope: !833, inlinedAt: !825)
!835 = !DILocation(line: 308, column: 14, scope: !833, inlinedAt: !825)
!836 = !{!604, !604, i64 0}
!837 = !DILocation(line: 308, column: 20, scope: !833, inlinedAt: !825)
!838 = !DILocation(line: 308, column: 7, scope: !781, inlinedAt: !825)
!839 = !DILocation(line: 311, column: 15, scope: !781, inlinedAt: !825)
!840 = !DILocation(line: 311, column: 3, scope: !781, inlinedAt: !825)
!841 = !DILocation(line: 313, column: 12, scope: !842, inlinedAt: !825)
!842 = distinct !DILexicalBlock(scope: !843, file: !3, line: 313, column: 11)
!843 = distinct !DILexicalBlock(scope: !781, file: !3, line: 312, column: 5)
!844 = !DILocation(line: 313, column: 17, scope: !842, inlinedAt: !825)
!845 = !DILocation(line: 314, column: 32, scope: !842, inlinedAt: !825)
!846 = !DILocation(line: 314, column: 37, scope: !842, inlinedAt: !825)
!847 = !DILocation(line: 316, column: 8, scope: !843, inlinedAt: !825)
!848 = distinct !{!848, !840, !849, !646}
!849 = !DILocation(line: 317, column: 5, scope: !781, inlinedAt: !825)
!850 = !DILocation(line: 320, column: 7, scope: !851, inlinedAt: !825)
!851 = distinct !DILexicalBlock(scope: !781, file: !3, line: 320, column: 7)
!852 = !DILocation(line: 320, column: 23, scope: !851, inlinedAt: !825)
!853 = !DILocation(line: 320, column: 28, scope: !851, inlinedAt: !825)
!854 = !DILocation(line: 320, column: 31, scope: !851, inlinedAt: !825)
!855 = !DILocation(line: 320, column: 48, scope: !851, inlinedAt: !825)
!856 = !DILocation(line: 320, column: 53, scope: !851, inlinedAt: !825)
!857 = !DILocation(line: 320, column: 56, scope: !851, inlinedAt: !825)
!858 = !{!859, !860, i64 8}
!859 = !{!"stat", !860, i64 0, !860, i64 8, !860, i64 16, !772, i64 24, !772, i64 28, !772, i64 32, !772, i64 36, !860, i64 40, !860, i64 48, !860, i64 56, !860, i64 64, !861, i64 72, !861, i64 88, !861, i64 104, !604, i64 120}
!860 = !{!"long", !604, i64 0}
!861 = !{!"timespec", !860, i64 0, !860, i64 8}
!862 = !{!859, !860, i64 0}
!863 = !DILocation(line: 320, column: 7, scope: !781, inlinedAt: !825)
!864 = !DILocation(line: 323, column: 1, scope: !781, inlinedAt: !825)
!865 = !DILocation(line: 372, column: 11, scope: !826)
!866 = !DILocation(line: 374, column: 11, scope: !867)
!867 = distinct !DILexicalBlock(scope: !868, file: !3, line: 373, column: 9)
!868 = distinct !DILexicalBlock(scope: !826, file: !3, line: 372, column: 11)
!869 = !DILocation(line: 375, column: 11, scope: !867)
!870 = !DILocation(line: 379, column: 8, scope: !730)
!871 = !DILocation(line: 380, column: 10, scope: !743)
!872 = !DILocation(line: 380, column: 7, scope: !730)
!873 = !DILocation(line: 382, column: 7, scope: !874)
!874 = distinct !DILexicalBlock(scope: !743, file: !3, line: 381, column: 5)
!875 = !DILocation(line: 383, column: 7, scope: !874)
!876 = !DILocation(line: 384, column: 5, scope: !874)
!877 = !DILocation(line: 87, column: 25, scope: !878, inlinedAt: !883)
!878 = distinct !DISubprogram(name: "file_name_init", scope: !3, file: !3, line: 85, type: !879, scopeLine: 86, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !881)
!879 = !DISubroutineType(types: !880)
!880 = !{!744}
!881 = !{!882}
!882 = !DILocalVariable(name: "p", scope: !878, file: !3, line: 87, type: !744)
!883 = distinct !DILocation(line: 387, column: 37, scope: !742)
!884 = !DILocation(scope: !878, inlinedAt: !883)
!885 = !DILocation(line: 91, column: 6, scope: !878, inlinedAt: !883)
!886 = !DILocation(line: 91, column: 14, scope: !878, inlinedAt: !883)
!887 = !{!888, !860, i64 8}
!888 = !{!"file_name", !603, i64 0, !860, i64 8, !603, i64 16}
!889 = !DILocation(line: 93, column: 12, scope: !878, inlinedAt: !883)
!890 = !DILocation(line: 93, column: 6, scope: !878, inlinedAt: !883)
!891 = !DILocation(line: 93, column: 10, scope: !878, inlinedAt: !883)
!892 = !{!888, !603, i64 0}
!893 = !DILocation(line: 94, column: 21, scope: !878, inlinedAt: !883)
!894 = !DILocation(line: 94, column: 6, scope: !878, inlinedAt: !883)
!895 = !DILocation(line: 94, column: 12, scope: !878, inlinedAt: !883)
!896 = !{!888, !603, i64 16}
!897 = !DILocation(line: 95, column: 15, scope: !878, inlinedAt: !883)
!898 = !DILocation(scope: !742)
!899 = !DILocalVariable(name: "file_name", arg: 1, scope: !900, file: !3, line: 268, type: !744)
!900 = distinct !DISubprogram(name: "robust_getcwd", scope: !3, file: !3, line: 268, type: !901, scopeLine: 269, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !903)
!901 = !DISubroutineType(types: !902)
!902 = !{null, !744}
!903 = !{!899, !904, !905, !914, !916}
!904 = !DILocalVariable(name: "height", scope: !900, file: !3, line: 270, type: !28)
!905 = !DILocalVariable(name: "dev_ino_buf", scope: !900, file: !3, line: 271, type: !906)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !907, line: 7, size: 128, elements: !908)
!907 = !DIFile(filename: "./lib/dev-ino.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!908 = !{!909, !912}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !906, file: !907, line: 9, baseType: !910, size: 64)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !911, line: 47, baseType: !792)
!911 = !DIFile(filename: "/usr/include/sys/types.h", directory: "")
!912 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !906, file: !907, line: 10, baseType: !913, size: 64, offset: 64)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !911, line: 59, baseType: !790)
!914 = !DILocalVariable(name: "root_dev_ino", scope: !900, file: !3, line: 272, type: !915)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!916 = !DILocalVariable(name: "dot_sb", scope: !900, file: !3, line: 273, type: !786)
!917 = !DILocation(scope: !900, inlinedAt: !918)
!918 = distinct !DILocation(line: 388, column: 7, scope: !742)
!919 = !DILocation(line: 271, column: 3, scope: !900, inlinedAt: !918)
!920 = !DILocation(line: 271, column: 18, scope: !900, inlinedAt: !918)
!921 = !DILocation(line: 272, column: 34, scope: !900, inlinedAt: !918)
!922 = !DILocation(line: 273, column: 3, scope: !900, inlinedAt: !918)
!923 = !DILocation(line: 273, column: 15, scope: !900, inlinedAt: !918)
!924 = !DILocation(line: 275, column: 20, scope: !925, inlinedAt: !918)
!925 = distinct !DILexicalBlock(scope: !900, file: !3, line: 275, column: 7)
!926 = !DILocation(line: 275, column: 7, scope: !900, inlinedAt: !918)
!927 = !DILocation(line: 276, column: 5, scope: !925, inlinedAt: !918)
!928 = !DILocation(line: 279, column: 7, scope: !929, inlinedAt: !918)
!929 = distinct !DILexicalBlock(scope: !900, file: !3, line: 279, column: 7)
!930 = !DILocation(line: 279, column: 27, scope: !929, inlinedAt: !918)
!931 = !DILocation(line: 279, column: 7, scope: !900, inlinedAt: !918)
!932 = !DILocation(line: 282, column: 3, scope: !900, inlinedAt: !918)
!933 = !DILocation(line: 280, column: 5, scope: !929, inlinedAt: !918)
!934 = !DILocation(line: 285, column: 11, scope: !935, inlinedAt: !918)
!935 = distinct !DILexicalBlock(scope: !936, file: !3, line: 285, column: 11)
!936 = distinct !DILexicalBlock(scope: !900, file: !3, line: 283, column: 5)
!937 = !{!938, !860, i64 0}
!938 = !{!"dev_ino", !860, i64 0, !860, i64 8}
!939 = !{!938, !860, i64 8}
!940 = !DILocation(line: 285, column: 11, scope: !936, inlinedAt: !918)
!941 = !DILocation(line: 288, column: 49, scope: !936, inlinedAt: !918)
!942 = !DILocalVariable(name: "dot_sb", arg: 1, scope: !943, file: !3, line: 153, type: !946)
!943 = distinct !DISubprogram(name: "find_dir_entry", scope: !3, file: !3, line: 153, type: !944, scopeLine: 155, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !947)
!944 = !DISubroutineType(types: !945)
!945 = !{null, !946, !744, !28}
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!947 = !{!942, !948, !949, !950, !955, !956, !957, !958, !959, !972, !973, !974}
!948 = !DILocalVariable(name: "file_name", arg: 2, scope: !943, file: !3, line: 153, type: !744)
!949 = !DILocalVariable(name: "parent_height", arg: 3, scope: !943, file: !3, line: 154, type: !28)
!950 = !DILocalVariable(name: "dirp", scope: !943, file: !3, line: 156, type: !951)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !953, line: 127, baseType: !954)
!953 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!954 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !953, line: 127, flags: DIFlagFwdDecl)
!955 = !DILocalVariable(name: "fd", scope: !943, file: !3, line: 157, type: !41)
!956 = !DILocalVariable(name: "parent_sb", scope: !943, file: !3, line: 158, type: !786)
!957 = !DILocalVariable(name: "use_lstat", scope: !943, file: !3, line: 159, type: !60)
!958 = !DILocalVariable(name: "found", scope: !943, file: !3, line: 160, type: !60)
!959 = !DILocalVariable(name: "dp", scope: !960, file: !3, line: 183, type: !961)
!960 = distinct !DILexicalBlock(scope: !943, file: !3, line: 182, column: 5)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !963)
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !964, line: 22, size: 2240, elements: !965)
!964 = !DIFile(filename: "/usr/include/bits/dirent.h", directory: "")
!965 = !{!966, !967, !968, !969, !971}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !963, file: !964, line: 25, baseType: !792, size: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !963, file: !964, line: 26, baseType: !697, size: 64, offset: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !963, file: !964, line: 31, baseType: !99, size: 16, offset: 128)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !963, file: !964, line: 32, baseType: !970, size: 8, offset: 144)
!970 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !963, file: !964, line: 33, baseType: !123, size: 2048, offset: 152)
!972 = !DILocalVariable(name: "ent_sb", scope: !960, file: !3, line: 184, type: !786)
!973 = !DILocalVariable(name: "ino", scope: !960, file: !3, line: 185, type: !910)
!974 = !DILocalVariable(name: "e", scope: !975, file: !3, line: 193, type: !41)
!975 = distinct !DILexicalBlock(scope: !976, file: !3, line: 191, column: 13)
!976 = distinct !DILexicalBlock(scope: !977, file: !3, line: 190, column: 15)
!977 = distinct !DILexicalBlock(scope: !978, file: !3, line: 189, column: 9)
!978 = distinct !DILexicalBlock(scope: !960, file: !3, line: 188, column: 11)
!979 = !DILocation(scope: !943, inlinedAt: !980)
!980 = distinct !DILocation(line: 288, column: 7, scope: !936, inlinedAt: !918)
!981 = !DILocation(line: 158, column: 3, scope: !943, inlinedAt: !980)
!982 = !DILocation(line: 158, column: 15, scope: !943, inlinedAt: !980)
!983 = !DILocation(line: 162, column: 10, scope: !943, inlinedAt: !980)
!984 = !DILocation(line: 163, column: 12, scope: !985, inlinedAt: !980)
!985 = distinct !DILexicalBlock(scope: !943, file: !3, line: 163, column: 7)
!986 = !DILocation(line: 163, column: 7, scope: !943, inlinedAt: !980)
!987 = !DILocation(line: 164, column: 5, scope: !985, inlinedAt: !980)
!988 = !DILocation(line: 167, column: 8, scope: !943, inlinedAt: !980)
!989 = !DILocation(line: 168, column: 10, scope: !990, inlinedAt: !980)
!990 = distinct !DILexicalBlock(scope: !943, file: !3, line: 168, column: 7)
!991 = !DILocation(line: 168, column: 8, scope: !990, inlinedAt: !980)
!992 = !DILocation(line: 168, column: 18, scope: !990, inlinedAt: !980)
!993 = !DILocation(line: 168, column: 46, scope: !990, inlinedAt: !980)
!994 = !DILocation(line: 168, column: 7, scope: !943, inlinedAt: !980)
!995 = !DILocation(line: 168, column: 32, scope: !990, inlinedAt: !980)
!996 = !DILocation(line: 169, column: 5, scope: !990, inlinedAt: !980)
!997 = !DILocation(line: 172, column: 18, scope: !998, inlinedAt: !980)
!998 = distinct !DILexicalBlock(scope: !943, file: !3, line: 172, column: 7)
!999 = !DILocation(line: 172, column: 8, scope: !998, inlinedAt: !980)
!1000 = !DILocation(line: 172, column: 43, scope: !998, inlinedAt: !980)
!1001 = !DILocation(line: 172, column: 67, scope: !998, inlinedAt: !980)
!1002 = !DILocation(line: 172, column: 7, scope: !943, inlinedAt: !980)
!1003 = !DILocation(line: 173, column: 5, scope: !998, inlinedAt: !980)
!1004 = !DILocation(line: 178, column: 26, scope: !943, inlinedAt: !980)
!1005 = !DILocation(line: 178, column: 44, scope: !943, inlinedAt: !980)
!1006 = !DILocation(line: 178, column: 33, scope: !943, inlinedAt: !980)
!1007 = !DILocation(line: 184, column: 7, scope: !960, inlinedAt: !980)
!1008 = !DILocation(line: 184, column: 19, scope: !960, inlinedAt: !980)
!1009 = !DILocation(line: 187, column: 7, scope: !960, inlinedAt: !980)
!1010 = !DILocation(line: 187, column: 13, scope: !960, inlinedAt: !980)
!1011 = !DILocalVariable(name: "dirp", arg: 1, scope: !1012, file: !21, line: 278, type: !951)
!1012 = distinct !DISubprogram(name: "readdir_ignoring_dot_and_dotdot", scope: !21, file: !21, line: 278, type: !1013, scopeLine: 279, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1015)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!961, !951}
!1015 = !{!1011, !1016}
!1016 = !DILocalVariable(name: "dp", scope: !1017, file: !21, line: 282, type: !961)
!1017 = distinct !DILexicalBlock(scope: !1012, file: !21, line: 281, column: 5)
!1018 = !DILocation(scope: !1012, inlinedAt: !1019)
!1019 = distinct !DILocation(line: 188, column: 17, scope: !978, inlinedAt: !980)
!1020 = !DILocation(line: 282, column: 33, scope: !1017, inlinedAt: !1019)
!1021 = !DILocation(scope: !1017, inlinedAt: !1019)
!1022 = !DILocation(line: 283, column: 14, scope: !1023, inlinedAt: !1019)
!1023 = distinct !DILexicalBlock(scope: !1017, file: !21, line: 283, column: 11)
!1024 = !DILocation(line: 283, column: 22, scope: !1023, inlinedAt: !1019)
!1025 = !DILocation(line: 283, column: 42, scope: !1023, inlinedAt: !1019)
!1026 = !DILocalVariable(name: "file_name", arg: 1, scope: !1027, file: !21, line: 265, type: !38)
!1027 = distinct !DISubprogram(name: "dot_or_dotdot", scope: !21, file: !21, line: 265, type: !1028, scopeLine: 266, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1030)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!60, !38}
!1030 = !{!1026, !1031}
!1031 = !DILocalVariable(name: "sep", scope: !1032, file: !21, line: 269, type: !27)
!1032 = distinct !DILexicalBlock(scope: !1033, file: !21, line: 268, column: 5)
!1033 = distinct !DILexicalBlock(scope: !1027, file: !21, line: 267, column: 7)
!1034 = !DILocation(scope: !1027, inlinedAt: !1035)
!1035 = distinct !DILocation(line: 283, column: 27, scope: !1023, inlinedAt: !1019)
!1036 = !DILocation(line: 267, column: 7, scope: !1033, inlinedAt: !1035)
!1037 = !DILocation(line: 267, column: 20, scope: !1033, inlinedAt: !1035)
!1038 = !DILocation(line: 267, column: 7, scope: !1027, inlinedAt: !1035)
!1039 = !DILocation(line: 269, column: 29, scope: !1032, inlinedAt: !1035)
!1040 = !DILocation(line: 269, column: 42, scope: !1032, inlinedAt: !1035)
!1041 = !DILocation(line: 269, column: 18, scope: !1032, inlinedAt: !1035)
!1042 = !DILocation(scope: !1032, inlinedAt: !1035)
!1043 = !DILocation(line: 283, column: 11, scope: !1017, inlinedAt: !1019)
!1044 = !DILocation(scope: !960, inlinedAt: !980)
!1045 = !DILocation(line: 190, column: 15, scope: !976, inlinedAt: !980)
!1046 = !DILocation(line: 190, column: 15, scope: !977, inlinedAt: !980)
!1047 = !DILocation(scope: !975, inlinedAt: !980)
!1048 = !DILocation(line: 194, column: 15, scope: !975, inlinedAt: !980)
!1049 = !DILocation(line: 195, column: 21, scope: !975, inlinedAt: !980)
!1050 = !DILocation(line: 226, column: 5, scope: !943, inlinedAt: !980)
!1051 = !DILocation(line: 228, column: 20, scope: !1052, inlinedAt: !980)
!1052 = distinct !DILexicalBlock(scope: !943, file: !3, line: 228, column: 7)
!1053 = !DILocation(line: 203, column: 13, scope: !960, inlinedAt: !980)
!1054 = !{!1055, !860, i64 0}
!1055 = !{!"dirent", !860, i64 0, !860, i64 8, !1056, i64 16, !604, i64 18, !604, i64 19}
!1056 = !{!"short", !604, i64 0}
!1057 = !DILocation(line: 205, column: 15, scope: !1058, inlinedAt: !980)
!1058 = distinct !DILexicalBlock(scope: !960, file: !3, line: 205, column: 11)
!1059 = !DILocation(line: 205, column: 38, scope: !1058, inlinedAt: !980)
!1060 = !DILocation(line: 207, column: 15, scope: !1061, inlinedAt: !980)
!1061 = distinct !DILexicalBlock(scope: !1062, file: !3, line: 207, column: 15)
!1062 = distinct !DILexicalBlock(scope: !1058, file: !3, line: 206, column: 9)
!1063 = !DILocation(line: 207, column: 43, scope: !1061, inlinedAt: !980)
!1064 = !DILocation(line: 207, column: 15, scope: !1062, inlinedAt: !980)
!1065 = distinct !{!1065, !1066, !1050}
!1066 = !DILocation(line: 181, column: 3, scope: !943, inlinedAt: !980)
!1067 = !DILocation(line: 212, column: 24, scope: !1062, inlinedAt: !980)
!1068 = !DILocation(line: 213, column: 9, scope: !1062, inlinedAt: !980)
!1069 = !DILocation(line: 215, column: 15, scope: !1070, inlinedAt: !980)
!1070 = distinct !DILexicalBlock(scope: !960, file: !3, line: 215, column: 11)
!1071 = !DILocation(line: 215, column: 11, scope: !960, inlinedAt: !980)
!1072 = distinct !{!1072, !1066, !1050}
!1073 = !DILocation(line: 220, column: 24, scope: !1074, inlinedAt: !980)
!1074 = distinct !DILexicalBlock(scope: !960, file: !3, line: 220, column: 12)
!1075 = !DILocation(line: 222, column: 53, scope: !1076, inlinedAt: !980)
!1076 = distinct !DILexicalBlock(scope: !1074, file: !3, line: 221, column: 9)
!1077 = !DILocation(line: 222, column: 11, scope: !1076, inlinedAt: !980)
!1078 = !DILocation(line: 224, column: 11, scope: !1076, inlinedAt: !980)
!1079 = !DILocation(line: 228, column: 23, scope: !1052, inlinedAt: !980)
!1080 = !DILocation(line: 228, column: 39, scope: !1052, inlinedAt: !980)
!1081 = !DILocation(line: 228, column: 7, scope: !943, inlinedAt: !980)
!1082 = !DILocation(line: 232, column: 7, scope: !1083, inlinedAt: !980)
!1083 = distinct !DILexicalBlock(scope: !1052, file: !3, line: 229, column: 5)
!1084 = !DILocation(line: 236, column: 8, scope: !943, inlinedAt: !980)
!1085 = !DILocation(line: 237, column: 5, scope: !1086, inlinedAt: !980)
!1086 = distinct !DILexicalBlock(scope: !943, file: !3, line: 236, column: 8)
!1087 = !DILocation(line: 241, column: 13, scope: !943, inlinedAt: !980)
!1088 = !{i64 0, i64 8, !1089, i64 8, i64 8, !1089, i64 16, i64 8, !1089, i64 24, i64 4, !771, i64 28, i64 4, !771, i64 32, i64 4, !771, i64 36, i64 4, !771, i64 40, i64 8, !1089, i64 48, i64 8, !1089, i64 56, i64 8, !1089, i64 64, i64 8, !1089, i64 72, i64 8, !1089, i64 80, i64 8, !1089, i64 88, i64 8, !1089, i64 96, i64 8, !1089, i64 104, i64 8, !1089, i64 112, i64 8, !1089, i64 120, i64 24, !836}
!1089 = !{!860, !860, i64 0}
!1090 = !DILocation(line: 242, column: 1, scope: !943, inlinedAt: !980)
!1091 = distinct !{!1091, !932, !1092}
!1092 = !DILocation(line: 289, column: 5, scope: !900, inlinedAt: !918)
!1093 = !DILocation(line: 292, column: 18, scope: !1094, inlinedAt: !918)
!1094 = distinct !DILexicalBlock(scope: !900, file: !3, line: 292, column: 7)
!1095 = !DILocation(line: 292, column: 7, scope: !1094, inlinedAt: !918)
!1096 = !DILocation(line: 292, column: 27, scope: !1094, inlinedAt: !918)
!1097 = !DILocation(line: 292, column: 7, scope: !900, inlinedAt: !918)
!1098 = !DILocation(line: 293, column: 5, scope: !1094, inlinedAt: !918)
!1099 = !DILocation(line: 389, column: 24, scope: !742)
!1100 = !DILocation(line: 294, column: 1, scope: !900, inlinedAt: !918)
!1101 = !DILocation(line: 389, column: 7, scope: !742)
!1102 = !DILocalVariable(name: "p", arg: 1, scope: !1103, file: !3, line: 78, type: !744)
!1103 = distinct !DISubprogram(name: "file_name_free", scope: !3, file: !3, line: 78, type: !901, scopeLine: 79, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1104)
!1104 = !{!1102}
!1105 = !DILocation(scope: !1103, inlinedAt: !1106)
!1106 = distinct !DILocation(line: 390, column: 7, scope: !742)
!1107 = !DILocation(line: 80, column: 12, scope: !1103, inlinedAt: !1106)
!1108 = !DILocation(line: 80, column: 3, scope: !1103, inlinedAt: !1106)
!1109 = !DILocation(line: 81, column: 3, scope: !1103, inlinedAt: !1106)
!1110 = !DILocation(line: 394, column: 1, scope: !730)
!1111 = !DISubprogram(name: "getenv", scope: !1112, file: !1112, line: 634, type: !1113, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!1112 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!1113 = !DISubroutineType(types: !1114)
!1114 = !{!26, !38}
!1115 = !DISubprogram(name: "bindtextdomain", scope: !667, file: !667, line: 86, type: !1116, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!1116 = !DISubroutineType(types: !1117)
!1117 = !{!26, !38, !38}
!1118 = !DISubprogram(name: "textdomain", scope: !667, file: !667, line: 82, type: !1113, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!1119 = !DISubprogram(name: "atexit", scope: !1112, file: !1112, line: 595, type: !1120, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!1120 = !DISubroutineType(types: !1121)
!1121 = !{!41, !1122}
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64)
!1123 = !DISubroutineType(types: !1124)
!1124 = !{null}
!1125 = !DISubprogram(name: "getopt_long", scope: !35, file: !35, line: 66, type: !1126, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!1126 = !DISubroutineType(types: !1127)
!1127 = !{!41, !41, !1128, !38, !1130, !43}
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64)
!1129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!1131 = !DISubprogram(name: "error", scope: !1132, file: !1132, line: 52, type: !1133, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!1132 = !DIFile(filename: "./lib/error.h", directory: "/home/u/life/projects/github.com/llir/llvm/testdata/coreutils/coreutils-8.32")
!1133 = !DISubroutineType(types: !1134)
!1134 = !{null, !41, !41, !38, null}
!1135 = !DISubprogram(name: "stat", scope: !1136, file: !1136, line: 205, type: !1137, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!1136 = !DIFile(filename: "/usr/include/sys/stat.h", directory: "")
!1137 = !DISubroutineType(types: !1138)
!1138 = !{!41, !38, !946}
!1139 = !DISubprogram(name: "puts", scope: !671, file: !671, line: 637, type: !1140, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!1140 = !DISubroutineType(types: !1141)
!1141 = !{!41, !38}
!1142 = !DISubprogram(name: "opendir", scope: !953, file: !953, line: 134, type: !1143, isDefinition: false, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !51)
!1143 = !DISubroutineType(types: !1144)
!1144 = !{!1145, !38}
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!1146 = distinct !DISubprogram(name: "nth_parent", scope: !3, file: !3, line: 127, type: !1147, scopeLine: 128, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1149)
!1147 = !DISubroutineType(types: !1148)
!1148 = !{!26, !28}
!1149 = !{!1150, !1151, !1152, !1153}
!1150 = !DILocalVariable(name: "n", arg: 1, scope: !1146, file: !3, line: 127, type: !28)
!1151 = !DILocalVariable(name: "buf", scope: !1146, file: !3, line: 129, type: !26)
!1152 = !DILocalVariable(name: "p", scope: !1146, file: !3, line: 130, type: !26)
!1153 = !DILocalVariable(name: "i", scope: !1154, file: !3, line: 132, type: !28)
!1154 = distinct !DILexicalBlock(scope: !1146, file: !3, line: 132, column: 3)
!1155 = !DILocation(scope: !1146)
!1156 = !DILocalVariable(name: "n", arg: 1, scope: !1157, file: !162, line: 99, type: !28)
!1157 = distinct !DISubprogram(name: "xnmalloc", scope: !162, file: !162, line: 99, type: !1158, scopeLine: 100, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1160)
!1158 = !DISubroutineType(types: !1159)
!1159 = !{!25, !28, !28}
!1160 = !{!1156, !1161}
!1161 = !DILocalVariable(name: "s", arg: 2, scope: !1157, file: !162, line: 99, type: !28)
!1162 = !DILocation(scope: !1157, inlinedAt: !1163)
!1163 = distinct !DILocation(line: 129, column: 15, scope: !1146)
!1164 = !DILocation(line: 101, column: 7, scope: !1165, inlinedAt: !1163)
!1165 = distinct !DILexicalBlock(scope: !1157, file: !162, line: 101, column: 7)
!1166 = !DILocation(line: 101, column: 7, scope: !1157, inlinedAt: !1163)
!1167 = !DILocation(line: 102, column: 5, scope: !1165, inlinedAt: !1163)
!1168 = !DILocation(line: 103, column: 21, scope: !1157, inlinedAt: !1163)
!1169 = !DILocation(line: 103, column: 10, scope: !1157, inlinedAt: !1163)
!1170 = !DILocation(scope: !1154)
!1171 = !DILocation(line: 132, column: 24, scope: !1172)
!1172 = distinct !DILexicalBlock(scope: !1154, file: !3, line: 132, column: 3)
!1173 = !DILocation(line: 132, column: 3, scope: !1154)
!1174 = !DILocalVariable(name: "__dest", arg: 1, scope: !1175, file: !1176, line: 26, type: !1179)
